{"TopicId":155197,"ForumId":18,"TopicTitle":"Infinitum super-duper-mega-update 7/16/17","CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-18T14:42:42Z","PageNum":1,"Articles":[{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-18T14:42:42Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003EPlease read:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#ff0000;\u0022\u003EJust so we\u0027re clear, I\u0027m going to make this as accurate as possible.\u003C/span\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003E But come on, it\u0027s an alien civilization in the LMC, there\u0027s going to be inaccuracies.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#ff0000;\u0022\u003EI\u0027m still writing TCBW, don\u0027t worry. And please keep in mind this is the first draft, a lot will be rewritten in the published version if I can get it published.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo here goes;\n\u003C/p\u003E\n\u003Cp\u003E\nOver 300 years from now, the crew of the Infinitum travels through a Wormhole to create a new life for themselves but find themselves in the middle of an Interstellar conflict between three powerful Alien civilizations trying to lead a galactic alliance in the Large Magellanic Cloud.\n\u003C/p\u003E\n\u003Cp\u003E\nSo... Tell me what you guys think below, btw, this isn\u0027t going to be just a bunch of logs, but there will be some from time to time \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nChapter 1 (Will be integrated into a chapter in the middle of the book in the second draft)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nHello, the date is 2327 AD… I presume anyway; I’m not completely sure, to be honest. My name is Raven Gray. I am speaking to you from the Large Magellanic Cloud in the middle of a conflict between three powerful Alien civilizations as a representative for humanity. How did I get here? It’s a long story, but seeing as you are getting this 163,000 years from now in my point of view, I suppose I should explain everything, you may not have records that go back that far. It’s a long time after all.\n\u003C/p\u003E\n\u003Cp\u003E\nI was born on Mimas on December 13th, 2289 Earth time, my mother was a farmer, my father was an officer, and I was an only child. We grew up in an underground gravity ring that provided us with a half g, it was small and overpopulated, we were constantly exhausted, and both my parents were overworked.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I was 12, I saw someone beat another person to death. That’s when I decided to make a new life for myself, and leave Mimas for good.\n\u003C/p\u003E\n\u003Cp\u003E\nI self-taught myself math and science, and learned more about the \u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003ESolar System\u003C/a\u003E Alliances plan to build a Wormhole gate that had been in the works for over 30 years, and I knew that’s what I would do, I would enter the Wormhole, and \u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003Estart\u003C/a\u003E a new life away from humanity.\n\u003C/p\u003E\n\u003Cp\u003E\nAlong the way, my friend Karol joined me, and I made some more friends, like Morales, who’s great with piloting, and good for a joke, he was one of my closest friends, and now my husband. And Evan, an engineer, Karol, a Xenobiologist, and a few others. Together, we bought our way off Mimas, to a spaceport where we started to do \u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003Eodd jobs\u003C/a\u003E to pay off a spacecraft, at first it was just the eight of us, but more people joined until there were almost 140 others who wanted a better future.\n\u003C/p\u003E\n\u003Cp\u003E\nThen 14 years ago, we departed for the inner solar system where a Wormhole test was being conducted.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*     *    *    *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Morales, and I’m a sort of ambassador for humanity, traveling the LMC in style, with Raven, and my Alien buddies.  She asked me to make a short log that we would send to future Earth, so here goes.\n\u003C/p\u003E\n\u003Cp\u003E\nI was born in a spaceport orbiting Mimas, which is where I met Raven and a couple of her friends. She asked for help building a spacecraft so she could live a quiet life away from most of humanity. Well, at least she got away from humanity. I eventually joined her which was one of the best decisions I could’ve made. And over a few months, some of my friends joined up. It took us several years to claim a spacecraft, by that point, our little party had grown to a small colony. I was the pilot, and I was good at it. I sometimes traveled to Phoebe where we mined for ice and sometimes piloted ships going between there and Titan. That was fun enough, but I must say, going through a Wormhole sounded like an adventure. Our ship was crudely built but did its job well. And it was fun to fly. We had a ship, well over 100 crew, and a batexcrements crazy plan on leaving the solar system\n\u003C/p\u003E\n\u003Cp\u003E\nI don’t have any regrets.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd a message to future humans; please don’t get mad, I may have left a huge debt behind me when I left the solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nWhoops.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*     *    *   *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Karol, I speak on behalf of the human colony on Sigma Prime, while I assist in its development. I was asked to make a short log that we would send to you, although, if I’m being honest, by the time it reaches Earth, you’ll either be dead or so different from other humans, you may not even remember humans from so long ago. But here goes anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nI was born on Mimas and was friends with Raven as a kid, I also wanted to leave, as everywhere was too crowded for me, you wouldn’t really expect that in a closed colony, but I wasn’t the only one, that’s why many got jobs off-world. I grew up with my mother, she was the only one who took care of me since my father was killed in a riot when I was young. I assume she misses me, but she supported me all the same, even when I told her we would likely never see each other again. I sometimes think of her at night.\n\u003C/p\u003E\n\u003Cp\u003E\nGoing through that Wormhole was terrifying, and astonishing at the same time. The things I’ve seen, the places I’ve been, it’s all surreal. Sometimes I can’t believe this is really happening, it feels like a dream sometimes.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m also a Xenobiologist and work closely with several other Alien species, as they provide technology and knowledge for the colony. Before I left the solar system, I studied extraterrestrial life, whether it was the plant signatures we found on countless exoplanets or the simple microbes found under Europa’s and Enceladus’  crust, I was fascinated by Alien life. And now I work with several Alien species on a daily basis, which is the most exciting thing ever.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you’re still out there, take care of Earth for me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*     *    *    *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Xavier, and I’m a scientist working on a Spaceport in development above Sigma Prime, along with several Alien species who’re helping with our development. I’ve been asked to make a short log on your behalf.\n\u003C/p\u003E\n\u003Cp\u003E\nI was born on Enceladus, and both of my parents were Xenobiologists studying the life under the icy crust, they always encouraged me to follow my passion, mine was physics, I would sometimes stay up late doing random spacecraft propulsion calculations for fun, I was a weird kid.\n\u003C/p\u003E\n\u003Cp\u003E\nI met Raven while on a transfer to Mimas station, she was living on it with the dream of building her own spacecraft, entering a Wormhole, and making a new life. After a few hours of talking about it, I realized I wanted to go.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn’t make the ultimate decision overnight, I loved my parents very much, but the idea of an adventure such as that was so tempting, I had to go.\n\u003C/p\u003E\n\u003Cp\u003E\nA few months later, I said my goodbyes to my family and friends on Enceladus and moved to the Mimas station where I began to help pay our way to a spacecraft. I quickly became friends with Raven, and we’ve all grown to trust each other with our lives.\n\u003C/p\u003E\n\u003Cp\u003E\nTo future humans, keep flying, and godspeed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*    *    *    *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Evan, and I’m an engineer working on a spacedock in the Kelraks system, along with my girlfriend Felicity, who does EVA repairs, I’m also viewed as an ambassador there, and treated with interest. I was born on Mimas station, and since I was little, I’ve always had an affiliation with building something, my mom said when I was four, I took apart a broken radio and fixed it. Since then I’ve been working on some construction project.\n\u003C/p\u003E\n\u003Cp\u003E\nI met Raven through Morales, he and I were good friends since we were little kids, and usually got into a lot of trouble, when I found out he was going to go on some mission with her, I decided to join up.\n\u003C/p\u003E\n\u003Cp\u003E\nWe’ve been through a lot together, I really miss them sometimes, but we get together often, and communicate all the time.\n\u003C/p\u003E\n\u003Cp\u003E\nThat’s all I have to say, and now that I think about it, you guys are probably going to have a freakout session when you receive this message.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*    *    *    *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Lance, I’m a doctor working on the flagship Raven is on, she asked me to make a personal log to send to future humans, I honestly don’t know what to say. But I’ll try. I was born on Iapetus, living conditions weren’t very good there, so I moved between station in the Saturnian system, and learned how to become a doctor, when I went to the Mimas station, I met Morales at a bar, he was easy to talk to, and had a good sense of humor, we quickly became friends, and I came to that station often, about a year later, I found he was working on getting a spacecraft with Raven, and he asked me if I wanted to join, after she told me her plan, I decided to go. Then a few years later, we headed off to the Inner solar system to travel through a Wormhole.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here we are now, one crazy thing after another.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, that’s all I have, I wonder what crazy things humanity has been up to lately.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*    *   *   *   *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHey, my name is Sage, I’m working tactical on a spaceport above Sigma Prime, I’m an orphan, and I was born and raised on the Mimas station, where I met Raven, at first I thought she was insane, but the more she told me about it, the more it made sense to me.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from the real possibility of death that we were facing, but everything else checked out.\n\u003C/p\u003E\n\u003Cp\u003E\nWe sometimes butted heads, but she was a good friend, and Morales was a good guy, pretty funny, but really arrogant when he was drinking.\n\u003C/p\u003E\n\u003Cp\u003E\nWe’ve all changed a lot over the years, now separated across three different places, and dozens of light years plunked in the middle on an Alien conflict.\n\u003C/p\u003E\n\u003Cp\u003E\nLife’s funny like that sometimes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*    *    *    *    *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI’m Felicity, working on a Spaceport in the Kelraks home system as an EVA specialist along with my boyfriend Evan, he sent me a message from Raven who asked if we could make a log for future humans. Well, I was born in a station above Enceladus, where I met Xavier, he was eccentric, but a good friend who shared a lot with me, when I found out he was going to go on a crazy mission through a Wormhole, I thought he had a death wish, but after a few months, I decided otherwise. Before I left the station to join them, a huge riot on the station from an air shortage nearly led to its destruction and ended up killing people I knew, some closely. Xavier, Raven, and the others all helped me cope, and I’m more grateful than words can say.\n\u003C/p\u003E\n\u003Cp\u003E\nWhatever route humanity took back in the Milky Way, I hope you’ve grown better as a species, because the humanity I left was a mess most of the time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERaven’s Log\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo anyway, here’s everything that happened to us, from leaving the spaceport, to now.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is going to take awhile.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEnd of log\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-17T00:41:34Z\u0022 title=\u002207/17/2017 12:41  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 17, 2017\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2017-01-19T06:17:56Z","Content":"\n\u003Cp\u003E\nI like it! Well-handled brief exposition without feeling like an infodump. Though I noticed some grammar issues, I think I\u0027ll take those to PM; wouldn\u0027t want to congest the thread with transient things like that.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, the way your characters already have their own voices, in only the couple of paragraphs given, impresses me. I feel like mine end up all sounding like the same deadpan structure. Dunno how you do it, but I like it.\n\u003C/p\u003E\n\u003Cp\u003E\nAny \u0022howevers\u0022 are too early to really tell.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-19T11:45:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222926921\u0022 data-ipsquote-contentid=\u0022155197\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484806676\u0022 data-ipsquote-userid=\u0022110660\u0022 data-ipsquote-username=\u00220111narwhalz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, 0111narwhalz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003EI like it! Well-handled brief exposition without feeling like an infodump\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENow, the way your characters already have their own voices, in only the couple of paragraphs given, impresses me. I feel like mine end up all sounding like the same deadpan structure. Dunno how you do it, but I like it.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAny \u0022howevers\u0022 are too early to really tell.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor the first two paragraphs...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dstfp.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.reactiongifs.com/r/dstfp.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell, I hope there aren\u0027t many in the chapters following, but it\u0027s a first draft, so, there\u0027s probably going to be quite a lot in the future \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TotallyNotHuman","CreatedById":157240,"CreatedDateTime":"2017-01-20T10:15:54Z","Content":"\n\u003Cp\u003E\nOh gawd, emotion-chip!Data from \u003Cem\u003EGenerations\u003C/em\u003E. My thoughts exactly.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I read the first two, I was going \u003Cem\u003EThis does \u003C/em\u003Enot\u003Cem\u003E looks like Spaceception\u003C/em\u003E-esque\u003Cem\u003E grammar!\u003C/em\u003E No offense, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152800\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0022 rel=\u0022\u0022\u003E@Spaceception\u003C/a\u003E. But afterwards, the grammar\u0027s...eh.\n\u003C/p\u003E\n\u003Cp\u003E\nOther than grammar, (and as \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110660-0111narwhalz/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110660\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110660-0111narwhalz/\u0022 rel=\u0022\u0022\u003E@0111narwhalz\u003C/a\u003E said), the story\u0027s pretty good. Can\u0027t wait to see Chapter Deux.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-20T13:01:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222928305\u0022 data-ipsquote-contentid=\u0022155197\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484907354\u0022 data-ipsquote-userid=\u0022157240\u0022 data-ipsquote-username=\u0022TotallyNotHuman_\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, TotallyNotHuman_ said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh gawd, emotion-chip!Data from \u003Cem\u003EGenerations\u003C/em\u003E. My thoughts exactly.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I read the first two, I was going \u003Cem\u003EThis does \u003C/em\u003Enot\u003Cem\u003E looks like Spaceception\u003C/em\u003E-esque\u003Cem\u003E grammar!\u003C/em\u003E No offense, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152800\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0022 rel=\u0022\u0022\u003E@Spaceception\u003C/a\u003E. But afterwards, the grammar\u0027s...eh.\n\u003C/p\u003E\n\u003Cp\u003E\nOther than grammar, (and as \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110660-0111narwhalz/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110660\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110660-0111narwhalz/\u0022 rel=\u0022\u0022\u003E@0111narwhalz\u003C/a\u003E said), the story\u0027s pretty good. Can\u0027t wait to see Chapter Deux.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, like I said to  011narwhalz, grammar isn\u0027t high on my priority list right now (I am working on it though) since it is only the first draft, I just want to finish the story and see if you guys like it. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-20T17:20:48Z","Content":"\n\u003Cp\u003E\nChapter 2 Preparations\n\u003C/p\u003E\n\u003Cp\u003E\nTell me what you guys think \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E2313, Infinitum, in orbit above the Mimas spaceport\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven jogged down to the bridge, her feet clattering on the curved metal floor. “Alright everyone, we need to do a checklist before we leave the spaceport.” She said, walking across the bridge, and activating her comms set.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Roger that captain, antimatter propulsion system running nicely, fusion reactor humming like a kitten.” Radioed Evan from engineering.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Have you ever seen a kitten?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I’ve seen pictures, but pets are an Earth luxury.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Lance, how’s the crew?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Ready to go, everyone’s strapped in.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Morales, how’re we looking for spaceport departure?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe spaceport was almost a century old, and getting ready for retirement. Old pipes and broken or abandoned compartments dotted the 60-kilometer behemoth. And the Infinitum, despite being almost a kilometer long, looked small compared to the port. Over a dozen ships left or entered each day, some with hundreds or thousands of people migrating in between the Saturnian federation, or if you struck it rich, to the inner solar system.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales ran his hands through course hair excitedly. It struck Raven how much of a kid he looked like when he was like this. “We’re looking excellent, I’m ready to go when you are captain.” He said with an edge of giddiness in his voice, taking a seat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u0022This is the Captain of the Infinitum, are we clear for departure?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Before you leave, I need to know where your destination is, don’t want anyone thinking you’re pirates.” Came a voice, amidst static.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy, we’re heading to Mars for refueling, but we’re mainly just exploring.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy that, I’ll send word to Mars, tell them you’re on your way. You’re clear to go Infinitum.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Morales, take us out of here, one-tenth thrust.” Said Raven, taking her seat, and watching Mimas rotate as the ship spun.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Aye, aye captain, let’s go and have some fun.” Said Morales grinning, taking the controls, and easing the ship away. The spacecraft shuttered as it undocked from the aging Spaceport, its \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters pushing it away as the antimatter drive activated, starting its maiden voyage.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Alright, here it is, a new life for all of us, how long until Mars intercept?” Said \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“1 ½ months, we could get there faster, but I’d rather save antimatter, we have no idea where we could end up, and it’s expensive to refuel.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Smart, well, how’re we doing Karol?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Good, signal sent to Mars, arrival in 72 minutes.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hang on, Morales, is this trajectory correct?” Sage inquired, Morales leaned over to her display to see what she was talking about.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yep, that’s where we’ll be, why, is something wrong?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hopefully not, but just in case, I’m going to prime the Kinetic missiles”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“What? Why?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“There will be an unidentified ship within 38,000 klicks of us if it doesn’t move. Could be ice haulers, but there was a report the other day of pirates who destroyed a ship out here.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Alright, well, I’m going to check up on everyone else, Morales, you have the bridge.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, ma’am.” Morales listened for Ravens steps as they defend in the distance, then stood. “Okay, I’m in charge for the next, oh, 10, 15 minutes, first off, whenever I’m in charge, don’t call me captain, call me skipper.” \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFelicity snorted, “Skipper?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, I found it in an old Earth book, and I quite like it, and I’ve got names for all of you as well, Felicity, since you’re the EVA specialist, I think you’ll be ‘the grease monkey’.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFelicity rolled her eyes, “You’re kidding, right?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Nope! Moving on, Xavier, dude, I respect your insane knowledge of physics, but I think you’ll be ‘the mastermind’ from now on.” Xavier suppressed a laugh. “Oh, Karol, you’re our resident xenobiologist, so you can be,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Are you going to take your job seriously?” Said Karol.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Let me finish the names, but yes, I fully intend to take this seriously. But your name is Professor Funguy,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oh my god,” Karol laughed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“And Sage, you’ll be trigger-happy,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Call me that again, and I will be.” She said sarcastically.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“See! It’s perfect for you!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESage rolled her eyes, failing at hiding a small smile. “Whatever.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E   \u003C/span\u003E*\u003Cspan\u003E   \u003C/span\u003E*\u003Cspan\u003E   \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven jogged down to the lower decks and saw Lance checking up on everyone.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hey Lance, how’s the crew?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Great, 15 down, 124 to go, what’s up?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Nothing right now, just checking everywhere. But we’re on our way for Mars station intercept now.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, I’ll see you on the bridge in a few hours.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“See you later.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E \u003C/span\u003ERaven strode down to the end of the ship towards the reactor room, in a dimly lit passage where Evan was working and passed a line of seats full of people, where a little girl, holding a stuffed animal, was sitting in a bundle of clothes to fit in the seat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Mommy, is that the captain?” Raven stopped and turned to the girl, who was looking at her with interest and bent down to the girls’ eye level.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yep, I’m the captain, is this your first spacecraft journey?” She asked kindly,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EShe shook her head slowly, “We left Iapetus.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well, this is quite the adventure for you isn’t it?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe girl smiled, “Mommy says we’re going to start a new life, is that right?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, we are, what’s your name?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Grace, where are we going?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well that’s the thing, it’s a mystery, we’ll know when we get there, though.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Will we be able to run and play, like on Earth? Mommy told me stories of her grandparents, who lived on Earth.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well, we sure hope so, I have to get to work, be a good girl Grace.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I will.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven walked into the reactor room, and walked past an engineer, through the maze of pipes and containers, where he and a couple of engineers were doing inspections.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“What’s up?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hey Raven,” Even said without looking up, “Just doing inspections, everything is looking perfect so far, and well within spec, we’re almost done.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Sounds good, rotation duties ironed out?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, we have everything sorted, and I need to be in hydroponics soon.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, well I’ll leave you to it.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven left the reactor room and walked past the dimly lit passage towards the bridge. As she approached it, she heard laughter, and rolled her eyes, Morales was probably telling jokes again.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“So what would be a nickname for this ship?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I haven’t gotten that far yet.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hello everyone,” Raven said, walking next to Morales.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Bridge handed over to Commander Moore.” Said Morales, holding his flask.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Captain Raven is just fine Morales, wait, have you been drinking again?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I may have had a celebratory bottle.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven shook her head, “Sage, take over until Morales is sober again, I’m going to my quarters, please alert me if anything happens.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, ma’am.” She said, lifting her legs off of the control panel.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven walked over to her quarters, which were near the bridge for fast access. It was a fairly large room with a bed and several computers that fed her real-time data from the ship. She walked inside and plopped down on a chair, “Activate Raven Moore’s log book, password, 223789.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003ELog 1\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHello, this is Raven Moore, captain of the newly commissioned Infinitum, we’ve begun our journey, and will make a stop at the Phobos station to refuel our antimatter drives and fusion reactors; our ship is housing 139 people in total, and after we refuel at Mars, we’ll be heading to the L4 Lagrange point of Earth.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe Wormhole is significantly wider than the ship, so we shouldn’t have any problems entering, aside from naval fleets trying to stop us. And for a month, it will be turned on for testing, that’s when we’ll attempt to go through.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI have no idea how well it’ll work, or even if we’ll end up somewhere of use, but it’s a risk we’re willing to take.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWish us luck.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003EEnd of log\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003E\u003Cspan\u003E1 ½ months later\u003C/span\u003E\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003E \u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Heelloo Mars! Man, you look beautiful.” Said Morales, gazing at the twilight zone of the red planet in front of him, as he approached the Phobos station. Terraforming efforts have made Mars look overwhelmingly different, significant areas of the planet look like places you’d find on Earth, and the planet has started to lose its famous red color. Now looking browner as the soil continues to germinate, Martian colonists think the planet will look more like Earth in the next couple centuries, and it may be habitable to the point that colonists may not need breather masks to walk about.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Infinitum, this is Phobos station, please slow your velocity as you come in.” Came a voice in the speakers.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy that Phobos, slowing down.” Morales eased the ship sideways as it came in the station. It was one of the greatest construction projects in human history. Almost 200 years ago, engineers crafted a massive engine on Phobos in order to push it to a higher orbit for use as a space elevator. When they didn’t need the engine anymore, it was repurposed as a dock for crafts entering and leaving the port. Since then, there have been so many construction projects on Phobos that it’s unrecognizable as an asteroid.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Man, we could stay here for a little while, right?” Asked Morales as he craned his neck to get a better view of the city at the base of the elevator. It was the largest city on Mars with a population of over a billion, spread out like strands of a spider\u0027s web across the surface, some parts stretching beyond the terminator, and into the night.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“No, our window won’t last very long, we’re only here to refuel.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Alright,” Morales pushed a button on his headset, “Station operators, we are ready for docking attachment.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy that pilot, extending the arm.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAn arm, so huge that it looked capable of holding a ship three times the size of the Infinium clasped onto the ship, pulling it in, and docking it to the port.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“You are firmly docked Infinitum, would any of your crew like to go to the surface?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“No thank you,” Started Raven, Morales looked disappointed, “We’re only here to refuel our drives and reactors.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy, what do you need?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hydrogen fuel and AM for plasma core AM propulsion, Deuterium fuel for our fusion reactors, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel, my engineer will send you a report on how much we need.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy, the refueling will take two weeks.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Thank you,” Raven contacted the lower decks, “Lance, tell the crew that they can exit the ship and go on the station, but that they’re not to go down on the surface.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy Raven, alerting them now.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I’m going to my quarters, I may visit the station later, but you guys can go on.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Come on Raven!” Morales said excitedly, “We’re at Mars! Relax for a bit! Don’t miss the opportunity of exploring a space station around Mars, we’ll never be here again.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven smiled, “Thanks, Morales, but you guys go on, I’ll go later.” Raven headed to her quarters. Morales shook his head and sighed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, fine, but you’re getting off this ship one way or another.” He turned towards Felicity, “Felicity, what do you say to a micro-g game showdown?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EShe grinned “You’re on, I’m gonna kick your ass,” She ran down the hall, “Catch me if you can!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E     \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“This is Raven Moore, password 223789, open my log book.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003ELog 43\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWe have successfully arrived at Phobos station, and some of the crew is leaving the ship to stretch their legs while the ship gets refueled over the next few weeks. After that, we’ll head off to the Wormhole, there’s not much to it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ETo the more personal news, I sent my mom a message the other day and told her how I was doing. She was fine, albeit sad, and we exchanged some video messages, she joked about how she could sing without me getting annoyed, but I realized I’d miss it, so she sent me several videos of her singing, and I’ve listened to it several times now.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EShe’s the only part I’ll miss about leaving here, not having her around is unnatural to me, we shared a close-quarters apartment, and we spent a huge amount of time together. I’m not going to stop the mission, but I’m going to talk to her a lot more before we go through.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI hope I’m not making a huge mistake.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003EEnd of log\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E*\u003Cspan\u003E     \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales and Felicity raced each other through the brightly lit passageway on their way to the sports and recreation part of the station, people staring disapprovingly as they rushed passed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Come on slowpoke!” Felicity said, her dark hair whipping out behind her as she ran.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Wait up! I’m a pilot, not a runner.” Said Morales, panting.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well, you’ll have to do better than that if you’re going to beat me later!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFelicity ran down the curved floor and swung herself around the corner to the rec area, which was basically a huge cavern built for micro-g games, with Morales right behind her.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“So what do you want to do?” She asked, bouncing on her feet, with her eyes bright.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I don’t care. Pick whatever.” He said tiredly but excited all the same.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Woah,” She said, staring at the crowd of different micro-g games in front of her, “Well, how about this?” she said, pointing to a transparent sphere, with two people floating inside, playing a sort of game.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales looked around where she was pointing, “That one?” She nodded, “Okay.” Morales followed Felicity to a spindly man, with long matted hair, wearing a dark red uniform, he was observing the players.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Excuse me, do you work the rec area?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe man looked around, “Yes, I’m one of the supervisors, what would you like to do?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“What that game called?” She asked pointing at one of the dozens of spheres, seemingly rotating as the gravity ring they’re standing on turned. The one she was pointing at had two people in it, chasing a ball around.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe man looked up, “Ah, that’s a fun one, it’s called ‘lucky shot’. The rules are simple. There’s a ball that can move around on its own, your job is to get that ball in the goal post using a handheld air-jet before it suddenly maneuvers out of the way.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales looked up, and considered it for a moment, “Sounds fun, want to try it, Felicity?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes!” She said excitedly\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, you’ll need to put on these suits. There\u0027s a battery pack on the back that will allow you to move around as if you were in space.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales and Felicity took the suits and pulled them on, and while the man assured them they wash them daily, there was a definite smell of old sweat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Alright, follow me you two,” He said, as he walked past a yellow line where gravity wasn’t being artificially created and floated up to a sphere which was held still by steel pillars.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe man grabbed onto a handhold on the outside of the sphere and pulled out a ball “Okay, here’s the ball, I’ll turn it on when you get inside, then you can begin. There’s a timer, so see how many points you can get in 15 minutes. Good luck!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Thanks,” Said Morales and Felicity in unison. They gently floated inside the sphere and faced each other in a mock seriousness.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Are you ready?” Asked Felicity, making herself look threatening, which didn’t really work for someone of her height.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes,” Said Morales in a faked deep voice, mimicking her pose without much success. They were interrupted in their staredown by the man.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, I’m releasing the ball now!” He said, tossing it in. Immediately the ball started moving in odd patterns, Morales and Felicity both had trouble trying to catch it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“This ball… needs to… slow the hell down.” Said Morales, panting after a few minutes of attempts with no success.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Aww, but then we wouldn’t be at 6/0 me,” Felicity said, grinning at Morales, he gave her a dirty look.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Shut up,” He said, grabbing hold of a handle, and swinging himself in an upside down position, relative to Felicity. “Maybe we should take a break.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EShe sighed, “Fine, we’ll get the others here too.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWait, wh-“ Morales started, wide-eyed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“We’ll take a short break and bring the others in.” She said in a firmer voice, Morales tried to stop her, but she had already exited the sphere. Morales followed, as they gently glided back to the yellow line where there was gravity. Then she started running back towards the ship.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Felicity!” He said, running after her. “Stop, we don’t need to bring them into this!” He said, trying to sound desperate, the grin on his face giving him away.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Come on, we need them to vote on who’s the best!” She said grinning back.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWhen they got back to the ship, Raven, Evan, and Lance were all on the bridge, talking about something, looking around when Felicity and Morales came thundering down.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Guys, we need you to come with us to the rec area.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“For?” Raven said, raising her eyebrow.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“We’re playing a game, and we you guys to tell us who’s better.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Come on Felicity, you beat me 6/0!” Said Morales.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yes, but they need to see that!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oh my god.” Said Morales rolling his eyes, Evan smirked.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yeah, let’s see what all the fuss is about.” He said, walking down the hall\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oh, come,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Nope, we’re coming!” He called.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hey, guys, what’s up?” Inquired Sage, leaning in towards the others.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Felicity and Morales are settling a grudge match in the rec area.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oooh, this I gotta see.” She said, “Come on Morales, be a good sport,” She said, wrapping her arm around his shoulder, and dragging him out of the bridge, with the others following.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWhen they got back to the rec area, laughing at Morales’ faked anger, the man walked over to them, “So are you all playing?” He asked.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Nope, we’re watching this one,” Sage pointed at Morales, “And this one,” she pointed at Felicity, who was leaning against Evan, grinning like she was having the time of her life.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oh, that’s where you two went, same game?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yep,” Said Felicity, “Alright Morales, round two.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThey put the suits back on, and floated back up to the spheres, this time with their crew behind them, giggling like a bunch of little kids.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay Felicity, let’s get this over with, “He said, entering the sphere.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe man put the ball back in, “Okay, here you go, have fun guys.” He said, before leaving, and floating back down to the ground.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, who do you think will win?” Asked Sage, as she watched Morales fumbling with the ball.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I have my bet on Felicity,” Said Evan, watching her nearly score a goal.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Oh come on, you guys are betting?” Asked Lance with a huff of disgust. Everyone turned to look at him, “We should be at least betting on something! Place your bets, the losers will buy us beers.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, now that’s a bet I can get behind.” Said Sage, “I bet Felicity.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Same,” “Me too,” Said Evan, and Lance.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“What about you?” Sage said to Raven.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I vote Morales.” Everyone groaned loudly.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Why?’\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Someone has to have faith in him.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well, I hope you like paying for beer,” Said Evan, turning around, facing the match again, the scoreboard said 2/0, “Because Felicity is gonna smoke him.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe match carried on, with Felicity scoring goal after goal, finally, after eight minutes, Morales finally got one.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales jumped off of the wall and grabbed hold of the ball, clutching it tightly, and flinging it towards Felicity’s goal, just making it through. His reaction was ecstatic and looked happy to just have scored a goal. “Yes! Yes, I did it!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well you’re gonna have to do better than that to beat me, 12/1,” She said grinning.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAfter seven more minutes the match ended, with Felicity having a landslide victory of 23/2, everyone cheered, even Morales, “Yes I won!” She exited the sphere, and the others did their best to carry Felicity in a victory parade in micro-g.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Come on guys,” Said Raven, “Beers on me!” Everyone cheered.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Well thank god,” Said Morales, who looked tired but was in good spirits.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWhen they got to the bar, they went over to a quiet table and ordered drinks. Laughing and talking for a couple hours before Raven said they needed to go back to the ship.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFelicity exited first, leaning on Evan for support, while Lance and Sage were talking loudly, stumbling over everything. And Morales, who \u003C/span\u003Esurprisingly\u003Cspan\u003E didn’t have a lot to drink, casually wrapped an arm around Raven, who didn’t have anything to drink, looked slightly embarrassed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWhen they got back to the ship, Raven leading everyone to make sure they didn’t get lost, almost everyone collapsed and just slept anywhere. Morales said a groggily good night to Raven, and fell asleep in his chair, while Raven went to her quarters.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003ELog 44\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWe’re back on the ship, Lance says almost half of the crew are exploring the station, I’m really tired, so, Raven More, signing out.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003EEnd log\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E2 weeks later\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven was pacing back and forth on the bridge, her mag boots making small clanging noises when she walked, her long hair floating above her.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Lance, come in,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Hello Raven, we have a full crew, strapped in and ready to go.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Great, Evan?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Fusion reactor performing perfectly, Antimatter engine is good to go, we’re all strapped in back here.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay,” Raven racked her brains, to make sure she didn’t forget anything, after today, there was no going back. “Karol, how’re we doing?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Telemetry and guidance are five by five, ready to go when you are captain.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Morales, ready to fly us out of here?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“You bet I am, let\u0027s get a move on.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERaven tapped a button on her comms, “Phobos port, this is Infinitum, requesting clearance to undock.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy, Infinitum, you’re clear for departure.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Copy that, thank you.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“You’re welcome, come back soon.” Came the voice on her headset. \u003Ci\u003EI don’t think that’s going to happen. \u003C/i\u003EShe thought to herself.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Morales, you’re up,” She said, taking a seat, and strapping herself in.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Aye, aye, you guys ready for some fun?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales gently pulled the ship away from the dock, its lights blinking with a great intensity, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters pushing it away slowly, and the ship beginning to gleam with light as it came into view of the Sun. When the ship was several klicks away from the port, Morales slowly pushed the throttle for the AM drive, and the spacecraft accelerated away from Mars, heading towards its final destination in the solar system.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Alright everyone, here we are, after over a decade, we’re finally on our way to the Earth L4 point, on our way to the first Wormhole built in human history.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Here, here,” Said Morales, otherwise focused on his console.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Let’s do this!” Shouted Sage, as she pumped her fist in the air.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe others joined in as well, including Raven. Through the bridge’s window, the Sun poked through, creating beams of light on the bridge.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe bridge was big enough to hold a dozen people and was set up so that the pilot, tactical, and captain were in the front, in a semicircle, while comms and science were in the back left where Karol worked. And the ship controls and feed were on the back right, which gave Felicity feeds of the ships’ status.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAfter several hours of doing preliminary checks, Raven decided to go to her quarters. “Morales, you have the bridge.” She said, getting up, and walking out the back.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Okay, Raven.” Said Morales, distracted by his feed of Earth news. “The Wormhole initiation is on track, in fact, it’s the only thing anyone here is talking about. Also, some members of the government on Earth have been invited to see the activation.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESage threw her head back, “Oh that’s perfect, a ship from the outer solar system coming in the enter the Wormhole looks bad enough, but now there are government members watching?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“Yep,” Said Morales, swiping through his screen. “Perfect, isn’t it?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I assume there’s a naval fleet to accompany the government members?” Asked Karol.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“I assume so, let\u0027s hope they realize we’re not a threat.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E“If we broadcast a neutral message, it might be enough,” Said Karol thoughtfully.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales snorted, “I think we’re going to have to fly into the Wormhole at top speed, we could send a message, but that won’t be enough.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMorales and Karol suddenly got into a discussion on what would be needed to get through the Wormhole, Felicity, and Sage joining soon after.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003ELog 53\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ECaptain speaking, we are officially on our way to the Wormhole, after months of preparation and flying, we’re nearly there. The crew is in high spirits, and I’m honestly excited about all of this myself.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHowever, I’m also scared, of what will happen when we cross the mouth of that Wormhole.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI won’t be logging until we cross the Wormhole, there’s a lot that needs to be done, but I’m ready.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESee you on the other side.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan\u003EEnd log\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-21T18:07:40Z\u0022 title=\u002202/21/2017 06:07  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 21, 2017\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-23T14:51:42Z","Content":"\n\u003Cp\u003E\nMaking progress on chapter 3 \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-01-31T16:06:30Z","Content":"\n\u003Cp\u003E\nI think for the second draft, chapter 1 will be inserted into the middle of the book somewhere, and chapter 2 will become chapter 1, and extended a bit.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-01T20:04:56Z","Content":"\n\u003Cp\u003E\nSo you\u0027ve seen the updated title, and I need help with planets. I have a few ideas, but I need more.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, can you guys give me planetary ideas? Whether they\u0027re habitable, hostile, frigid, moon, planet, gas giant, whatever, give me some ideas, I only need 12. Also, can you also give some interesting features as well?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd they have to be realistic. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-01T20:34:59Z\u0022 title=\u002202/01/2017 08:34  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 1, 2017\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Raging Sandwich","CreatedById":164377,"CreatedDateTime":"2017-02-02T00:20:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222941508\u0022 data-ipsquote-contentid=\u0022155197\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485979496\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you\u0027ve seen the updated title, and I need help with planets. I have a few ideas, but I need more.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, can you guys give me planetary ideas? Whether they\u0027re habitable, hostile, frigid, moon, planet, gas giant, whatever, give me some ideas, I only need 12. Also, can you also give some interesting features as well?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd they have to be realistic. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow about an icy planet like in Interstellar? Either a giant mountain or a huge gorge on it would be cool.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-02T00:21:11Z\u0022 title=\u002202/02/2017 12:21  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 2, 2017\u003C/time\u003E by The Raging Sandwich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-02-02T02:59:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222941508\u0022 data-ipsquote-contentid=\u0022155197\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485979496\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you\u0027ve seen the updated title, and I need help with planets. I have a few ideas, but I need more.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, can you guys give me planetary ideas? Whether they\u0027re habitable, hostile, frigid, moon, planet, gas giant, whatever, give me some ideas, I only need 12. Also, can you also give some interesting features as well?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd they have to be realistic. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe a gas dwarf...?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about a weird planet with an extremely dense atmosphere, with a \u0022floating\u0022 piece of asteroid remains...???\n\u003C/p\u003E\n\u003Cp\u003E\nWater worlds are always fun...\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2017-02-02T04:26:01Z","Content":"\n\u003Cp\u003E\nA multi-biome planet would be nice for a change... \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-02T16:02:43Z","Content":"\n\u003Cp\u003E\nSigma Prime inspiration \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Church\u002BMountain\u002BFalls\u002BKirkjufellsfoss\u002BIc\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://4.bp.blogspot.com/-73r7UKtV8wc/U4nB6cYf9lI/AAAAAAAA7Qc/0NyJKhe_83I/s0/Church\u002BMountain\u002BFalls\u002BKirkjufellsfoss\u002BIceland.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-12T20:35:24Z","Content":"\n\u003Cp\u003E\nI can use this!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.universetoday.com/133312/magellenic-clouds-stay-connected-string-stars/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.universetoday.com/133312/magellenic-clouds-stay-connected-string-stars/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-17T00:23:47Z","Content":"\n\u003Cp\u003E\nHere\u0027s chapter 3! Before you say anything, yes, I know the font is different, it\u0027s intentional, but when I tried changing it, it screwed everything up, so we\u0027ll just have to live with it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEntrance.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E1 week later\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven ducked her head slightly to avoid bumping her head on the pipes dangling from the low ceiling, it was dimly lit with white LEDs and was crowded with the entire crew, full of noise and laughter, there were several screaming kids, and loud conversations. She ignored them and gave polite nods to everyone as she walked down the mess hall to get her food, which was some sort of stew and bread. She strode over to her table along with other ranked crew members and exchanged pleasantries with Morales before sitting down next to him.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Hey Karol,” She said, glancing across the table, “How’s the communication between the Earth naval fleet going?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Irritatingly tedious, they’re having me list everything we have so they can check it out,” She said, rolling her eyes at nothing in particular, “What are they having you do?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Just updates and the like every so often,” She said dully, then she snorted, remembering something, “They want us to create an embassy wherever we end up, and to try communicating with them, I just said yes to shut them up.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Well, at least they’re letting us go through it, what does the Odyssey say?” Asked Morales.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“They don’t really like it, I think they’d prefer an Earth ship to go through instead, not some thrown together ship from the Outer system. But we’ll be out of their way in no time.” Replied Sage, taking a swig of her drink.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven dipped her bread in the stew, and bit a large chunk off, “Well, they can quit their whining soon enough. Anyway, have you guys been saying your goodbyes?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ELance replied first, “Yes, a few good friends back on Mimis, It was a bit difficult, but we’ve said our goodbyes, they’re still trying to figure out how Earth let us by.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yeah, about that,” Asked Felicity, looking up from her food, “Is Earth reporting it?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Like, making a news report?” Raven shook her head, and took a sip of her water, “No, they want to keep it quiet, and if it does get out, they’ll probably say it was an Earthship that went through, not some scrap heap. They don’t want the outer civilians thinking they can do whatever they want.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Well,” Started Morales, placing his flask down, and leaning forward, “I think it’s about time Earth learned to deal with us. Always looking down on us, just because we don’t live in a world with free air, well guess what,” He said, jabbing the table with his finger, “Your ancestors put us here. And it’s about time you treated them as equals. Seriously, I’ve just about had it with them, their only good quality is allowing the planets to become independent peacefully. But they would’ve had to do that eventually anyway since FTL communication isn’t a thing.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ESage nodded in agreement, “Thank God we won’t have to deal with them in a couple days.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe crew continued to talk about Earth, and their families throughout the rest of dinner, when Raven was finished, she said goodnight, and laughed along with Felicity, at a joke Evan had made. She set her tray down and dodged a few kids playing tag, as she walked back to her room.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EWhen she collapsed on her bed several minutes later, she opened up her audio log.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ELog 54\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EI\u0027ve decided to make one log before we enter. We’re almost there. And less than a day from the Wormhole gate, we’ve been getting hails from many ships over the past couple days, as their ships noticed we’re on an intercept course, but so far we’ve been ignoring most of them. Except for the few messages from navy cruisers, so Karol formatted a message for them as we tried negotiating terms. A couple hours ago, they gave us the green light to pass through the gate.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ESome of the messages are from the science ship Odyssey, and they’re worried we’ll mess something up with their gate, I personally think we’ll be doing them a favor by acting as guinea pigs. They’ve been sending us lots of messages, like, you don’t even know where you’re going, and what if you end up in the middle of nowhere? I mostly ignore them.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EI still can’t believe in less than a day, we can make our own laws, our own system, and no one will be there to tell us otherwise. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EAnyway, that’s all for now, I have to get some sleep.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EEnd log\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe next day\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EBreakfast was a quick one today, just some rehydrated banana bread, partially grown from the hydroponics, everybody was talking loudly today, more so than usual, while others looked nervous, after almost half an hour, breakfast was over, and everyone went to the flight decks to get strapped in for the Wormhole entry in a few hours. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMeanwhile, the bridge was spun down and was the only inhabited place without gravity. Raven and the crew climbed ‘down’ the ladder, and walked to their chairs using magnetic boots when everyone was stapped in, Raven opened communications with the Navy cruiser Viper. A naval spacecraft built for aerial and spaceflight, usually stationed on or around Earth. She was the only one walking around, while everyone else was sitting, doing system checks on everything.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe ship was pointed slightly portside, and a bright light was coming in from the Sun at an extreme angle, casting long shadows over the bridge, with the Wormhole gate on the starboard side, looking menacing with its red glow. Raven was reading messages on her handheld, talking to the other ships, answering questions, and ignoring most. Her footsteps make clanging noises as she walked, and she deftly navigated through the bridge, down the steps, and to her seat., the atmosphere buzzing with tension and excitement. Morales looked euphoric, he had combed his hair, which Raven had only seen him do on special occasions, “Today’s the day,” He said excitedly, grinning at her. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yep, today’s the day,” Raven agreed, she turned her headset on the address the crew. “Okay, everyone! Final preparations! Today, we take our first step, today, we cross the Wormhole, and begin a new life.” Raven’s voice rang throughout the ship, everybody cheered at those words. The environment in the ship was full of excitement. “Morales?” Raven asked peering at his console.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Trajectory looking good, minimal course changes expected. Right on track for Wormhole entry.” He looked laid back, leaning into his chair casually.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Karol?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Comms up, we’re sending them messages, and they’re receiving.” She said, her hands flying across the panel, answering questions from god knows how many ships.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Good, Sage?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“We’re fine, none of the naval ships seem like they have secretive hostile intentions.” She said, almost bored. “I still can’t believe we’re this close.” She said in a quieter, gentle tone, staring Raven in the eye, “It seems like only yesterday, we were talking about traveling through a Wormhole, now here we are.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Neither can I, it’s, almost like a dream sometimes. But whatever happens, we’ll be ready.” She said, smiling.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Oh yes. No doubt about that.” She said, chuckling to herself, as she checked her console again.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven noticed she looked quieter than usual, \u003Ci\u003EI should talk to her later \u003C/i\u003ERaven thought to herself. “Evan?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Fusion reactor is perfectly functioning, AM engines at full efficiency.” Radioed Evan from the engineering bay. He was in a spacesuit, strapped standing up in case he needed to do an emergency repair during flight, along with several other engineers next to him, magnetic boots keeping them in place all lights were on, and they were in front of a control panel just in case, checking the readouts of the ship, it was dimly lit in blue light, O2 gas venting in, making look slightly foggy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Lance?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Crew is all strapped in, no medical issues, we are good.” Radioed Lance from the nearest crew bay. He was in the middle of over two dozen people, ready to help anyone at a moment\u0027s notice, his other eight doctors scattered across the crew for the same purpose, everyone was chattering, like a bunch of insects.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ELance turned off his headset and turned to a little boy sitting next to him, who was fidgety and was staring at the opposite wall, wide-eyed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Hey kid, how’re you doing?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe boy looked startled at being addressed by him, “F-fine,” He stuttered.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Are you excited?” He said, trying to help the boy relax.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EHe nodded quickly, “I guess, I’ve never done this before.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Me neither, none of us have, but we’ll be fine.” He said gently.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe boy took a deep breath, “If you say so. Where are we going when we’re through?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ELance shrugged, “No clue whatsoever. Hopefully somewhere good.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Felicity?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EFelicity was in the main airlock, strapped to the side, ready to go outside if needed when they crossed the Wormhole. Her second in command, Owen, was on the bridge doing her usual job and maintaining communications with her. “I’m ready to go when you are captain.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EAfter several months of flying, they were finally here. No one had complained of the communal arrangments for days, there was excited chatter in the crew bays, and the kids had invented a new song to celebrate, it was hard to sit still, even with the seats keeping them down firmly.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Alright, Morales, time for Wormhole intercept?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Four hours, 12 minutes, 23 seconds.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Copy that.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E  \u003C/span\u003E\u003Cspan\u003E  \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe science ship Odyssey was the massive ship in charge of the Wormhole test and would be home to hundreds of scientists for the months to come. It was over a kilometer long and was a sleek machine, a gravity ring ran along the middle that doubled as living space and a laboratory. It was positioned on the northern side of the gate, shuttles going to and fro towards the station built on the ring, which brought scientists who would closely study the Wormhole.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EIt has been in service for almost a century and was the most effective science ship ever built, updated every few years, it had traveled across the entire solar system and expanded humanity’s knowledge of it exponentially. Past the cratered surface of Mercury, aerobraking through the raging storms on Venus, overseeing terraforming efforts on Mars, flying through the Asteroid belt, coming within several thousand kilometers above the great red spot, and studying the microbial life under the icy surface of Europa. Traversing through the rings of Saturn, flying through the geysers of Enceladus, landing probes that voyage through the diamond rain of Uranus and Neptune, and even going as far out to Terminus, the furthest planet in the solar system, a gas dwarf with the mass of 10 Earths, and a thin, frozen hydrogen atmosphere. It’s also launched probes to the outer fringes of the Oort cloud, almost a light year away, to study dwarf planets and comets.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe captain of the navy cruiser Viper was staring at the report from Infinitum, a ship that had been recently authorized for Wormhole access.\u003C/span\u003E\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E \u003Cspan\u003EThe Viper was a small cruiser, 38 stories long, and shaped like a narrowed delta wing for aerobraking, and optimized for maximum combat efficiency. While there weren’t any wars between the major solar system powers, space pirates had a habit of destroying or damaging valuable bases. There were kinetic, and railgun, weapons, and it used AM for both energy and propulsion, and it held only a couple dozen crew, for redundancy. \u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Sergent?” Asked Captain Malcolm Kennedy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yes captain,” replied the timid man at the comms station. Why he was part of the military was beyond Malcolm, not that he wasn’t a good officer, it was just he was smaller, not as bulky, and would be the last person you’d want in space combat, he had to admit though, he could whip up a pretty good taser with materials on hand.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“The Infinitum has reported everything is green for them, and they’re on track for Wormhole entry in four hours.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yessir,” The man started, staring up at him, “That’s what they’re saying, I have direct communication with their captain, also, the Odyssey would like to contact them before entry, apparently, Captain Gray isn’t responding to hails.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Well tell them they need to hail them, and answer their questions, in the meantime, give me direct channel with the captain.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yessir, asking now,” The man tried again, and got a set of blinking lights in response, “They’re answering.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Bring up audio.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yessir,” The comms officer tapped his screen and allowed audio to fill the bridge.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Captain of the Infinitum, you are required to respond to Oddesey, or Earth may rethink their authorization for you.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThere was silence on the line, albeit except for static, after several moments, Captain Gray spoke, “Fine, we’ll contact them.” She said, her voice breaking sometimes from the static, “What do we need to do?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Just answer their questions, that’s all.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMalcolm though she sighed for a moment, but couldn’t be sure, “We’re contacting them now, Gray, out.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven sighed again, “Karol, open up channels with Oddesey,” She said, looking over to her, Karol gave a curt nod, and put in a few keystrokes.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“The channel with Oddesey is open, they’re responding.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Audio please,” Said Raven.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“They’re requesting video.” \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven bit the inside of her cheek, “Fine, whatever, let ‘em through.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe normally clear window that looked out into space was replaced with a bright white bridge, only three people were in it, the captain, communications officer, and pilot. The captain stood up, he wore a bright grey uniform and looked stern. With streaks of grey in his black hair.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Hello captain, my name is Dominic, I am the captain of this vessel.” He said with a false smile, in a voice that sounded exceedingly formal to Raven, she rose her eyebrow at him.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Hello captain, my name is Raven,” she said, biting back the urge to turn off the channel with him. “What would you like?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“We just have a few questions to ask you, what is your crew size?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven gave him a confused expression, \u003Ci\u003Ewhy does he want to know that? \u003C/i\u003E139 people, why?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“We’re just gathering some information, why are you trying to get through our Wormhole?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“To create a new life for ourselves,” She said.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Do you know where you could end up?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“No, this wormhole only has one end, so we could either be trapped forever or flung across the universe.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“So why take the risk?” He said, moving closer to the screen.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“We want a better life, a chance to start anew, are there any more questions?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EDominic thought to himself, “No, that’s all, just be careful.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Don’t worry, we won’t scratch the paint job.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EHe smiled, this time, Raven thought it was genuine. “No, I mean, wherever you end up, be careful.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven nodded, “We will.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EDominic nodded, and the screen turned back, reverting back to the view of space.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Karol, open channels back up with Viper.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Yes, ma’am.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Sir,” Said the sergeant, “Infinitum is opening channels back up,” He said, looking up.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Patch them through,” He said from his chair.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EStatic sounded through the speakers again, and Malcolm started talking immediately. ”Are you absolutely sure you want to do this?” Asked Malcolm, he was still trying to get over the fact they wanted to do something this risky. And that they were still geared towards entering the gate, for the past few days, he wondered what their reason was.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Never been surer of anything in my life sir.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMalcolm was taken aback, as were the other officers on duty, they looked at each other in silence. Malcolm thought to himself, and decided to try a different approach, “Okay, you do know-“\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“The odds of us dying? Yes, now quit nagging, I’m trying to pilot this ship into an experimental Wormhole without scraping the sides.” Came an unknown voice. Malcolm was astonished by the man’s back talk. He gave up trying to convince them to turn around, they were getting too close anyway.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Is there anything you would like us to tell anyone?” Asked the man gently, he knew that they would never be seen again and that they would most likely die.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“No, we’ve already taken care of that. Thank you.” Replied the captain, more pleasantly, before breaking the connection.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Sir, they’ve turned off their comms.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“That’s alright officer, time to their entry in the gate?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Less than 30 seconds sir.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMalcolm strode off the dimly lit red hue bridge and went to his quarters to discuss matters with senior officers privately.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003Cspan\u003E    \u003C/span\u003E*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven was getting dozens of hails from several different ships, and she was starting to get annoyed. She felt so close, she could almost taste it, \u003Ci\u003EWe’ve come so far to stop now. \u003C/i\u003EShe could see the Wormhole gate from where she was sitting. A massive ring with a shimmering, almost gaseous bright red appearance within the ring. It was one of the most incredible objects she had ever seen. Unfortunately, there was a blockade of ships that would prevent them from getting through without destroying the ship, and everything within tens of thousands of kilometers.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Morales, decrease thrust to the engines, Karol, tell the ships hailing us to leave us alone, we’re sending them all of our data.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Raven, we’re getting multiple hails from the navy cruiser Viper, they’re saying if we don’t respond, they’ll deny us access.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven sat up straighter, rubbing her eyes. “They can’t, there’s no reason for them, tell them to grant us access, we’ll answer their hails.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“I’ve responded with that already, but they’re not responding back.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMorales got a notification on his headset. “I’m getting signals that the ships are pulling away, Viper is hailing us again,” Said Morales, looking at his sensors. “Just under four hours until Wormhole entry.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Let ‘em through,” Said Raven, sounding annoyed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Captain of the Infinitum, are you absolutely sure you want to do this?” Came a static filled voice, even among the interference, Raven could hear the disbelief and bemusement in his voice.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Never been surer of anything in my life sir.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Okay, you do know-“\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“The odds of us dying? Yes, now quit nagging, I’m trying to pilot this ship into an experimental Wormhole without scraping the sides.” Interrupted Morales.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe captain was silent for a moment at his back talk but quickly recovered himself. “Is there anything you would like us to tell anyone?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“No, we’ve already taken care of that. Thank you.” Said Raven, more politely this time, slightly taken aback by his offer. She turned off her comms, saying a blatant goodbye to the rest of humanity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ESeveral hours passed, no one tried to communicate with them, but they could tell they were constantly scanning them, and keeping a check on them. The crew continued to do constant check on all systems, and in the crewed sections, there was huge apprehension as the clocks ticked down.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThree hours.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ETwo hours.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EOne hour.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThey were less than 3 minutes from the gate, and only around a kilometer away from the gate now, its blinding red glow filling the bridge, so bright they had to squint their eyes. If it wasn’t so bright, they might be able to describe it looked almost like a fluid.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMorales addressed the crew, “Less than two minutes to Wormhole entry.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EEvery ship that had video feed within 100,000 kilometers watched as the ship approached the Wormhole, the shimmering red light of the gate suddenly turned blinding white as in entered, and just as soon as it went in, it was gone. Communications from the ship stopped immediately, and sensors went off the charts, no one knew where they could’ve ended up.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe red light from the Wormhole bathed the bridge in blinding light and forced everyone to close their eyes. “Okay, everybody, we will be entering the Wormhole in three…. two… one…” Said Morales, his eyes closed, with an arm over his face, listening to his headset.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThe moment the ship touched the Wormhole gate, everything they could see, if their vision wasn\u0027t obstructed, suddenly shrunk down to nothing, everything turning to a bright gray, that seemed to go on forever with no end in sight. The ship was seemingly under no acceleration whatsoever and everything felt eerily smooth.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EAll of this lasted not five seconds, and before anyone could adjust to their new surroundings, the endless gray light expanded immensely, immediately being replaced with normal space. When it had exited, the ship started drifting, and everyone was in a strange daze. Outside, there was a massive spiral galaxy in their view, and stars surrounding them. The crew was speechless, both from the sudden journey, and a spectacular sight.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EAfter several moments, Morales was the first to speak.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Where the hell are we?”\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI hoped you liked it, leave your thoughts below guys! And how do you like the storyline so far?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-25T19:25:05Z\u0022 title=\u002202/25/2017 07:25  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 25, 2017\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-18T02:08:24Z","Content":"\n\u003Cp\u003E\nOver 10k words completed so far, and around 500 words for chapter 4 \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat did you guys think of chapter 3?\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-19T22:36:11Z","Content":"\n\u003Cp\u003E\nHere\u0027s the first 300 words of chapter 4 \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003ERaven groaned, the weird sensation they felt during the passage made her feel dizzy, outside the ship, they could see a massive spiral galaxy, and a field of stars as far as the eye could see.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“I don’t know, Xavier?”\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EXavier was rubbing his eyes, “On it,” He opened up his screen, and began scanning. He was silent for several moments and muttered something unintelligible under his breath. After a couple minutes, he finally spoke up. “Holy crap, Morales, can you turn the ship around 120 degrees?”\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMorales looked confused, and still dazed, “Excuse me?”\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Turn the ship around, I’m picking something huge up right behind up, I can see it, but it’s just so big, all I know is that there’s a lot of energy on it.”\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EMorales sighed and grabbed the controls “Okay, how big is big?” turning on the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, and turning the ship around. \u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“It’s larger than the Moon but much, much less massive.”\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Well then,” As it turned, a massive object started coming into view, it looked extremely close and circular.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“What is that,” Sage said, getting up.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“Woah, that’s something,” Morales said wide-eyed, mostly snapping out of the daze. A bright red ring came into view, and the entire crew stared in disbelief as the ship spun completely around, showing a massive structure, over 2100 km across with almost two dozen shimmering rings of red, the closest taking up the entire view, and the rest showing up on the scanner. “Holy crap,” Said Xavier, his jaw was slack, and he looked dumbfounded at the immense structure in front of them. \u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003EThere was no sunlight, and they couldn’t see anything but the rings of red, and there were dozens of ships flying around the complex structure. Morales’ console beeped.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12pt;font-family:\u0027Times New Roman\u0027, serif;\u0022\u003E“There’s a ship approaching us, and\u003C/span\u003E...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe (...) is there to show there\u0027s more dialog.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-21T18:09:12Z","Content":"\n\u003Cp\u003E\nI\u0027m an idiot, in chapter 2, Mimas spaceport was 200 km wide, Mimas itself is 198 km wide.\n\u003C/p\u003E\n\u003Cp\u003E\nI changed it to 60 km instead, a little less than a third of Mimas\u0027 size, and much less massive.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, it isn\u0027t mentioned, and should be obvious when you think about it, but it\u0027s in a trailing orbit around Mimas, not directly orbiting it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-21T18:12:17Z\u0022 title=\u002202/21/2017 06:12  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 21, 2017\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2017-02-22T21:56:32Z","Content":"\n\u003Cp\u003E\nAlways stoked to see a young writer enjoying their craft!\n\u003C/p\u003E\n\u003Cp\u003E\nKeep up the good work!\n\u003C/p\u003E\n\u003Cp\u003E\nOne minor comment: IMO, the intro is not exactly gripping.  Rather than \u0022Hello, today is _____ and my name is _______,\u0022 I prefer intros more along the line of \u0022The black infinity stretched before him, devoid of stars.  Touching the viewport, his pale fingers created small clouds of condensation against the frozen glass...\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-22T22:10:06Z\u0022 title=\u002202/22/2017 10:10  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 22, 2017\u003C/time\u003E by Slam_Jones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-22T22:56:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222964577\u0022 data-ipsquote-contentid=\u0022155197\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221487800592\u0022 data-ipsquote-userid=\u0022125101\u0022 data-ipsquote-username=\u0022Slam_Jones\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, Slam_Jones said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlways stoked to see a young writer enjoying their craft!\n\u003C/p\u003E\n\u003Cp\u003E\nKeep up the good work!\n\u003C/p\u003E\n\u003Cp\u003E\nOne minor comment: IMO, the intro is not exactly gripping.  Rather than \u0022Hello, today is _____ and my name is _______,\u0022 I prefer intros more along the line of \u0022The black infinity stretched before him, devoid of stars.  Touching the viewport, his pale fingers created small clouds of condensation against the frozen glass...\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe intro was just to get the story going, chapter two will be chapter one in the second draft, and will be slightly rewritten to have a better opening. While chapter one will be inserted somewhere in the middle of the book.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-25T19:27:25Z","Content":"\n\u003Cp\u003E\nI\u0027ve made a mild correction to chapter 3, where Raven makes a log, in chapter 2, she mentions she wasn\u0027t going to make one until they enter the Wormhole, but she did, so... that\u0027s now fixed \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the writing chunk, I\u0027ve finished 2k words on 4 \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-02-26T13:47:14Z","Content":"\n\u003Cp\u003E\n12.2k words total, 2.5k words on the second chapter, so about halfway \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-03-02T18:31:20Z","Content":"\n\u003Cp\u003E\nInfinitum has some cover art, courtesy of \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57763-daniel-l/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257763\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57763-daniel-l/\u0022 rel=\u0022\u0022\u003E@daniel l.\u003C/a\u003E \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CdXTGaG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CdXTGaG.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-03-03T15:46:40Z","Content":"\n\u003Cp\u003E\nYay! The chapters are no longer ridiculously long from the huge paragraph spacing!\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-03-08T02:09:49Z","Content":"\n\u003Cp\u003E\nAfter long searching in the LMC using Space Engine, I have the Kelrak\u0027s homeworld, and Sigma Prime.\n\u003C/p\u003E\n\u003Cp\u003E\nBehold! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/gallery/q1EPy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/q1EPy\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/gallery/yp4do\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/yp4do\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow all I need to do is find a system with at least 3 habitable planets to serve as the Nova system \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}