{"TopicId":155174,"ForumId":55,"TopicTitle":"Career-Science Hybrid Mode","CreatedByName":"spacebrick3","CreatedById":158990,"CreatedDateTime":"2017-01-18T06:35:06Z","PageNum":1,"Articles":[{"CreatedByName":"spacebrick3","CreatedById":158990,"CreatedDateTime":"2017-01-18T06:35:06Z","Content":"\n\u003Cp\u003E\nAfter playing KSP for a while, I noticed something. After playing career mode for a while, Science mode can feel too easy. After all, you start with all building upgrades, so you can gather much more science faster, and build bigger vehicles, right at the start. Without the limitations placed on you by building upgrades, Science feels like there\u0027s not enough progression.\n\u003C/p\u003E\n\u003Cp\u003E\nI propose a mode that is similar to Science, where there aren\u0027t funds, contracts, strategies, or reputation to manage. However, the buildings would start at Level 1, and would be upgraded through Science. They could either be unlocked in the tech tree at certain tiers, or be purchased like they are in Career, with early-game science yields perhaps boosted slightly to account for building-upgrade purchasing.\n\u003C/p\u003E\n\u003Cp\u003E\nI think that this would be a good mode to have, as it places some restrictions on Science mode while not having any other stuff to manage such as in Career mode.\n\u003C/p\u003E\n"},{"CreatedByName":"TheEpicSquared","CreatedById":158667,"CreatedDateTime":"2017-01-18T09:07:38Z","Content":"\n\u003Cp\u003E\nHmm, I guess I agree. I usually play either sandbox or career, I feel like science mode doesn\u0027t have much use, and adding the building upgrades based on science would make it more realistic while still having science as the only limiting resource. Good idea. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-01-18T09:09:49Z","Content":"\n\u003Cp\u003E\nThis is something that I\u0027ve wanted for a long time. It always feels weird launching tin-can-and-a-Flea suborbital hoppers with this enormous state-of-the-art space centre in the background.\n\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2017-01-19T16:44:16Z","Content":"\n\u003Cp\u003E\nIt\u0027s been suggested before, but I\u0027d quite like to do away with modes all together. Instead, just have a bunch of toggles - building upgrades, kerbal experience, funds, contracts, strategies... all of it. Then have the current modes as presets in that system \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2017-01-19T21:54:39Z","Content":"\n\u003Cp\u003E\nThis would be a good place to start\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/109027-121-custom-barn-kit-1110-nov-15th-no-instruction-leaflet-edition/\u0026amp;do=embed\u0026amp;comment=1919664\u0026amp;embedComment=1919664\u0026amp;embedDo=findComment#comment-1919664\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}