{"TopicId":155218,"ForumId":16,"TopicTitle":"Playing billiards with Jool","CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-18T21:19:00Z","PageNum":1,"Articles":[{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-18T21:19:00Z","Content":"\n\u003Cp\u003E\nHi all, \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m attempting my first ever Jool mission.    Not one for half measures, it\u0027s going to be a Jool 5.   I\u0027ve got a very large spaceplane with about 1100dV remaining as it plunges to its doom in the Jool system,  and .38 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.   It has IRSU and if we can get into Laythe\u0027s atmosphere in one piece, i am very confident of being able to land the thing (even dead stick) , get mining, and complete the mission.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is that whilst i think i\u0027ve got a fair understanding of stock aerodynamics and can fly decently,  I\u0027m terrible at orbital mechanics.   Was very pleased with myself using only 2200 or so to get an encounter with Jool from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, normally i  use 2 or 3 times the estimates.\n\u003C/p\u003E\n\u003Cp\u003E\nNow the capture burn would be another 2k \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E if doing it propulsively, and you\u0027re looking at the same again or even more to get into Laythe.  Now I hear that all the smart kids actually do it by using gravity assists.   This is where i\u0027m struggling - \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170118193513_1_zpsuzceoxj4.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i249.photobucket.com/albums/gg237/Nemulias/20170118193513_1_zpsuzceoxj4.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the Kerbin-Jool transfer burn we hit an AP of 77 billion then arced back down to this encounter with Jool.    We swung around the back of Jool itself, and as luck would have it, can pass just in front of Tylo to get a massive gravity braking assist.  Do i need to tune this to be a bit less aggressive?\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see, it\u0027s going to have us plunge to our doom on Jool.   Miraculously (some would think it intentional) we get another encounter with Laythe, on our way down to oblivion.  But we\u0027re going 5300m/s plus at this point, and Laythe\u0027s atmosphere goes from thick enough for jet flight at 40km to zero at 50, so setting PE high enough to not blow up the ship means you\u0027re only in the atmosphere for a second or two.  No appreciable braking possible.   As for the gravity assist, it can substantially affect our trajectory, but only after we\u0027ve smashed to bits on jool.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-18T22:34:41Z","Content":"\n\u003Cp\u003E\nsome more experimentation...\n\u003C/p\u003E\n\u003Cp\u003E\nEasing up on the Tylo brake got me a Tylo - Tylo encounter .  The second Tylo was on the way back down to crash into Jool, using it to accelerate sufficiently to not impact Jool\u0027s surface also raised my PE to escape trajectory.   Still, I went with this and discovered that i can in fact aerobrake a little at 8km/sec provided me PE stays above 191.    Unfortunately i set it to 190, so we lost our air intakes.\n\u003C/p\u003E\n\u003Cp\u003E\nSeeing where this took us, we got an encounter with Laythe on the way back up.  This was going to accelerate me further, so i made an 800 m/s retro burn (still close to my pe on Jool) and managed to get us to pass in front of Laythe with a PE of 43km.  On my last attempt, aerobraking  at this altitude would be suicidal (going 5300m/s) but by the time we\u0027d reached Laythe orbit our velocity was only some 3800.   Pulling 10g of deceleration,  we managed to get an aerocapture !   So all i need to do is repeat this feat and not loose my air intakes, and we\u0027ve won , right?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-18T22:51:36Z","Content":"\n\u003Cp\u003E\nI think you might have done a little better refueling on Bop than heading straight for Laythe. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-18T22:53:22Z\u0022 title=\u002201/18/2017 10:53  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 18, 2017\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-01-19T00:19:18Z","Content":"\n\u003Cp\u003E\nDo you have this save available for experimentation?\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2017-01-19T00:37:26Z","Content":"\n\u003Cp\u003E\nThe approach I used when attempting this was to use a Tylo slingshot to capture and get a Laythe intercept, then use that encounter with Laythe to slingshot down closer to Laythe\u0027s orbit and reduce the speed I was carrying when it came time to aerobrake. Pic worth a thousand words:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hKwUrdH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562px\u0022 src=\u0022http://i.imgur.com/hKwUrdH.png\u0022 width=\u00221000px\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLight blue is entering the system, purple is after the Tylo slingshot, then red is after the Laythe slingshot. At \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E of the red orbit I did a ~115m/s burn to set up another Laythe encounter where I could aerobrake safely.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-01-19T03:23:32Z","Content":"\n\u003Cp\u003E\nI have spent way too long obsessing over gravity assists on a few recent Jool missions.  A few thoughts:\n\u003C/p\u003E\n\u003Cp\u003E\n-As your original post alludes to, it\u0027s critical to get your eventual intercept with the destination close to tangent.  This is at least as important as getting your Apo and Peri somewhat in line with the target\u0027s.  \n\u003C/p\u003E\n\u003Cp\u003E\n-If you don\u0027t plan somewhat carefully, you hit a point of diminishing returns, where getting another assist doesn\u0027t save much if any delta-v over just doing a longer insertion burn.  \n\u003C/p\u003E\n\u003Cp\u003E\n-To avoid that situation, if you\u0027re not in a hurry, I recommend doing making your first gravity assist fairly small in scope, so that you capture into Jool but your apo is still out beyond Pol.  Then by making small adjustments at either apo or peri, you can get your second gravity assist just where you want it.  \n\u003C/p\u003E\n\u003Cp\u003E\n-From there, I try to get it so that successive assists get you into a resonant orbit with the target (meaning you will hit it again in about the same place in its orbit).  \n\u003C/p\u003E\n\u003Cp\u003E\n-Consider using Laythe instead of Tylo for your first assist, especially if you don\u0027t want to do a long succession of assists.  I find this makes it easier to get later assists that are close to tangent with Laythe.  If your approach into Jool system is not at a crazy angle, Laythe should still have plenty of gravity to capture around Jool.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is a shot from my recent Laythe \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E trip.  I started way out in high Jool orbit as described above, and aimed for a Laythe encounter and assist (blue icon) that would put me in a resonant orbit for a second Laythe encounter, where I would capture (red icon).  If I remember right, I did not have to do any capture burn on this one - these maneuvers got me close enough to Laythe\u0027s orbit that I could aerocapture.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223Bv9jEw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/3Bv9jEw.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-19T05:14:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222926613\u0022 data-ipsquote-contentid=\u0022155218\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484785158\u0022 data-ipsquote-userid=\u0022157121\u0022 data-ipsquote-username=\u0022Gordon Fecyk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Gordon Fecyk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you have this save available for experimentation?\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/8mqztewnygsh6em/alleged%20tylo-laythe%20assist.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8mqztewnygsh6em/alleged tylo-laythe assist.sfs?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nyou\u0027ll have to install Kerbal Furniture mod though, because the craft has a \u0022lounge\u0022 area :-/\n\u003C/p\u003E\n\u003Cp\u003E\nBeware i might have turned some of the engines off or limited thrust at this point to fine tune the manuvers, can\u0027t remember exactly\n\u003C/p\u003E\n"},{"CreatedByName":"Reusables","CreatedById":179182,"CreatedDateTime":"2017-01-19T13:06:42Z","Content":"\n\u003Cp\u003E\nLaythe could definitely be better choice in most case where the entry speed is not too fast. This is because maximum delta-v from gravity assist is two times the velocity difference. The ratio to the maximum does increase for bigger planets/moons, but it is relatively less effective due to the bigger radius.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: For normal prograde orbit, the difference could be smaller if you perform the assist on the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. But using normal component of the velocity to avoid collision, you can shed some more speed with nearly perpendicular approach to the moon. Faster orbital speed gets better in this case.\n\u003C/p\u003E\n\u003Cp\u003E\nSo try passing in front of Laythe.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-20T01:12:55Z\u0022 title=\u002201/20/2017 01:12  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 20, 2017\u003C/time\u003E by Reusables\u003C/strong\u003E\n\u003Cbr\u003ETo be more specific.\n\u003C/span\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-01-20T00:35:05Z","Content":"\n\u003Cp\u003E\nAeroGav, I loaded the save file successfully. Thanks for putting this back at Kerbin Escape so I can see about tweaking the original encounter.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first (and so far last) time I tried something like this I was able to get a Jool capture via Tylo with no \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E cost, but I think Abastro\u0027s right in that passing in front of Laythe may shed more speed. It has a faster orbit due to being closer to Jool, and the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E savings can approach twice the moon\u0027s orbital speed, though you can\u0027t get too close of course.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rule I learned was to shed speed by passing in front of moons, and gain speed by passing behind them. Let\u0027s see what I end up with.\n\u003C/p\u003E\n\u003Cp\u003E\n[a few hours later] So my first attempt passing in front of Laythe got me in a reasonably safe orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022laytheapproach.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://www.antiwindowscatalog.com/media/ksp/laytheapproach.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI tried transferring to Pol, but doing that cost 190\u002B m/s for the approach from Jool PE and then 590\u002B m/s capture at Pol; more than what was left. I barely used 0.5 m/s to get this Laythe-based Jool capture, but in the end that wasn\u0027t enough to capture at Pol. You can probably do better.\n\u003C/p\u003E\n\u003Cp\u003E\nI have Kerbal Alarm Clock installed, which lets me see ascending and descending nodes even for incomplete conics (see green \u0026gt;\u0026gt; arrows top-right near Sun AP), so I was able to place my Laythe adjustment at the most efficient place. Maybe when I come back to this I\u0027ll try for a higher Jool AP and raise PE there so capturing at Pol isn\u0027t as expensive, or I\u0027ll try using Laythe to do a plane change at the same time as the capture; flybys other than at the equator can change the orbit plane too. I could even try flying in front of Tylo as you originally planned, just in a different spot.\n\u003C/p\u003E\n\u003Cp\u003E\nOne more thing: How did you plan to land the refueling module? The module inside the cargo bay had no oxidizer, and only two sepatrons for what I think is supposed to be braking and landing. Maybe you planned on de-orbiting the mother ship, detaching the module, then burning back to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-20T02:47:10Z\u0022 title=\u002201/20/2017 02:47  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 20, 2017\u003C/time\u003E by Gordon Fecyk\u003C/strong\u003E\n\u003Cbr\u003EAdded first attempt screen shot\n\u003C/span\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-20T05:00:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222927906\u0022 data-ipsquote-contentid=\u0022155218\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484872505\u0022 data-ipsquote-userid=\u0022157121\u0022 data-ipsquote-username=\u0022Gordon Fecyk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Gordon Fecyk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne more thing: How did you plan to land the refueling module? The module inside the cargo bay had no oxidizer, and only two sepatrons for what I think is supposed to be braking and landing. Maybe you planned on de-orbiting the mother ship, detaching the module, then burning back to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCurrent plan  - mother ship lands on Laythe.  The drill of the lander angles down at 45 degrees and will poke through floor of cargo bay to mine the soil if i retract the airplane\u0027s gear.    Then hop out to Val, shed airbreathers.     Mother ship can probably also land here in the low grav.   For tylo, detach the 2.5m lander, it goes down alone.  Margins are tightest on this part.  Refuel on surface.  Jettison irsu gear, burn back to orbit, shed propulsion stage, re-dock with mothership using \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E.  Then mothership lands on bop and pol before heading back to Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-01-20T12:58:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222928167\u0022 data-ipsquote-contentid=\u0022155218\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484888454\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCurrent plan  - mother ship lands on Laythe.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOK, that made more sense than trying to land on a low gravity body like Pol. Fuel would stretch a lot farther in Laythe\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nI think others have already suggested more than one braking pass in front of Laythe. On my example I\u0027d plot another Laythe encounter near Jool AP. The end result of that and maybe another braking pass would be an orbit with a close match to Laythe\u0027s such that the next encounter would be at a reasonable speed for aerobraking.\n\u003C/p\u003E\n\u003Cp\u003E\nHazard-ish did a lovely example on a \u003Ca href=\u0022https://www.youtube.com/watch?v=w8wm2zaILzE\u0022 rel=\u0022external nofollow\u0022\u003ETylo run\u003C/a\u003E ; skip ahead to 2:30 to see the manoeuvres used. Only instead of trying to get Jool AP out to Tylo\u0027s or Pol\u0027s orbit, try to keep it within Laythe\u0027s. Or something like that.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-01-21T01:56:36Z","Content":"\n\u003Cp\u003E\nOK, I got it, and with 1100\u002B units liquid fuel left after Laythe orbit insertion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.antiwindowscatalog.com/media/ksp/laythe-laythe-step1.png\u0022 rel=\u0022external nofollow\u0022\u003EStep 1\u003C/a\u003E: Pass in front of Laythe and get a pretty high Jool AP. \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 0.4 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.antiwindowscatalog.com/media/ksp/laythe-laythe-step2.png\u0022 rel=\u0022external nofollow\u0022\u003EStep 2\u003C/a\u003E: Plane change. \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 23 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.antiwindowscatalog.com/media/ksp/laythe-laythe-step3.png\u0022 rel=\u0022external nofollow\u0022\u003EStep 3\u003C/a\u003E: Pass in front of Laythe from Jool AP to tighten orbit. \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 23 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.antiwindowscatalog.com/media/ksp/laythe-laythe-step4.png\u0022 rel=\u0022external nofollow\u0022\u003EStep 4\u003C/a\u003E: Set up Laythe aerocapture at 45 km up from Jool AP. \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 190 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.antiwindowscatalog.com/media/ksp/laythe-laythe-step5.png\u0022 rel=\u0022external nofollow\u0022\u003EStep 5\u003C/a\u003E: Aerocapture at Laythe. \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 400 m/s minimum via aerobraking. Observed speed at 50 km up was under 3 km/s.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 6: Adjust Laythe PE and AP to suit. Pick your landing site and profit.\n\u003C/p\u003E\n\u003Cp\u003E\nI have \u003Ca href=\u0022https://youtu.be/KkfdD951qbE\u0022 rel=\u0022external nofollow\u0022\u003Evideo\u003C/a\u003E of the full attempt now. Enjoy.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-22T04:50:52Z\u0022 title=\u002201/22/2017 04:50  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 22, 2017\u003C/time\u003E by Gordon Fecyk\u003C/strong\u003E\n\u003Cbr\u003EAdded video link\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2017-01-21T02:45:23Z","Content":"\n\u003Cp\u003E\nFrom the original trajectory, you could probably make a burn of a couple hundred m/s at Jool apo after the Tylo flyby to push your Jool peri level with Laythe\u0027s orbit, then go from there.\n\u003C/p\u003E\n\u003Cp\u003E\nIn general, the key to setting up gravity assists is to set a course correction manoeuvre and play with both the pro/retrograde and radial markers. Using both will let you keep the same course past the destination planet but change the \u003Cem\u003Etime\u003C/em\u003E you arrive, so that you can arrive when a certain moon is in the right position for a gravity assist.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I strongly recommend a mod like Precise Node for this kind of stuff.\n\u003C/p\u003E\n"}]}