{"TopicId":155267,"ForumId":32,"TopicTitle":"Update in the last 48 hours?","CreatedByName":"Nickel AP","CreatedById":170218,"CreatedDateTime":"2017-01-19T22:30:14Z","PageNum":1,"Articles":[{"CreatedByName":"Nickel AP","CreatedById":170218,"CreatedDateTime":"2017-01-19T22:30:14Z","Content":"\n\u003Cp\u003E\nWas there an update at all between 1-17-17 and 1-19-17? I had been repeatedly doing kerbin orbit tourist contracts and could continually complete them, first try, at least 5 times in a row. Today I attempted to do a kerbin orbit tourist contract with the exact same ship and could not achieve 70k ap-70k pap orbit. I tried multiple times and ran out of fuel every time BEFORE hitting orbit, not even enough fuel to de orbit. whats going on?\n\u003C/p\u003E\n\u003Cp\u003E\nAdditional info: Was using reliant initial stage, terrier second stage. In an attempt to be extremely cost efficient I was using just enough fuel tanks to achieve orbit and de orbit. With consecutive failures today I tried switching over to thud x2 on initial stage for greater \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E at sea level to no avail.\n\u003C/p\u003E\n\u003Cp\u003E\nIn all humility it may be my flying but I was pretty consistent at hitting orbit with this same ship. I don\u0027t know what could have changed in my flying style to restrict me from hitting orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Parpaza","CreatedById":160128,"CreatedDateTime":"2017-01-25T16:10:49Z","Content":"\n\u003Cp\u003E\nThere was no update at the times you\u0027ve mentioned about (from all I know). No bugfix, no major one.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t do a gravity turn and instead go directly up, there is an extremely huge chance that even a small change in your flying style can negatively effect your fuel usage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EPersonal Note: Being extremely cost efficient can cause even small mistakes to drain all your fuel. I know since I had the same problems during the days I didn\u0027t know how to gravity turn.\u003C/em\u003E\n\u003C/p\u003E\n"}]}