{"TopicId":156164,"ForumId":20,"TopicTitle":"Does the Umbra Space Industrie mod \u0026quot;full Package\u0026quot; is balanced?","CreatedByName":"Ieyasu","CreatedById":174741,"CreatedDateTime":"2017-02-08T16:15:24Z","PageNum":1,"Articles":[{"CreatedByName":"Ieyasu","CreatedById":174741,"CreatedDateTime":"2017-02-08T16:15:24Z","Content":"\n\u003Cp\u003E\nHello here,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m new on this forum, and in some way, also new in KSP (\u0022only\u0022 450 hours of played in my steam account)\u003Cbr\u003E\u003Cbr\u003E\nI love the stock game but I want to improve the realism of my career mode, so I have installed TAC, and it make the game a little bit harder, that is nice.\u003Cbr\u003E\u003Cbr\u003E\nActually, I would like to make a great mod stack for a new career mode, I would like to use Galileo, TAC, and the full package \u0022umbra Space Industrie\u0022.\u003Cbr\u003E\u003Cbr\u003E\nI have installed this one yesterday, but it was really confusing for me, it seems really that this mod broke the game and make it really easy, doesn\u0027t it? Is this mod balanced?\u003Cbr\u003E\nIt add so much stuff that make the game easier that I hesitate to use it (news engines, structs, etc...).\u003Cbr\u003E\u003Cbr\u003E\nMay someone give me his opinion about this mod stack?\u003Cbr\u003E\u003Cbr\u003E\nThank you,\n\u003C/p\u003E\n\u003Cp\u003E\nIeyasu\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-02-08T17:37:56Z","Content":"\n\u003Cp\u003E\nIt actually makes the game much harder - but most of it is in knowing what you need where and when, not just in launching it.  You\u0027ll need to account for the wear and tear on your drills and \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u0027s, the fact that most resources take several steps to build, and that you\u0027ll need to ship things around.  If you installed the full pack, you probably also got \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS, which will mean you not only have to worry about supplies (like in TAC-LS...), but you\u0027ll need to worry about how much space your Kerbals have to move around in - and and how long they\u0027ve been away from home.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a nice set, and don\u0027t make any decisions on it until you\u0027ve seen what it does overall in practice.  Yes there are a few really powerful engines - that\u0027ll take millions if not billions of funds to fuel.  (You can find the fuel off-world... It a couple of *very* hard to get to places.)  Or there are some moderately powerful engines - which will burn more fuel than you think.  Or there are a variety of more normal \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E engines.  Etc.  It\u0027s a set that\u0027s designed to be more than just parts, and you have to look beyond the parts to how everything works to see the real balance.\n\u003C/p\u003E\n"}]}