{"TopicId":156277,"ForumId":32,"TopicTitle":"Is Kerbal society global, or made up of nations?","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2017-02-10T23:28:02Z","PageNum":1,"Articles":[{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2017-02-10T23:28:02Z","Content":"\n\u003Cp\u003E\nIt\u0027s a simple question, just one I\u0027m curious to see people\u0027s opinions about.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me, Kerbals seem to be a peaceful, curious, and silly group of individuals that wouldn\u0027t have much interest in warfare. Sure, there can be squabbles, that\u0027s only natural. I can see Kerbals arguing about getting the last snack in a vending machine, or something of that nature. I just don\u0027t believe that any one group of Kerbals would band together to form some sort of exclusive group like a nation, that would then attack or defend itself for any real purpose. Kerbals just seem like they would all get along at the end of the day, you know?\n\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2017-02-11T05:27:32Z","Content":"\n\u003Cp\u003E\nAgreed, to me it seems Kerbals are the developed descendants of \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022 rel=\u0022\u0022\u003E@Snark\u003C/a\u003Es avatar.\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cbr\u003E\nBunch of peacefull radiation immune big waterbears.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-02-11T07:54:39Z","Content":"\n\u003Cp\u003E\nPersonal head-canon.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal civilization started as a system of what were effectively city-states. Those states began to coalesce and were well on the way to becoming nations when  a major global crisis struck. The first reaction of the proto-nations was to compete against each other, each trying to secure the resources and land necessary to overcome the crisis. It took a great and far-sighted leader to establish an effective Bill of Rights for all the inhabitants of Kerbin, together with a world government - the Council of Twelve Pillars - to enforce it. His name? Jebediah Kerman.\n\u003C/p\u003E\n\u003Cp\u003E\nToday, the nearest Kerbin has to nations are the six administrative units known as Regionalities. The Council of Twelve Pillars itself was founded on strict principles of honesty, integrity, transparency, and duty to one\u0027s fellow kerbal that have truly stood the test of time. For example, take this statement to the Council made by one Jerfun Kermol. For reference, Jerfun is a respected figure and a leader in his own right.\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003E“Do you, Jerfun Kermol, wish to place your petition on the public record?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003E“Madame President, I do.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003EThe twelve kerbals at the table sat up a little straighter. One or two of them exchanged brief looks. Up in the press gallery, Dondrin leaned forward intently. Burvis kept her face carefully impassive.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003E“By order of this Council, a petition so placed shall be deemed accurate and inviolable. Any false statement made therein, whether purposeful or inadvertent, does constitute a betrayal of these Twelve Pillars, punishable consecutively, to the fullest extent possible by law, in each of the Six Regionalities of Kerbin.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003E“Does now the Petitioner, in full and complete knowledge of the consequences of his actions, wish to place his petition on the public record?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n\u003Cem\u003EJerfun didn\u0027t hesitate. “Madame President, I do.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-size:14.000000953674316px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-11T08:18:46Z\u0022 title=\u002202/11/2017 08:18  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 11, 2017\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-02-11T09:56:38Z","Content":"\n\u003Cp\u003E\nKerbals are descended from a highly territorial swamp-dwelling creature. Each small group of primitive swamp-Kerbals ruthlessly defended it\u0027s food gathering area, having developed large sharp teeth and poisonous skin to help in their constant fight to destroy their neighbours.  \n\u003C/p\u003E\n\u003Cp\u003E\nThese traits have been inherited by modern Kerbals. Only a few dozen live on an entire world. On arrival at a new world, they quickly build up a rudimentary space facility with the sole purpose of expanding outwards to conquer more worlds so that they can get as far away from each other as they can. \n\u003C/p\u003E\n\u003Cp\u003E\nKerbals routinely practice eugenics and mothers eat up to 80% of the weaker or discoloured members of their litters. Through this, Kerbals become ever stronger and more vicious.    \n\u003C/p\u003E\n\u003Cp\u003E\n\u0026lt;REDACTED\u0026gt;\n\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2017-02-11T10:40:40Z","Content":"\n\u003Cp\u003E\nKerbin 626 is inhabited by a monoculture with various sub groups.  These groups hold differing opinions on some matters, like the Kraken nutters who think our rockets will provoke the wrath of the gods again. This relates to the mythos that Kerbal once all lived above ground until the day a displeased sky smote them. (Great crater).  Most no long believe such nonsense, although research in the recently discovered desert temple shows that a catastrophic event did happen once.\n\u003C/p\u003E\n\u003Cp\u003E\nThey all live underground (think kerbalized fallout vaults), the only occupied above ground structures being at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nRecently tho, a capsule appeared stranded in orbit, and no one knows where it came from.  This has led to speculation that there may be another group out there, also trying to explore space.  Although oddly no other objects like unaccounted for satellites have been located.\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2017-02-11T12:45:51Z","Content":"\n\u003Cp\u003E\nIf Kerbals are spread around Kerbin, they are not territorial. We know this because Kerbals are free to explore anywhere without fear of attack.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2017-02-11T13:02:26Z","Content":"\n\u003Cp\u003E\nThe player determines nature of the society they build. When you start they have no cities, no homes, no places of work, no factories... just a small collection of buildings on a remote section of the equatorial coast. 1 game-time hour later, the majority of all Kerbals that have ever existed could be in orbit, or could be rapidly distributing themselves across the surface of Kerbin, or could be in a multi-mission ship on its way to Eeloo.\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2017-02-11T13:16:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222951760\u0022 data-ipsquote-contentid=\u0022156277\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221486817151\u0022 data-ipsquote-userid=\u0022111526\u0022 data-ipsquote-username=\u0022GoSlash27\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, GoSlash27 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf Kerbals are spread around Kerbin, they are not territorial. We know this because Kerbals are free to explore anywhere without fear of attack.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBased strictly on how the was the game is designed, and not any fan-works or other sources... I would definitely agree. The surface appears free of any kind of checkpoint or border, and there is no-where one cannot go. Therefor, in my opinion, it\u0027s probably one unified planet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-11T14:10:29Z","Content":"\n\u003Cp\u003E\nI picture my version of Kerbin divided into something like nation-states, but really only for logistical purposes and they pretty much all have amicable relations. There might be disagreements on occasion but actual \u003Cem\u003Ewarfare\u003C/em\u003E is something that just sort of \u003Cem\u003Eisn\u0027t done\u003C/em\u003E. But only one of the nations had the resources and/or motivation to launch a space program, which is (my mentally retconned reason) why the space program in my Mission Report thread is called \u003Cem\u003EHotaru\u003C/em\u003E Space Program rather than \u003Cem\u003EKerbal\u003C/em\u003E Space Program.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally I\u0027ve just never liked the idea of Kerbals killing each other. I\u0027ve messed around with military stuff in KSP before, but when I\u0027ve done so I\u0027ve always used a mod like Human Colored Faces and given them human names.\n\u003C/p\u003E\n"},{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2017-02-11T14:10:38Z","Content":"\n\u003Cp\u003E\nKerbals aren\u0027t native to Kerbin. There is no evidence on Kerbin supporting the evolution of a society that developed space worthy equipment. There are no harbours, cities or other centers of civilisation. In fact there are 4 structures on Kerbin: The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, Baikonur, the old airfield and the Pyramids. Several of the DSN stations are built in locations that obviously are not accessible by road but need airlift. The most prominent hint supporting this theory is the saucer in the northern hemisphere. Furthermore the superior Kerbal construction methods are worth a note - they don\u0027t even need factories or construction sites. All they ever do, is miraculously generating components in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"dr.phees","CreatedById":32383,"CreatedDateTime":"2017-02-11T17:15:23Z","Content":"\n\u003Cp\u003E\nThey are the remnants of a space colonisation went partly wrong. Kerbin was chosen as it sported some interesting things, like the pyramids, where the initial colony was set up.  Another second colony later became the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first colony made one mistake: They opened up the pyramids and set free deadly spores. An ancient intelligent species lived on Kerbin once and somehow created something deadly and accidentally set it free. When they found out what had happened, they created the pyramids as a warning for any interstellar species and decided to bomb their own planets surface clean, except for the warning pyramds, which were sitting in a dry and dead place anyway. The location was called \u003Cem\u003EDeath Valley\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nWell. Now the modern colonists set free that particular curse. They were shocked and decided to find a way off the planet. Since their original space port at the pyramids is too dangerous, they set up a new space program and that\u0027s where you kick in.\n\u003C/p\u003E\n\u003Cp\u003E\nThe airport on the island was an off-limits installation for research flights to other locations like the Death Valley installations. It was considered to be too dangerous in the end and the whole research program was closed down.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbins never built cities and control their own numbers very strictly since they know, that they all have to leave Kerbin at some point.\n\u003C/p\u003E\n\u003Cp\u003E\nTheir currency is necessary, as the resources are very limited in a colony and the currency mainly shows the resource availability.\n\u003C/p\u003E\n"},{"CreatedByName":"Ty Tan Tu","CreatedById":167214,"CreatedDateTime":"2017-02-11T19:14:27Z","Content":"\n\u003Cp\u003E\nAs I understand it it is not based on any type of national borders, but rather lose allegiances to junk yards. While it tends to be regional, affinity for a certain junk yard can be spread out over a large geographical area, much like sports fans here on Earth, \n\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2017-02-11T23:34:37Z","Content":"\n\u003Cp\u003E\nAs per \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/102711-sumghais-ksp-fanon/\u0022 rel=\u0022\u0022\u003Emy personal headcanon\u003C/a\u003E,\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKerbals are native to Kerbin\n\u003C/li\u003E\n\u003Cli\u003E\nVarious empires and nation-states rose and fell over the course of millennia\n\u003C/li\u003E\n\u003Cli\u003E\nAround KY 460, tensions between three major power blocs, led by the Confederate States, Krussian People\u0027s Republic and Honko Hegemony, escalate into \u003Cstrong\u003EThe Great Kerbin War\u003C/strong\u003E over territory and resources\n\u003C/li\u003E\n\u003Cli\u003E\nThe conflict, lasting over three decades, drove military and technological innovation, such as the evolution of experimental rocketry into intercontinental ballistic missiles\n\u003C/li\u003E\n\u003Cli\u003E\nFor reasons unknown to this day, the Confederate States, on the verge of total victory, called for a truce,\n\u003C/li\u003E\n\u003Cli\u003E\nThe resulting armistice eventually led to the formation of the \u003Cstrong\u003EKerbal Federation\u003C/strong\u003E, a constitutional, liberal, and representative democracy governed by a council of representatives from each major nation-state, whose seat of government, legislature and judiciary is located in the Confederate States capital, Kerbin City\n\u003C/li\u003E\n\u003Cli\u003E\nThe Kerbal Space Program, overseen by the Federation Science Council, was originally conceived to launch an artificial satellite in observance of the International Keophysical Year (IKY) in KY 506; this quickly expanded into a manned spaceflight program, a publicity stunt that eventually grew to stand on its own scientific merits\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2017-02-12T04:08:24Z","Content":"\n\u003Cp\u003E\nAs far as The Asteroid Sentinels are concerned, it\u0027s probably quite unified, but I wouldn\u0027t describe my Kerbals as exactly peaceful... \n\u003C/p\u003E\n\u003Cp\u003E\nKerbin is unified under the \u0022Kerbal Union\u0022 but it\u0027s formation is quite recent, being a mere few decades ago, before that the planet was somewhat divided territorially. \n\u003C/p\u003E\n\u003Cp\u003E\nThere are still divides culturally and in language, which explains the tendency for a certain Wernher to speak and occasionally insert a word of his native dialect.\n\u003C/p\u003E\n\u003Cp\u003E\nMy kerbals are also quite peaceful, but of course the events in The Asteroid Sentinels has revealed a dark side to Kerbal nature...\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-02-12T13:36:25Z","Content":"\n\u003Cp\u003E\nI think that Kerbals live underground, in bunkers to protect themselves from the harsh environment above the surface. Maybe they are not used to Kerbin that much. Also explains why they dont have cities above the surface and why they prefer to have spacesuits on above the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbals dont really have different nations, cultures just never meet, the only culture we know of right now is the Kerbal Familiaris, we may never know, there might be Xeno-Kerbals hiding under the ground.\n\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2017-02-12T13:39:47Z","Content":"\n\u003Cp\u003E\nThere is no Kerbal civilization, just one lonely base. Kerbins aren\u0027t born either, they merge out of another dimension, typically in capsules orbiting planets and moons.\n\u003C/p\u003E\n"},{"CreatedByName":"Mr. Me","CreatedById":29791,"CreatedDateTime":"2017-02-13T16:45:46Z","Content":"\n\u003Cp\u003E\nI think that Kerbin is small enough for a one-country system to logistically run, therefore allowing mutual cooperation in space exploration.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2017-02-14T00:31:43Z","Content":"\n\u003Cp\u003E\nI think Kerbals are born from Kerbin itself, and their goal is to spread life throughout the universe. Thus, they have no concept of nations or territory.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-14T00:34:01Z\u0022 title=\u002202/14/2017 12:34  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 14, 2017\u003C/time\u003E by cubinator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2017-02-14T00:32:24Z","Content":"\n\u003Cp\u003E\nOne planetary community of Kerbals... at least that is what it is in my Kerbalverse...\n\u003C/p\u003E\n"},{"CreatedByName":"Captain Vlad","CreatedById":106306,"CreatedDateTime":"2017-02-14T01:09:09Z","Content":"\n\u003Cp\u003E\nThey\u0027re unified.  They\u0027re peaceful.  They\u0027re smart enough to realize that they could use violence.  They\u0027re smart enough to know that\u0027s kind of a silly way to do things when there\u0027s an entire universe out there to explore.  I feel they\u0027d regard us as primitive and naive if they could watch from afar.  I don\u0027t imagine them as being divided into countries;  I imagine they wouldn\u0027t see the point in that.  I also don\u0027t imagine there\u0027s as many of them as there are humans on Earth.  Cities, yes, companies, yes, but I feel they deliberately leave Kerbin as unspoiled as they possibly can, which includes population controls....with the caveat that the exploration of the stars is worth whatever they have to do.  I think they have a long-term survival strategy, long-term enough that their star\u0027s lifespan is a worry.  They want to be out there in the galaxy long before that even starts to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think they\u0027re perfect.  I think they sometimes err far too much on the side of bravery and have a \u0022MORE POWER!\u0022 fixation that rivals Jeremy Clarkson.  I think they can confuse pragmatism and timidity.  I feel they\u0027re stubborn as all hell;  they may not go to space today, but they WILL. GO. TO. SPACE.  All of them, eventually.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-14T01:09:57Z\u0022 title=\u002202/14/2017 01:09  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 14, 2017\u003C/time\u003E by Captain Vlad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2017-02-14T02:30:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222954543\u0022 data-ipsquote-contentid=\u0022156277\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221487034549\u0022 data-ipsquote-userid=\u0022106306\u0022 data-ipsquote-username=\u0022Captain Vlad\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Captain Vlad said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think they\u0027re perfect.  I think they sometimes err far too much on the side of bravery and have a \u0022MORE POWER!\u0022 fixation that rivals Jeremy Clarkson.  I think they can confuse pragmatism and timidity.  I feel they\u0027re stubborn as all hell;  they may not go to space today, but they WILL. GO. TO. SPACE.  All of them, eventually.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u002B1 for Jeremy Clarkson reference, \u002Binfinity for inspiring kerbal-ness.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2017-02-14T03:44:24Z","Content":"\n\u003Cp\u003E\nSerious answer: It\u0027s a game with no story behind it.\n\u003C/p\u003E\n\u003Cp\u003E\nProject Intrepid Canon answer: Kerbin is divided somewhat into countries. They are mostly peaceful, and are more like states and regions than actual countries. Wars are rare, and usually enough to remind people (besides the Flat Kerbin Society) that they should be avoided.\n\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2017-02-14T10:25:57Z","Content":"\n\u003Cp\u003E\nWell, when I took over Kerbaikonur \u003Cem\u003Eand started mining gold right from under its launchpad\u003C/em\u003E no kerbal protested, so I don\u0027t think it\u0027s actually divided into countries, or even has any government for that matter.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2017-02-15T02:37:04Z","Content":"\n\u003Cp\u003E\nI haven\u0027t really put much thought into it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022From space I saw Earth -- indescribably beautiful and with the scars of national boundaries gone.\u0022 -Muhammad Faris\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022National boundaries are as invisible as meridians of longitude, or the Tropics of Cancer and Capricorn. The boundaries are arbitrary. The planet is real.\u0022 -Carl Sagan\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022When you\u0027re finally up at the moon looking back on earth, all those differences and nationalistic traits are pretty well going to blend, and you\u0027re going to get a concept that maybe this really is one world and why the hell can\u0027t we learn to live together like decent people.\u0022 -Frank Borman\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I really believe that if the political leaders of the world could see their planet from a distance of 100,000 miles their outlook could be fundamentally changed. That all-important border would be invisible, that noisy argument silenced. The tiny globe would continue to turn, serenely ignoring its subdivisions...\u0022 -Michael Collins\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The first day or so we all pointed to our countries. The third or fourth day we were pointing to our continents. By the fifth day, we were aware of only one Earth.\u0022 -Sultan bin Salman Al-Saud\n\u003C/p\u003E\n"},{"CreatedByName":"Rocketscience101","CreatedById":12864,"CreatedDateTime":"2017-02-18T05:32:58Z","Content":"\n\u003Cp\u003E\nI believe Kerbal are native to the small area where the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E is. Possibly in th grasslands. I don\u0027t think they have spread very far and spend much of their time in caves. Other than the desert and the small island, they try and remain hidden. The Kerbals recently came out from their caves, and discovered the stars. Absolutely transfixed they immediately abandoned their traditional ways and pooled all their resources to, and I quote \u0022get a closer look\u0022. \n\u003C/p\u003E\n"}]}