{"TopicId":156308,"ForumId":50,"TopicTitle":"Moon","CreatedByName":"cratercracker","CreatedById":171449,"CreatedDateTime":"2017-02-11T16:54:35Z","PageNum":1,"Articles":[{"CreatedByName":"cratercracker","CreatedById":171449,"CreatedDateTime":"2017-02-11T16:54:35Z","Content":"\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EThe Moon\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E \u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E \u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EThe Moon is the most explored body for me in game. But sometimes even a professional player can get serious problems while exploring it….\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003ESo here is a collection of all mission reports form 35 kerbals that been to moon and a base that I have at the east crater\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EMoon is place where everything can go wrong in a second. But if you know what are you doing ,you can deal with them. Moon is full of craters and interesting landscapes like canyons valleys but the only flatland you can find is bottom of the biggest craters on Moon. So it is best to build your bases there.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EDue to lack of atmosphere no aerobraking can be done but the Moon still has a very powerful gravity and you must not disrespect it. But flying an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E is still possible but now you need gimballed engine or \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to maneuver. But pilots of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E must think differently than they think in atmospheric worlds they need to remember that they can’t glide or turn with no using engines,\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E or \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. \u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EWhen you send a rover to the moon you need to check if your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is ok for driving in low gravity. Too much \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E power will make your rover spin at one point. But if you don’t use any \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E you may end up flipped upside down . You can still drive at good speed like 40 m/s but be careful and be aware that you may find yourself flying at suborbital speeds right into crater bottom\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EYou may lose your connection when you are at the bright side so choose landing spots carefully and think about connection. Setting relay is easy but keep in mind that you will need a relay probe orbiting far from kerbin.\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EMoon have contrast spots that have lots of ore and dead zones that have no ore at all. Try not to aim by luck and use scanning satellites\u003Cspan\u003E  \u003C/span\u003Eto get ore and convert it. Try to bring as much drills as you can or drilling process can take months and years. \u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EI hope you got at least a tiny bit of information that can help you with exploring Moon.         P.S it is not HOW TO GET TO MOON it is about how to avoid failures while operating on the Moon\u003C/span\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n"}]}