{"TopicId":156589,"ForumId":21,"TopicTitle":"Skydiving","CreatedByName":"Andetch","CreatedById":173643,"CreatedDateTime":"2017-02-17T11:57:58Z","PageNum":1,"Articles":[{"CreatedByName":"Andetch","CreatedById":173643,"CreatedDateTime":"2017-02-17T11:57:58Z","Content":"\n\u003Cp\u003E\nI searched the forums, and didn\u0027t find exact references to this.....\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone ever gone skydiving? I discovered this when I was playing with super fast planes and my design broke up mid flight resulting in my pilot being in a cockpit that was not attached to anything at 20kms. Remembering stories of WWI pilots (who were never issued parachutes as top brass believed they encouraged cowardice) faced with similar situations I decided to exit the cockpit, and to my surprise the pilot was okay after falling into the sea... It seems to me that as long as the vehicle is subsonic you can get away without burning up. Supersonic skydives tend to end up in the kerbal disappearing in a puff of logic.\n\u003C/p\u003E\n\u003Cp\u003E\nAttached are the screenshots I took.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022http://imgur.com/a/DmoqO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/DmoqO\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WuZewSE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/WuZewSE.png\u0022 width=\u00221024\u0022\u003E\u003Cimg alt=\u0022Z94VNES.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/Z94VNES.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-16T01:16:13Z\u0022 title=\u002203/16/2017 01:16  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 16, 2017\u003C/time\u003E by Andetch\u003C/strong\u003E\n\u003Cbr\u003Epictures added correctly\n\u003C/span\u003E\n"},{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2017-02-17T13:42:14Z","Content":"\n\u003Cp\u003E\nThe kerbals have a ridiculously high impact tolerance of around 30 m/s, while their terminal velocity in Kerbin\u0027s atmosphere is around 25 m/s.\n\u003C/p\u003E\n"},{"CreatedByName":"Andetch","CreatedById":173643,"CreatedDateTime":"2017-02-18T00:05:08Z","Content":"\n\u003Cp\u003E\nWell whatever the numbers (I am more seeing what I can actually do rather than what the numbers say) you gotta hit the water...... Trust me on this *moves to hide the memorial to all the kerbals that tested this theory. Usually hit around 50 m/s, and they do need the jetpack to slow down.\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2017-02-18T00:31:24Z","Content":"\n\u003Cp\u003E\nKerbals have more chances to survive splashdown when hitting the water head-on. Don\u0027t know about landing though.\n\u003C/p\u003E\n"},{"CreatedByName":"Andetch","CreatedById":173643,"CreatedDateTime":"2017-02-18T11:37:38Z","Content":"\n\u003Cp\u003E\nYeah, I have discovered they have reinforced helmets...... But at around 50m/s or under (straight down, if you have forward speed these figures can change) they can go into the sea feet first. This revelation could mean the end of needing parachutes on craft coming back to Kerbin!\n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2017-02-19T00:00:18Z","Content":"\n\u003Cp\u003E\nHeh, interesting idea.  The world\u0027s first manned spacecraft - USSR\u0027s Vostok - did not include a manned landing; the pilot bailed out after re-entry and parachuted solo.  Your kerbal could EVA in the low atmosphere, grab science reports, and ditch.  But just to save the cost (funds and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E) of some chutes, seems unnecessary\n\u003C/p\u003E\n"}]}