{"TopicId":157064,"ForumId":16,"TopicTitle":"Rendezvous Markers Seem Buggy, Label Details","CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-02-27T16:18:13Z","PageNum":1,"Articles":[{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-02-27T16:18:13Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022R56Kwe9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/R56Kwe9.png\u0022 width=\u0022494\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-27T17:09:54Z\u0022 title=\u002202/27/2017 05:09  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 27, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-02-28T01:31:34Z","Content":"\n\u003Cp\u003E\nThanks for the screenshots... but can you be a bit more specific what the problem is?  What is it that you\u0027re seeing that seems wrong, exactly?\n\u003C/p\u003E\n"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2017-02-28T10:14:03Z","Content":"\n\u003Cp\u003E\nEverything looks quite normal. \n\u003C/p\u003E\n\u003Cp\u003E\nYou see two \u0022close\u0022 approaches that are both not at all close. The timing of these particular orbits is probably not ideal so that the objects miss each other and never get closer although the orbits are touching.\n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-02-28T15:21:53Z","Content":"\n\u003Cp\u003E\nSorry, I actually wrote a different title but canceled out and changed it after I figured out I was a bit wrong, I made a minor issue a big deal but a bigger deal just a small mention, in the heat of the moment I just left the image.\u003Cbr\u003E\u003Cbr\u003E\nI went into a long session yesterday and the day before and went to sleep at 3 AM which is not recommended, I never have nightmares but I had a few creepy moments of feeling half-asleep and dreaming I was holding a fizlling phone that was just about to blow up it\u0027s battery which woke me up for a moment lol, but I learned a lot despite unfortunately losing nerves because of the clunkyness of the controls and other minor things, I think I spent like 4 hours trying to dock, but that is just me being used to FPS and RTS games I guess, yes I am not experienced with the control scheme, but it wasn\u0027t the controls that much, the Dock Port Targeting mod thankfully has those \u0022invert axis\u0022 options so that helped, but I had to redo my whole Satellite Core that night because of bad design issues around the whole \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E navigation, I had pods upside-down and I went overkill with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, I removed all SpaceY mod \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E parts and replaced with stock 4-direction ones and placed them even-angle aligned with the snap-to-angle mode so all the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E are only on the true-north-south-east-west side of the spacecraft, a lot of fiddling with center of mass and I think I solved that whole thing, but I didn\u0027t try it yet, will do in some days as I get time.\u003Cbr\u003E\u003Cbr\u003E\nSearching on some videos thanfully provided the answers that are kinda not self-explanatory in the game, I did read a lot of tips, but a lot of the times when I kinda go into these \u0022let\u0027s figure new thing out\u0022 sessions I usually want to go down to the meat and potatoes and not read tons of documentation for hours beforehand, so that is definitely my fault. The point is I realize this and a lot of complaints would be very subjective so I just cut it out and I\u0027ll just post objective things which I think are real bugs or. \u003Cbr\u003E\u003Cbr\u003E\nI just installed like 10 mods 2 days ago after I played got this game since like 0.9 but I never ever played more than a few hours I was just fiddling around not doing much serious, no it\u0027s not the game, it\u0027s that I don\u0027t game a lot as much as I did, it\u0027s like only like 5 games, a few 10 hours a month, it\u0027s all working very nice without any crashes, ofcourse it starts lagging when certain part numbers are reached but it\u0027s been better technically than I expected. I just don\u0027t like that the music keeps playing when I alt-tab out to windows desktop, and some mods keep listening to key-commands when I write a save game, when I press P some mod activates/deactivates it self, one other button was some \u0022Administration mode\u0022 or something. But I do not think I have any mod that changes anything with the map orbit display, unless one is doing something I don\u0027t know, here is the list of mods:\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n26.02.2017  08:23    \u0026lt;DIR\u0026gt;          AtmosphereAutopilot\u003Cbr\u003E\n26.02.2017  08:11    \u0026lt;DIR\u0026gt;          B9PartSwitch\u003Cbr\u003E\n25.02.2017  19:30    \u0026lt;DIR\u0026gt;          CommunityCategoryKit\u003Cbr\u003E\n26.02.2017  08:11    \u0026lt;DIR\u0026gt;          CommunityResourcePack\u003Cbr\u003E\n26.02.2017  08:13    \u0026lt;DIR\u0026gt;          FuelTanksPlus\u003Cbr\u003E\n25.02.2017  19:30    \u0026lt;DIR\u0026gt;          \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\u003Cbr\u003E\n27.02.2017  22:59    \u0026lt;DIR\u0026gt;          KerbalEngineer\u003Cbr\u003E\n25.02.2017  19:30    \u0026lt;DIR\u0026gt;          \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\u003Cbr\u003E\n25.02.2017  19:47    \u0026lt;DIR\u0026gt;          MechJeb2\u003Cbr\u003E\n22.02.2017  01:24            74.752 ModuleManager.2.7.5.dll\u003Cbr\u003E\n26.02.2017  08:18         1.988.815 ModuleManager.ConfigCache\u003Cbr\u003E\n26.02.2017  08:18           131.301 ModuleManager.ConfigSHA\u003Cbr\u003E\n26.02.2017  08:18             8.882 ModuleManager.Physics\u003Cbr\u003E\n26.02.2017  08:18            31.422 ModuleManager.TechTree\u003Cbr\u003E\n25.02.2017  19:45    \u0026lt;DIR\u0026gt;          NavyFish\u003Cbr\u003E\n26.02.2017  08:11    \u0026lt;DIR\u0026gt;          NearFutureElectrical\u003Cbr\u003E\n26.02.2017  08:11    \u0026lt;DIR\u0026gt;          NearFuturePropulsion\u003Cbr\u003E\n25.02.2017  19:47    \u0026lt;DIR\u0026gt;          NearFutureSolar\u003Cbr\u003E\n26.02.2017  08:13    \u0026lt;DIR\u0026gt;          PlanetShine\u003Cbr\u003E\n26.02.2017  08:14    \u0026lt;DIR\u0026gt;          ReentryParticleEffect\u003Cbr\u003E\n25.02.2017  19:47    \u0026lt;DIR\u0026gt;          SCANsat\u003Cbr\u003E\n25.02.2017  19:47    \u0026lt;DIR\u0026gt;          SpaceY-Lifters\u003Cbr\u003E\n01.02.2017  17:31    \u0026lt;DIR\u0026gt;          Squad\u003Cbr\u003E\n26.02.2017  08:14    \u0026lt;DIR\u0026gt;          TriggerTech\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI actually didn\u0027t use much of the stuff yet, mostly engines, fuel tanks, not only it\u0027s too muh at once but I also purposelly want to gradually discover things so the experience is more slower and prolonged, and some of the stuff probably has to be enabled ingame before it\u0027s active, no I didn\u0027t use MechJeb on any of these flights.\u003Cbr\u003E\u003Cbr\u003E\nBut I might do a specific thread later to post all my things that bothered me, kind of like a list of the top things, I know a lot about gaming, but this is more like a simulator, yes I turned into simulators in later times, for any software like this minor things can ruin the experience quickly no matter how good the rest of the game is.\u003Cbr\u003E\u003Cbr\u003E\nSome of the most little things can sometimes mean a whole lot, I think this is very healthy feedback, now this can actually help all the other newcomers that may not be gamers for a long time and they certainly won\u0027t have the patience to sit 5 hours in front of documentation, \n\u003C/p\u003E\n\u003Cp\u003E\nHighlights in this 3 day session: (first day i had no mods but didn\u0027t do much anyway)\n\u003C/p\u003E\n\u003Cp\u003E\n- No right click menu button to unset target (extremely annoying that this cannot be done by clicking in the menu, I think one of the mods that displays stats had a button)\n\u003C/p\u003E\n\u003Cp\u003E\n- Fuel Crossfeed lines actually affect how tanks get emptied, plesant surprise.\n\u003C/p\u003E\n\u003Cp\u003E\n- Can\u0027t click on the commanding ship to set focus to it (ragemode, and you can\u0027t view controls ingame, so all the way to some post to find the key which was tab, and even that needs a lot of toggling to get to my ship, it\u0027s , it\u0027s more about that it killed the experience for a good 15 minutes)\n\u003C/p\u003E\n\u003Cp\u003E\n- Editor camera movement limitations, can\u0027t get close enough in some areas even with a lot of fiddling, but it was one of the bigger ones so it\u0027s not a problem most of the time, sometimes I kinda have to make a structure around it, it would be nice to have more buffer, Secondly there are lmitations to zoom amounts depending on which way camera is positioned at, despite looking from the ground up 90 degrees, I can\u0027t zoom in to better what I\u0027m doing up there. Thirdly the camera can\u0027t focus on a different point, it\u0027s fixed to one point in the hangar and can only rotatate and move relative to that point.\n\u003C/p\u003E\n\u003Cp\u003E\n- Can\u0027t build parts on their own or at least cant build more modules of a rocket at the same time, se can\u0027t move the camera and use the editor when there\u0027s no primary command pod even if there are other unattached comand pods around.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I said, don\u0027t take personally the enraged points, there\u0027s a lot of factors including being behind the PC the whole day, however, I would always develop something so these things are avoided and even in such events which in the wild out there will continue to happen, someone\u0027s going to have a bad day and he wants to ride it out, I mean, I tend to play such games only at times when I am not in a mood to do real work and other chores, not always true and in this case it was half-half.\n\u003C/p\u003E\n\u003Cp\u003E\nI was tolerating a lot of lag once I got over 300 parts or something, basically every 10-20 seconds the whole game freezes for a few moments, this is probably some part of the engine getting clogged up not being up to par and it\u0027s unfortunate that it is mucking up things a bit, because the rest of the time the game is still smooth, I mitigated this by taking a break and restarting the application, thisfreeze- lag is present across the whole game, in editor and in main menus.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll just stop here or else it\u0027ll turn into a wall of text.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThe thread I was writing before was about label details at the \u0022Intersect 1\u0022 markers, I just couldn\u0027t understand the whole intersect thing because of the inconsistency, the pictures you see above is actually a real bug that was confusing me thinking that there\u0027s a range, the intersect marker I think only appears when the orbits intersect but within 5 kilometer buffer, well, it looks like this buffer is WAY too big and way too off, and I kept looking at the ascending and descending nodes and thinking that is the intersection, it\u0027s just that terminology is field-specific but also context-specific and that was a big confusion, if you look at the horizontal view, the orbits lines do \u0022intersect\u0022, but that is only in 2D illusion when you\u0027re looking from the side like that, so this Rendezvous Intersection is a real one, I thought that the marker was similar to the ones for planets when you have a flyby and closest approach, but I have a more detailed thoughts all about that and right now I don\u0027t want to make this more complex by mixing too much all in one, basically I\u0027d like the labeling and terminology to be more specific rather than vague like \u0022Distance:\u0022 or \u0022Speed\u0022 as well as Periapsis ..etc and other markers because these things change when the target changes so it\u0027s a more relative sometimes, it could help if the markers would have a suffix or prefix or some kind of extra indication, color probably should be the same, there could be a small tiny character or a \u0022*\u0022 sign added to them or some kind of other icon, you could have more things displayed, some people could think it\u0027s cluttered but so should be optional, cause currently, the same markers that show the current orbit details are moved to the manouvering orbit but they all look the same. Now I don\u0027t have any specific explanation here of how I would have it, this is just a draft of what I\u0027m thinknig about right now.\u003Cbr\u003E\u003Cbr\u003E\nI was confused for some time because the detail labels, the \u0022Separation\u0022 value below on the intersect point shows the distance of the target at that time the commanding ship reaches that point, I kinda expected that would show me how far the orbits are apart, until I figured out it works in another way.\n\u003C/p\u003E\n\u003Cp\u003E\nBut this is just my subjective idea, so I did not want to make it sound like it\u0027s a bug report, just my suggestion.\u003Cbr\u003E\nThis is what I was going to post, without the other obsolete thoughts:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhe intersect point is the intersection of the target orbit, right?, so my idea is it should display the separation distance between the orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy, because it is logical, you have a label \u0022about something\u0022 and more details \u0022about that something\u0022, \u003Cstrong\u003EIntersect Point \u0026gt; Separation: How far is the intersect point away from target orbit \u003C/strong\u003E, would fit way better, that\u0027s the number I was looking for and because that\u0027s what we\u0027re looking at here, this is more correct detail for this label.\n\u003C/p\u003E\n\u003Cp\u003E\nThe current \u003Cstrong\u003E\u0022Separation\u0022\u003C/strong\u003E value which is the \u0022\u003Cem\u003E\u003Cu\u003Eseparation of the target to the intersect marker\u003C/u\u003E\u003C/em\u003E\u0022 shown under the \u003Cstrong\u003EIntersect point\u003C/strong\u003E label should totally fit into the details of \u0022\u003Cstrong\u003ETarget Position At Intersect\u003C/strong\u003E\u0022 and 2 marker labels, which currently has no more details, so it should be simply moved there, not removed.\u003Cbr\u003E\nSo, see how it fits, \u003Cstrong\u003ETarget Position At Intersect\u003C/strong\u003E is talking about the position fo the target, okay, now for the details \u0022and.. \u003Cu\u003E\u003Cem\u003Ehow far is the target away from the intersect point\u0022\u003C/em\u003E\u003C/u\u003E, this and that much. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think that even if the intersection buffer is still as low as 5 km, this would give extra precision, it would still help having this number in my head to better have the situational awareness.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222970509\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488276843\u0022 data-ipsquote-userid=\u0022140720\u0022 data-ipsquote-username=\u0022Chaos_Klaus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Chaos_Klaus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe timing of these particular orbits is probably not ideal so that the objects miss each other and never get closer although the orbits are touching.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI purposelly created this manouver orbit plot so the imo-bug can be seen in action, there\u0027s some other stuff I thought it was weird and had a lot of confusion with but I didn\u0027t had enough grounds for those, I identified them as my beginner inexperience and other categories, this is the one I think it just doesn\u0027t look like it\u0027s intended. Extending the manouver orbit makes the marker disappear, so this is how far the manouver orbit can go before it disappears.\u003Cbr\u003E\nAlso the screenshots are garbled because it was a quick shrink from 1440p, I can provide the full resolution if anyone really needs.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-28T17:16:40Z\u0022 title=\u002202/28/2017 05:16  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 28, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-02-28T19:08:51Z","Content":"\n\u003Cp\u003E\nI forgot to mention that one of the biggest positive things in the editor, is the strut attachment caching when duplicating so it remembers where the connection were and also duplicates appropirately even for the struts that were not sourced on the parts piece that was used for duplicating, remembers the whole thing.\u003Cbr\u003E\nSecondarily, when duplicating more stuff on an duplicated part it treats that as a whole and appends, that\u0027s also a big big deal.\n\u003C/p\u003E\n\u003Cp\u003E\nThese 2 things have a huge effect.\n\u003C/p\u003E\n\u003Cp\u003E\n-----------------------------------------------------------------------\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-28T19:09:14Z\u0022 title=\u002202/28/2017 07:09  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 28, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-02-28T21:14:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222970509\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488276843\u0022 data-ipsquote-userid=\u0022140720\u0022 data-ipsquote-username=\u0022Chaos_Klaus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Chaos_Klaus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEverything looks quite normal. \n\u003C/p\u003E\n\u003Cp\u003E\nYou see two \u0022close\u0022 approaches that are both not at all close. The timing of these particular orbits is probably not ideal so that the objects miss each other and never get closer although the orbits are touching.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay, if it\u0027s showing closest approach, then I disagree with this behavior using this marker, because the marker is about intersection and it also doesn\u0027t provide how far away, this would help with precise manouver plotting when there\u0027s a lot of unclarity\u003Cbr\u003E\nThere is no indication this is showing closest approach to the target orbit, see, what I talked about before, there\u0027s imo mixed up contexts and things being vague with various things.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIntersection markers should be shown, switched to, only when the the orbits are within X kilometers, 5 sounds a good number, if it\u0027s more than five then the marker whould switch to a different lookign and differently colored appropriately labeled \u0022closest-approach\u0022 marker.\u003Cbr\u003E\u003Cbr\u003E\nThe biggest thing this game needs to pay attention is the map clarity as it is the most critical area because it\u0027s very easy to be disoriented in space and even more when we have to represent this in software simulation on non optimal devices, I do have a good machine with 1440p and RX480 tho, as far as performance goes there\u0027s no big problem in my case.\n\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2017-03-01T00:37:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222971157\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488316448\u0022 data-ipsquote-userid=\u0022152058\u0022 data-ipsquote-username=\u0022Wader8\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Wader8 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOkay, if it\u0027s showing closest approach, then I disagree with this behavior using this marker, because the marker is about intersection and it also doesn\u0027t provide how far away, this would help with precise manouver plotting when there\u0027s a lot of unclarity\u003Cbr\u003E\nThere is no indication this is showing closest approach to the target orbit, see, what I talked about before, there\u0027s imo mixed up contexts and things being vague with various things.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe intersect markers show the relative position of your ship and the target ship on the next orbit. If you hover the mouse over the marker you\u0027ll get the distance between the ships at that time. The practical upshot of this is that after you\u0027ve passed your ship\u0027s position marker you can raise or lower the other side of your orbit to change your orbital period and bring the projected markers together (assuming you aren\u0027t dropping your periapsis ito the atmosphere) for a rendezvous.\n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-01T15:36:25Z","Content":"\n\u003Cp\u003E\nAdditionally, can someone explain the contexts of the markers here? I know what they are but I\u0027d like to hear from someone else to check if I\u0027m correct.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022zfw7axi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/zfw7axi.png\u0022 width=\u0022755\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nBottom View:\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00220k8yaW2.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0k8yaW2.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1. So the encounter spans for as long as I\u0027m inside the Kerebin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E ? (yes)\u003Cbr\u003E\n2. Being inside kerebin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E for some time affects the orbit slightly so that\u0027s why the brown path turns into purple? (yes)\u003Cbr\u003E\n3. The end of the Kerebin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E is the Kerebin Escape point ? (yes)\u003Cbr\u003E\n4. Why is the closest-approach markers put on the Kerebin-Escape point? (no idea)\u003Cbr\u003E\n5. Are the closest-approach markers showing now for the next orbit that will appear when kerebin escape is reached?\u003Cbr\u003E\n6. What is \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E relative to, is that the closest point in the encounter? (looks like it)\u003Cbr\u003E\n7. If 6 not true - What about the marker for that?\u003Cbr\u003E\u003Cbr\u003E\nTo me, closest-approach markers are confusing in this case, even if they\u0027re showing something else, they are still the same color, same icon, they should be indicating to what they\u0027re relative to, or simply hidden, if you agree.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EAdditionally, the Closest-Approach markers disappear when Kerebin is not set as a target.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022cv5QlxT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/cv5QlxT.png\u0022 width=\u0022925\u0022\u003E\u003C/strong\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n---------------------------------------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nWith the following picture it is more clear, I shifted the manouver to separate the green, which apparently is the new orbit generated from the shift caused by Kerebin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, right.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XXN5eY0.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XXN5eY0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFrom basic operation I have seen that the Closest-Approach markers start showing things relative for the manouver\u0027s orbit, away from showing things about the current orbit.\u003Cbr\u003E\u003Cbr\u003E\nSo my speculation is that these markers always want to display things relative to the most forward orbit, including manouver orbits, and here in this case we have a tertiary orbit that\u0027s in green (\u003Cu\u003Esecondary\u003C/u\u003E if you only count manouvers), so these markers are probably relative to that green orbit and showing things about what will happen when the ship revolves the first time around it, and where is the bug in this if at all, not sure exactly, but one scenario is that I guess it\u0027s not counting for 1 revolution across the green orbit and it\u0027s showing the Closest-Approach for the start of the green orbit, and the start of the green orbit starts at the end of the Encounter, at the Escape point, that would explain why the marker it\u0027s fixed onto it. It may not be a bug as in a code error, but it may be unintended behavior, whatever it is, I don\u0027t agree with it and hopefully the devs would agree it should be changed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHowever:\u003C/strong\u003E Whatever the Closest-Approach markers are showing now or in future after this \u0022fixed-onto-Escape-Point\u0022 is changed, a lot of beginner confusion would be avoided \u003Cstrong\u003Eif their color would be appropriately tied to the same color as the color of the orbit or manouver they\u0027re relative to\u003C/strong\u003E. That would clear thigns up for just about everyone, not just beginners, Periapsis and Apoapsis and other things, they all have their \u003Cstrong\u003Ecolors synced\u003C/strong\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nPS: Correction, earlier I said that there\u0027s no way to unset a target, well, it appears it is possible to do this with planets and such, but in that session I still didn\u0027t figure it out.\u003Cbr\u003E\u003Cbr\u003E\nBTW: I was trying to rename the thread title  into Various not \u0022Rendezvous\u0022 since I expected to see more things as I dug deeper, but the edit didn\u0027t stick throught the edit process I guess.\u003Cbr\u003E\u003Cbr\u003E\n------------------------------ Update:\u003Cbr\u003E\nContinuing, I changed and fiddled with the manouver a bit more to create one heavily convoluted one. \n\u003C/p\u003E\n\u003Cp\u003E\nTwo things stand out. Closest-Approach markers probably aren\u0027t technically tied to the Escape Point, as this pictures show, are those example\u0027s coincidences? Well even if it\u0027s showing correctly, it should be more clear that it is showing about the next orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second thing is, I am correct that the markers always show the most forward manouver orbit, in this case it\u0027s showing for the blue orbit, there\u0027s like 3-4 orbits behind it.\u003Cbr\u003E\u003Cbr\u003E\nThis one isn\u0027t showing any C-A markers here ...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yVryUG8.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/yVryUG8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022PbdCtdb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022328\u0022 src=\u0022http://i.imgur.com/PbdCtdb.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHit the Mun too.\u003Cbr\u003E\u003Cimg alt=\u0022zfg4MFs.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zfg4MFs.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00228cDFJNa.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8cDFJNa.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nIn this case it doesn\u0027t fall on the escape point, so at least proving the point that it could be a coincidence in eariler examples, it may not fall always on the escape point later on. Still the color of the marker is the same, everything\u0027s the same as if it were showing things for the first orbit, so when there\u0027s a lot going on, it can lead to confusion.\u003Cbr\u003E\u003Cbr\u003E\nThere\u0027s an unrelated effect I found, when focusing camera to Kerebin, which for me is a bug.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022etBnU9i.png\u0022 class=\u0022ipsImage\u0022 height=\u0022589\u0022 src=\u0022http://i.imgur.com/etBnU9i.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-01T18:00:46Z\u0022 title=\u002203/01/2017 06:00  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 1, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2017-03-01T18:04:42Z","Content":"\n\u003Cp\u003E\nThere are a few ways to unset a target.  Double-clicking should do it, as will single-clicking then selecting \u0022unset target\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the closest approach markers act sort of oddly when you intercept something\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E, so focus your view on that object and adjust from there.\n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-01T19:37:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222971986\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488391482\u0022 data-ipsquote-userid=\u0022102688\u0022 data-ipsquote-username=\u0022Kryxal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Kryxal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere are a few ways to unset a target.  Double-clicking should do it, as will single-clicking then selecting \u0022unset target\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the closest approach markers act sort of oddly when you intercept something\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E, so focus your view on that object and adjust from there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s why I suggested it should be removed(hidden) until it\u0027s working better better because I think it\u0027s doing more bad than good.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-----------------\n\u003C/p\u003E\n\u003Cp\u003E\n-----------------\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing. When focusing on an encountering object, the Escape Path is shifted, I don\u0027t know the purpose of this, but it doesn\u0027t feel like it\u0027s intended, it feels broken.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022YqMlgaG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/YqMlgaG.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022eSu08EK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eSu08EK.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-01T21:07:00Z","Content":"\n\u003Cp\u003E\nAnother thing:\u003Cbr\u003E\u003Cbr\u003E\nWhy is there no descending and ascending nodes for the orbiting object, to see the inclination value?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Biggen","CreatedById":173719,"CreatedDateTime":"2017-03-01T22:59:48Z","Content":"\n\u003Cp\u003E\nI kinda skimmed your posts a bit but here are a few things:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Closest approach land wherever they land. Just depends on your orbit (or your new maneuver orbit) and the targets orbit. They are not tied to any escape \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n2. You only get closest approach if you set a target. If you unset it, you lose the closest approach.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Your predicted escape path didnt shift, you just werent zoomed in far enough to see it clearly.\n\u003C/p\u003E\n\u003Cp\u003E\n4. You are correct, you dont get An/Dn nodes if your are in an objects \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. You have to use \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E to get inclination info if you want it.\n\u003C/p\u003E\n\u003Cp\u003E\n5. You need a mod like precise node to change the trajectory paths (conics mode) you see on the screen. Some are more intuitive than others.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do to to make a rendezvous is to create a maneuver and push out my orbit to the targets orbit until they overlap. Unless inclination is severely off, you will get closest approach markers. Once you have the markers just adjust your maneuver orbit to bring those markers nose to nose until you get the encounter. It shouldnt take more than a couple minutes once you get the markers to show onscreen.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-01T23:01:35Z\u0022 title=\u002203/01/2017 11:01  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 1, 2017\u003C/time\u003E by Biggen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2017-03-02T02:40:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222972088\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488397042\u0022 data-ipsquote-userid=\u0022152058\u0022 data-ipsquote-username=\u0022Wader8\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Wader8 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnother thing. When focusing on an encountering object, the Escape Path is shifted, I don\u0027t know the purpose of this, but it doesn\u0027t feel like it\u0027s intended, it feels broken.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022YqMlgaG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/YqMlgaG.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022eSu08EK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eSu08EK.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s the same path, just from a different perspective.\n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-02T16:03:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222972340\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488409188\u0022 data-ipsquote-userid=\u0022173719\u0022 data-ipsquote-username=\u0022Biggen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Biggen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n... you just werent zoomed in far enough to see it clearly.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nOverall the map wide solar view seems clunky, not only is it affected by the periodic lag (every X second freeze for a moment) when a ship reaches certain number of parts, both my ships are originally ~750 parts and 5-6 stages, most of that is ejected later and more like a 100 parts remain for the satellite modules.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is also hard to navigate not only because of the mouse hit box for various interactive thigns, but also because of the camera zoom levels not being precise enough as well as no ability to focus the camera on various markers and the manouver node it self.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00222Mt5w2n.png\u0022 class=\u0022ipsImage\u0022 height=\u0022651\u0022 src=\u0022http://i.imgur.com/2Mt5w2n.png\u0022 width=\u00221000\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAre you kidding, I wasn\u0027t zoomed in enough? It takes ages of fiddling with angles just to get these shots I\u0027ve made. Most of the pictures are maximum zoom, it is very frustrating to do anything as the mouse cursor hits several hit-boxes and it\u0027s very hard to precisely edit the manouver, but it\u0027s also hard to focus on the predicted encounter because if there\u0027s no target or your ship close by you can\u0027t get that many good angles.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222972340\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488409188\u0022 data-ipsquote-userid=\u0022173719\u0022 data-ipsquote-username=\u0022Biggen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Biggen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI kinda skimmed your posts a bit but here are a few things:\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m trying to do critical analysis, which I enjoy doing for a bit while I play at the same time, your posts would then be considered half-half if you do not put the amount of effort in it takes, causing more confusion.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I didn\u0027t explain yet that what I\u0027m doing is critical anylsis of the game, I\u0027m not actually trying to achieve something in this case, I\u0027m purposelly doing things to expose weird behavior, while doing this I cannot care how many mods are out there, those are all unofficial and doing testing you suppose to ignore mods can\u0027t tely on them to magically \u0022fix\u0022 the problem, that\u0027s only a temporary convenience for personal use, which I probably will use when I play the game for enjoyment. I\u0027m kinda doign 2 things at the same time, half the time playing, pausing, testing, and then back to playing again, hopefully this clears that out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n----------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\n----------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESorry, I didn\u0027t mean it actually shifted, I mean the GUI drawed path indication shifted.\u003C/strong\u003E I have no idea what is the benefit of this, i see none, infact I think it is detrimental and causes more confusion. There is no indication of how is this helpful. You can see that the object prediction icon sits ontop of the planet, that icon signifies where the planet will be at encounter, but here it is basically canceling it self out, it does not appear it is showing what it has been designed for.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n----------------------------\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI am aware that some areas cannot be done with super fidelity because of performance constaints, but here I\u0027m not trying to get better forward prediction, the above example was an extreme case also, but it seems like it\u0027s not showing the way I\u0027d expect it even for basic encounters. I did hear that the map view has some things to lower computations, I\u0027m not sure exactly where or what, but some of the areas are kinda critical to the game, a \u0022that\u0027s what it takes\u0022 approach could be taken in some cases, while some people may already think about interstellar stuff, I would rather have the existing system work better before moving into more complex features. \u003Cbr\u003E\nI understand now what the path inside encounter is, it\u0027s a \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E relative path, I think it could be indicated better what it is, but this can be done by just adding the missing paths, the brown one is the encounter transition path, the blue one is the \u0022closest-\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E relative\u0022 relative or \u0022primary\u0022 and can be left alone just like it is.\u003Cbr\u003E\nAlso yes the double-relative is not a typo, I kept using the term \u0022relative to\u0022 when talking about what something is showing currently, what it is representing. The blue path is showing (relative to) the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E-relative orbit or encounter path, however this is NOT a real encounter path, the actualy encounter transition, the brown path is missing, this \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E-Relative is only useful if you want to get into the target objet\u0027s orbit, which is most of the time the purpose in normal gameplay, but I think seeing the real solar-system-relative path would be interesting and would clear things up, it would also be interesting to see how much you move with the planet around the sun while also seeing your movement through the closest \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.\u003Cbr\u003E\u003Cbr\u003E\nObviously I am beginning to figure out that this part is a big deal in terms of computation and mathemathics, as everything\u0027s very relative to the current position of everything, \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E influence increases as the source object gets closer, so it\u0027s not that I\u0027m whining, I understand we can\u0027t have this much fidelity for the scope of this game.\u003Cbr\u003E\u003Cbr\u003E\nMy suggestion is just improving little things wherever possible without that much more impact on performance. But I have a good PC so I\u0027m not really that worried, I also do not agree that the whole design of the game be limited to average hardware capabilities that\u0027s like being forced to drive 50mph on the highway just because some other people don\u0027t want to move out of the way, those that can\u0027t run it could turn it off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WN6QZ1f.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/WN6QZ1f.png\u0022 width=\u0022604\u0022\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally Only Closest-\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E-Object relative path/orbit is shown, with the primary blue color, yes the sun-\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E path is shown there in yellow, but the connecting brown line has disappeared, I hope that can be enabled in future, but you can also see that in the upper pre-encounter view the brown path looks as if it\u0027s in a colission course with the object, somewhat nonoptimal behavior, the predicted-target-position icon in brown appears to be showing the position when the source object reaches PE.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is the closest approach, the \u0022closest-approach\u0022 markers showing the closest approach for the next orbit are useless in this case and only producing clutter and confusion. The closest-approach markers should be re-enabled when the source object gets past the\u003Cbr\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E it is encountering (closest), after Duna Escape, could be one of the solutions, but then I think there could be some situations when it could be useful, I don\u0027t want to come here and take something away from people.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, Closest-Approach markers are extremely relative, relative to current revolution, relative to most farthest auto-predicted and/or manual-manouver orbit, and relative to where-ever is the closest-approach in that orbit - \u003Cstrong\u003ESo the closest approach in the newly created orbit after Duna Escape happens to be right after the Escape, because there\u0027s no other closer point down the line in that orbit\u0027s first revolution. In many cases there might not be another closer enolovely personer than the one you\u0027re going through, so the C-A markers will a lot of the times be showing like they\u0027re tied to the Escape Point, because that\u0027s where the new orbit begins.\u003C/strong\u003E That\u0027s the best i can figure up to this point, about C-A markers.\u003Cbr\u003E\u003Cbr\u003E\nSo this is one of the changes that would make this less confusing:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n- Syncing the Closest-Approach Marker Icon color to the color of the orbit path it is currently relative to.\n\u003C/p\u003E\n\u003Cp\u003E\n- Adding a suffix icon or a star character or a \u0022\u002BN\u0022 number indication, appended at the top right corner the place where \u0022power of\u0022 numbers usually stand, that\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022V59QMdI.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/V59QMdI.png\u0022 width=\u0022843\u0022\u003E\u003Cbr\u003E\u003Cem\u003EPS: For a period of time I kept using \u0022conic patch\u0022 term for the auto-generated ones, then I figured out pretty much all the lines are conic patches being drawn, ones being manual other automatic.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-02T16:17:52Z\u0022 title=\u002203/02/2017 04:17  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 2, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-02T16:23:18Z","Content":"\n\u003Cp\u003E\nNow I\u0027m reading more about what this \u003Cu\u003Econic patch draw mode\u003C/u\u003E is, I\u0027m still on default settings. Maybe this is the \u0022fidelity\u0022 level I mentioned, maybe this will enable more of the stuff I kept saying was missing? But it will have a performance cost right ?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m in the middle of playing, finish this session, I\u0027ll start testing it later.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.reddit.com/r/KerbalSpaceProgram/comments/1ly5uh/feature_request_conic_patch_draw_mode_and_limit/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.reddit.com/r/KerbalSpaceProgram/comments/1ly5uh/feature_request_conic_patch_draw_mode_and_limit/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-02T16:24:27Z\u0022 title=\u002203/02/2017 04:24  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 2, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Biggen","CreatedById":173719,"CreatedDateTime":"2017-03-02T18:13:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222973017\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488471798\u0022 data-ipsquote-userid=\u0022152058\u0022 data-ipsquote-username=\u0022Wader8\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Wader8 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow I\u0027m reading more about what this \u003Cu\u003Econic patch draw mode\u003C/u\u003E is, I\u0027m still on default settings. Maybe this is the \u0022fidelity\u0022 level I mentioned, maybe this will enable more of the stuff I kept saying was missing? But it will have a performance cost right ?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m in the middle of playing, finish this session, I\u0027ll start testing it later.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.reddit.com/r/KerbalSpaceProgram/comments/1ly5uh/feature_request_conic_patch_draw_mode_and_limit/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.reddit.com/r/KerbalSpaceProgram/comments/1ly5uh/feature_request_conic_patch_draw_mode_and_limit/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee my post above.  Bullet number 5.\n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-02T18:50:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222973128\u0022 data-ipsquote-contentid=\u0022157064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488478437\u0022 data-ipsquote-userid=\u0022173719\u0022 data-ipsquote-username=\u0022Biggen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, Biggen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSee my post above.  Bullet number 5.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have said that I am not trying to achieve anything practical about the things I\u0027m posting here. I have read about the Conic Patch Limit that is understood to me how many forward manouvers or auto-generated orbits there can be displayed when possible. That is not the same as Conic Patch Draw Mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI have the mod but I haven\u0027t used it deeply yet because I have to read about what it does - does the mod \u0022fix\u0022 the things I was talking about? Even if it does, it\u0027s great for play times but it is not an objective fix and I can\u0027t rely on it when I\u0027m doign this research, it\u0027s not an official \u0022fix\u0022 and my critical analysis should still stand, unless I am wrong. I\u0027m asking the community if my findings are correct as well as to serve for feedback to the developers, that\u0027s the whole point.\n\u003C/p\u003E\n\u003Cp\u003E\nThe help that I need is in understanding the system of how it works so I can provide my feedback.\u003Cbr\u003E\u003Cbr\u003E\nAre you trying to say that the Conic Patch Draw Mode could be changed from the Precise Manouver Mod ? I have no idea yet what does this Mode do, so I\u0027m not trying to do anything with it yet.\u003Cbr\u003E\u003Cbr\u003E\nI also do not want to get too much ahead of myself, I first need to understand how this Mode works, which is the default-install one.\u003Cbr\u003E\u003Cbr\u003E\nEDIT: Maybe I\u0027m in the wrong forum, shouldn\u0027t I be in \u003Cstrong\u003ESuggestions \u0026amp; Development, \u003C/strong\u003Efor this kind of thread. I\u0027m probably have to redo this later on to omit all my figuring out and only present suggestions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-02T19:13:37Z\u0022 title=\u002203/02/2017 07:13  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 2, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Biggen","CreatedById":173719,"CreatedDateTime":"2017-03-02T19:34:49Z","Content":"\n\u003Cp\u003E\nI\u0027m confused on \u003Cem\u003Ewhat \u003C/em\u003Eit is you are asking.  \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are just posting suggestions about improving gameplay, than yes, putting them into a different forum would be more appropriate than the gameplay question forum.  If you have a specific question that you can narrow down, I\u0027m sure there are plenty of us that can help.  But we really need a specific question asked that we can answer.  I really can\u0027t tell from the posts above if your asking questions or just wanting to speak your thoughts out loud...\n\u003C/p\u003E\n\u003Cp\u003E\nAs to your question on the draw mode, your path that is drawn depends on the draw mod you have set.  Your path for an encounter will be drawn by either your position relative to your \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E entry/exit, the body you are currently orbiting, or even they body\u0027s current position.  You can choose what draw mode you want by using a mod like Precise Node.  I usually use Mode 3.  Here is an older post summing up how the paths can be visually effected depending on your draw mode:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/11297-different-conic-drawing-modes/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Wader8","CreatedById":152058,"CreatedDateTime":"2017-03-02T20:44:00Z","Content":"\n\u003Cp\u003E\n(I\u0027m not done with the rendezvous markers, i\u0027ll get back onto that later, if the thread won\u0027t be moved there (because it\u0027s really half broken I actually wanted to rename it) then I\u0027ll make a new fresh one and keep that one only on that topic, sorry I was kinda figuring things out along the way in this first big session I had.\u003Cbr\u003E\n--------------------------------------------\u003Cbr\u003E\nOh the reason why I do this is to go over it so I figure it out, so that\u0027s how I\u0027m learning, doing things as if I was a beta tester, but also posting the flow so it shows what beginners have confusion with most, that gives feedback but also it provides me a thread for later, I might forget these things half a year from now, I need to document it, that\u0027s how I do things, I do something for 1 to two weeks straight, then I don\u0027t get back until many months later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAhaaaaaa now I get it what the focus view does, for whatever reason.\n\u003C/p\u003E\n\u003Cp\u003E\nFocus view onto one of the objects that first gets encounered (that produces a conic) seems to lock that conic path to a specific mode, so it cannot be changed (with the PreciseManouver Mod) - it locks it into Mode 0.\n\u003C/p\u003E\n\u003Cp\u003E\nI thought that this Conics Mode was a more bigger underlying tech, this is just more like switching prediction relativity, I consider this quite a big deal in terms of gameplay not some optional graphics option in settings.\n\u003C/p\u003E\n\u003Cp\u003E\nEven as I switch through the modes I see the paths move, but many paths still have missing empty space between them, but I\u0027ll keep experimenting, yes I think one of them is the thing I expected, not to say that other modes aren\u0027t useful, they are infact, I\u0027m not saying it\u0027s bad, I\u0027m saying it\u0027s just showing me something else that I\u0027m expecting, as a beginner. I guess I was always expecting Mode 3 so when it kept showing me Mode 1 or which one is default, i kinda took some time to figure out what it\u0027s showing, but still, I was talking about the path inside an encounter as well, so this isn\u0027t the end of the story yet, what happens when I get inside the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, what kind of options do I have there.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah I better read on that chart, to first figure this thing out.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, just looking at the whole system, shouldn\u0027t there be better colission course detection ?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DQrF51J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/DQrF51J.png\u0022 width=\u0022426\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/DQrF51J.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/DQrF51J.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOne other thing, does the term \u0022Conic Patch\u0022 only referr to the auto-generated manouver orbits? Not the whole vector map line system right ?\u003Cbr\u003E\u003Cbr\u003E\nEDIT: Mode 3 feels kinda bit too good to be true, I mean wouldn\u0027t taking the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E of the flyby object a lot more mathematical computation into account, but it feels like a flip of a switch.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-02T22:11:22Z\u0022 title=\u002203/02/2017 10:11  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 2, 2017\u003C/time\u003E by Wader8\u003C/strong\u003E\n\u003C/span\u003E\n"}]}