{"TopicId":157555,"ForumId":44,"TopicTitle":"reentry simulation spreadsheet - looking for advice, comments, etc","CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-10T07:07:43Z","PageNum":1,"Articles":[{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-10T07:07:43Z","Content":"\n\u003Cp\u003E\nI\u0027m building a simple spreadsheet model of reentry and I\u0027m looking for any hints, advice, comments, pointers, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve read all over the place conflicting opinions on the question of \u0027can you reenter big lumps of naked metal in a safe and recoverable way\u0027; responses range from \u0027no we\u0027d have to place the material in reentry capsules\u0027 through \u0027sure just make a foam/fractal low density lump\u0027. We find lumps of metal that have reentered but usually (always?) don\u0027t know what the original mass was.\n\u003C/p\u003E\n\u003Cp\u003E\nI thought I\u0027d explore the question for myself.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe basic reentry heating math I\u0027m getting from \u003Ca href=\u0022https://www.faa.gov/other_visit/aviation_industry/designees_delegations/designee_types/ame/media/Section%20III.4.1.7%20Returning%20from%20Space.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ethis FAA (really?) doc\u003C/a\u003E .\n\u003C/li\u003E\n\u003Cli\u003E\nI can play with entry velocity and angle.\n\u003C/li\u003E\n\u003Cli\u003E\nSo far I\u0027ve used a simple scale height / exponential atmosphere density model, but I could move to on of the more accurate standard models when it was worth it.\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027m playing with a 1000 kg lump, sphere for simplicity, platinum ( $$, solid is about 40 cm in diameter )\n\u003C/li\u003E\n\u003Cli\u003E\nI can make it hollow with different wall thickness to play with ballistic coefficient\n\u003C/li\u003E\n\u003Cli\u003E\nI can kind of match the results the paper has, I plan to find some other sources to cross check later.\n\u003C/li\u003E\n\u003Cli\u003E\nI can compute W/m\u003Csup\u003E2\u003C/sup\u003E heat flux\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027m assuming that it impinges all sides of the reentering object. The linked doc says for Earth atmosphere sub 15 km/s convection dominates heat transfer which makes me think it might be more accurate to use \u0027area facing the flow\u0027 to take up heat (i.e. less m\u003Csup\u003E2\u003C/sup\u003E =\u0026gt; less total heat). what do you think?\n\u003C/li\u003E\n\u003Cli\u003E\nMy current model cannot find a trajectory that won\u0027t melt the whole mass (and more - unless it impacts at like 7 km/s) but my heat may be incorrectly high (see above) and I need to account for\n\u003Cul\u003E\u003Cli\u003E\nradiation of heat from the hot surface \n\u003C/li\u003E\n\u003Cli\u003E\nheat conduction through the mass. If the total heat is not going to melt the whole ball then the question becomes can the surface transport heat fast enough to be below melting point.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\ncalcing radiation as if the surface was at melting point would get rid of a big proportion of the heat (and it would very quickly get that hot)\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027ve found some heat transport equations. Working with hollow sphere looks \u0027simple enough\u0027 and if the material can transport heat away from the surface fast enough it looks like you might be able to arrange to impact a ball of hot but not melted metal. However if I should move to only receiving heat from the flow facing surface then the radiation becomes more complex, maybe:\n\u003Cul\u003E\u003Cli\u003E\nI can conservatively pretend only the flow facing surface radiates any heat\n\u003C/li\u003E\n\u003Cli\u003E\nI could pretend the lump is a flat disk for heat sink purposes (with some mass removed for \u0027back structure\u0027 for aerodynamic stability etc, patch of a sphere facing the flow and a conical back structure)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAnyway doing a full finite element analysis / computational fluid dynamics style treatment is more than I want to (could) do but it seems like a conservative approximation should be doable. \n\u003C/p\u003E\n\u003Cp\u003E\nMaybe there is already some online tool that does this kind of thing?\n\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2017-03-10T09:28:48Z","Content":"\n\u003Cp\u003E\nlol, most of the links when you google \u0022reentry calculator\u0022 are for KSP mods!\n\u003C/p\u003E\n\u003Cp\u003E\nYou get a much better selection (for your purposes) if you include the term \u0022-KSP\u0022 (without quotes) in your search.\n\u003C/p\u003E\n\u003Cp\u003E\nSome choice picks:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://what-if.xkcd.com/28/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://what-if.xkcd.com/28/\u003C/a\u003E (Theres an XKCD for everything)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://personal.ee.surrey.ac.uk/Personal/A.Pechev/lnlvp/AP-lec4.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://personal.ee.surrey.ac.uk/Personal/A.Pechev/lnlvp/AP-lec4.pdf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.theknowledgeworld.com/world-of-aerospace/Calculate-Aerodynamic-Heating-Rate.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.theknowledgeworld.com/world-of-aerospace/Calculate-Aerodynamic-Heating-Rate.htm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNB: turns out reentry dynamics can be quite complex, so the further you look into it, the harder making a simple approximation is. But there is a lot of good info out there.\n\u003C/p\u003E\n\u003Cp\u003E\nA not-completely-useless-but-VERY-simple approximation is just comparing total kinetic energy of your lump, with the heat capacity of the mass. If there isn\u0027t enough energy in the system to completely melt your lump, then you know part of it will probably reach the ground. Calculating just how much metal melts off quickly gets complex again, for example: the more metal that boils/melts off, the greater the insulating sheath of gas that surrounds your lump, lowering heating rates. \n\u003C/p\u003E\n\u003Cp\u003E\nMy gut says that \u0022foaming\u0022 the metal is your best bet, all those little bubbles would make great insulation, and the low density means more slowdown in the thin upper atmosphere, decreasing peak heat flux.\n\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-11T07:44:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222981554\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489138128\u0022 data-ipsquote-userid=\u002274091\u0022 data-ipsquote-username=\u0022p1t1o\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, p1t1o said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlol, most of the links when you google \u0022reentry calculator\u0022 are for KSP mods!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know - funny. Thanks for the links I\u0027ll check em out.\n\u003C/p\u003E\n\u003Cp\u003E\nFor many entry angles I see enough heat to more than melt the lump =\u0026gt; it will melt and \u0027run off\u0027 and be lost, for some angles it wont melt it all but the remainder impacts \u0027very fast\u0027. I want to achieve a \u0027no melt off\u0027 non destructive to the lump impact velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nRe the foam it sounds right but:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\ntoo steep an entry might pancake it =\u0026gt; not foam any more and who knows what aero consequences - I can easy get 400g max deceleration - maybe metal foam laughs at that\n\u003C/li\u003E\n\u003Cli\u003E\nyou\u0027d have to worry that the heat is now impinging on a small mass of material that has to transport heat through a much smaller amount of material - so I worry it might make melt off worse if the heat is \u0027too high\u0027. Modelling a foam sounds \u0027not simple\u0027 maybe someone has done the work and has some kind of approximation I can work with.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2017-03-11T08:41:20Z","Content":"\n\u003Cp\u003E\nThe other problem you might get with a foam is the fact that it\u0027s not totally solid might mean it doesn\u0027t form a coherent shock out in front of it and so it just gets obliterated by aerodynamic forces/local heating of very thin bits of metal\n\u003C/p\u003E\n"},{"CreatedByName":"SlowThought","CreatedById":109317,"CreatedDateTime":"2017-03-12T00:31:15Z","Content":"\n\u003Cp\u003E\nI\u0027m unclear about your goal... do you want a \u0022simple spreadsheet model\u0022 for KSP, or for reality? In either case, I have serious problems with your FAA doc\u0027s \u0022Similar to a rock skipping off a pond, a vehicle that doesn’t slow down enough may literally bounce off the atmosphere and back into the cold reaches of space\u0022 line, straight out of NASA/Hollywood PR hype. You don\u0027t bounce off; you simply fail to shed enough kinetic energy. Given metals\u0027 thermal conductivity, I think you could make a reasonable guess by considering work done (average drag [lots of work to be done here] x distance in atmosphere [most significant input, periapsis]) = Q into the metal = some coefficient times delta T. If T \u0026gt; melting point, game over. That your metal lumps don\u0027t survive is probably why NASA doesn\u0027t use bare metal for reentry shields \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SlowThought","CreatedById":109317,"CreatedDateTime":"2017-03-12T01:11:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222983042\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489278675\u0022 data-ipsquote-userid=\u0022109317\u0022 data-ipsquote-username=\u0022SlowThought\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, SlowThought said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have serious problems with your FAA doc\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t like the tone, but I haven\u0027t found serious problems with the math. I think a high level energy approach, as I described above, gives you the easiest \u0022back of the envelope\u0022 estimate. May do a political rant elsewhere on why the FAA is spending my dollars writing this stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-12T02:46:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222983042\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489278675\u0022 data-ipsquote-userid=\u0022109317\u0022 data-ipsquote-username=\u0022SlowThought\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SlowThought said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSimilar to a rock skipping off a pond\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I just ignored that - as far as I can tell from KSP you just rip through the atmosphere but are left with a subsequent \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E in the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nI think some warhead reentry vehicles were metal. Partly it a g-force, max, total heat tradeoff, people are squishy. Also if you are bringing your heat shield it has to be light, but in my case the heat shield is the cargo.\n\u003C/p\u003E\n\u003Cp\u003E\nMy goal is a real life conservative approximation - so it can be not too accurate as long as it\u0027s an overestimate of heat and underestimate of radiation \u0026amp; heat sink effect.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://space.stackexchange.com/questions/5385/temperature-of-the-area-behind-a-reenty-vehicle\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E has some links to Mars entry craft where front face got 2 MW/m\u003Csup\u003E2\u003C/sup\u003E but back face gets only 1 or 5 kW/m\u003Csup\u003E2\u003C/sup\u003E  - so I guess it\u0027s pretty safe to set my back face flux to 0.25 to 1 % of front face. I could treat front and back as independent disks and see how that goes.\n\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-17T05:58:46Z","Content":"\n\u003Cp\u003E\nAny sanity checks are welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nI couldn\u0027t find any magic formula in college/uni level thermo papers that would let me plug max flux, dimensions, and material properties and have it spit out a Kelvin over depth through a plate of material - except once it reached \u0027thermal equilibrium\u0027 with a temp on each side of the material. Spending a few seconds at 300 g while being blasted with 20 MW/m^2 is not equilibrium. So I went to \u0027first principles\u0027 and a spreadsheet. But if anyone knows a magic formula that would be great.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\ntreat the reentering slab as many wafer thin slices (1000 in 4.66cm 1kg per wafer of a 1000kg 1m\u003Csup\u003E2\u003C/sup\u003E slab)\n\u003C/li\u003E\n\u003Cli\u003E\nlet flux W/m\u003Csup\u003E2\u003C/sup\u003E = J/(sm\u003Csup\u003E2\u003C/sup\u003E) be dumped into wafer 0 every slice of time - so track the J in the wafer\n\u003C/li\u003E\n\u003Cli\u003E\nspecific heat J/(K kg) can then compute a temperature K for the wafer\n\u003C/li\u003E\n\u003Cli\u003E\nchose time slice size so that temp is only a fraction of the melting temp (0.001 sec)\n\u003C/li\u003E\n\u003Cli\u003E\nthe next time tick J will move out of wafer 0 into wafer 1\n\u003Cul\u003E\u003Cli\u003E\nbest case the J in the two wafers will equalise\n\u003C/li\u003E\n\u003Cli\u003E\nbut could be limited by: time s * thermal conductivity J/(smK) * temp difference K / distance m = J out of wafer 0 - this seems to be 10 times the above\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\ndo all the J out calcs, then apply wafer n-1 J out as wafer n J in - \n\u003C/li\u003E\n\u003Cli\u003E\nnow we know J in for wafer 1 at time slice 1\n\u003C/li\u003E\n\u003Cli\u003E\nrepeat the logic for each wafer for each time\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nthe spreadsheet quickly becomes \u0027unwieldy\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I didn\u0027t mess up then the slab would start melting off after 0.16 seconds of peak heat and lose around 40 kg during peak heating, probably after than radiative cooling would stabilise things. I could have messed up:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nI misunderstood the heat transport from wafer to wafer\n\u003C/li\u003E\n\u003Cli\u003E\ntypo-ed the spreadsheet\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027ve only used a few wafers so far - makes it look artificially good\n\u003C/li\u003E\n\u003Cli\u003E\ntime slice it too big and artificially limits heat transport - maybe I have to choose dt to be where thermal conductivity is coming into play\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI guess I have to write a program if I\u0027m going to slice time 10 times finer and compute all the wafers.\n\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2017-03-17T10:47:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222987936\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489730326\u0022 data-ipsquote-userid=\u0022122106\u0022 data-ipsquote-username=\u0022DBowman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, DBowman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAny sanity checks are welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nI couldn\u0027t find any magic formula in college/uni level thermo papers that would let me plug max flux, dimensions, and material properties and have it spit out a Kelvin over depth through a plate of material - except once it reached \u0027thermal equilibrium\u0027 with a temp on each side of the material. Spending a few seconds at 300 g while being blasted with 20 MW/m^2 is not equilibrium. So I went to \u0027first principles\u0027 and a spreadsheet. But if anyone knows a magic formula that would be great.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRegrettably I imagine that there is no magic formula, precisely because there\u0027s a lot of factors at play, all changing at different rates due to different things (as it looks like you\u0027re discovering). AFAIK the only way you\u0027re going to get an answer is numerical simulations (which is what it looks like you\u0027re putting together with your first principals stuff). Word of advice on numerical simulations, don;t try to do them on an Excel sheet, you\u0027ll just give you and your computer a headache!\n\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-18T06:39:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222988075\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489747656\u0022 data-ipsquote-userid=\u002249317\u0022 data-ipsquote-username=\u0022Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyou\u0027ll just give you and your computer a headache!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyep I\u0027m already there.\n\u003C/p\u003E\n\u003Cp\u003E\nQuestion - heat of fusion - after the metal reaches melting point you have to put another \u0027heat of fusion\u0027 Joules into it for it to liquify. So can I rely on this? having the Pt solid but with contained Joules between that required to melt it and to liquify it? Once it liquifies I can just remove that wafer from the simulation and apply the reentry heating to the next remaining wafer?\n\u003C/p\u003E\n\u003Cp\u003E\nedit - forgot the most important part Fouriers law for thermal conduction has energy flow depending on temperature gradient - that would mean the energy flow out of the wafer would be constant as the joules contained by it increased over melting temperature - but it seems like if there are more joules there then they should flow more into the next wafer even though the temp is clamped. Is it that Fouriers law only works while its solid below melting point? or can one \u0027just\u0027 rewrite it as a Joule gradient rather than a temperature gradient?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-18T08:23:18Z\u0022 title=\u002203/18/2017 08:23  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 18, 2017\u003C/time\u003E by DBowman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2017-03-18T10:47:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222989356\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489819195\u0022 data-ipsquote-userid=\u0022122106\u0022 data-ipsquote-username=\u0022DBowman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, DBowman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyep I\u0027m already there.\n\u003C/p\u003E\n\u003Cp\u003E\nQuestion - heat of fusion - after the metal reaches melting point you have to put another \u0027heat of fusion\u0027 Joules into it for it to liquify. So can I rely on this? having the Pt solid but with contained Joules between that required to melt it and to liquify it? Once it liquifies I can just remove that wafer from the simulation and apply the reentry heating to the next remaining wafer?\n\u003C/p\u003E\n\u003Cp\u003E\nedit - forgot the most important part Fouriers law for thermal conduction has energy flow depending on temperature gradient - that would mean the energy flow out of the wafer would be constant as the joules contained by it increased over melting temperature - but it seems like if there are more joules there then they should flow more into the next wafer even though the temp is clamped. Is it that Fouriers law only works while its solid below melting point? or can one \u0027just\u0027 rewrite it as a Joule gradient rather than a temperature gradient?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou could rewrite it as an energy gradient (you can do whatever you like!) but it would be incorrect. The whole heat of fusion thing is accurate, more energy in doesn\u0027t change the temperature above the melting point, thus doesn\u0027t change the heat transfer to the next wafer until it melts.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to throw another major annoyance into the works, have you considered the fact that the heat capacity of materials changes with temperature? EDIT: not that you really need to, a reasonable average will get you close enough\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-18T10:48:22Z\u0022 title=\u002203/18/2017 10:48  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 18, 2017\u003C/time\u003E by Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2017-03-18T22:02:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222989461\u0022 data-ipsquote-contentid=\u0022157555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489834056\u0022 data-ipsquote-userid=\u002249317\u0022 data-ipsquote-username=\u0022Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou could rewrite it as an energy gradient (you can do whatever you like!) but it would be incorrect.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh - thanks - good to know (sad cause it makes it harder not to melt off wafers). After I get the basic scheme working I can go back and turn some of the \u0027constants\u0027 into lookups by temperature. Also I need to work out a starting temp, but that one should be K such that sun heating \u002B Earth heating and radiative cooling are equal.\n\u003C/p\u003E\n"}]}