{"TopicId":158315,"ForumId":16,"TopicTitle":"Problems with Payload Aeroshell separation (Rover Payload)","CreatedByName":"JStevenson","CreatedById":176292,"CreatedDateTime":"2017-03-27T23:46:43Z","PageNum":1,"Articles":[{"CreatedByName":"JStevenson","CreatedById":176292,"CreatedDateTime":"2017-03-27T23:46:43Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m having a strange problem with the Payload aerodynamic cowling *Fairing) separation on my \u0022Rover Payloader\u0022.  Basically I\u0027m trying to place a Science Gathering Rover at a location on opposite side of KSP spaceport, and using a rocket launcher to place a cargo pod into sub-orbital trajctory, so it re=enters, and through staging eventually lands my rover on parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is when I STAGE the Fairing, the shell itself detaches but not the support structure holding the rover, nor the base - so I am left with the base and this structure attached to my rover which is now quite overloaded both for the parachutes!, When it lands (hard) there is a small explosion which usually cripples the Rover.  The few tmes when I got lucky I managed to get the lander down in one piece, but still with the payload flange and support structure attached, and the Rover was basically struck (payload fairing far to heavy!).\n\u003C/p\u003E\n\u003Cp\u003E\nWhat am I doing wrong?  Do I need to use a stage separate inside the cargo bay (between the back of rover and the base) to force a clean separation?  I tried using one of those small blue separators but this didn\u0027t get rid of the base plate or supports!\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if it matters I\u0027m running V1.2 in Career mode. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance for any advice,\n\u003C/p\u003E\n\u003Cp\u003E\nJonathan Stevenson\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2017-03-28T02:32:55Z","Content":"\n\u003Cp\u003E\nThe staging for the fairing itself only does one thing - deploy the outer shell.  You need to connect your rover to the fairing (and the procedural truss that appears when you do) using a decoupler or stack separator.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe truss will remain in place, but I think you\u0027ll find it\u0027s just a visual effect.  Your rover should pass right through it like it wasn\u0027t there.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternately, make sure Advanced Tweakables are turned on in the main menu game settings.  Then you can disable the truss and/or the extra nodes in the air above the fairing base.  Attaching the rover only to the node at the base of the fairing might look more realistic.  That was the only option for fairings in previous game versions.  Those extra nodes can be fantastic for creative uses, but can also be rather unexpected and strange.\n\u003C/p\u003E\n\u003Cp\u003E\nLast thing, give the fairing some extra space around rover wheels.  For whatever reason, whenever I try to bring the fairing in super close to save mass and drag, I end up blowing up rover wheels.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-28T16:34:47Z\u0022 title=\u002203/28/2017 04:34  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 28, 2017\u003C/time\u003E by fourfa\u003C/strong\u003E\n\u003C/span\u003E\n"}]}