{"TopicId":158374,"ForumId":70,"TopicTitle":"When mining classE in timewarp. ast. weight drops but my recources don\u0026#039;t fill??","CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T12:14:09Z","PageNum":1,"Articles":[{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T12:14:09Z","Content":"\n\u003Cp\u003E\nHi guys.\n\u003C/p\u003E\n\u003Cp\u003E\nSo i\u0027m baffled as to where my resources are going? i\u0027m mining on a classE as i plan to take it to Gilly, and in 1x speed the resource weight from the asteroid goes down. and the weight of the ore tanks fills up. Great.\n\u003C/p\u003E\n\u003Cp\u003E\nAll fuel on my ship is already full. the only thing to fill up are the ore tanks. when i timewarp to 100 1000 10000 etc the speed at which the resources drop from the asteroid begin to increase, as you\u0027d expect. but the speed at which the tanks fill up slows to a grind and ultimately stops??? on my convert-o-tron unit, no ore is being converted to anything. everything is stopped. i have no idea where the resources are bleeding off to?\n\u003C/p\u003E\n\u003Cp\u003E\ni\u0027m over 300 hours on ksp with solid mining experience never seen this before. the mining equipment and tanks are all stock parts. only engines/decals and other parts unrelated to the mining process are modded.\n\u003C/p\u003E\n\u003Cp\u003E\nis this a bug? Please help! Thanks.\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T15:03:43Z","Content":"\n\u003Cp\u003E\nDo you have pictures? Sounds like too few radiators, drills overheating, getting less efficient\n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T15:55:01Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167451-brent-kerman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167451-brent-kerman/\u0022 rel=\u0022\u0022\u003E@Brent Kerman\u003C/a\u003E Hi Brent thanks for helping.\n\u003C/p\u003E\n\u003Cp\u003E\nthe pic links are here:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/a/KU4Qy\u0022 style=\u0022height:468px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nthere are 8 medium radiators on the ship. they are near the engines though, will this mean they don\u0027t have an impact on the drill?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T16:05:14Z","Content":"\n\u003Cp\u003E\nThey are deployable, so yes, they should reach. Did you turn them on? I have forgotten that many times. I would click on the drill and watch its temp and efficiency stats, see what they do.\n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T16:25:39Z","Content":"\n\u003Cp\u003E\nyes i uploaded a close up pic you can take a look at when right-clicked on the drill. the thermal efficiency is N/A (this dropped from a higher number) and its core temp is low. the radiators cooling efforts do climb when the drill is on though. they go from around 8% to over 20% that i\u0027ve seen. not sure what they are on after a few kerbal hours of drilling but they seem to be responding to the drill.\n\u003C/p\u003E\n\u003Cp\u003E\nwhen i speed over 100x ... the drill actually stops and when i return to 1x i have to restart the drills again? it\u0027s like timewarp cuts the drill operation. which is odd since i have done this on previous missions over 10,000x warp and the tanks fill up almost instantly at this speed. the mission is grinding to a halt leaving me with 100x all day long for the tanks to fill up once!\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T16:27:41Z","Content":"\n\u003Cp\u003E\nThat\u0027s odd, 1,000x works for me. But that N/A is on convertotron, not drill. N/A because converter is not running.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Wait, I\u0027ve never gone that fast with an asteroid, only on planets. Time for some experimenting! \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-29T16:29:58Z\u0022 title=\u002203/29/2017 04:29  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 29, 2017\u003C/time\u003E by Brent Kerman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T17:19:32Z","Content":"\n\u003Cp\u003E\nit was intended to be a monster powerhouse for mining. with plenty of solar intake and close to 10,000 units of energy storage available so it\u0027s not that the thing runs out of power either. it\u0027s racking my brain.\n\u003C/p\u003E\u003Cp\u003E\ni\u0027ll give you a tip... when maxing out on timewarp on an asteroid do save frequently. it seems the kraken lurks as often coming out of timewarp shakes the ship and it sometimes snaps the drill off! but anyway you\u0027re right on the thermal efficiency n/a applying to the converter. the same does apply to the drill as well though. i don\u0027t know... looking and assessing, maybe the thermal efficiency is too low for the drill to operate properly. when the core temp is high the rate of ore collected drops. i figured with 8 medium radiators it would be enough, but maybe they are just too far away? the thermal efficiency is a poblem i think.\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T17:38:39Z","Content":"\n\u003Cp\u003E\nWith deployable radiators distance doe not matter, they cool the whole ship. I do know high timewarp used to do goofy things with power sometimes, I don\u0027t know about current version. The drill has a line: Temperature - 123.45K/500.00K. The drill is most efficient at 500.00K. Lower or higher is inefficient.\n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T17:47:40Z","Content":"\n\u003Cp\u003E\nah in that case i have 0 idea. when at 100x warp the click option shows drill to be operational. but at 1000x the message displays \u0027no surface impact\u0027. they do however burrow deep into the surface. i took the nobbly asteroid surface into account when designing the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nbaffled. i will just have to deal with a really annoying ore collection, like pulling teeth, i\u0027ve had the game running in the background for 8 hours today as i go about my business checking back every half hour or so, all to obtain 112 units of ore across 6 tankers. so not even 650 total units. as i type now, i went to 1x warp and for the 5th time today broke my ship off the drill as it shook it apart. this is so painful!\n\u003C/p\u003E\n\u003Cp\u003E\ni should have used those solar panels that have radiators on the back side. might have helped.\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T17:58:27Z","Content":"\n\u003Cp\u003E\nI think gigantors have radiators.\n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T18:06:42Z","Content":"\n\u003Cp\u003E\noh well Brent. Thanks for the input and offering help, is greatly appreciated. Gotta love the KSP community. If you come across any news which may enlighter me on the subject i look forward to hearing. in the meantime good look on your future Kerbal endeavours!\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-29T18:55:36Z","Content":"\n\u003Cp\u003E\nI will do some experimenting tonight, thankfully hyper edit has rendezvous function! \n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T20:58:51Z","Content":"\n\u003Cp\u003E\nyeah give it a go. all in all i think there just wasn\u0027t enough radiators. somehow? i mean i swear i have used less more effectively in the past but the temp rises over 500k and to around 818kwhere efficiency is shot. what i still can\u0027t explain is why it disengages the mining process once i hit 1000x warp or more? it has never done that before and has made this very straight forward mission very complicated. oh well give it a go! Thanks.\n\u003C/p\u003E\n"},{"CreatedByName":"Urses","CreatedById":175990,"CreatedDateTime":"2017-03-29T21:02:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223001489\u0022 data-ipsquote-contentid=\u0022158374\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221490789649\u0022 data-ipsquote-userid=\u0022174472\u0022 data-ipsquote-username=\u0022nick533a\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, nick533a said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n the mining equipment and tanks are all stock parts. only engines/decals and other parts unrelated to the mining process are modded.\n\u003C/p\u003E\n\u003Cp\u003E\nis this a bug? Please help! Thanks.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich Mods that include Mining Equipment do you use?\n\u003C/p\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T21:03:31Z","Content":"\n\u003Cp\u003E\nhi Ursus, i don\u0027t use any modded parts related to the mining process\n\u003C/p\u003E\n"},{"CreatedByName":"Urses","CreatedById":175990,"CreatedDateTime":"2017-03-29T21:11:19Z","Content":"\n\u003Cp\u003E\nNope i mean do you use modes that have Mining Equipment as parts?\n\u003C/p\u003E\n\u003Cp\u003E\nActual some with progressive mechaniks (like 5star Engineer pushs the produktion) have a small Problem.\n\u003C/p\u003E\n\u003Cp\u003E\nAll Drills do Reserve Max needed Heatabsorption at Start and dry out all other Equipment beforehands. The way around is to install Heatabsorption for maximal drill use\u002B other Equipment or to physikaly decouple the drills from other Equipment.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the Moment it is Not realy clear if Stock Mechanik Producer this Bug or not.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-29T21:12:15Z\u0022 title=\u002203/29/2017 09:12  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 29, 2017\u003C/time\u003E by Urses\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nick533a","CreatedById":174472,"CreatedDateTime":"2017-03-29T21:56:23Z","Content":"\n\u003Cp\u003E\noh. no i\u0027m confident i don\u0027t use mods that have mining equipment as parts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nit\u0027s strange because i have in the past used 1000x warp and continued drilling. at 1000x the drill says no surface impact, as if it\u0027s not in contact with the asteroid? but it clearly is sunk into the surface.\n\u003C/p\u003E\n"},{"CreatedByName":"Brent Kerman","CreatedById":167451,"CreatedDateTime":"2017-03-30T11:52:04Z","Content":"\n\u003Cp\u003E\nThat is a known asteroid bug.\n\u003C/p\u003E\n"}]}