{"TopicId":158857,"ForumId":70,"TopicTitle":"Strange issue, outdated AND new J-X4 Whiplash model","CreatedByName":"BlackSun","CreatedById":144657,"CreatedDateTime":"2017-04-07T16:14:36Z","PageNum":1,"Articles":[{"CreatedByName":"BlackSun","CreatedById":144657,"CreatedDateTime":"2017-04-07T16:14:36Z","Content":"\n\u003Cp\u003E\nI don\u0027t know why, or how, but I\u0027m pretty sure it\u0027s due to one of the mods I have installed.\n\u003C/p\u003E\n\u003Cp\u003E\nTake a look at this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XQSlluE.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/XQSlluE.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBoth models, new and outdated, show up - only one or the other is available in parts selection at a time. I could attach both to the same plane once the other shows up, though.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I built something, made a few test flights, came back, wanted to get another J-X4, and didn\u0027t find it. Entered the name, the old model showed up. No restarts nor file changes in between building that plane, with the new model of the engine, and coming back to the hangar to find only the old one instead.\n\u003C/p\u003E\n\u003Cp\u003E\nUpon game restart, it\u0027s still the old model. If I load my saved ship, it comes with the new models still attached. They kind of flip-flop around, as it seems. Saving the new model as a subassembly, I can get it from there - but can\u0027t attach, nor even place it anywhere. It\u0027s stuck to my cursor and won\u0027t allow me to discard / delete it, either. I have to hit \u0022load craft\u0022 or \u0022new\u0022 at that point to get rid of it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat gives? More importantly, what\u0027s the file name I need to look for in my GameData Mods / Plugins to find what\u0027s replacing (?) or messing with the vanilla model? Or is it due to something else? Plis, halp.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-07T16:43:26Z\u0022 title=\u002204/07/2017 04:43  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 7, 2017\u003C/time\u003E by BlackSun\u003C/strong\u003E\n\u003Cbr\u003EAdditional info\n\u003C/span\u003E\n"}]}