{"TopicId":158960,"ForumId":20,"TopicTitle":"Is AVC broken?","CreatedByName":"JordanL","CreatedById":95655,"CreatedDateTime":"2017-04-09T19:10:49Z","PageNum":1,"Articles":[{"CreatedByName":"JordanL","CreatedById":95655,"CreatedDateTime":"2017-04-09T19:10:49Z","Content":"\n\u003Cp\u003E\nHey, so I use and enjoy \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, and understand many mod-maker\u0027s positions on \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E (maintaining the metadata), so opting out of maintaining that makes sense even if it makes my life a bit more difficult. Really, what I like most about \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E is it\u0027s ability to help me \u003Cem\u003Ediscover\u003C/em\u003E mods that isn\u0027t easily reproduced by the stickied threads in the releases forum or other venues. In that respect, I\u0027ve also never really understood mod-maker\u0027s suggesting AVC in place of \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E. They solve different problems.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, what I don\u0027t get is the almost \u003Cem\u003Efanatical\u003C/em\u003E support of AVC I see from the mod community. It comes pre-packaged with a \u003Cem\u003Elot\u003C/em\u003E of mods. I don\u0027t want a third-party app built into my game that sends information to private servers while the game is running. I just don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nSo fine, I just tell AVC that every mod isn\u0027t allowed to check for updates and then pray the source-code isn\u0027t malicious, right?\n\u003C/p\u003E\n\u003Cp\u003E\nExcept every mod \u003Cem\u003Estill\u003C/em\u003E checks for updates. I know this because every mod still \u003Cem\u003Enotifies me\u003C/em\u003E when there is an update. How exactly is this possible when I specifically said not to check? Why do so many modders force this on anyone using the mod if the AVC plugin isn\u0027t even running in good faith?\n\u003C/p\u003E\n\u003Cp\u003E\nI really hate complaining about something like this, because any kind of mod is a labor of love and something that you shouldn\u0027t really put expectations on... but the forced inclusion of a plugin that sends data to private server \u003Cem\u003Eregardless of my settings\u003C/em\u003E is rather uncomfortable. Is AVC just broken? Is this because this is how mod-maker\u0027s \u003Cem\u003Ewant\u003C/em\u003E the system to work? Do mod-maker\u0027s know that it\u0027s doing this when they package it with their mods?\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-04-10T09:37:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223015539\u0022 data-ipsquote-contentid=\u0022158960\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221491765049\u0022 data-ipsquote-userid=\u002295655\u0022 data-ipsquote-username=\u0022JordanL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, JordanL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t want a third-party app built into my game that sends information to private servers while the game is running. I just don\u0027t.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIsn\u0027t AVC specifically made to only read data, not send it? (I\u0027m not sure on the specifics tbh.)\n\u003C/p\u003E\n\u003Cp\u003E\nI agree though, I freuqently encounter cases where AVC basically does what it wants regardless of user settings.\n\u003C/p\u003E\n"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2017-04-10T10:34:15Z","Content":"\n\u003Cp\u003E\nThe MiniAVC plugin does a plain HTTP GET on the URL defined in the .version file for the plugin. That doesn\u0027t send \u003Cem\u003Emuch\u003C/em\u003E information, but it\u0027s still not a great thing if the user has opted out.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s also worth noting that the MiniAVC plugin will still do \u003Ci\u003Elocal version checking\u003C/i\u003E regardless of the remote setting. It shouldn\u0027t know if there\u0027s a mod update available, but it will know, and warn you, if the KSP version doesn\u0027t match what the plugin\u0027s .version file indicates it\u0027s compatible with.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition, the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/72169-12-ksp-avc-add-on-version-checker-plugin-1162-miniavc-ksp-avc-online-2016-10-13/\u0022 rel=\u0022\u0022\u003EAVC documentation\u003C/a\u003E states that if the full AVC plugin is installed, the MiniAVC plugin will disable itself. I\u0027m not 100% sure because I\u0027ve never used it, but suspect that means the full AVC plugin will go ahead and do remote version checks regardless of what you told the MiniAVC plugin it can do when KSP started up. But that would need testing to confirm.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that said, I\u0027ve never used the full AVC plugin, always instruct MiniAVC to not do remote checks, and have never noticed it doing remote checking. If you suspect it is, the best place to start is to look in the MiniAVC.log file in the root of your KSP install. Search for lines containing \u0022remote version\u0022 or \u0022UpdateAvailable\u0022. Even if \u0022UpdateAvailable\u0022 is false, it means MiniAVC has performed a remote check.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore filing a bug, though, it\u0027s probably worth checking that plugin\u0027s MiniAVC configuration, in MiniAVC.xml in the plugin directory, to make sure the AllowCheck parameter is indeed set to false.\n\u003C/p\u003E\n"}]}