{"TopicId":158992,"ForumId":81,"TopicTitle":"How to fix a corrupt save on the PS4","CreatedByName":"Kerbal-Willie","CreatedById":176699,"CreatedDateTime":"2017-04-10T19:33:13Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbal-Willie","CreatedById":176699,"CreatedDateTime":"2017-04-10T19:33:13Z","Content":"\n\u003Cp\u003E\nSo I only saw this mentioned once in the stickied console update thread. So I thought I\u0027d make this account and thread for anyone who might not know. Mods please move this to the correct place if needed.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been backing up my ksp save data on my ps4 to a usb stick ever so often. Today my career save was ate by the krakin, but was recovered with my usb backup save.\n\u003C/p\u003E\n\u003Cp\u003E\nMy steps were to delete corrupt saves once prompted in game, started a new career,  then shut game down and overwrote my ksp save with the backup up from usb stick. \n\u003C/p\u003E\n\u003Cp\u003E\nI hope this helps someone who might not have known this.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second time my data was lost and I replaced with my backup and then during game I would get the data corrupted message every time it would try to quicksave. I could say no once asked to delete and continue game play, but very annoying. To fix this you must delete all of your in-game saves only leaving your persistent. This can only be done at the menu while at your complex. Then go back to the main menu and reload your career. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd note this has only been tested while having one career mode save and no sandbox or science. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-15T00:03:08Z\u0022 title=\u002204/15/2017 12:03  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 15, 2017\u003C/time\u003E by Kerbal-Willie\u003C/strong\u003E\n\u003Cbr\u003EUpdate\n\u003C/span\u003E\n"},{"CreatedByName":"DunaManiac","CreatedById":176003,"CreatedDateTime":"2017-04-13T22:48:11Z","Content":"\n\u003Cp\u003E\nTHANK you! Will try soon!\n\u003C/p\u003E\n"},{"CreatedByName":"GrouchyDevotee","CreatedById":175115,"CreatedDateTime":"2017-04-17T00:57:34Z","Content":"\n\u003Cp\u003E\nI\u0027ve never even thought about backing up the PS4 onto usb, do I have to download a file to do this or can I just cram a stick in there and go?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a great idea, I\u0027ll check this out.\n\u003C/p\u003E\n\u003Cp\u003E\nSince I\u0027m asking \u0022easy\u0022 questions, I\u0027m on my computer for this forum, how are you uploading PS4 pictures here?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DunaManiac","CreatedById":176003,"CreatedDateTime":"2017-04-17T15:11:08Z","Content":"\n\u003Cp\u003E\nBy the way, how do you move the files to usb anyway?\n\u003C/p\u003E\n"},{"CreatedByName":"Elwood","CreatedById":177003,"CreatedDateTime":"2017-04-19T12:32:28Z","Content":"\n\u003Cp\u003E\nYou can copy the save files to USB through the Setting menu, Application Saved Data Mgmt, Saved Data in System Storage, Copy to USB Storage.  I just used an old USB drive I had laying around, and now it stays in the PS4.  I also take the backup a step further and alternate backups between online storage and USB.  This was after I once found out that the save file I backed up was also corrupted.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal-Willie, thanks for the info regarding in-game notices and the removal of save files.  I have seen that once too, I think.  I don\u0027t remember the outcome, probably had to restore from backup.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}