{"TopicId":15931,"ForumId":25,"TopicTitle":"Interplanetary Vessels and Motherships","CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-02T03:56:50Z","PageNum":1,"Articles":[{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-02T03:56:50Z","Content":"\n\u003Cp\u003EBy now most of the community would know that new planets are going to be released in the next patch. I also know that most of us are scrambling away designing rockets that could hopefully make it to said future planets. So I created this thread as a way for us to showcase our interplanetary vessels. This thread can also act as inspiration and a good learning experience, through example, to those having trouble creating their own interplanetary vessel. Furthermore, this is in the challenge part of the forums for a reason. I will be ranking our creations. My logic in ranking would be my own methodology and it will stay secretive (most of the time it would be how my gut feels because I have no idea on what regard I would rank them. I.e thrust-to-weight, distance, efficiency, looks, I really don\u0027t know) But don\u0027t fret, I will include all and give nice comments like I did in my last challenge, RCS AVIATION: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/13221-RCS-Powered-Aviation?highlight=powered\u002Baviation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/13221-RCS-Powered-Aviation?highlight=powered\u002Baviation\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERules and guidelines\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1. Pictures! I need pictures of the craft. Any picture in any setting. I will use them to judge design and looks.\u003C/p\u003E\u003Cp\u003E2. Please give me the total amount of fuel it can holds.\u003C/p\u003E\u003Cp\u003E3. And also give me the weight. This helps us gauge how gargantuan (or tiny in comparison) the vessel is.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E Of course it also must function so please do the following:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E4. Starting from an orbit around 100,00m high around kerbin, you are to thrust until you run out of juice or achieve a kerbol escape velocity\u003C/p\u003E\u003Cp\u003E5. From there, if you ran out of fuel, tell us how high an apoapsis you were able to to achieve around kerbol ( I pity the crafts that can\\\u0027t escape Kerbin\\\u0027s gravity)\u003C/p\u003E\u003Cp\u003E6. If you reach kerbol escape velocity, shut down your engines immediately and tell us a rough estimate of how much fuel you still have left.\u003C/p\u003E\u003Cp\u003E \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E Other mentionables\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E7. Balanced parts please. You know what they are.\u003C/p\u003E\u003Cp\u003E8. Utilize the orbital construction plugin: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/9283-0-16-0-Plugin-Orbital-Planetary-Construction-V9-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/9283-0-16-0-Plugin-Orbital-Planetary-Construction-V9-3\u003C/a\u003E It helps getting the vessel up in a 100,000m orbit around kerbin a hellz of a lot easier.\u003C/p\u003E\u003Cp\u003E9. The Kerbal Engineer part also helps by telling how much fuel units and kerbal mass units your vessel has:\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/9063-Plugin-0-15-KICOIT-Kerbal-Engineer-0-8-Advanced-Brakes-v2-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/9063-Plugin-0-15-KICOIT-Kerbal-Engineer-0-8-Advanced-Brakes-v2-1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E10. Be creative, and don\\\u0027t be shy about telling a bit more about your craft and the story behind it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERankings and Notables\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1. Shedao\u0027s \u0022IP Lander\u0022 and \u0022IP Return\u0022 for doing it old-school and actually blasting itself from the surface to a kerbol escape velocity. Also for simulating the stranding of Jeb on a distant planet.\u003C/p\u003E\u003Cp\u003E2. duckunlimited2\u0027s \u0022ARK 2.0 for its ability to prevent kerbalnaughts from hurling chunks caused by wobbling.\u003C/p\u003E\u003Cp\u003E3. duckunlimited2\u0027s \u0022ARK\u0022 for being first in making the rankings and for being 200% more powerful for the mission it was designed for.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003Eetc, etc\u003C/p\u003E\u003Cp\u003ENow go, create, and show-off, beautiful interplanetary vessels and motherships my pretties! =P\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T20:43:09Z\u0022 title=\u002208/08/2012 08:43  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by duckunlimited2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-02T03:57:54Z","Content":"\n\u003Cp\u003EAnd As Tradition here is my attempt:\u003C/p\u003E\u003Cp\u003EI give you the ARK: Its an interplanetary mother ship meaning that its supposed to hold crew, supplies, and other craft with it during its journey across the solar system. I plan on using orbital construction as a way to hold the smaller craft. I\\\u0027ll also use dummy weights to simulate the smaller crafts attached to it. But for now, its being tested without any extra weight.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK7.png\u0022 alt=\u0022ARK7.png\u0022\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK1.png\u0022 alt=\u0022ARK1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK5.png\u0022 alt=\u0022ARK5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA noteworthy mention: These engines have a thrust value of 340ish units and are 1 meter in size. These engines in comparison to the gargantuan vessel you see is quite small and underpowered for this rocket. However, the amount of individual engines there are make up for it. (It was planned for 20 engines, but somehow one came off during my transfer to the spacedock in orbit.) With smaller engines, they are more fuel efficient so I tend to stick many small ones on craft that reach gargantuan sizes for fuel efficiency.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ENow this rocket is twice the height of the launch tower. Its center rod thingy is 3 meters in diameter. Its radial tanks are 2meters and the radials around the radials are 2 meters as well giving it a max thickness of 11-12 meters. \u003C/p\u003E\u003Cp\u003EThis thing weighs a whopping 660 kerbal mass units! You think thats alot, wait to you see the amount of fuel it holds. \u003Cstrong\u003E99,700 fuel units!\u003C/strong\u003E tha\\\u0027ts almost 100,000 fuel units. The fuel alone consists about 5/6ths of the weight of the rocket. Yep, 550 kerbal mass units of fuel. If you think I\\\u0027m cheating, I will tell you that the fuel tanks I\\\u0027m using is from the KW Rocketry mod, and I think most of us feel that its a pretty balanced mod. Despite being huge, it doesn\\\u0027t lag my computer because I designed it with the idea of using as little amount of parts as possible. But it holds more than the necessities to carry out its mission.\u003C/p\u003E\u003Cp\u003ESo I got this in a 80km orbit around kerbin then started burning relatively in the direction of kerbin\\\u0027s direction of travel. I hit kerbol escape velocity some minutes later and shut off the engine. In the end I still had 50% of my fuel left. 50,000 kerbal mass units still left to burn.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK15.png\u0022 alt=\u0022ARK15.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the proof in my tracking station. Just made it to escape trajectory.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ESo there you go. Here is your first example peoples. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T15:44:28Z\u0022 title=\u002208/08/2012 03:44  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by duckunlimited2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-08T03:55:40Z","Content":"\n\u003Cp\u003EWell, apparently I haven\u0027t made this challenge hard enough seeing that many of you have posted groundbreaking vessels even able to traverse between the stars and stuff and what not and....yeah. (that was sarcasm \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) Anyhow, I\u0027ll delay my challenge\u0027s death for a bit and post another interplanetary vehicle I\u0027ve been working on. Hopefully this would inspire some of you to create your own interplanetary vehicles and post it here. If not... well I\u0027m on the top of my leaderboard so that\u0027s victory enough for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlright. So ARK (showcased above) apparently has some bugs. First off, whenever I\u0027m burning and accelerating, I noticed it tends to wobbles a bit. It pitching back and forth a few degrees. I normally can live with that since SAS tends to keep it pointing in the relative direction despite the wobble. However, I was testing it without the extra weights. with the dummy weights attached(300kmu by the way), the wobble becomes more pronounced and the craft starts to shake quite badly. SAS still keeps it in the relative direction but the shaking makes it hard to do clean burns. Sometimes the shaking is so bad, the craft starts to spin. Other times, the engines just rip off because the weight is so immense and I\u0027m left with a destroyed craft and no engines. (sorry for no pics, I know it would have made it better) Therefore, a redesign was needed to keep it from shaking apart and ripping its engines off.\u003C/p\u003E\u003Cp\u003EAnd this is the result: ARK 2.0!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK24.png\u0022 alt=\u0022ARK24.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlright, some major design changes were a shorter body, better distribution of weight, more RCS fuel, and better placement of SAS units and RCS ports. All in all, it accomplishes my goal. It barely shakes even on a full burn making it much more stable.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK21.png\u0022 alt=\u0022ARK21.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother change was the choice of command pod. The lone kerbal in the lower right corner indicates that I\u0027m using the mk 1 pod. however this rocket can accommodate 10 extra kerbals thanks to the crew tanks located in the front. I\u0027ll be bringing along 9 kerbals in this vessel for its maiden voyage to the red planet once .17 is released.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK26.png\u0022 alt=\u0022ARK26.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EProbably its only drawback stems from its lack of engine power. only 6 engines power this beast and when all of them are burning at full throttle, it can only give about half the engine power of its predecessor. Another drawback is the fact that the fuel tanks are drained at different rates. the center tank drains four times faster than the two side engines. The good thing is I can enable and disable the flow to help balance out the vessel as it burns preventing it from wobbling, but it also means that at certain times, the vessel would be even more underpowered when it try\u0027s to accelerate.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK27.png\u0022 alt=\u0022ARK27.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere are the weights that simulate the load of other vessels it would carry. They are the colored tanks on the top and bottom.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK28.png\u0022 alt=\u0022ARK28.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI speculate the center of gravity with and without the dead weights is around where the nuclear generator is. (thats the circular body part where the weights are attached) The nuclear generator has SAS parts both directly on top and below it and those three parts act as a dampener, absorbing any wobble the vessel may have. adding the weights right on top of the dampener area only makes the dampener better at preventing wobble.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as fuel and weight is concerned, its about the same as its predecessor so I believe it would reach kerbol escape with 50% of its fuel left over just like its predecessor.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T20:47:41Z\u0022 title=\u002208/08/2012 08:47  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by duckunlimited2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lickstaph","CreatedById":19039,"CreatedDateTime":"2012-08-08T04:58:47Z","Content":"\n\u003Cp\u003E\u0026gt;asks people to design crafts to get to other planets\u003C/p\u003E\u003Cp\u003E\u0026gt;uses mods\u003C/p\u003E\u003Cp\u003E\u0026gt;wat\u003C/p\u003E\u003Cp\u003EWhy not just download a modded engine that has infinite fuel while you\u0027re at it? Problem solved.\u003C/p\u003E\u003Cp\u003EHell, why not just download a mod that allows you to go to Warp Factor 8? Or a mod that allows you to generate wormholes to instantly travel anywhere in the game? Or download a mod that makes your parts invincible?\u003C/p\u003E\u003Cp\u003EWhy even play the game if you\u0027re going to cheat in the first place?\u003C/p\u003E\n"},{"CreatedByName":"Exovian","CreatedById":17094,"CreatedDateTime":"2012-08-08T05:38:24Z","Content":"\n\u003Cp\u003EBecause mods =/= cheats. There are plenty of balanced mods, which duckunlimited decided to use. If you don\u0027t like it, don\u0027t participate.\u003C/p\u003E\n"},{"CreatedByName":"recon2375","CreatedById":24078,"CreatedDateTime":"2012-08-08T05:43:16Z","Content":"\n\u003Cp\u003ECalm down man, people play games differently then you do.\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2012-08-08T07:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lickstaph\u0022 data-cite=\u0022lickstaph\u0022\u003E\u003Cdiv\u003Eblah blah\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E\u0026gt;Why do you have fun doing things I don\u0027t like?\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheProdigy","CreatedById":15985,"CreatedDateTime":"2012-08-08T09:43:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lickstaph\u0022 data-cite=\u0022lickstaph\u0022\u003E\u003Cdiv\u003E\u0026gt;asks people to design crafts to get to other planets\u003Cp\u003E\u0026gt;uses mods\u003C/p\u003E\u003Cp\u003E\u0026gt;wat\u003C/p\u003E\u003Cp\u003EWhy not just download a modded engine that has infinite fuel while you\u0027re at it? Problem solved.\u003C/p\u003E\u003Cp\u003EHell, why not just download a mod that allows you to go to Warp Factor 8? Or a mod that allows you to generate wormholes to instantly travel anywhere in the game? Or download a mod that makes your parts invincible?\u003C/p\u003E\u003Cp\u003EWhy even play the game if you\u0027re going to cheat in the first place?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow the hell us using mods cheating? It\u0027s a sandbox game. You can do whatever you want. Do you think the devs would ENCOURAGE modding if they thought it was cheating? Mods add more fun and variety to the game, what\u0027s wrong with that?\u003C/p\u003E\n"},{"CreatedByName":"Candre","CreatedById":15181,"CreatedDateTime":"2012-08-08T14:00:41Z","Content":"\n\u003Cp\u003EAs a non-hostile point, there\u0027s always the chance that compatibility will break with mods. That doesn\u0027t mean that it isn\u0027t fair to use them for this challenge, but be warned that any designs you skim off of here may not work immediately in 0.17.\u003C/p\u003E\u003Cp\u003EMy stock vehicle will be posted shortly. It can get to about 3 times the height of Kerbin\u0027s orbit. Not a one-rocket-fits-all, but capable.\u003C/p\u003E\n"},{"CreatedByName":"Shedao","CreatedById":8981,"CreatedDateTime":"2012-08-08T14:09:19Z","Content":"\n\u003Cp\u003EMy turn:\u003C/p\u003E\u003Cp\u003EAssuming that there will be a planet at about 27Mm from Kerbol with a mass somewhat lower than Kerbin I designed two rockets. One called IP Lander (one seat) will land on that planet, let Jeb take a walk and leave an empty booster as flag;) After return to a low orbit it will rendezvous with the IP Return (three seats), Jeb sets over and return to Kerbin.\u003C/p\u003E\u003Cp\u003EBoth designs use the same technology and only differ in the upper stages.\u003C/p\u003E\u003Cp\u003EOk, now the challenge:\u003C/p\u003E\u003Cp\u003EBoth crafts will take off from the KSC, get into a 100x100km orbit and from there try to reach Kerbol escape velocity.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/4231312/KSP%20Bilder/Lander%20and%20Return%20on%20pad.jpg\u0022 alt=\u0022Lander%20and%20Return%20on%20pad.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EIP Lander:\u003C/p\u003E\u003Cp\u003E98500 fuel units and a total weight of 512.9 tons\u003C/p\u003E\u003Cp\u003EIP Return:\u003C/p\u003E\u003Cp\u003E96100 fuel units and a total weight of 502.4 tons\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/4231312/KSP%20Bilder/Lander%20and%20Return%20in%20Orbit.jpg\u0022 alt=\u0022Lander%20and%20Return%20in%20Orbit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EIP Lander (~100x100km):\u003C/p\u003E\u003Cp\u003E~22500 fuel units left\u003C/p\u003E\u003Cp\u003EIP Return (~100x100km):\u003C/p\u003E\u003Cp\u003E~21100 fuel units left\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/4231312/KSP%20Bilder/Lander%20and%20Return%20on%20escape.jpg\u0022 alt=\u0022Lander%20and%20Return%20on%20escape.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EIP Lander:\u003C/p\u003E\u003Cp\u003E~6250 fuel units left\u003C/p\u003E\u003Cp\u003EIP Return:\u003C/p\u003E\u003Cp\u003E~4600 fuel units left\u003C/p\u003E\u003Cp\u003EAs I burned from an 100x100km Kerbin orbit the result was not perfectly efficient.\u003C/p\u003E\u003Cp\u003ENow two additional pictures regarding the original mission both crafts were designed for:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/4231312/KSP%20Bilder/Lander%20and%20Return%20special.jpg\u0022 alt=\u0022Lander%20and%20Return%20special.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EThe booster/very Kerbal flag is a strut with the empty mass of a real booster and can be carefully decoupled when the lander hits the ground.\u003C/p\u003E\u003Cp\u003EAs I am not an expert in rendezvous the return craft is covered in ladders so Jeb can grab one even if I am not able to aim for the hatch.\u003C/p\u003E\u003Cp\u003ESo, that\u0027s it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T17:32:30Z\u0022 title=\u002208/08/2012 05:32  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by Shedao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-08T15:27:01Z","Content":"\n\u003Cp\u003EHmmm, I\u0027m trying to make sense of your post. So, you started on the ground with a rocket that\u0027s 500 kmu and holds around 100,000 fuel units. Than you blasted it into a 100x100km orbit. After that you were left with about 25000 fuel units. From then you burned till you hit kerbin escape and kept burning until you reached an apoapsis 27million meters above kerbol. From then you returned back to kerbin and simulated your landing on the foreign planet. Right?\u003C/p\u003E\u003Cp\u003EWe\u0027ll give you first for now for doing it old school. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eedit: Also, links on the first post are fixed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T15:52:54Z\u0022 title=\u002208/08/2012 03:52  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by duckunlimited2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shedao","CreatedById":8981,"CreatedDateTime":"2012-08-08T17:41:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022duckunlimited2\u0022 data-cite=\u0022duckunlimited2\u0022\u003E\u003Cdiv\u003EFrom then you burned till you hit kerbin escape and kept burning until you reached an apoapsis 27million meters above kerbol. From then you returned back to kerbin and simulated your landing on the foreign planet. Right?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, that part is the mission my crafts were designed for. I followed exactly your mission: Get into 100x100km -\u0026gt; burn until Kerbol escape velocity -\u0026gt; look how much fuel is left. Edited my post a little so it gets clearer what is challenge and what original mission. Thought the idea behind the design would be interesting as most people here are looking foward to 0.17 and build rockets which get to another planet and then return safely to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-08-08T20:41:28Z","Content":"\n\u003Cp\u003EOh, okay now I can see it. I was bit unsure if you actually made it to kerbol escape. I was looking at the screenshot of the crafts in orbit of kerbol and was very confused on what mechjeb was saying about the apoapsis and periapsis. I had no idea what Tm and Gm was. Good thing I googled it and I actually figured out what those units are. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Also I just realized that your crafts orbital speed is fast enough, at that altitude, to designate it as escape velocity. Very excellent Indeed.\u003C/p\u003E\u003Cp\u003EAlso, you didn\u0027t have to start on the surface of Kerbin. I assumed you would create a craft and use the orbital construction mod to get it up to the 100x100km orbit. However, starting from the surface and making it to escape velocity is a great achievement.\u003C/p\u003E\u003Cp\u003EEdit: I\u0027ll also add something about ARK 2.0 here because I hit my picture limit in its post.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EYes ARK 2.0 can reach escape velocity with half of its fuel remaining. However, with the 300kmu of dead weight attached, it cannot reach escape velocity. Instead it reaches an apoapsis of around 169,000,000,000m. However it was still close to reaching escape velocity. It just needed 500m/s more velocity until it hit escape velocity. If I packed just a bit more fuel, it could have hit escape velocity.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1064.photobucket.com/albums/u370/duckunlimited2/ARK2.png\u0022 alt=\u0022ARK2.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-08T20:54:17Z\u0022 title=\u002208/08/2012 08:54  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 8, 2012\u003C/time\u003E by duckunlimited2\u003C/strong\u003E\n\u003C/span\u003E\n"}]}