{"TopicId":159361,"ForumId":70,"TopicTitle":"Lost Everything!","CreatedByName":"Bartman","CreatedById":100207,"CreatedDateTime":"2017-04-18T00:18:10Z","PageNum":1,"Articles":[{"CreatedByName":"Bartman","CreatedById":100207,"CreatedDateTime":"2017-04-18T00:18:10Z","Content":"\n\u003Cp\u003E\nThink it was because I hit the Reset button down in the bottom rt corner. The \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E it was doing crazy things trying to build a new ship and I ran out of ideas why. Now all my saved ships are gone. So are all the Stock ships I tried copying my Craft files to another folder but that didn\u0027t do anything, everything has been wiped clean. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E lots of stuff is now greyed out.\n\u003C/p\u003E\n\u003Cp\u003E\nIdeas?\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-04-18T05:55:54Z","Content":"\n\u003Cp\u003E\nYour issue has been moved to the support section, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100207-bartman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022100207\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100207-bartman/\u0022 rel=\u0022\u0022\u003E@Bartman\u003C/a\u003E. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83213-stock-support-bug-reporting-guide/\u0022 rel=\u0022\u0022\u003EPlease provide as much of this detail as you can. \u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbital","CreatedById":170602,"CreatedDateTime":"2017-04-18T18:52:29Z","Content":"\n\u003Cp\u003E\nThe orange Reset button in the bottom right of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E? That only resets the staging sequence for the currently loaded ship. It does not delete anything nor change any settings. Your description of the problem is incomplete. Something important is missing. From what it sounds like you must have deleted your current game. That is the only way your craft files would disappear.\n\u003C/p\u003E\n\u003Cp\u003E\nA copy of stock ships can be found in \\Kerbal Space Program\\Ships.\n\u003C/p\u003E\n"},{"CreatedByName":"Bartman","CreatedById":100207,"CreatedDateTime":"2017-04-22T19:31:30Z","Content":"\n\u003Cp\u003E\nRe-Installed 1.3 and it look like I have everything back. Was running 1.2 and DID NOT want to update. Been about as far as I could get with that version. Been to Laythe but it\u0027s like a 3hr trip even using FF \u0027cause of the manual staging of the Asparagus staged Nuke engines. Have a Base \u0026amp; orbital station there. Have a station \u0026amp; 2 bases on Duna too. 2 on the Mun \u0026amp; 1 on Minmus. Could see I could never build anything big enuf to get back to orbit from Eve so I gave that up. Was going to start trying for a couple of Jool\u0027s other moons but as I said it\u0027s a Long Way \u0026amp; a Long Time to get there. Just want to fly and have some fun and not make it a Real Job trying to do anything else. Really wish I could learn to build Big stuff in Kerbin Orbit so I could launch from there and not all the way out of Kerbins gravity well but I\u0027ve yet to figure out how to do that. 1.3 looks different and I\u0027ll see what happens. If I start losing all my old ships in Re-Entry being \u0022Realistic\u0022 that I think I\u0027ll be Done with it all. I just liked it as a Game.\n\u003C/p\u003E\n"},{"CreatedByName":"Bartman","CreatedById":100207,"CreatedDateTime":"2017-04-22T19:53:53Z","Content":"\n\u003Cp\u003E\nWell it looks like MechJeb is no longer working on my Old ships now so I guess I\u0027m Done with KSP, oh well, it was Fun for a few years but I guess that\u0027s it. I\u0027m Done.\n\u003C/p\u003E\n"}]}