{"TopicId":159451,"ForumId":20,"TopicTitle":"TCA / TCA Substitute for RSS","CreatedByName":"OmegaOne","CreatedById":176835,"CreatedDateTime":"2017-04-19T20:06:40Z","PageNum":1,"Articles":[{"CreatedByName":"OmegaOne","CreatedById":176835,"CreatedDateTime":"2017-04-19T20:06:40Z","Content":"\n\u003Cp\u003E\nIs there any mod out there can can reliably take the place of TCA (Throttle Control Assist) for \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E?  I love \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E but TCA currently starts its target apoapsis burn pretty much at apoapsis, requiring a build that rapidly spirals out of control - more thrust needed, so more fuel.  more fuel adds more weight, so more thrust needed.  but since more thrust is now needed to push that extra fuel along...  you get the idea.  if there is no adequate substitute for TCA, is there a gravity mod that allows for proper gravity turns?  with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off, even a simple gravity turn either tumbles out of control or maintains a ballistic trajectory, making orbital burns either incredibly fuel intensive or thrust intensive (which leads me back to my original problem), or renders the orbital burn pointless as the spacecraft never gets high enough.  After talking this over with my father (aerospace engineer), he told me by turning off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and just a 1 degree alteration to a ballistic trajectory, the gravity turn should manifest with very little additional control input.\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-04-19T20:43:55Z","Content":"\n\u003Cp\u003E\nI haven\u0027t tried this with \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E, but it works very well in stock, and you should be able to adjust the target apoapsis to get it to work, I think:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/148448-12x176-gravityturn-continued-automated-efficient-launches/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAlso, TCA is Throttle Controlled Avionics - which helps understand some of how it works.  (It\u0027s not assisting the throttle - it\u0027s controlling the ship using throttles on the engines.)\n\u003C/p\u003E\n"},{"CreatedByName":"OmegaOne","CreatedById":176835,"CreatedDateTime":"2017-04-19T20:53:53Z","Content":"\n\u003Cp\u003E\nwell, yeah, i know that much, but TCA also handles burns and even stock launches very efficiently, i was hoping there was something similar to TCA for \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E.  i\u0027ll give GravityTurn a shot, it seems compatible right now (according to \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E) so someone has continued work.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nthanks!\n\u003C/p\u003E\n"}]}