{"TopicId":159723,"ForumId":51,"TopicTitle":"Asteria - Kerbal Colonization Part 0.5: Prologue...of sorts","CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2017-04-25T00:03:44Z","PageNum":1,"Articles":[{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2017-04-25T00:03:44Z","Content":"\n\u003Cp\u003E\nAbout two years into my SCIENCE! mode save, I\u0027ve come to take a different approach to things. Over my (nearly) three years of playing KSP I have \u003Cs\u003Ekilled many little green men\u003C/s\u003E learned so much about different things to exploit in the Kerbol system. Now, with this being my fourth science mod save, it is time to finally spread out Kerbal presence to other celestial objects - aka\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-size:48px;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003ECOLONIZATION\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EThe Asteria initiative will result in the construction of Kerbal settlements across multiple celestial bodies. Bases will be put on specific moons and planets to exploit resources and SCIENCE to build a interplanetary empire full of little green men. With those will be stations to act as \u0022space-based bases\u0022 for the storage of gathered materials from a celestial body. A network of space-faring cargo vessels will transport these from planet to planet, with all science being delivered at Kupole Station in Low Kerbin Orbit. It\u0027s an exciting initiative - the kind that has Jeb staying up all night and literally flying off the walls. But is it fesable? Yes, it is....I\u0027m pretty sure. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003ECURRENT PROGRESS:\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EKUPOLE STATION: Space station in Low Kerbin Orbit; used as a refueling and science hub.\u003C/span\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ERHEA BASE: Mining facility on the Mun. Operations will begin soon.\u003C/span\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ERHEA HOVERCRAFT [Being Tested]: A special dropship/hovercraft used for transporting fuel and ore from Rhea Base. Very explody as of now.\u003C/span\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EZEMYNA STATION [In Progress]: Space station for the collection of fuel from Rhea Base and to refuel outgoing vessels.\u003C/span\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EMINTHE THREE [Partially complete]: State-of-the art space station, lander, and base combination craft. Will be used for science and recreation on Minmus.\u003C/span\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003ECURRENT PLAN:\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EThe current plan is to make Rhea base a fully operational mining facility. As a result, I will be able to create large motherships for manned interplanetary exploration with ease. Instead of making overkill rockets to shoot them towards their destinations, I can simply put them in Kerbin orbit, refuel, and then leave. Much more memory efficient (giant rockets = laaag). The next stop after the Mun and Minmus is Duna. But until then, I have Hera I and Styx heading to Jool and Eeloo, respectively. I will also need to send unmanned orbiters to Duna for science gathering and finding nice areas to do some first Kerbal landings.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cstrong\u003E\u003Cu\u003EPARTS:\u003C/u\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EPart 0.5: Prologue...of sorts\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-25T20:57:51Z\u0022 title=\u002204/25/2017 08:57  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 25, 2017\u003C/time\u003E by ProtoJeb21\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-04-25T00:12:22Z","Content":"\n\u003Cp\u003E\nlooks good! I\u0027ll be looking at this from now on!\n\u003C/p\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2017-04-25T02:45:29Z","Content":"\n\u003Cp\u003E\nBefore i vote. What mods will you be using in this endeavor?\n\u003C/p\u003E\n\u003Cp\u003E\nI Ask because mods like \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E can give completely new experience to minmus bases...\u003Cbr\u003E\u003Cbr\u003E\nAlso, what will be our roleplay? You know, all good mission reposrts begin with a good \u0022once upon a save...\u0022 feels. Like the Scence career of VAOS that became the astounish Solar Nations... Just saying\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2017-04-25T10:23:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223033651\u0022 data-ipsquote-contentid=\u0022159723\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221493088329\u0022 data-ipsquote-userid=\u002278568\u0022 data-ipsquote-username=\u0022Nahim\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Nahim said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBefore i vote. What mods will you be using in this endeavor?\n\u003C/p\u003E\n\u003Cp\u003E\nI Ask because mods like \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E can give completely new experience to minmus bases...\u003Cbr\u003E\u003Cbr\u003E\nAlso, what will be our roleplay? You know, all good mission reposrts begin with a good \u0022once upon a save...\u0022 feels. Like the Scence career of VAOS that became the astounish Solar Nations... Just saying\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is going to be completely unmodded, except maybe Kopernicus if I forget to move it out of GameData before playing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd about the narrative...I\u0027m not too sure at the moment.\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2017-04-25T20:56:25Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EPART 0.5: Prologue...of sorts\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022color:#2ecc71;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EDon\u0027t argue with the part number\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Kerbal Aviation and Space Exploration Committee (KASEC) have been in existence for almost a decade by now. But not until two years ago did the company get any sort of funding by the Kerbin Global Democracy. Beginning in the middle of 2018 AKI (After Kerbal Intelligence), KASEC was almost the literal definition of \u003Cem\u003Ethrowing science at a wall and seeing what sticks\u003C/em\u003E. It was nothing more than a group of rocketry enthusiasts developing model rocketry at some abandoned warehouse they found at the Kolarre Peninsula, right on Kerbin\u0027s equator. Rumors have surrounded this facility for years. It was whispered that the abandoned buildings were used during the Kabloom Krisis, back when Kerbals existed in different nations. During this time period, Kerbals had found ways to make things (and others) go BOOM much more efficiently. They began to create an stockpile GECs (Gigantic Explosion Creators) in remote facilities across the planet. However, after a cataclysmic accident in 1982 AKI, the nations of Kerbin saw how misguided they were to go on this destructive path. Leaders vowed to begin a new age of peace and cooperation between Kerbals of different lands, forming the Kerbin Global Democracy and ending the development of GECs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe whole Kabloom Krisis was a rock-hard fact of history, but many of the GEC-making facilities remained undiscovered or hidden by the Democracy. However, the brilliant college student Gene Kerman was able to make sense of the discombobulated rumors (some that made no sense, like a hideout for Krakens) and track down the abandoned site. He and a group of other kerbals who loved to science the heck out of everything - including Jebediah, Walt, and the twins Bill and Bob Kerman - managed to access the site. Inside they found many unused parts for building rockets and related machines. Gene and his group would find time to work on launching things into the stratosphere whenever there happened to be a college break. After a few years of this, the KASEC members had left college and were now able to continue with their SCIENCE. For months following graduation, Gene and his group worked on making more and more complex rockets, eventually making ones large enough to reach space. They realized their actions may cause alarm from the Democracy, so their decided to make their group and official company. It was a small one, sure, but since they had all the resources at hand not a lot of money had to go into it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene, Jeb, Bill, Bob, and the others announced their project to the world. The Democracy allowed them to continue, while other private science companies asked KASEC for help with experiments. Over years KASEC was the go-to company for microgravity related tests. Different types of matter - foods, sand, organisms, etc. - were quickly sent up to the top of the atmosphere and fell down, slowed to a soft landing with a parachute. This was a great business for many fields of science to test all sorts of things. It was also beneficial for KASEC. They were getting paid very well for performing scientific experiments for other companies, including Zaltonic electrics. But Gene had a bigger plan in mind. He had access to an observatory at the facility KASEC used for operations, which he used to see things beyond Kerbal understanding. The points of light in the sky were in fact other \u003Cem\u003Eplanets\u003C/em\u003E, some with moons of their own. Gene did not want to be stuck doing science on Kerbin. No way - there were more planets to explore than just the green world he lived on. At the New Year\u0027s Global Conference on New Year\u0027s Day 2026 AKI, Gene was able to present a grand idea to the Kerbin leaders: a space program to send robots and even Kerbals to explore the great unknown. He promised that the purpose of this was for the quest of knowledge, for the advancement of Kerbal intelligence. After a well-developed presentation, the leaders of the Democracy had a thorough discussion. They decided that such an idea would certainly benefit Kerbalkind and deserved to be properly funded. Thus, KASEC become a government company with all the funding it needed to get things into orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EKASEC encouraged interest in space, science, and the quest to discover more. It completed many successful missions, including two Kerbal landings each on both moons of Kerbin. It also provided the first close images of Duna and its moon (or binary companion) Ike ever captured by Kerbalkind. After a little over two years, with help from Werhner von Kerman of the Democracy\u0027s Science Supporting Committee, Gene was able to get an approval for an even greater endeavor. Called the Asteria Initiative, it would enable the colonization of other celestial bodies and be used to make Kerbalkind an interplanetary species. It began with the construction of Rhea Base, named after the first Munar landers, and the completion of Kupole Station in Low Kerbin Orbit. With many more missions underway, it seemed like the Asteria Initiative was now the glory of Kerbin and all its Kerbals.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#2ecc71;\u0022\u003ETO BE CONTINUED....\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}