{"TopicId":160221,"ForumId":36,"TopicTitle":"Jools \u0026#039;\u0026#039;surface\u0026#039;\u0026#039;","CreatedByName":"Clonos","CreatedById":169038,"CreatedDateTime":"2017-05-05T13:22:40Z","PageNum":1,"Articles":[{"CreatedByName":"Clonos","CreatedById":169038,"CreatedDateTime":"2017-05-05T13:22:40Z","Content":"\n\u003Cp\u003E\nHello.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t have any experience with making mods AT ALL, but i do have an idea. A mod that kinda adds a surface to Jool.\n\u003C/p\u003E\n\u003Cp\u003E\nIts actually just clouds, but it acts like water.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is not flat, just random clouds starting at a height of approximality of 1KM.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you manage to have such a heavy ship or use engines, or just somehow sink until 100M, the clouds will stop, and you will fall out of them. and on 50M, an ocean appears.\n\u003C/p\u003E\n\u003Cp\u003E\nThis ocean is the last layer of Jool, and continues until the -250M mark, then your ship will, as always, explode on that height.\n\u003C/p\u003E\n\u003Cp\u003E\nBUT there is even more! if you manage to somehow accelerate to 200m/s and go through -250M, you will appear on a tiny rock, 10KM the size, and is the core of Jool. it\u0027s small, but if you take a surface sample,you will get 7.000 science points.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think!\n\u003C/p\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-05-05T16:32:16Z","Content":"\n\u003Cp\u003E\nI suppose you could try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/140580-122-kopernicus-release-3-february-2/\u0022 rel=\u0022\u0022\u003EKopernicus\u003C/a\u003E to edit Jool into having a liquid surface.\n\u003C/p\u003E\n\u003Cp\u003E\nMake it a terrestrial planet with a solid surface at -250 m and a planet-wide ocean. Or make it a near-infinitely deep ocean with a very small solid core, with part detonation still at -250 m. I can\u0027t imagine the sheer density of that liquid though, and the ambient pressure should crush everything.\n\u003C/p\u003E\n"}]}