{"TopicId":160251,"ForumId":70,"TopicTitle":"Dips in frame rate","CreatedByName":"Midgar","CreatedById":177514,"CreatedDateTime":"2017-05-05T23:49:43Z","PageNum":1,"Articles":[{"CreatedByName":"Midgar","CreatedById":177514,"CreatedDateTime":"2017-05-05T23:49:43Z","Content":"\n\u003Cp\u003E\nBeen having this issue for a while where the frames will just plummet and freeze the screen for about a second before restoring itself. Always happens in intervals maybe every 10 seconds.\u003Cbr\u003E\nMy frame rate isn\u0027t great anyway for whatever reason. It\u0027s by far the lowest i have for any game. I run some pretty demanding games on high settings where i\u0027m usually good for 30 - 60 fps. But on this i\u0027ll get 10 - 20 frames at most. And that\u0027s when i\u0027m far away from Kerbin.\u003Cbr\u003E\nIn Kerbins atmosphere i\u0027ll have about 10fps, and when the dip kicks in every 10 seconds it\u0027ll drop to about 5, then back up to 10 - 15.\u003Cbr\u003E\u003Cbr\u003E\nSo any idea why my frame rate is so low and why i have these dips? I\u0027m running mods but i get this with or without mods.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-05T23:50:51Z\u0022 title=\u002205/05/2017 11:50  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 5, 2017\u003C/time\u003E by Midgar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2017-05-07T02:26:23Z","Content":"\n\u003Cp\u003E\nSounds like maybe garbage collection?\n\u003C/p\u003E\n\u003Cp\u003E\nIn that event, a possible fix (assuming you have the RAM to contemplate it*) is to use MemGraph to pad your heap, and force less frequent GC pauses.\n\u003C/p\u003E\n\u003Cp\u003E\n*8 GB or more.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally: you won\u0027t get much improvement in KSP frame rates by reducing graphical settings. KSP is a lot more CPU-heavy than most games, so quite often, it\u0027s the physics calculations that are the bottleneck, not the GPU rendering frames as it is for other games.\n\u003C/p\u003E\n\u003Cp\u003E\nYour GPU can be entirely capable of rendering 200 FPS, but will sit idle most of the time if the CPU can only chug through the physics for 10 frames per second.\n\u003C/p\u003E\n"}]}