{"TopicId":160394,"ForumId":50,"TopicTitle":"Precision landing tutorial","CreatedByName":"Whisky Tango Foxtrot","CreatedById":172896,"CreatedDateTime":"2017-05-09T06:45:05Z","PageNum":1,"Articles":[{"CreatedByName":"Whisky Tango Foxtrot","CreatedById":172896,"CreatedDateTime":"2017-05-09T06:45:05Z","Content":"\n\u003Cp\u003E\nI\u0027ve managed to work out a fairly decent technique for making precision landings on airless bodies in KSP so I thought I\u0027d make a video explaining how I do it. Hopefully this will be of some help to people having trouble with this part of the game. This is my first time making a gameplay video of anything and I stumble over my words in a few places but I think that overall it turned out okay. Using vid.me since YouTube\u0027s been doing some pretty crappy things lately and I figured it would be best to just stay away from that platform. I\u0027m not sure if this will embed, but if it doesn\u0027t just click the link.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://vid.me/6st7\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://vid.me/6st7\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"NISSKEPCSIM","CreatedById":173812,"CreatedDateTime":"2017-05-09T07:34:06Z","Content":"\n\u003Cp\u003E\nForgive me if I\u0027m wrong, but... the Mun doesn\u0027t spin like other planets or moons. (I think) So you might want to try on Minmus or something. Because, at least in my experience, if I line up make maneuver node to take me head on into the centre of a crater, I will still be heading for the centre of that crater after a few minutes of suborbital flight.\n\u003C/p\u003E\n"},{"CreatedByName":"Whisky Tango Foxtrot","CreatedById":172896,"CreatedDateTime":"2017-05-09T15:17:09Z","Content":"\n\u003Cp\u003E\nThe Mun does rotate, it just does it more slowly than other bodies (so that its rotation speed matches up with its orbital speed.) I don\u0027t have a sure-fire way to account for rotation when setting up the manoeuvre nodes (basically you just get a \u0022feel\u0022 for the body\u0027s rotation, try to compensate as best you can and make adjustments as you get closer) but once you\u0027re done with the nodes and on your final approach setting the navball to Surface mode will cause the speed and prograde/retrograde indicators to take the body\u0027s rotation into account, so you can still use the techniques outlined in this video to land.\n\u003C/p\u003E\n"}]}