{"TopicId":160384,"ForumId":70,"TopicTitle":"universe corruption","CreatedByName":"antgeth","CreatedById":96275,"CreatedDateTime":"2017-05-09T00:49:39Z","PageNum":1,"Articles":[{"CreatedByName":"antgeth","CreatedById":96275,"CreatedDateTime":"2017-05-09T00:49:39Z","Content":"\n\u003Cp\u003E\nso i play with a whole ton of mods, which most of the time works just fine.  sometimes, however, Something Terrible will happen spontaneously and it renders the game (both current saves and brand new ones) completely unplayable. i\u0027ve never been able to pin down the source and i sure would love to so i could figure out the culprit.  sadly, even describing the problem is quite difficult, but perhaps the best way is that motion and velocity don\u0027t... work properly any more.  a good example of this is maneuver nodes:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/a/aDm40\u0022 style=\u0022height:353px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nin a 100km kerbin orbit i told mechjeb to create a maneuver node for an eve transfer. i made this gif at 1000x warp.  the maneuver node drifts (and seems to match up with the procession of the anti-target marker) over time.  likewise, if one actually tries a transfer orbit (even to the mun), your destination mysteriously ends up at some other point in its orbit when you actually arrive.\n\u003C/p\u003E\n\u003Cp\u003E\ni\u0027m throwing this out there in the hope that someone will recognise this issue and help identify what has gone wrong.  it never appears immediately after i add a mod, but rather after a lot of playing on a save.\n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2017-05-09T01:34:10Z","Content":"\n\u003Cp\u003E\nEither you have a kraken attack or your maneuver placement is not optimal. IDK, but mostly stuff like this is caused by glitches or bug when adding a mod. So yeah, my guess is you are being attacked by kraken\n\u003C/p\u003E\n"},{"CreatedByName":"Jas0n","CreatedById":57441,"CreatedDateTime":"2017-05-09T03:09:54Z","Content":"\n\u003Cp\u003E\nWhat mods do you have installed? It looks like you have principia, which I would think is capable of breaking a universe.\n\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2017-05-09T08:16:16Z","Content":"\n\u003Cp\u003E\nYour gif doesn\u0027t really tell about anything weird, apart that you made a node almost 2 years in the future. The \u003Ca href=\u0022https://en.wikipedia.org/wiki/Orbital_period\u0022 rel=\u0022external nofollow\u0022\u003Esynodic period\u003C/a\u003E of Eve from Kerbin is 679.9553 kerbin days, therefore is guaranteed that the first possible transfer window can\u0027t be beyond that; however Mechjeb placed the node at (1 year = 426.09 days) \u002B 399 days \u002B (5 h = 0.83 days) = 825.92 days in the future.\n\u003C/p\u003E\n\u003Cp\u003E\nThe node \u0022drifting\u0022 isn\u0027t anything weird. Given you were in a 1000x timewarp, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E wasn\u0027t keeping the ship oriented, so the node would move away from the \u0022nose\u0022 of the ship even if you actually tracked the node (which you hadn\u0027t). The direction of the burn at the node position remains fixed in space; you see that direction move because of the relative position on the orbit of your vessel changing, but the change is relative to the body you are orbiting, while remaining fixed in space (and that goes with the Eve antitarget marker too). Do the same with a stock (unmodded) KSP install, you\u0027ll find the effect just as well.\n\u003C/p\u003E\n\u003Cp\u003E\nIsn\u0027t clear what you state with \u0022if one actually tries a transfer orbit (even to the mun), your destination mysteriously ends up at some other point in its orbit when you actually arrive.\u0022. If you set up a transfer manually so to show an encounter, executing it correctly will bring to the encounter (may require some mid-course adjustment for interplanetary transfers, certainly not for Mun). If the transfer is planned by MechJeb and doesn\u0027t fit, that is a MechJeb issue to be reported with that add-on thread (but is probably due to other add-ons interfering, MechJeb alone isn\u0027t known to make such evident errors). Bodies in the KSP universe don\u0027t move erratically, not even while using Principia: their position with time strictly follows keplerian laws, so if they \u0022mysteriously\u0022 end somewhere else is because the time of your transfer isn\u0027t the same of what was planned. Which most often is caused by navigation errors.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"antgeth","CreatedById":96275,"CreatedDateTime":"2017-05-10T20:03:11Z","Content":"\n\u003Cp\u003E\nno principia\n\u003C/p\u003E\n\u003Cp\u003E\nhere\u0027s a list of what i play with:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nalternate resource panel\u003Cbr\u003E\naviation lights\u003Cbr\u003E\nall the b9 packs\u003Cbr\u003E\ncomm resource packs\u003Cbr\u003E\ncomm tech tree\u003Cbr\u003E\ncomm terrain texture pack\u003Cbr\u003E\ncustom barn kit\u003Cbr\u003E\ndeployable engines\u003Cbr\u003E\ndistant object enhancement\u003Cbr\u003E\ndmagic science\u003Cbr\u003E\neditor extensions\u003Cbr\u003E\neve\u003Cbr\u003E\nfilter extensions\u003Cbr\u003E\nfirespitter\u003Cbr\u003E\nhangar extender\u003Cbr\u003E\nhyperedit\u003Cbr\u003E\nindicator lights\u003Cbr\u003E\ninterstellar fuel switch\u003Cbr\u003E\nk aircraft expansion\u003Cbr\u003E\nk attachment\u003Cbr\u003E\nk inventory\u003Cbr\u003E\nkopernicus\u003Cbr\u003E\nlithobrake exploration\u003Cbr\u003E\nmark iv\u003Cbr\u003E\nmechjeb\u003Cbr\u003E\nmk3 stockalike\u003Cbr\u003E\nmodactions\u003Cbr\u003E\nmodular flight integrator\u003Cbr\u003E\nmm\u003Cbr\u003E\nnavball adjustor\u003Cbr\u003E\nall the near future packs\u003Cbr\u003E\nopm\u003Cbr\u003E\nplanetshine\u003Cbr\u003E\nrealchute\u003Cbr\u003E\nscatterer\u003Cbr\u003E\nsigma dimensions\u003Cbr\u003E\nsmart parts\u003Cbr\u003E\nspacey heavy/expanded\u003Cbr\u003E\ntexturereplacer\u003Cbr\u003E\ntimecontrol\u003Cbr\u003E\ntoadicus\u003Cbr\u003E\ntoolbar\u003Cbr\u003E\ntotaltime\u003Cbr\u003E\ntrajectories\u003Cbr\u003E\ntweakable everything\u003Cbr\u003E\ntweakscale\u003Cbr\u003E\nuniversal storage\u003Cbr\u003E\nusi tools/exploration/core\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nit\u0027s clear that my difficulty in explaining the issue is even moreso than i realised.  i\u0027ve put thousands of hours into this game over a 4 year timespan... i\u0027d like to think i can tell when something is fundamentally Wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nhere\u0027s another example: often, when it reaches this state, if i create a maneuver node and start burning it, the remaining delta-v count will go \u003Cem\u003Eup\u003C/em\u003E.  that indicates to me that something is rotten in the state of kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2017-05-11T11:26:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223052329\u0022 data-ipsquote-contentid=\u0022160384\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221494446591\u0022 data-ipsquote-userid=\u002296275\u0022 data-ipsquote-username=\u0022antgeth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, antgeth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhere\u0027s another example: often, when it reaches this state, if i create a maneuver node and start burning it, the remaining delta-v count will go \u003Cem\u003Eup\u003C/em\u003E.  that indicates to me that something is rotten in the state of kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is what happens anytime thrust is applied in a direction away from the correct maneuver (more than 90° from that). You certainly know that being the result when overburning a maneuver (applying more than the required \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E), after having reached the minimum. The \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E counter shows the amount required to fulfill the maneuver (that is, how much the current ship velocity vector is away from the required ship velocity vector) irrelevant of the direction. If that happens while correctly aiming at the maneuver marker, one of the following is the probable cause: burning at a orbital position very far from the node position; using engines thrusting in a direction different than the root part axis; or a bug with the marker placement. The latter could be verified by using an alternative way to place navigation nodes (e.g. if you experience the bug using MechJeb, check if the same happens executing any maneuver with a manually placed node).\n\u003C/p\u003E\n"},{"CreatedByName":"antgeth","CreatedById":96275,"CreatedDateTime":"2017-05-11T22:32:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223052921\u0022 data-ipsquote-contentid=\u0022160384\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221494502016\u0022 data-ipsquote-userid=\u002293700\u0022 data-ipsquote-username=\u0022diomedea\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, diomedea said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat is what happens anytime thrust is applied in a direction away from the correct maneuver (more than 90° from that). You certainly know that being the result when overburning a maneuver (applying more than the required \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E), after having reached the minimum. The \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E counter shows the amount required to fulfill the maneuver (that is, how much the current ship velocity vector is away from the required ship velocity vector) irrelevant of the direction. If that happens while correctly aiming at the maneuver marker, one of the following is the probable cause: burning at a orbital position very far from the node position; using engines thrusting in a direction different than the root part axis; or a bug with the marker placement. The latter could be verified by using an alternative way to place navigation nodes (e.g. if you experience the bug using MechJeb, check if the same happens executing any maneuver with a manually placed node).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nsadly it does indeed happen when burning right on the node (both in space and time), with a variety of different ships, and regardless of how the node was created.\n\u003C/p\u003E\n\u003Cp\u003E\nhonestly i\u0027m not really expecting a fix for this, since it\u0027s so difficult both to describe and replicate.  i\u0027ve since made a new copy of the game and re-modded it (i have yet to try copying the save file i was in the middle of over).  i just hope that someone else might have encountered this issue who has a clue as to the culprit.\n\u003C/p\u003E\n"}]}