{"TopicId":160616,"ForumId":16,"TopicTitle":"Extreme Heat on Base","CreatedByName":"digger1213","CreatedById":176898,"CreatedDateTime":"2017-05-14T09:39:18Z","PageNum":1,"Articles":[{"CreatedByName":"digger1213","CreatedById":176898,"CreatedDateTime":"2017-05-14T09:39:18Z","Content":"\n\u003Cp\u003E\nI recently got a mining base at Vall.\n\u003C/p\u003E\n\u003Cp\u003E\nWhenever I am at a seperate craft, and I come into range of the base, it always seems on the verge of exploding. Many parts are always on the verge of exploding, including the many radiators I have mounted. Notably, my drills and my refinery are not overheating.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Aw7RtO6.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/Aw7RtO6.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat the heck is happening here? None of my other bases (which all use practically the same design) do this.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-05-14T11:12:34Z","Content":"\n\u003Cp\u003E\nIt\u0027s a known bug, and it\u0027s fixed in the new beta version. What happens is that when the drills and converters are running, but the craft is not in focus, the \u0022core\u0022 heat is flowing out of the drills and converters into the surrounding ship, and building up, which make the ship warm. Please note that (besides the radiators) the rest of the bits of the ship are warm to hot -- but not on the verge of exploding.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you return to the physics bubble of the ship, the radiators see that the whole ship is warm and needs cooling. They are smart about how they do cooling, so they go to 99.9% full blast cooling mode. This makes the radiators glow red hot, but they know what they are doing. The radiators will never blow themselves up through overheating, but all those sudden red bars and the glowing red hot stuff makes me jump every time I see it too.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}