{"TopicId":160640,"ForumId":81,"TopicTitle":"Unable to leave Astronaut complex","CreatedByName":"Frenzy2121","CreatedById":177788,"CreatedDateTime":"2017-05-15T04:27:14Z","PageNum":1,"Articles":[{"CreatedByName":"Frenzy2121","CreatedById":177788,"CreatedDateTime":"2017-05-15T04:27:14Z","Content":"\n\u003Cp\u003E\nI opened the astronaut complex to hire another Kerbal, and couldn\u0027t leave the complex after. Pressing the Exit button in the top right corner didn\u0027t work do anything, same with the Quit to Main Menu. The only thing that worked was loading a previous save, but that kind of defeats the purpose because then you can\u0027t hire new Kerbals\n\u003C/p\u003E\n"},{"CreatedByName":"SleepyInsomniac","CreatedById":174215,"CreatedDateTime":"2017-05-16T00:17:53Z","Content":"\n\u003Cp\u003E\nI know in PS4 that is a sign that your save might corrupt soon. Make sure to keep the save file as slim as possible by not having too many ships in orbit, flags, satellites, saved ships or kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nNot sure if this is helpful, just throwing it out there.\n\u003C/p\u003E\n"},{"CreatedByName":"Frenzy2121","CreatedById":177788,"CreatedDateTime":"2017-05-16T15:34:47Z","Content":"\n\u003Cp\u003E\nThanks for the tip, I\u0027ll try to clean up my file a little\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2017-05-17T08:38:52Z","Content":"\n\u003Cp\u003E\nBeen having the same issue but mine happens when I enter any kind of building other than \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or Hangar. I have noticed however that right before it starts happening, I\u0027ll usually be focused on my spacecraft and then start having issues getting the game to accept my inputs. Basically I\u0027ll click something such as the quick save button or the return to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E button upward of 10 to 20 times before it may or may not actually do it.\n\u003C/p\u003E\n"}]}