{"TopicId":16077,"ForumId":24,"TopicTitle":"This weeks highlights at KSC","CreatedByName":"Claes","CreatedById":35970,"CreatedDateTime":"2012-08-05T02:39:39Z","PageNum":1,"Articles":[{"CreatedByName":"Claes","CreatedById":35970,"CreatedDateTime":"2012-08-05T02:39:39Z","Content":"\n\u003Cp\u003EHi everyone. I recently stumbled upon KSP, after \u0022playing\u0022 Martin Schweiger\u0027s \u0022Orbiter\u0022 for quite a while. The images below highlights some of this weeks (my first) activities at KSC. Please enjoy, I did.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/120731%20Munar%20landing%201%20-%20small%20step%20for%20a%20kerbal.jpg\u0022 alt=\u0022120731%20Munar%20landing%201%20-%20small%20step%20for%20a%20kerbal.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first Munar landing, a pretty hair-raising affair of hand-sticking and wild eyeballing. But, hey, we made it! Small step for a Kerbal, one giant leap for me!\u003C/p\u003E\u003Cp\u003EThis forum was quite helpful with hints on how to time the transfer burn to Mun, without any add-on tools.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/20120801%20Munar%20landing%202%20-%20parachute%20over%20KSC.jpg\u0022 alt=\u002220120801%20Munar%20landing%202%20-%20parachute%20over%20KSC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter some more hand-sticking and pure luck, our heroic Kerbal made it back not only to Kerbin, but literally to the front porch of KSC. The time had come for the program to move on. Hand-flying was considered obsolete. And dangerous. And we can\u0027t have dangerous, nossiree. So, MechJeb was installed, and a most ambitious goal was set: a double landing on Mun! Inside a crater of great geological significance! With MechJeb automation!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/Double%20munar%20landing%20and%20subsequent%20rescue.jpg\u0022 alt=\u0022Double%20munar%20landing%20and%20subsequent%20rescue.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first of the two-ship flight landed ok. A few minuter later, ship 2 landed hard on a sloping surface and the command pod broke off from the return stage! Oh noes! Fortunately, the brave engineers behind their desks and computers, came up with a rescue ship on very short notice. The still-functional Lander 1 was left on the Mun. Perhaps it can be used as a lifeboat for further expeditions. All kerbals made it back and are accounted for.\u003C/p\u003E\u003Cp\u003ENew goals were set! Ambitions were even higher! We\u0027ll land on a mountaintop on Minimus! *insert party-tweeter here*\u003C/p\u003E\u003Cp\u003EA few days and several thousand kilometers later, on a mountaintop, on Minimus;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/100802%20first%20Minimus%20landing%20and%20another%20disaster.jpg\u0022 alt=\u0022100802%20first%20Minimus%20landing%20and%20another%20disaster.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh MAN, not again!\u003C/p\u003E\u003Cp\u003EThe lander touched down at default vertical speed, 0,5 m/s, slid sideways, bounced, and the rest is still a bit blurry... Some say an engineer somewhere was embarrassed.\u003C/p\u003E\u003Cp\u003EEmbarrassed maybe, but not without answer to nature\u0027s challenges. There will be a rescue landing on the same mountain! No Kerbals gets left behind. Or on a frozen rock in outer space.\u003C/p\u003E\u003Cp\u003EDamnedRobotics was consulted, and NovaPunch parts were added. A 1-2-command pod was edited to function as a crewable strut and the whole shebang was remote-controlled to a bouncy, wide-stanced mountaintop landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/Minimus%20rescue%20craft%20-%20Kerbal%20and%20Mun.jpg\u0022 alt=\u0022Minimus%20rescue%20craft%20-%20Kerbal%20and%20Mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow THAT, ladies and gentlemen, is a bona-fide mountain-top-rescue lander, made possible by community support! (And a nice pic as well, with Mun and Kerbin rising over the Minimus horizon.) The rescue craft even made it back with the rescued Kerbals to KSC (-ish) through aerobraking and shoddy timing of parachutes. (Does anybody have a boat-part, plz, they\u0027ve been floating around out there for days now.)\u003C/p\u003E\u003Cp\u003EA great many thanks to the KSP dev team and all you people who makes such great addons. And thanks to Dr. Schweiger who got me started prograde on the quest for space.\u003C/p\u003E\u003Cp\u003ENow, is there a tool or tip to remotely determine the slope angle at a specific coordinate?\u003C/p\u003E\u003Cp\u003E/Claes\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-08-06T19:36:07Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003EKSP Community Manager\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-06T19:41:03Z","Content":"\n\u003Cp\u003EHi Claes, that is a very impressive post and a great way to introduce yourself to the community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m glad you are enjoying the game so much, and it\u0027ll only get better as time goes on, now go launch some rockets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2012-08-06T20:31:57Z","Content":"\n\u003Cp\u003EFantastic post, Claes. Your Kerbals are lucky to have you running their program.\u003C/p\u003E\u003Cp\u003EI\u0027d be interested to read more about how you manged to (\u003Cem\u003Emanually!\u003C/em\u003E) return your first Mun mission to KSC. I\u0027ve been playing for a couple of months now and the closest I\u0027ve come is 45km away (in the foothills west-south-west of KSC, where the returned capsule of course rolled over on its hatch, trapping the brave Kerbonaut).\u003C/p\u003E\u003Cp\u003EI\u0027m also fascinated by your rescue lander. More details and screenshots of that intriguing beaut would be welcome.\u003C/p\u003E\n"},{"CreatedByName":"simplemunrockets","CreatedById":22495,"CreatedDateTime":"2012-08-06T20:59:34Z","Content":"\n\u003Cp\u003EI haven\u0027t gotten around to a plateau-landing on Minmus yet. It\u0027s one of my goals.\u003C/p\u003E\n"},{"CreatedByName":"Claes","CreatedById":35970,"CreatedDateTime":"2012-08-07T20:48:55Z","Content":"\n\u003Cp\u003EThanks Kev. Well, thay let me stay as I do the work for free. The manual return involved both a little planning and a lot of luck. I got into a very good equatorial orbit on return from Mun, that was pure luck. I made just a small plane-change to align to Kerbin equator. I then retro-braked late to a very steep reentry. I figured that the steeper the reentry, the less lateral offset would be added from atmospheric drag later on, thus making it less impossible to judge where the trajectory would go. This is not really an option in real life because of the enormous G-forces such a steep reentry would induce. The poor Kerbal suffered from at least 10-15 G. The reentry path would still overshoot the KSC, but not by much, so to land *at* KSC required me to manually pop the chutes when I was just-short-of on top of it. I believe I was at or just below 20 000 meters altitude. That it got so good was also sheer luck. I tried to do it again tonight, but did not manage to get it so perfect again. I landed with KSC in view, but not on top of it.\u003C/p\u003E\n"},{"CreatedByName":"Claes","CreatedById":35970,"CreatedDateTime":"2012-08-07T20:57:47Z","Content":"\n\u003Cp\u003EHere it is, on top of its launch vehicle in the VAB. Thanks to the enormously wide stance, even wider with the pistons extended, it can land on a sloping surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/Minimus%20rescue%20craft%20Mk1.jpg\u0022 alt=\u0022Minimus%20rescue%20craft%20Mk1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here it is, landed on the Minimus mountain.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022/KSP/Minimus%20rescue%20craft.jpg\u0022 alt=\u0022Minimus%20rescue%20craft.jpg\u0022\u003E\u003Cimg src=\u0022/KSP/Minimus%20rescue%20craft%20-%20crew%20access.jpg\u0022 alt=\u0022Minimus%20rescue%20craft%20-%20crew%20access.jpg\u0022\u003E\u003C/p\u003E\n"}]}