{"TopicId":160991,"ForumId":44,"TopicTitle":"Amateur Telescope Making (UPDATED 9/23/18) - 20\u0026quot; f/4 Nearly Complete","CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2017-05-24T15:04:54Z","PageNum":9,"Articles":[{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-04T18:41:27Z","Content":"\n\u003Cp\u003E\nBlank gets here Monday. I start classes again on Tuesday.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-01-05T13:25:52Z","Content":"\n\u003Cp\u003E\nThat\u0027s quite a piece of glass!  I tried grinding a 6\u0022 mirror years ago.  It got stuck to the pitch lap, I panicked and tried to pry the mirror off.  It popped off, went flying across the room and smashed on the floor and that was that.  \n\u003C/p\u003E\n\u003Cp\u003E\nSo how do you choose eyepieces?  I seem to recall different eye pieces work better with different focal lengths but I can\u0027t recall how or why.\n\u003C/p\u003E\n\u003Cp\u003E\nNice work though!  \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-05T13:49:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223260198\u0022 data-ipsquote-contentid=\u0022160991\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221515158752\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s quite a piece of glass!  I tried grinding a 6\u0022 mirror years ago.  It got stuck to the pitch lap, I panicked and tried to pry the mirror off.  It popped off, went flying across the room and smashed on the floor and that was that.  \n\u003C/p\u003E\n\u003Cp\u003E\nSo how do you choose eyepieces?  I seem to recall different eye pieces work better with different focal lengths but I can\u0027t recall how or why.\n\u003C/p\u003E\n\u003Cp\u003E\nNice work though!  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, if you read back my first 6\u0022 mirror got stuck to a too-soft pitch lap as well. I chipped it a bit in a vain attempt to remove it. Eventually got it off by letting the mirror/lap sit in the sun to melt the pitch, prying them apart, and then bathing them in acetone to dissolve the pitch (Acetone, like pitch, is nonpolar and thus will dissolve it). The 12\u0022 is my third mirror. Despite being quite large it\u0027s thin and thus lightweight at only 1\u0022 thick - not quite thick enough to support itself under its on weight, but thick enough to require relatively simple support.\n\u003C/p\u003E\n\u003Cp\u003E\nYou typically want at least 3 eyepieces - one around 20-32mm (depends on the scope) for low power (i.e. large DSOs and finding things), one from 12-18mm for medium power (most DSOs and maybe the Moon), and one from 5-10mm for high power (small DSOs, double stars, Moon, planets). Sometimes you\u0027ll want one below 5mm for really high power with a scope below f/6 or so. More eyepieces than 4 or so tend to be unnecessary and seldom used. Price usually depends on the apparent field of view, coatings, and performance (i.e. astigmatism/coma correction) below f/6. \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-06T16:35:55Z","Content":"\n\u003Cp\u003E\n12\u0022 blank is here. It\u0027s a bit heavier than I expected but still very nice.\n\u003C/p\u003E\n"},{"CreatedByName":"Kaa253","CreatedById":68628,"CreatedDateTime":"2018-01-07T02:46:48Z","Content":"\n\u003Cp\u003E\nSorry I missed this thread last year!\n\u003C/p\u003E\n\u003Cp\u003E\nGood to see a 12\u0022 is in the works \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-14T22:51:09Z","Content":"\n\u003Cp\u003E\nStarted working on the mirror today after pouring a plaster tool. Sagitta is very slight after 1 hour of #60.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-17T21:42:36Z","Content":"\n\u003Cp\u003E\nWell, I was doing things wrong (using too much grit). After just 30 minutes with #60 I\u0027ve got a reasonably visible sagitta about 1/10 of the required depth.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-20T21:32:23Z","Content":"\n\u003Cp\u003E\nAt nearly 1/2 the required depth now after a few more hours.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-21T01:57:08Z","Content":"\n\u003Cp style=\u0022color:#222222;font-size:15px;\u0022\u003E\nSo I\u0027ve... probably reached the target sagitta. The spherometer reading is just plain wrong (I might just be reading it wrong, IDK), while the coin test says I\u0027m probably at f/7.5?? In any case I ran out of #60 completely and my arms ache.\n\u003C/p\u003E\n\u003Cp style=\u0022color:#222222;font-size:15px;\u0022\u003E\nA tile fell off the tool somehow; it was at the edge. I might pour a new tool for fine grinding since the edge tiles are getting so thin.\n\u003C/p\u003E\n\u003Cp style=\u0022color:#222222;font-size:15px;\u0022\u003E\nTomorrow I\u0027ve got to hose down everything to prevent contamination from #60; I\u0027ll try measuring the FL using the Sun. Worst that happens is I\u0027ve got to do extra grinding with #80, of which I have plenty.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-26T14:45:53Z","Content":"\n\u003Cp\u003E\nI\u0027ve been busy and haven\u0027t gotten a chance to work on the mirror in nearly a week. Today or tomorrow I\u0027m going to do some further hogging with #80 since I\u0027m nowhere near even f/8 yet.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-27T16:23:29Z","Content":"\n\u003Cp\u003E\nI\u0027m about to go downstairs and work on the 12\u0022. I just bought a 16\u0022 blank and an 8\u0022 homemade Dob I\u0027ll likely part out for very little money, so it appears I\u0027ve found the material for my next project.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-27T19:30:54Z","Content":"\n\u003Cp\u003E\nI can fit 2 dimes in the sagitta, so I\u0027m pretty much at the target. I did the pencil test and switched to center-over center and to my surprise the mirror and tool are in pretty good contact, even at the edge. I attribute this to my use of circular strokes like what Udjat uses instead of the regular chordal stroke.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m debating whether to continue with #80 or just switch straight to #120. The difference in size between #60 and #80 pits is small, and I don\u0027t see the point in working to get rid of all of the #60 pits then having to work to rid myself of #80 pits.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-30T00:52:06Z","Content":"\n\u003Cp\u003E\nMy tile tool is toast. The center tiles aren\u0027t wearing down at all, there\u0027s no contact at the center, and it appears that the worn and non-worn tiles have completely different radii. In addition, the edge tiles are so thin that they might disappear after the next work session.\n\u003C/p\u003E\n\u003Cp\u003E\nI ordered more plaster (I\u0027m pretty much out and don\u0027t have enough for a new tool), should get here Saturday, but I leave for Florida on Sunday and get back the following Saturday. This time it\u0027s blue instead of pink.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-01-31T17:35:48Z","Content":"\n\u003Cp\u003E\nThrough a bizarre series of events, I managed to get a complete homemade 8\u0022 Dob with a dual-speed focuser, a bunch of testing equipment, a bunch of grit, and a 16\u0022 f/5 polished mirror for the whopping price of \u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E$150.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe 8\u0022 scope is abominably heavy (the mount is entirely constructed out of 3/4\u0022 plywood), and the primary needs recoating, so I\u0027m parting it out because a) I don\u0027t need it and b) if I can reclaim some/all of my investment by selling the optics, why not? I am keeping the mount because while the paintjob could be better (Black mount and black tube? Really?) and it weighs about as much as a small child, it does have nice construction and even an adjustable tube cradle - and it\u0027s not worth the cost of shipping anyways. The focuser I\u0027m keeping as well, obviously - it alone is nearly worth the price I paid for all of this.\n\u003C/p\u003E\n\u003Cp\u003E\nThe seller told me an interesting story. He wanted to make his own scope so he bought a kit to make his own mirror grinding machine (a mirror-o-matic kit to be exact) , and proceeded to make an 8\u0022 on it. He dropped the 8\u0022 during fine grinding and bought a GSO primary to build a scope with. Then, despite having no prior skill in even polishing a mirror, he proceeded to make the 16\u0022, and gave up during figuring because he had no idea what he was doing. Now he has an 8\u0022 Skywatcher collapsible scope and has given up on the whole ATMing thing, so he sold me everything but the machine (I don\u0027t really have the money for it nor the space).\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition to having no prior skill in polishing/figuring, this guy used Burgundy pitch (which if you remember from when I started making mirrors is unreliable and bad) and ROUGE (messy and slow-working) to polish despite having \u003Cstrong\u003EPLENTY\u003C/strong\u003E of cerium oxide and zirconium oxide (the latter works slower and leaves a slightly smoother surface than cerox - like rouge but without the mess). There\u0027s still rouge on the test stand he made for it that gets on my fingers whenever I touch it, and the entire side of the mirror is stained with it (though thankfully it doesn\u0027t come off).\n\u003C/p\u003E\n\u003Cp\u003E\nI plopped it on the Ronchi tester (which I had to position a little over 13 feet away!), expecting either a somewhat decent sphere (assuming he just gave up on figuring without actually trying it) or a mess. I got the latter. The mirror is pretty astigmatic, as well as hyperbolic (though the astigmatism makes it hard to tell and it may not be that severely overcorrected). Just to make sure the astigmatism wasn\u0027t caused by the glass itself having issues, I tested the mirror for strain - I found none. So the messed-up surface is his fault, and I can fix it.\n\u003C/p\u003E\n\u003Cp\u003E\nDespite the issues with the surface, correcting this 16\u0022 will take far less time and effort than working the 12\u0022. So once I pour a new tool and finish with #80 on the 12\u0022, at which point I\u0027d have to clean up my work area anyway, I\u0027m going to put everything away and focus on finishing the 16\u0022 instead. \n\u003C/p\u003E\n\u003Cp\u003E\nDoes this mean I\u0027m abandoning the 12\u0022? Heck no! I just don\u0027t have the money to complete both at the moment and I\u0027d rather work on the one that will take less time and has more aperture. The 12\u0022 may get redesigned to be either a faster and more portable instrument or a slower (f/7-f/8) Chief with no central obstruction, but I will still finish it. Just not right now.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-01T16:50:11Z","Content":"\n\u003Cp\u003E\nMy new plaster somehow got here today, so I can vacuum the shop tonight and pour a new lap tomorrow.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-02T01:58:40Z","Content":"\n\u003Cp\u003E\nPoured the lap base. I wanted to have it match the curve, but I don\u0027t have a 12\u0022 wide wooden ring so keeping the mold rigid and having it be sub diameter wasn\u0027t possible. I ended up pouring it against the back of the 12\u0022, so it\u0027s pretty much flat. Since I\u0027m pouring pitch on it anyway and this is an f/5 mirror, I\u0027m not concerned.\n\u003C/p\u003E\n\u003Cp\u003E\nMore tomorrow.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-03T17:48:58Z","Content":"\n\u003Cp\u003E\nSo my hot plate self-destructed and I had to buy a new one yesterday.\n\u003C/p\u003E\n\u003Cp\u003E\nI poured the lap and carved the channels with a hacksaw. Using this thing is an annoying process as it can\u0027t overhang the mirror, but I have to be careful not to place it on the mirror too hard, otherwise the edges will chip.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/0UcRj6yd3Zo?feature=oembed\u0022 width=\u0022459\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI put the mirror on the tester and it\u0027s much better than before, but the astigmatism is far from gone.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-03T18:05:53Z\u0022 title=\u002202/03/2018 06:05  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 3, 2018\u003C/time\u003E by _Augustus_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-02-04T13:02:19Z","Content":"\n\u003Cp\u003E\nAre you in school for astronomy or engineering?  Are you planning on doing any astrophotography with any of the scopes you are making?   I\u0027m amazed at how amateur astronomers team up with professionals these days to do real science.    \n\u003C/p\u003E\n\u003Cp\u003E\nSorry to hear about your hot plate.    \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-04T21:00:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223285441\u0022 data-ipsquote-contentid=\u0022160991\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517749339\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre you in school for astronomy or engineering?  Are you planning on doing any astrophotography with any of the scopes you are making?   I\u0027m amazed at how amateur astronomers team up with professionals these days to do real science.    \n\u003C/p\u003E\n\u003Cp\u003E\nSorry to hear about your hot plate.    \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1. Nope.\n\u003C/p\u003E\n\u003Cp\u003E\n2. I\u0027ve done some afocal Moon shots with a phone but that\u0027s about it (I might be able to get some decent planetary shots, too, but still nothing amazing). Serious planetary AP requires a fancy webcam with a tiny chip and tiny field of view, which without tracking means the target drifts out of the field after a few seconds. Long exposures? Forget it.......\n\u003C/p\u003E\n\u003Cp\u003E\n3. No worries, bought an identical new one for $15.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-13T17:20:37Z","Content":"\n\u003Cp\u003E\nOkay, so it\u0027s been a while! I was in Florida to watch the FH launch and got back a few days ago and neglected this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nI got back to refiguring on the 11th and noticed that my wooden turntable didn\u0027t rotate evenly and wasn\u0027t staying level, which I thought was odd. Turns out that it has buckled into a saddle-like shape, probably because it was stored in the garage for a while before I used it. I did get around half an hour or so in before I realized this. I have a new turntable, but I haven\u0027t bothered working on the mirror yet since.\n\u003C/p\u003E\n\u003Cp\u003E\nI did some further Ronchi/Foucault (I sort of understand how to do the latter now) after my work session, and I found the following:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe astigmatism is nearly gone. It\u0027s still noticeable and distorts the bands a little, but I can now actually read the Ronchi bands and they\u0027re not curvy. I rotated the mirror just to make sure it wasn\u0027t some sort of coincidence of the astigmatic axis being dead horizontal or vertical, and still saw the same thing.\n\u003C/li\u003E\n\u003Cli\u003E\nThe mirror is slightly overcorrected. I don\u0027t know by how much, but doesn\u0027t differ a whole lot from the \u0022ideal\u0022 patterns for a 16\u0022 f/4.9 (I remeasured the ROC to be around 157\u0022) on Mel Bartels\u0027 Ronchi page, so I\u0027m not too concerned. Why it\u0027s not spherical is anyone\u0027s guess, but I\u0027m not complaining......\n\u003C/li\u003E\n\u003Cli\u003E\nThere\u0027s a 3\u0022 diameter \u0022hole\u0022 (depressed zone) at the center of the mirror. I\u0027m not sure how it got there, and I\u0027m not sure if it was there before and I just didn\u0027t notice, but since it\u0027ll be behind the secondary mirror I don\u0027t particularly care.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSince the mirror is probably capable of throwing up a good enough image that I can determine the focal point, I\u0027ve started working on the scope itself. I currently have the mirror box (not the cell or bearings, just the box) finished and am about to move on to the mirror cell.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-16T17:00:25Z","Content":"\n\u003Cp\u003E\nSecondary mirror is here, and the trusses should get here Tuesday. I ordered a spider as well, but that\u0027s going to be a while - it\u0027s possible I won\u0027t have it until mid-March. That sucks, because I need the spider to determine the OTA balance point......\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-19T01:35:29Z","Content":"\n\u003Cp\u003E\nMirror cell is done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uBywAr8.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/uBywAr8.jpg\u0022 width=\u0022862\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229a9I6wu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/9a9I6wu.jpg\u0022 width=\u0022613\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-21T14:47:51Z","Content":"\n\u003Cp\u003E\nSo the biggest local astronomy club has their annual Messier Marathon on March 16th this year. I could bring the 6\u0022 to that, but there would probably be a fair amount of M\u0027s that would be either invisible and show no detail, either. To that end, I\u0027m now targeting a date of March 7th or so to have the scope done (so I can allow a week for coating), giving me the possibility of bringing it to the Marathon.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause of the date requirement I\u0027ll make my own curved spider - the secondary is small enough that I think it will do. Later today I will go to Home Depot and get my FRP, foam wrapping for the trusses, and more screws, and the local wood shop to get my UTA rings and alt bearings cut (my %\u0026amp;@* router\u0027s sub-base does not detach and thus it\u0027s useless for cutting circles as it cannot attach to a jig). Tonight or Friday I\u0027ll finish constructing the entire scope, and prepare for star testing (looks like I can do that Tuesday).\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-23T14:55:18Z","Content":"\n\u003Cp\u003E\nSorry for the lack of updates. I went to HD yesterday and got my own circle jig for my router, genuine Formica, screws/bolts, etc. Also started attaching the trusses to the mirror box and added ventilation holes to the back.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2018-02-24T18:04:03Z","Content":"\n\u003Cp\u003E\nOTA is (mostly) complete (I\u0027m 6\u0027 1\u0022 for scale).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RCSYAV9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/RCSYAV9.jpg\u0022 width=\u0022645\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe wood blocks mounting the trusses to the UTA need to be re-done because the bolts are angled and thus won\u0027t fit through the trusses, but other than that the only work left is the mount (50% done already) and curved spider. And there\u0027s some painting/staining work that I\u0027ll do after I test this with the uncoated mirror.\n\u003C/p\u003E\n"}]}