{"TopicId":161015,"ForumId":16,"TopicTitle":"No pilots left, how do I get more","CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-05-24T23:58:35Z","PageNum":1,"Articles":[{"CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-05-24T23:58:35Z","Content":"\n\u003Cp\u003E\nAll,\n\u003C/p\u003E\n\u003Cp\u003E\nI have no pilots left, they are all stuck in orbit, how do I get more?  All I have in my complex are scientists and engineers!  I need a pilot to help me steer my ship.\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2017-05-25T00:02:09Z","Content":"\n\u003Cp\u003E\nHave you tried hiring more pilots in the complex?\n\u003C/p\u003E\n\u003Cp\u003E\nIf this doesn\u0027t work, you\u0027re out of money or your complex is full. If you\u0027re out of money, then (somehow) make more money or attempt to fly a rocket using a probe core or a scientist/engineer. If your complex is full, try upgrading it, or firing one astronaut so you can hire a pilot.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-05-25T00:20:03Z","Content":"\n\u003Cp\u003E\nThe candidates in the Astronaut Complex update slowly. So some of the engineers and scientists will go away, and some pilots will show up eventually. Alternately, you can accept and complete some rescue contracts -- lots of pilots will show up that way.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternately, once you have sent many ships to orbit, you should have a fair amount of tech unlocked. Probe cores do everything a pilot can do. So there\u0027s really no need to put pilots on ships after you\u0027ve unlocked your first couple of probe cores.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-05-25T02:16:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223066698\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495670315\u0022 data-ipsquote-userid=\u0022177671\u0022 data-ipsquote-username=\u0022jonpfl\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, jonpfl said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll,\n\u003C/p\u003E\n\u003Cp\u003E\nI have no pilots left, they are all stuck in orbit, how do I get more?  All I have in my complex are scientists and engineers!  I need a pilot to help me steer my ship.\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think, rather than hiring more pilots, you need to embrace what are probably the two most important aspects of the game: Revert Flight and F5/F9.\n\u003C/p\u003E\n\u003Cp\u003E\nEvery failure in this game is a good learning experience, but you don\u0027t have to see those failures through to the bitter end. Just revert flight or reload and start again. I think you\u0027ll find yourself a lot less frustrated. This is a fantastic game and a lot of fun, you just have to get past the learning curve (which is steep, no doubt).\n\u003C/p\u003E\n"},{"CreatedByName":"Loren Pechtel","CreatedById":157006,"CreatedDateTime":"2017-05-25T05:27:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223066723\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495671603\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe candidates in the Astronaut Complex update slowly. So some of the engineers and scientists will go away, and some pilots will show up eventually. Alternately, you can accept and complete some rescue contracts -- lots of pilots will show up that way.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternately, once you have sent many ships to orbit, you should have a fair amount of tech unlocked. Probe cores do everything a pilot can do. So there\u0027s really no need to put pilots on ships after you\u0027ve unlocked your first couple of probe cores.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHe needs pilots, he can\u0027t get up there to rescue Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the answer here is a probe core.  The basic core is as good as a new pilot, as you go up the tree they are like better pilots.  It doesn\u0027t take very far in the game before I no longer care about pilots at all, any I rescue get dismissed.\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2017-05-25T06:40:41Z","Content":"\n\u003Cp\u003E\nRescue them. And accept more rescue Missions, this way you\u0027ll get new employees for free.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-05-25T09:20:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223066921\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495690047\u0022 data-ipsquote-userid=\u0022157006\u0022 data-ipsquote-username=\u0022Loren Pechtel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Loren Pechtel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nHe needs pilots, he can\u0027t get up there to rescue Kerbals.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHe\u0027s already got a whole bunch of pilots up there to rescue other kerbals with. The problem seems to be getting them all back down again. Which can be solved by just getting one empty tourist bus up to orbit to bring everyone back down. All you need to do is a bunch of high-speed EVA rendezvous maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ManEatingApe","CreatedById":151354,"CreatedDateTime":"2017-05-25T10:30:41Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E Your situation has the potential to be turned into a fun challenge!\n\u003C/p\u003E\n\u003Cp\u003E\nWould you mind uploading your save file to somewhere like Dropbox, so we could take a look\n\u003C/p\u003E\n"},{"CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-05-25T11:43:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223067049\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495708241\u0022 data-ipsquote-userid=\u0022151354\u0022 data-ipsquote-username=\u0022ManEatingApe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ManEatingApe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E Your situation has the potential to be turned into a fun challenge!\n\u003C/p\u003E\n\u003Cp\u003E\nWould you mind uploading your save file to somewhere like Dropbox, so we could take a look\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI can do that tonight if you would like to take a look?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-05-25T12:30:13Z","Content":"\n\u003Cp\u003E\nIn fairness, he said they were stuck in orbit, which is not the same thing as saying that they were stranded in orbit; his pilots may simply be running missions and he wants to run more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E, would you mind clarifying?  Are your pilots stranded in orbit and you want to rescue them, or are you simply looking for more pilots so you can fly more missions at once?\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"ManEatingApe","CreatedById":151354,"CreatedDateTime":"2017-05-25T12:32:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223067088\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495712628\u0022 data-ipsquote-userid=\u0022177671\u0022 data-ipsquote-username=\u0022jonpfl\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, jonpfl said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can do that tonight if you would like to take a look?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGreat! Once you\u0027ve uploaded drop the link here or PM me (whichever you prefer)\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2017-05-25T14:08:07Z","Content":"\n\u003Cp\u003E\nThe random generation of applicants in the Astronaut Complex can be an issue for early careers, especially for less experienced players: first, because statistically it generates all roles equally, even though in early career and accounting for mishaps, pilots are needed way more than the others; second, because of the RNG nature sometimes it falls well below the average and you get an abundance of other roles and almost no pilots.\n\u003C/p\u003E\n\u003Cp\u003E\nThe game gives us a way to resolve a deadlock though: we can generate Kerbals with specific roles in the Debug Menu (Alt-F12 by default on PC, under \u0027Kerbals/Create\u0027). Consider it a form of aggressive headhunting, where you don\u0027t wait until applicants come to you, you go and snatch them up from a rival space agency. They will be added to your \u0027active\u0027 roster, so it is cheating in the sense that you don\u0027t have to pay for them, but you can compensate for that by removing the appropriate amount of funds through the Cheat buttons.\n\u003C/p\u003E\n"},{"CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-05-25T17:39:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223067117\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495715413\u0022 data-ipsquote-userid=\u0022125721\u0022 data-ipsquote-username=\u0022Zhetaan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Zhetaan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn fairness, he said they were stuck in orbit, which is not the same thing as saying that they were stranded in orbit; his pilots may simply be running missions and he wants to run more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E, would you mind clarifying?  Are your pilots stranded in orbit and you want to rescue them, or are you simply looking for more pilots so you can fly more missions at once?\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, my pilots are stranded in orbit (ships ran out of fuel) and would like more pilots so I can fly other missions.  I haven\u0027t attempted to rescue them yet but I guess I could try that (after I run through the tutorial).\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-05-25T19:48:47Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\nAll right, I can still help you.  While it\u0027s true that if you wait long enough, more pilots will appear in the Astronaut Complex, that doesn\u0027t address the basic issue of stranding them in the first place.  Besides, you pay good money to hire those pilots; it would be nice to use some of them more than once, especially after you\u0027ve hired a number of them and hiring new staff becomes stupidly expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout knowing what kinds of missions you\u0027re trying to fly, I can\u0027t say much about your flying skills and how they are contributing to this, but even if you\u0027re a terrible orbital pilot, I will say that the root of your problem here is resource management.  Obviously, you have the basics well-in-hand and can reliably fly a rocket to orbit (otherwise, you wouldn\u0027t have been able to strand \u003Cem\u003Eevery single one\u003C/em\u003E of your pilots in space), which means you probably have a good grasp, or can get a good grasp, on how to get back down again.  What\u0027s happening instead is that you\u0027re not taking enough rocket to orbit to manage efficient in-orbit burns, and you\u0027re not keeping an eye on the fuel gauge, either.  Knowing how much fuel you need to de-orbit and return to Kerbin is critical, and so is cultivating the ability to say, \u0027I need to re-think this,\u0027 scrap the mission, and get home while you still have the fuel to do so (especially if you\u0027ve saved and reloaded, which means \u0027Revert Flight\u0027 won\u0027t work).\n\u003C/p\u003E\n\u003Cp\u003E\nFor this, I say that you should take an empty probe-controlled rocket and fly it manually.  You may need an antenna to keep a link to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E (and thus be able to use nodes) and a bottom-tier probe core with Stability Assist would be nice (so no Stayputnik), but this is perfectly doable.  Good rocket design will give you something that can reliably make orbit with a little nudge right off the pad (of about three to five degrees prograde) and no further control input from you except to touch the throttle.  Designs for these kinds of rockets are all over \u003Ca href=\u0022https://kerbalx.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E but you\u0027ll get more out of it if you try it yourself--also, I don\u0027t know what tech you have unlocked, so there\u0027s no guarantee that someone else\u0027s design is something that you can even use.  Besides, given that you can reliably make orbit, this is a valid next step in developing your skill set.  Go for tall, thin rockets with fins at the bottom and with fuel flow figured so that it drains from the bottom up--you want the mass to concentrate in the tip and the drag to concentrate at the base.  Try one, and if it doesn\u0027t make orbit, revert, redesign, and try again.\n\u003C/p\u003E\n\u003Cp\u003E\nNext, you need to be certain that once in orbit, you can accomplish a rescue, so that means adequate fuel.  First, this means efficiently using what you have, so take out any monopropellant--you won\u0027t need it.  Rescue in this case means rendezvous, not docking, and you can accomplish that with a Terrier and thrust limiters.  Don\u0027t take science parts, and you likely won\u0027t need more than a single OX-Stat solar panel and one small battery for power.  Take out half the ablator from the heat shield to start and be ready to take more--you may not even need a heat shield at all, if you\u0027re careful.  Keep the orbital stage short and you can use the capsule\u0027s reaction wheels; it\u0027ll be slow to turn, but it will turn.  Second, this means avoiding the problem that got you into this mess in the first place, so I\u0027d suggest having an FL-T100 or ROUND-8 tank in your last engine stage, but with the tank locked so that you won\u0027t accidentally use up the fuel until you unlock it.  A low-mass rescue rocket should be able to reenter from any low Kerbin orbit on the contents of a ROUND-8, but the FL-T100 has the benefit of being the same diameter as the Terrier and the Mk. I capsule.  Do that until you are comfortable with the idea of leaving a de-orbiting reserve, and then you can take out that tank--and if you forget and strand that crew, you\u0027ll know how to fix it.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, pick \u003Cem\u003Eone\u003C/em\u003E pilot who is in a good, near-circular orbit close to Kerbin, and rescue that one.  Rendezvous with that pilot\u0027s capsule, set relative velocity to zero (or near-zero; it doesn\u0027t have to be perfect as you won\u0027t be staying for long), and EVA the pilot over to the rescue ship.  De-orbit the rescue ship and now you\u0027ve got a pilot.  Do this a few times.  You may be tempted to put together some kind of massive rescue mission that will save everybody at once, but don\u0027t do it!  You need to practise bringing one pilot home before you can get on to bringing all of them home.  Additionally, if you\u0027ve got your stranded ships on eccentric orbits, do your de-orbit burn at the \u003Cem\u003Eapoapsis\u003C/em\u003E as this will take less fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nBe sure to check your rescue rocket before launch; the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E likes to auto-crew your rockets and that is a problem if you need a free seat.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nP.S.:  This all assumes that you\u0027re stuck in Kerbin orbit.  If you\u0027ve managed to throw your pilots into solar orbit, you may be better off starting with a clean slate.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-25T19:49:11Z\u0022 title=\u002205/25/2017 07:49  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 25, 2017\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ManEatingApe","CreatedById":151354,"CreatedDateTime":"2017-05-26T05:53:16Z","Content":"\n\u003Cp\u003E\nGood news - the situation is not \u003Cem\u003Ethat\u003C/em\u003E bad, and it\u0027ll be fun to rescue each craft.\n\u003C/p\u003E\n\u003Cp\u003E\nTL;DR We can use each pilot\u0027s EVA thrusters to help their situation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo let\u0027s triage, we have 3 ships in a variety of stable, sub-orbital and escape trajectories, each drifting out of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EValentina\u003C/strong\u003E (\u0022Untitled Space Craft\u0022) - currently in Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E but on a escape trajectory of both the Mun and Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we let Valentina escape Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E it will be a real nuisance to go rescue her from Solar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nGo on EVA\n\u003C/li\u003E\n\u003Cli\u003E\nEngage \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and thrust retrograde\n\u003C/li\u003E\n\u003Cli\u003E\nEither capture into Kerbin orbit or Mun orbit.  Kerbin orbit will make future rescue easier but make sure your PE is outside the Mun\u0027s influence - you don\u0027t want to get ejected later.\n\u003C/li\u003E\n\u003Cli\u003E\nWe\u0027ll go rescue Valentina later - she can float happily in her suit until then\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EJedtrey\u003C/strong\u003E (\u0022Untitled Space Craft\u0022) - in a 73km x 176km Kerbin orbit with no fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWait until the ship is at AP\n\u003C/li\u003E\n\u003Cli\u003E\nGo on EVA with Jedtrey\n\u003C/li\u003E\n\u003Cli\u003E\nLet go of the ladder and engage \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cs\u003EHeadbutt\u003C/s\u003E ..erm nudge the pod retrograde until your PE is below 70km (anything \u0026lt; 70km will do but the lower you can manage the faster it will be)\n\u003C/li\u003E\n\u003Cli\u003E\nWarp until you\u0027re in the atmosphere, then point retrograde (the blunt end of your ship first for maximum drag)\n\u003C/li\u003E\n\u003Cli\u003E\nUse 4 x phsyics warp to speed up the process\n\u003C/li\u003E\n\u003Cli\u003E\nEach pass through the atmosphere will gradually lower your AP and PE - eventually you\u0027ll re-enter - this will take many many passes so be patient\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EMacbert\u003C/strong\u003E (Passenger 1) - on a 66 km x 659 km sub-orbital trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm...since we\u0027re sub-orbital our orbit will eventually decay and we\u0027ll re-enter - however your craft looks like its \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is too far forward - it will be stable pointy end first and this could cause problems (exploding).\n\u003C/p\u003E\n\u003Cp\u003E\nIf Passenger1 keeps exploding then go on EVA and nudge into a stable orbit (PE \u0026gt; 70km).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe order I\u0027d suggest is:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nStabilise Valentina\u0027s orbit\n\u003C/li\u003E\n\u003Cli\u003E\nStabilise Macbert\u0027s orbit (or re-enter)\n\u003C/li\u003E\n\u003Cli\u003E\nRescue Jedtrey - he in turn can then go rescue Valentina and Macbert.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-26T07:09:14Z\u0022 title=\u002205/26/2017 07:09  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 26, 2017\u003C/time\u003E by ManEatingApe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-05-26T11:33:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223068209\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495777996\u0022 data-ipsquote-userid=\u0022151354\u0022 data-ipsquote-username=\u0022ManEatingApe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, ManEatingApe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGood news - the situation is not \u003Cem\u003Ethat\u003C/em\u003E bad, and it\u0027ll be fun to rescue each craft.\n\u003C/p\u003E\n\u003Cp\u003E\nTL;DR We can use each pilot\u0027s EVA thrusters to help their situation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo let\u0027s triage, we have 3 ships in a variety of stable, sub-orbital and escape trajectories, each drifting out of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EValentina\u003C/strong\u003E (\u0022Untitled Space Craft\u0022) - currently in Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E but on a escape trajectory of both the Mun and Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we let Valentina escape Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E it will be a real nuisance to go rescue her from Solar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nGo on EVA\n\u003C/li\u003E\n\u003Cli\u003E\nEngage \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and thrust retrograde\n\u003C/li\u003E\n\u003Cli\u003E\nEither capture into Kerbin orbit or Mun orbit.  Kerbin orbit will make future rescue easier but make sure your PE is outside the Mun\u0027s influence - you don\u0027t want to get ejected later.\n\u003C/li\u003E\n\u003Cli\u003E\nWe\u0027ll go rescue Valentina later - she can float happily in her suit until then\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EJedtrey\u003C/strong\u003E (\u0022Untitled Space Craft\u0022) - in a 73km x 176km Kerbin orbit with no fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWait until the ship is at AP\n\u003C/li\u003E\n\u003Cli\u003E\nGo on EVA with Jedtrey\n\u003C/li\u003E\n\u003Cli\u003E\nLet go of the ladder and engage \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cs\u003EHeadbutt\u003C/s\u003E ..erm nudge the pod retrograde until your PE is below 70km (anything \u0026lt; 70km will do but the lower you can manage the faster it will be)\n\u003C/li\u003E\n\u003Cli\u003E\nWarp until you\u0027re in the atmosphere, then point retrograde (the blunt end of your ship first for maximum drag)\n\u003C/li\u003E\n\u003Cli\u003E\nUse 4 x phsyics warp to speed up the process\n\u003C/li\u003E\n\u003Cli\u003E\nEach pass through the atmosphere will gradually lower your AP and PE - eventually you\u0027ll re-enter - this will take many many passes so be patient\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EMacbert\u003C/strong\u003E (Passenger 1) - on a 66 km x 659 km sub-orbital trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm...since we\u0027re sub-orbital our orbit will eventually decay and we\u0027ll re-enter - however your craft looks like its \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is too far forward - it will be stable pointy end first and this could cause problems (exploding).\n\u003C/p\u003E\n\u003Cp\u003E\nIf Passenger1 keeps exploding then go on EVA and nudge into a stable orbit (PE \u0026gt; 70km).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe order I\u0027d suggest is:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nStabilise Valentina\u0027s orbit\n\u003C/li\u003E\n\u003Cli\u003E\nStabilise Macbert\u0027s orbit (or re-enter)\n\u003C/li\u003E\n\u003Cli\u003E\nRescue Jedtrey - he in turn can then go rescue Valentina and Macbert.\n\u003C/li\u003E\n\u003C/ol\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI am at work, but in regards to Macbert, what did I do wrong when building ship?  How would I lower the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223067523\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495741727\u0022 data-ipsquote-userid=\u0022125721\u0022 data-ipsquote-username=\u0022Zhetaan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Zhetaan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\nAll right, I can still help you.  While it\u0027s true that if you wait long enough, more pilots will appear in the Astronaut Complex, that doesn\u0027t address the basic issue of stranding them in the first place.  Besides, you pay good money to hire those pilots; it would be nice to use some of them more than once, especially after you\u0027ve hired a number of them and hiring new staff becomes stupidly expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout knowing what kinds of missions you\u0027re trying to fly, I can\u0027t say much about your flying skills and how they are contributing to this, but even if you\u0027re a terrible orbital pilot, I will say that the root of your problem here is resource management.  Obviously, you have the basics well-in-hand and can reliably fly a rocket to orbit (otherwise, you wouldn\u0027t have been able to strand \u003Cem\u003Eevery single one\u003C/em\u003E of your pilots in space), which means you probably have a good grasp, or can get a good grasp, on how to get back down again.  What\u0027s happening instead is that you\u0027re not taking enough rocket to orbit to manage efficient in-orbit burns, and you\u0027re not keeping an eye on the fuel gauge, either.  Knowing how much fuel you need to de-orbit and return to Kerbin is critical, and so is cultivating the ability to say, \u0027I need to re-think this,\u0027 scrap the mission, and get home while you still have the fuel to do so (especially if you\u0027ve saved and reloaded, which means \u0027Revert Flight\u0027 won\u0027t work).\n\u003C/p\u003E\n\u003Cp\u003E\nFor this, I say that you should take an empty probe-controlled rocket and fly it manually.  You may need an antenna to keep a link to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E (and thus be able to use nodes) and a bottom-tier probe core with Stability Assist would be nice (so no Stayputnik), but this is perfectly doable.  Good rocket design will give you something that can reliably make orbit with a little nudge right off the pad (of about three to five degrees prograde) and no further control input from you except to touch the throttle.  Designs for these kinds of rockets are all over \u003Ca href=\u0022https://kerbalx.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E but you\u0027ll get more out of it if you try it yourself--also, I don\u0027t know what tech you have unlocked, so there\u0027s no guarantee that someone else\u0027s design is something that you can even use.  Besides, given that you can reliably make orbit, this is a valid next step in developing your skill set.  \u003Cu\u003E\u003Cstrong\u003EGo for tall, thin rockets with fins at the bottom and with fuel flow figured so that it drains from the bottom up--you want the mass to concentrate in the tip and the drag to concentrate at the base.  Try one, and if it doesn\u0027t make orbit, revert, redesign, and try again.\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNext, you need to be certain that once in orbit, you can accomplish a rescue, so that means adequate fuel.  First, this means efficiently using what you have, so take out any monopropellant--you won\u0027t need it.  Rescue in this case means rendezvous, not docking, and you can accomplish that with a Terrier and thrust limiters.  Don\u0027t take science parts, and you likely won\u0027t need more than a single OX-Stat solar panel and one small battery for power.  Take out half the ablator from the heat shield to start and be ready to take more--you may not even need a heat shield at all, if you\u0027re careful.  Keep the orbital stage short and you can use the capsule\u0027s reaction wheels; it\u0027ll be slow to turn, but it will turn.  Second, this means avoiding the problem that got you into this mess in the first place, so I\u0027d suggest having an FL-T100 or ROUND-8 tank in your last engine stage, but with the tank locked so that you won\u0027t accidentally use up the fuel until you unlock it.  A low-mass rescue rocket should be able to reenter from any low Kerbin orbit on the contents of a ROUND-8, but the FL-T100 has the benefit of being the same diameter as the Terrier and the Mk. I capsule.  Do that until you are comfortable with the idea of leaving a de-orbiting reserve, and then you can take out that tank--and if you forget and strand that crew, you\u0027ll know how to fix it.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, pick \u003Cem\u003Eone\u003C/em\u003E pilot who is in a good, near-circular orbit close to Kerbin, and rescue that one.  Rendezvous with that pilot\u0027s capsule, set relative velocity to zero (or near-zero; it doesn\u0027t have to be perfect as you won\u0027t be staying for long), and EVA the pilot over to the rescue ship.  De-orbit the rescue ship and now you\u0027ve got a pilot.  Do this a few times.  You may be tempted to put together some kind of massive rescue mission that will save everybody at once, but don\u0027t do it!  You need to practise bringing one pilot home before you can get on to bringing all of them home.  Additionally, if you\u0027ve got your stranded ships on eccentric orbits, do your de-orbit burn at the \u003Cem\u003Eapoapsis\u003C/em\u003E as this will take less fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nBe sure to check your rescue rocket before launch; the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E likes to auto-crew your rockets and that is a problem if you need a free seat.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nP.S.:  This all assumes that you\u0027re stuck in Kerbin orbit.  If you\u0027ve managed to throw your pilots into solar orbit, you may be better off starting with a clean slate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow do you make fuel drain from the bottom up?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n"},{"CreatedByName":"ManEatingApe","CreatedById":151354,"CreatedDateTime":"2017-05-26T12:48:34Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022color:#272a34;\u0022\u003E\n...in regards to Macbert, what did I do wrong when building ship?  How would I lower the\u003Cspan\u003E \u003C/span\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEither stick something heavy on the end you want to point forward (usually a heatshield or engine) or better yet add some fins to the back.\n\u003C/p\u003E\n\u003Cp\u003E\n(You can check \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E when you\u0027re assembling a craft)\n\u003C/p\u003E\n\u003Cp\u003E\nFor something as small as your pod a pair of basic fins should be enough.\n\u003C/p\u003E\n\u003Cp\u003E\nYou want it to resemble a dart - heavy at the front, fins at the back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-26T12:49:07Z\u0022 title=\u002205/26/2017 12:49  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 26, 2017\u003C/time\u003E by ManEatingApe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-05-26T13:06:46Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022177671\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/177671-jonpfl/\u0022 rel=\u0022\u0022\u003E@jonpfl\u003C/a\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\nWithout seeing your craft, I can\u0027t tell you specifically what to move in order to lower the centre of mass, but since it\u0027s already in orbit, you can\u0027t change it anyway.  For that case, I agree with \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151354-maneatingape/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151354\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151354-maneatingape/\u0022 rel=\u0022\u0022\u003E@ManEatingApe\u003C/a\u003E in that \u003C/span\u003Eyour options are either to hope that you have enough \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E control to force your capsule retrograde and ride it down with a death-grip on the stick or else to get it into a stable orbit and rescue everyone with a more reentry-stable craft.\n\u003C/p\u003E\n\u003Cp\u003E\nIn general, for the part that is meant to reenter, you want to have heavier things at the bottom (such as the heat shield) and lighter things at the top (such as reaction wheels if you intend to recover them).  This by itself is reason enough to stage away your empty tanks and recover only the capsule, heat shield, and parachutes--engines are often fairly heavy, but a large, empty fuel tank shifts the centre of mass upward and can cause a lot of problems when you reenter.  Don\u0027t put a lot of electronic equipment on the capsule so that you can save or recover it, either--maybe you can do that with the lighter science experiments, but that\u0027s all.  A capsule with a heat shield and a parachute is stable with the heat shield pointing prograde and needs no electric power to keep that orientation.  If you flew a contract that paid for your rocket, then you can afford to get rid of the extra stuff anyway.  If saving every possible penny on every possible launch is important to you, fly spaceplanes.\n\u003C/p\u003E\n\u003Cp\u003E\nFor fuel flow, you can change the flow priority of the fuel tanks in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.  It may be an advanced feature that you need to activate in the settings--I don\u0027t recall because I\u0027ve always used it.  The idea is that each fuel tank is assigned a number, and fuel will flow from a tank with a higher number before it flows from a tank with a lower number.  There\u0027s a lot of room to make changes:  KSP increments stages by ten so you can make shift things around without much risk of interfering with other stages.  For bottom-draining priority, you\u0027d want to set it up so that the bottom tank has the highest number, then the next tank up is one less, and so forth until you reach the top of the stage.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-05-26T19:55:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223068209\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495777996\u0022 data-ipsquote-userid=\u0022151354\u0022 data-ipsquote-username=\u0022ManEatingApe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, ManEatingApe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe order I\u0027d suggest is:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nStabilise Valentina\u0027s orbit\n\u003C/li\u003E\n\u003Cli\u003E\nStabilise Macbert\u0027s orbit (or re-enter)\n\u003C/li\u003E\n\u003Cli\u003E\nRescue Jedtrey - he in turn can then go rescue Valentina and Macbert.\n\u003C/li\u003E\n\u003C/ol\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile there is a fair amount available, worth keep an eye on the propellant fuel while EVA\u0027ing. If I understood correct Valentina\u0027s ship will be abandoned,  but for the other there is the option to reboard to replenish fuel.\n\u003C/p\u003E\n"},{"CreatedByName":"jonpfl","CreatedById":177671,"CreatedDateTime":"2017-06-03T21:25:55Z","Content":"\n\u003Cp\u003E\nQuick question,\n\u003C/p\u003E\n\u003Cp\u003E\nI thought I read about someone saying having your ship tilted east before takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nIs that possible somehow?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2017-06-03T21:33:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223079431\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496525155\u0022 data-ipsquote-userid=\u0022177671\u0022 data-ipsquote-username=\u0022jonpfl\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, jonpfl said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nQuick question,\n\u003C/p\u003E\n\u003Cp\u003E\nI thought I read about someone saying having your ship tilted east before takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nIs that possible somehow?\n\u003C/p\u003E\n\u003Cp\u003E\nThx\u003Cbr\u003E\njonpfl\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can tilt the entire craft on the launchpad by rotating the root part in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. However, it\u0027s worth noting that tilting the rocket on the launchpad is only something you would want to do if it has little in the way of control authority on the first stage, since tilting the rocket only serves to automatically start the gravity turn without the need for any user input. A well-designed rocket will theoretically fly a gravity turn without any control input, but most players (myself included) fly the turn manually, if possible.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2017-06-04T00:12:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223079440\u0022 data-ipsquote-contentid=\u0022161015\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496525628\u0022 data-ipsquote-userid=\u0022157062\u0022 data-ipsquote-username=\u0022IncongruousGoat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, IncongruousGoat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can tilt the entire craft on the launchpad by rotating the root part in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ll add one thing to this comment: my main reason for using the \u0027pre-tilt\u0027 is repeatability. It is much easier to reproduce a near-perfect trajectory when you minimize the one thing that causes most of the deviations - user input. I would even say that \u003Cstrong\u003Eespecially\u003C/strong\u003E when your craft has a lot of control authority, it can benefit from limiting how much the user decides the final trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nA pre-tilted rocket\u0027s launch profile usually looks like this:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSet \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E stability and throttle to full\n\u003C/li\u003E\n\u003Cli\u003E\nStage to launch\n\u003C/li\u003E\n\u003Cli\u003E\nSwitch \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to follow prograde at the prescribed speed (*)\n\u003C/li\u003E\n\u003Cli\u003E\nStage when needed, but literally let the rocket fly itself for the rest of the way to apoapsis\n\u003C/li\u003E\n\u003Cli\u003E\nAt most, all you need is to create the circularization maneuver node and perform it\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n(*): Finding the prescribed speed to switch \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is practically the only variable in this profile, it can be found pretty easily by doing a few test launches, and you quickly get a \u0027feel\u0027 for it. In my experience, flying the turn manually tends to result in a good bit more deviation due to inevitable pilot error (which I admit could be entirely me, it may be different for others).\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-06-04T03:15:16Z","Content":"\n\u003Cp\u003E\nUm, I don\u0027t think these guys quite answered the main part of the question. You can\u0027t really pre-tilt a rocket that\u0027s just standing on the launchpad. To pre-tilt you have to be using launch clamps. Then you add the tilt in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with the rotation gizmo.\n\u003C/p\u003E\n"}]}