{"TopicId":161283,"ForumId":16,"TopicTitle":"Plane pitching out of control when control input applied","CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2017-05-29T21:52:11Z","PageNum":1,"Articles":[{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2017-05-29T21:52:11Z","Content":"\n\u003Cp\u003E\nI was building a MiG-21 replica, and when I took it out for a test flight, the aircraft was stable. However, when I tried to turn the plane, the moment I hit \u0027S\u0027 the entire craft spun out of control. There\u0027s probably something obvious I\u0027m missing, so please help.\n\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2017-05-30T15:11:48Z","Content":"\n\u003Cp\u003E\nBelieve this \u0022issue\u0022 has more to do with how your MIG-21 replica was built, than with technical issues with the game. Therefore this thread has been moved to GamePlay Questions.\n\u003C/p\u003E\n\u003Cp\u003E\nThe very first possible cause when planes go out of control is inherent instability in the design. In KSP, a good enough rule of thumb about longitudinal and lateral stability (Pitch and Yaw) comes by comparing the positions (visible in the editor) of the plane Center of Mass and the Center of Lift (though, to be correct we should use the Center of Pressure that KSP doesn\u0027t show). Having Center of Lift (best, Center of Pressure) forward of the Center of Mass makes the plane unstable, any amount of Angle of Attack would only increase by itself until no amount of control from elevators can compensate it. Roll stability is generally ensured if the Center of Mass lies lower than the Center of Lift. Please note, stability is quite complex, changes with the relative angle of the airflow, attitude of a plane and its airspeed (some add-ons in KSP do a very good job to compute stability, e.g. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/160231-13-correctcol-stock-aerodynamics-design-aid-continued/#comment-3045954\u0022 rel=\u0022\u0022\u003ECorrectCoL\u003C/a\u003E or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/19321-122-ferram-aerospace-research-v0158-de-laval-52217-better-late-than-never-edition/#comment-262266\u0022 rel=\u0022\u0022\u003E\u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\u003C/a\u003E). Also to note, real fighter crafts (as the MIG-21) are designed so to have very low stability or even be inherently unstable (because that reduces time to perform aerial combat maneuvers), therefore a replica of them in KSP is probably showing as low (or even less) stability.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, examining your replica will certainly show the cause of that behaviour: would you mind uploading the craft file for others to check?\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-05-30T16:36:18Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRather than a craft file, I suggest pictures. Experienced players are usually quick to spot common potential problem and offer solutions. The issue with craft craft file requires the potential helper to be able to download and log in KSP what is often not the case, so, even if you post a craft file, pictures are highly advisable.\n\u003C/p\u003E\n\u003Cp\u003E\nSince its a MIG-21 replica, I suspect that the chosen KSP parts put the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E in quite a different position (aft from that of the real plane) and the result its that, while it may be (barely) stable when pointing at prograde, its just need a few degrees of \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E to jump tail first.\n\u003C/p\u003E\n"}]}