{"TopicId":161514,"ForumId":56,"TopicTitle":"Conversaciones y dudas sobre el Mechjeb2","CreatedByName":"IlCapo","CreatedById":172848,"CreatedDateTime":"2017-06-03T11:29:26Z","PageNum":1,"Articles":[{"CreatedByName":"IlCapo","CreatedById":172848,"CreatedDateTime":"2017-06-03T11:29:26Z","Content":"\n\u003Cp\u003E\nBuenas tardes amijos.\n\u003C/p\u003E\n\u003Cp\u003E\nAl fin he podido utilizar el MechJeb 2... ya descubrí el fallo, habia que incluir la pieza de correspondiente, que se encuentra en la seccion \u0022control\u0022 y no en ciencia como estan los del \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E, (para los que no lo sepan).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDicho lo cual, empiezan los problemas, como no podia ser de otra manera.\n\u003C/p\u003E\n\u003Cp\u003E\nDe forma que, si no hay criterio en contrario del equipo de moderación, dejo este hilo abierto para plantear las dudas y recopilar las respuestas en un solo hilo. (yo tengo ya unas cuantas, y seguro que saldran mas.\n\u003C/p\u003E\n\u003Cp\u003E\nSi no es correcto, pues ya se iran abriendo los hilos que correpondan.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAl lio con la primera.\n\u003C/p\u003E\n\u003Cp\u003E\nEn el ascenso a órbita, siempre asciende a Full gas, por lo que los sobrecalientamientos son majos.... he activado la casiila \u0022prevents overheats\u0022, pero como si oyera llover, al ascender hacia la órbita de Kerbin, lo hace como si no hubiera un mañana, con los riesgos que conlleva el sobrecalentamiento y el derroche de combustble que también supone.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlguna idea de por que?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGracias!\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2017-06-03T19:28:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223078710\u0022 data-ipsquote-contentid=\u0022161514\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496489366\u0022 data-ipsquote-userid=\u0022172848\u0022 data-ipsquote-username=\u0022IlCapo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, IlCapo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEn el ascenso a órbita, siempre asciende a Full gas, por lo que los sobrecalientamientos son majos.... he activado la casiila \u0022prevents overheats\u0022, pero como si oyera llover, al ascender hacia la órbita de Kerbin, lo hace como si no hubiera un mañana, con los riesgos que conlleva el sobrecalentamiento y el derroche de combustble que también supone.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUn par de cosas:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCreo que esa opción ya hace tiempo atrás que dejó de hacer algo en concreto, pero no estoy seguro ya que hace varias versiones que no uso mods.\n\u003C/li\u003E\n\u003Cli\u003E\nLa razón por la que probablemente no hace nada es que casi no se necesita: hay que hacer bastante esfuerzo para que el calentamiento en ascenso realmente cause problemas. ¿De veras llegan piezas a calentarse hasta el punto de explotar, o lo que te preocupa es solamente los efectos visuales? KSP exagera bastante los efectos aerodinámicos: la nave puede llegar a parecer una bola de fuego y sin embargo alcanzar órbita sin daño alguno.\n\u003C/li\u003E\n\u003Cli\u003E\nLo del derroche: un par de versiones atrás, cuando la atmósfera kerbiana era bastante más densa, era mucho más fácil toparse con los límites de calentamiento y de resistencia en el ascenso, y varias de las opciones que todavía tiene \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E reflejan ese pasado. Pero eso cambió: tal y como es hoy en Kerbin \u0027stock\u0027, casi siempre es más económico ascender a toda fuerza, porque lo que más derrocha, por mucho, son las perdidas a la gravedad.\n\u003C/li\u003E\n\u003Cli\u003E\nSi aún así buscas maneras de obligar a \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E de ralentizar el ascenso, creo que la opción que mejor efecto tenía es la que prescribe un límite de presión... ahora mismo no me acuerdo del nombre en inglés. Necesitarás experimentar un poco con los valores.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"IlCapo","CreatedById":172848,"CreatedDateTime":"2017-06-05T08:29:59Z","Content":"\n\u003Cp\u003E\nGracias, lo miro.\n\u003C/p\u003E\n\u003Cp\u003E\nRealmente no ha petado nada, pero es como dices, da la sensación que puede explotar en cualquier momento y por eso me habia preocupado.\n\u003C/p\u003E\n"},{"CreatedByName":"Vlos","CreatedById":76954,"CreatedDateTime":"2017-06-05T12:08:12Z","Content":"\n\u003Cp\u003E\nYo utilizo un mod llamado \u0022mechjeb for all\u0022 que activa mechjeb en todas las partes de control.\n\u003C/p\u003E\n\u003Cp\u003E\nPara lo del sobrecalentamiento y derroches varios, prueba a activar la aceleración máxima a 20\n\u003C/p\u003E\n"}]}