{"TopicId":161698,"ForumId":16,"TopicTitle":"Elliptical Intercepts","CreatedByName":"Minimalist","CreatedById":130775,"CreatedDateTime":"2017-06-06T20:40:29Z","PageNum":1,"Articles":[{"CreatedByName":"Minimalist","CreatedById":130775,"CreatedDateTime":"2017-06-06T20:40:29Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://drive.google.com/file/d/0B9sS0rJyD8Hvamh4eXNNcGQ4TlU/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003ERendezvous\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs (I hope) you can see from the image I can get a rendezvous with a target in a highly elliptical orbit. In this case I\u0027m sending fuel to a captured asteroid that ran out. My intercept is at, or very close to, periapsis.\n\u003C/p\u003E\n\u003Cp\u003E\nMy question is this: Is it easier to make the rendezvous closer to \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E or \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\nBoth craft would be moving more slowly near \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E, but I can\u0027t convince myself this represents an advantage.\n\u003C/p\u003E\n\u003Cp\u003E\nAs an aside, is there somewhere I can see the class of an asteroid after I\u0027ve grabbed it?\n\u003C/p\u003E\n\u003Cp\u003E\n--Min\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-06-06T21:14:09Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI suppose that marginally better at AP where change in direction will be cheaper...if the relative inclination is high enough to matter at all.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-06-06T21:23:57Z","Content":"\n\u003Cp\u003E\nIt shouldn\u0027t matter much where you make your intercept, really. There might be a tiny deltaV difference depending on where the intercept is, but as long as it\u0027s near the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, it should be fine. If your two ellipses were perpendicular to each other, that would be a different matter.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no, once you\u0027ve grabbed a rock it becomes part of your ship. The only ways to see what \u0022class\u0022 it is at that point are to look at the ship\u0027s mass and know what classes refer to what mass ranges -- or to temporarily let go of the rock and see what class it gets assinged to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2017-06-07T18:38:05Z","Content":"\n\u003Cp\u003E\nIt looks like orbits are already pretty closely matched, you might be a bit better off higher up but it\u0027s not going to be a huge deal.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you were still in a not-so-close orbit I\u0027d probably aim nearer to apoapsis, for the sake of an easy burn to match speed and less gravity differential (the closer you are to the planet, the more difference in acceleration, though it\u0027s not a huge problem).\n\u003C/p\u003E\n\u003Cp\u003E\nThe only reason I can see for going near periapsis would be if you\u0027re not well-practiced in rendezvousing and trying to catch something still hyperbolic.\n\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2017-06-08T15:10:45Z","Content":"\n\u003Cp\u003E\nWell... My opinion:\n\u003C/p\u003E\n\u003Cp\u003E\nFor an optimal intercept you should first match orbital planes of your target and your interceptor, this should be done right at launch (into the planet of target), if you use mechjeb there\u0027s an option that will do it automatically for you. So, assuming the planes are now the same you are left with the present case, two co-planar elliptical orbits. Assuming you are starting from a near circular \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E orbit with your interceptor you are interested in NOT getting into an higher energy orbit than your target, because that would be a waste of energy, this means you will match your \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E with the target and then push your \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E as necessary so that you and the target rendezvous at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. You will be trailing the target, as you should. If you are intercepting in any other point than \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E it means that your your \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is higher than target\u0027s (waste if energy) and / or the angle of interception will be not zero (as it will be at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E if \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u0027s match perfectly), meaning there is an additional DeltaV to spend. \n\u003C/p\u003E\n\u003Cp\u003E\nBear in mind that, in the real world, it is very difficult to do this \u0022one shot\u0022 \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E matching interception so what the Shuttle, Cygnus and so on do is to get into a circular slightly lower orbit, trailing the ISS circular orbit and approaching it orbit after orbit, pushing the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E to match circular orbital radius of ISS when close enough (last orbit). But this is not the case you presented here so yes, in your case, match \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u0027s and intercept at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, it is the optimal way, immo.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso bear in mind that there are no perfect circles, and the perfect circle is just a particular case of an ellipse \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen intercepting high velocity asteroids in hyperbolic orbits forget perfection, you may not be able to do it at the sweet spot due to high speed of target versus your interceptor orbital period so, just get as close as you can to a low angle of interception and least possible velocity difference from target (sometimes this means intercepting well off \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-08T15:14:43Z\u0022 title=\u002206/08/2017 03:14  PM\u0022 data-short=\u00227 yr\u0022\u003EJune 8, 2017\u003C/time\u003E by Jaeleth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2017-06-08T15:45:16Z","Content":"\n\u003Cp\u003E\nYou\u0027ll have to match orbits for a rendez vous. Unless there\u0027s a time constraint with doing it at \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E there\u0027s no gain energywise. What you save by not raising your apo for an intercept, you lose by matching higher velocity. Whatever is most convenient.\n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2017-06-08T17:02:40Z","Content":"\n\u003Cp\u003E\nI suggested AP-ish because the rendezvous step will likely be easier up there.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2017-06-08T17:28:00Z","Content":"\n\u003Cp\u003E\nIn the specific scenario from your screenshot, I would rendezvous near periapsis, because the two orbits are already very close there, whereas the apoapses have a significant gap between them. To make these orbits identical, you will need to burn at or near periapsis to raise the apoapsis. You might as well make that burn the close-approach burn as well.\n\u003C/p\u003E\n"},{"CreatedByName":"Draalo","CreatedById":158993,"CreatedDateTime":"2017-06-10T01:57:00Z","Content":"\n\u003Cp\u003E\nYou can rename your vessel in flight from \u0022shipname\u0022 to \u0022shipname Class X carrier\u0022 right after catching an asteroid as a workaround.\n\u003C/p\u003E\n"}]}