{"TopicId":16171,"ForumId":32,"TopicTitle":"Kerbal Space Program For Steam Greenlight?","CreatedByName":"GamerGuy09","CreatedById":37091,"CreatedDateTime":"2012-08-06T01:48:55Z","PageNum":1,"Articles":[{"CreatedByName":"GamerGuy09","CreatedById":37091,"CreatedDateTime":"2012-08-06T01:48:55Z","Content":"\n\u003Cp\u003EI would think the next step for KSP would be to head for steam. With achievements to make sucessful launches. If you do not know what steam greenlight is look here: \u003Ca href=\u0022http://steamcommunity.com/greenlight/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/greenlight/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDo you think KSP should be on steam?\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2012-08-06T02:23:49Z","Content":"\n\u003Cp\u003EIt was suggested a while back, and the response was a fairly mixed one ranging from \u0022meh\u0022 to a vitriolic \u0022no\u0022.\u003C/p\u003E\u003Cp\u003EI don\u0027t know that it is a bad idea, but it doesn\u0027t seem necessary for KSP. The community is growing fast enough that the devs don\u0027t have to go to Steam for extra publicity.\u003C/p\u003E\n"},{"CreatedByName":"Omega500","CreatedById":30778,"CreatedDateTime":"2012-08-06T02:27:10Z","Content":"\n\u003Cp\u003EI wouldnt mind if it was on steam but i also dont mind that its not. I understand it could make the game more popular. \u003C/p\u003E\u003Cp\u003EI feel this game is not really targeted at the main stream (i did find this game through a youtuber robbaz) and i really dont think the casual type of gamer wont have the patience with this game, then in turn they will probably come to forums with this trolling thing that seems to be in fashion. I like how the forums are now with its community and the devs that post on them.\u003C/p\u003E\u003Cp\u003EAlso i remember reading somewhere that they dont want it on steam. i support that and understand\u003C/p\u003E\n"},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-08-06T02:41:07Z","Content":"\n\u003Cp\u003EThe game being on steam itself would be great for things such as distributing updates without their entire web server melting into pool of steaming metal, however it seems steam greenlight would be an unnecessary (if not impossible) thing for the game itself. As it\u0027s already being sold, he money from sales seemingly is more than enough to support the development, given that all the extra staff have been hired. Considering the the entire purpose of greenlight is to get games off the ground, and this game is already off the ground and into orbit, it seems rather unnecessary.\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2012-08-06T02:50:34Z","Content":"\n\u003Cp\u003EI don\u0027t know which I find more vexing and perplexing: the Steam obsessives (\u0022What a great game! I\u0027ve purchased and downloaded it and have it running on my computer and all is well...except it bothers me somehow that it\u0027s not on Steam! If only this game...and Minecraft...and Microsoft Excel...and my web browsers...and the GIMP...and the Control Panel...were all on Steam!\u0022) or the anti-Steam crusaders (\u0022It\u0027s evil DRM! It crashed my cousin\u0027s computer! It\u0027s insecure and unsafe to trust with any of my personal information--as I\u0027ve said many times on Facebook while playing Zynga games. I must save everyone I come into contact with from the evil clutches of Steam!\u0022).\u003C/p\u003E\u003Cp\u003ESteam is immensely successful; and while it has its faults, the good vastly outweighs the bad for most people. So someday, it would make a lot of sense to consider putting KSP on Steam. But not now, because Squad has as big of an alpha userbase as they want and dare to attract; and not exclusively, because forcing your customers to accept only one form of distribution, and to all run a particular DRM/middleware service when some very much don\u0027t want it, rarely makes any sense.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-06T02:53:26Z\u0022 title=\u002208/06/2012 02:53  AM\u0022 data-short=\u002211 yr\u0022\u003EAugust 6, 2012\u003C/time\u003E by KevinTMC\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-08-06T12:08:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinTMC\u0022 data-cite=\u0022KevinTMC\u0022\u003E\u003Cdiv\u003E and not exclusively, because forcing your customers to accept only one form of distribution, and to all run a particular DRM/middleware service when some very much don\u0027t want it, rarely makes any sense.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDistrubuting a game on steam doesn\u0027t mean you cannot sell it elsewhere. Mount\u0026amp;Blade is a perfect and relevant example of this. It was sold directly by the company during its beta development stage in the same way that KSP is, however when it reached its final version it was also released on steam. You can currently buy it from steam, the developers themselves, or gamersgate (and probably other places I do not know about). It is worth mentioning that paradox published the game for them at the end of their development though.\u003C/p\u003E\n"},{"CreatedByName":"nibula","CreatedById":12289,"CreatedDateTime":"2012-08-06T12:09:28Z","Content":"\n\u003Cp\u003ENo money for steam !!!\u003C/p\u003E\n"},{"CreatedByName":"Anomalous_Matter","CreatedById":24939,"CreatedDateTime":"2012-08-06T12:12:20Z","Content":"\n\u003Cp\u003ENo, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, NO.\u003C/p\u003E\u003Cp\u003ETo clarify: NO, NO, NO. Nonononononononononononononononononononononononono!\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-08-06T12:33:47Z","Content":"\n\u003Cp\u003ESince myself and (i assume) others here already own the game, i\u0027m not surprised that most opinions range from \u0022Meh\u0022 to \u0022No\u0022.\u003C/p\u003E\u003Cp\u003EHowever if I were Squad, I would be looking to get the completed game on Steam. It\u0027s a great channel to promote and sell the game through. Assuming of course there is comfort in what that relationship entails.\u003C/p\u003E\n"},{"CreatedByName":"The-Bean","CreatedById":17935,"CreatedDateTime":"2012-08-06T12:35:10Z","Content":"\n\u003Cp\u003EAnyone who says the game shouldn\u0027t be released on Steam, or any other DD platform is being ridiculous -- there is no reason not to unless KSP is as immensely successful as Minecraft (which I hope it is, by the way). \u003C/p\u003E\u003Cp\u003EThough, obviously, it shouldn\u0027t be released this early in development. Valve wouldn\u0027t even allow a game in Alpha or Beta to be released on Steam.\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2012-08-06T12:43:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sneakeypete\u0022 data-cite=\u0022sneakeypete\u0022\u003E\u003Cdiv\u003EDistrubuting a game on steam doesn\u0027t mean you cannot sell it elsewhere. Mount\u0026amp;Blade is a perfect and relevant example of this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELove M\u0026amp;B. Love it. And that would be an excellent example to follow in many ways. (They\u0027ve got a clever and devoted modding community too, for instance...which appearing on Steam didn\u0027t ruin.)\u003C/p\u003E\u003Cp\u003EMy point was that many prominent games force Steam registration and usage, even if you buy it through a different website or even in a box at the store. Squad should obviously resist any inducements to do likewise.\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2012-08-06T12:55:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The-Bean\u0022 data-cite=\u0022The-Bean\u0022\u003E\u003Cdiv\u003EAnyone who says the game shouldn\u0027t be released on Steam, or any other DD platform is being ridiculous...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EObsession is not rational, and Steam has a way of creating obsessives.\u003C/p\u003E\u003Cp\u003EOne set can never be completely happy playing their favorite game unless they launched it using Steam.\u003C/p\u003E\u003Cp\u003EThe other set can never be completely happy playing their favorite game if they know that someone, somewhere, has bought it and launched it using Steam.\u003C/p\u003E\u003Cp\u003ELuckily, the vast majority of PC gamers fall into neither category.\u003C/p\u003E\n"},{"CreatedByName":"MrMadGameplay","CreatedById":20225,"CreatedDateTime":"2012-08-06T13:01:58Z","Content":"\n\u003Cp\u003EIf KSP was on steam it would mean we would have to launch steam every time we want to play which is just a farce in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"The-Bean","CreatedById":17935,"CreatedDateTime":"2012-08-06T13:03:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrMadGameplay\u0022 data-cite=\u0022MrMadGameplay\u0022\u003E\u003Cdiv\u003EIf KSP was on steam it would mean we would have to launch steam every time we want to play which is just a farce in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot if you bought it from the KSP website...\u003C/p\u003E\n"},{"CreatedByName":"MissStabby","CreatedById":31168,"CreatedDateTime":"2012-08-06T13:21:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrMadGameplay\u0022 data-cite=\u0022MrMadGameplay\u0022\u003E\u003Cdiv\u003EIf KSP was on steam it would mean we would have to launch steam every time we want to play which is just a farce in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem here since i have it running anyways 24/7 \u003C/p\u003E\u003Cp\u003EThough i think KSP is still in a phase where you would not want to attract too many steam users.\u003C/p\u003E\u003Cp\u003ECurrently with every version the game changes dramatically, so on the steamforums you just get whiners that complain about their mods not working anymore.\u003C/p\u003E\u003Cp\u003EAlso going on steam will attract a very large crowd, this might be a fine thing when the game is finished and out of beta. \u003C/p\u003E\u003Cp\u003EBut atm many \u0022casual\u0022 gamers could then go out and buy the game on steam without any efford, after that they realise the game is too hard just start flooding the forums with KSP 101 questions.\u003C/p\u003E\u003Cp\u003EThough hard games should not be \u0022excluded\u0022 from steam, take a look at games like ArmA(DayZ) or a more similar game to KSP, \u0022Lunar Flight\u0022. (though lunar flight is mostly about just landing a lander instead of building a rocket)\u003C/p\u003E\u003Cp\u003EI think KSP hould move to steam, \u0022eventually\u0022.\u003C/p\u003E\u003Cp\u003EProbably when the game is out of alpha/beta and when the game will have a mission structure and obvious goals. \u003C/p\u003E\u003Cp\u003ECurrently KSP is just an gigantic sandbox toy, and a damn fun one! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Master","CreatedById":1569,"CreatedDateTime":"2012-08-06T13:26:52Z","Content":"\n\u003Cp\u003EIt should be on steam for no other reason that steam has the LARGEST PC game customer base. It is like having your game on the front shelf of ever game store in the world. The increase in revenue alone justifies all the bad things that come from it. Just make sure that you keep our own non steam version on sale at your store for those steam-haters.\u003C/p\u003E\u003Cp\u003EThe game is not ready for steam yet though. For a steam launch to be successful you pretty much need a full game else the initial release will hurt your future sales on steam.\u003C/p\u003E\n"},{"CreatedByName":"Master","CreatedById":1569,"CreatedDateTime":"2012-08-06T13:28:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrMadGameplay\u0022 data-cite=\u0022MrMadGameplay\u0022\u003E\u003Cdiv\u003EIf KSP was on steam it would mean we would have to launch steam every time we want to play which is just a farce in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is also not true. It just depends on how much of the steamworks package you incorporate. I have plenty of games on my steam account that can be launched without steam running.\u003C/p\u003E\u003Cp\u003EThe only real problem here is the licensing issue for DLC. If you sell DLC you basically have to force the game to only launch with steam running. I dont really see any KSP DLC in the future though.\u003C/p\u003E\n"},{"CreatedByName":"coruun","CreatedById":5415,"CreatedDateTime":"2012-08-06T14:33:53Z","Content":"\n\u003Cp\u003EFrom the economical point of view, KSP has to launch on Steam. Normally, if you write a piece of software, you try to reach an audience as large as possible to get as much money as possible.\u003C/p\u003E\u003Cp\u003EAnd the argument, that you need to launch Steam to play it, is absurd. It was already mentioned, that M\u0026amp;B doesn\u0027t need this. You can add nearly every game which was released in a Humble Indie Bundle, since 80-90% of these games can be activated on Steam but have also a DRM-free installer (criterion for HIB).\u003C/p\u003E\n"},{"CreatedByName":"nibula","CreatedById":12289,"CreatedDateTime":"2012-08-06T14:58:35Z","Content":"\n\u003Cp\u003EHas to launch? i dont think so\u003C/p\u003E\n"},{"CreatedByName":"Monk-E-Boy","CreatedById":12251,"CreatedDateTime":"2012-08-06T15:06:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nibula\u0022 data-cite=\u0022nibula\u0022\u003E\u003Cdiv\u003EHas to launch? i dont think so\u003C/div\u003E\u003C/blockquote\u003EIt doesn\u0027t have to launch on there, but sales would be drastically lower if they didn\u0027t include it as a launch etailer so they\u0027d be silly not to sell it through Steam.\u003Cp\u003EAlso, in my experience, 90% of the anti-Steam crusaders arguments against Steam actually are factually incorrect. They ignore offline mode as if it doesn\u0027t exist, they ignore all the games that don\u0027t require Steam to be running in order to launch, they rely on outdated information (e.g. in 2008 Steam switched from IE to WebKit for their framework and a wide swath of \u0022issues,\u0022 which were caused by IE being infected with malware, vanished), they ignore the massive gain in sales by using the #1 digital download service in the world, etc.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2012-08-06T15:17:17Z","Content":"\n\u003Cp\u003EWhat\u0027s wrong with steam?\u003C/p\u003E\n"},{"CreatedByName":"Subcidal","CreatedById":20751,"CreatedDateTime":"2012-08-06T15:33:39Z","Content":"\n\u003Cp\u003EThere\u0027s no reason for the devs to pay steam royalties to get a fanbase we all know is inevitable. If they do this they should do it when they game is 100% done, and that\u0027s just end of story.\u003C/p\u003E\u003Cp\u003EPutting it on steam now is just asking for a headache, When the game\u0027s done, sure, whatever. Just don\u0027t make it the only way to get the game. Many of us go out of our way to avoid steam just because its a PITA in general, Specially for mod friendly games *ugh the headaches i can feel them already*\u003C/p\u003E\u003Cp\u003EIf you were to ask for my honest opinion : Oh god no, No, And then no.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-06T15:36:25Z\u0022 title=\u002208/06/2012 03:36  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 6, 2012\u003C/time\u003E by Subcidal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-08-06T15:46:07Z","Content":"\n\u003Cp\u003ERemember: Minecraft is doing just fine without Steam.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2012-08-06T16:02:35Z","Content":"\n\u003Cp\u003E\u0022 Many of us go out of our way to avoid steam just because its a PITA in general, Specially for mod friendly games\u0022\u003C/p\u003E\u003Cp\u003EI have never found it to be a pita. :/\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2012-08-06T16:15:25Z","Content":"\n\u003Cp\u003EOh look its this thread again..\u003C/p\u003E\u003Cp\u003EI agree a bit more advertising may help, but I\u0027m not sure if steam is the best place to do it tbh\u003C/p\u003E\n"}]}