{"TopicId":161921,"ForumId":20,"TopicTitle":"Suggestions for some good to have mods","CreatedByName":"Kiwivenge","CreatedById":178757,"CreatedDateTime":"2017-06-11T07:56:51Z","PageNum":1,"Articles":[{"CreatedByName":"Kiwivenge","CreatedById":178757,"CreatedDateTime":"2017-06-11T07:56:51Z","Content":"\n\u003Cp\u003E\nHello, I am quite new to KSP and have not tried any mods yet. I am playing on career mode if that makes any difference.\u003Cbr\u003E\nAre there any mods that are considered essential or just about?\u003Cbr\u003E\nMy PC seems to run the game with ease (so far) so maybe some visual enhancement mods would be good. It might be in the game and I just haven\u0027t figured it out, but some sort of height above ground indicator might be nice. Sometimes having a chute set at 3000 doesnt cut it when the ground is that high ...\n\u003C/p\u003E\n\u003Cp\u003E\nHmm, not sure, really am just a KSP rookie looking for suggestions.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks ahead of time for any info \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2017-06-11T14:16:06Z","Content":"\n\u003Cp\u003E\nWelcome to the forums \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/178757-kiwivenge/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022178757\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/178757-kiwivenge/\u0022 rel=\u0022\u0022\u003E@Kiwivenge\u003C/a\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\nKsp mods add so much to the game, but there are a lot to choose from, and a real risk of installing so many that your game runs slow or crashes because of incompatible mods. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen that happens KSP is not fun. So my advice is to start slow and pick mods that will increase the fun for you rather than just add clutter. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to design better rockets, you will need a delta-v calculator such as Basic DeltaV by dmagic. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to find reliable transfers to other planets get Kerbal Alarm Clock. \n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Jengaleng","CreatedById":171662,"CreatedDateTime":"2017-06-11T22:45:06Z","Content":"\n\u003Cp\u003E\nIt\u0027s hard to give someone new to the game advice on mods because you will know what you need as you play through the stock campaign. My suggestion would be to just install mods that fill what you feel is a need and is holding you back. \n\u003C/p\u003E\n\u003Cp\u003E\nI currently run almost 100 mods and the game is completely overhauled. this causes a few issues such as low frames sometimes and I\u0027ve noticed that my save will corrupt and the game will go into a crash state that you can only recover with a fresh install. \n\u003C/p\u003E\n\u003Cp\u003E\nThe shame of this game is that there are many mods that really elevate this game to the gaming standards of today(visually) and those should be integrated to lessen the burden on the end users pc while making the game look stunning(some visual mods make the game look euphoric). Until they implement these mods you really are picking your poison and are always one mod away from breaking the game and starting all over. \n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2017-06-12T01:28:13Z","Content":"\n\u003Cp\u003E\nI suggest that if you are new to KSP, you should avoid mods until you are familiar with what stock has to offer.  However, if you must, I suggest staying away from part and gameplay mods especially until you have more familiarity with the game.  Visual mods, are good for you as a beginner since they don\u0027t change gameplay.  My recommendation on these include:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nStock Visual Enhancements\n\u003C/li\u003E\n\u003Cli\u003E\nReal Plume\n\u003C/li\u003E\n\u003Cli\u003E\nCollision FX\n\u003C/li\u003E\n\u003Cli\u003E\nDistant Object Enhancement\n\u003C/li\u003E\n\u003Cli\u003E\nPlanetShine\n\u003C/li\u003E\n\u003Cli\u003E\nCoolRockets\n\u003C/li\u003E\n\u003Cli\u003E\nBlast Awesomeness Modifier\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nInformational mods that make life a little easier might be good too though I caution a little more against these until you have earned your wings in stock\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKerbal Engineer\n\u003C/li\u003E\n\u003Cli\u003E\nKerbal Alarm Clock\n\u003C/li\u003E\n\u003Cli\u003E\nTransfer Window Planner\n\u003C/li\u003E\n\u003Cli\u003E\nPrecise Node or PreciseManeuver or DMagic\u0027s Modlet ManeuverNodeEvolved\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid\n\u003C/li\u003E\n\u003Cli\u003E\nFusebox\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAnything beyond that I strongly wouldn\u0027t recommend and in fact wouldn\u0027t even mention them given you said you are new.  There are a lot of good gameplay mods out there but you need to figure out how to get to orbit and land on another body first.\n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2017-06-12T02:42:34Z","Content":"\n\u003Cp\u003E\nA simple little mod I\u0027d add to Alshain\u0027s list would be \u0022Navball Docking Alignment Indicator\u0022 by linuxgurugamer (either that or Kerbal Alarm Clock is the first mod I ever used). It adds a little red circle to the navball when you\u0027ve targeted a docking port. When you\u0027re pointing at that, the docking ports will be perfectly lined up. It makes learning to dock much easier. A tip as far as docking goes is learn to fly the navball. Live the navball. Love the navball. Be one with the navball.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223087689\u0022 data-ipsquote-contentid=\u0022161921\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221497167811\u0022 data-ipsquote-userid=\u0022178757\u0022 data-ipsquote-username=\u0022Kiwivenge\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Kiwivenge said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbut some sort of height above ground indicator might be nice. Sometimes having a chute set at 3000 doesnt cut it when the ground is that high ...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022Landing Height Display\u0022 by Diazo will help with that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-12T02:45:05Z\u0022 title=\u002206/12/2017 02:45  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 12, 2017\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2017-06-12T02:44:53Z","Content":"\n\u003Cp\u003E\nIn addition to the suggestions of keeping it lightweight, and of installing new mods as you feel something is lacking, there are a few mods that offer reasonable expansion to the game without requiring huge amounts of mental investment.\n\u003C/p\u003E\n\u003Cp\u003E\nGranted, I probably wouldn\u0027t install them \u003Cem\u003Eyet\u003C/em\u003E, just when you start to want to do more things with your game. Alshain\u0027s list has the core quality-of-life mods, though Better Burn Time might be added to that list.\n\u003C/p\u003E\n\u003Cp\u003E\nThe science part of stock gameplay has seemed lacking to me for a while: DMagic has a few good mods for that. His Orbital Science mod adds some new science parts, SCANSat helps you map out other planets, and I think he collaborates on Surface Experiment Pack*, which has fairly involved science projects.\n\u003C/p\u003E\n\u003Cp\u003E\n*That\u0027s a bit more heavy-weight than SCANSat or DMagic Orbital Science, as it basically requires Kerbal Inventory System and Kerbal Attachment System.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re much of a programmer, kOS might be nice to get into, especially if you play with CommNet or RemoteTech a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2017-06-12T03:12:25Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/89439-strandedonearth/\u0026amp;do=hovercard\u0022 data-mentionid=\u002289439\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/89439-strandedonearth/\u0022 rel=\u0022\u0022\u003E@StrandedonEarth\u003C/a\u003E I left that one off on purpose.  Alignment indicators fall under that list of things I wouldn\u0027t mention to new players \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  They need to learn why we use them first IMO.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022122674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0022 rel=\u0022\u0022\u003E@Starman4308\u003C/a\u003E BBT is redundant with Kerbal Engineer (and in fact \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E is more accurate).  That\u0027s why I don\u0027t list it, its only good if you don\u0027t have \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-12T03:13:42Z\u0022 title=\u002206/12/2017 03:13  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 12, 2017\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kiwivenge","CreatedById":178757,"CreatedDateTime":"2017-06-12T03:44:18Z","Content":"\n\u003Cp\u003E\nAwesome guys thanks so much for the input!\u003Cbr\u003E\nYou are very correct in that I do not want to change the gameplay outright with mods. However your suggestions that improve the graphics and looks of the game I will definitely look into. The other ones that come with caution I will look at a bit later, however I have heard that Engineer is quite good without making things easy. It seems it simply gives you information to work with.\n\u003C/p\u003E\n\u003Cp\u003E\nOne mod I have seen talked about is a science one that helps you keep track of what science you can still cash in on (ot something like that). Not sure how invasive this is to game play but sure sounds handy.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as my gameplay, absolutely loving it and have no real need to change it yet. Just rescued my first and then second Kerbal in orbit. My ship was wonky, hardly went where I wanted it to in the atmosphere. Once up there I managed to do what needed to be done to come home with another Kerbal \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nLoving the game.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n"}]}