{"TopicId":162269,"ForumId":16,"TopicTitle":"Processing Lab in 1.3 - can\u0026#039;t take data?","CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2017-06-18T16:38:48Z","PageNum":1,"Articles":[{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2017-06-18T16:38:48Z","Content":"\n\u003Cp\u003E\nI was under the impression that you could process an experiment in the lab module for \u0022data\u0022 that can then be researched for science points, but that the experiment itself (thermometer reading, surface sample, eva report, whatever) could then still be taken and returned to Kerbin or transmitted. At least I think that\u0027s how it worked in earlier versions? But that does not seem to be the case. Once an experiment is processed to get data for research, I can no longer remove it from the Lab module.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way to take the experiment for recovery or it it lost forever once processed?\u003Cbr\u003E\u003Cbr\u003E\nIf not, what does this imply game-play-wise - it will take a long time to get the precious science points from the lab for what is apparently a small gain, not worth the hassle?\n\u003C/p\u003E\n"},{"CreatedByName":"overkill13","CreatedById":173506,"CreatedDateTime":"2017-06-18T18:25:16Z","Content":"\n\u003Cp\u003E\nDo each experiment twice.  Or in the case of partial return experiments (Mystery Goo and Science Jr) do them an extra time for the lab.  Store extras in pods or passenger modules or bring a science container along for each repeat.  Scientists are, obviously, helpful for resetting the Goos and Jrs so you don\u0027t have to carry extras science modules.\n\u003C/p\u003E\n\u003Cp\u003E\nFeed one completed experiment of each into the lab and the rest go to Kerbin or get transmitted as is.  You can collect the science for the experiments and the data processing from the lab for each experiment in each biome/situation.  \n\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2017-06-18T18:25:36Z","Content":"\n\u003Cp\u003E\nYou need to get two copies if you want both a lab entry and return science. That\u0027s not new, but I don\u0027t know what version it was implemented in.\n\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2017-06-18T19:11:08Z","Content":"\n\u003Cp\u003E\nWell, shoot. My experiments are now lost in the MPL and I\u0027m not going to go \u0027round and gather everything for a second time, so I guess I\u0027ll just leave Bob in orbit until he gets me teh science points from that data.\u003Cbr\u003E\u003Cbr\u003E\nThis new behavior of the MPL actually seems much more plausible.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-06-18T19:56:30Z","Content":"\n\u003Cp\u003E\nEverything that hasn\u0027t been processed into data yet can be removed from the MPL and returned to Kerbin for immediate credit, just like before, of course.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}