{"TopicId":162380,"ForumId":70,"TopicTitle":"KSP Crashing on Mac","CreatedByName":"jordanlane93","CreatedById":179070,"CreatedDateTime":"2017-06-21T15:38:13Z","PageNum":1,"Articles":[{"CreatedByName":"jordanlane93","CreatedById":179070,"CreatedDateTime":"2017-06-21T15:38:13Z","Content":"\n\u003Cp\u003E\nHey Guys!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve never had a problem with KSP before but now all of the sudden it is crashing. I\u0027ve tried reinstalling and nothing is working. I have the crash report below.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#16a085;\u0022\u003E\u003Cem\u003E[Lengthy log file snipped by moderator]\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-21T15:45:22Z\u0022 title=\u002206/21/2017 03:45  PM\u0022 data-short=\u00227 yr\u0022\u003EJune 21, 2017\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003Cbr\u003EPost included a long log file, embedded in the post itself, instead of linking to an external site\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-06-21T15:52:52Z","Content":"\n\u003Cp\u003E\nHello, and welcome to the forums!  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJust to let you know, I\u0027ve taken the liberty of snipping the log file out of your post.  I know you meant well-- certainly providing log files can be helpful, and often necessary-- but \u003Cem\u003Eplease don\u0027t post long log files \u003Cstrong\u003E\u003Cu\u003Ein the post itself\u003C/u\u003E\u003C/strong\u003E\u003C/em\u003E.  Doing so can cause problems for people, especially if they\u0027re on mobile devices.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead, if you want to share a log with readers, please post it to some \u003Cem\u003E\u003Cu\u003Eexternal\u003C/u\u003E\u003C/em\u003E website (there are lots of them on the internet), and then \u003Cem\u003E\u003Cu\u003Elink\u003C/u\u003E\u003C/em\u003E to it from your post.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, back to the matter at hand.  I have no idea what your actual problem is, but I gather you have a bunch of mods installed?  In that case, an important initial step that you need to do is to figure out whether one of them may be causing the problem.  I recommend this technique:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nTry running with no mods installed.  Does it still crash?  If so, then this isn\u0027t a mod problem, and you can post your question over in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/69-technical-support-pc-unmodded-installs/\u0022 rel=\u0022\u0022\u003Etech support forum for unmodded installs\u003C/a\u003E.  Otherwise, keep reading.\n\u003C/li\u003E\n\u003Cli\u003E\nAssuming that it stops crashing when you uninstall all the mods, it means some mod is causing your problem, and you need to figure out which one.  You do this by a process of elimination.  That\u0027s tedious, yes, but it\u0027s not as tedious as you probably think-- use the technique below.\n\u003C/li\u003E\n\u003Cli\u003E\nInstall just \u003Cem\u003E\u003Cu\u003Ehalf\u003C/u\u003E\u003C/em\u003E of your mods.  (Doesn\u0027t matter which ones.)  Now run.  Do you still have the problem, or not?  This will tell you \u003Cem\u003E\u003Cu\u003Ewhich half\u003C/u\u003E\u003C/em\u003E the culprit lies within.\n\u003C/li\u003E\n\u003Cli\u003E\nSo, toss out the half of your mods that have been proven to be innocent.  Now take the \u003Cem\u003E\u003Cu\u003Eremaining\u003C/u\u003E\u003C/em\u003E mods, and go back to step 3 above, installing just half of them.\n\u003C/li\u003E\n\u003Cli\u003E\nRepeat steps 3 and 4 until you\u0027ve narrowed it down to one mod that\u0027s causing the problem.  Since you cut the list in half each time, it converges pretty quickly-- for example, even if you have 1000 mods installed, you\u0027d need to do 10 iterations at most.\n\u003C/li\u003E\n\u003Cli\u003E\nOnce you\u0027ve identified which mod is causing the problem, go find its mod thread in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/34-add-on-releases/\u0022 rel=\u0022\u0022\u003EAdd-on Releases\u003C/a\u003E, and post your question there.  That\u0027s where all the experts are for that particular mod.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"},{"CreatedByName":"jordanlane93","CreatedById":179070,"CreatedDateTime":"2017-06-22T19:40:27Z","Content":"\n\u003Cp\u003E\nYeah! That seemed to be my problem. Something in my Mechjeb mod was making it crash. It\u0027s working now. Thanks!\n\u003C/p\u003E\n"}]}