{"TopicId":162835,"ForumId":20,"TopicTitle":"Find: Mod Maker","CreatedByName":"Reinhard0049","CreatedById":179442,"CreatedDateTime":"2017-07-03T11:29:50Z","PageNum":1,"Articles":[{"CreatedByName":"Reinhard0049","CreatedById":179442,"CreatedDateTime":"2017-07-03T11:29:50Z","Content":"\n\u003Cp\u003E\nHi guys, are you a Halo fan and look for a little mods in KSP about Halo?\n\u003C/p\u003E\n\u003Cp\u003E\nI am planing to make a Paris Heavy Frigate..\n\u003C/p\u003E\n\u003Cp\u003E\nEmmmm...\n\u003C/p\u003E\n\u003Cp\u003E\nCan anyone help me or we can make it in a group:)\n\u003C/p\u003E\n\u003Cp\u003E\n I have had the 3D model already...\n\u003C/p\u003E\n\u003Cp\u003E\n(Don\u0027t know how to add a picture....)\n\u003C/p\u003E\n"},{"CreatedByName":"SchwinnTropius","CreatedById":165170,"CreatedDateTime":"2017-07-03T13:46:01Z","Content":"\n\u003Cp\u003E\nImgur is a good one. Upload pictures there, and use the direct link in your post here.\n\u003C/p\u003E\n"},{"CreatedByName":"Reinhard0049","CreatedById":179442,"CreatedDateTime":"2017-07-04T08:56:04Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/a/9DT23\u0022 style=\u0022height:454px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nhier are the images~\n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2017-07-04T13:46:04Z","Content":"\n\u003Cp\u003E\nHi although I\u0027m usually a supporter of such things in this case I think it\u0027s a little too much for a first project. It\u0027s much too large and  It has to be sectioned, split up into chunks, otherwise it\u0027ll be just another junky scifi ship mod. \n\u003C/p\u003E\n\u003Cp\u003E\nYou need to split it in order to get proper and decent part collision you also want the game to treat it properly, and most importantly you want to be able to enjoy using it , if it needs a million units of torque in order to be stable , it\u0027s no fun and is indeed junk.  \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you\u0027ve decided on how to split it up, and indeed starting splitting it up, you will need to close all the now open faces and apply a texture that works with the rest of the ship. Unless you\u0027re quite familiar with model making i could see you becoming easily discouraged due to the huge amount of time it will take to accomplish even prepping the model for unity.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso i view that model with some suspicion as i\u0027ve a horrible feeling it\u0027s a sketchup thing, and as such can present numerous problems when it comes to model preparation, such as duplicate faces , tons of unnecessary geometry and a load of other things that are just annoying. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are serious about doing this and are not discouraged by the 80 hours or so it would take to do,   you would be better off simply using that as a pattern and remaking it yourself, despite how it looks it\u0027s just a load of simple geometry piled up in a heap.  So given time even a complete novice could replicate the craft using nothing more than primitive shapes and a bit of blenderFoo , Plus this way you learn how to 3d model and prepare a model and put it in a game and it will be all yours .\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Reinhard0049","CreatedById":179442,"CreatedDateTime":"2017-07-04T18:26:46Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/ziU7gcG\u0022 style=\u0022height:447px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe Texture is not so perfect,,, but it works...\n\u003C/p\u003E\n\u003Cp\u003E\nThen I\u0027ll try to make a better texture.... and IVA, too\n\u003C/p\u003E\n\u003Cp\u003E\nUntil now I\u0027ve seen no crash or bugs\n\u003C/p\u003E\n"}]}