{"TopicId":16309,"ForumId":25,"TopicTitle":"Orbit the sun and return","CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-07T19:21:50Z","PageNum":1,"Articles":[{"CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-07T19:21:50Z","Content":"\n\u003Cp\u003EThe goal of this challenge is to get into an orbit around the Sun, do one complete orbit and return to Kerbin safely. Post a video or screenshots.\u003C/p\u003E\u003Cp\u003EBonus #1: Land on the Mun, then get into orbit around the Sun and return to Kerbin.\u003C/p\u003E\u003Cp\u003EBonus #2: Land on Minmus, get into orbit around the Sun and return to Kerbin.\u003C/p\u003E\u003Cp\u003EBonus #3: Land on the Mun and Minmus, get into orbit around the Sun and return to Kerbin.\u003C/p\u003E\u003Cp\u003ERules: You cannot hack unlimited fuel into parts, but you can use mod parts that do not have unlimited fuel.\u003C/p\u003E\u003Cp\u003E No Mechjeb or any other autopilot/auto orbit tool.\u003C/p\u003E\u003Cp\u003EHappy Flying!\u003C/p\u003E\n"},{"CreatedByName":"Barie","CreatedById":28569,"CreatedDateTime":"2012-08-07T19:41:18Z","Content":"\n\u003Cp\u003Ewhat kind of orbit around the sun? you can orbit the sun while next to kerbin and then return quite easily\u003C/p\u003E\n"},{"CreatedByName":"Shadownailshot","CreatedById":32828,"CreatedDateTime":"2012-08-07T20:31:41Z","Content":"\n\u003Cp\u003EYou should have a bonus for orbiting kerbin, landing on kerbin, leaving kerbin again, orbiting sun, and returning to kerbin. I\u0027m sure someone could do it. I\u0027ve orbited the sun and returned in versions .13, .15 and .16, several times in each version.\u003C/p\u003E\n"},{"CreatedByName":"jamieadd","CreatedById":24794,"CreatedDateTime":"2012-08-07T20:42:05Z","Content":"\n\u003Cp\u003EThis is quite easy really, but could be hard for some newer players.\u003C/p\u003E\n"},{"CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-08T21:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Barie\u0022 data-cite=\u0022Barie\u0022\u003E\u003Cdiv\u003Ewhat kind of orbit around the sun? you can orbit the sun while next to kerbin and then return quite easily\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea I know, that\u0027s why I added some bonus challenges.\u003C/p\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2012-08-09T01:30:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jamieadd\u0022 data-cite=\u0022jamieadd\u0022\u003E\u003Cdiv\u003EThis is quite easy really, but could be hard for some newer players.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I\u0027m not new to the game, but I still can\u0027t return from a Kerbol orbit, because I don\u0027t know when I need to make a TKI burn... Would it be similar to a TMI?\u003C/p\u003E\n"},{"CreatedByName":"jeremymtc","CreatedById":4483,"CreatedDateTime":"2012-08-09T06:44:35Z","Content":"\n\u003Cp\u003EDear Mrs. Kerman,\u003C/p\u003E\u003Cp\u003EWe are happy to report that your son, Sigvey Kerman, has returned safely from his first experimental Kerbol Orbit Mission, and should be safely returned to you within 3-5 business days. Young Sigvey performed his role with admirable stoicism during his largely-unscheduled-1300-day-mission, and expressed a good deal of excitement when told he could return home. Due to his prolonged time in isolation in deep space, he now pretty much expresses a good deal of excitement regardless of stimuli, or the lack thereof. The single-occupant 1m-craft Sigvey piloted functioned well within nominal parameters, we think. We actually forgot to install any sort of scientific or measurement equipment on board, so we can\u0027t really tell for sure. Boy, did we have a big laugh about that when we found out, with poor Sigvey half way to the sun and all. Nevertheless, your son has acquitted himself well and would be up for a promotion, if it weren\u0027t for the incessant screaming.\u003C/p\u003E\u003Cp\u003ECongratulations, and regrets, Mrs. Kerman. You should be very proud of, and very worried about your son.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-08-10T05:06:53Z","Content":"\n\u003Cp\u003EI didn\u0027t do just one orbit of Kerbol and I didn\u0027t stop at any of the bonus waypoints, but I\u0027m going to submit an entry anyway.\u003C/p\u003E\u003Cp\u003E I setup my escape burn such that I\u0027d have an apoapsis equal to Kerbin\u0027s orbital distance and a periapsis of 7.0855 million KM. This results in an orbit that is about 1 hour shorter than 2/3 of a Kerbin year. Three trips around this orbit finds you arriving at apoapsis just slightly ahead of Kerbin after 212 days in space, with Kerbin closing at about 1575 m/s. A few small orbital trim manoeuvres are all that are then needed to re-enter.\u003C/p\u003E\u003Cp\u003EThese are my screenshots:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/AaIkf.jpg\u0022 alt=\u0022AaIkf.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/dQQ54.png\u0022 alt=\u0022dQQ54.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/x8Alu.png\u0022 alt=\u0022x8Alu.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EReturning to Kerbin after 2 years away]\u003C/p\u003E\u003Cp\u003ETotal delta-V expended from initial 103 km high parking orbit through re-entry ~1300 m/s. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7mqCL.png\u0022 alt=\u00227mqCL.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Jumjz.jpg\u0022 alt=\u0022Jumjz.jpg\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Shadownailshot","CreatedById":32828,"CreatedDateTime":"2012-08-10T17:04:34Z","Content":"\n\u003Cp\u003EI should have taken screenies of my recent extra-kerbin trip. I brought my aphelion to 29 million km and then did a retrograde burn until I was in a retrograde orbit of the sun and returned to Kerbin that way, when I captured Kerbin i was moving 15 km/s relative to the planet. (this is called a bi-elliptic transfer isn\u0027t it?)\u003C/p\u003E\n"},{"CreatedByName":"A Fat Pokemon","CreatedById":29245,"CreatedDateTime":"2012-08-10T19:38:56Z","Content":"\n\u003Cp\u003EI\u0027ve already left Kerbin, orbited Kerbol, returned to Kerbin and landed, took off again, orbited Kerbol, and returned to land on Kerbin. Do I win?\u003C/p\u003E\n"}]}