{"TopicId":163281,"ForumId":29,"TopicTitle":"When do asteroids spawn?","CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2017-07-15T17:47:49Z","PageNum":1,"Articles":[{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2017-07-15T17:47:49Z","Content":"\n\u003Cp\u003E\nHi.\n\u003C/p\u003E\n\u003Cp\u003E\nI see from a vessel enumeration run in an almost new career game that there are some asteroids up there already. Are more asteroids spawned as the game progresses? Do they keep spawning? Are they ever removed?\n\u003C/p\u003E\n\u003Cp\u003E\nMy intention is to \u0027identify\u0027 one or more asteroids as \u0027interesting\u0027 for contracts. I guess the contract could spawn the asteroid, but it seems like a cooler solution to pick one of the the already spawned ones, if there is a good one.\n\u003C/p\u003E\n"},{"CreatedByName":"Benjamin Kerman","CreatedById":172792,"CreatedDateTime":"2017-07-15T18:01:17Z","Content":"\n\u003Cp\u003E\nI know that asteroids spawn during the game (as seen when timewarping in the tracking station for long periods of time) and they are removed when they are not tracked after, say, 20 minutes in game time (again, seen in the tracking station). \n\u003C/p\u003E\n\u003Cp\u003E\nTry looking at this \u003Ca href=\u0022https://kerbalspaceprogram.com/api/class_module_asteroid.html#adc2b40cd4264ab57491b7c34bbd5a83d\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalspaceprogram.com/api/class_module_asteroid.html#adc2b40cd4264ab57491b7c34bbd5a83d\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a function called ModuleAsteroid.OnGenComplete that might be interesting for you. \n\u003C/p\u003E\n"},{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2017-10-08T05:31:54Z","Content":"\n\u003Cp\u003E\nI played around a bit more. In case more players are wondering, I tried what happen when you encounter an untracked asteroid. I cheat-moved the untracked asteroid and approached it with a crewed rocket. The asteroid shows up in the flight scene with its proper name under the \u0027F4\u0027 tag, and it loads when you get close (approx. 2 km). When I got back to the tracking center it was now a tracked object named \u0022Unknown Object\u0022. All in all pretty cool.\n\u003C/p\u003E\n"}]}