{"TopicId":16350,"ForumId":32,"TopicTitle":"Weird Infinite Lift Bug","CreatedByName":"Dayyad","CreatedById":32222,"CreatedDateTime":"2012-08-08T09:16:00Z","PageNum":1,"Articles":[{"CreatedByName":"Dayyad","CreatedById":32222,"CreatedDateTime":"2012-08-08T09:16:00Z","Content":"\n\u003Cp\u003EHello world!!!\u003C/p\u003E\u003Cp\u003EI\u0027m new to posting on this forum but i thought id contribute.\u003C/p\u003E\u003Cp\u003EI have owned Ksp for a couple of weeks now and was sorta bored mucking about with space planes\u003C/p\u003E\u003Cp\u003Eit was then that i discovered a weird bug, i\u0027m assuming that this has been seen before but i thought i might as well put it\u003C/p\u003E\u003Cp\u003Eout there. I made this very simple plane with a couple of delta and structural wings attached to a structural fuselage. I would\u003C/p\u003E\u003Cp\u003Elaunch it a couple of Km\u0027s into the air and then would sail it back down like a glider, when i got very close to the ground, say 200-100 Meters i would\u003C/p\u003E\u003Cp\u003Epull back and see how far i could glide, well it turns out i could glide for ever. At a pitch of \u002B10 i would drop in speed untill 35.5 MpS then slowly start speeding up\u003C/p\u003E\u003Cp\u003Eagain while reaching higher altitude. Im guesing this has something to do with having too many wings on a light aircraft and that the lift Vs drag is unbalanced somehow.\u003C/p\u003E\u003Cp\u003EPLease reply if you have seen it before or know whats causing it. \u003C/p\u003E\u003Cp\u003EIm always interested in these weird bugs.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"tjoreilly","CreatedById":23760,"CreatedDateTime":"2012-08-08T13:59:21Z","Content":"\n\u003Cp\u003EWelcome! and, indeed! This is the infini-glide bug, a well-documented, lil\u0027 unintended feature of the current lift system. Now go strap a handful of canards on your cockpit and have fun!\u003C/p\u003E\n"},{"CreatedByName":"Dayyad","CreatedById":32222,"CreatedDateTime":"2012-08-09T04:28:53Z","Content":"\n\u003Cp\u003EEven got a small vid and thanx tjoreilly for response i was wondering that it must have happened to someone before LOL\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/0F1Tgi5tYUk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"nibula","CreatedById":12289,"CreatedDateTime":"2012-08-09T08:21:56Z","Content":"\n\u003Cp\u003EHehe i flew over the kerbin sea with glider \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}