{"TopicId":163624,"ForumId":32,"TopicTitle":"1.0.5 KSP previous version not working on Steam","CreatedByName":"AlienFromTrappist-1","CreatedById":180077,"CreatedDateTime":"2017-07-23T21:41:03Z","PageNum":1,"Articles":[{"CreatedByName":"AlienFromTrappist-1","CreatedById":180077,"CreatedDateTime":"2017-07-23T21:41:03Z","Content":"\n\u003Cp\u003E\nHello, I\u0027m new here but I\u0027ve played KSP for a while. I\u0027m also a huge fan of Star Wars and I am a discussions moderator in the Battlefront Wiki. I just now started getting interested in mods and I have had lots of fun with them my favorite mods are FASA, Half \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E, and US Rockets pack- when I use this one now, the game crashes. NathanKells \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E doesn\u0027t have as many moons and dwarf planets that I wanted, so I downloaded Half \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E also by NathanKell. It has dwarf planets and more moons and I was happy with it for a while. Now I\u0027m kraving more- see what I did there ;). I want to download Real Solar System Expanded by pozine \u003Ca href=\u0022https://mods.curse.com/ksp-mods/kerbal/232931-rss-planets-moons-expanded-0-11-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://mods.curse.com/ksp-mods/kerbal/232931-\u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003Erss\u003C/abbr\u003E-planets-moons-expanded-0-11-0\u003C/a\u003E. It adds even more moons, asteroids, dwarf planets, and planetoids. The problem is that the max version the mod supports is 1.1.2. I download KSP from Steam and they give you the option to play the game in previous versions 1.0.5,1.1.3, and 1.2.2. I had to revert to previous versions before for certain mods and I had no problems. In order to download RSSE I had to revert to 1.0.5, which I haven\u0027t done before. It doesn\u0027t work. when I try to download In \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E it says the version is 1.3, the same is true if I launch the game. So my question, is there a fix so I can revert KSP to 1.0.5 on steam? Is there any other way to revert the game to an earlier version? Has anyone downloaded RSSE before and can give their experience?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCheers!\n\u003C/p\u003E\n\u003Ch3\u003E\n \n\u003C/h3\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-23T21:41:51Z\u0022 title=\u002207/23/2017 09:41  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 23, 2017\u003C/time\u003E by AlienFromTrappist-1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mako","CreatedById":69375,"CreatedDateTime":"2017-07-24T01:22:37Z","Content":"\n\u003Cp\u003E\nI suspect someone else can help you better since I have no experience with KSP on Steam, but I would try completely uninstalling KSP and then downloading version 1.0.5. If you have already tried that, then hopefully someone who has experience with the Steam version can offer a better solution.\n\u003C/p\u003E\n\u003Cp\u003E\nI do know that the directory where Steam installs KSP can be copied, backed up, and used with or without Steam, so you can keep backups of different versions with different mods and play them whenever you want without fear of Steam auto-updating.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck, and welcome to the community.\n\u003C/p\u003E\n"},{"CreatedByName":"AlienFromTrappist-1","CreatedById":180077,"CreatedDateTime":"2017-07-24T14:15:52Z","Content":"\n\u003Cp\u003E\nI have already uninstalled KSP and download 1.0.5 unfortunately that didn\u0027t work. The reason I\u0027m having to download 1.0.5 is that Steam only gives 3 previous versions available to download 1.0.5, 1.1.3, and 1.2.2. The mod is compatible with 1.1.2 so \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E won\u0027t install if I use 1.1.3. Next step for me will be trying to download the mod manually with 1.1.3. Wish me luck! Thanks for the feedback. And if anyone can help please feel free to post! Cheers!\n\u003C/p\u003E\n"}]}