{"TopicId":164220,"ForumId":69,"TopicTitle":"Performance leak from game loads","CreatedByName":"Aru","CreatedById":171422,"CreatedDateTime":"2017-08-09T02:54:57Z","PageNum":1,"Articles":[{"CreatedByName":"Aru","CreatedById":171422,"CreatedDateTime":"2017-08-09T02:54:57Z","Content":"\n\u003Cp\u003E\nGame version: 1.3.0.1804\n\u003C/p\u003E\n\u003Cp\u003E\nSystem: Ryzen 7, 16 GB of DDR4, GPU is RX 470\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a CPU performance leak every time the same game is loaded. Make a quicksave in orbit, and load it. Eventually, frame rate will start getting worse after each load as CPU use goes up and up. Load 20 times in a row (this is what I did to verify the mechanism), and the game runs DRAMATICALLY slower. I\u0027m not certain whether it\u0027s only quickloads, or if repeated normal loads cause this as well.\n\u003C/p\u003E\n\u003Cp\u003E\n Back out to the main menu, load the same game, load the same quicksave, and the leak is reset. Make a new quicksave and load it, load the main save, or return to space center, and it\u0027s still in full force. So, it can really build up over a long play session, as long as you don\u0027t go back to the main menu.\n\u003C/p\u003E\n\u003Cp\u003E\nI first noticed this quite some time ago, but I didn\u0027t report it because I assumed that such a thing would already be known. But I see now that I should have reported it.\n\u003C/p\u003E\n\u003Cp\u003E\nedit: I should add, that this is not really a support request, rather a bug report. The guide called this \u0022The Stock Support \u0026amp; Bugs forum\u0022, but I guess it was renamed. There\u0027s nothing else to suggest that this is a bug report forum, but the quote makes this the closest thing I could find.\n\u003C/p\u003E\n\u003Cp\u003E\nedit: Can anyone else verify this? Is it a known bug?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-11T20:46:18Z\u0022 title=\u002208/11/2017 08:46  PM\u0022 data-short=\u00226 yr\u0022\u003EAugust 11, 2017\u003C/time\u003E by Aru\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aru","CreatedById":171422,"CreatedDateTime":"2018-04-21T21:35:11Z","Content":"\n\u003Cp\u003E\nThe same thing is still happening in 1.4.2. I lose several FPS every time I load or quick load, and I have to periodically go back to the main menu. It\u0027s certainly playable, but annoying when it creeps up on me and I\u0027m playing at 8 FPS (or worse) before I realize why. It seems to subtract a flat amount of FPS each time, such that the first several have no effect except to increase CPU load, then it takes a few to drop noticeably, then a few more drops it extremely low. I would still like to see verification from someone other than me.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-26T21:04:48Z\u0022 title=\u002204/26/2018 09:04  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 26, 2018\u003C/time\u003E by Aru\u003C/strong\u003E\n\u003C/span\u003E\n"}]}