{"TopicId":164561,"ForumId":16,"TopicTitle":"Retrograde Kerbol orbit","CreatedByName":"Tarsirrus","CreatedById":175322,"CreatedDateTime":"2017-08-18T20:01:27Z","PageNum":1,"Articles":[{"CreatedByName":"Tarsirrus","CreatedById":175322,"CreatedDateTime":"2017-08-18T20:01:27Z","Content":"\n\u003Cp\u003E\nSo I accepted a contract to put a satellite in a specific Kerbol orbit and it was only when I looked to see when would be best to launch that I realised it was a retrograde orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat it the best way of getting the required delta-V onto my satellite? The required orbit is from roughly Moho out to roughly Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m thinking lots of boasters, or at least lots of drop tanks, what sort of set up am I looking at to do that best?. Alternatively are planetary slingshots feasible for this type of orbit? and if so who hard are they?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n"},{"CreatedByName":"Grand Ship Builder","CreatedById":144766,"CreatedDateTime":"2017-08-18T21:32:17Z","Content":"\n\u003Cp\u003E\nJust add moar boosters, and if that doesn\u0027t work, moar struts!\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2017-08-18T21:50:55Z","Content":"\n\u003Cp\u003E\nA gravity assist from Jool can reverse your orbit for almost free. Nevertheless, getting the right encounter at Jool and then lowering your orbit to the Dres-Moho target is going to be expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nIon would be the easy way to do this, but if you don\u0027t have it minimise the mass of your probe and go for a nuclear transfer stage.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-08-18T22:50:44Z","Content":"\n\u003Cp\u003E\nBig fuel tank,  small everything else. \n\u003C/p\u003E\n\u003Cp\u003E\nPut something in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and setup maneuvers nodes to get an estimated deltaV requirement and tell us about the other stuff the contract asks for (science gear) . With this we can help designing something. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-08-18T23:16:24Z","Content":"\n\u003Cp\u003E\nFrom \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, you can flip your orbit at Jool for a little over 3,000 Delta V. A brute-force method can\u0027t compare. The only thing better (Delta V-wise), would be multiple gravity assists. Those would add decades to your time, however, and probably wouldn\u0027t be feasible in a career game. I\u0027d use Jool.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-08-19T01:14:15Z","Content":"\n\u003Cp\u003E\nThe flip to a retrograde orbit will cost less delta-v the further are you are from Kerbol, so you might want to aim to do that at the apoapsis of your target orbit, if not even further (you could possibly save even more detla-v by going out even further, like to Eeloo, but that will add considerable time.  As mentioned, you can probably save quite a bit of delta-v by using a gravity assist around Jool.   But that could eat up a huge amount of gametime, if that matters. \n\u003C/p\u003E\n\u003Cp\u003E\nAs far as build, I would go with an Ion top stage.  Ions are great when you\u0027re not in a planet\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, as terrible thrust is much less of an issue.  One ion engine with a central big xenon tanks and couple more xenon drop tanks can get you a long, long way - likely well over 20,000 m/s for the ion stage alone, depending on how much payload you need for the contract..   If you need to do maneuvers around the Moho end, you\u0027ll also get a ton of solar power.  Electricity will be more of a challenge at the far end, but even if you\u0027re packing a decent amount of weight in solar panels, batteries, RTGs and/or fuel cells and fuel, you should still come out ahead of even nukes.  Keep in mind that you don\u0027t even need to generate enough electricity to run the engine at full power -\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is really unimportant in solar orbit, so the limiting factor may be your patience for long burns.\n\u003C/p\u003E\n\u003Cp\u003E\nThe exit burn from Kerbin is not be much fun with ions, but fortunately it\u0027s very easy to put a higher \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E chemical/nuke stage (or two) under a light ion probe for the start of your space stuff, and still keep the whole thing small enough to launch with a reasonable rocket. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2017-08-19T05:07:39Z","Content":"\n\u003Cp\u003E\nI have to agree with Aegolius13, you want to go up to or, more likely, higher than the target apoapsis to make your plane change.  If you use \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E, it shouldn\u0027t really be a problem so long as you\u0027re in contact with the probe.  If you\u0027re NOT in contact with it, you can execute a burn but not plot it, I believe, depending on your commnet settings.  Just do what you can, but that\u0027s likely the neatest way to do it ... a gravity assist is probably going to be too hard to set up for a SPECIFIC target.\n\u003C/p\u003E\n"}]}