{"TopicId":165372,"ForumId":25,"TopicTitle":"Kerbal Express Airlines - Regional Jet Challenge (Reboot)","CreatedByName":"Mjp1050","CreatedById":159323,"CreatedDateTime":"2017-09-10T20:17:10Z","PageNum":35,"Articles":[{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-26T04:17:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223304951\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519613650\u0022 data-ipsquote-userid=\u0022167612\u0022 data-ipsquote-username=\u0022NightshineRecorralis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, NightshineRecorralis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy half fuel? Is there something I don\u0027t get behind the reasoning for this? My way is, as far as I know, the most accurate way without delving into nerd sniping territory.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is an average, of flight, assuming it\u0027s linear with fuel burnining, it averages and the lower performance from higher fuel use cancels out on the better performance as the fuel is burnt.\n\u003C/p\u003E\n\u003Cp\u003E\nOr we can use full fuel load, since that is what was traditional done (thus more fair) and even though it\u0027s less, we can just say that the extra range is fuel for emergencies only.\n\u003C/p\u003E\n"},{"CreatedByName":"Blasty McBlastblast","CreatedById":164020,"CreatedDateTime":"2018-02-26T06:39:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223304913\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519609951\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI downloaded the BS-168, it has some part that is not AP\u002B or Tweakscale. I thik it\u0027s the tail part, size two tail or something. I sympathize, most of my planes accidentally had a KAX part in them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll parts are Airplane Plus or stock, so I\u0027m not sure why your install is struggling to load parts?\n\u003C/p\u003E\n\u003Cp\u003E\nBut perhaps it is a fortuitous event, as actually I would prefer someone (anyone) else to review my craft! Many of your reviews and posts seem overly negative, combative, disparaging of peoples efforts, and biased towards promoting your own entries. Thoroughly un-kerbal in my opinion. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-26T08:54:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223304913\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519609951\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI downloaded the BS-168, it has some part that is not AP\u002B or Tweakscale. I thik it\u0027s the tail part, size two tail or something. I sympathize, most of my planes accidentally had a KAX part in them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have no problems opening that plane,  and I am fairly sure AP\u002B is the only parts mod that I have installed.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-26T11:30:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223305040\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519627185\u0022 data-ipsquote-userid=\u0022164020\u0022 data-ipsquote-username=\u0022Blasty McBlastblast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Blasty McBlastblast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll parts are Airplane Plus or stock, so I\u0027m not sure why your install is struggling to load parts?\n\u003C/p\u003E\n\u003Cp\u003E\nBut perhaps it is a fortuitous event, as actually I would prefer someone (anyone) else to review my craft! Many of your reviews and posts seem overly negative, combative, disparaging of peoples efforts, and biased towards promoting your own entries. Thoroughly un-kerbal in my opinion. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know either, I treid it on two computers, with both tweakscale and AP\u002B, no idea why, even updated AP\u002B.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course my reviews seem to promote my own entries, but that\u0027s not intentional. My entries are designed to do well in a review, I won\u0027t review my own planes for obvious reasons, but when I design them, I consider what I would say if I was a reviewer, and I will freely admit: if I reviewed them, I would heavily criticize a lot of my own planes, because some of them, are bad. Skots Speedmaster, it\u0027s bad. Overpriced, high maintenance, and bad comfort. It does though, fly well, but in a review I still wouldn\u0027t have bought any.\n\u003C/p\u003E\n\u003Cp\u003E\nI do not see my reviews as overly negative, some planes I praise quite a lot, like the WCT island hopper a few pages back, the Kerbus K-350 and K-210. Some planes, yes I am quite negative about them, because I find them to be bad for whatever reasons. When I am reviewing, I get the plane, and I test it. At the beginning, I hope (not always expect however) that it is a good plane. If you think I am review bombing, no. The Zo-168 I just reviewed, was, from the stats advertized, a big threat to my Jumbos, and I reviewed it, expecting such.\n\u003C/p\u003E\n\u003Cp\u003E\n I genuinely didn\u0027t go into that review with the intention of bombing it, I did it to see if it was actually really good, and I did my best to judge it fairly. I did indeed give it credit where credit was due, the passenger comfort was an example, it was noisy due to engines there and low speed, but it had no vibrations, and I said as such. Another example of the plane\u0027s good points was the price, I gave it praise because it was praiseworthy.\n\u003C/p\u003E\n\u003Cp\u003E\nIf some-one wants me to give a plane a good review, here is what I test and how I do a review:\n\u003C/p\u003E\n\u003Cp\u003E\n1. I\u0027ll get the plane, maybe fill in how much fuel and the cost before I take it on a flight.\n\u003C/p\u003E\n\u003Cp\u003E\n2. I will (usually - I might add something about the plane\u0027s construction first) then note the take off speed, and I will then take it up to the recommended cruise altitude, take measuremtns of fuel burn rate, speed, etc. Then I will give it a very hard to turn to see if it falls apart, and how fast it turns.\n\u003C/p\u003E\n\u003Cp\u003E\n3. I will then just manuever for a bit, seeing how it flies, and then I will go and land, to see how quickly can it stop, does it tailstrike on landing, anything else noteworthy.\n\u003C/p\u003E\n\u003Cp\u003E\n4. I will takeoff again, and get a picture, and also ditch into the sea to see if it can do that and survive. (Although this test is a bit moot, every plane I\u0027ve tested so far can)\n\u003C/p\u003E\n\u003Cp\u003E\n5. Go back into the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, note that part count.\n\u003C/p\u003E\n\u003Cp\u003E\nAt some point too, I will not the passenger comfort. Also note: When I consider how noisy it will be, I also consider the speed, a fast plane will move fast enough that noise doesn\u0027t go so far forward before quietening.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want me to give your plane a good review, here is what I will judge it on:\n\u003C/p\u003E\n\u003Cp\u003E\n-Price (Using Mk 3 cabins is not recommended if you want a low price)\n\u003C/p\u003E\n\u003Cp\u003E\n-Range and Performance (Including manueverability)\n\u003C/p\u003E\n\u003Cp\u003E\n-Passenger count and comfort\n\u003C/p\u003E\n\u003Cp\u003E\n-Maintenance\n\u003C/p\u003E\n\u003Cp\u003E\n-Takeoff/landing ability (Based mainly on the distance it needs to takeoff/land)\n\u003C/p\u003E\n\u003Cp\u003E\n-Safety\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027ll include any other stuff, things that I don\u0027t actively test for, but which I will notice. Like tailstrikes, I don\u0027t test for them. There is a lot of ways to make a plane bad, which I can\u0027t even think of. Maybe landing causes a cabin to blow up, or something. (Andetch Seaplane did that)\n\u003C/p\u003E\n\u003Cp\u003E\nIf your plane can take off and land, fly well, is comfortable, I will say it is a good plane. I will buy more if it is cheaper, and/or has a lower maintenance. And not like, if it\u0027s half the price I\u0027ll buy twice as many, if it is even ahead slightly, over a typical plane, I will buy in bulk, (like the K-350) because it is better than the competition.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYour planes are usually a bit above average at most of these things, the jack of all trades, master of none sort of deal, although pitch is usually a bit weak. Please, if you fix the problems I mention in a review, I will buy more. (Again, Kerbus gets a mention, his K-210 was good but for a couple large issues, he fixed them and then I bought a boat load.)\n\u003C/p\u003E\n\u003Cp\u003E\n I do see though, now you mention, that I tend not to mention good things, unless they are really excellent, for very long, so I will try to spend a bit more time on saying what I like in a plane.\n\u003C/p\u003E\n"},{"CreatedByName":"HamnavoePer","CreatedById":160271,"CreatedDateTime":"2018-02-26T16:17:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223304815\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519598538\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, it is being reviewed by panzerknoef. He\u0027s been taking his time, I don\u0027t know why. (There is a \u0022Being reviwed by\u0022 tab on the spreadsheet, his name is next to the Zoomer\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk, thx\n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-26T18:57:29Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review:\u003Cspan\u003E \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/164020-blasty-mcblastblast/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022164020\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/164020-blasty-mcblastblast/\u0022 rel=\u0022\u0022 style=\u0022color:#ffffff;font-size:21.6px;padding:0px 5px;\u0022\u003E@Blasty McBlastblast\u003C/a\u003E\u003C/span\u003E\u003C/strong\u003E\u0027s - BS - 72 medium\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cimg alt=\u0022LOuIzHr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022https://i.imgur.com/LOuIzHr.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFigures as Tested:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EBS - 72 medium:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003EPrice:\u003Cspan\u003E \u003C/span\u003E\u003C/strong\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E60,457,000\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel:\u003C/strong\u003E\u003Cspan\u003E 2,650\u003C/span\u003E Kallons\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising Speed:\u003C/strong\u003E\u003Cspan\u003E 265\u003C/span\u003Em/s\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising Altitude:\u003C/strong\u003E\u003Cspan\u003E 5\u003C/span\u003E,500m\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel Burn Rate:\u003C/strong\u003E\u003Cspan\u003E \u003C/span\u003E0.31 Kallons/sec\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERange:\u003C/strong\u003E\u003Cspan\u003E 2260\u003C/span\u003Ekm\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EReview:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nHaving grown accustomed to the belly on the other BS aircraft, we were not entirely sure we had received the right plane at first. Though on closer inspection it was found that there was indeed a fuel tank bellow the fuselage, maybe this one has spent too much time in the gym. It certainly feels like it on take off. Although the take off speed is a little high at 64m/s both with and without flaps, the take off run is rather short thanks to the 3 powerful engines. Climbing performance is also rather good, and the plane reaches it\u0027s cruising altitude very quickly. Like the BS Turbo planes this one also carries a significant nose up attitude, We think there could be significant increase in fuel efficiency if this was fixed. Now unlike the BS Turbo planes, this one seems to have come from the factory trimmed almost perfectly for cruising, and does not have the autopilot issues that the smaller planes had. The cruising speed of 265m/s is quite good, coupled with a fuel burn rate of 0.31 Kallons/sec and a range of 2260km, this aircraft has a reasonable fuel economy, tough it is not best in class. Maneuverability and handling is very similar to the BS Turbo planes, adequate and comfortable for the passengers.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nWe were a little bit disappointed by the landing performance. The landing speed is high at 60m/s, the landing gear is not as sturdy as the smaller planes form BS, and despite the strong wheel breaks, the plane takes a long distance to stop without the thrust reversers. Water ditching is fine however, and the plane is almost capable of taking of from water as well, reaching more than 65m/s, though we suspect this is not good for the wing mounted engines, as they get rather wet. We were pleasantly surprised that the plane can even fly with any one of the engines alone, and even take of with only the center engine, or with any combination of two engines. Had the landing gear been a little sturdier we would have given this top marks for safety.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nIt\u0027s quite a pleasant ride for the passengers though. The under wing engines don\u0027t get to transmit a lot of noise to the cabins, though running at full throttle the entire time, they are still noticeable. In the back of the plane the center engine ads a little bit to the noise as well, but it is not too bad. The good entertainment system goes a long way to make you forget about the noise though. We also tried out the BL - stair cart with this plane. No propeller in the face this time, though some of the passengers complained that they had to climb to get from the plane onto the stair cart, not desirable for the elderly part of the population.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nNow for the economics, there are some good news and some bad news. The bad news is the purchase price, 60mill. is double that of some of the competitors, on the other hand the part count of only 35 is quite good. With three engines and wet wings there will still be some maintenance to do. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe verdict:\u003C/strong\u003E\u003Cbr\u003E\nThe initial purchase price is a bit steep, but we think the high cruising speed, good comfort and safety will make this plane ideal for high paying transoceanic business routes. We will be ordering 3 of these, with options for 2 more if the the landing gear is improved, as well as improved fuel efficiency.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-26T23:31:48Z","Content":"\n\u003Cp\u003E\nI find the cheapness of the Jumbos an interesting competition! I\u0027ve got one at 33mill, but I\u0027m having problems with it rolling for no reason and very odd pitch behavior.\n\u003C/p\u003E\n"},{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2018-02-27T03:50:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223304991\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519617675\u0022 data-ipsquote-userid=\u0022182407\u0022 data-ipsquote-username=\u0022TheFlyingKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, TheFlyingKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMore ultra efficient jumbo jets\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou sir have perverted the spirit of Kerbal jumbo jets. Not to mention this is an oxymoron.\n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-27T10:21:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223305715\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519687908\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI find the cheapness of the Jumbos an interesting competition! I\u0027ve got one at 33mill, but I\u0027m having problems with it rolling for no reason and very odd pitch behavior.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd I thought I was doing well at 34mill. Well, I did some more optimizations of my design, now I am just bellow 29mill. I\u0027m intersted to hear about your odd pitch behavior.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uQjJEks.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/uQjJEks.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been using the readouts from the Aero debug menu to help optimize the efficiency, that is I\u0027ve been playing with the surface and angle of incidence of the wing to get the \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E as close to 0 as possible at cruising altitude. Somewhere between 2 and 3 degrees angle of incidence seems to be optimal for cruising at 7km altitude and 200m/s. \n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-27T12:04:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306035\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519726873\u0022 data-ipsquote-userid=\u002220296\u0022 data-ipsquote-username=\u0022neistridlar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, neistridlar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd I thought I was doing well at 34mill. Well, I did some more optimizations of my design, now I am just bellow 29mill. I\u0027m intersted to hear about your odd pitch behavior.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/uQjJEks.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022uQjJEks.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/uQjJEks.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been using the readouts from the Aero debug menu to help optimize the efficiency, that is I\u0027ve been playing with the surface and angle of incidence of the wing to get the \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E as close to 0 as possible at cruising altitude. Somewhere between 2 and 3 degrees angle of incidence seems to be optimal for cruising at 7km altitude and 200m/s. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou set a high bar....\n\u003C/p\u003E\n\u003Cp\u003E\nMien also looks more or less like that, except I opted for a shorter doubled decked design, and had two engines, so it could go supersonic. What type of engine are you using?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: quick reminder that regulations mean any aircraft with a passenger capacity greater than or equal to 72 needs two or more pilots. You gotta make sure of that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-27T12:06:01Z\u0022 title=\u002202/27/2018 12:06  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 27, 2018\u003C/time\u003E by CrazyJebGuy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-27T12:14:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306083\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519733089\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou set a high bar....\n\u003C/p\u003E\n\u003Cp\u003E\nMien also looks more or less like that, except I opted for a shorter doubled decked design, and had two engines, so it could go supersonic. What type of engine are you using?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAre you trying to say that my landing gear is to high? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThere is a single lotus underneath the fuselage right between the wings. The lotus engines really does not want to go any much faster than 200m/s. I think they flame out at 240 or something like that. Going super sonic is probably a viable alternative as well, at least if you go up to 20\u002Bkm.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-27T12:17:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306085\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519733640\u0022 data-ipsquote-userid=\u002220296\u0022 data-ipsquote-username=\u0022neistridlar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, neistridlar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre you trying to say that my landing gear is to high? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThere is a single lotus underneath the fuselage right between the wings. The lotus engines really does not want to go any much faster than 200m/s. I think they flame out at 240 or something like that. Going super sonic is probably a viable alternative as well, at least if you go up to 20\u002Bkm.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, I dedn\u0027t say anything about the landing gear, when I said you set a high bar, I meant you had a hard act to follow, I was impressed.\n\u003C/p\u003E\n"},{"CreatedByName":"DunnoAnyThing","CreatedById":180004,"CreatedDateTime":"2018-02-27T15:51:44Z","Content":"\n\u003Cp\u003E\nA simple entry.\n\u003C/p\u003E\n\u003Cp\u003E\nCompany Name: SimpJet-O\n\u003C/p\u003E\n\u003Cp\u003E\nModel Name:SimpleJet SRJ1(small regional jet, actually up to 64 if using 8 kerbals per crew cabin.)(alias: Manta 1-1)\n\u003C/p\u003E\n\u003Cp\u003E\nPrice:43,548,000\n\u003C/p\u003E\n\u003Cp\u003E\ncruise speed\u0026amp;height: \u003Cspan\u003E220~240(throttle to about 35~45%) m/s@4500~5000m\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Ecraft file:\u003C/span\u003E\u003Ca href=\u0022https://kerbalx.com/KreativeKrashKorLinux/Manta-1-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/KreativeKrashKorLinux/Manta-1-1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nhas about 1350 kallons, uses 0.26kallon/s when at right speed\u0026amp;height\u003Cimg alt=\u0022y2ZFsQa.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/y2ZFsQa.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYup. not very optimized, but F.A.N.C.Y.U(FAirly Navigable, Controllable and Yet-Usable)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-27T15:53:37Z\u0022 title=\u002202/27/2018 03:53  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 27, 2018\u003C/time\u003E by DunnoAnyThing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kebab Kerman","CreatedById":156358,"CreatedDateTime":"2018-02-27T17:57:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306035\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519726873\u0022 data-ipsquote-userid=\u002220296\u0022 data-ipsquote-username=\u0022neistridlar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, neistridlar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd I thought I was doing well at 34mill. Well, I did some more optimizations of my design, now I am just bellow 29mill. I\u0027m intersted to hear about your odd pitch behavior.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/uQjJEks.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022uQjJEks.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/uQjJEks.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been using the readouts from the Aero debug menu to help optimize the efficiency, that is I\u0027ve been playing with the surface and angle of incidence of the wing to get the \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E as close to 0 as possible at cruising altitude. Somewhere between 2 and 3 degrees angle of incidence seems to be optimal for cruising at 7km altitude and 200m/s. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy so narrow? I\u0027m not saying it\u0027s bad, buuut... It\u0027s just strange.\n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-27T18:14:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306326\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519754233\u0022 data-ipsquote-userid=\u0022156358\u0022 data-ipsquote-username=\u0022Kebab Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Kebab Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy so narrow? I\u0027m not saying it\u0027s bad, buuut... It\u0027s just strange.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAerodynamics! It is a bit of a pain to have such a long craft, as it is rather bendy (the bracing on top and bottom is absolutely necessary). With just a single thin fuselage the drag from the fuselage becomes much smaller, which means I need less engines and less fuel, which makes the craft lighter, so I need less lift, which also cuts down on the drag, and all this also cuts down on the cost. To put things into perspective, this thing uses less fuel for it\u0027s 4000km range then many medium regional jets use for just half of that range. And yes it\u0027s not exactly pretty, but I\u0027m not optimizing for pretty, so that\u0027s ok.\n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-27T19:57:12Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review:\u003Cspan\u003E \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167612-nightshinerecorralis/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167612\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167612-nightshinerecorralis/\u0022 rel=\u0022\u0022\u003E@NightshineRecorralis\u003C/a\u003E\u003C/span\u003E\u003C/strong\u003E\u0027s - Colossus\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cimg alt=\u00226qfRoAv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022474\u0022 src=\u0022https://i.imgur.com/6qfRoAv.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFigures as Tested:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003EPrice:\u003Cspan\u003E \u003C/span\u003E\u003C/strong\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E667,222,000\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel:\u003C/strong\u003E\u003Cspan\u003E 30,056.5\u003C/span\u003E Kallons\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising Speed:\u003C/strong\u003E\u003Cspan\u003E 233\u003C/span\u003Em/s\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising Altitude:\u003C/strong\u003E\u003Cspan\u003E 5\u003C/span\u003E,000m\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel Burn Rate:\u003C/strong\u003E\u003Cspan\u003E 1\u003C/span\u003E.86 Kallons/sec\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERange:\u003C/strong\u003E\u003Cspan\u003E 3700\u003C/span\u003Ekm\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EReview:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nWhy did they put so many Lotus engines on that thing, couldn\u0027t they just have used the Goliath engines? Oh, wait, those are Goliath engines. This thing is absurdly big. We don\u0027t quite know what it is about these big airplanes, but somehow they remind us of ships. This one feels like a cruise ship. The aircraft leaps into the air almost like a turboprop. Once the plane gets airborne the cruise ship feeling just gets even stronger. It moves almost like it was on rails, with just a slow gentle sway to it. The controls do have just enough authority to fly this great plane, though because of it\u0027s massive size and weight it takes a long time to respond to inputs. We think it will take some getting used to for most pilots, as they will have to plan their maneuvers much longer in advance than they are used to. Other than this though the plane handles quite nicely. The cruise speed of 233m/s is quite good for a jumbo, but the range is a little short of the requirements. I\u0027ts almost enough to circumnavigate Kerbin though, so it is not that big off a deal.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nNow determining the take off speed was a bit of a challenge with this one, as there are so many wheels coming in and out of contact during take off, however the main gear seems to lift off at 55m/s. With a take off and landing speed of 55m/s this plane should be able to service most airports, as long as they can support the weight. The brakes are not very impressive though, thrust reversers are a must. Also the engines are mounted so low to the ground that it is easy to scrape them on the runway on landing if the ground is not level, or you need to make last minute course corrections. The landing gear is quite good though, and we like the tail gear, as we don\u0027t have to worry about tail strikes. We were pleased to find that the airplane can fly and even take off with half of the engines out, as long as there is not more than one Goliath difference between the two sides. This should be quite a safe plane to fly.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nSo how is the passenger comfort? Well the big Goliath\u0027s are mounted far out and beneath the wings, so they don\u0027t bother the passengers much. There is however a pair of engines right outside the windows on the middle deck, and no we never thought we would talk about the middle deck on an airplane,  so there certainly will be some noise here. How is the view then? the forward middle cabins certainly have an excellent view with their slightly forward facing windows. The view from the rear middle and upper deck is also quite nice. The rest of the airplane though, there is practically no view at all. Now for the lower deck, it\u0027s cramped, really cramped. It seems someone thought that the space where your legs normally go was a perfectly fine place to fit additional seat rows. We are not entirely sure how people are supposed to get to their seats down there, as it\u0027s practically just a massive block of seats. We\u0027l, have to consult with \u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EHabu Industries and see if they have a solution for this.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nIs it worth the money though? It cost twice as much as most of the competition! Well the considering that it has a capacity of 1152, about 6 times that of most of the competition this is actually quite reasonable per seat, the same goes for fuel economy and maintenance. It\u0027s a lot of bucks, but it is also a lot of bang. We will probably be able to charge a fair bit for the front cabins and the top deck, but the bottom deck will need to be reserved for ultra economy tickets.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe verdict:\u003C/strong\u003E\u003Cbr\u003E\nThis aircraft truly lives up to its name. We really want to buy one off these, just so we can say mine is bigger than yours. And that is what we will do. Now we just have to spend the money we will hopefully save from consolidating all of our routes, into convincing everybody that they need to travel to the same place at the same time.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-27T23:12:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306403\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519761432\u0022 data-ipsquote-userid=\u002220296\u0022 data-ipsquote-username=\u0022neistridlar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, neistridlar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-snip-\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNow I really hope someone reviews my Sky Titanic, it would be very appropriate now, since the Colossus\u0027s only competition is the Sky Titanic.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-28T01:28:30Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/126740-gaarst/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022126740\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/126740-gaarst/\u0022 rel=\u0022\u0022\u003E@Gaarst\u003C/a\u003E\u0027s Kerbalespace C-1K\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cimg alt=\u0022145pOGk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://imgur.com/145pOGk.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFigures as Tested:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\nPrice:\u003Cspan\u003E \u003C/span\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E209,057,000 dry\n\u003C/li\u003E\n\u003Cli\u003E\nFuel: 3920 kallons\n\u003C/li\u003E\n\u003Cli\u003E\nCruising speed: 221 m/s\n\u003C/li\u003E\n\u003Cli\u003E\nCruising altitude: 5300 m\n\u003C/li\u003E\n\u003Cli\u003E\nFuel burn rate: 0.41 kal/s\n\u003C/li\u003E\n\u003Cli\u003E\nRange: 2100 km\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EReview Notes:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n This is indeed, a fairly stndard liner, as said in the brochure. But not be our standards, we get some very odd things. It takes off at 70m/s, slightly on the high side but still very usable. It does accelerate and climb a bit slowly, we think the 4 wheesley engines struggle a bit, but they get the job done.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n We must be missing somethin though, because we couldn\u0027t get the plane to go quite the 240m/s claimed, just 221, which is a respectable speed for such an aeroplane, although slightly under requirement. What is at requirement is the range, a solid 2,100 km, although it has plenty of free space for more fuel, so we think that we could increase this. The free space for fuel is due to the fact that all fuel is stored in some Mk2 hulls strapped to the main hull, and embedded a bit. They house all the fuel, and the wings connect to them. We are curious why they added these instead of filling empty fuel carrying tanks, but we are sure there is a reason.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n What is above the requirement by far, is the comfort. Low slung engines with a few things to pass through before getting their vibrations to the fuselage, mean almost no vibrations or noise, the cabins are fancy and well decked out and the views are very good.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nIt manuevers, very slowly. The pitch axis is very weak, but roll and yaw are pretty good. The plane can only pull about 1.5g, so it\u0027s comfortable for the passengers. On landing, it bounces. But the passengers need to learn to not ignore the seat belt sign anyway.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nWith 82 parts, maintenance is on the high end, and so is the price, nearly 3 million per passenger.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe Verdict:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n It\u0027s a very nice plane, but with a very high price. It\u0027s too expensive to do anything other than very luxurious first class flights, which fortunately, it is very good at. We expect them to last a while, so the high initial cost is not as important, we think we\u0027ll get a good fifty years. Ordering nine for general purpose luxury flights, and marketing.\n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2018-02-28T09:20:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306549\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519773174\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow I really hope someone reviews my Sky Titanic, it would be very appropriate now, since the Colossus\u0027s only competition is the Sky Titanic.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooks like you have some KAXmed fuselage in that plane, I am not able to open it.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-28T09:25:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306801\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519809630\u0022 data-ipsquote-userid=\u002220296\u0022 data-ipsquote-username=\u0022neistridlar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, neistridlar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooks like you have some KAXmed fuselage in that plane, I am not able to open it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWill fix ASAP.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-28T09:40:35Z","Content":"\n\u003Cp\u003E\nHave fixed download link.\n\u003C/p\u003E\n"},{"CreatedByName":"Kebab Kerman","CreatedById":156358,"CreatedDateTime":"2018-02-28T13:03:29Z","Content":"\n\u003Cp\u003E\nAre we allowed to use FireSpitter parts? I want to use the bomber wings to build a passenger aircraft that some old pilots will find nostalgic.\n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-28T13:06:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306867\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519823009\u0022 data-ipsquote-userid=\u0022156358\u0022 data-ipsquote-username=\u0022Kebab Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Kebab Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre we allowed to use FireSpitter parts? I want to use the bomber wings to build a passenger aircraft that some old pilots will find nostalgic.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSadly no, only allowed mods are Airplane Plus, and Tweakscale. Personally, I would allow KAX, as the parts aren\u0027t \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, and have more of a stock theme, Firespitter feels too \u0022moddy\u0022, and so I uninstall it.\n\u003C/p\u003E\n"},{"CreatedByName":"Kebab Kerman","CreatedById":156358,"CreatedDateTime":"2018-02-28T13:10:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306871\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519823203\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSadly no, only allowed mods are Airplane Plus, and Tweakscale. Personally, I would allow KAX, as the parts aren\u0027t \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, and have more of a stock theme, Firespitter feels too \u0022moddy\u0022, and so I uninstall it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh. Darn, because it\u0027s nostalgic for older players. I know I loved and still love it. I think Lack\u0027s Stock Expansion and/or some Mk.3 Expansion packs would be nice otherwise, as they add some airliner cockpits and some larger wing parts. Helpful for planes that just don\u0027t have large enough wings.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2018-02-28T13:42:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223306872\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221519823417\u0022 data-ipsquote-userid=\u0022156358\u0022 data-ipsquote-username=\u0022Kebab Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Kebab Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh. Darn, because it\u0027s nostalgic for older players. I know I loved and still love it. I think Lack\u0027s Stock Expansion and/or some Mk.3 Expansion packs would be nice otherwise, as they add some airliner cockpits and some larger wing parts. Helpful for planes that just don\u0027t have large enough wings.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I liked the old parts two. I miss the old swept wings, new ones are crappy. Had a very nice biplane design that got broke when they changed it.\n\u003C/p\u003E\n"}]}