{"TopicId":165372,"ForumId":25,"TopicTitle":"Kerbal Express Airlines - Regional Jet Challenge (Reboot)","CreatedByName":"Mjp1050","CreatedById":159323,"CreatedDateTime":"2017-09-10T20:17:10Z","PageNum":13,"Articles":[{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2017-11-18T07:46:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222107\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510986399\u0022 data-ipsquote-userid=\u002290599\u0022 data-ipsquote-username=\u0022panzerknoef\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, panzerknoef said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTalking about those death traps again though... I just happen to be testing another craft again which is one yet again, loses a wing upon slight banking at cruise speed \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI tried out one of the ones reviewed here, it had 4 contraprop engines, the death trap accusation was extremely accurate. I tried turning at 200m/s, the left wing falls into the sea. I then fly again, and set the leftmost engine to reverse thrust. It\u0027s hilarious! It spins sideways and then both wings break apart mid air! Then thing proceeds to cart-wheel into the sea, where some of it survived, the only engine that survived was the one i set in reverse. (Guess it hated the other 3)\n\u003C/p\u003E\n\u003Cp\u003E\nIn contrast I made my supersonic plane so tough I could turn it as hard as possible (about 70 degrees off prograde) at 1200m/s and it is just fine. Since air resistance is velocity cubed, my plane was at least 220 times stronger! And that\u0027s before accounting for the fact that the \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E on my wings were 70 degrees, on his it was maybe 10? I am not impressed with his design at all.\n\u003C/p\u003E\n\u003Cp\u003E\nEven worse: Could have been fixed with 20 struts. I put some struts on, it\u0027s quite solid now.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-18T08:01:00Z\u0022 title=\u002211/18/2017 08:01  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 18, 2017\u003C/time\u003E by CrazyJebGuy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"no_intelligence","CreatedById":180080,"CreatedDateTime":"2017-11-18T10:12:36Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003ETest Pilot Review: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152027\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0022 rel=\u0022\u0022\u003E@AeroGav\u003C/a\u003E\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u0027s Screechcraft Corporation \u0022Fulmar\u0022 Turboprop\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223u2q473s.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022432\u0022 src=\u0022http://fs5.directupload.net/images/171118/3u2q473s.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EFigures as Tested:\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nPrice: \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E18,401,000\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EFuel: 8000 kal\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nCruising Speed: 150 m/s\n\u003C/li\u003E\n\u003Cli\u003E\nAltitude: 9000 m\n\u003C/li\u003E\n\u003Cli\u003E\nFuel Burn Rate: 0,04 kal/s\n\u003C/li\u003E\n\u003Cli\u003E\nRange: 3000 km\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EReview Notes:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOur test pilots saw this aircraft and did not know, what they could expect from it, so just took a seat at the controls and throttled up, not knowing what was awaiting them. Take off was very easy and fast, we managed to get the Fulmar airbourne at just 35 m/s. Once airbourne, the first thing noticeable are the extremely sensitive controls, especially the pitch. Combined with the large wing area it resulted at first very often in a steep ascent right after take off, but with more training we managed to tame the beast. the Fulmar climbs rather fast the first few thousand metres, but to reach its recommended altitude it takes time, a lot of time. Finally reached it cruises very efficient at just 0,04 kal/s but a merely 150 m/s, which, of course, is fast enough, but not outstanding.\n\u003C/p\u003E\n\u003Cp\u003E\nAt first we thought, the sensitive controls would only be a problem shortly after take off, but oh boy were we wrong. It turns out, that no matter how gently we were, a direction change at above about 2500m and 100 m/s nearly constantly results in an uncontrollable flat or sometimes steep spin, which luckily the Fulmar recovers itself after a few moments, but with a massive altitude and velocity loss. So flying a turn in cruise flight requires loads of training and luck. This requires a lot of training and combined with long climbing time somehow disqualifies it for short routes.\n\u003C/p\u003E\n\u003Cp\u003E\nApart from that we quite did not understand some design choices made by Screechcraft, such like the engine not alligned with the fuselage. It only makes the plane look a bit more curious and as it is still mounted directly to the cabin, does nothing to reduce the rambling noise and vibration inside. Also something described as \u0022safety-feature\u0022 turned out as a danger source. The deployable fuel tanks are described to only be deployed if the engine fails, to assure a better gliding performance. We can confirm that there is such an improvement, but that comes at high risks. Once jettisoned, it is impossible to restart the engine, as it is lacking fuel. And as KEA got loads of inexperienced pilots, who are desperate at finding out what red buttons do, it happened a lot that the fuel tanks were dropped for no reason at any phase of the flight.\n\u003C/p\u003E\n\u003Cp\u003E\nBut enough about the problems. The Fulmar is apart from that a nice craft, it handles well at low speeds, we managed to approach at just 50 and land at 35 m/s without any problems. Also it does a great performance at emergency water landings too and seems to have very sturdy construction, as we never managed to tear things apart. Most impressive tho was the range. We calculated about 3000 km, which is not only more than advertised, but loads more than required. Also the high wing design and high cruising altitude assures every of the 32 passengers a great view around Kerbin and makes flying above the highest mountains possible aswell.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gabq8uc2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022432\u0022 src=\u0022http://fs5.directupload.net/images/171118/gabq8uc2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe Verdict:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe had long debates and a hard time evaluating the test results of the Fulmar. After all, we can say it is reasonably priced, not especially cheap or expensive, is good to handle at low speeds and altitudes and also easy to maintain as it just got one engine. However, the encountered problems cannot be unregarded.\n\u003C/p\u003E\n\u003Cp\u003E\nThis leads us to being even more confused about this plane. We like its efficiency, range and easy maintenance, but the handling at cruising speed and altitude, ejective fuel tanks and noise and vibration we do not really appreciate. Finally our staff came out ordering 2 Fulmar for low frequented long range routes, for which it is not needed to fly turns and hope that the passengers will mostly be deaf after the first flight, so they board the Fulmar again.\n\u003C/p\u003E\n\u003Cp\u003E\nIf our criticism is heard at Screechcraft and they come up with an improved version, we already place up to 10 options. Otherwise we will stick with our 2 orders.\n\u003C/p\u003E\n\u003Cp\u003E\n(We also reduced the problem of un-intended fuel tank drops: A green button instead of a red one! So only colour blind Kerbals tend to press it...)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-18T10:18:04Z\u0022 title=\u002211/18/2017 10:18  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 18, 2017\u003C/time\u003E by no_intelligence\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-11-18T13:10:25Z","Content":"\n\u003Cp\u003E\nIn view of the spate of high profile jumbo jet accidents,   Screechcraft corporation has submitted a number of prototypes to Kerbal International Airlines (\u003Cabbr title=\u0022Killed in action\u0022\u003EKIA\u003C/abbr\u003E),  to help make up lost equipment.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Dumbo\u0022  liner  gets its name from its large \u0022ears\u0022, after the cartoon elephant.    .\n\u003C/p\u003E\n\u003Cp\u003E\nThe Deluxe model, features four Mk3 cabins and  an observation cupola on the tail, for well heeled passengers who don\u0027t mind a bit of engine noise and don\u0027t get travel sick from facing backwards. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/AeroGav/Screechcraft-Dumbo-Deluxe\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/AeroGav/Screechcraft-Dumbo-Deluxe\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a6zmc8s.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/a6zmc8s.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0026gt;\u0026gt;Don\u0027t panic, it\u0027s only a prototype \n\u003C/p\u003E\n\u003Cp\u003E\nSelecting the brakes toes the tail fins inwards, creating drag and also pitching the nose up, allowing slower landing speeds. Beware, this also puts engines into reverse.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022S3G5h1m.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/S3G5h1m.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/AeroGav/GRANDE-DUMBO\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/AeroGav/GRANDE-DUMBO\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf size is everything,  the Grande Dumbo variant features 7 cabins for a whopping 168 passengers.  A triple wheesley mount takes the place of the cupola, and the wing has been enlarged again.    Preliminary testing indicates a cruise altitude of 6-7km at 220 m/s yielding a fuel burn of 0.33 Kallons / sec.  With a total capacity of 5620 kallons, a flight endurance of at least four and a half hours can be expected.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ThxCZQa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/ThxCZQa.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPossible areas for further development, subject to funding (Valentina blew most of it on the sub orbital version of the Screechcraft Starship) \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nangled up wings (incidence).   Should improve fuel burn and reduce landing /takeoff speed slightly, and enable the airplane to fly on prograde lock).  The downside is that the aircraft will keep trying to pitch up when going fast at low levels.   Possibly, trim flaps deployed via action group to depress the nose, could allow us to enjoy the best of both worlds.\n\u003C/li\u003E\n\u003Cli\u003E\nimproved control authority.  Neither of these large aircraft are as nimble as the Starship series.   If rapid roll rates are a requiement, substantial work may be needed.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2017-11-18T13:50:15Z","Content":"\n\u003Cp\u003E\nAlso in light of recent failures, the GP-1a (General Purpose Mk 1a)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MuluAyq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022461\u0022 src=\u0022https://imgur.com/MuluAyq.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt has some easily accessible cargo space up front for all your cargoing needs! You could put mail in it. Or extreme economy seating. Your choice, but it\u0027s not your choice that there is about 3280 ft\u003Csup\u003E3\u003C/sup\u003E of space. That is enough for slightly over 9,000 toasters. Should you need to move a lot of toasters very quickly at short notice, this is the plane for you.\n\u003C/p\u003E\n\u003Cp\u003E\nThe wings are certified to not randomly combust, explode or detach in flight. It can also taxi, just don\u0027t accidentally launch yourself into the sky.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the safety aspect we think we should say that we crashed an early version right smack into the ground at 300mph. Not on purpose, (plane didn\u0027t roll fast enough, but we\u0027ve fixed that issue) but lots of it somehow survived. (If pilots are expensive, tell them to go fly one of these!) The cargo area was fine, toasters can be expensive! Another thing that was fine was 64 of the 152 passengers.\n\u003C/p\u003E\n\u003Cp\u003E\nIt can fly on 50% throttle at 155m/s at 2000m (range = 3000 km), or 100% throttle at 1000 which gets it going 260m/s (range = 2250km). Or you can afterburn, and probably exceed Mach 1. (We have not tested - there isn\u0027t a good reason for it)\n\u003C/p\u003E\n\u003Cp\u003E\nIt seats 152, it costs $107,424,000 (dry) and\n\u003C/p\u003E\n\u003Cp\u003E\nP.S. To the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, would KAX be ok? I really like it\u0027s 2.5m to 1.25m tail boom adapter. (I accidentally included it in several of my designs)\n\u003C/p\u003E\n\u003Cp\u003E\nDownload: \u003Ca href=\u0022https://kerbalx.com/BristolBrick/GP-1a\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/BristolBrick/GP-1a\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-20T07:02:09Z\u0022 title=\u002212/20/2017 07:02  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 20, 2017\u003C/time\u003E by CrazyJebGuy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NightshineRecorralis","CreatedById":167612,"CreatedDateTime":"2017-11-18T15:53:17Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/128571-crazyjebguy/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022128571\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/128571-crazyjebguy/\u0022 rel=\u0022\u0022\u003E@CrazyJebGuy\u003C/a\u003E\u0027s GAI Turbo-XL Classic\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022dkpze92.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/dkpze92.jpg\u0022 width=\u00221024\u0022\u003EFigures as Tested:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003EPrice:\u003Cspan\u003E \u003C/span\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E21,484,000\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel: 1300 \u003C/strong\u003E\u003Cstrong\u003Ekallons\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising speed: 216 m/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising altitude: 3000 m\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel burn rate: 0.14 \u003C/strong\u003E\u003Cstrong\u003Ekal\u003C/strong\u003E\u003Cstrong\u003E/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERange:  1930 km\u003C/strong\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EReview Notes:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EErr... what can we say... The GAI Turbo-XL Classic is a wild card of sorts. We aren\u0027t sure what the designers were thinking when they were designing this plane, but it is clear that, despite whatever the heck they were on, it worked. There are many odd choices in this plane, such as the mixture of piston and turbofan engines, the over-wing engines, and the short but broad wing. We suspect that this craft has its roots in an old long-range light bomber, with its bomb bay swapped out for passenger cabins and two newer engines bolted on. That isn\u0027t to say that the Classic isn\u0027t a good performer, even though it may look odd, it performs quite well.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe taildragger design is reminiscent of a time long gone, but the Classic lives up to its heritage. However, the long distance between the main and the tail gear coupled with how low the fuselage is to the ground mean that it is all too easy to damage or destroy the plane on rough, bumpy, or hilly terrain. The relatively short wings also limit how powerful the roll authority can be. Overall, the Classic handles like a bomber, with slow, wide turns, and below average rudder control. We were a little surprised to see the ailerons respond to pitch control, maybe this is a wiring issue, but we think it\u0027s just a design oversight. The triple engine design is quoted to add safety, but it does so at the expense of passenger comfort. The vibrations from the radial engine will travel through the whole body of the plane, and the side mounted engines happen to exhaust straight towards the windows on the passenger cabins, causing a distressingly loud noise to be audible anywhere and everywhere in the cabin (Mainly because all engines are practically at full throttle). Even though the Classic has plenty of power, it takes quite a bit of runway and speed to get airborne, and just as much to slow down. We think this is due to the weak brakes and high mass of the craft.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EIn the air, the Classic surprised us with better than expected fuel economy, able to fly over 500km more than advertised. The airframe is also quite robust, able to ditch perfectly fine in the event of an in-flight failure (which we suspect will be often with the piston engine shaking the craft around so much). With the long range, we\u0027d like to use this plane on long thin routes, thanks to the impressive fuel economy and speed of doing so. Landing this plane is quite a treat despite the long runway it will require, mainly due to how smooth the ride is. The relatively high cruising speed of this plane made short work (see what I did there?) of any route we threw at it, which was very pleasing. The fact that this plane can rival some regional jets practically sold us due to the much lower cost.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EWith 41 parts, the Classic resides on the higher end in terms of maintenance. Piston engines are notorious for their unreliability, and we doubt that the turbofans will offset that. The large size of this aircraft means that we will need to dedicate more hangar and tarmac space for them when in storage, and with this space at a premium, we aren\u0027t sure if the higher cost can be justified by the Classic\u0027s performance.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe Verdict:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EWe think this plane will slip in nicely between regional turboprops and regional jets and will perform the best at economy long thin routes. We\u0027re sure that our passengers are willing to give up some comfort and speed for a cheaper fare, and this plane will serve nicely. Due to the longer runways needed to serve this craft, we can only operate them out of a smaller number of airports, and most rural airfields are out of the question due to the size of the plane and unkemptness of the airfield. Purchasing 2 for long thin routes as support for our jets, with options for up to 5 more.\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TheEpicSquared","CreatedById":158667,"CreatedDateTime":"2017-11-18T16:03:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223219785\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510735987\u0022 data-ipsquote-userid=\u0022158667\u0022 data-ipsquote-username=\u0022TheEpicSquared\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/15/2017 at 9:53 AM, TheEpicSquared said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0026amp;do=hovercard\u0022 data-mentionid=\u002290599\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0022 rel=\u0022\u0022\u003E@panzerknoef\u003C/a\u003E Thanks for the feedback. Expect a new version of the ISSJ-40 soon. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell I\u0027m not quite sure what I\u0027ve done wrong, but now the updated ISSJ-40 can\u0027t get past Mach 1. Hmmm... \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0026amp;do=hovercard\u0022 data-mentionid=\u002290599\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0022 rel=\u0022\u0022\u003E@panzerknoef\u003C/a\u003E the updated version will be slightly delayed as I try to fix the issue, unfortunately. Just a heads up. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-11-18T17:11:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222302\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511021009\u0022 data-ipsquote-userid=\u0022158667\u0022 data-ipsquote-username=\u0022TheEpicSquared\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, TheEpicSquared said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell I\u0027m not quite sure what I\u0027ve done wrong, but now the updated ISSJ-40 can\u0027t get past Mach 1. Hmmm... \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0026amp;do=hovercard\u0022 data-mentionid=\u002290599\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0022 rel=\u0022\u0022\u003E@panzerknoef\u003C/a\u003E the updated version will be slightly delayed as I try to fix the issue, unfortunately. Just a heads up. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI can\u0027t find the link for the craft, only the review !\n\u003C/p\u003E\n\u003Cp\u003E\nMy thoughts for improvements\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nBig s wings and strakes can carry your fuel without having fuel tanks in the middle of the cabin.  Unfortunately this means the Business class passengers are unprotected from the unwashed masses, but makes meal service easier.\n\u003C/li\u003E\n\u003Cli\u003E\n An inline cockpit then a shock cone or something ahead will reduce heating on that mk1 cockpit.\n\u003C/li\u003E\n\u003Cli\u003E\nshock cone or pre-cooler intake work better above 1000 m/s,  can get rid of all them radials\n\u003C/li\u003E\n\u003Cli\u003E\npower is a tricky one.   solar panels are v draggy, and the rules say no RTGs  i think,  so best bet would be a service bay ahead of cockpit, with an oscar b inside, and radially attached fuel cell.     \n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"kerbinorbiter","CreatedById":172446,"CreatedDateTime":"2017-11-18T19:30:53Z","Content":"\n\u003Cp\u003E\nInternational Space Exploration \u003Cs\u003EAgency\u003C/s\u003E Airplanes presents the latest small regional jet by the name of Kerbair K32\n\u003C/p\u003E\n\u003Cp\u003E\nspecs:\n\u003C/p\u003E\n\u003Cp\u003E\n48 passengers\n\u003C/p\u003E\n\u003Cp\u003E\na fuel capacity of 4400 kallons but we only thing 3200 kallons is necessary\n\u003C/p\u003E\n\u003Cp\u003E\ncosts a small price of :\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E43,490,000 \n\u003C/p\u003E\n\u003Cp\u003E\ncruising speed of 525 mph (235 m/s)\n\u003C/p\u003E\n\u003Cp\u003E\nweight or mass: 33.434 tonnes\n\u003C/p\u003E\n\u003Cp\u003E\ncruising altitude of around 3km\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Kerbalorbiter/Kerbair-K32\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Kerbalorbiter/Kerbair-K32\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-18T19:46:01Z\u0022 title=\u002211/18/2017 07:46  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 18, 2017\u003C/time\u003E by kerbinorbiter\u003C/strong\u003E\n\u003Cbr\u003Ecanot read\n\u003C/span\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2017-11-18T23:43:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222297\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511020397\u0022 data-ipsquote-userid=\u0022167612\u0022 data-ipsquote-username=\u0022NightshineRecorralis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, NightshineRecorralis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022color:rgb(53,60,65);font-size:14px;background-color:rgb(255,255,255);\u0022\u003E\n-snip-\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe have modified the design, it has a slightly reduced part count, airbrakes, stronger wheel brakes, a more powerful elevator and about the same price. We included two jet engines because we thought one propeller engine (Which we thought would be fairly smooth, whenever one cylinder fires a cylinder on the opposite side of the engine also fires, we thought it would counteract that - and it is bird resistant.)\n\u003C/p\u003E\n\u003Cp\u003E\nIt is downloadable at same link as all our other planes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Just noticed this thread was started on September 11. A reminder: my cargo planes are bomb compatible.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-18T23:47:38Z\u0022 title=\u002211/18/2017 11:47  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 18, 2017\u003C/time\u003E by CrazyJebGuy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CrazyJebGuy","CreatedById":128571,"CreatedDateTime":"2017-11-19T00:09:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222107\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510986399\u0022 data-ipsquote-userid=\u002290599\u0022 data-ipsquote-username=\u0022panzerknoef\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, panzerknoef said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTalking about those death traps again though... I just happen to be testing another craft again which is one yet again, loses a wing upon slight banking at cruise speed \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot entirely complaining about the death trap thing, it makes my not a jet-powered-coffin look better in comparison.\n\u003C/p\u003E\n"},{"CreatedByName":"1Revenger1","CreatedById":64201,"CreatedDateTime":"2017-11-19T00:12:01Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/169310-eidahlil/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022169310\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/169310-eidahlil/\u0022 rel=\u0022\u0022\u003E@Eidahlil\u003C/a\u003E\u0027s Asymmetric Aerodynamics Potato\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kvvqKTD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022432\u0022 src=\u0022https://i.imgur.com/kvvqKTD.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E Engineers taking the Potato out on the runway to drift...)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003EFigures as tested:\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCost: \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E15,861,000\n\u003C/li\u003E\n\u003Cli\u003E\nFuel: 800 Kallons\n\u003C/li\u003E\n\u003Cli\u003E\nCruising Speed: 1200m/s\n\u003C/li\u003E\n\u003Cli\u003E\nCruising Altitude: 22 - 24km\n\u003C/li\u003E\n\u003Cli\u003E\nFuel Burn Rate: 0.9 Kallons/Minute\n\u003C/li\u003E\n\u003Cli\u003E\nRange: 8500\u002B Km\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nTesting notes:\n\u003C/p\u003E\n\u003Cp\u003E\nWe were initially suspicious of this plane. The off-center wing in the center, while abstract, just didn\u0027t look right to the pilots. That was before the engineers took it for a joy-ride and the pilots actually got a chance to fly it. We were very suprised by how rock solid the aircraft is. One of the engineers slid this plane sideways into the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E at 20m/s and it sustained no damage whatsoever. Plus it proved very strong when the pilots dumped the aircraft on the runway as they were learning to fly this.\n\u003C/p\u003E\n\u003Cp\u003E\nFlying the aircraft was a little weird. It\u0027s takeoff and landing performance is great on paper, although trying to control it (Especially on landing) was somewhat difficult. Once we were able to tame the plane a bit though, it was great at taking off and landing, going well underneath the 80m/s requirement. This plane though in the air acted somewhat strange. Due to the off-center wing, the plane did roll around quite a bit when we didn\u0027t want to, and it was difficult to control the rolling even we did want to roll the aircraft. Once we got used to this a bit though, the flying became somewhat smoother and we had less issues. This is certainly a plane that will require a decent bit of training in order to get the pilots ready to fly this for passengers. At cruise though, this plane works amazingly well. It was easy as setting the pitch to 0 degrees at 20km, and keeping the speed around 1200m/s, and the plane climbed as high as it could go on it\u0027s own and sipped on fuel. At only 0.9 Kallons/Minute at cruise, this gives the aircraft ridiculous range that easily gives the plane a change to go around the world once or twice. We would\u0027ve liked something to help slow down the aircraft though such as airbrakes, but we can always make the plane act like a speedbrake in it of itself by pitching down as hard as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nPassenger comfort is generally pretty good. There would be some issues with the engine being back vibrating the whole plane, but it would be somewhat dampened by the fuel tank. This would also be very simple to maintain due to it\u0027s resilience and single engine. The Potato only has 1 engine to, reducing needed maintenance as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003EThe Verdict:\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe airline will buy 10 of these to slip into smaller airports as well as on low-demand routes. They are very cheap, and are great for many, low demand routes that couldn\u0027t support bigger planes.\n\u003C/p\u003E\n"},{"CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-11-19T02:48:37Z","Content":"\n\u003Cp\u003E\nis Prakasa Aeroworks allowed? It adds a lot of useful parts\n\u003C/p\u003E\n"},{"CreatedByName":"Mjp1050","CreatedById":159323,"CreatedDateTime":"2017-11-19T02:56:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222239\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511013015\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nP.S. To the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, would KAX be ok? I really like it\u0027s 2.5m to 1.25m tail boom adapter. (I accidentally included it in several of my designs)\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222746\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511059717\u0022 data-ipsquote-userid=\u0022168757\u0022 data-ipsquote-username=\u0022RedPandaz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, RedPandaz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nis Prakasa Aeroworks allowed? It adds a lot of useful parts\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, no. The only mods allowed are AirplanePlus and Tweakscale.\n\u003C/p\u003E\n"},{"CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-11-19T02:57:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222749\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511060199\u0022 data-ipsquote-userid=\u0022159323\u0022 data-ipsquote-username=\u0022Mjp1050\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Mjp1050 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSorry, no. The only mods allowed are AirplanePlus and Tweakscale.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAww, ok. Sorry that I haven\u0027t posted yet, I haven\u0027t really gotten around to figuring out KerbalX.\n\u003C/p\u003E\n\u003Cp\u003E\nTho I have made a \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E passenger plane \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-11-19T03:16:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222467\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511033453\u0022 data-ipsquote-userid=\u0022172446\u0022 data-ipsquote-username=\u0022kerbinorbiter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, kerbinorbiter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInternational Space Exploration \u003Cs\u003EAgency\u003C/s\u003E Airplanes presents the latest small regional jet by the name of Kerbair K32\n\u003C/p\u003E\n\u003Cp\u003E\nspecs:\n\u003C/p\u003E\n\u003Cp\u003E\n48 passengers\n\u003C/p\u003E\n\u003Cp\u003E\na fuel capacity of 4400 kallons but we only thing 3200 kallons is necessary\n\u003C/p\u003E\n\u003Cp\u003E\ncosts a small price of :\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E43,490,000 \n\u003C/p\u003E\n\u003Cp\u003E\ncruising speed of 525 mph (235 m/s)\n\u003C/p\u003E\n\u003Cp\u003E\nweight or mass: 33.434 tonnes\n\u003C/p\u003E\n\u003Cp\u003E\ncruising altitude of around 3km\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Kerbalorbiter/Kerbair-K32\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Kerbalorbiter/Kerbair-K32\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot the most reassuring picture\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SuicidalInsanity","CreatedById":143878,"CreatedDateTime":"2017-11-19T03:29:32Z","Content":"\n\u003Cp\u003E\nIs this too wacky a design? On the off chance it isn\u0027t:\u003Cbr\u003E\u003Cstrong\u003EInsanity Aerospace IA-960 Ikaros\u003C/strong\u003E\u003Cbr\u003E\u003Cimg alt=\u002255FL9l0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/55FL9l0.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\nIA\u0027s newest offering in the Medium Jet category, the Ikaros seeks to redefine decadent luxury, harking back to an era when air travel was as much an experience as it was a means of transit. At 70,906,000 funds and 84 parts, it features an elegant, retro-futurist design that totally wasn\u0027t a mothballed nuclear jet prototype retrofitted as a tax-write-off. Forgoing the standard tube with windows design, the Ikaros instead sports a panoramic passenger cabin that simultaneously seeks to minimize engine noise as well as offering an unparalleled view. Seats are arranged around the circumference of the cabin, while the center of the cabin is occupied by a glass-floored skylounge for any of the 96 passengers who want to stretch their legs, socialize, or simply relax and watch the world go by during the flight.The Ikaros\u0027 emphasis on comfort extends to the ground crews as well; knowing the hassle of refueling multi-part tanks, the Ikaros can instead be refueled by simply swapping its 3060 kallon fuel pod, greatly expediting aircraft turnaround.\u003Cbr\u003E\u003Cimg alt=\u0022itODnTV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022462\u0022 src=\u0022https://i.imgur.com/itODnTV.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\nAt an optimum cruise altitude of 7500m, the Ikaros is capable of 250m/s and can travel at least 1500km without refueling, with its three Goliath engines consuming an average of 0.52 \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E/s. At 61.84 tons it has a takeoff speed of ~75m/s, but the quick acceleration provided by the Goliaths allows it to reach this speed in a much shorter distance than one might expect.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/SuicidalInsanity/IA-960-Ikaros\u0022 rel=\u0022external nofollow\u0022\u003ECraft file\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TaRebelSheep","CreatedById":182411,"CreatedDateTime":"2017-11-19T11:09:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223222780\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511062172\u0022 data-ipsquote-userid=\u0022143878\u0022 data-ipsquote-username=\u0022SuicidalInsanity\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, SuicidalInsanity said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/itODnTV.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022itODnTV.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022462\u0022 src=\u0022https://i.imgur.com/itODnTV.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow\u0027s runway visibility for the cockpit though? The cockpit seems kinda obscured by the ring of crew modules and the large fuel tank at the front.\n\u003C/p\u003E\n"},{"CreatedByName":"NightshineRecorralis","CreatedById":167612,"CreatedDateTime":"2017-11-19T15:55:02Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETest Pilot Review: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0026amp;do=hovercard\u0022 data-mentionid=\u002290599\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/90599-panzerknoef/\u0022 rel=\u0022\u0022\u003E@panzerknoef\u003C/a\u003E \u0027s KnoefCo Aerospace -- Bx-1/2 \u0022Shoebox\u0022/\u0022Sturdy Shoebox\u0022\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003E\u003Cimg alt=\u0022Zyhp6fO.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Zyhp6fO.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E(Olympus for scale)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFigures as Tested: Bx-1 Shoebox\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003EPrice:\u003Cspan\u003E \u003C/span\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E6,443,000\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel: 400 \u003C/strong\u003E\u003Cstrong\u003Ekallons\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising speed: 160 m/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising altitude: 5000 m\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel burn rate: 0.05 \u003C/strong\u003E\u003Cstrong\u003Ekal\u003C/strong\u003E\u003Cstrong\u003E/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERange:  1170 km\u003C/strong\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFigures as Tested: Bx-2 Sturdy Shoebox\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003EPrice:\u003Cspan\u003E \u003C/span\u003E\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 style=\u0022border-style:none;vertical-align:middle;\u0022 title=\u0022:funds:\u0022\u003E7,121,000\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel: 400 \u003C/strong\u003E\u003Cstrong\u003Ekallons\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising speed: 150 m/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECruising altitude: 5000 m\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFuel burn rate: 0.06 \u003C/strong\u003E\u003Cstrong\u003Ekal\u003C/strong\u003E\u003Cstrong\u003E/s\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERange:  910 km\u003C/strong\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EReview Notes:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cb\u003ELet\u0027s be honest, when our pilots first saw the Shoebox, they either dropped on the spot or ran away at the first chance they had. With so many death traps masquerading as planes around, we thought this would be one of them. However, the Shoebox is quite a neat little airplane, despite some clear disadvantages. The Sturdy Shoebox was received with much more enthusiasm comparatively, but pilots were still hesitant. While these planes may not look much, they are certainly a force to be contended with.\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EFor the Shoebox, we were quite concerned about the visibility and field of view of the pilot. There is nothing to see, the pilots have to rely completely on their instruments, which may prove fatal if something malfunctions. Either way, the wing has no incidence, which means that the plane cruises at a nose up attitude always. Speaking of cruise, it takes 6 whole minutes for the Shoebox and the Sturdy Shoebox to reach cruising altitude and speed, wasting a significant amount of fuel in the less efficient air. When we tested landing, it was apparent that the wheel brakes were simply too weak, and the crafts take up a large runway length, even when we landed as slow as possible. The craft itself is also rather draggy, and it is all too easy to stall these planes at lower speeds. The placement of the fuel tank in between the cabin and the engines does well to prevent noise in the cabin, but vibrations are still rather noticeable and the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E shifts forward significantly, causing our pilots to fight against a very nose heavy craft at the end of a long flight.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EWe did still love these planes, as they are very attractive in terms of their price point. At 6,443,000 and 7,121,000 funds respectively, they provide a lot for so little. We found that the missing ailerons and rudder did not impact performance as much as we expected, as the reaction wheels in the cockpit were more than sufficient for the task. We like the inclusion of some protection from tailstrikes, as that happens more than one would expect. Both planes have slightly more range than advertised, which was a nice bonus. We were a little confused at the inclusion of monoprop with the planes, but we simply drained the tank before a flight. The toughness of these crafts is rather impressive, as we put them through their paces with collisions and rough landings, and both survived just fine. In the event of an emergency ditching, we think our pilots won\u0027t sweat it. Ditching the Shoebox and Sturdy Shoebox is just like landing it, and maybe even a little easier.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EWith 23 and 24 parts respectively, we don\u0027t think these planes will require much in the way of maintenance. The Shoebox\u0027s internal ducting might take some work, but the Study Shoebox at least doesn\u0027t have air from the intake running the length of the craft. Turbofans are quite reliable, and with the simple construction, it won\u0027t take much to keep these planes flying.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe Verdict:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EThe Shoebox is a mixed bag for us. With nonexistent visibility and a long landing run, we don\u0027t think it is worth the hassle to purchase this craft, even though it is amazingly cheap. The Sturdy Shoebox, with simpler duct work and better visibility, is worth the higher price in our mind. We don\u0027t expect these planes to service remote airfields due to their landing characteristics, but as a commuter liner, they perform admirably, with quick turnarounds and decent range compared to competitors. Buying 5 Bx-2s with options for 5 more.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003E-------------------------------\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223221166\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510875357\u0022 data-ipsquote-userid=\u0022128571\u0022 data-ipsquote-username=\u0022CrazyJebGuy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/16/2017 at 6:35 PM, CrazyJebGuy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGawain Aircraft Presents: a turboprop, the GAI Kalcing (Name comes from the calculators embedded in the walls)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/zOiFrap.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022zOiFrap.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022399\u0022 src=\u0022https://imgur.com/zOiFrap.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExample Wall Calculator: (Karuida KK)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/f2S66PL.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022f2S66PL.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022768\u0022 src=\u0022https://imgur.com/f2S66PL.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nRange: 2300km @ 1000m, 322m/s, full throttle        OR        3640km @ 2000m, 142m/s, 322m/s\n\u003C/p\u003E\n\u003Cp\u003E\n Should it turn out to be profitable to haul 40 mathematicians at 322m/s for 2300 km, or anyone really, this is the plane for you. With 40 calculators total, it has a theoretical maximum 193 square root calculations per second.\n\u003C/p\u003E\n\u003Cp\u003E\nAt $18,670,000 ($19,630,000 wet) it is very affordable, and has a GPPM (gallons per passenger mile) of 0.013, which is very good.\n\u003C/p\u003E\n\u003Cp\u003E\nIn ditching tests, we found it was very safe. When we tries to see if it could take off again, we hit a sea mine (or something) because it suddenly blew up at 6m/s, the wings were gone and the fuselage was permanently bent. (But everyone survived)\n\u003C/p\u003E\n\u003Cp\u003E\n The forward mounted air intake also can divert air into cabins, keeping the passengers very cool.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd with a part count of 37, maintenance is cheap.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWith 40 passengers and that kind of speed, this should be considered a small regional jet, just saying.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-19T16:01:45Z\u0022 title=\u002211/19/2017 04:01  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 19, 2017\u003C/time\u003E by NightshineRecorralis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NightshineRecorralis","CreatedById":167612,"CreatedDateTime":"2017-11-19T16:16:51Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003E\u003Cimg alt=\u0022HlnCH0e.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022574\u0022 src=\u0022https://i.imgur.com/HlnCH0e.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EAnyone interested in reviewing this monstrosity?\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"kerbinorbiter","CreatedById":172446,"CreatedDateTime":"2017-11-19T16:18:38Z","Content":"\n\u003Cp\u003E\nIS THAT A JUMBO JET!!!\n\u003C/p\u003E\n"},{"CreatedByName":"NightshineRecorralis","CreatedById":167612,"CreatedDateTime":"2017-11-19T16:21:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223223112\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511108318\u0022 data-ipsquote-userid=\u0022172446\u0022 data-ipsquote-username=\u0022kerbinorbiter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, kerbinorbiter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIS THAT A JUMBO JET!!!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, seats around 1100 iirc. Not at my PC right now, so I can\u0027t double check.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbinorbiter","CreatedById":172446,"CreatedDateTime":"2017-11-19T17:35:04Z","Content":"\n\u003Cp\u003E\ninternational space exploration airplanes presents\n\u003C/p\u003E\n\u003Cp\u003E\nthe latest small regonal jet with 96 passengers \n\u003C/p\u003E\n\u003Cp\u003E\ncosting 34,750,000 funds (this is real)\n\u003C/p\u003E\n\u003Cp\u003E\nwith a weight of 44.618 tonnes\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Kerbalorbiter/Kerbair-K20\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Kerbalorbiter/Kerbair-K20\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nand a range of a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"53miner53","CreatedById":172955,"CreatedDateTime":"2017-11-19T21:15:07Z","Content":"\n\u003Cp\u003E\n18537 Tech SupersonicJet1: \u003Ca href=\u0022https://kerbalx.com/53miner53/SupersonicJet1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/53miner53/SupersonicJet1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPics: \u003Ca href=\u0022https://drive.google.com/open?id=1cTntZB3QJ474T0dW77L8RgI8NDv54CFy\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/open?id=1cTntZB3QJ474T0dW77L8RgI8NDv54CFy\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSpecs: (it’s a supersonic jet category entry)\n\u003C/p\u003E\n\u003Cp\u003E\nCost: 52,271,000\n\u003C/p\u003E\n\u003Cp\u003E\nCruising altitude: 20100m\n\u003C/p\u003E\n\u003Cp\u003E\nCruising speed: floor it!\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E Anything above 800m/s is good, but faster is better\n\u003C/p\u003E\n\u003Cp\u003E\nTakeoff speed: 60m/s\n\u003C/p\u003E\n\u003Cp\u003E\nlanding speed: 40m/s\n\u003C/p\u003E\n\u003Cp\u003E\naction group: 2: flaps and droopnose cockpit.\n\u003C/p\u003E\n\u003Cp\u003E\nNote to pilot: you want to glide for an approach to the airport for a long distance, otherwise you will overshoot the airport by a lot. Approach the runway as low as possible, and be careful with pitch control.\n\u003C/p\u003E\n\u003Cp\u003E\nPitch: 18537 Tech used its experience with supersonic flight and space shuttles to bring a craft that is stable beyond the speed of sound, but plenty maneuverable during takeoff and landing. Seats 48, and has ejector seats for all passengers and crew. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-20T04:09:46Z\u0022 title=\u002211/20/2017 04:09  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 20, 2017\u003C/time\u003E by 53miner53\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-11-19T21:20:32Z","Content":"\n\u003Cp\u003E\nAre Drone Cores allowed?\n\u003C/p\u003E\n"},{"CreatedByName":"1Revenger1","CreatedById":64201,"CreatedDateTime":"2017-11-19T21:57:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223223342\u0022 data-ipsquote-contentid=\u0022165372\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511126432\u0022 data-ipsquote-userid=\u0022168757\u0022 data-ipsquote-username=\u0022RedPandaz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, RedPandaz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre Drone Cores allowed?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI mean they are if you need one for some reason. The plane must have at least 1 pilot though for a small plane and 2 for a medium - large plane though.\n\u003C/p\u003E\n"}]}