{"TopicId":165737,"ForumId":16,"TopicTitle":"Increase Delta-V of rocket","CreatedByName":"VincentThacker","CreatedById":167430,"CreatedDateTime":"2017-09-22T07:46:01Z","PageNum":1,"Articles":[{"CreatedByName":"VincentThacker","CreatedById":167430,"CreatedDateTime":"2017-09-22T07:46:01Z","Content":"\n\u003Cp\u003E\nI\u0027m playing a Career mode game with no mods (except MechJeb), and this is the largest rocket I\u0027ve been able to build. It works well for traveling within the Kerbin system so far, but I want to start going to other planets, but it clearly lacks enough Delta-V to do so (only 7500 m/s). I only have all the 90-Science nodes of the tech tree researched, plus Heavier Rocketry and Command Modules. I would like to increase its Delta-V to (hopefully) 10000 m/s, but am unable to do so. Adding more boosters renders its \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E too small to lift itself. Any ideas?\n\u003C/p\u003E\n\u003Cp\u003E\nPicture \u003Ca href=\u0022https://imgur.com/a/Py6kp\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-22T07:47:21Z\u0022 title=\u002209/22/2017 07:47  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 22, 2017\u003C/time\u003E by 100055\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MajorMushroom","CreatedById":181421,"CreatedDateTime":"2017-09-22T08:06:30Z","Content":"\n\u003Cp\u003E\nI\u0027m no expert, but do you really need 3 kerbals? Because you can always convert the rockomax pieces to the smaller ones, and use the much lighter one man pod. This should let you add more rockets.  \n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-09-22T08:17:29Z","Content":"\n\u003Cp\u003E\nOrbital construction and modular design are your friends here\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2017-09-22T08:39:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223177726\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506066361\u0022 data-ipsquote-userid=\u0022167430\u0022 data-ipsquote-username=\u0022100055\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, 100055 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdding more boosters renders its \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E too small to lift itself.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe that\u0027s because your boosters are too big. The \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of the booster itself should be higher then the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of the core stage so it actually applies net thrust. If they are equal, the booster is basically just carrying itSelf. If it\u0027s lower, the core carries the booster.\n\u003C/p\u003E\n\u003Cp\u003E\nequal or lower is fine in some designs, when the booster feeds the core with fuel. In this case it\u0027s like a better droptank.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-22T08:48:57Z\u0022 title=\u002209/22/2017 08:48  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 22, 2017\u003C/time\u003E by Physics Student\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Helmetman","CreatedById":181322,"CreatedDateTime":"2017-09-22T09:34:35Z","Content":"\n\u003Cp\u003E\nWhy you got a antenna? It is a crewed ship right? They don\u0027t need antenna\u0027s for control. Toss it!\u003Cbr\u003E\nGenerally you only need 3 landing legs to land, maybe increase spring and dampener strength by right clicking on them if it tends to fall on touchdown, this saves some weight.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t see any solar panels? Go any not shown on the pic? If you don\u0027t have them you\u0027d better put one on and remove all batteries for all I care. As long as you make sure your getting sunlight 10-20EC is all you need.\u003Cbr\u003E\nTry to do a re-entry test by launching into a highelliptical kerbin orbit. Did you waste all the ablator on your heatshield?\u003Cbr\u003E\nIf not, try to empty as much ablator as you can, this also saves weight. \u003Cbr\u003E\nAny monopropellant in the command module? You don\u0027t need it, empty it and this will also save weight.\n\u003C/p\u003E\n\u003Cp\u003E\nDo you seriously need all those tailfins at the bottom? You got a skipper or mainsail (can\u0027t make up) that has swivel right?\u003Cbr\u003E\nMost of the weight is at the bottom. Maybe only 2 or 4 of the smalles tailfins at the bottom would be enough for stability if you get center of drag issues in case you remove them. The smaller ones save drag and weight and you\u0027ll have more delta-v on the 1st stage.\n\u003C/p\u003E\n\u003Cp\u003E\nBy the looks of it I think you could do with only the center engine for attitude control. Are all the other outer engines on the asparagus 1st stage reliant T30 engines or are there also T45 swivel engines. T30 is lighter and better and maybe you can properly control it with only reliant engines.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESome general info.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTo go to other places you shouldn\u0027t think in total Delta-V from the Launchpad. Rather you need to setup your interplanetary mission profile by creating the necessary modules first.\u003Cbr\u003E\nTo practice yourself, limit yourself to 1 kerbal landing per interplanetary world. This makes things easier for you. If you get the hang of it you can scale things up and get more kerbals there. Don\u0027t make things unnecessary difficult for youself if your still in the learning curve.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I would do is first set a target. Let\u0027s say this is Duna. \u003Cbr\u003E\nFirst you want to test a vehicle that can land from Duna orbit on Duna, take off again, fly and land back to Kerbin.\u003Cbr\u003E\nYou can test this by using the correct thrust on the stages and making sure you got plenty of delta v and a capsule with heatshield and parachutes.\u003Cbr\u003E\nYou will also need parachutes to land on Duna, so make sure you repack them using a engineer on the ground or have sufficient parachutes on the return stage.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter you build this module (can weight like 10 tons) then you should start to create a rocket in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E to get that weight and shape into Duna orbit.\u003Cbr\u003E\nThis is better then building the rocket from scratch and then start fiddling how your gonna get it done on Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nTry to watch some interplanetary stock tutorials like by guys such as \u0022Scott manley\u0022 on his youtube account.\u003Cbr\u003E\nHe explains it by narrating his own playthrough with some very basic and sometimes more advanced tips for people new to the game.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-22T09:50:21Z\u0022 title=\u002209/22/2017 09:50  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 22, 2017\u003C/time\u003E by Helmetman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aelfhe1m","CreatedById":142910,"CreatedDateTime":"2017-09-22T09:49:46Z","Content":"\n\u003Cp\u003E\nYou could do it like \u003Ca href=\u0022https://i.imgur.com/hUaimIf.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E (note the first set of liquid boosters stage before the SRBs) but I\u0027d prioritise researching specialized construction first to get the standard clamp-o-trons then assemble something in orbit. Also comms are going to be an issue beyond KSOI until you research better antennae.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Oh and I completely agree with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181322-helmetman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022181322\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181322-helmetman/\u0022 rel=\u0022\u0022\u003E@Helmetman\u003C/a\u003E about mission planning and smaller payloads rather than just throwing raw delta-V at the problem. For example a mission to (loose elliptical) Eve orbit takes less delta-V than a Mun landing if you use an optimal transfer window.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-22T09:57:49Z\u0022 title=\u002209/22/2017 09:57  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 22, 2017\u003C/time\u003E by Aelfhe1m\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-09-22T09:54:05Z","Content":"\n\u003Cp\u003E\nTry going for a classic \u0022Dealty IV Heavy\u0022/\u0022Falcon Heavy\u0022 build. Toss the 1.25m side boosters. Copy your core stage and strap a pair to the outside. Do not use fuel crossfeed. Instead, add extra tanks to the central stack. Your goal is a configuration where the side boosters run empty and are decoupled, leaving a half-empty center stage that has enough \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to continue by itself even though it would not have enough \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E if it was completely full.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could get a similar effect by crossfeeding into the center stage and having said center stage be small enough to have enough \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E even when full, but while the effect is similar, the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E yield isn\u0027t. At the end of the day, the only thing that gets you \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is your mass fraction. Crossfeed has its uses, but it doesn\u0027t always help you go further. More raw fuel, on the other hand, does. You will grow as a rocket builder if you stop relying on fuel lines as crutches, and start to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/140385-mass-delta-v/#comment-2598497\u0022 rel=\u0022\u0022\u003Ework with mass fractions\u003C/a\u003E. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIn accordance to advice in that link, I would also try to beef up your upper stages. You have high-Isp Poodles on them, but pull only 2000 m/s out of each of them. That\u0027s less than six times their Isp, so you\u0027re not really getting good bang for your buck. Try bumping them both up to around 3000-3500 m/s. Or the middle one to 3000 and the upper one to 3500. Or whatever happens to fit with the tank sizes you have available to you. Don\u0027t sweat the details, just let the Poodles do more work so you can benefit from their Isp more.\n\u003C/p\u003E\n"},{"CreatedByName":"Martijnor","CreatedById":181552,"CreatedDateTime":"2017-09-22T10:23:36Z","Content":"\n\u003Cp\u003E\nJust add a clamp-o-tron docking port jr and refuel in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with a refueling ship you send up on a second launch. That way you could even add some more tanks to the two upper stages and send them up empty at first to avoid adding weight to your current design.\n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-09-22T14:06:30Z","Content":"\n\u003Cp\u003E\nMoar boosters (well nobody else was going to say it)\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2017-09-22T14:30:14Z","Content":"\n\u003Cp\u003E\nOn a side note, since I\u0027m not seeing any, I recommend you get a few solar panels on that thing if you\u0027re going interplanetary.  The poodle (which I\u0027m assuming you\u0027re using) has an alternator, but personally I\u0027d hate to fire the engine to charge up the batteries.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond tossing the antenna.  Looks like all your science is going to be recovered, so you won\u0027t need to transmit anything.\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-09-22T14:30:44Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167430-100055/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167430\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167430-100055/\u0022 rel=\u0022\u0022\u003E@100055\u003C/a\u003E:\u003Cbr\u003E\u003Cbr\u003E\nDrop the 1.25m boosters and add either Kickbacks or 2.5m boosters.  Generally (with the sometimes exception of solid rocket boosters such as the Kickback), you want your stages to go for about two minutes before you need to start the next one:  you have this for your core but not for the side boosters.  Thirty seconds of burn is nigh-useless for a liquid-fuelled booster stage.  Also, your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E for each of your booster stages increases by .01; the boosters are carrying themselves and not really doing much else.  That\u0027s not to say that they don\u0027t help at all:  if they\u0027re asparagus-staged then you do get the benefit of essentially starting with a fully-fuelled core stage that already has some speed and altitude, which is probably why you see less delta-V if you take those boosters away.  But that\u0027s all the help you\u0027re getting from them; they\u0027re worthless otherwise.  For boosters, you always want to add net thrust--this means that you need the boosters to have higher thrust-to-weight than the core.  Usually, the 1.25m engines are weaker than the 2.5m types (the exceptions are the Vector and Dart, which you don\u0027t have yet), so for a comparable fuel load, you end up losing delta-V if you use them against a 2.5m core.  You\u0027re only managing because you have three FL-T800 fuel tanks stacked on each one, so it\u0027s a more-than-comparable fuel load.\u003Cbr\u003E\u003Cbr\u003E\nHowever, that larger fuel load is also at the limit of what the basic 1.25m engines can lift:  less fuel gives more \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E but an even more pathetic burn time, and more fuel leaves you on the pad, unable to lift at all.\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nTo put it in other words, your design has reached the point of diminishing returns; this rocket is as good as this rocket will ever be.  If you want a better rocket, then you need a new rocket.  Add a few of the tall 2.5m tanks with Skippers--I doubt you\u0027re at a point where you need Mainsails yet, except maybe on the bottom of your core stage.  Perhaps I\u0027m wrong:  play with the design a bit and see what works.  You unlocked Heavier Rocketry; you may as well use some of the things you find there.  In any case, you ought to have no trouble getting 10km/s by improving this design.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-22T14:42:43Z\u0022 title=\u002209/22/2017 02:42  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 22, 2017\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-22T16:45:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223177847\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506089190\u0022 data-ipsquote-userid=\u0022166883\u0022 data-ipsquote-username=\u0022Palaceviking\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Palaceviking said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMoar boosters (well nobody else was going to say it)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually my advice is \u003Cem\u003Eless\u003C/em\u003E boosters. The major issue with his design is it is a big, heavy but not particularly powerful rocket . Streetwind\u0027s idea of DeltaIV alike design is a interesting one , another is SRBs (with crossfeed enabled and \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanks on top). Depending on the destination a Terrier instead of the uppermost Poodle is a considerable mass saving (since that is the last stage it will make a big difference for the whole rocket)\n\u003C/p\u003E\n\u003Cp\u003E\nA bit problematic to give more specific advice since the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E didn\u0027t defined a particular objective. A craft tailored for a given celestial body/mission can be made much more efficient.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2017-09-22T17:37:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223177940\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506098709\u0022 data-ipsquote-userid=\u0022166502\u0022 data-ipsquote-username=\u0022Spricigo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, Spricigo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA bit problematic to give more specific advice since the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E didn\u0027t defined a particular objective. A craft tailored for a given celestial body/mission can be made much more efficient.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E stated \u0022beyond Kerbol\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0022.  Which would presumably start with Duna.  The catch is that while this is fine for landing on Ike (or Gilly) and orbiting Duna (or Eve), it really can\u0027t return from a Duna landing (assuming those landing legs are meant for landing).\n\u003C/p\u003E\n\u003Cp\u003E\nRockets (especially KSP rockets, I have no real experience in others) need to built top down.  Everything from the landing legs up needs to be able to get back out of the gravity well its designed for and then proceed to back to Kerbol (or whatever is next).  The  Mk1-2 capsule is a pretty bad, I\u0027d much rather have a mk1 capsule/mk1 crew cabin together for half (actually 1/2.2) of the mass.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d recommend an Apollo-style lander/mothership* for anything beyond Kerbol: while coming back from Duna orbit doesn\u0027t take *that* much fuel, it is still quite a bit more than the Mun.  Don\u0027t take the fuel needed for that to the surface.  Once you have the lander and return system set up, then you can build the capture and transfer stages (these are using poodles, right?  Also expect to burn home on a poodle and ditch the Duna ascent rocket the only better than poodles are Nervs, and they are beyond your tech level).  Only once they are all built should you worry about how to get the thing into orbit (expect to break the thing up into separate launches depending on where you are in career mode).\n\u003C/p\u003E\n\u003Cp\u003E\nFor getting into orbit:\u003Cbr\u003E\nMost of the advice is good, but I\u0027d still make my \u0022Falcon Heavy style\u0022 design [if  you tried  that] with crossfeeds.  Spacex wanted to do it because it is more efficient, and you want to increase the delta-v so keep the crossfeeds.\u003Cbr\u003E\nMoar boosters, especially kickers (the biggest \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E).  These show up in all the \u0022cheap and cheerful\u0022 (lost cost without recovery) contests for a reason.  Don\u0027t be afraid to strap multiple boosters each other to save on decouplers (although this is less important with kickers.  They cost enough more than decouplers to be worth it).\n\u003C/p\u003E\n\u003Cp\u003E\n* If you aren\u0027t confident on your docking skills, start with rescuing kerbanauts and progressing to real docking.  You really want to use a mothership/lander for interplanetary flights.  Also, rescue missions are a cheap source of kerbals.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-22T17:55:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223177969\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506101876\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E stated \u0022beyond Kerbol\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0022.  Which would presumably start with Duna. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, but the way \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E define it give me the impression he may want a \u0022one size fits all\u0022 design. That is the reason of my remark.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving some sub-assembles for particular tasks  (e.g. a series of Launch Vehicles 1t, 5t, 10t ...) may help to speed-up the design and allow more time to explore. But usually is the customization of the craft for the task at hand that gives the more relevant advantage.\n\u003C/p\u003E\n"},{"CreatedByName":"Gilph","CreatedById":150861,"CreatedDateTime":"2017-09-22T18:03:52Z","Content":"\n\u003Cp\u003E\nIt\u0027s actually not very clear what your objective is.  You have parachutes and landing gear on your final stage, which means you are looking to land somewhere. That upper stage is only 2100 deltav, which is not enough to land on many places, let alone returning back to Kerbin. Your rocket should be designed around your objective.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-22T18:25:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223178000\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506103432\u0022 data-ipsquote-userid=\u0022150861\u0022 data-ipsquote-username=\u0022Gilph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Gilph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat upper stage is only 2100 deltav, which is not enough to land on many places, let alone returning back to Kerbin. Your rocket should be designed around your objective.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGily and Ike are possible. That said, one does not land on Gily, rather you dock onto it. Ike is bigger but not that large to make the poodle necessary anyway.  So the craft is either not good enough or overkill. \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-09-23T03:54:24Z","Content":"\n\u003Cp\u003E\nLots of good suggestions here, but I\u0027ll add something different: if you have Heavier Rocketry, you have the TwinBoar.  It\u0027s preposterously good at lifting heavy payloads for cheap (especially in conjunction with Kickbacks for even moar dumb thrust).  As mentioned above, if you need more payload than one can lift, you can add a couple more to the sides, Falcon Heavy style.  \n\u003C/p\u003E\n\u003Cp\u003E\nDepending on your mission profile, you could potentially go with something like a Terrier top stage, then a Poodle, then a Skipper, then however many TwinBoars/Kickbacks you need.  That should be able to break 10,000 m/s without too much trouble. \n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, it\u0027s advisable to figure out what mission you want to perform, figure out what your needs are for that mission (delta-v, \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, landing, etc), and design your rocket backwards from the top.  \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I\u0027m going to respectfully disagree with those who suggest doing things on a modular basis, or refueling in orbit.  It is not really more efficient to launch a lot of smaller payloads to orbit, versus doing it in one.  If you really economize your rockets it might be slightly cheaper, but I don\u0027t see how it\u0027s easier.  And in some ways it\u0027s less efficient - you need docking hardware, duplication of some parts (e.g. probe cores), and you\u0027ll end up spending some of your fuel on rendezvous maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-09-23T17:36:18Z","Content":"\n\u003Cp\u003E\nI\u0027m a spaceplane person but what do you think of this rocket for a  lightweight, 90 tech Duna mission ?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/9bpq0uqy8tz8biy/DUNA.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/9bpq0uqy8tz8biy/DUNA.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J5Y0BIE.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/J5Y0BIE.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221DyXf8E.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/1DyXf8E.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI guess it helps a lot that the pod is the lightest possible.  The transfer fuel tank is on a docking port, the idea is to leave that in orbit of Duna and hook up to it again after ascending from the surface.   It\u0027s got a heatshield on the top and there\u0027s elevons on the bottom of the lander can to keep that end pointing forward on re-entry to Kerbin.    Either side of the can, on decouplers, is our landing / science hardware - pair of Oscar Bs,  landing legs, mystery goo containers, and the landing parachutes (will need a burst from the engine though to cushion the touchdown , no doubt).\n\u003C/p\u003E\n"},{"CreatedByName":"VincentThacker","CreatedById":167430,"CreatedDateTime":"2017-09-24T03:29:54Z","Content":"\n\u003Cp\u003E\nThanks for all the suggestions. One more question: How do I add more Delta-V to a lander? Using taller tanks makes it tip over easily, and making it wider by adding tanks and engines around the main tank will increase air resistance during the initial launch. \n\u003C/p\u003E\n"},{"CreatedByName":"Draalo","CreatedById":158993,"CreatedDateTime":"2017-09-24T06:13:07Z","Content":"\n\u003Cp\u003E\nIncreasing the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is simple:\n\u003C/p\u003E\n\u003Cp\u003E\nIncrease the Amount of fuel and/or reduce weight.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming you are refering to the pic in the first post:\n\u003C/p\u003E\n\u003Cp\u003E\nStrip all unnessesary, like monopropellant. Use the lightest antenna that can make the planned distance. Reduce batteries and Solarpaneels to a minimum. Reduce the amount of ablator - they are designed to allow reentries on Eve and Laythe too, the full amount isnt needed for a Kerbin reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n(The MK1-2 Capsule is very heavy btw, a MK2 Lander Can \u002B adapter \u002B MK1 Pod reduces the weight by 1to./25%)\n\u003C/p\u003E\n\u003Cp\u003E\nWhere do you want to land? Mun? then remove the Poodle, use a Terrier instead. (-1.25to.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo increase the amount of fuel you can radial attach some 1,25m tanks, place nosecones on top of them. For max performance add decouplers between tank and nosecone (upside down so the decoupler will be jettisoned too).\n\u003C/p\u003E\n\u003Cp\u003E\nTo add just a bit of fuel consider to place a 1,25m tank on top of the MK1-2\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nConsider a lander with 2 stages. Add a small tank and engine between the maintank/poodle which has only enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E (\u002B reseve) to bring you back in orbit and then to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn worst case: build a lander which is just able to return to orbit. Rendevouz and transfer crew/science then, ditch the lander and return. In this case the Lander itself doesnt need any Ablator nor parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\n(If you have problems rendevouzing - ask \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E )\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-24T06:20:11Z\u0022 title=\u002209/24/2017 06:20  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 24, 2017\u003C/time\u003E by Draalo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2017-09-24T08:52:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223178637\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506188178\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m a spaceplane person but what do you think of this rocket for a  lightweight, 90 tech Duna mission ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe launch \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of more than 2.5 means you could easily carry more fuel in the first stage.  And you messed up the staging because your first stage uses the fuel of the second, which makes the Poodle and the decoupler dead weight.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-24T12:45:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223178325\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506138864\u0022 data-ipsquote-userid=\u0022165625\u0022 data-ipsquote-username=\u0022Aegolius13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 23/09/2017 at 12:54 AM, Aegolius13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFinally, I\u0027m going to respectfully disagree with those who suggest doing things on a modular basis, or refueling in orbit.  It is not really more efficient to launch a lot of smaller payloads to orbit, versus doing it in one.  If you really economize your rockets it might be slightly cheaper, but I don\u0027t see how it\u0027s easier.  And in some ways it\u0027s less efficient - you need docking hardware, duplication of some parts (e.g. probe cores), and you\u0027ll end up spending some of your fuel on rendezvous maneuvers.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile not \u003Cem\u003Enecessarily\u003C/em\u003E more efficient \u003Cem\u003Epossibly\u003C/em\u003E it is.  Unfortunately, the mooar [stuff] approach seems,  IME, much more common than well thought optimization as motivation to use orbital construction.  \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-09-24T13:23:57Z","Content":"\n\u003Cp\u003E\nI build behemoths in orbit cos I\u0027m lazy with my planning and it gives me chance to tack on bits I forgot.. \n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-09-24T20:09:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223179029\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506243168\u0022 data-ipsquote-userid=\u0022119953\u0022 data-ipsquote-username=\u0022Harry Rhodan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Harry Rhodan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe launch \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of more than 2.5 means you could easily carry more fuel in the first stage.  And you messed up the staging because your first stage uses the fuel of the second, which makes the Poodle and the decoupler dead weight.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe high initial \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E only lasts till the Hammer SRBs burn out,  after that it\u0027s more sedate.    I left crossfeed enabled on the decoupler between the Poodle and first stage engine so I have some flexibility as to when to switch to Poodle.  Basically as soon as I feel happy that we\u0027ve got enough upward velocity I can ditch the heavy first stage engine and get on the lighter, more efficient poodle. \n\u003C/p\u003E\n\u003Cp\u003E\nI may have messed up with the final Kerbin re-entry part,  I don\u0027t think that heat shield protects the lander can very well , maybe because there\u0027s a decoupler between them. \n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-24T20:52:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223179369\u0022 data-ipsquote-contentid=\u0022165737\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221506283764\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n  I left crossfeed enabled on the decoupler between the Poodle and first stage engine so I have some flexibility as to when to switch to Poodle. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat flexibility is not much of an advantage if it only allow you to stage at a bad moment anyway. It only really make sense if you plan to top those tanks somewhere along the way.\n\u003C/p\u003E\n"}]}