{"TopicId":16644,"ForumId":16,"TopicTitle":"Munar Activities","CreatedByName":"austin1812","CreatedById":38438,"CreatedDateTime":"2012-08-11T21:22:35Z","PageNum":1,"Articles":[{"CreatedByName":"austin1812","CreatedById":38438,"CreatedDateTime":"2012-08-11T21:22:35Z","Content":"\n\u003Cp\u003EHey guys, i recently bought the game and on my second day managed to create a craft that would reach and land, then return from the mun. Being overly eager i was wondering if you guys had any tips on how to have a second lander land next to my stationed one.\u003C/p\u003E\n"},{"CreatedByName":"chuk155","CreatedById":33934,"CreatedDateTime":"2012-08-12T00:58:23Z","Content":"\n\u003Cp\u003EI personally don\u0027t do pinpoint landings a lot, so don\u0027t hold my word to success.\u003C/p\u003E\u003Cp\u003EMy strategy would be to:\u003C/p\u003E\u003Cp\u003E1. Launch a vehicle into Kerbin orbit and do a trans-MÃƒÂ¼nar injection.\u003C/p\u003E\u003Cp\u003E2. Once in Sphere of influence of the MÃƒÂ¼n (SOI), burn to put your periapsis into about ~15km.\u003C/p\u003E\u003Cp\u003E3. Do a orbital burn to get into orbit around the MÃƒÂ¼n.\u003C/p\u003E\u003Cp\u003E3b. If you landed with any inclination, try to put your orbital path to cross over the lander by increasing or decreasing your heading along the horizon.\u003C/p\u003E\u003Cp\u003E4. Once nearly over the lander (only a few km away from cross), retrograde burn (green heading with a cross in it) to deorbit.\u003C/p\u003E\u003Cp\u003E5. After getting on a decent course toward your target, land as you normally would.\u003C/p\u003E\u003Cp\u003ESome notes I have:\u003C/p\u003E\u003Cp\u003E-Make sure your lander has plenty of fuel, pinpoint landing takes a lot of planning.\u003C/p\u003E\u003Cp\u003E-Getting the inclination is easier while making MÃƒÂ¼nar burn, not after.\u003C/p\u003E\u003Cp\u003E-Landing if quite tricky. Try not to overcompensate and throw you on a wayward course.\u003C/p\u003E\u003Cp\u003E-Good Luck! Pinpoint landing (within the km) is Craaazy Hard!\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-08-12T01:09:58Z","Content":"\n\u003Cp\u003EIt\u0027s not actually all that hard, unless you didn\u0027t bring enough fuel. You get your orbit over the target, then slow before you pass it. If you need to change inclinations, it might help to raise your orbit first, since that can be more fuel efficient. Accurate landings might involve taking off after the first landing if you aren\u0027t close enough.\u003C/p\u003E\n"},{"CreatedByName":"MET?","CreatedById":31950,"CreatedDateTime":"2012-08-12T06:29:28Z","Content":"\n\u003Cp\u003EI do Precision landings all the time, trust me, its not as hard as it sounds. First step is certainly to bring your orbital path over the target by adjusting inclination. Ideally, this is done at the ascending and descending nodes. By burning normal- and normal\u002B at those points, respectively. Normal \u002B would be a position where your craft is perpendicular to your velocity vector, so if you were heading at a perfect orbit around the equator, heading 90 degrees, Normal\u002B would be pointing north. The Normal\u002B has your prograde direction on your right, and your retrograde on your left. Normal- is also perpendicular to your velocity vector, however, prograde is on your left, and retrograde is on your right. If your perform these burns precisely at the nodes, you will adjust inclination without adjusting apoapsis or periapsis.\u003C/p\u003E\u003Cp\u003EUnfortunately, KSP has no marker for AN and DN currently, so you have to eyeball it. The node is basically the point in your orbit where your craft crosses the plane of reference(in this case, the equator.) Ascending node is when you cross the equator heading north, and descending node means your heading south.\u003C/p\u003E\u003Cp\u003EOnce you pass over the target, do the descent burn. As you near the surface, you will realize that you aren\u0027t going to be as close as you thought. In order to adjust your trajectory, simply burn the way you need to go. You will need less fuel to do this if you cancel out your descent velocity first. (its much easier and quicker that way). Ideally, you want your trajectory to go beyond your target, otherwise by the time you want to slow down and land you will be to close to the ground. By continually slowing down and adjusting your trajectory to pass OVER the target, you will be able to cancel out horizontal velocity and descend vertically as you pass right over the target.\u003C/p\u003E\u003Cp\u003EFinally, after you have gotten yourself very close, begin to land. You can continue to adjust your path as you land, however you want. You can hover, and use RCS(won\u0027t do much, only if you are already super close, and you want extreme precision.\u003C/p\u003E\u003Cp\u003EUsing this method, I have completed many precision landings within a kilometer. Currently my record is 40.0 meters flat. However, I had to ruin it by coming in at a slight angle and a couple of m/s too fast, so I busted the engine. Just the engine, the rest of the lander was perfectly fine.\u003C/p\u003E\u003Cp\u003EPrecision landings are fun because once you can do them you can land anywhere you want. YOu can rescue kerbals, you can visit the Mun Arch, which I recently did, and you can land in interesting areas.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-08-12T07:00:11Z","Content":"\n\u003Cp\u003EMy 2c\u003C/p\u003E\u003Cp\u003EBuild a munbuggy and drive the last distance in style\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8006/7710296678_5760f0db4d_c.jpg\u0022 alt=\u00227710296678_5760f0db4d_c.jpg\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"austin1812","CreatedById":38438,"CreatedDateTime":"2012-08-14T16:55:12Z","Content":"\n\u003Cp\u003ECheers for the help guys, its not my finest landing but i definitely got close to my last lander.\u003Cimg src=\u0022http://static4.fjcdn.com/thumbnails/comments/\u002B_1c927a265fe5e39b35e6a69dfacb8814.png\u0022 alt=\u0022\u002B_1c927a265fe5e39b35e6a69dfacb8814.png\u0022\u003E\u003C/p\u003E\n"}]}