{"TopicId":166562,"ForumId":16,"TopicTitle":"Rover liftoff. How to recover?","CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-10-15T13:30:01Z","PageNum":1,"Articles":[{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-10-15T13:30:01Z","Content":"\n\u003Cp\u003E\nSo I was tooling along on the Mun. I had completed my contract and had driven to a new biome nearby for sciency reasons. I parked on a fairly steeply inclined crater edge to collect the science and I quicksaved there. Upon trying to leave the area and get back to level ground, I wound up flipping my rover. I reloaded the quicksave and upon loading the rover launched itself hundreds of feet in the air. Er, vaccuum. The rover itself actually survived that first one, but nearly all the underslung storage batteries were destroyed.I finally got one that seemed to survive completely intact, and I quicksaved it, which was immediately followed by a game crash. Upon reload, that save too launched itself. \n\u003C/p\u003E\n\u003Cp\u003E\nInvestigating the incident, I found a thread regarding a jumping minmus base, which suggested part of the base was clipping into the ground, and careful observation is telling me that is what\u0027s happening here. It loads fine, but for a split second before it throws the rover, it seems to be half-buried in the ground. Following advice I found elsewhere, I used the cheat console and turned off crash damage. However something seems to have happened and the rover is glitching now. The wheels never stop turning, even with motor power turned off to them. Unfortunately my many reloads have erased the quicksaves made just prior to descending on this ridge, so I\u0027m stuck with the non-functional wheels, or the save game I made immediately before driving the rover away from the lander. \n\u003C/p\u003E\n\u003Cp\u003E\nIs there any way to reset the wheels, or something else I can do to get it functioning properly? Or should I eat the 3 hours of lost gameplay?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-10-15T14:06:05Z","Content":"\n\u003Cp\u003E\nHow about cheating a replacement?  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-10-15T14:11:39Z","Content":"\n\u003Cp\u003E\nNormally I don\u0027t like cheating, but in this case I would make an exception as I\u0027m trying to recover from a glitch. How would I go about that? I\u0027m assuming the console, but I am not at all proficient. The actual advice before was to hack gravity, but turning off the crash damage I found easily.\n\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2017-10-15T18:02:42Z","Content":"\n\u003Cp\u003E\nJumping bases is something the adjustments in 1.3.1 are supposed to fix or at least reduce. If that\u0027s created ballistic rovers in the process, it\u0027s probably worth reporting, especially if you have it happening on an unmodified game and have a way of making it happen repeatably.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you just want to recover from the game engine breaking on you, I don\u0027t think many people would call it a cheat to launch a rover plus landing system, open up the alt\u002BF12 debug menu and use SetOrbit to save a bunch of time putting a replacement there.\n\u003C/p\u003E\n"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-10-15T18:18:10Z","Content":"\n\u003Cp\u003E\nIt\u0027s not an unmodded game. I\u0027m using mechjeb, \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E, and the NF sets. Although the only NF on this rig is the lander can on my lander. The rover was all stock.\n\u003C/p\u003E\n\u003Cp\u003E\nBy this point, I\u0027d redone the mission, driven to the new biome again, and returned to the lander. Just getting set to blast back into space.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for repeatability, park on a hill with a 10% grade, or more, save and reload. \n\u003C/p\u003E\n\u003Cp\u003E\nMore specifically, just west of farside crater, there is a roughly circular patch of Midland crater biome. I was on the northernmost face of that crater, just a bit off the bottom.  \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-10-15T19:50:57Z","Content":"\n\u003Cp\u003E\nSometimes, increasing the terrain detail will prevent your craft from burying itself. And naming your quicksaves is wise, because they don\u0027t get overwritten that way. And jumping seems to have a lot to do with the slope of the terrain you are parked on. If it\u0027s more than 15 degrees, you could have a jumping problem. If it\u0027s less, you probably won\u0027t have any problem at all.\n\u003C/p\u003E\n\u003Cp\u003E\nBut yes, build a new rover in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E that has a few small engines, a probe core, and a tiny tank of fuel on it. In the cheats, turn on infinite fuel, and reduce gravity to a small fraction of normal. Launch the rover to the runway and use SetOrbit to put it in orbit of the Mun. Then land it next to your other rover. Then turn the cheats all back off again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-10-16T03:42:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223195953\u0022 data-ipsquote-contentid=\u0022166562\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508097057\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut yes, build a new rover in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E that has a few small engines, a probe core, and a tiny tank of fuel on it. In the cheats, turn on infinite fuel, and reduce gravity to a small fraction of normal. Launch the rover to the runway and use SetOrbit to put it in orbit of the Mun. Then land it next to your other rover. Then turn the cheats all back off again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBy the time I got that plan, I\u0027d stuck with the save before I left the lander, redone the mission and the science. My kerbals are relaxing and drinking some brews, and the rover is waiting patiently by the flag for the next contract\n\u003C/p\u003E\n"}]}