{"TopicId":166651,"ForumId":20,"TopicTitle":"simple mod request","CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2017-10-18T20:09:10Z","PageNum":1,"Articles":[{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2017-10-18T20:09:10Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nWhilst I really like IFILS for its total simplicity, I would like to add in a possible \u0027extension\u0027 mechanic for it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I am looking for is a plugin that has the ability to generate a resource (or multiple resources) specified by a cfg file.  The amount and name of the resource(s) would be generated \u003Cu\u003Eper\u003C/u\u003E kerbal in a craft, would begin at launch.\n\u003C/p\u003E\n\u003Cp\u003E\nKind of a IFILS in reverse I guess but without the ability to kill any kerbal as excess resources would be dumped overboard.  Simple life support mods such as CLLS or IFILS could then be extended by modders.  I don\u0027t think it would need a GUI - it would be something that just sat in the background doing its thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother way of thinking about it would be to consider kerbals being little RTGs, producing a different resource to electricity (hopefully specifiable).\n\u003C/p\u003E\n\u003Cp\u003E\nWould anyone please be able to create this for me , or point me in the right direction to a mod that already does this?  I\u0027ve tried fudging this using the ModuleResourceConverter/Harvester/ Generator but can\u0027t get it to work in a meaningful way.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks, and thanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129964\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0022 rel=\u0022\u0022\u003E@linuxgurugamer\u003C/a\u003E and thanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138839-mm/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138839\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138839-mm/\u0022 rel=\u0022\u0022\u003E@-\u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E-\u003C/a\u003E for ensuring that the simple LS mods are awesome!\n\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-10-19T07:02:07Z","Content":"\n\u003Cp\u003E\nDoes this actually need a plugin? It sounds like it can be done totally stock. (Well, via Module Manager patching of stock parts, anyway.)\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll need to write several configs:\u003Cbr\u003E\n1.) define the resource you want to generate\u003Cbr\u003E\n2.) patch all crewed parts to include storage of this resource, starting empty\u003Cbr\u003E\n3.) patch all crewed parts to include a resource generator that produces your resource out of electric charge. If life support costing EC is not desired, the EC cost can be made absurdly small so it won\u0027t ever register. The GUI button for this generator should be labeled \u0022start life support\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nYou now have what you\u0027re looking for, without the need for any plugin coding.\n\u003C/p\u003E\n\u003Cp\u003E\nThe caveats of doing it this way:\u003Cbr\u003E\n- You need to manually start the generator in each crewed part before launch\u003Cbr\u003E\n- The generator will produce at a fixed rate, probably tuned for the part\u0027s maximum crew capacity, regardless of how many Kerbals are actually inside\u003Cbr\u003E\n- If you ever run out of EC, production will be suspended\n\u003C/p\u003E\n\u003Cp\u003E\nIf those are a dealbreaker, it can at least serve as a proof of concept to test if it actually ends up playing like you think it would. Not all good ideas translate into good gameplay. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2017-10-19T10:08:36Z","Content":"\n\u003Cp\u003E\nThanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E I have given this a go with ModuleResourceConverter and by manipulating kerbal traits to utilise with it. I created a LifeWaste resource, added a LifeWasteGenerator trait to kerbals and created a Converter to pods.  They did indeed start manually.\n\u003C/p\u003E\n\u003Cp\u003E\nIdeally it would generate a resource regardless of experience level of each kerbal, would scale for only the number of kerbals currently in the part (like 1 of 3) and stop when a kerbal leaves a part or the ship.  \n\u003C/p\u003E\n\u003Cp\u003E\nAt the moment I can\u0027t get it to work like that \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E and the Stock Modules I don\u0027t think are capable of achieving it.  I am happy to be wrong if someone can point me in the right direction!\n\u003C/p\u003E\n\u003Cp\u003E\nStopping and starting manually isn\u0027t ideal I don\u0027t think.\n\u003C/p\u003E\n\u003Cp\u003E\nSo any hints or configs that people would know of? Peace.\n\u003C/p\u003E\n"}]}