{"TopicId":167047,"ForumId":44,"TopicTitle":"A ninth planet... or just a rogue star?","CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2017-10-30T17:17:50Z","PageNum":1,"Articles":[{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2017-10-30T17:17:50Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://arxiv.org/abs/1710.09455\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://arxiv.org/abs/1710.09455\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe study the gravitational effects of two celestrial (sic) bodies on a typical object of the Kuyper Belt. The first body is a kuyperian object itself with fairly large eccentricity and perihelion but with a large mass, about 16 times the mass of the Earth. The second body is a star whose mass is 30% - 50% of the mass of the sun that passes by our solar system at a speed between 25 km/sec and 100 km/sec and at a distance of closest approach between 0.05 and 0.5 light year. As a measure of the perturbations caused by these bodies on the light kuyperian object, we analyse its eccentricity. \u003Cstrong\u003EWe find that the effects due to the passage of the wandering star are permanent in the sense that the eccentricity of the kuyperian object remains anomalous long after the passage of the star. \u003C/strong\u003EThe same is true of the heavy kuyperian object: it can perturb greatly the orbit of the lighter kuyperian object, which leads to a permanent, anomalous eccentricity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2017-10-30T18:18:54Z","Content":"\n\u003Cp\u003E\nNeither nor.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not an observation but a model calculation based on the assumption that this WISE J072003.20-084651.2 numerical monster passed our system close (1ly) some 70.000y ago. \u003Cs\u003EIt might help explaining the orbit of the hypothetical planet 9 should it be discovered one day.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWas that correct, i only had 2min to check ?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: took a little more time: not the orbit of planet 9, but the orbits if Sedna and the likes as an alternative to planet 9 being the perturber. But they conclude that the couple Wise \u0026amp; Wise passed too far away to have a lasting influence in Sedna and the likes. If it had passed 0.25ly or closer ....\n\u003C/p\u003E\n\u003Cp\u003E\nSo planet 9 is still in the game as a perturber of the piece among Sedna (and the likes).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-30T18:38:33Z\u0022 title=\u002210/30/2017 06:38  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 30, 2017\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JucheJuiceMan","CreatedById":182417,"CreatedDateTime":"2017-10-30T18:25:03Z","Content":"\n\u003Cp\u003E\nSo some amazing person was at our front door?\n\u003C/p\u003E\n"}]}