{"TopicId":167083,"ForumId":69,"TopicTitle":"S.A.S. Issues in general","CreatedByName":"Ian Luedke","CreatedById":182526,"CreatedDateTime":"2017-10-31T18:13:54Z","PageNum":1,"Articles":[{"CreatedByName":"Ian Luedke","CreatedById":182526,"CreatedDateTime":"2017-10-31T18:13:55Z","Content":"\n\u003Cp\u003E\nS.A.S. Issues...\n\u003C/p\u003E\n\u003Cp\u003E\nEverubody knows that in versions 1.3.0 and downwards there is a major glitch, one that everybody dreads... the famous S.A.S. Wobble glitch that occurs when you have too tall of a rocket. I was just wondering has this been fixed (because I have not played on K.S.P. 1.3.1 due to a broken computer, you can see my other post if you have knolage about building pc’s)? And if it has not been fixed, how do you get around the glitch, I found that if you put something to control your rocket closest to the engines than it will fix the glitch, but that is expensive, inconvenient, and it makes K.S.P. Rocketry harder than it needs to be. So:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/167072-what-is-the-best-ksp-for-pc-setup/\u0022 rel=\u0022\u0022\u003EP.C. Question form/post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way to fix the S.A.S. wobble glitch that occurs for tall rockets without adding a control point near the engines?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-31T18:16:55Z\u0022 title=\u002210/31/2017 06:16  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 31, 2017\u003C/time\u003E by Ian Luedke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2017-10-31T19:34:59Z","Content":"\n\u003Cp\u003E\nHi Ian. I think the issue you are referring to is caused by the rocket flexing. This can usually be fixed by enabling \u003Ca href=\u0022https://i.imgur.com/TZpyS3r.png\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Advanced Tweakables\u0022 in the main settings menu\u003C/a\u003E, then right clicking the engine at the bottom the stack and clicking the button that says \u0022autostrut\u0022 until it says \u0022root part\u0022. This will make an invisible strut go right down the centre of your craft, hopefully reducing that unwanted flex. You can also try rigid attachments, which I believe is also one of the advanced tweakables.\n\u003C/p\u003E\n"}]}