{"TopicId":167162,"ForumId":20,"TopicTitle":"A bit of a dilemma...","CreatedByName":"Dman1791","CreatedById":103062,"CreatedDateTime":"2017-11-03T21:18:52Z","PageNum":1,"Articles":[{"CreatedByName":"Dman1791","CreatedById":103062,"CreatedDateTime":"2017-11-03T21:18:52Z","Content":"\n\u003Cp\u003E\nSo, I\u0027ve installed lots of mods. Always have been a heavy modder, probably always will be. However, I\u0027ve run into a bit of an annoying (If not game-breaking) problem.\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m unsure what triggers it, but certain craft I build refuse to load into the editors (\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E). Upon trying to load a vessel into the editor, be it from a flight revert or loading from within the editor or even just going into the building while such a craft is currently being edited, the game hangs. It doesn\u0027t crash, because there is no output.log. There\u0027s no crash folder at all. I left it open for half an hour to see if it was just REALLY slow, but it didn\u0027t help. Each and every time I have to kill KSP with task manager and then never load the vessel again, at least not in an editor. It works just fine if I load from the launchpad or runway. I\u0027d imagine it would be due to a mod affecting the editor in some way, or something like \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E. Any ideas what type of mod or specific mod might cause this?\n\u003C/p\u003E\n\u003Cp\u003E\nList o\u0027 mods: \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nArc Aerospace Wyvern capsule\n\u003C/p\u003E\n\u003Cp\u003E\nB9 and B9 procedural wings\n\u003C/p\u003E\n\u003Cp\u003E\nCommunity Tech Tree\n\u003C/p\u003E\n\u003Cp\u003E\nEditor Extensions Redux\n\u003C/p\u003E\n\u003Cp\u003E\nExtraplanetary Launchpads\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJanitor\u0027s Closet\n\u003C/p\u003E\n\u003Cp\u003E\nRPM\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Foundries (Just the adjustable gears)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Stats\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKW Rocketry Rebalanced\n\u003C/p\u003E\n\u003Cp\u003E\nMSI (This one\u0027s not the issue, I expected it was but I have tested this one)\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb2\n\u003C/p\u003E\n\u003Cp\u003E\nMk2 Expansion\n\u003C/p\u003E\n\u003Cp\u003E\nMFT\n\u003C/p\u003E\n\u003Cp\u003E\nProcedural Parts (Starwaster branch)\n\u003C/p\u003E\n\u003Cp\u003E\nRealchute (It\u0027s gone a bit funky and not made its usual parachute category, and they aren\u0027t in utilities either, but meh, I put them in a custom group)\n\u003C/p\u003E\n\u003Cp\u003E\nREPOSoftTech (I think this came with the updated TACLS)\n\u003C/p\u003E\n\u003Cp\u003E\nTAC Life Support\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Alarm Clock\n\u003C/p\u003E\n\u003Cp\u003E\nTweakScale\n\u003C/p\u003E\n\u003Cp\u003E\nKSPIE\n\u003C/p\u003E\n\u003Cp\u003E\nWaypoint Manager\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAny help would be appreciated. As stated, there are no logs to look at, since the process doesn\u0027t actually crash, just hangs.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-11-06T10:51:10Z","Content":"\n\u003Cp\u003E\nThe typical process of diagnosing such a thing is to split your mod list in half. Then try to replicate the issue first with one half of your mods, then with the other half.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the error reoccurs in neither: test with three quarters\n\u003C/p\u003E\n\u003Cp\u003E\nIf the error reoccurs in both: test with quarters\n\u003C/p\u003E\n\u003Cp\u003E\nIf the error reoccurs in one half: split that half into halves again, repeat\n\u003C/p\u003E\n"}]}