{"TopicId":167137,"ForumId":32,"TopicTitle":"Sherdas Kerman, RIP","CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-11-03T03:29:02Z","PageNum":1,"Articles":[{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-11-03T03:29:02Z","Content":"\n\u003Cp\u003E\nSo I had a few hours between times on my alarm clock, and I looked into my mission ribbons from FinalFrontier. \n\u003C/p\u003E\n\u003Cp\u003E\nI had a red tag by one of my pilots.\n\u003C/p\u003E\n\u003Cp\u003E\nTurns out, I had sent this pilot alone to the mun, to plant a flag for a misson, and had a probe piggy back on his rocket, carrying an orbital scanner. \n\u003C/p\u003E\n\u003Cp\u003E\nApparently, I burned out of mun orbit, and burned down for a re-entry trajectory, then forgot to set the time on my alarm clock. Since his periapsis was around 25km he died when I failed to pay attention to him.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am bummed about this error. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat would you do? continue on, or page through the savegames and find him still alive?\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-11-03T04:02:47Z","Content":"\n\u003Cp\u003E\nWell, fist thing, I\u0027d got into \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E\u0027s settings and make sure to turn on \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E-change alarms (which are off by default).\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, I\u0027d go on about my business as if this never happened.  Kerbals are available in \u0022seemingly unlimited supply\u0022 as the official description says.  They are born/hatched/cloned/whatever simply to be menial labor for the few things probes can\u0027t do by themselves, such as fixing flat rover wheels.  They\u0027re totally expendable.  Treat them as such.\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2017-11-03T09:08:40Z","Content":"\n\u003Cp\u003E\nIt all depends on the way you\u0027re playing this game.  Some folks like to play without respawns or resets -- \u0022if they die, they die.\u0022  Others like to \u0022edit out\u0022 the bad parts, and would obviously go back to a save before the omission -- and then grumble their way through redoing all the other burns and maneuvers they had done before the fatal moment.\n\u003C/p\u003E\n\u003Cp\u003E\nStill others would delete the save in disgust.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no wrong way to play KSP, as long as you\u0027re having fun.\n\u003C/p\u003E\n"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2017-11-03T21:43:20Z","Content":"\n\u003Cp\u003E\nI should complete this by saying what I did.\n\u003C/p\u003E\n\u003Cp\u003E\nI decided I\u0027d see how much I\u0027d lose, if I went back and tried to correct the mistake. I saved at that point, and loaded my savegame from when I sat down after coming home from work It turned out at that point, he was still alive.\n\u003C/p\u003E\n\u003Cp\u003E\nSo all I had to redo was complete a docking mission (I\u0027d already docked, just needed to transfer a kerbal) undock those ships, and set their \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E shift from Minmus to Kerbin, Skip checking on my synchonous orbit of Minmus because I already knew the sector wasn\u0027t under me yet, and it\u0027s set to pop a new alarm for the next periapsis, go through re-entry with Sherdas, and then re-land Jeb and his lander with 6 tourists on the Mun.  Not bad at all.\n\u003C/p\u003E\n"}]}