{"TopicId":167146,"ForumId":16,"TopicTitle":"Jool braking","CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T11:55:27Z","PageNum":1,"Articles":[{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T11:55:27Z","Content":"\n\u003Cp\u003E\nInterplanetary speed , think i saw 9000ms at jool burn\n\u003C/p\u003E\n\u003Cp\u003E\nIm 14 days out of jools periaps. (can warp back but since i have many ships its a lot of extra work)\n\u003C/p\u003E\n\u003Cp\u003E\ngot 2000dV sience/relay sattelite with no heatshield. \n\u003C/p\u003E\n\u003Cp\u003E\nI manage to catch jools orbit via areobrake and burn. \n\u003C/p\u003E\n\u003Cp\u003E\nBut i always end up with to little \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E left to manuver. \n\u003C/p\u003E\n\u003Cp\u003E\nI see some talk about gravity assist to brake but i cant find the correct one. \n\u003C/p\u003E\n\u003Cp\u003E\nHow do i brake in jools system without using up all \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E ? \n\u003C/p\u003E\n\u003Cp\u003E\nDoes not matter if i end up on any other planet. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-03T21:09:05Z\u0022 title=\u002211/03/2017 09:09  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 3, 2017\u003C/time\u003E by bjerrang\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-11-03T13:12:20Z","Content":"\n\u003Cp\u003E\nGenerally, gravity assists near Jool use Tylo.  This is because Tylo has high gravity but without an atmosphere, so it has all of the mass needed to warp your trajectory but none of the re-entry heating.  This allows you to get down nearly to the surface, and if you need to supplement your assist with a burn, you get the most out of the burn there, as well.  Unfortunately, since you\u0027re only two days from Jool periapsis, you may be too close to get efficiently the assist you want--though you may be able to get an assist on the trip out; don\u0027t forget that.\n\u003C/p\u003E\n\u003Cp\u003E\nIn order to get a good assist, you need to approach Tylo from behind:  that is,  your approach to Tylo must be from Tylo\u0027s retrograde side.  To get the most from the assist, you want Tylo to warp your trajectory as close to 180 degrees as possible; however, while it is important, your angle of approach is less important than your angle of exit.  It is more important that your exit vector from Tylo\u0027s sphere of influence be exactly tangent and retrograde with respect to Tylo\u0027s orbit.  The reason for this is because getting an exit vector that is tangent to Tylo\u0027s orbit allows you to more easily get additional encounters for additional assists.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you cannot use Tylo, you can get a gravity assist from Laythe, but Laythe has an atmosphere and a much smaller sphere of influence; it will \u003Cem\u003Enot\u003C/em\u003E be ideal.  Vall provides a small amount of help but not enough, and the outer moons cannot help you at all.\n\u003C/p\u003E\n"},{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T13:33:18Z","Content":"\n\u003Cp\u003E\nDo you have a photo of the manuver , then i might see it more clearly .\n\u003C/p\u003E\n\u003Cp\u003E\nOn the photo below i tired , but how do en entry from \u0022behind\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-03T14:53:09Z\u0022 title=\u002211/03/2017 02:53  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 3, 2017\u003C/time\u003E by bjerrang\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T14:51:40Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022YXsrPis.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/YXsrPis.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T15:23:27Z","Content":"\n\u003Cp\u003E\nTried again . came in more \u0022backwards\u0022 But still i needed a 1100dV burn to catch jool system and an insane 69days to apoapsis. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/3dER7g2\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/3dER7g2\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-11-03T15:27:35Z","Content":"\n\u003Cp\u003E\nAh!  This explains it.  There are a couple of things wrong with your approach:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nYou\u0027re coming to Tylo from the side.  I can tell by the fact that the blue line of your orbit is coming from Jool\u0027s direction to the left of the picture:  for an ideal transfer, you\u0027ll need to approach from Tylo\u0027s retrograde, which would be the bottom of this picture.  That being said, you have other encounters that I cannot see; the line through Tylo\u0027s sphere of influence ought to be dull orange, not purple, if Tylo is your next encounter.  Since I don\u0027t have a larger picture, I cannot predict how your other encounters will affect this one, so I will refrain from saying more about this approach than to add that you may already be too committed by how far you are in the Jool system to do anything about it, so you may need to learn to live with it.\n\u003C/li\u003E\n\u003Cli\u003E\nYou enter Tylo\u0027s sphere of influence from its prograde side.  You can see this from where the dotted purple line begins (in the upper middle of the picture:  the circle-with-an-arrow is the escape point and the blank end is the entry point).  You get a close encounter with Tylo (10 km isn\u0027t a bad altitude) but the problem is that the trajectory is almost straight through Tylo\u0027s sphere of influence.  This gives you little to no assist.  What you want is to keep the exit point where it is, but try to get an encounter that has your entry point in nearly the same place:  that is, you want Tylo\u0027s gravity to warp your trajectory back on itself.  That may not be possible with the orbital speed you have, so instead, it will probably take multiple assists, a burn, or a combination of burns and assists to shed your excess velocity.  You may also consider taking your Tylo periapsis even lower; that will warp your trajectory more.  In every case, it is okay to enter Tylo\u0027s sphere of influence from the side so long as you exit retrograde:  retrograde exits \u003Cem\u003Ealways\u003C/em\u003E assist a capture.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nEdited to add:  69 days to apoapsis is not insane if you came into the Jool system insanely fast; the important part is to get captured into Jool orbit.  Refinements can come later, \u003Cem\u003Eafter\u003C/em\u003E you know that your ships aren\u0027t going to fly into interstellar space.  Also, an apoapsis that is 69 days away gives you a great place to make substantial adjustments to your periapsis (and subsequent Tylo encounters) for a minimum of your fuel reserve.\n\u003C/p\u003E\n\u003Cp\u003E\nEdited again:  It is more important to \u003Cem\u003Eleave\u003C/em\u003E Tylo\u0027s sphere of influence \u0027backwards\u0027 than to enter it \u0027backwards\u0027.  This is because leaving Tylo correctly will always take away from the amount of delta-V you need to capture, but leaving Tylo incorrectly can \u003Cem\u003Eadd\u003C/em\u003E to the burn.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-03T15:35:14Z\u0022 title=\u002211/03/2017 03:35  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 3, 2017\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T18:24:17Z","Content":"\n\u003Cp\u003E\nCan someone make a simple drawing of this , i still don understand how i should approach tylo or exit. \n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-11-03T19:40:06Z","Content":"\n\u003Cp\u003E\nTry this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gallery/qBiem\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/qBiem\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-03T19:44:37Z\u0022 title=\u002211/03/2017 07:44  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 3, 2017\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bjerrang","CreatedById":180617,"CreatedDateTime":"2017-11-03T20:06:48Z","Content":"\n\u003Cp\u003E\nThink i understand some now. Here is a entry from behind.  Ill try to adjust that i will exit from behind now.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225IXRtCo.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/5IXRtCo.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"}]}