{"TopicId":167280,"ForumId":39,"TopicTitle":"Should Bill Be A Badass Too? (Alternative Title Bill\u0026#039;s Folly)","CreatedByName":"The Flying Kerbal","CreatedById":171547,"CreatedDateTime":"2017-11-06T22:34:59Z","PageNum":1,"Articles":[{"CreatedByName":"The Flying Kerbal","CreatedById":171547,"CreatedDateTime":"2017-11-06T22:34:59Z","Content":"\n\u003Cp\u003E\nThose Kerbals... honestly, you can\u0027t turn your back on them for five seconds without them getting into some mischief.  Take yesterday for example...\n\u003C/p\u003E\n\u003Cp\u003E\nIt was a quiet weekend round at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, no major missions were active and most of the staff were enjoying the fine weather away from the complex with family and friends.  Not Bill though, he had been locked away in his office for weeks without revealing to anyone what he was up to.  Not being seen by his fellow Kerbals, food left outside his door remaining untouched, not a sound emitting from behind that locked door got them all worried... just what was he up to??\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the original four, nobody would ever have called Bill a badass, he certainly wasn\u0027t Mr. Personality like Jeb who just loves being in the spotlight, images plastered all over the press etc.  Bill was never interested in this and tended to shun the cameras.  So what happened yesterday was totally out of character, resulting in tons of publicity and possible disciplinary procedures being enacted against him.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat he did was this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tCtvjyd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/tCtvjyd.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bill\u0027s Folly\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe had been arguing for months that the KSA should look into the possibility of a Single Stage To Orbit (\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E) launch vehicle, but nobody seemed particularly interested.  They were more than satisfied with the present range of rockets which had been provided by Flying Deathtraps Rocketry and other private contractors.  Bill was adamant though, the cost of launching payloads into space could be drastically cut if a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E could be developed which would reenter the atmosphere, be recovered and refurbished, and then reused for further missions.\n\u003C/p\u003E\n\u003Cp\u003E\nRealising he was bashing his head against a brick wall, which doesn\u0027t really hurt a Kerbal because of its particularly solid skull, he disappeared into his office, and there he stayed!  Most people thought he was just huffing at not getting his way, nobody suspected he was working on something which would see his future in the KSA in jeopardy, and the entire organisation left with egg all over its face.\n\u003C/p\u003E\n\u003Cp\u003E\nHe had planned it very well, knowing this particular weekend would see few Kerbals about, Bill had secretly gathered together the not inconsiderable amount of materials and components required to build his experimental \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E.  It had been quietly assembled in a dark and secluded corner of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E without drawing anyone\u0027s attention, with the help of the small number of fellow \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E enthusiasts Bill had managed to recruit.  At dawn on Sunday, they secretly assembled at the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, opened the doors and started the slow process of rolling their masterpiece  - now named \u0022Bill\u0027s Folly\u0022 - out to the launchpad.  As it inched towards the final launch position, Bill raced into the changing room to get into his spacesuit.\n\u003C/p\u003E\n\u003Cp\u003E\nStrapped into the small capsule on top of his creation, Bill went through the final checklist before launch while his collaborators manning the necessary consoles and control panels in mission control, nervously watched the countdown edge towards zero...\n\u003C/p\u003E\n\u003Cp\u003E\n...A bright flash followed an instant later by an earsplitting roar tended to suggest that the countdown might have finally reached 0:00:00, a feeling reinforced as the entire mission control complex shook and vibrated as the shockwave of the engines erupting into life bounced and echoed all over and around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  \u0022Liftoff\u0022, shouted one of Bill\u0027s buddies, to be followed almost immediately by \u0022Towweeeer Clearrrrr\u0022!  Even with the noise and violence of the rocket engines directly beneath him, Bill couldn\u0027t help but point out that there wasn\u0027t in fact a tower to clear, urging everyone in mission control to keep calm and not get overly excited.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226XZiYDp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/6XZiYDp.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Towweeeer Clearrrrr\u0022!\n\u003C/p\u003E\n\u003Cp\u003E\nEven at 2/3 throttle, the seven huge \u0022Reliant\u0022 engines rapidly propelled the vehicle skywards, consuming an extortionate amount of fuel in the process.  Struggling to keep the vessel under control, as it reached a speed of 75m/s Bill leaned over in his seat (they hadn\u0027t managed to \u0022borrow\u0022 proper controls for their clandestine activities) to try to initiate something resembling a gravity turn.  Slowly ever so slowly Bill\u0027s Folly started to tilt in a roughly easterly direction, out over the ocean...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nZSJFNH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/nZSJFNH.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bill leaned over in his seat...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAs the rocket\u0027s velocity rapidly increased, keeping the vehicle on course was proving more and more difficult.  Everyone involved knew that if Bill\u0027s Folly\u0027s heading should wander even slightly off the prograde marker before its altitude reached 45,000 meters, the whole vessel would instantly go into an unrecoverable flip and Bill would be forced to pull the abort string (remember, no proper controls).  With a supreme effort and not without skills that would have impressed even Jeb, Bill managed to wrestle the vessel into keeping pointing prograde (just!) until it reached the altitude he knew would see the danger of flipping come to an end.  \u0022OK Bill, you should be safe for orbit now\u0022 radioed mission control, \u0022Yes, she\u0027s much more stable and easy to control now,\u0022 answered Bill, \u0022fuel slightly lower than expected but within safety margins, electric charge at maximum, cabin pressure holding at 5.5, I am go for orbit!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229W5Qh9J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/9W5Qh9J.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022I am go for orbit!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWatching closely, mission control was tasked with informing Bill when to shutdown the engines once his \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E had reached around 72,000 meters.  \u0022OK Willie, you now need to get your sideways speed up a bit, level off and floor it mate.\u0022 came the instruction.  \u0022Roger, I will now go horizontal and throttle up  to maximum to increase my lateral velocity.\u0022 came the reply, and Bill leaned over on the very edge of his seat to tilt the rocket right over towards the horizon.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hBniubj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/hBniubj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022...level off mate.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe seven powerful engines effortlessly pushed the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E. to the 72K mark, and Bill got the message for engine shutdown a very few seconds after \u0022levelling off\u0022.  It had proven to be no easy job to keep the speed of the ascent of the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E under control, and the engines were quiet for only a few seconds before he again was told to reignite them for orbit insertion.  The burn should have lasted four seconds, but Bill overran by about 1/5 of a second and the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E ended up at well over 100K, although the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E was at a much more acceptable 72.5K.  As the cheers from mission control came over the radio, Bill couldn\u0027t help but break into a loud cheer himself, having finally realised his dream of using a single stage to lift a payload into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dlRtOAF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/dlRtOAF.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022 Bill overran by 1/5 of a second\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHaving made orbit, the next procedure was to get back down again.  Bill dipped the fuel tanks (you didn\u0027t think he had proper fuel gauges, did you?) and nervously did a quick calculation on a snack wrapper.  \u0022What\u0027s your fuel like up there Bill\u0022, came a well timed message from the ground.  \u0022Yes, I\u0027m just checking that now\u0022, answered Bill.  With the struggle to control Bill\u0027s Folly during the flight through the lower atmosphere and now the overrun of the engines as he entered orbit, Bill realised that getting back was going to be marginal at best.  The original plan had been to reduce the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to below zero, for a landing as close to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E as possible, but now the fuel to do so just wasn\u0027t there.  \u0022OK mission control, I am unable to complete the deorbital burn as planned, I will burn off all remaining fuel at \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E. and attempt to reduce my \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. sufficiently to reenter the atmosphere.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You could always get out and push Willie\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022To save weight I didn\u0027t bring a jetpack for EVA.  I will now begin a manoeuvre to point retrograde in preparation for deorbit burn\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeez mate, you\u0027re half an orbit away from \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E, chill out, relax, enjoy yourself up there... have a beer on us\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n Ignoring the suggestion from mission control, Bill engaged the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to help align the vessel retrograde in readiness for reentry.  It took only a few seconds before this was complete and the vessel now sped sideways around Kerbin, altitude climbing as Bill\u0027s Folly orbited around towards the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eLgnNnE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/eLgnNnE.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022...the vessel now sped sideways...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nTime went by, and beneath the cheering and celebrating, a note of tension had crept into the communications between Bill\u0027s Folly and the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  The fuel situation was now on everyone\u0027s mind, it only had to reduce the height of the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. by about two thousand meters to insure some kind of landing, but the small amount of fuel left couldn\u0027t guarantee even this!\n\u003C/p\u003E\n\u003Cp\u003E\nThe seconds rolled into minutes and as the time for the burn approached, the celebrations were slowly replaced by quietness, this fuel situation was potentially serious.  Mission control was to give Bill a final countdown to the burn... tensely a voice came over the radio, \u0022Right Bill, engine start in 5... 4... 3... 2... 1... ZERO!\u0022  Suddenly the calm that had encased Bill\u0027s Folly since entering orbit was shattered as for less than a second the engines fired off the remaining fuel at fuel throttle.  Almost immediately after starting, they went silent for the last time; \u0022That didn\u0027t take long\u0022, Bill said tensely over the radio, \u0022what\u0027s my \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We\u0027re just checking that now Bill, standby... \u0022It\u0027s all good Bill, your \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. has dropped to under 40K, we\u0027ll stick the kettle on!\u0022, said a relief filled voice and Bill could also be heard blowing out a long loud breath over the radio.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QMwIMGA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/QMwIMGA.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s all good Bill... we\u0027ll stick the kettle on!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nNow came the most dangerous part of the mission, the reentry.  Bill\u0027s Folly quickly started to lose altitude as its pilot armed the parachute system.  An emergency procedure could be activated which would jettison the entire booster section from the command module, and now the plan to have a little fuel left to burn a second before landing wasn\u0027t possible, it was very much on the cards Bill would be forced to use it.\n\u003C/p\u003E\n\u003Cp\u003E\nPlunging down to around 35K and the fiery heat of reentry became visible to Bill as he looked up through the window.  Using the engines as heat shields to absorb the worst of what the atmosphere could throw at the still hypersonic vessel, Bill knew if it should start to deviate off retrograde now, he could be in for a very bad time.  And just then it did start to do just that.  Try as he might, Bill just couldn\u0027t stop the vessel slowly swing away from the retrograde vector, and he could find the heat building up in the command module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QHKn5lj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/QHKn5lj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Using the engines as heat shields\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I can\u0027t keep her properly aligned Bill yelled into the radio.  It\u0027s looking bad up here, temperature\u0027s building and I\u0027ve no way of keeping her retrograde.  I must have miscalculated somewhere, I knew I shoulda put new batteries in that damned calculator.  It\u0027ll take a miracle to get outta this one guys!\u0022  Even as he finished speaking, the sound of something exploding could be heard over the radio, followed two seconds later by another equally as violent.  \u0022Here\u0027s goes, she\u0027s breaking up... something\u0027s exploded... can\u0027t tell what.  Wait a minute, this can\u0027t be right... hey guys, she\u0027s aligning herself back on the retrograde vector.  Cabin temperature dropping, velocity one nine double oh\u0022.  But opening the champagne would have been premature, Bill\u0027s ordeal wasn\u0027t over just yet.  \u0022Mission control, she\u0027s wandering off retrograde again.  Temperature building... G Force increasing... time for another miracle...\u0022.  More explosions could be heard, but this time no reassuring voice came over the radio at mission control.  \u0022I\u0027m still tracking something\u0022, said the radar operator, \u0022she must be still intact.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bill, come in Bill... can you hear me buddy?\u0022  Nothing... dead silence answered the message from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  Long faces full of worry and concern stared at each other as fear gripped everyone in mission control; maybe this sneaky illegal launch wasn\u0027t such a clever idea after all?\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bill can you hear me Bill, waiting for your response...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hello, hello mission control... Bill\u0027s Folly here, chute\u0027s just deploying in drogue mode, sorry \u0027bout that, I guess I musta passed out with the G Forces.  I don\u0027t know how but I\u0027m still in one piece.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022r2Y1RKO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/r2Y1RKO.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022...chute\u0027s just deploying in drogue mode.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWith the seven parachutes acting as brakes stopping the returning spaceship from smashing into the ocean at a velocity which would still be close to the speed of sound, Bill noticed it dropping fast until it settled at around 34m/s.  The chutes however had still to fully open, which would reduce the velocity further, the question now was by how much?  With no fuel left in the tank and the last second burn impossible, everything depended on how efficiently those seven pieces of cloth would be able to counter the gravity pulling Bill\u0027s Folly inexorably down towards the ocean.\n\u003C/p\u003E\n\u003Cp\u003E\nAt 500 meters, Bill was subjected to yet more shaking as the parachutes finally opened fully.  Staring intensely at the gauge, Bill willed it to fall below 7m/s, the maximum the engines could withstand before exploding.  Down it tumbled, 15... 14... 13... the deceleration suddenly slowed down significantly, but still the needle in the gauge continued to fall towards the 7.  \u0022Velocity six point two!\u0022 roared a voice over the radio at mission control, \u0022Mission successful, it works guys, we have a fully functional \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E on our hands!\u0022  The cheers echoed around the entire \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E complex, and it took some time for them to realise that Bill - and Bill\u0027s Folly - now needed recovering. \n\u003C/p\u003E\n\u003Cp\u003E\nSplashdown was nothing special...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qCFnjgL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/qCFnjgL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Velocity six point two!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIt was the explosions during reentry that saved Bill\u0027s life.  As Bill\u0027s Folly slammed through the atmosphere and started to drift out of alignment, the intense heat blew off two winglets on the bottom of the vessel.  This changed the airflow which pulled the ship back on the retrograde vector.  However this was only temporary, the vessel again started drifting off retrograde, this time in the opposite direction.  Again two more winglets exploded once more changing the airflow and putting the vessel back into the correct attitude, this time permanently.  Bill lost conscience because of the intense G Forces being generated by all the swinging and aerobraking, regaining his senses just in time to see the parachutes deploying in drogue mode.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022E3dxVcW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/E3dxVcW.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Splashdown was nothing special...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n Unfortunately for Bill and his conspirators, the powers that be were not impressed with his little joyride; they\u0027ve been suspended on full pay and awaiting an enquiry into their actions.  However I\u0027m told from sources well placed in the KSA that both Gene and Wernher are going to speak up on their behalf and ultimately they\u0027ll probably be rewarded for their actions that day.  Wernher has also said he\u0027ll take another look at \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u0027s as clearly they do offer huge potential although much more development and research would be needed to make them a viable launch system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-07T00:49:43Z\u0022 title=\u002211/07/2017 12:49  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 7, 2017\u003C/time\u003E by The Flying Kerbal\u003C/strong\u003E\n\u003Cbr\u003ESpelling Mistakes... :(\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-11-08T22:16:54Z","Content":"\n\u003Cp\u003E\nLiterally steering a rocket by the seat of his pants? Yep - I\u0027d say he\u0027s a badS alright! Heck - I can\u0027t even balance on a Wii Fit board long enough to play a decent game of Hawt Virtual Snowboarding IV (or whatever it\u0027s called). I tip my hat to Bill.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn a serious note - nice story! Really enjoyed your laid back flight controllers. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"JK_Kerbineer","CreatedById":180871,"CreatedDateTime":"2017-11-09T18:08:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223212722\u0022 data-ipsquote-contentid=\u0022167280\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510007699\u0022 data-ipsquote-userid=\u0022171547\u0022 data-ipsquote-username=\u0022The Flying Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/6/2017 at 5:34 PM, The Flying Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Ethe powers that be\u003C/strong\u003E were not impressed with his little joyride\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJeb must have been a little jealous.\n\u003C/p\u003E\n"}]}