{"TopicId":167242,"ForumId":70,"TopicTitle":"Camera and GUI Haywire - OSX","CreatedByName":"XMaramena","CreatedById":182624,"CreatedDateTime":"2017-11-05T20:52:48Z","PageNum":1,"Articles":[{"CreatedByName":"XMaramena","CreatedById":182624,"CreatedDateTime":"2017-11-05T20:52:48Z","Content":"\n\u003Cp\u003E\nI remember this being the reason I gave up playing KSP on my iMac a year or so ago, and it seems the bug hasn\u0027t been fixed yet. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E (but also sometimes while flying an active craft as well), the buttons are rarely clickable (they highlight, but clicking has no effect, sometimes it helps to hold the mouse button down for a few seconds, sometimes it doesn\u0027t), the scroll bar on the parts panel seems to get stuck to the pointer and not be able to click off it, the camera randomly spins and changes angles without warning, it\u0027s basically impossible to build anything. As soon as you line a part up (after managing to get it clicked and created in the first place) the camera starts spinning on its own. If it spins to the right, sometimes holding down the right arrow button for 3-5 seconds will stop it, but it\u0027ll start spinning again after a few seconds. And if you somehow manage to be lucky enough for the camera to stay still for a moment, then you can\u0027t place a part because clicking on the attachment point has no effect and it just drags around with the pointer. Posted this on the Modded Installs section since I have a couple of addons, but this problem persists with a clean install, with every update, doesn\u0027t seem to have anything to do with mods.\n\u003C/p\u003E\n\u003Cp\u003E\nHas anyone else encountered this problem?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOS Sierra 10.12.16\n\u003C/p\u003E\n\u003Cp\u003E\nLate 2015 27\u0022 iMac\n\u003C/p\u003E\n\u003Cp\u003E\n3.2GHz i5\n\u003C/p\u003E\n\u003Cp\u003E\n8GB RAM\n\u003C/p\u003E\n\u003Cp\u003E\nAMD R9 M390 2GB\n\u003C/p\u003E\n\u003Cp\u003E\nKSP version 1.3.1.1891 (OSXPlayer)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ratchet Hundreda","CreatedById":169443,"CreatedDateTime":"2017-11-09T01:03:49Z","Content":"\n\u003Cp\u003E\nIf you have the issue on stock install i would advise making a post about the issue on the unmodded thread as well.\n\u003C/p\u003E\n\u003Cp\u003E\nAs i know Kerbal Engineer Redux is known to cause mouse click issues in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E back in the day, i\u0027m not sure if they fixed the issue and if they did, did it include the fix for OSx as well.\n\u003C/p\u003E\n\u003Cp\u003E\nI also recall reading about many Apple products having issue with registering mouse clicks properly which is related to a control chip malfunction. You should read into that as well although i don\u0027t know if you encountered the issue in case of other programs on your device.\n\u003C/p\u003E\n"}]}