{"TopicId":16760,"ForumId":32,"TopicTitle":"Educational Licenses","CreatedByName":"AtomicEdge","CreatedById":39962,"CreatedDateTime":"2012-08-13T12:25:42Z","PageNum":1,"Articles":[{"CreatedByName":"AtomicEdge","CreatedById":39962,"CreatedDateTime":"2012-08-13T12:25:42Z","Content":"\n\u003Cp\u003EHey guys, so I work at Secondary School in England, and I was wondering if you were planning any bulk licensing for Education at any point in the future? I know that the game itself isn\u0027t Educational, but it certainly gives students the basic ideas of forces and gravity, and it would make a good lesson introduction and/or reward task.\u003C/p\u003E\u003Cp\u003EAnyway, I am sure that other people in education would feel the same, but most school will only buy software that has bulk licenses.\u003C/p\u003E\u003Cp\u003EIf not, I assume that there wouldn\u0027t be a problem with using one install on a computer/projector to a class of students?\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-08-13T12:29:35Z","Content":"\n\u003Cp\u003EI would contact Squad directly from one of the emails listed on the main \u003Ca href=\u0022http://kerbalspaceprogram.com/contact.php\u0022 rel=\u0022external nofollow\u0022\u003EContact\u003C/a\u003E page.\u003C/p\u003E\u003Cp\u003EYou\u0027re more likely to get a better response than here on the forums.\u003C/p\u003E\u003Cp\u003EAs far as buying a single copy and projecting the screen, I don\u0027t think there\u0027s any problems with that. It\u0027s still one copy on one CPU which is what the license allows.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"AtomicEdge","CreatedById":39962,"CreatedDateTime":"2012-08-13T12:30:00Z","Content":"\n\u003Cp\u003EOkay so I just had a look at the FAQ on the website...\u003C/p\u003E\u003Cp\u003EIt says:\u003C/p\u003E\u003Cp\u003EI WANT TO USE KSP FOR A SCHOOL PROJECT, MUSEUM, OR ANOTHER EDUCATIONAL RELATED AFFAIR, MAY I? \u003C/p\u003E\u003Cp\u003EYes, the KSP Team encourages \u0022Space Education\u0022, letting us know about it and giving us credit would be greatly appreciated, though. If your project would require you to buy a whole lot of licenses, please Contact us to discuss it.\u003C/p\u003E\u003Cp\u003ESo I guess I will get in contact! Good to know!\u003C/p\u003E\n"},{"CreatedByName":"LukeTim","CreatedById":4138,"CreatedDateTime":"2012-08-13T12:35:48Z","Content":"\n\u003Cp\u003EOh, man... I wish I was a student at that school. Lucky kids.\u003C/p\u003E\n"},{"CreatedByName":"khenness","CreatedById":18973,"CreatedDateTime":"2012-08-13T13:00:37Z","Content":"\n\u003Cp\u003EIf you\u0027re looking to teach students about gravity, I\u0027d definitely recommend this fun little flash game \u003Ca href=\u0022http://www.nowykurier.com/toys/gravity/gravity.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nowykurier.com/toys/gravity/gravity.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2012-08-13T13:11:59Z","Content":"\n\u003Cp\u003EIn this year Hong Kong public exam , one of the question is about orbital operations.\u003C/p\u003E\u003Cp\u003EIf I have never play KSP ,I think I am not able to answer that question...\u003C/p\u003E\n"}]}