{"TopicId":167994,"ForumId":16,"TopicTitle":"How does KSP calculate orbit lines?","CreatedByName":"TheVortexian","CreatedById":183132,"CreatedDateTime":"2017-11-27T19:11:03Z","PageNum":1,"Articles":[{"CreatedByName":"TheVortexian","CreatedById":183132,"CreatedDateTime":"2017-11-27T19:11:03Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to recreate a KSP-like game in Java, and I have no idea how KSP calculates Apoapsis, Periapsis, etc. when your ship is moving in space.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-11-27T23:01:37Z","Content":"\n\u003Cp\u003E\nWelcome to the forums. Just so long as you assume that there is only one gravitational influence on a ship, there are closed-form solutions for converting from (x, y, z, dxdt, dydt, dzdt) to the standard Keplerian Orbital Parameters.\n\u003C/p\u003E\n\u003Cp\u003E\nHave you looked at wikipedia? Are you a math whiz who knows everything there is to know about quaternions?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2017-11-28T11:53:09Z","Content":"\n\u003Cp\u003E\nThis website has a bunch of equations you are going to need \u003Ca href=\u0022http://www.braeunig.us/space/orbmech.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.braeunig.us/space/orbmech.htm\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-11-28T16:40:52Z","Content":"\n\u003Cp\u003E\nAlso, this doesn\u0027t directly answer your question... but if you want to see lots and lots of actual \u003Cem\u003E\u003Cu\u003Ecode\u003C/u\u003E\u003C/em\u003E for calculating orbital parameters, it\u0027s worth looking at the \u003Ca href=\u0022https://github.com/MuMech/MechJeb2/tree/master/MechJeb2\u0022 rel=\u0022external nofollow\u0022\u003Esource code for MechJeb\u003C/a\u003E, which (like every mod, and unlike the source code for KSP) is publicly posted.  Lots of good stuff in there.  It\u0027ll give you a feel for the kind of code you\u0027ll need, even if it doesn\u0027t have the actual literal stuff you\u0027re looking for.  Basically, look for any file there that has \u0022orbit\u0022 or \u0022orbital\u0022 in the file name.\n\u003C/p\u003E\n"}]}