{"TopicId":16796,"ForumId":16,"TopicTitle":"Solar powered engines?","CreatedByName":"mkn","CreatedById":27453,"CreatedDateTime":"2012-08-13T20:08:27Z","PageNum":1,"Articles":[{"CreatedByName":"mkn","CreatedById":27453,"CreatedDateTime":"2012-08-13T20:08:27Z","Content":"\n\u003Cp\u003EHey all, this is my first post, but I\u0027ve been playing and lurking the forum for a few months.\u003C/p\u003E\u003Cp\u003EI\u0027ve found lots of mods with ion engines, batteries, and solar panels--the panels have a meter for \u0027power generation\u0027, so they don\u0027t seem to be just decoration. I\u0027m wondering if there is a mod, or combination of mods, that will allow the solar panels to recharge the batteries, so I can build long range, multipurpose spaceships.\u003C/p\u003E\u003Cp\u003EI\u0027ve searched the forum, and I\u0027ve found posts that seem to say this is impossible in the current version of the game--as well as posts that seem to imply people are already doing this.\u003C/p\u003E\u003Cp\u003EI know I can edit the part files for infinite fuel and so forth, but I like the challenge of balancing engines and components.\u003C/p\u003E\u003Cp\u003EIf this is impossible, I\u0027d still like to know for sure. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-13T20:12:05Z","Content":"\n\u003Cp\u003EHi mkn, and welcome to the KSP community, I hope you have a great time here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for the engines and stuff, there is an add-on called Dynasat that can do a lot of this I think, I\u0027ll find you the link.\u003C/p\u003E\u003Cp\u003EHere is \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/10224-0-15-Parts-Dynasat-Satellites-and-Solar-Panels-new-parts!-%28rel-0-6%29-Jun-11?highlight=dynasat\u0022 rel=\u0022external nofollow\u0022\u003EDynasat\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/10094-0-15-0-16-Electrical-Energy-Plugin-v1-3-tweaked-VB-parts-a-bit-%28Jun-27%29?highlight=dynasat\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here is an energy plugin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-13T20:17:46Z\u0022 title=\u002208/13/2012 08:17  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 13, 2012\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mkn","CreatedById":27453,"CreatedDateTime":"2012-08-14T05:33:41Z","Content":"\n\u003Cp\u003EHmm... I\u0027ve got two energy plugins (Electrical Energy and Powertech), and an adapter plugin from Powertech running right now, with parts from at least three or four modders, and I can\u0027t seem to do anything useful with the solar panels from any of them--I think I\u0027ve tried pretty much every combination of battery, solar panel, and engine that makes sense.\u003C/p\u003E\u003Cp\u003EI do have ion engines to run off battery power with parts from Powertech, Electrical Energy, and Mechanical Mouse, but recharging the batteries eludes me.\u003C/p\u003E\u003Cp\u003EIs anyone actually running a solar electric system on a ship design right now? If so, I\u0027d appreciate an outline of whatever mods you\u0027re using. It\u0027s possible I\u0027ve just gotten too complicated--maybe there is a simpler solution out there.\u003C/p\u003E\u003Cp\u003EIf not, I can wait til it shows up in a future update.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-08-14T05:37:07Z","Content":"\n\u003Cp\u003EMMI\u0027s batteries recharge, as long as you don\u0027t run the batteries all the way out.\u003C/p\u003E\n"},{"CreatedByName":"yanphi","CreatedById":26761,"CreatedDateTime":"2012-08-14T05:53:46Z","Content":"\n\u003Cp\u003EHere is a link to download the rechargeable batteries.\u003C/p\u003E\u003Cp\u003EJust download satellite version 1.0 pack and you will get everything you need.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/13692-0-16-Mechanical-Mouse-Industries?highlight=Electrical\u002BEnergy\u002BPlugin\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/13692-0-16-Mechanical-Mouse-Industries?highlight=Electrical\u002BEnergy\u002BPlugin\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"mkn","CreatedById":27453,"CreatedDateTime":"2012-08-14T05:54:41Z","Content":"\n\u003Cp\u003EDear Everybody:\u003C/p\u003E\u003Cp\u003EI am now watching the fuel meter on my MMI batteries slowly tick up, and feeling a bit silly--this was actually the first set of solar panels I\u0027ve downloaded since upgrading to .16.\u003C/p\u003E\u003Cp\u003EVery cool--and thanks for the help--I\u0027ll post some stuff in the ship exchange in gratitude!\u003C/p\u003E\n"}]}