{"TopicId":168238,"ForumId":18,"TopicTitle":"Eagle project","CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-12-05T15:55:05Z","PageNum":1,"Articles":[{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2017-12-05T15:55:05Z","Content":"\n\u003Cp\u003E\nHey guys, I\u0027m working on my eagle project, and I was wondering if any of you had any tips or suggestions on how to complete/go about it. I have a project idea (Pasture restoration) for a local museum; I don\u0027t anticipate that it will take any longer than a couple weekends based on my info.\u003Cbr\u003E\nI know some of you guys are eagle scouts too, which is why I\u0027m asking \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPlus, I heard the paperwork was a nightmare (Exaggeration?)\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-12-06T02:10:01Z","Content":"\n\u003Cp\u003E\nPaperwork is only a nightmare if you have to waste months on it. \n\u003C/p\u003E\n\u003Cp\u003E\nStart the paper work now. There\u0027s no reason you can\u0027t start it. The first page of the proposal is just contacts anyway. \n\u003C/p\u003E\n\u003Cp\u003E\nBridges are always good. The one I built for my project was 6 feet wide and 24 feet long... But do what you want, as long as it involves considerable planning and can demonstrate your leadership skills, you should be alright.\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2017-12-06T23:13:38Z","Content":"\n\u003Cp\u003E\nPaperwork isn\u0027t a problem if you document \u003Cem\u003E\u003Cstrong\u003Eeverything\u003C/strong\u003E\u003C/em\u003E. As my scoutmaster told me, remember the six P\u0027s: Proper Planning Prevents Piss-Poor Performance.\n\u003C/p\u003E\n\u003Cp\u003E\nYou should check out the Eagle Scout workbook, located here: \u003Ca href=\u0022https://www.scouting.org/scoutsource/boyscouts/advancementandawards/eagleworkbookprocedures.aspx\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.scouting.org/scoutsource/boyscouts/advancementandawards/eagleworkbookprocedures.aspx\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t forget that it\u0027s \u003Cstrong\u003Eyour \u003C/strong\u003Eproject: not your Scoutmaster\u0027s, not your Mom\u0027s, not your Dad\u0027s, and you only do it once. Own it! Your Eagle Board will want you do show leadership. Forget how to cut wood, hammer nails, or rake leaves- that\u0027s not your job anymore. You\u0027re in charge of making sure that everything goes with as few hiccups as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nI assigned group leaders to on different tasks who I briefed on what I needed them to do. Trust your helpers, but don\u0027t be afraid to check up on them and correct mistakes (but do so gently- EDGE is your friend here).\n\u003C/p\u003E\n\u003Cp\u003E\nI have much more I could write, but not so much time. If you want to talk more, feel free to send me a PM!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2017-12-08T02:52:39Z","Content":"\n\u003Cp\u003E\nI heard that 100personhours is the recommended amount of work. Also Excel helped a lot with recording labor.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-12-08T03:08:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223238239\u0022 data-ipsquote-contentid=\u0022168238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221512701559\u0022 data-ipsquote-userid=\u0022150339\u0022 data-ipsquote-username=\u0022insert_name\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, insert_name said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI heard that 100personhours is the recommended amount of work. Also Excel helped a lot with recording labor.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcel is great for that, and useful for costs.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no minimum, as far as I\u0027m aware. 100 man hours is certainly a lot. Record everything. Talking to people about it, writing, and even email writing time. It\u0027ll add up FAST.\n\u003C/p\u003E\n"},{"CreatedByName":"HeliosPh0enix","CreatedById":181527,"CreatedDateTime":"2017-12-08T05:01:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223238247\u0022 data-ipsquote-contentid=\u0022168238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221512702534\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcel is great for that, and useful for costs.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no minimum, as far as I\u0027m aware. 100 man hours is certainly a lot. Record everything. Talking to people about it, writing, and even email writing time. It\u0027ll add up FAST.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlso remember to count travel time to and from meetings/worksites.  My one friend in my troop completely undercounted his hours because he didn\u0027t include that.  Also, if you are doing a proposal to, say, a township committee of 10 people for 30 minutes, you tally 30 minutes for each person because they took time out of their day to listen to you.  If you meet with people, take notes, not just so you don\u0027t forget, but also to put in your binder that you send to Council. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are worried about your project being inadequate, talk to your Scoutmaster and maybe your Council rep.  The more involved of a Scout you are, the more they may expect from you.  Things vary from Council to Council and Troop to Troop, but there are some trends that I have noticed, having been in 4 troops across the U.S.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-03-11T00:52:31Z","Content":"\n\u003Cp\u003E\nOut of curiosity, how\u0027s this going? If you\u0027ve completed it, how close are you to completing the other requirements?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-03-11T06:05:42Z","Content":"\n\u003Cp\u003E\nThe biggest thing (In my experience) is that they look for leadership.  It could be the coolest project ever, but if you do all the labor yourself, it really doesn\u0027t mean anything.  Make sure you put yourself in a position where you are organizing and leading the work groups on the project. \n\u003C/p\u003E\n\u003Cp\u003E\nI built a small amphitheater/chapel at a YMCA park near me.  Deck with a screen on the back, benches for seating.  I \u0027marketed\u0027 it as a chapel to the various churches I hit up for funding.  I think it cost around $1200 (in the early 90\u0027s).  One of the groups that donated money was the \u0022Happy Hookers\u0022.   That was an odd check to cash.   They were a knitting and bible study group at a Methodist church.\n\u003C/p\u003E\n\u003Cp\u003E\nMy brother\u0027s project was expanding mine.  He added more seating, fixed up the trail leading to it some, and added a really nice fire pit.    But due to time crunches, he had to move up his Eagle ceremony to shortly after the completion of the project (month or so after).    Apparently, not all the concrete in the fire pit had fully set yet, and they had a fire going.  It exploded during the ceremony, sending shrapnel everywhere.   They still gave him his Eagle.    \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-03-14T18:41:43Z","Content":"\n\u003Cp\u003E\nOh crap, I forgot to update this...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI actually finished most of it on Saturday!!! We weren\u0027t able to finish because the farmer was expecting us to be finished the following week, so he didn\u0027t bring the materials. My dad and I are going out this Saturday though.\u003Cbr\u003E\nAlso, I did a fence refurbishment instead (Same museum though), the process that it took to get there was ridiculous though. First it was \u0027build 25 brand new sections of fencing\u0027, then they figured I should just repair the one they already have, so now it was - replace a few posts/rails, \u003Cem\u003Ethen \u003C/em\u003Eit changed again less than 2 weeks before we started to \u0027Okay, just remove 20 years worth of debris (It actually only took a day to clear, but it was a lot), put in a new post, re-nail the cross bars, and tighten the wire fencing\u0027.\u003Cbr\u003E\nBut, it\u0027s almost complete, and my leaders say it\u0027s still valid.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-15T16:57:36Z\u0022 title=\u002203/15/2018 04:57  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 15, 2018\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"}]}