{"TopicId":168339,"ForumId":16,"TopicTitle":"Surprising fuel flow","CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-09T06:49:20Z","PageNum":1,"Articles":[{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-09T06:49:21Z","Content":"\n\u003Cp\u003E\nI haven\u0027t played for a couple of years and have just been getting back into it. I thought I\u0027d build a frame in the shape of a huge plus sign and put long legs on it. Then I\u0027d put some engines on the bottom of each leg. Fuel tanks would hang from the center of the plus sign. The lowest fuel tank would drop when its empty and then the next tank and the next. Asparagus staging. I\u0027d run fuel lines from the tanks to the engines but the lines wouldn\u0027t stretch for the twenty feet. I was then surprised to see that somehow fuel was getting to the engines without any lines. I haven\u0027t found a way to feed the fuel to the engines one fuel tank at a time. Its always draining all the tanks which foils my asparagus staging plans. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThis is the main question\u003C/strong\u003E.\u003Cstrong\u003E Is there a way to prevent the fuel from getting to the engines?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way for me to run fuel lines so that the engines do get fuel and they drain one tank at a time in the order that I want?\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way to make a wire frame base on which I can attach parts like fuel tanks, engines, command modules? The work I did with the wire frame was very tedious and there are lots of limits on attachment points. I don\u0027t know why Kerbal puts so many limitations on their parts like fuel lines. Why are they limited to short distances? Why do a lot of wire frames set up with attachments points on the ends but not the other sides?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-12-09T07:30:18Z","Content":"\n\u003Cp\u003E\nYes, I think there\u0027s a way to do this fairly easily.  KSP relatively recently came out with a feature called Fuel Flow Priority, which is great with things like this. \n\u003C/p\u003E\n\u003Cp\u003E\nFirst you will need to enable Advanced Tweakables in the options menu.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce that is done, you can right click on tanks (in either the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E or during a mission) and reassign a priority number.  \u003Cu\u003EHigher\u003C/u\u003E numbers burn first.  E.g., all tanks with priority 10 will burn out, then all tanks with priority 9, and so on.  The numbers only matter in this relative sense - so you can use 10, 9,8, or 100, 90, 80 and it will do the same thing.  You can also set negative numbers but, aside from being lower (and thus burning later) than positive numbers, these are not different.  The game tries to predict a fuel priority you might want based on its interpretation of your staging, but the results are spotty.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe other element to getting this right is crossfeed rules.  I assume you have decouplers between each of the stages you\u0027re intending to drop. You will want to right click each of these decouplers in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and select \u0022enable crossfeed.\u0022  This will allow fuel to flow up from the bottom tank towards the top one, in the order specified by the priority.  \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, the fuel lines.  You will \u003Cu\u003Enot\u003C/u\u003E need fuel lines from every tank to the engine, since fuel will be flowing through the decouplers to the top of the fuel stack.  If your frame has parts that do not allow fuel crossfeed (some girders, etc.), you may need one set of fuel lines, from the topmost tanks to the engine.  But if your frame has all parts that allow crossfeed, you may not even need those.  One of the best things about the fuel priority system is that it mostly eliminates the need for the weight, cost, mass, drag, ugliness, and hassle of fuel lines.  \n\u003C/p\u003E\n\u003Cp\u003E\nWhen in flight, you will probably have to right click your outermost tank and watch it to figure out when it\u0027s empty and ready to stage.  The regular fuel indicator in the corner is not great about figuring this stuff out yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for your other question on frames, I\u0027m not sure exactly what you\u0027re looking for. A screenshot of the issue would be helpful. To add attachment points, you can always use a Cubic Octagonal or similar small strut (these don\u0027t need to attach TO a node, but provide an extra node).  The \u0022not Rockomax micro-node\u0022 may  be of interest, since it adds a bunch of nodes at one.  You might also be able to find some helpful mods - for example, \u0022Near Future Construction\u0022 has a lot of girders and similar parts.  .  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-09T15:44:17Z\u0022 title=\u002212/09/2017 03:44  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 9, 2017\u003C/time\u003E by Aegolius13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-12-09T07:39:06Z","Content":"\n\u003Cp\u003E\nThere may be a couple of ways to do what you\u0027re suggesting, but first it\u0027s important to understand some basics of how KSP handles the fuel flow rules.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, some parts will allow fuel to pass through them while others do not, and some parts will allow you to toggle fuel flow through them on and off. Modular girder segments and octagonal struts for example will always allow fuel to pass along them to other attached parts. In fact, most parts in KSP allow fuel to go through them with some exceptions. The I-beams and structural panels however will not allow fuel to pass through them so if you want engines attached to I-beams to get fuel you will have to run a fuel line across instead. All of the docking ports will pass fuel by default, but right-clicking them will give you the option to disable fuel flow. In contrast, decouplers and separators will block fuel flow by default, but you can enable fuel flow in their right-click menu.\n\u003C/p\u003E\n\u003Cp\u003E\nWith those part connection rules in mind, all fuel tanks that have a connection to any engines within their same stage will all drain fuel together at the same rate by default. But this can be altered two different ways. If you have \u0022Advanced Tweakables\u0022 turned on you will have the option to adjust fuel flow priority. \u0022Advanced Tweakables\u0022 can be turned on from the main game settings menu. It adds an extra slider to any tank\u0027s right-click menu that shows the tank\u0027s fuel flow priority number. It will also turn on an option to show an overlay of the path that fuel is taking from each tank to the engines (or if you are right-clicking an engine it will tell you which tanks that engine is drawing from.)\n\u003C/p\u003E\n\u003Cp\u003E\nA different fuel flow priority number can be set for each tank. Within each stage the fuel will always drain from the tanks with the highest priority number to the lowest number. Remember, for fuel flow priority a lower number drains later -  \u003Cstrong\u003Elower is later.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe other option is to run fuel lines from one tank (or multiple tanks) to another tank in the same stage. As long as all tanks in that stage have the same fuel flow priority, then the fuel lines will pump fuel from whichever tank you first attached it to into the tank the other end is connected to. Be aware that those fuel lines are directional. They move fuel from the first end you attach to the second end you attach. All that\u0027s left to do is make sure that the last tank that receives fuel has a fuel connection to your engines.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-09T07:47:51Z\u0022 title=\u002212/09/2017 07:47  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 9, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2017-12-09T13:15:44Z","Content":"\n\u003Cp\u003E\n1. Open KSP\n\u003C/p\u003E\n\u003Cp\u003E\n2. Go to settings in main menu\n\u003C/p\u003E\n\u003Cp\u003E\n3. Enable advanced tweakables\n\u003C/p\u003E\n\u003Cp\u003E\n4. Go to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n5. Now you can set a priority of fuel consumption value by right clicking fuel tank. Higher number consumed first\n\u003C/p\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-10T04:26:13Z","Content":"\n\u003Cp\u003E\nI did it. Enabled advanced tweaks. Was impressed that Squad would create such a thing that shows a fuel diagram and lets you choose how the tanks get drained. It worked but needs work. I did find that my rather huge ship was quite uncontrollable with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. I even added a second \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E but still at the end of the solid boosters it went out of control. I didn\u0027t lose the ship, but it was spinning wildly and very difficult and fuel costly to bring under control. Annoying because the last eighth of the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s is where you go from 750 m/sec to 1500 m/sec even with instability. \n\u003C/p\u003E\n\u003Cp\u003E\nI had added a lot of fins on the whole thing, both as low down on the SRBs and high too. This smoothed out the ascent tremendously but still at the end it went nuts. Maybe a longer rocket? Maybe more weight at the top. I\u0027m surprised they don\u0027t have a way for you to see how the rocket changes as fuel burns. I\u0027m guessing the SRBs burn from the bottom to the top and so the rocket becomes too light on bottom whereas when burning liquid fuel the rocket gets to light at the top. Also, at the end of the SRBs I\u0027m leaning more. The \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E moves up and away from the force pushing up and leverage takes over. Gravity pulls down but now with the rocket leaning, gravity pulls down on the fulcrum of  The \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E of the whole thing shifts up a lot whereas the force pushing up stays low. When you go straight up, it doesn\u0027t matter that you\u0027re \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E and \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E are close together or far apart. Gravity pulls straight down to earth and straight through the center line of the rocket so it doesn\u0027t affect stability. when you lean the rocket the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is the fulcrum and the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECol\u003C/abbr\u003E is feet away and lower. The COG pulls down above the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E and this produces a lot of torque which is not very strong compared to the engines but the engines are not doing anything to correct this.\n\u003C/p\u003E\n\u003Cp\u003E\n I could put the engine on the side of the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E half way to the top. The \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E would stay more constant that way. My original idea was to put the engines near the top of the rocket so that they\u0027d be pulling it into space instead of pushing it but I lost focus on that by getting caught up in other matters. \u003Cem\u003EOh wait. No. I can\u0027t move the engines on an \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEven with engines mounted high, the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E will still shift up and as the rocket is angled the COG will still pull down if it is not centered on the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E. What you need is an engine that shifts up and down as the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E shifts. That would make the rocket much more stable. Also, I should pay attention to where the COG is at least when I build. I never even looked. \n\u003C/p\u003E\n\u003Cp\u003E\nThe other thing is that I don\u0027t really need a rocket this huge. I just want to build it, but I don\u0027t know how to make it maneuverable. I don\u0027t know if there is a way with Kerbal to make an engine that slides up and down as needed or if there is a way to control that. It\u0027d be cool to invent a program that does that and sensors to monitor changes in the rocket. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-12-10T06:15:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68474-chik-sneadlov/\u0026amp;do=hovercard\u0022 data-mentionid=\u002268474\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68474-chik-sneadlov/\u0022 rel=\u0022\u0022\u003E@Chik Sneadlov\u003C/a\u003E I\u0027m glad to see that your fuel flow is sorted out.\n\u003C/p\u003E\n\u003Cp\u003E\nSince you are trying to design a very unorthodox rocket it\u0027s difficult to guess what exactly might be causing your stability issues without seeing a screenshot of it. Rocket flight dynamics is not exactly the most intuitive field of study.\n\u003C/p\u003E\n\u003Cp\u003E\nBased on your description of when and how you lost control I\u0027m going to guess that you probably just have too much drag at the top of your rocket. All those structural parts can catch a lot of air and pull your rocket over. You already know that you need your center-of-mass closer to the nose and your drag at the tail. The easiest way to counteract a draggy nose is to put larger fins at the bottom.\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes using an engine with a high gimbal range can help, like the Vector engine. The vectoring can steer the craft back into the prograde direction and adds a torque to counteract the aero force. But it\u0027s a fine line to walk as you are just as likely to encounter oscillation if it over corrects and thrusting too hard will still cause flipping out.\n\u003C/p\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-10T08:03:27Z","Content":"\n\u003Cp\u003E\nI stabilized it some more by wrapping the lowest stage of the fuel tanks with six more huge fuel tanks and putting huge engines on each. They go off with the SRBs and I put in a lot of struts between the inner fuel tanks and the SRBs. Things went smoothly until seconds before the end of the SRBs, but it was no big problem. I have to try again with more aggressive turning because I ended up about 650Km out in space which is more than I need and took a lot of fuel to circularize.\n\u003C/p\u003E\n\u003Cp\u003E\nI notice I\u0027m not using the oxidizer in the tanks on any engines. I\u0027ve got those nuclear engines that aren\u0027t really nuclear and I\u0027ve got the huge orange engines. Why am I schlepping oxidizer all over the place if I\u0027m not using it? Would those ramjet engines with the great \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E use oxidizer or do they have to have air forced in from the atmosphere?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2017-12-10T08:25:33Z","Content":"\n\u003Cp\u003E\nThis was an issue a while ago, and I hadn\u0027t heard that they had fixed it, so it might still help.  Try turning off gimballing on engines above the center of mass, at one time they\u0027d steer in the opposite direction because they didn\u0027t realize they were above the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-12-10T20:08:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223240022\u0022 data-ipsquote-contentid=\u0022168339\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221512893007\u0022 data-ipsquote-userid=\u002268474\u0022 data-ipsquote-username=\u0022Chik Sneadlov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Chik Sneadlov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI notice I\u0027m not using the oxidizer in the tanks on any engines. I\u0027ve got those nuclear engines that aren\u0027t really nuclear and I\u0027ve got the huge orange engines. Why am I schlepping oxidizer all over the place if I\u0027m not using it? Would those ramjet engines with the great \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E use oxidizer or do they have to have air forced in from the atmosphere?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe nuclear engines don\u0027t need any oxidizer, they just use the liquid fuel portion of the tanks. They are only really meant for operation in a vacuum so I wouldn\u0027t recommend burning them at launch because they have little thrust and poor \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E efficiency in atmosphere. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E you can drain the oxidizer out of your tanks by right-clicking them and dragging the oxidizer portion of the fuel sliders to zero. Alternatively, you can design the vessel to use the tanks designed to only hold liquid fuel since they have a better wet/dry fuel weight ratio. The Mk1, Mk2, and Mk3 size profiles all have liquid fuel tanks but sadly there are none for the 2.5 diameter tanks.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Rockomax engines (the orange ones like the Skipper or Mainsail) will still need the oxidizer. Be sure to keep the oxidizer in the tanks you are using for the initial launch. You can drop them later.\n\u003C/p\u003E\n\u003Cp\u003E\nThe turbo ramjet engines are atmospheric jet engines only. They won\u0027t work in space not even with on-board oxidizer.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E parts menu be sure to right-click on the picture of the engines and you\u0027ll see a list of the fuel that engine requires. You\u0027ll also see the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E (fuel efficiency) rating for atmosphere and vacuum along with how much thrust you can expect from them in those situations.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds to me that part of your difficulties may be that your thrust is too high at launch. Remember, the SRBs will burn at full thrust until they burn out, but you can reduce their default thrust setting in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E before you launch the vessel. Try right-clicking them and turning down the thrust slider a little on those solid boosters before you launch next time. That will allow your nose to fall a little for a better gravity turn. It also reduces ram pressure through the atmosphere for less drag and allows you more steering control.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-10T20:17:22Z\u0022 title=\u002212/10/2017 08:17  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 10, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-15T10:49:41Z","Content":"\n\u003Cp\u003E\nI never noticed that you can adjust the thrust of SRBs. That\u0027s a great little tidbit. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2017-12-15T13:04:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223244864\u0022 data-ipsquote-contentid=\u0022168339\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221513334981\u0022 data-ipsquote-userid=\u002268474\u0022 data-ipsquote-username=\u0022Chik Sneadlov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Chik Sneadlov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI never noticed that you can \u003Cu\u003Eadjust the thrust of SRBs\u003C/u\u003E. That\u0027s a great little tidbit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat was a god send for me when I found it.\n\u003C/p\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2017-12-17T23:28:10Z","Content":"\n\u003Cp\u003E\nIf you have too much thrust another thing that works is to add a fairly large middle stage and then put full size airplane wings on the thrusters in place of fins. If your rocket gets tippy towards the end of the thrusters, put huge fins like airplane tail fins or airplane wings near the top of the rocket. You can mount them on decouplers so you can jettison the extra weight once you\u0027re in vacuum. \n\u003C/p\u003E\n\u003Cp\u003E\nA computer could model the change in center of mass and thrust as it happens. It could also tell you, with some calculations how the changes in \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E and \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E and ascent angle are affecting the flight. I\u0027m surprised Kerbal doesn\u0027t offer this kind of gizmo to let you know when to jettison stages and fins to optimize control of your rocket. Its probably on engineer redux and I just don\u0027t know what I\u0027m talking about. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}