{"TopicId":168890,"ForumId":32,"TopicTitle":"Space Atmospheric Flight Mod","CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-12-25T08:16:37Z","PageNum":1,"Articles":[{"CreatedByName":"RedPandaz","CreatedById":168757,"CreatedDateTime":"2017-12-25T08:16:37Z","Content":"\n\u003Cp\u003E\nHey is there a mod that adds some sort of atmosphere in space so you can fly around like an Airplane? [like in Star Wars?] I think that would be pretty cool ^^\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2017-12-25T08:57:43Z","Content":"\n\u003Cp\u003E\nummm... how would that even work?\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose you could just extend the atmosphere of planets to be ridiculously high... but you can ignore orbits at that point.\n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-12-25T09:34:21Z","Content":"\n\u003Cp\u003E\nWell, atmospheric flight in space would be just that: Atmospheric flight. And I don\u0027t know if it\u0027s even possible to edit the height of a stock planet\u0027s atmosphere, but I see 3 problems there already: 1- This is a video game and the height of the atmosphere might not be irreversibly tied to the behaviour of any craft at any given altitude. 2 - Even if that\u0027s the case u would have to make the atmospheres of all planets reach out so far that it\u0027s always dense enough for wings and control surfaces to work if u have any plans of flying all the way to other planets, much more so if u wanna use air breathing engines. And travelling to other bodies brings me to point #3 - time warp. Even just skimming through the last few atoms of the outer atmosphere of any body that has one forces physics warp. Even just flying to the Mun would take HOURS that way, let alone leaving Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and going interplanetary!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf anything, there should be a mod that simulates atmospheric flight by firing thrusters according to the change of an aircraft\u0027s orientation and prograde vector, which, btw, has also been done in the stock game by Scott Manley, albeit all manually:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XYPxJtra1ws?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"FrostedShoe","CreatedById":183418,"CreatedDateTime":"2017-12-25T11:52:12Z","Content":"\n\u003Cp\u003E\nIt\u0027s not just atmosphere you need to make it like star wars, it\u0027s no gravity too. You would also need to ignore heating effects and drag if you wanted any fun out of it.\n\u003C/p\u003E\n"},{"CreatedByName":"Atkara","CreatedById":169458,"CreatedDateTime":"2017-12-25T14:02:27Z","Content":"\n\u003Cp\u003E\nHaven\u0027t heard of such a mod. But:\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not atmosphere what you\u0027re after, but an inertia dampening \u0022system\u0022. You\u0027d also need something that calculates your craft\u0027s velocity in reference to the nearest celestial body. That is, so that you\u0027ll come to a relative, instead of an absolute stop -unless you\u0027d like to see how long it would take for the entire galaxy to leave you behind, if you opted for the latter \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s also the problem of how to get into orbit around a celestial body. I suppose you\u0027d need a system that tampers with your spacecraft\u0027s mass, so that you\u0027d enter into a synchronous orbit, at a much lower altitude than you\u0027d normally need. This, ensures a smooth atmospheric interface, without all the fireworks, usually coming with it.\n\u003C/p\u003E\n\u003Cp\u003E\nSince we\u0027ve reached this point, we could also add a hyperdrive, and the more I look at it, the more I seem to be describing Elite: Dangerous, without the \u0022dangerous\u0022 part (or at least, without most of it)\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2017-12-25T15:23:52Z","Content":"\n\u003Cp\u003E\nElite: Dangerous and other sci-fi games seem like a better bet. KSP was designed from the ground up as a Newtonian simulation game, without the \u0022space is made out of WD-40\u0022 that other games have.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile you could sort of hack it with Kopernicus configs to alter atmospheres, there are plenty of other games which were designed to do what you want.\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2018-02-01T22:06:51Z","Content":"\n\u003Cp\u003E\nInfinite fuel and an engine pointing straight down\n\u003C/p\u003E\n"},{"CreatedByName":"Wcmille","CreatedById":151345,"CreatedDateTime":"2018-02-03T03:07:37Z","Content":"\n\u003Cp\u003E\nI think this might work:\n\u003C/p\u003E\n\u003Cp\u003E\nTo experience atmospheric-like flight, set your craft to prograde and use \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E translation. This will change your prograde vector, which in turn, will change your direction. You should not turn, let your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E do the turning.\n\u003C/p\u003E\n\u003Cp\u003E\nThis will not be fuel efficient.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocketsciences101","CreatedById":182952,"CreatedDateTime":"2018-02-03T04:01:58Z","Content":"\n\u003Cp\u003E\nI\u0022ll put it this way... You better have LOTS of fuel because your orbit would always degrade so your left with a VERY horrible reentry and suborbital (I think it cant be called reentry anymore) flights and Orbiting Gilly? Forget it you would escape or crash because you can orbit at 15!? m/s so mark Gilly of the list.\n\u003C/p\u003E\n"}]}