{"TopicId":168846,"ForumId":16,"TopicTitle":"How to power MKS drills?","CreatedByName":"Hoddd9000","CreatedById":142572,"CreatedDateTime":"2017-12-24T11:00:28Z","PageNum":1,"Articles":[{"CreatedByName":"Hoddd9000","CreatedById":142572,"CreatedDateTime":"2017-12-24T11:00:28Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to set up some mining landers that use 1.25 nuclear reactors for power, since using solar will require arseloads of panels and will rule out night-time operation. The problem is, it seems to be impossible to satisfy the cooling needs of a reactor (generating only just enough for the drill) and the drill itself at the same time.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far, the... thing below is the only vehicle I have built that has managed to cool both. As soon as I disable one of the large radiators, the reactor\u0027s core temp begins to creep up, eventually shutting down.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tbn6aEe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/tbn6aEe.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI have NF electricity installed as well. How do I power this thing?\n\u003C/p\u003E\n"},{"CreatedByName":"Daniel Prates","CreatedById":172769,"CreatedDateTime":"2017-12-24T11:29:24Z","Content":"\n\u003Cp\u003E\nThe picture is not very clear... post a daytime shot! Still, am I right to assume that all that cooling is just for one drill \u002B one converter \u002B one reactor? There could be something wrong with your install,  it always takes me much less cooling to have all of that working.\n\u003C/p\u003E\n\u003Cp\u003E\nUnless... the reactor generates a variable ammount of EC. You can set it to produce less EC output in the part menu,  and the resulting heat will be less too. Arent you just using the reactor at full power? Because that will deplete nuclear fuel much faster and generate surplus charge that you cant store (besides the heat).\n\u003C/p\u003E\n"},{"CreatedByName":"dangerhamster","CreatedById":146944,"CreatedDateTime":"2017-12-24T20:29:59Z","Content":"\n\u003Cp\u003E\nPersonally that rig looks a tad unwieldy. Have you considered a shedload of batteries instead?\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-12-26T16:36:03Z","Content":"\n\u003Cp\u003E\nThis is being discussed in the NFE thread:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed2448370717\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155465-131-near-future-technologies-bugfix-updates-nov-28/\u0026amp;do=embed\u0026amp;comment=3248751\u0026amp;embedComment=3248751\u0026amp;embedDo=findComment\u0022 style=\u0022height:295px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nIn short, there\u0027s a stock heat allocation bug, it is known, and it is being addressed.  There was a workaround discussed that involved using MKS\u0027s distributed power mechanic, but that may not work in 1.3.1, and of course it would require you to send a separate power module to run your drills.\n\u003C/p\u003E\n"}]}