{"TopicId":168905,"ForumId":16,"TopicTitle":"SSTO rocket to Mun","CreatedByName":"TommyLee","CreatedById":183833,"CreatedDateTime":"2017-12-25T21:11:36Z","PageNum":1,"Articles":[{"CreatedByName":"TommyLee","CreatedById":183833,"CreatedDateTime":"2017-12-25T21:11:36Z","Content":"\n\u003Cp\u003E\nHello guys. I had that idea to transfer that main base module to mun along with 4 side windows. I wanted to achieve this with rockets and possibly \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTo\u003C/abbr\u003E type. So far today I tried with 7 different itterations, mostly with heaviest engines arround and largest tanks, but all of them failed. be it in fuel, thrust or lack of control in space. Now i got kinda puzzled. So what I would need nice idea how could new guy land main base module to mun. I admit I am not good in math, so I went hard way. Anyway I would like tips be it in pics, fuel tanks, engines and base config. Anyway. looking forward for any ideas.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTommy\n\u003C/p\u003E\n"},{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2017-12-26T00:48:31Z","Content":"\n\u003Cp\u003E\nI have literally no idea, what you are talking about, except you failed to send something to the Mun. Images do help a lot, since what you might consider to be a problem could in fact be caused by something totally different.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally speaking, the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E maps of the Kerbol system do help a lot. They basically tell you how much fuel to pack in your rockets. See here for example:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed80859137\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/87463-13-community-delta-v-map-26-sep-29th/\u0026amp;do=embed\u0022 style=\u0022height:212px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nFurthermore you need to know what amount of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E your rocket does have. It is given by the Tsoilkovsky equation:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.m.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou could calculate that, which is a nice exercise  (I propose you do it at least once for one of your rockets in order to understand the equation) or you could install a mod like \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E or Mech Jeb which give you the data (and other features).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, I have been away from the forums for about a quarter year, so I don\u0027t know the latest tutorials - you might need to search one on your own or someone else has to help out by pointing a link to some rocket stability / \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E vs \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E introduction or explanation.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re more the TV guy -  Scott Manley offers a lot of physical explanations and background knowledge in a easy to grasp way. His videos are generally of good quality, although, there are other sources as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2017-12-26T01:12:51Z","Content":"\n\u003Cp\u003E\nTommy Lee,\n\u003C/p\u003E\n\u003Cp\u003E\n The key to all of it is in the math. Don\u0027t shy away from it and don\u0027t be afraid of it. It will give what you need to know to make it happen, or let you know if you\u0027re wasting your time.\n\u003C/p\u003E\n\u003Cp\u003E\nIn this case, going single stage to the Munar surface is approximately 6km/sec \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E. Moreover, you have to do it with at least an engine that will give you 1.4:1 t/w from Kerbin\u0027s surface. Can it be done with a conventional rocket?\n\u003C/p\u003E\n\u003Cp\u003E\nUsing a conventional booster that has reasonable t/w from Kerbin\u0027s surface, vacuum Isp will be in the neighborhood of 320s. The equation looks like this:\n\u003C/p\u003E\n\u003Cp\u003E\ne^[6k/(320*9.81)] = e^ (1.91) = 6.76:1 wet to dry mass ratio. This is getting perilously close to the absolute maximum of 9:1 wet- to- dry ratio of infinitely large tanks, so it\u0027s probably not worth pursuing. Digging deeper...\n\u003C/p\u003E\n\u003Cp\u003E\n 6.76:1 wet/dry ratio translates to (6.76-1)/6.76 = 85.2% of your launch mass is fuel. .852* 9/8 = 95.9% of your launch mass is fuel and tanks. This leaves only 4.1% of your launch mass to engines and payload; not gonna happen.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can reduce engine mass and cheat the Isp by going with a spaceplane. It *can* be done this way. But since that would involve flying a giant airplane to the Mun, the \u003Cem\u003Esensible \u003C/em\u003Esolution is to stage. 2000-ish m/sec per stage. 2 stages to orbit, last stage to the Munar surface. Or alternatively, 2 stages to Munar intercept and last stage to circ and landing. This will make a much more economical and manageable mission.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-27T02:11:23Z\u0022 title=\u002212/27/2017 02:11  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 27, 2017\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-12-26T05:26:19Z","Content":"\n\u003Cp\u003E\nMoving to Gameplay Questions.\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2017-12-26T12:56:30Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E is difficult.  Staging is far more efficient.  Beyond that, we can\u0027t do much of anything without pictures -- a picture of your base, along with some indication of its mass, would be extremely helpful.\n\u003C/p\u003E\n"},{"CreatedByName":"TommyLee","CreatedById":183833,"CreatedDateTime":"2017-12-26T15:44:57Z","Content":"\n\u003Cp\u003E\nHello all. I used that DeltaV table and made my monster ( if I am correct i made total overkill for mun, but it worked. mechjeb took it to orbit and executed hoffman transfer, circularization in mun for me. Next steps I was able to do my myself. I changed orbital plane to mach it with my existing module on mun (that was cheated but ..what can you do \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ) to practise precise landing. that went well but on landing I think I started to land to early so i landed a bit early of my landing spot. Anyway, on pic you can see crane on top wich dropped base for \u0022small altitude\u0022 and that, thankfully, went preety well. So i am happy. 2 starting bases on Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nfor Mun base I used this mod.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133606-131-kerbal-planetary-base-systems-v158-18december-2017/\u0022 rel=\u0022\u0022\u003Ehttps://forum.kerbalspaceprogram.com/index.php?/topic/133606-131-kerbal-planetary-base-systems-v158-18december-2017/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nand here is picture of my monster on lounch pad along with engineer data. Not too preety but it worked. If I am correct thing had 4 stages, but I think i could do it without third (that one is hidden behind orange tanks).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://ibb.co/gHcUZm\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022mun_base_delivery_take2.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://preview.ibb.co/ipD3um/mun_base_delivery_take2.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo, next step is mun delivery of Base crane thingy that can carry this module to old one and hopefully connect it. I am still not sure how do you do that thou. I guess I need some kind of crane for Mun base anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nill keep you posted, if anyone is interested lol. I forgot to add that i did paid attention on DeltaV in engineer, so that must have helped. It is still confusing. i kinda expected somewhere total DeltaV of full rocket. I guess I missed that one.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-26T15:52:13Z\u0022 title=\u002212/26/2017 03:52  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 26, 2017\u003C/time\u003E by TommyLee\u003C/strong\u003E\n\u003Cbr\u003Epicture problems\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2017-12-26T19:21:16Z","Content":"\n\u003Cp\u003E\nTommy Lee,\u003Cbr\u003E\n I ran your problem through my spreadsheet. It says \u0022nope; can\u0027t be done in a single stage\u0022. Closest you could get would be 5,900 m/sec using 3 Rhinos per 2 tonnes of payload, but that would be silly. That monster would weigh 480 tonnes and cost $150,000.\n\u003C/p\u003E\n\u003Cp\u003E\nA more realistic conventional lifter (assuming 2t payload) would look like this:\n\u003C/p\u003E\n\u003Cp\u003E\nStage 1: 1 Skipper, 1 x200-32 \u002B 1 x200-8 (disposed of during launch)\u003Cbr\u003E\nStage 2: 1 Terrier, 1 fl-t800 \u002B 1 fl-t400 (disposed of while \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is still in atmosphere)\u003Cbr\u003E\nStage 3: 1 Spark, 1 fl-t800 (to the munar surface)\n\u003C/p\u003E\n\u003Cp\u003E\nThis would weigh 40t on the pad and cost about  $14,000 not including the payload.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2017-12-27T05:07:24Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111526-goslash27/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111526\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111526-goslash27/\u0022 rel=\u0022\u0022\u003E@GoSlash27\u003C/a\u003E: 6km/s is pretty high for a Mun transfer. I personally wouldn\u0027t do it in a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E, but the extra 800m/s you\u0027re alotting as a fudge factor is going to have a serious impact on whether it is possible or not. What\u0027re your numbers on a bare-bones flight?\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2017-12-27T10:56:46Z","Content":"\n\u003Cp\u003E\nfoamyesque,\n\u003C/p\u003E\n\u003Cp\u003E\n The extra fudge factor is for the munar landing. It\u0027s impossible to match the \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E allotment for that, especially if you want to land on a specific spot. I always double the requirement for landings on airless bodies.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the bare minimum (which can\u0027t actually be successful) I get these numbers:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E= 5,150 m/sec\n\u003C/p\u003E\n\u003Cp\u003E\nR\u003Csub\u003Ewd\u003C/sub\u003E= 5.16:1\u003Cbr\u003E\nM\u003Csub\u003Ef\u002Bt\u003C/sub\u003E= 90.7%\u003Cbr\u003E\nM\u003Csub\u003Ep\u002Be\u003C/sub\u003E= 9.3%\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a lot more workable, but still overkill. The best \u0022SSTML\u0022 option for a 2t payload would be the Mainsail. It would weigh over 100 tonnes and cost over $30,000.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a 3- stager with the same requirements, it\u0027d keep the same engines as the previous design, just less fuel. 31t at launch and about $12,500.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-27T11:30:27Z\u0022 title=\u002212/27/2017 11:30  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 27, 2017\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2017-12-27T13:44:15Z","Content":"\n\u003Cp\u003E\nSlashy,\n\u003C/p\u003E\n\u003Cp\u003E\nI felt those numbers were a little high since I tried very hard recently to return from the Mun with science in early career without ugrading \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or launchpad... and failed... so the numbers were quite fresh in my mind.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a 3-stage rocket, I was getting:\n\u003C/p\u003E\n\u003Cp\u003E\n- 3200 to orbit (72x73km)\u003Cbr\u003E\n- 860 to Mun 9km flyby\u003Cbr\u003E\n- 275 to circularise\u003Cbr\u003E\n- 12 to deorbit\u003Cbr\u003E\n- 565 to land.\n\u003C/p\u003E\n\u003Cp\u003E\n4900 m/s total from launchpad to landing. My main problem was I just couldn\u0027t get more than about 5400m/s out of 18 tons, so I could never make it back again.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course with an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is going to be lower and you\u0027ll never quite pare it down to those numbers, but I couldn\u0027t say how much more it needs. I\u0027m not a huge \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E expert.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-27T13:45:15Z\u0022 title=\u002212/27/2017 01:45  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 27, 2017\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2017-12-27T14:10:24Z","Content":"\n\u003Cp\u003E\nEh, a good suicide burn -- difficult to execute by hand, but with mod assistance plenty feasible -- can get pretty close to the ideal \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for a landing. Landing in a specific spot can be done basically free provided you inject into an inclined orbit directly (or, for marginally more, immediately on entry of the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E), it\u0027s just a matter of patience and time.\n\u003C/p\u003E\n"},{"CreatedByName":"TommyLee","CreatedById":183833,"CreatedDateTime":"2017-12-27T16:55:10Z","Content":"\n\u003Cp\u003E\nHehe. That is alot of new terminology for me and data. For now, I am happy that I can land on mun in \u0022aproximate\u0022 area and then try to make decent base with simple crane, wich i am planning to do today. I saw nice design on one youtube video. Like  half-tube I am guessing make of dirders or something like that , four wheels and some crane thing in middle attached on top, now, how is that working I have no idea, but I will research. Couple of solar panels and one probe and antenna should suffice for short range i hope. There are alot of new type of items nowdays in KSP from when i last saw this game. I still need to read more about it...like planes, drills, some ore stuff...But I got somethign to do right?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTommy\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}