{"TopicId":16964,"ForumId":32,"TopicTitle":"Possible Lagrangian points to be used?","CreatedByName":"Rizz","CreatedById":39763,"CreatedDateTime":"2012-08-15T10:28:03Z","PageNum":1,"Articles":[{"CreatedByName":"Rizz","CreatedById":39763,"CreatedDateTime":"2012-08-15T10:28:03Z","Content":"\n\u003Cp\u003EHello, KSP community!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Lagrangian_point\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Lagrangian_point\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI wasn\u0027t sure if these physics were already incorporated into the game, hence why I\u0027m not placing this in the challenges section of the forums. BUT, I was wondering if it was possible to securely occupy or even orbit a Lagrangian point?\u003C/p\u003E\u003Cp\u003EHere\u0027s my basic understanding of what Lagrangian points are(, for those who don\u0027t want to read the wall of text that is the wiki article in the link above). Lagrangian points are specific spots involving two body\u0027s of mass in which you can remain stationary in from your point of reference.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/e/ee/Lagrange_points2.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/e/ee/Lagrange_points2.svg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOccupying any of these green dots within the plane that they orbit should, in fact, provide a stationary position relative to both of those bodies (given that you have the correct lateral velocity to orbit the larger of the two bodies). This is simply due to the fact that the gravity from both bodies cancels out any would-be changes to your orbit, thus making it stationary.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHARD MODE:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt IS possible to \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Eorbit \u003C/em\u003E\u003C/span\u003Ea Lagrangian point. Occupying the point would be cake in comparison, considering that the plane of an ideal orbit of a Lagrangian point doesn\u0027t even contain the point itself. Because the gravitational pull of the larger body outweighs the other, it will have more of an influence on you than the smaller one the farther you are from the L-Point. In effect, the space in which you could orbit a Lagrangian point is in the shape of a bowl; the bottom of which being the Lagrangian point itself and the surface of that bowl spreading out from there towards the larger body occupying the space in which an orbit is achievable. If my attempt to make an accurate visualization on where you can do this failed, perhaps this article would suffice:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.scilogs.eu/en/blog/go-for-launch/2009-05-28/how-to-orbit-a-lagrangian-point\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.scilogs.eu/en/blog/go-for-launch/2009-05-28/how-to-orbit-a-lagrangian-point\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo, Kerbals... can it be done?\u003C/p\u003E\n"},{"CreatedByName":"mrxak","CreatedById":25597,"CreatedDateTime":"2012-08-15T10:51:17Z","Content":"\n\u003Cp\u003EI believe only L4 and L5 can be faked, but the physical model used by KSP doesn\u0027t allow true Lagrangian points.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-15T10:53:38Z\u0022 title=\u002208/15/2012 10:53  AM\u0022 data-short=\u002211 yr\u0022\u003EAugust 15, 2012\u003C/time\u003E by mrxak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rizz","CreatedById":39763,"CreatedDateTime":"2012-08-15T10:56:44Z","Content":"\n\u003Cp\u003EYeah, I was afraid of that. I remembered the orbits in the maps from space only take into account gravity coming from one mass at a single time. But still, if they could implement this feature in a future version of the game, that would be amazing. It would be one helluva challenge to achieve, even with mods.\u003C/p\u003E\n"},{"CreatedByName":"Tigga","CreatedById":31224,"CreatedDateTime":"2012-08-15T11:32:56Z","Content":"\n\u003Cp\u003EI\u0027m hoping for better craft/body interaction as well. I can\u0027t think of any technical reason why it shouldn\u0027t be possible, though it\u0027s going to be more computationally expensive to plot trajectories and calculate reference point changes, though I\u0027d expect it to be fine as these changes only have to be calculated for one craft, and this simplifies things greatly. Keeping large bodies on rails would be fine.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-08-15T11:45:10Z","Content":"\n\u003Cp\u003EIt is possible, but the system is unable to handle it without glaring inaccuracies. It could have been modelled with n-body physics, but it requires complex integration, which becomes exponentially more complex the more bodies you\u0027re taking into account. Most computers these days could not take the extra CPU load (which would be \u003Cstrong\u003Esignificant\u003C/strong\u003E).\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-08-15T11:54:24Z","Content":"\n\u003Cp\u003EI think people only really care about L1 and L2. They can probably be done as special case SOIs, but I don\u0027t see it happening.\u003C/p\u003E\n"},{"CreatedByName":"Neomatt","CreatedById":30294,"CreatedDateTime":"2012-08-15T11:55:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tigga\u0022 data-cite=\u0022Tigga\u0022\u003E\u003Cdiv\u003E I can\u0027t think of any technical reason why it shouldn\u0027t be possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/N-body_problem\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/N-body_problem\u003C/a\u003E ?\u003C/p\u003E\u003Cp\u003EOkay, if planets/moons stay on rails, it becomes more of a \u0022how different bodies interact with one ship\u0022, so the problem is kinda moot. But I\u0027m not sure how CPU-intensive planning a trajectory (with all bodies having different attraction at different points in time) could be.\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-08-15T12:32:36Z","Content":"\n\u003Cp\u003ELet me be clear, there is no real scientific problem with incorporating an N-Body version of the on-rails system, the CPU power required is easily supplied by a regular desktop CPU. I ran simulations of the kerbin system using an accurate, but relatively inefficient, 4th Order Runge-Kutta integrator - my simulation calculated at at rate of 30 days per second, that\u0027s 2-3 million times clock speed. It would do better to replace it with a symplectic integrator, which is more or less uses patched conics with perturbations applied, this would be faster still.\u003C/p\u003E\u003Cp\u003EHere\u0027s an example showing how minmus orbit wobbles due to the influence of Kerbol\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/9zLEys597PY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIf the plugin system ever supports replacing the on-rails calculation you can be sure I\u0027ll be in there making a proper calculator and making videos about low energy transfers using the interplanetary superhighway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-08-15T18:22:19Z","Content":"\n\u003Cp\u003ELagrange points have already been covered and answered by the development team on this forum. They can not be implemented with the current set up, and changing the set up to allow them would break too many other things. They are not going to happen.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2012-08-15T19:35:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022illectro\u0022 data-cite=\u0022illectro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHere\u0027s an example showing how minmus orbit wobbles due to the influence of Kerbol\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/9zLEys597PY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s... interesting.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf the plugin system ever supports replacing the on-rails calculation you can be sure I\u0027ll be in there making a proper calculator and making videos about low energy transfers using the interplanetary superhighway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have my blessing and i\u0027d be among the first to at least try it, but i think it would be quite a feat to run dozens craft on \u0027n-body rails\u0027 in fast-foreward without running into problems with accuracy/repeatability.\u003C/p\u003E\n"},{"CreatedByName":"Tigga","CreatedById":31224,"CreatedDateTime":"2012-08-15T20:16:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOkay, if planets/moons stay on rails, it becomes more of a \u0022how different bodies interact with one ship\u0022, so the problem is kinda moot. But I\u0027m not sure how CPU-intensive planning a trajectory (with all bodies having different attraction at different points in time) could be. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not really if you can determine the positions of the attractors as a function of the time, which you can if they\u0027re on rails. You could even make some further simplifications, neglecting masses if they\u0027re insignificant, which most of them are likely to be, and if you get down to one mass being significant you can go on rails again.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-08-15T21:11:34Z","Content":"\n\u003Cp\u003EWouldn\u0027t work -- there are far too many objects in the Kerbal universe even currently for this to work easily. You\u0027d have to play without timewarp because of the glaring inaccuracies it would otherwise produce, assuming you\u0027re correct in your explanation.\u003C/p\u003E\u003Cp\u003EI suggest you look up how an n-body physics simulation is calculated, because gravity work in 3 dimensions, and getting a solution for multiple bodies is ridiculously complex, involving (as I said before) complex integration, which is exponentially more complex the more bodies you want to take into account. I agree you could simplify it somewhat, but that\u0027s not easily possible without introducing inconsistencies.\u003C/p\u003E\u003Cp\u003ESeeing as we\u0027re getting further planets in 0.17, I suggest that unless you yourself can work out a method of calculating a n-body solution \u003Cem\u003Eeasily \u003C/em\u003Eand \u003Cstrong\u003Eaccurately\u003C/strong\u003E, there\u0027s no point discussing it. Even the patched conics system took HarvesteR a while to get his head around. Using the inbuilt n-body mechanics of PhysX (the physics engine) would force the team to remove timewarp completely, and it would still be rather complex. An alternate solution would have to be worked out, a new way to do it. At least, last time this was discussed, that\u0027s what I remember of Harv\u0027s conclusive answer.\u003C/p\u003E\n"},{"CreatedByName":"Tigga","CreatedById":31224,"CreatedDateTime":"2012-08-16T00:43:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI suggest you look up how an n-body physics simulation is calculated, because gravity work in 3 dimensions, and getting a solution for multiple bodies is ridiculously complex, involving (as I said before) complex integration, which is exponentially more complex the more bodies you want to take into account. I agree you could simplify it somewhat, but that\u0027s not easily possible without introducing inconsistencies.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not a n-body simulation that\u0027s being proposed though. N-body is bad because it scales with n squared (every body interacting with every other body). Splitting your bodies into planetary on-rails bodies (attract stuff, don\u0027t get attracted) and ship \u0022real\u0022 bodies (don\u0027t attract stuff, get attracted) and it now scales with n. Calculate the sum of the forces on a body (won\u0027t be more than 10 objects realistically, especially if you make approximations ignoring insignificant objects, and the maths is trivial) and apply them to the body. All this stuff is going to be trivial to compute.\u003C/p\u003E\u003Cp\u003EThe tricky bit is the time integration for projected trajectories. Most of the time your insignificant object sweep will pretty much give you one object, and you\u0027ll be on cubic rails, however when you\u0027re not forward stepping in time is potentially intensive. It\u0027s pretty hard to judge how much so until you\u0027ve actually done it. I\u0027ve little doubt it\u0027d be possible for \u0022free\u0022 motion, but having something that updates as you thrust would be a bit trickier. You\u0027d probably have to deal with a low quality projection while thrusting, which might not be ideal. It\u0027s the sort of thing I\u0027d feel I\u0027d have to implement to discover.\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-08-16T02:25:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI suggest you look up how an n-body physics simulation is calculated, because gravity work in 3 dimensions, and getting a solution for multiple bodies is ridiculously complex, involving (as I said before) complex integration, which is exponentially more complex the more bodies you want to take into account. I agree you could simplify it somewhat, but that\u0027s not easily possible without introducing inconsistencies.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suggest you ask someone who wrote N-Body integration code professionally and actually knows the limits of what\u0027s possible. Please stop perpetuating the myth that there is some fundamental computational problem that is beyond the capabilities of todays computers, I\u0027ve written simulations using \u0027toy\u0027 algorithms that are millions of times faster than real time and more accurate than the existing patched conics. There is no fundamental problem except a lack of time on the developers part, there are many more intersting things for them to devote their efforts to.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-08-16T07:25:08Z","Content":"\n\u003Cp\u003EWell, last I heard, the answer was \u0022it\u0027s not possible at this time\u0022, and that was not to do with time constraints. I apologise if there was a misunderstanding, but I wasn\u0027t intending to say it is beyond today\u0027s computers (although I realise it was poorly typed and I should \u003Cem\u003Enot\u003C/em\u003E have tried to be all science-y late at night... it ends badly, a lot of the time). Anyway. \u003Cem\u003EFrom memory\u003C/em\u003E, I believe the reason it could not be done was due to the fact that for KSP to remain an entertaining game, the \u003Cem\u003Etime-warp\u003C/em\u003E functionality must remain, and thus \u003Cem\u003En\u003C/em\u003E-body physics could not be used, as it is extremely difficult if not impossible to calculate \u003Cem\u003En-\u003C/em\u003Ebody physics at such a high rate of time warp without some sort of simplification resulting in errors in calculation that would make it pointless to be trying to be so accurate in the first place.\u003C/p\u003E\u003Cp\u003EBut hey, I\u0027m not the one working on it, and I\u0027d prefer to get an official statement on this (sigh, \u003Cem\u003Eagain\u003C/em\u003E) as to why it cannot be done at this point in time. Harv said something about it a while back, before the forum conversion, and I cannot for the life of me find it anymore.\u003C/p\u003E\n"},{"CreatedByName":"thesandbar","CreatedById":41697,"CreatedDateTime":"2012-08-26T01:52:40Z","Content":"\n\u003Cp\u003ESimple (in my book): Extend all present spheres of influences. Whatever\u0027s in \u0026gt;1 sphere will have n-body but only for the spheres it\u0027s in. It will seem realistic but it won\u0027t be =D\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-08-26T06:45:58Z","Content":"\n\u003Cp\u003EYou know, Kerbin\u0027s SoI is already inside Kerbol\u0027s (otherwise, it wouldn\u0027t orbit it). So extending SoI wouldn\u0027t help at all, since it would mean you can orbit Kerbin at altitudes where you should be orbiting Kerbol.\u003C/p\u003E\u003Cp\u003EAnd n-body aren\u0027t used because the patched conics allow for an instantaneous display of your trajectory with one simple calculation, while an n-body simulation would require to simulate an orbit very fast (and thus with less precision) with several thousands of steps.\u003C/p\u003E\n"}]}