{"TopicId":169654,"ForumId":16,"TopicTitle":"Calculation discrepancy in delta v","CreatedByName":"xlm","CreatedById":184114,"CreatedDateTime":"2018-01-16T16:18:02Z","PageNum":1,"Articles":[{"CreatedByName":"xlm","CreatedById":184114,"CreatedDateTime":"2018-01-16T16:18:03Z","Content":"\n\u003Cp\u003E\nWe probably all have seen the community delta v map. It says that to achieve low kerbin orbit you would need 3400 in delta v. So I tried to calculate that by hand, here\u0027s how: the increase in potential energy equals mgh (I\u0027m assuming constant g, in fact it would be even lower). The increase in kinetic energy is 0.5*mv^2. Assuming we are trying to achieve low orbit at 75km, the total delta v (calculated by sqrt(2*E/m)) would be about 2850m/s, and I didn\u0027t even use the rotation of kerbin itself.\n\u003C/p\u003E\n\u003Cp\u003E\nIn reality I was able to send rockets in low orbit with slightly less than 3400, but still way more than 2850. Granted that I didn\u0027t consider aerodynamic forces but how much could that be? So what am I missing? (And if it is air resistance, I\u0027d appreciate if you could provide some calculation on that)\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-01-16T16:56:19Z","Content":"\n\u003Cp\u003E\nYou have to include the gravity losses for the time it takes to reach a significant fraction of orbital velocity.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-01-16T17:52:45Z","Content":"\n\u003Cp\u003E\nxlm,\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s the atmosphere that makes it impossible to calculate precisely. For an airless body the process is much more straightforward: Calculate Vorb at sea level, add the \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to transfer to desired orbital altitude, and subtract the planet\u0027s rotational velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nFor an airless Kerbin, sea level Vorb is 2,426 m/sec. Hohmann transfer to 70km is another 130 m/sec. Kerbin\u0027s rotation is 175 m/sec. So theoretically the minimum \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E is \u003Cstrong\u003E2,381 m/sec\u003C/strong\u003E. But you have to follow a gravity turn to keep out of the denser part of the atmosphere, you have gravity losses and drag losses. All this together makes 3,400 m/sec about normal for a launch.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2018-01-16T17:52:51Z","Content":"\n\u003Cp\u003E\nGravity losses are bigger than they might otherwise be because the general rule is to start with a lower \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E (engines cost, fuel and boosters not so much).  Gravity losses are also increased because aerodynamic forces won\u0027t let you execute a low-altitude takeoff as you might on the Mun.  Not only would drag be too high, but a rocket not facing into prograde is just asking for trouble...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-16T17:54:56Z\u0022 title=\u002201/16/2018 05:54  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 16, 2018\u003C/time\u003E by Kryxal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2018-01-16T18:28:19Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs pointed out you need to consider your losses: gravity, drag, cosine.\n\u003C/p\u003E\n\u003Cp\u003E\nThat means that for a precise calculation you need to consider all the forces acting in the vessel (thrust, drag, weight), and integrate it. The fact that we are talking about vectors add the complication that we need to consider the direction of those forces also. Drag is pretty difficult to consider since it depends on the density of the atmosphere, velocity and \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E of the vessel. But IMHO its the cosine loses that are impossible to predict,(seriously, it\u0027s affected by the amount of coffee that you drink)\n\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2018-01-16T21:04:04Z","Content":"\n\u003Cp\u003E\nThe real killer is the gravity losses that the atmosphere necessitates. Drag losses themselves are reasonably small on an efficient ascent, especially with larger/lower-\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E rockets, but keeping them small and/or avoiding thermal implosion means you need to do a lot more climbing than otherwise, while avoiding sharp turns and staying prograde-- so you end up thrusting against gravity for a much longer period than you would otherwise.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-16T21:05:05Z\u0022 title=\u002201/16/2018 09:05  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 16, 2018\u003C/time\u003E by foamyesque\u003C/strong\u003E\n\u003C/span\u003E\n"}]}