{"TopicId":169776,"ForumId":16,"TopicTitle":"Control Pod Axis Inversion","CreatedByName":"Tibrogargan","CreatedById":91949,"CreatedDateTime":"2018-01-19T03:10:27Z","PageNum":1,"Articles":[{"CreatedByName":"Tibrogargan","CreatedById":91949,"CreatedDateTime":"2018-01-19T03:10:27Z","Content":"\n\u003Cp\u003E\nIs there any way to invert an individual axis on a control pod, either in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or during play?\n\u003C/p\u003E\n\u003Cp\u003E\nI have a ship that has two sets of engines, each facing a different direction and a control pod for each set of engines.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve set up the ship so that the \u0022main\u0022 engines work as desired, but when I swap to the \u0022auxilliary\u0022 engines/control pod I can only get two out of three control axes correct (pretty much East is East and Up is Up but North is now South).  Is there any way I can individually invert a control axis that a control pod uses?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-19T03:10:53Z\u0022 title=\u002201/19/2018 03:10  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 19, 2018\u003C/time\u003E by Tibrogargan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xlm","CreatedById":184114,"CreatedDateTime":"2018-01-19T03:21:11Z","Content":"\n\u003Cp\u003E\nThe control is not based on north, east or up, it is based on pitch, roll and yaw. Based on what you are saying, the only way is to take off your pod, turn it 180 degrees, and attach it with the other end. This\u0027ll be easy to do if you are using probe core, harder if you are using something not symmetrical.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: on second thought, no you cannot only change one axis using rotation and translation. You\u0027d have to use reflection, which is not available in ksp.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-19T03:24:59Z\u0022 title=\u002201/19/2018 03:24  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 19, 2018\u003C/time\u003E by xlm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-01-19T14:36:36Z","Content":"\n\u003Cp\u003E\nIf the control point is pointing in the opposite direction to the engine, it should always work correctly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2018-01-19T17:10:35Z","Content":"\n\u003Cp\u003E\nA couple images may help to understand what is your problem.\n\u003C/p\u003E\n\u003Cp\u003E\nControl reference frame cannot be inverted, only rotated.  What can be inverted is control actuators (gimbal, control surface, reaction wheel), this need Advanced Tweakables  on.\n\u003C/p\u003E\n"}]}