{"TopicId":17016,"ForumId":21,"TopicTitle":"Min jet test C - a experimental test design [0.16 \u002B MechJeb]","CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-08-15T22:18:38Z","PageNum":1,"Articles":[{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-08-15T22:18:38Z","Content":"\n\u003Cp\u003EOk, I was experimenting with jet engines ( for a hybrid 1st stage for when we have other planets to come ) and I tumbled with this design by acident ( was trying to cope with the weak big decoupler by putting the engines in top of it and trying some ways to minimize fuel lines ( obviously that part still needs refinement ... ) )\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/cJbIF.png\u0022 alt=\u0022cJbIF.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd, to my surprise, this quite minimal ship was enough to go to the moon and back ... so I decided to redo the mission and take some pics:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2wuS0.png\u0022 alt=\u00222wuS0.png\u0022\u003E\u003Cp\u003EAs you could notice in the previous spoiler , the first stage activated only the jet engines. They took a while to gain enough power to push the ship up and that is where Mechjeb was most needed in the mission ( otherwise it is hard to avoid the ship to start dancing in the launch pad until it crashes unless you have a good control over it ( I don\u0027t ) ). Anyway. I started turning the ship at 10 km ( standart mechjeb fight program ) and I activated the aerospikes there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XqRry.png\u0022 alt=\u0022XqRry.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI let the fuel in the lateral tanks to end to detach them \u002B the jet engines. By that time ( around 15 km ), they were already almost not working anyway\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4xnFC.png\u0022 alt=\u00224xnFC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the ship when preparing to circularize at 100 km. The flight plan was good enough for leaving lest than 300ish m/s for that manouver. Notice the 1/6 of tank still in the deposit stage ... that will be enough for the circularization and for the first part of the munar injection\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rk3uh.png\u0022 alt=\u0022rk3uh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShip burning the last stage for munar injection. Even then there is plenty of fuel left.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2ntEt.png\u0022 alt=\u00222ntEt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOrbit after entering Munar SoI. I chose this orbit to be able to do a \u0022suicide burn\u0022 to minimize the fuel bug ... unfortunately this will generete quite a bunch of g ...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gzn1z.png\u0022 alt=\u0022gzn1z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA little after starting the full throttle burn. In retrospective I could had started it even a little later, but better safe than sorry\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/i1f7t.png\u0022 alt=\u0022i1f7t.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2ZPLq.png\u0022 alt=\u00222ZPLq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPosition of the landing plus obligatory postcard from far away.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KjLe9.png\u0022 alt=\u0022KjLe9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting in spot for return burn. Will burn here until the orbit gets to 22-30 km inside kerbin atmosphere ( that gives the magic IRL 6Ã‚Âº reentry angle good enough for a Mun return trajectory )\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NOKtI.png\u0022 alt=\u0022NOKtI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShip trajectory after final burn. In here unfortunately had to run not on full throttle, since even a little thrust diference can mean the diference between failing the atmosphere, doing a decent aerobrake or crashing hard in the floor because the parachutes malfunctioned due to the high reentry speed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NOVmw.png\u0022 alt=\u0022NOVmw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs this originally wasn\u0027t even supposed to leave the atmosphere, I have not putted a decoupler between the capsule and the rest of the ship ( it has 3 small parachutes, but that was legacy of the previous design I was testing before trying this and that I forgot to take out... they aren\u0027t even attached to the capsule, but to the lateral tanks ). Anyway, we have enough of fuel to do do a powered descent if we do some parachute assisted aerobraking \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9Bbm9.png\u0022 alt=\u00229Bbm9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo be honest I was not expecting that the parachutes would hold, but they did. Unfortunately, as the ship is quite top heavy at this point, the torque overwhelmed the Mechjeb SAS. This could be really bad news if the parachute opening would tear the connection between the fuel tank and the capsule, since there are no chutes in the capsule itself \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PuDD7.png\u0022 alt=\u0022PuDD7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith some heavy balancing of the ship using the capsule SAS and the force of the opening parachutes I managed to rotate the ship to the right direction. And, in spite of knowing that his ship could hold a impact to the ground above 10m/s ( previous tests ... for science and Kerbalkind sake ), there was no harm in doing a proper soft landing. Too bad we touched down in water ...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bj29t.png\u0022 alt=\u0022bj29t.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShip floating , using Mechjeb to avoid tumbling to the side, while waiting for the Kerbal Navy to rescue them\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rype0.png\u0022 alt=\u0022rype0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal stats of the flight. Those 6 g are from the suicide burn. If kerbals had human resistance to g forces, there was a quite high chance they would had passed out there ... and crashed into the ground. I only did that to avoid the cursed fuel bug ...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EIn short, turbojet engines are completely OP :/ I was just trying them for assisting the first stage of a Murs-faring ship for 0.17 ( as most rocket engines now are less efficient in at 1 atm ... ) and I end making a minimalistic Mun rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, for fun, here his the .craft file:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://filecloud.io/boe17k9q\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://filecloud.io/boe17k9q\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eor \u003Ca href=\u0022http://www./?xz1b1w3yhwc6gc4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?xz1b1w3yhwc6gc4\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-15T22:38:35Z\u0022 title=\u002208/15/2012 10:38  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 15, 2012\u003C/time\u003E by r_rolo1\u003C/strong\u003E\n\u003Cbr\u003Eadded mediafire link\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-15T22:21:24Z","Content":"\n\u003Cp\u003ECompact, I like it, but you know that the aircraft engines will eventually only run on aircraft fuel in a future update yes?\u003C/p\u003E\u003Cp\u003EThe aerospikes will be fine though as they are actually rocket engines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh also, I can\u0027t download this as I need to sign up first, which I won\u0027t do, and nor will many other members here.\u003C/p\u003E\u003Cp\u003EI suggest you upload this craft to \u003Ca href=\u0022http://\u0022 rel=\u0022external nofollow\u0022\u003EMediafire\u003C/a\u003E, as an account to download is not needed, and it is a far better site for hosting files like this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrMadGameplay","CreatedById":20225,"CreatedDateTime":"2012-08-15T22:24:49Z","Content":"\n\u003Cp\u003EEvery small ship I have made with the 3 man crew fails, but you seemed to master it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-08-15T22:32:59Z","Content":"\n\u003Cp\u003EOh, I forgot to warn ... the real download button is the \u0022request download ticket\u0022 in the bottom. The others are just very deceiving advertising. I can up them to mediafire OFC ... just give me a minute or so.\u003C/p\u003E\u003Cp\u003EI know that the jet engines will be toned down, but to be honest I was not expecting them to be \u003Cstrong\u003Eso\u003C/strong\u003E OP. As I said, this was just to test them for assisting flight in the first stage, not to do the whole heavy lifting up to 10 km. Anyway, the main point of the testing was not even the jet engines , but the decoupler behaviour with the engines on top ( went well ) and the fuel line system. But as it proved a good Mun rocket, why not share it ? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-08-15T22:39:05Z","Content":"\n\u003Cp\u003EAdded the mediafire link.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-15T22:43:57Z","Content":"\n\u003Cp\u003Er-rolo1, thanks for adding the Mediafire link, and I have nothing against you sharing your rocket, it\u0027s interesting to see what people can do when there are no artificial limits placed on them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}