{"TopicId":17025,"ForumId":18,"TopicTitle":"I have a great idea for a game.","CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-08-16T02:01:40Z","PageNum":1,"Articles":[{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-08-16T02:01:40Z","Content":"\n\u003Cp\u003EWell after regaining my obsession with mars, I found an actually good game idea. It takes place in one hundred years. NASA now has the technolgy to terraform mars, the player is supposed to fly the rocket to mars. Land the rocket successfully and release the hydrogen and all that into the atmosphere another object that\u0027s in the rocket gives it a molten core by heating up the core to the point of melting. Then an orbiter starts to replace the martian soil with earths soil.\u003C/p\u003E\n"},{"CreatedByName":"TheProdigy","CreatedById":15985,"CreatedDateTime":"2012-08-16T02:18:30Z","Content":"\n\u003Cp\u003EErr in a 100 years?\u003C/p\u003E\u003Cp\u003EIdk that sound like a thousand or more years to do what you just typed there to me lol. Mostly the heating up the core part...\u003C/p\u003E\u003Cp\u003EBut im no science guy, but people say it would be efficient to pollute mars like crazy to rise its temperatures up and melt the ice, then put plant life to absorb all the excess CO2 and replace it with oxygen. But thats not even the hard part.\u003C/p\u003E\u003Cp\u003EBut in 100 years i could see people building LARRGEE see through habitat zones to provide all the necessities for life and can provide for its self. Such as growing crops, raise live stock, produce their own power, and protect them from radiation as well (since mars is a dead planet, no magnetic field)...even that is pushing it in my opinion lol. Then people will build more and more of these large domes all over the planet, and connect them all to each other. Then after a while, boom. Mars will be lite up like earth at night.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2012-08-16T05:41:35Z","Content":"\n\u003Cp\u003EFor anyone interested in mars terraforming, I highly reccomend the Mars trilogy (Red Mars, Green Mars, Blue Mars) by Kim Stanley Robinson\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2012-08-16T06:43:24Z","Content":"\n\u003Cp\u003EThis may sound stupid, but it reminds me of Spore terraforming, without the actual rocketry part.\u003C/p\u003E\n"},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-08-16T07:09:15Z","Content":"\n\u003Cp\u003ESo where\u0027s the game idea? Just sounds like an extended cut scene to me.\u003C/p\u003E\u003Cp\u003EThe problem with mars is, apart from it having no magnetic field, that the atmosphere itself isn\u0027t particularly dense, about 0.6% of earths atmospheric pressure. You could use a greenhouse effect to heat it up, and then plant plants to make oxygen, but it still probably wouldn\u0027t be breathable since there just isnt\u0027 enough stuff there. The only way to make it breathable would be to use some sort of power source to convert solid matter into a stable gas, and since only 1/100th is there now you might as well put the correct ratio\u0027s of oxygen and nitrogen into it while you do that, instead of using plants to convert it.\u003C/p\u003E\n"},{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-08-16T12:45:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tim_Barrett\u0022 data-cite=\u0022Tim_Barrett\u0022\u003E\u003Cdiv\u003EThis may sound stupid, but it reminds me of Spore terraforming, without the actual rocketry part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no idea that was like spore terraforming. Anyways I was half asleep when I had the idea so it was most likely a bad one. (My brain did not detect any flaws to the idea until I read it.) Anyways mods feel free to close the thread.\u003C/p\u003E\n"},{"CreatedByName":"LukeTim","CreatedById":4138,"CreatedDateTime":"2012-08-16T13:01:40Z","Content":"\n\u003Cp\u003EYeah, how much energy would be required to make the entirety of Mars habitable?\u003C/p\u003E\u003Cp\u003EProbably a hell of a lot more than we have access to, or will have access to for the next few thousand years.\u003C/p\u003E\u003Cp\u003EHeating the core up in order to re-instate some sort of magnetic field is a good idea but would take an absurd amount of energy. I don\u0027t know the mathematics, but I should imagine it would take more energy than all of the power stations and nuclear bombs on this planet combined can possibly muster.\u003C/p\u003E\u003Cp\u003EYou\u0027ve also got what Sneaky Pete said... the atmospheric pressure is just too low. There\u0027s not enough of an atmosphere for it to be breathable even if it was mostly oxygen. In fact, I think the pressure is so low that if you went out in it without a pressurized suit, you\u0027d die.\u003C/p\u003E\u003Cp\u003ESo, you\u0027d have to somehow get more gas onto Mars in order to make it remotely habitable...\u003C/p\u003E\n"},{"CreatedByName":"dav1d89","CreatedById":33319,"CreatedDateTime":"2012-08-16T19:03:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EFor anyone interested in mars terraforming, I highly reccomend the Mars trilogy (Red Mars, Green Mars, Blue Mars) by Kim Stanley Robinson\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeconded, amazing books. Although I have only just started the second\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-08-16T20:26:52Z","Content":"\n\u003Cp\u003ESo what would you actually do in this game? Sounds like a good book/movie, but not a good game.\u003C/p\u003E\n"},{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-08-16T21:39:36Z","Content":"\n\u003Cp\u003EYou would control everything, Choose what life to introduce once terraformed. Fly the probes and orbiters there. (Of course they are already halfway there once you fly them.) Stuff like that. Of course this is highly unrealistic.\u003C/p\u003E\n"}]}