{"TopicId":170252,"ForumId":81,"TopicTitle":"Save bug FIX after capturing asteroid","CreatedByName":"Eterna1Soldier","CreatedById":168597,"CreatedDateTime":"2018-01-30T04:52:22Z","PageNum":1,"Articles":[{"CreatedByName":"Eterna1Soldier","CreatedById":168597,"CreatedDateTime":"2018-01-30T04:52:22Z","Content":"\n\u003Cp\u003E\nWhenever you captured an asteroid, a bug immediately occurs where you can no longer save the game, switch vessels, or go to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. It turns out that this is caused by a \u003Cstrong\u003Econtract bug\u003C/strong\u003E. If you have a contract open to capture a specific class of asteroid and you fulfill that requirement, the save glitch will occur 100% of the time. However, if you cancel the contract (or simply don\u0027t take one at all), you can now save the game and progress after capturing an asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve learned that;\n\u003C/p\u003E\n\u003Cp\u003E\n-This bug only occurs if you have an active contract to capture an asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\n-The asteroid you capture MUST fulfill the contract classification requirement for the bug to trigger.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, if you have a contract to capture a \u0027B\u0027 class asteroid, but you capture an \u0027A\u0027 class instead, then the save bug will not trigger.\n\u003C/p\u003E\n\u003Cp\u003E\nSo basically, don\u0027t bother accepting asteroid contracts, because they\u0027ll break your game the moment you fulfill them. (At least for the Xbox version. I would like someone to test this out for the PS4).\n\u003C/p\u003E\n"},{"CreatedByName":"Squelch","CreatedById":115992,"CreatedDateTime":"2018-01-30T17:25:48Z","Content":"\n\u003Cp\u003E\nThank you for the insightful report. We are currently investigating this on both platforms. We can confirm that this does not occur in a sandbox game or a randomly selected asteroid, and that it does appear to be restricted to contracts only which is an important detail.\n\u003C/p\u003E\n"},{"CreatedByName":"Socraticat","CreatedById":176118,"CreatedDateTime":"2018-01-31T19:28:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223281442\u0022 data-ipsquote-contentid=\u0022170252\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517333148\u0022 data-ipsquote-userid=\u0022115992\u0022 data-ipsquote-username=\u0022Squelch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/30/2018 at 9:25 AM, Squelch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe can confirm that this does not occur in a sandbox game or a randomly selected asteroid, and that it does appear to be restricted to contracts only which is an important detail.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just posted a response to a similar glitch. It was a satellite contract. This glitch is so bad it nullifies almost any good that came from the \u0022Enhanced\u0022 re-release. \n\u003C/p\u003E\n"},{"CreatedByName":"Jebatron","CreatedById":184996,"CreatedDateTime":"2018-02-02T03:08:39Z","Content":"\n\u003Cp\u003E\nCan confirm exactly as eterna1 saw on x box is same on ps4 have to decline mission to save or switch after asteroid intercept \n\u003C/p\u003E\n"},{"CreatedByName":"BALOK","CreatedById":185014,"CreatedDateTime":"2018-02-02T22:56:09Z","Content":"\n\u003Cp\u003E\nI can confirm that this exact bug existed in the \u0022Failing Tiger Edition\u0022. This seems to imply that the bug has nothing to do with either port and is part of the original code from version 1.2. Can anyone confirm that this also happened on the PC version?\n\u003C/p\u003E\n"}]}