{"TopicId":170363,"ForumId":16,"TopicTitle":"second attempt at mun landing and return","CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-01T12:00:59Z","PageNum":1,"Articles":[{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-01T12:00:59Z","Content":"\n\u003Cp\u003E\nalright, so i had plenty of frustration landing on the mun, then only having enough \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to make orbit again. had to send a rescue mission, which was equally as frustrating.\u003Cbr\u003E\u003Cbr\u003E\nso now ive redesigned my lander and shuttle and would like some input as to weather or not you think it can make it to and fro.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022xijm27t.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/xijm27t.jpg\u0022\u003E the plan \u003Cbr\u003E\n1. use main stack and liquid boosters to reach an orbit, ditch boosters when out of fuel.\u003Cbr\u003E\n2. set course for mun, burn whats left in main stack, decouple and use the skipper engine to reach mun.\u003Cbr\u003E\n3. use skipper engine to get mun orbit, discard if out of fuel\u003Cbr\u003E\n4, use terrier engine to land, get out of ship do some eva, get some science.\u003Cbr\u003E\n5. detach terrier and its fuel tank, use twitch to fly back to kerbin, ditch science modules on way into atmosphere and land.\u003Cbr\u003E\u003Cbr\u003E\ni planned on ditching the nosecone somewhere in space doesnt really matter, im only using it to help stop the ship from flipping on the way up and i figure i would want to shed as much weight as i can to get back to kerbin. dont pay attention to the staging i have in this picture, i have an idea in my head of how im going to stage it, but i havent done the staging yet so parts are mostly willy nilly.\u003Cbr\u003E\u003Cbr\u003E\nshould i switch out the liquid boosters for SRBs?\u003Cbr\u003E\u003Cbr\u003E\nany flaws or advice you can give me on this? i would rather not get jeb stranded again and have to ditch the ship and most of the science to get back to kerbin.(although eva from one ship to another in LMO was a bit nail biting and gave me a huge sigh of releif when i finnally pulled it off.)\u003Cbr\u003E\u003Cbr\u003E\nand also, why does it give me a \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E rating for stages that only have decouplers? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-01T12:11:29Z\u0022 title=\u002202/01/2018 12:11  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 1, 2018\u003C/time\u003E by putnamto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2018-02-01T12:27:16Z","Content":"\n\u003Cp\u003E\nLooks like you\u0027ve got enough rocket, but I think you can tighten things up a bit. First off, you\u0027re switching fuselage sizes several times without adaptors. That\u0027s a killer, cuz it adds tons of drag right where you don\u0027t want it; at the top of your rocket. I suspect you need plenty of gimbal to keep it under control, which is probably why you\u0027re using Swivels and have to have those huge wings to put more drag where it\u0027s needed; at the bottom of your rocket. And I would swap out the liquid boosters for \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s as you said. Just a personal preference. They\u0027re cheap and powerful, and getting you off of Kerbin is basically their entire reason for being. I like to take advantage of them. The Delta Deluxe Winglets are great control surfaces when paired with \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s.\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-01T12:38:24Z","Content":"\n\u003Cp\u003E\nIf  I  use  adaptors  do  you  think  I  can  get  rid  of  the  wings  to  save  weight, and  switch  the  swivels  with  srbs?\n\u003C/p\u003E\n\u003Cp\u003E\nWhen  trying  to  fly  this  no  gimball, and  just  the  little  wings  it  would  become  uncontrollable  around 5-10km\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I  didnt  put  an  adaptor  under  the  science jr  because  I  was  afraid  of  weight  issues  getting  back  to  kerbin, and  is  their  anything  I  can  do  about  the  space  around  the  terrier?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-01T12:45:43Z\u0022 title=\u002202/01/2018 12:45  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 1, 2018\u003C/time\u003E by putnamto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-02-01T12:53:48Z","Content":"\n\u003Cp\u003E\nYou\u0027ll be better off in space with a more space-worthy engine than the Skipper, especially for just going to Mun that\u0027s a lot of mass. I\u0027d try a couple Terriers or Thuds. You won\u0027t get the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E but you\u0027re in space, low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E isn\u0027t a big deal. Then becasue they\u0027re lighter, not only will your rocket go farther but the lifter will go farther as well, meaning you can either bring more, have a better margin for error, or just do more while you\u0027re out there.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2018-02-01T13:18:58Z","Content":"\n\u003Cp\u003E\nYou\u0027re very much on the right track. Your staging sequence is quite logical and should work. The only major problem I foresee is aerodynamic -- you\u0027ve got a lot of draggy stuff near the nose which means it\u0027s possible that your rocket will want to do a backflip on the way up. On the other hand your lifter stage is heavy and has lots of thrust vectoring so it might work fine as it is.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a lot of room for optimisation there of course, but I wouldn\u0027t worry about it at this point; you can leave that for later. I can\u0027t resist pointing out two things though: I don\u0027t think you actually need the Twitch-powered stage to get back home; the Terrier ought to be able to fly you back just fine with the same amount of fuel, and you can simplify your lander/return stage by using a Mk 1 command pod instead of the lander can \u002B nose cone; that way you can use a single standard parachute instead of the three radial ones too.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2018-02-01T13:26:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283015\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517488704\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf  I  use  adaptors  do  you  think  I  can  get  rid  of  the  wings  to  save  weight, and  switch  the  swivels  with  srbs?\n\u003C/p\u003E\n\u003Cp\u003E\nWhen  trying  to  fly  this  no  gimball, and  just  the  little  wings  it  would  become  uncontrollable  around 5-10km\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I  didnt  put  an  adaptor  under  the  science jr  because  I  was  afraid  of  weight  issues  getting  back  to  kerbin, and  is  their  anything  I  can  do  about  the  space  around  the  terrier?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe short answer is, yes. I don\u0027t like to suggest a complete redesign, but there are always more things you can do. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-5thhorseman/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273725\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-5thhorseman/\u0022 rel=\u0022\u0022\u003E@5thHorseman\u003C/a\u003E brings up a good point about power. Let me start with my take on mass; I don\u0027t much care about it. That probably makes me sound like an idiot, but it\u0027s just not my main concern. \u003Cem\u003EAbility\u003C/em\u003E is what matters to me. I build a rocket to do a certain job. Then I try to make it as light as possible. For me, mass is not the real problem. \u003Cem\u003EUnnecessary\u003C/em\u003E mass, on the other hand, is the enemy. I see monopropellent canisters, but if you\u0027re not planning to dock, dump \u0027em. I would also dump the reaction wheel and switch out the lander can for an Mk1 Command Module. The mass difference is negligible, and worth it. You won\u0027t need as much for the return because you can easily free-return without a shield. As for the Terrier, I would probably have just switched to a 1.25m fuselage at that point. As I said, you won\u0027t need much for the return leg. And Thumpers with Delta Deluxe Winglets should get you off the ground and higher up where your Skipper can start to shine. All in all though, a total redesign isn\u0027t necessary. You can feel your way around and just make tweaks here and there and see the result. Hope all goes well.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-01T13:35:42Z\u0022 title=\u002202/01/2018 01:35  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 1, 2018\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2018-02-01T13:32:44Z","Content":"\n\u003Cp\u003E\nYour Skipper only runs for 38 seconds.  That\u0027s not really enough time to justify the engine; I\u0027d suggest switching it for a Poodle.  Usually, it\u0027s worth trying to get about two minutes of burn time out of a stage.  Assuming that the previous stage is enough to get you to orbit, a Poodle might even give you too much \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for munar transfer--which is a good thing, because it also gives you a lot of margin and reserves for picking a perfect landing spot.\n\u003C/p\u003E\n\u003Cp\u003E\nYou have monopropellant but no attitude jets that I can see; it\u0027s just along for the ride and that\u0027s a waste.  If you do have attitude jets, why?  If you get rid of the monopropellant tanks; drain the monopropellant out of the lander can, as well.  It\u0027s not that big a deal but why pay for it if you won\u0027t use it?\n\u003C/p\u003E\n\u003Cp\u003E\nThe high-drag transitions at the top of the rocket are going to cut down on your ascent efficiency a lot.  Using adapters or switching to all 2.5m parts would help that.  On the other hand, if you have access to fairings, that would work just as well and prevent your lander from being so tall as to tip easily.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the gripping hand, you could run the same mission with all parts on a 1.25m stack, but I got the impression that that is what you tried before and it did not work out too well for you.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you do have fairings, you can do things that don\u0027t really make intuitive sense.  For example, you can surface attach the small FL-T100 fuel tanks after flipping them up on their sides (so that you join the added tank to the centre tank by the flat face--don\u0027t try to join it on the curved face); you can fit three of them around a central tank and get four times the fuel for nearly the same footprint as one tank--but ploughing that through the atmosphere is a pain, so definitely use fairings.\n\u003C/p\u003E\n\u003Cp\u003E\nDefinitely consider switching out the boosters for Thumpers.  If that gives you too much \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, then reduce thrust and run them for longer.  Keep some winglets or fins; you shouldn\u0027t need those big swept wings for that rocket, but you absolutely will need something.\n\u003C/p\u003E\n\u003Cp\u003E\nOthers have said to consider exchanging the lander can for a Mk. I Pod, and that\u0027s something to seriously consider.  Since the pod (and utterly necessary parachutes and shielding) is what needs to come back, you may want to consider putting all of the science gear in the landing but not the ascent stage, and letting the ascent stage consist only of the actual Kerbin return package plus a small engine and enough fuel to return only that package.  Do you have the 2.5m service bay?  It can fit all of the science experiments you brought and save you both height and drag, and you can put it in the section with the landing legs to be staged away once you are ready to make your Kerbin return.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-01T13:44:58Z\u0022 title=\u002202/01/2018 01:44  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 1, 2018\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2018-02-01T16:14:31Z","Content":"\n\u003Cp\u003E\nIf you\u0027re going to use fins for steering, it\u0027s worth putting them on the cardinal points instead of having the boosters there.  Also, I\u0027d say NOT to go purely with a 1.25m stack for the lander at this points, mostly because you\u0027re going to want the wider base and less height when you do the landing.  Put it behind a fairing.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2018-02-01T18:06:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283148\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517501671\u0022 data-ipsquote-userid=\u0022102688\u0022 data-ipsquote-username=\u0022Kryxal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Kryxal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you\u0027re going to use fins for steering, it\u0027s worth putting them on the cardinal points instead of having the boosters there.  Also, I\u0027d say NOT to go purely with a 1.25m stack for the lander at this points, mostly because you\u0027re going to want the wider base and less height when you do the landing.  Put it behind a fairing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe can always suggest certain parts but, in a career or science game, the player won\u0027t always have access to them. The reason I didn\u0027t suggest a fairing is that, if you look at his screenshot, you can see he doesn\u0027t have Specialized Construction. Which means he doesn\u0027t have the 2.5m fairing. Better to use a 1.25m lander. It\u0027s a small lander. The landing gear is all the wide base it should need.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2018-02-01T22:02:00Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPlease, post a screenshot of your tech tree, so we will know what parts are available.\n\u003C/p\u003E\n\u003Cp\u003E\nI see 2 big issues with your craft: the tall lander and the amount of drag on the top. Your engine choices are not exactly of my likings either.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead of trying to \u0027fix\u0027 the ship I\u0027d go for a complete redesign. A good way to design a craft is to design each part in the reverse order of use trying to have just enough (including some safety margin) for that part of the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nreentry and landing: Mk16 parachute, Mk1 Command Pod (without monopropellant).1.25m heatshield (without ablator).\n\u003C/p\u003E\n\u003Cp\u003E\nso far 1t mass, and can resist the heat of rentering from pretty much anywhere in Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E. it will have no trouble holding retrograde in the atmosphere and slowdown enough for a safe deployment of the parachute.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom Mun Low Orbit to Kerbin atmosphere:\n\u003C/p\u003E\n\u003Cp\u003E\nBetween the parachute and the command pod we include: probecore HECS* if available,  (For the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, so you can bring a scientist instead of a pilot), OscarB tank , 2x spider engine(we offset this so the nozzle appear below the heatshield), 2xO|X-STAT solar panel, 2x Z-100 battery.\n\u003C/p\u003E\n\u003Cp\u003E\nThe extra 0,4t give us 440m/s with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E 0,3, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, 200EC and EC generation. It will be quite a slow Mun departure burn but it will work, and keeping the mass low is a nice advantage for the lower stages. Notice that all this is part of the landing craft, so we need consider the effect in that flight phase, fortunately we still have good aerodynamic profile and heat resistance.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMun lander and ascend vehicle:\n\u003C/p\u003E\n\u003Cp\u003E\nTR-18A stack decoupler, sicence jr, service bay with other instruments, fl-t200 fuel tank, 8xOscarB tank, 4x Spark.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, the lander would look like \u003Ca href=\u0022https://kerbalx.com/Spricigo/Gossiper\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E. The idea is to make it shorter and wider but not too wide (still fit inside a 1.25 fairing). The total mass is 5,6t and this stage have 1,9km/s with TWR1.4.  With good piloting that should be enough to capture, land and return to orbit of the Mun , but if you need  (based on your previous attempt) is easy to add more fuel tanks for increased deltaV and keep a healthy \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTransfer stage:\n\u003C/p\u003E\n\u003Cp\u003E\nTR-18A, fairing covering the upperr stage, FL-T400 fuel tank , FL-T200 fuel tank, terrier engine.\n\u003C/p\u003E\n\u003Cp\u003E\nWith1,2km/s, \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E 0,6 and just shy of 10t is all we need to take us from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E to Mun intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLifter main stack:\n\u003C/p\u003E\n\u003Cp\u003E\nTR-18A, Rockomax adapter, X200-16 fuel tank, X200-32 fuel tank, 4x Av-r1 winglet, Skipper engine\n\u003C/p\u003E\n\u003Cp\u003E\n2.8Km/s and TWR1.4  Is almost enough to get us from the launchpad to the orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nSide booster(x2):\n\u003C/p\u003E\n\u003Cp\u003E\nTT-70 decoupler (crossfeed enabled**), Hammer \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E, FL-T400 tank.\n\u003C/p\u003E\n\u003Cp\u003E\nThe boosters and mains stack will start together, The \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burn while the skipper consumes the fuel on top of it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately that rocket \u003Cu\u003Ewas designed in a spreadsheet instead of KSP\u003C/u\u003E, so I don\u0027t have a nice craft file and a tested custom flight profile. For the gravity turn I don\u0027t use the popular \u0022launch and tap D-key\u0022 approach, instead I have my rockets already tilted at the launchpad, launch with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E hold and when it reach some velocity I switch to prograde hold (or \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off). A new rocket may take a few tries, but once I figure out how much initial tilt and when to switch \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E  mode anyone can follow that profile to orbit.(and skilled players may eventually come up with a better flight profile).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*if you don\u0027t have the HECS, use the OKTO. Doing the gravity turn with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E follow prograde is preferable but a stable rocket will be able to do it with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off.\n\u003C/p\u003E\n\u003Cp\u003E\n**requires the \u003Cem\u003Eenable advanced tweakables\u003C/em\u003E in the settings. Which also allow Autostruts , another excellent feature.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T10:09:24Z","Content":"\n\u003Cp\u003E\nwith your guys advice i came up with this\u003Cbr\u003E\u003Cbr\u003E\u003Cimg src=\u0022https://i.imgur.com/6inR84X.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u00226inR84X.jpg\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\ni changed the skipper to a poodle, got rid of the twitch engines, and switched the liquid boosters for thuds, and got rid of the big wings(i thought they looked cool :(), oh and obviously i added a small fairing.\u003Cbr\u003E\u003Cbr\u003E\ni havent tried to get this one to the mun, but an earlier version that had a poodle in place of the terrier i was able to land on the mun with 1400 \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E left but my landing gear wasnt down low enough and it landed on the engine. it didnt break the engine but it kept teeter tottering and i tried to relanch and correct it, forgot it was in retro lock, and as soon as i lifted off it bodyslammed the top of the lander into the mun killing jeb.\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T13:41:06Z","Content":"\n\u003Cp\u003E\nmission success, didnt really have to much trouble besides figuring out the landing, cant tell you how many times i landed on the opposite side of the mun and had to reload.\u003Cbr\u003E\u003Cbr\u003E\na question though, is their some kind of mod i can get to make my crafts bob while they are in the water? its very weird to see the craft stick in the turbulent ocean like a lawn dart.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2018-02-02T13:46:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283897\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517578866\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nmission success, didnt really have to much trouble besides figuring out the landing, cant tell you how many times i landed on the opposite side of the mun and had to reload.\u003Cbr\u003E\u003Cbr\u003E\na question though, is their some kind of mod i can get to make my crafts bob while they are in the water? its very weird to see the craft stick in the turbulent ocean like a lawn dart.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCongrats!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not personally aware of any mod that does that, but I\u0027d like to know about it if it exists as well.\n\u003C/p\u003E\n\u003Cp\u003E\nI sort of half remember seeing a WIP mod that was doing something like that, but I\u0027ll be damned if I can find it again or remember it.\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T13:52:37Z","Content":"\n\u003Cp\u003E\noooh screenshots, that is one thing i really love about this game.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://imgur.com/gallery/gfIBl\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/gfIBl\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-02T13:53:18Z\u0022 title=\u002202/02/2018 01:53  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 2, 2018\u003C/time\u003E by putnamto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2018-02-02T14:03:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283910\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517579557\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\noooh screenshots, that is one thing i really love about this game.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://imgur.com/gallery/gfIBl\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/gfIBl\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you want them to show up here in the forums, you can right click each picture on imgur and open it in a new tab, then copy paste that tab\u0027s address here. Like so;\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PygBzh2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/PygBzh2.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou can put them under a spoiler box as well if you don\u0027t want them taking up too much room. Like so;\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022q2IeSiw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/q2IeSiw.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNice pics by the way!\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T14:06:00Z","Content":"\n\u003Cp\u003E\nah, didnt think about the spoiler thing, i didnt want to post a bunch of screens and end up with a wall of pictures bogging down peoples connections.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2018-02-02T14:15:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283919\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517580360\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nah, didnt think about the spoiler thing, i didnt want to post a bunch of screens and end up with a wall of pictures bogging down peoples connections.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, I mean it is your thread.\n\u003C/p\u003E\n\u003Cp\u003E\nI typically consider it polite to use the spoiler box when posting pics in someone else\u0027s thread.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s a thread I made though? You can like my pics or get out! Lol. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2018-02-02T14:16:53Z","Content":"\n\u003Cp\u003E\nCongrats, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/184648-putnamto/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022184648\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/184648-putnamto/\u0022 rel=\u0022\u0022\u003E@putnamto\u003C/a\u003E. Your space program just took a huge leap. Now it gets even more fun. With just a few tweaks and a bit more Delta v, that same rocket can get you to Duna and back. Then things \u003Cem\u003Ereally\u003C/em\u003E start getting exciting. Enjoy. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2018-02-02T14:19:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223283919\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517580360\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nah, didnt think about the spoiler thing, i didnt want to post a bunch of screens and end up with a wall of pictures bogging down peoples connections.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt loads the pictures whether they\u0027re in a spoiler or not.  The spoiler just hides them from view, it doesn\u0027t actually stop them from loading.\n\u003C/p\u003E\n\u003Cp\u003E\nI really like this one:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229uk6aZg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9uk6aZg.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2018-02-02T14:24:34Z","Content":"\n\u003Cp\u003E\nBravo! I think you just earned your spurs as a proper KSP player. Once you\u0027ve landed on the Mun, the Kerbol system is your oyster!\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T20:14:46Z","Content":"\n\u003Cp\u003E\nthank you all.\u003Cbr\u003E\u003Cbr\u003E\noddly enough i got a bunch of contracts for tourists that want to land on the mun now, and the demolitions company wants me to put their flag up their.\u003Cbr\u003E\u003Cbr\u003E\nim assuming thats how the contracts work? once you reach a milestone they kind of shift to be centered around that milestone or the next? i noticed they dont want me to do anything on kerbin anymore\u003Cbr\u003E\u003Cbr\u003E\nsome more questions. why does mechjeb say that my decoupler stages have 2000\u002B \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E? at first i thought i had an engine in the same stage or something but i didnt. on my last craft(the one in the picture, with different staging) the decoupler under the poodle would say 2k \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E, then when i removed the main stage my \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E totals would shift to the poodle, but when i put it back the same number would move back to the decoupler. bug?\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-02T22:14:19Z","Content":"\n\u003Cp\u003E\nanother question, ive taken the shuttle stage and replaced the lander with a sattelite to try and put it in orbit over mun, i follow a very similar flight path and for some reason the burn from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003Elko\u003C/abbr\u003E to the mun says its going to take 20 days, wearas the original one with the lander would only take 1\u002B min.\u003Cbr\u003E\u003Cbr\u003E\nthe satelite is half as heavy as the lander, why is the est burn time so different? and how can i correct this?\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2018-02-03T00:42:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223284261\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517609659\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nanother question, ive taken the shuttle stage and replaced the lander with a sattelite to try and put it in orbit over mun, i follow a very similar flight path and for some reason the burn from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003Elko\u003C/abbr\u003E to the mun says its going to take 20 days, wearas the original one with the lander would only take 1\u002B min.\u003Cbr\u003E\u003Cbr\u003E\nthe satelite is half as heavy as the lander, why is the est burn time so different? and how can i correct this?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou probably haven\u0027t staged the engine yet, so it\u0027s showing a burn time without any thrust basically. Just stage the engine, or if you have already, hit some thrust for a second. That\u0027ll straighten things out and show you the actual burn time.\n\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2018-02-03T01:09:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223284381\u0022 data-ipsquote-contentid=\u0022170363\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221517618577\u0022 data-ipsquote-userid=\u0022175588\u0022 data-ipsquote-username=\u0022Cpt Kerbalkrunch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, Cpt Kerbalkrunch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou probably haven\u0027t staged the engine yet, so it\u0027s showing a burn time without any thrust basically. Just stage the engine, or if you have already, hit some thrust for a second. That\u0027ll straighten things out and show you the actual burn time.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyeah i tried that, puzzling. \u003Cbr\u003E\u003Cbr\u003E\nedit: i was thinking like a kerbal, i was trying to plan my manuever from within the atmosphere of kerbin\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-03T01:29:11Z\u0022 title=\u002202/03/2018 01:29  AM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 3, 2018\u003C/time\u003E by putnamto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2018-02-03T01:44:23Z","Content":"\n\u003Cp\u003E\nTo this a couple of other thoughts into the mix.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Mun is tricky to land on because it has round ground, at different elevations and the gravity is relatively strong.  If you haven\u0027t tried it yet, you might want to give landing on Minmus a try.  It has lower gravity, so less fuel is needed to land and get back up into orbit.  It also has a lot of flat level ground, all at 0m, making judging the landing a little easier.  It\u0027s slightly more complicated to get there as the orbit of Minmus is tilted with respect to Kerbins orbit. (There are plenty of tutorials out there on how to carry out the maneuver).  A final bonus is, your science experiments generate more points.\n\u003C/p\u003E\n\u003Cp\u003E\nDepending on which mode you are playing, you may also want to consider dumping the actual experiments once you have carried them out and return with just the data. You can either click on each experiment and \u0022remove data\u0022 or, if you have access to the Experiment Storage Units you can use that to gather all the data from the experiments at once - of course you do need to return the storage unit to the ground to get the science points.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy Landings!\n\u003C/p\u003E\n"}]}