{"TopicId":170745,"ForumId":32,"TopicTitle":"What is your most facepalm-worthy moment regarding KSP?","CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-02-10T21:41:01Z","PageNum":4,"Articles":[{"CreatedByName":"magimix","CreatedById":156071,"CreatedDateTime":"2018-04-02T20:47:36Z","Content":"\n\u003Cp\u003E\nMy face-palm moments are relative small-fry, but red marks on the face they left nonetheless...\n\u003C/p\u003E\n\u003Cp\u003E\nJust yesterday, I\u0027d finished building my largest and most ambitious launcher yet.  The biggest vehicle I\u0027d ever made.  Crossed every \u0027t\u0027; dotted every \u0027i\u0027.  *Didn\u0027t* check the staging.  With a palpable sense of excitement, I activate the engines and...  Oh, wait, did I say engines?  I meant the launch clamps, causing the vehicle to drop a metre to the ground and explode in spectacular fashion (and taking more of the launch facility *in general* with it than I\u0027d ever have anticipated).\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of things that actually *launched* okay...  My first attempt at a crewed Duna mission was hairy. I decided to assemble the mission vehicle in low Kerbin orbit.  I intricately, and *carefully* planned and built my lander, and the \u0027tug\u0027 stage that\u0027d do the heavy lifting (as it were).  The whole flight to Duna went really well, I entered low Duna orbit, and...  Why is the vehicle delta-V 2500\u002B less than it should be?!  Yep, I didn\u0027t properly account for the mass of the lander module when building the tug that\u0027d be moving it.  That said, it was also the first mission where I really had something go wrong deep into it (normally they fail fast), and so had to try and puzzle my way out of it.  I *barely* had enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E even to get back into the vicinity of Kerbin, let alone slow down at all.  I had one shot only to do a burn; it had to be right the first time.  In order to not just fly back out into the vasts of space, I had to go *deep* into the atmosphere.  At 50km, I was pulling 5,200m/s, and 3,878m/s at 25km.  The most intense aerobraking I\u0027ve ever done. \n\u003C/p\u003E\n\u003Cp\u003E\nI then had a secondary facepalm.  Realising my mistake, I reworked the \u0027tug\u0027, this time with the lander assembley on it, and wound up with a vehicle that could launch and do the whole mission as is.  All that faffing around, building a vehcle in orbit, was entirely unnecessary!\n\u003C/p\u003E\n"},{"CreatedByName":"Fett2oo5","CreatedById":77444,"CreatedDateTime":"2018-04-02T23:07:10Z","Content":"\n\u003Cp\u003E\nBuilt a complicated \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E/Transcontinental aircraft, with all the abilities including all experiment apparatuses, ladders, docking, cargo, etc.  Adding more, and more parts and capabilities, up-sized the landing gear... build, build, build..... →  Launch... ground clearance problems, revert, fix. → Launch, landing gear out of alignment? what?  Fix them, move gear a little down, a little out.  → Launch.  Success!  I get it to Kerbin north pole, Pilot jumps out to celebrate and plant a flag!  Woohoo!  Ok, let\u0027s get back in and go home.\n\u003C/p\u003E\n\u003Cp\u003E\n..... Ladder doesn\u0027t reach the ground because I made the landing gear too tall.\n\u003C/p\u003E\n\u003Cp\u003E\n--------------------\n\u003C/p\u003E\n\u003Cp\u003E\nNeeded to make a low budget science gathering journey to Mun, it was incredibly difficult (for me, at the time) finally get it all designed, under budget, and with JUST enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to get there and back.  Launch, fly, fly, fly, mechanic of the orbitals, sketchy landing... nothing broken... alright!  Science time!\n\u003C/p\u003E\n\u003Cp\u003E\n..... forgot the experiment equipment.\n\u003C/p\u003E\n\u003Cp\u003E\n--------------------\n\u003C/p\u003E\n\u003Cp\u003E\n(years later...) Planning Mun mission to collect \u003Cstrong\u003Eall\u003C/strong\u003E possible science from each of the Mun\u0027s biomes, wonderfully designed, allowed for beautiful execution of the mission.  I collected tons of science from each of the biomes, it took a while, and careful course plotting (biome hopping) to use as little \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E as possible.  Leave the Mun, return home, checking the list of science collected, notice an absence of gravity scans.  That\u0027s odd.  Those experiments don\u0027t have to be reset after they are run...  What the heck happened?!?\n\u003C/p\u003E\n\u003Cp\u003E\nGo to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, load up the craft ..... not a single Gravioli Detector was installed on the craft.  Have to go back to each Mun Biome.  \u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n--------------------\n\u003C/p\u003E\n\u003Cp\u003E\nMore Science experiment woes:\u003Cbr\u003E\nEarly in career mode, need science points, load up a craft with the science equipment I have unlocked... ok let\u0027s do this!  Get to destination... No Materials observation?!?! \n\u003C/p\u003E\n\u003Cp\u003E\n..... I had installed a Mobile Processing Lab, and not a Science Jr. because the parts look exactly the same.\n\u003C/p\u003E\n\u003Cp\u003E\n--------------------\n\u003C/p\u003E\n\u003Cp\u003E\nNeeded a satellite around Kerbol, designed one, launched it, burn to make Kerbol orbital insertion burn... Success!  Time warp out of Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, into Kerbol \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E to circularize orbit... warp, warp, warp.....  go back to normal view from map view...  Can\u0027t control anything?  No connection?!?!?\n\u003C/p\u003E\n\u003Cp\u003E\n..... chose the wrong antennae, I was out of range.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-02T23:11:13Z\u0022 title=\u002204/02/2018 11:11  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 2, 2018\u003C/time\u003E by Fett2oo5\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lego_Prodigy","CreatedById":187421,"CreatedDateTime":"2018-04-02T23:59:55Z","Content":"\n\u003Cp\u003E\nProbably almost every single flight I have made up to this point can be included here.\n\u003C/p\u003E\n"},{"CreatedByName":"Confused Scientist","CreatedById":179591,"CreatedDateTime":"2018-04-03T00:08:53Z","Content":"\n\u003Cp\u003E\nThe other day I flew a full-on Gilly mission that included\n\u003C/p\u003E\n\u003Cp\u003E\n1.) A nuclear tug to send all of the other components to Gilly;\n\u003C/p\u003E\n\u003Cp\u003E\n2.) Crewed landers with fuel to fly to any other point on Gilly and return to the starting point;\n\u003C/p\u003E\n\u003Cp\u003E\n3.) A large surface base;\n\u003C/p\u003E\n\u003Cp\u003E\n4.) A seperate, smaller \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E generator, which was sent down to the surface first. It was supposed to refuel the landers (using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E and \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E) so they could do multiple sorties.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell, I took the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E module to the surface and spend half an hour waiting to fall to the ground. Then I warped to daytime and deployed the drills. It\u0027s important to note that I was using the largest size drill, which is longer than the longest landing gear. Luckily, I\u0027m fine with not having to fly those landers all around Gilly, because I hate that gravity. The kerbals on the expedition will just have to sit around in almost zero-g (the worst kind of g) for a year and a half to wait for their launch window to open. I don\u0027t envy them. Frankly, I\u0027ve got a flags-and-footprints mission to Eve on the drawing board that\u0027s probably going to go a whole lot smoother than this (or at the very least more exciting.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: No, wait, forgot the time that I designed a massive Duna ship, whose file was immediately corrupted. I had to redesign the whole thing. Needless to say, this ludicrous bug occurred in 1.1.x.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT (2): Wait... I have \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E. I can move those drills up. (Facepalm)\n\u003C/p\u003E\n\u003Cp\u003E\nNot that I really want to. I\u0027m never going to Gilly again.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-03T00:21:21Z\u0022 title=\u002204/03/2018 12:21  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 3, 2018\u003C/time\u003E by Confused Scientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-04-03T03:37:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223342851\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522690694\u0022 data-ipsquote-userid=\u0022150861\u0022 data-ipsquote-username=\u0022Gilph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Gilph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSometimes, it\u0027s really dark in space and on the surface,  and sometimes a Kerbal has to EVA into the darkness to do stuff. For about 18 months, I would squint and fumble about until I clicked the light button at the top of the screen and found that Kerbals have lights on top of their helmet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBet that was a real light-bulb-over-the-head moment, eh? \n\u003C/p\u003E\n"},{"CreatedByName":"Atlas2342","CreatedById":155194,"CreatedDateTime":"2018-04-03T09:30:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223343369\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522726652\u0022 data-ipsquote-userid=\u002227914\u0022 data-ipsquote-username=\u0022Vanamonde\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Vanamonde said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBet that was a real light-bulb-over-the-head moment, eh? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had the same problem and just found out a while ago. I guess I’m not too bright either \n\u003C/p\u003E\n"},{"CreatedByName":"W. Kerman","CreatedById":166763,"CreatedDateTime":"2018-04-03T11:53:39Z","Content":"\n\u003Cp\u003E\nOn a modded install. Lifesupport, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, and \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI had KerbinLab-1 and I sent up a capsule up to dock with it, and then....\n\u003C/p\u003E\n\u003Cp\u003E\nNo parachute.\n\u003C/p\u003E\n\u003Cp\u003E\nNo engineer to put one on from the station\u0027s stores.\n\u003C/p\u003E\n\u003Cp\u003E\n1 month of food.\n\u003C/p\u003E\n\u003Cp\u003E\nNow that was a fun rescue...\n\u003C/p\u003E\n"},{"CreatedByName":"PyramidPug","CreatedById":177623,"CreatedDateTime":"2018-04-10T20:16:59Z","Content":"\n\u003Cp\u003E\nI remember some of my first ever space station missions were done very inefficiently:\n\u003C/p\u003E\n\u003Cp\u003E\n1. i didn\u0027t do gravity turns\n\u003C/p\u003E\n\u003Cp\u003E\n2. didn\u0027t know how to dock/rendezvous\n\u003C/p\u003E\n\u003Cp\u003E\n3. executed burns exactly at T -0\n\u003C/p\u003E\n\u003Cp\u003E\nafter discovering all the correct ways to do those things i face palmed...\n\u003C/p\u003E\n"},{"CreatedByName":"Corona688","CreatedById":2511,"CreatedDateTime":"2018-04-12T19:47:09Z","Content":"\n\u003Cp\u003E\nMy most facepalm-worthy moment was packing a satellite in the middle of a craft.  Had to undock \u003Cstrong\u003Eeverything\u003C/strong\u003E to get rid of it - after which I realized\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nThe lander was bone-dry due to a crossfeed error.\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027d undocked every drop of fuel.\n\u003C/li\u003E\n\u003Cli\u003E\nThat satellite had been the only qualified pilot aboard.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nDoing rendezvous on pure \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E with an unbalanced, fuel-less lander without even stability assist was Fun.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, another:  Watching Jeb roll \u003Cstrong\u003Esix hundred meters\u003C/strong\u003E downhill from the remains of his rocket unicycle.  That\u0027s several straight minutes of low-gravity ragdolling.\n\u003C/p\u003E\n\u003Cp\u003E\nI also had that happen to a low-budget tourist craft, almost nothing but an airplane tube and a parachute.  It landed on a veeeeeeeeery slight slant and rolled for ten freaking minutes, \u003Cstrong\u003Ewith\u003C/strong\u003E timewarp.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-12T20:23:02Z\u0022 title=\u002204/12/2018 08:23  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 12, 2018\u003C/time\u003E by Corona688\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jetpackmaniac","CreatedById":182323,"CreatedDateTime":"2018-04-12T20:47:17Z","Content":"\n\u003Cp\u003E\nI used to forget action groups for afterburners on a panther powered jet. I would revert to hanger to fix it, only to get distracted and launch  again without setting the action groups. I say used to because after that happened several times, I began using the whiplash for high performance jets. \n\u003C/p\u003E\n"},{"CreatedByName":"dr.phibes","CreatedById":185178,"CreatedDateTime":"2018-04-14T12:44:02Z","Content":"\n\u003Cp\u003E\nIt is always the most ridiculous things too...spent an hour tweaking this-and-that on a transport aircraft which I then crewed and \u0027launched\u0027. Engines started, by nothing. I checked EVERYTHING only to discover I had put no fuel tanks. I added a 8inch note to my monitor that says, \u0022FUEL TANKS YOU DICK!\u0022, but in big, red letters.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll take it down when I remember fuel tanks every time. In my defense I have had a couple of strokes, but to forget fuel tanks is unforgettable.\n\u003C/p\u003E\n"},{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2018-04-14T13:30:05Z","Content":"\n\u003Cp\u003E\nI feel like every rocket launch I have ever done deserves to be here. Planes are a different story. I once was using TweakScale\u0027d B- Wings to make wings for my cargo liner, but I couldn\u0027t lift the huge body without huge wings. I made the wings huge and the lift force tore off the wings.... I had unbreakable joints on. At least it took off before snapping.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-15T13:51:52Z\u0022 title=\u002204/15/2018 01:51  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 15, 2018\u003C/time\u003E by TheMadKraken2297\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jetpackmaniac","CreatedById":182323,"CreatedDateTime":"2018-04-15T13:50:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223354272\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221523712605\u0022 data-ipsquote-userid=\u0022181383\u0022 data-ipsquote-username=\u0022TheMadKraken2297\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/14/2018 at 8:30 AM, TheMadKraken2297 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbut the lift force tore off the wings.... I had unbreakable joints on.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo crash damage will not protect your vessel at high speeds. I’ve had stuff hit the water and have nothing left, even though I had both no crash damage and unbreakable joints on. \n\u003C/p\u003E\n"},{"CreatedByName":"SpacePigeon","CreatedById":182081,"CreatedDateTime":"2018-04-16T12:40:45Z","Content":"\n\u003Cp\u003E\nNot paying attention while docking and crashing into the station that I was trying to dock to.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, I fly my spacecraft at higher than recommended speeds, about everywhere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GrouchyDevotee","CreatedById":175115,"CreatedDateTime":"2018-04-16T16:24:16Z","Content":"\n\u003Cp\u003E\nIn Career mode, I launched 2 expensive probes each with; a lander, and a detachable relay satellite to Duna... I didn\u0027t include ANY relay antennas.\n\u003C/p\u003E\n\u003Cp\u003E\nI have also forgotten to switch to Sandbox to test out build ideas a few times now, very costly.\n\u003C/p\u003E\n"},{"CreatedByName":"53miner53","CreatedById":172955,"CreatedDateTime":"2018-04-16T18:23:00Z","Content":"\n\u003Cp\u003E\nLaunched a shuttle with a reusable kermanned booster... but I forgot to check the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E/\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E after extending it for more fuel, so way too stable. Barely made it on the runway, where I crashed it... with the cockpit surviving. As a side note, FMRS doesn’t like it if you crashland something with only the root part intact, so I had to try again. Decided the water was a better landing spot that time!\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: facepalmed about the design flaw\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-16T18:29:46Z\u0022 title=\u002204/16/2018 06:29  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 16, 2018\u003C/time\u003E by 53miner53\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jetpackmaniac","CreatedById":182323,"CreatedDateTime":"2018-04-16T19:46:45Z","Content":"\n\u003Cp\u003E\nI tried to land a rover on a mountain on Duna. Unfortunately the summit was over 5000 meters, the maximum deploy altitude of the parachutes I was using. Stupidity induced quick loading.\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2018-04-16T20:07:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223356131\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221523908005\u0022 data-ipsquote-userid=\u0022182323\u0022 data-ipsquote-username=\u0022a_space_oddity\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, a_space_oddity said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI tried to land a rover on a mountain on Duna. Unfortunately the summit was over 5000 meters, the maximum deploy altitude of the parachutes I was using.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nParachutes altitude is based off of terrain, not sea level.  Something else cause them not to deploy.  Either pressure or a bug.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-04-16T22:54:11Z","Content":"\n\u003Cp\u003E\nNo doubt pressure, at that altitude on Duna.\n\u003C/p\u003E\n"},{"CreatedByName":"W. Kerman","CreatedById":166763,"CreatedDateTime":"2018-04-17T00:19:36Z","Content":"\n\u003Cp\u003E\n*Accepted nice looking ‘go here’ contract by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E*\n\u003C/p\u003E\n\u003Cp\u003E\nRealized that it was actually on the opposite  side of Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nFacepalm.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"53miner53","CreatedById":172955,"CreatedDateTime":"2018-04-17T02:03:48Z","Content":"\n\u003Cp\u003E\nDesigned a new rover for playing around on Eve, but didn’t include an antenna. *facepalm* Sent a few relays to near Eve space to set up for the orbital insertion (mainly planning and fine tuning, luckily comnet settings allow partial control). Realized I forgot a decoupler for the final stage, so a lot closer on fuel than I thought, especially after a test to see if ion engines can cause explosive decoupling (they can’t). *facepalm 2* At least I thought about correcting it for the craft file so I won’t forget.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-04-17T03:35:00Z","Content":"\n\u003Cp\u003E\nOnce I had to return Jeb from the Mun. He got stuck in kerbin orbit with no jetpack fuel... that rescue was hair-splitting...\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2018-04-17T17:14:00Z","Content":"\n\u003Cp\u003E\nAfter a very classic mining rig-with-no-radiators goof, Val was sent with some spare parts for the local engineers to bolt on.\n\u003C/p\u003E\n\u003Cp\u003E\nShe\u0027s in low Munar orbit, with roughly 550m/s in the tank.  Rather than wasting time docking for more fuel at the orbital station, the thought occurs that she\u0027s landing at a mining rig, and might as well fuel up on the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of the 550m/s is needed to cancel the orbital speed, but the difference between surface and orbital speed should surely cover the extra for descent if it is a well done suicide burn, right?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMany of you, unlike me at the time, will instantly remember that the tidally locked Mun\u0027s surface velocity is only a couple m/s... Thus, despite a perfect suicide burn, this left her about 30m/s short at the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe craft was decimated in the non-traditional sense, leaving only the mk1 capsule, a docking port, and two loose landing legs scattered a couple hundred meters from the mining rig.\n\u003C/p\u003E\n"},{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2018-04-17T23:41:24Z","Content":"\n\u003Cp\u003E\nDuring my massive- wing cargo plane project from earlier that was in no way a disguised BDAc Gunship, another weird thing happened due to lift. I had too much, so I got some unbreakable plane mods. This worked well until the lift pulled the plane off the runway into an uncontrollable tumble. By pulled the plane off the runway, it was like strait up hovering up because of the rediculous lift force. I deleted the craft file in disgust and proceeded to slam my face into my \u003Cs\u003Edesk \u003C/s\u003Ewhite plastic folding table.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-18T00:32:06Z\u0022 title=\u002204/18/2018 12:32  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 18, 2018\u003C/time\u003E by Kernel Kraken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mark Kerbin","CreatedById":167193,"CreatedDateTime":"2018-04-17T23:51:39Z","Content":"\n\u003Cp\u003E\nI may have kinda sorta de orbited the wrong space station.....\n\u003C/p\u003E\n"}]}