{"TopicId":170829,"ForumId":15,"TopicTitle":"Retexturing a model","CreatedByName":"eberkain","CreatedById":157548,"CreatedDateTime":"2018-02-12T15:22:18Z","PageNum":1,"Articles":[{"CreatedByName":"eberkain","CreatedById":157548,"CreatedDateTime":"2018-02-12T15:22:18Z","Content":"\n\u003Cp\u003E\nI\u0027m pretty versed in using GIMP and I did a couple textures for myself for the Hangar mod no problem, those are just .png files.  I was thinking about retexturing a couple of the KW parts that I use so they fit in with VSR better, but those have .dds textures.  Opening one gives an image that is almost completely transparent with just some little wispy bits here and there and layers as mipmaps.  I see the same thing when looking at Vens textures.  Is this just how dds textures are stored?  Is it how the materials and textures are setup on the models?  How should I go about working with these?   Is there a tool to convert back and forth?  Not really sure where to start. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2018-02-12T17:31:21Z","Content":"\n\u003Cp\u003E\nGame textures for KSP typically store the specular channel information (ie, how shiny a given point on the surface should be) in the alpha channel (since most image formats only support RGBA). I don\u0027t remember what the solution to the issue is though. You need to somehow convert transparency to alpha channel. If possible, you don\u0027t want to load with mipmaps - see if you can uncheck that when you open the files.\n\u003C/p\u003E\n"},{"CreatedByName":"Nils277","CreatedById":122414,"CreatedDateTime":"2018-02-22T10:16:14Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157548-eberkain/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022157548\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157548-eberkain/\u0022 rel=\u0022\u0022\u003E@eberkain\u003C/a\u003E When you open the image in GIMP, make sure to not import the mipmaps (i think it\u0027s an option you have to uncheck, when importing the dds texture). As CobaltWolf said, the alpha channel stores how shiny an object is. A lower value in the alpha channel results in a less shiny object.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter you imported the image do the following steps:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nRight click on the layer and select \u0022Add layer mask\u0022 and then select \u0022Layer\u0027s alpha channel\u0022. This adds a greyscale image of the alpha channel to the right of the layer. This layer can be used the alter/change the alpha channel of the image.\n\u003C/li\u003E\n\u003Cli\u003E\nNow, still having the default image selected, click on \u0022Colors\u0022 and the on \u0022Curves\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nIn the drop down menu of the \u0022Curves\u0022 window select \u0022Alpha\u0022 instead of \u0022Value\u0022 and move the left dot of the curve to the top (this sets the alpha values of the original image to 255 making it opaque)\n\u003C/li\u003E\n\u003Cli\u003E\nYou will still see that the image is transparent, this is due to the Layer Mask. When you right click in the Layer and select \u0022Disable Layer Mask\u0022 to see the image fully opaque.\n\u003C/li\u003E\n\u003Cli\u003E\nTo switch between the alpha channel and the colors you have the hold the \u0022ALT\u0022 key and click on the right image (the layer mask)\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n\u003Cstrong\u003ETips:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nTo make sure that the texture only contains the alpha values from the layer mask, right click on the left image in the layer and select \u0022remove alpha channel\u0022 once you are done with step 3.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen you export the texture make sure that the layer mask is not disabled\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nHope this helps\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-22T10:16:26Z\u0022 title=\u002202/22/2018 10:16  AM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 22, 2018\u003C/time\u003E by Nils277\u003C/strong\u003E\n\u003C/span\u003E\n"}]}