{"TopicId":171108,"ForumId":44,"TopicTitle":"Copenhagen Suborbitals on regenerative cooling and water hammer effect","CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2018-02-19T18:03:40Z","PageNum":1,"Articles":[{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2018-02-19T18:03:40Z","Content":"\n\u003Cp\u003E\nCopenhagen Suborbitals put up a nice vid about how regenerative cooling works, featuring a cross-section of a failed engine. They also talk about laminar flow cooling and water hammer effect.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gP48Urfv2NQ?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-02-19T19:53:23Z","Content":"\n\u003Cp\u003E\nAs this is talking about actual spacecraft rather than game ones, the thread has been moved to Science \u0026amp; Spaceflight. \n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2018-02-20T02:41:47Z","Content":"\n\u003Cp\u003E\nVery interesting video! I\u0027ll point out that the engineering complexities involved in regenerative cooling are enough that the RS-68, used by the Delta IV rockets, instead uses mechanically simpler ablative cooling, where they basically coat the interior of the rocket nozzle with a heatshield material.\n\u003C/p\u003E\n\u003Cp\u003E\nI also suspect regenerative cooling is part of what drives RP-1 being so heavily refined; you really don\u0027t want fuel passing over your nozzle to start coking and forming tars and deposits: you need those passages clear. Liquid oxygen isn\u0027t exactly a great choice either, on account of being liquid oxygen.\n\u003C/p\u003E\n\u003Cp\u003E\nI believe part of why the A-4 rockets produced by Germany in the 1940s used 70% alcohol in water was because that mixture has a cool flame temperature, which reduces stress on the engine.\n\u003C/p\u003E\n"}]}