{"TopicId":17226,"ForumId":16,"TopicTitle":"Staging question","CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2012-08-18T18:28:56Z","PageNum":1,"Articles":[{"CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2012-08-18T18:28:56Z","Content":"\n\u003Cp\u003EI have a rover attached at the bottom of my lander - with a decoupler.\u003C/p\u003E\u003Cp\u003Ebut when i land and decouple the rover all stages (4 other) are gone with one hit of [space] and the whole set of stages left are merged into stage zero. \u003C/p\u003E\u003Cp\u003Ewhat is wrong ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-18T18:31:46Z\u0022 title=\u002208/18/2012 06:31  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 18, 2012\u003C/time\u003E by maro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-18T18:35:19Z","Content":"\n\u003Cp\u003EMaro, if your pod is on the rover, then all the parts of your rocket that aren\u0027t part of the rover are now debris, and can not be used, there is no way yet to reattach them.\u003C/p\u003E\n"},{"CreatedByName":"hubbazoot","CreatedById":21881,"CreatedDateTime":"2012-08-18T18:45:30Z","Content":"\n\u003Cp\u003ECan you post a screenshot of your rocket?\u003C/p\u003E\u003Cp\u003EIf jettisoning your stages disconnects another stage, all the intermediary parts get advanced to the next available stage.\u003C/p\u003E\n"},{"CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2012-08-18T19:23:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hubbazoot\u0022 data-cite=\u0022hubbazoot\u0022\u003E\u003Cdiv\u003ECan you post a screenshot of your rocket?\u003Cp\u003EIf jettisoning your stages disconnects another stage, all the intermediary parts get advanced to the next available stage.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/821/screenshot189.png/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://img821.imageshack.us/img821/7621/screenshot189.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUploaded with \u003Ca href=\u0022http://imageshack.us\u0022 rel=\u0022external nofollow\u0022\u003EImageShack.us\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPlan is to land - release the rover and make EVA and then to start again and put the radail attached stages away from the center stage.\u003C/p\u003E\u003Cp\u003EShips works well until rover is detached - then stages 3,2,1, 0 get all merged to 0....\u003C/p\u003E\u003Cp\u003ETried different rovers, tried different decouplers, tried with and without Remote Pods/Antennas....ever the same result.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-08-18T20:51:05Z","Content":"\n\u003Cp\u003EWhen you add stages to the sides like that, very weird things can happen in the stage sequencing, and components can end up firing in an order other than what you intended, and other than the order in which you attached them to the rocket. Once that starts happening during rocket assembly, it can keep happening even after you fix it, so it\u0027s really odd, confusing, and sneaky. So check to see which decoupler is actually firing when you\u0027re hitting the space bar. Is it possible that it\u0027s one of the ones high up in the rocket? Maybe fly up to zero G and try it there, so you can see which parts float away and which stay attached. Also, I don\u0027t know if it\u0027s related or not, but it\u0027s generally a good idea to make decouplers be little stages on their own. That way you don\u0027t accidentally start an engine on a stage and eject the stage at the same time.\u003C/p\u003E\n"},{"CreatedByName":"hubbazoot","CreatedById":21881,"CreatedDateTime":"2012-08-20T20:05:24Z","Content":"\n\u003Cp\u003EI totally understand the frustration with complex staging issues as one of my rovers uses a Curiosity-style landing approach, and I have decouplers and boosters in unusual places.\u003C/p\u003E\u003Cp\u003EA couple tips for you: Put all structural parts in stage 0. Anything not a fuel tank, booster, or stage separator. This makes the list of what is in each stage quite a bit easier to look through.\u003C/p\u003E\u003Cp\u003EIt looks like you have your vertical stage separation in stage 4, I think that\u0027s your problem. Remember that when you mouse over them, they\u0027ll highlight. I generally go through a mental \u0027flight plan\u0027 to make sure I have everything in the right places.\u003C/p\u003E\n"}]}