{"TopicId":172218,"ForumId":32,"TopicTitle":"Brainlord’s Petition to Change the EULA","CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2018-03-12T14:45:12Z","PageNum":3,"Articles":[{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2018-03-13T00:49:11Z","Content":"\n\u003Cp\u003E\nHave you, by chance, had any legal training? I feel like I\u0027m well qualified. I watch judge Judy. (Deal with it glasses slide down). I feel like this is the most accurate interpretation of the EULA. If you have a different one, make a different thread. This is a thread about a petition, not about argueing over the validity of our arguments. If you think our arguments are invalid, then so be it. This is a place to sign a petition, so if you are not signing, \u003Cem\u003Eignore it.\u003C/em\u003E What the heck does it matter to you if we have a petition? The thing about slander? I have not seen any insults in this thread so far. You want slander? (Warning: I am triggered) first grader roast incoming: My dad can beat up your dad. There, now you have your slander. Now that argument is valid.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso: how, in the name of everything Scott Manley ever built, is us saying we want to change the EULA hurting T2\u0027s sales? I feel like this is just you throwing words at us. \n\u003C/p\u003E\n\u003Cp\u003E\nI also noticed I said to stop argueing and ignore it.. so... Oops.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T00:50:57Z\u0022 title=\u002203/13/2018 12:50  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by TheMadKraken2297\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ace in Space","CreatedById":184431,"CreatedDateTime":"2018-03-13T00:55:44Z","Content":"\n\u003Cp\u003E\nI\u0027m probably just opening myself up to get flamed here, but I\u0027m totally with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022122674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0022 rel=\u0022\u0022\u003E@Starman4308\u003C/a\u003E. Just because something\u0027s in the EULA doesn\u0027t mean they\u0027re going to do it. Heck, the company I work for has an entire chapter in the licensing section of our software EULA dedicated to specific rules of use concerning a license type that \u003Cem\u003Edoesn\u0027t even exist.\u003C/em\u003E We have never used it. We aren\u0027t planning on using it. But for whatever reason, it\u0027s in the EULA.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s going on here, it looks like, is that Take Two uses the same EULA for everything. Which means that the EULA needs to cover anything that is applicable to even \u003Cem\u003Eone\u003C/em\u003E of their games. This way their legal team doesn\u0027t need to give themselves a headache maintaining multiple legal documents, which I imagine is quite a bit of work.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat that means is that KSP\u0027s EULA now has contents that do not apply to KSP, but they\u0027re in the EULA anyway because they applied to, say, GTA. The panic here seems to stem from the logic that:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nEULA says they can collect X, Y, and Z.\n\u003C/li\u003E\n\u003Cli\u003E\nThere\u0027s no way for them to get X, Y, and Z within KSP.\n\u003C/li\u003E\n\u003Cli\u003E\nTherefore they\u0027re using methods outside of KSP (i.e. spyware) to collect X, Y, and Z, because otherwise it wouldn\u0027t be in the EULA.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nExcept maybe collecting X, Y, and Z applied in some other property they own, and they just didn\u0027t bother to pull that bit out of the EULA for KSP, because again, they recycle the same EULA for everything.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd by the way, I can absolutely confirm what some people have said about SQUAD not being able to clarify the EULA. Their lack of response should \u003Cem\u003Eabsolutely not\u003C/em\u003E be taken as an admission of \u0022guilt.\u0022 I\u0027ve been one of my company\u0027s software forum representatives, and we are \u003Cem\u003Enot allowed \u003C/em\u003Eto make any kind of comment on what the EULA actually means, or anything that could potentially be taken as a legal statement, because we\u0027re not lawyers, and we might phrase something in a way that can be used as a legal loophole because we\u0027re not speaking legalese. We\u0027re only allowed to quote parts of the EULA verbatim to say \u0022here\u0027s the section you should read\u0022 or in some cases take it to the legal team and let them get back to us to tell us exactly, word for word, what we need to say.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318622\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520902151\u0022 data-ipsquote-userid=\u0022181383\u0022 data-ipsquote-username=\u0022TheMadKraken2297\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, TheMadKraken2297 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe thing about slander? I have not seen any insults in this thread so far.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would say that spreading the unsubstantiated claim that Squad/Take2 has put spyware in KSP, or is going to put spyware in KSP, could be considered slander (or would that technically be libel?).\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I looked it up, and since social media posts are written, they would indeed be considered libel, not slander. But it\u0027s basically the same thing anyway.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T01:24:31Z\u0022 title=\u002203/13/2018 01:24  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Ace in Space\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2018-03-13T00:56:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318622\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520902151\u0022 data-ipsquote-userid=\u0022181383\u0022 data-ipsquote-username=\u0022TheMadKraken2297\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, TheMadKraken2297 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave you, by chance, had any legal training? I feel like I\u0027m well qualified. I watch judge Judy. (Deal with it glasses slide down). I feel like this is the most accurate interpretation of the EULA. If you have a different one, make a different thread. This is a thread about a petition, not about argueing over the validity of our arguments. If you think our arguments are invalid, then so be it. This is a place to sign a petition, so if you are not signing, \u003Cem\u003Eignore it.\u003C/em\u003E What the heck does it matter to you if we have a petition? The thing about slander? I have not seen any insults in this thread so far. You want slander? (Warning: I am triggered) first grader roast incoming: My dad can beat up your dad. There, now you have your slander. Now that argument is valid.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWatching a television show is not three years of law school and passing the bar exam. Not by a long shot.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you came to me and said \u0022I watch a bunch of science shows, I\u0027m qualified to comment on this scientific paper\u0022, I\u0027d have a hard time not laughing. I imagine much the same principle applies to the practice of law.\n\u003C/p\u003E\n\u003Cp\u003E\nInsinuating that Take Two is going to install spyware has no established basis in fact, and acts such as signing an uninformed petition are already starting to have impacts on KSP\u0027s ratings, impacting sales and causing real harm from an imagined threat.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318628\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520902544\u0022 data-ipsquote-userid=\u0022184431\u0022 data-ipsquote-username=\u0022Ace in Space\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Ace in Space said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd by the way, I can absolutely confirm what some people have said about SQUAD not being able to clarify the EULA. Their lack of response should \u003Cem\u003Eabsolutely not\u003C/em\u003E be taken as an admission of \u0022guilt.\u0022 I\u0027ve been one of my company\u0027s software forum representatives, and we are \u003Cem\u003Enot allowed \u003C/em\u003Eto make any kind of comment on what the EULA actually means, or anything that could potentially be taken as a legal statement, because we\u0027re not lawyers, and we might phrase something in a way that can be used as a legal loophole because we\u0027re not speaking legalese. We\u0027re only allowed to quote parts of the EULA verbatim to say \u0022here\u0027s the section you should read\u0022 or in some cases take it to the legal team and let them get back to us to tell us exactly, word for word, what we need to say.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is probably what I was thinking of from the other thread. In this case: Squad wouldn\u0027t be able to release a statement: Take Two\u0027s lawyers might, but they\u0027re probably \u003Cs\u003Elaughing too hard to take this seriously\u003C/s\u003E under the suspicion that any statement would just be further misinterpreted and is just not worth it, hoping it\u0027ll just die down soon enough.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T01:02:21Z\u0022 title=\u002203/13/2018 01:02  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2018-03-13T00:57:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318628\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520902544\u0022 data-ipsquote-userid=\u0022184431\u0022 data-ipsquote-username=\u0022Ace in Space\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Ace in Space said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would say that spreading the unsubstantiated claim that Squad/Take2 has put spyware in KSP, or is going to put spyware in KSP, could be considered slander (or would that technically be libel?).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNah, I won\u0027t flame you.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#3c4043;font-size:small;text-align:left;\u0022\u003Ethe action or crime of making a false spoken statement damaging to a person\u0027s reputation\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#3c4043;font-size:small;text-align:left;\u0022\u003Efrom dictionary.com. it\u0027s slander depending on your point of view. Oops.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2018-03-13T01:33:16Z","Content":"\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n\u003Cp\u003E\nHe keeps [snip] discussing \u0022evidence\u0022 when I\u0027m just talking about intent. \u0022Conflict-of-interest\u0022 doesn\u0027t happen with individuals or corporations, it only applies to government officials or lawyers with clients on both sides of the same case.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd just to be clear: \u003Cu\u003EI never said Take Two Interactive is distributing spyware. \u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI have said they are using (indeed are insisting on) a License Agreement that gives them \u003Cu\u003Epermission\u003C/u\u003E to install spyware\u003C/strong\u003E. (If you are agreeing to it, then you are agreeing to spyware.) And IF they REFUSE to change this license agreement, then I am left with NO OTHER conclusion than it is their intent to install spyware.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease! Disabuse me of this notion! \n\u003C/p\u003E\n\u003Cp\u003E\nPlease alter this agreement so that it is clear that this is not spyware. That is not too much for any consumer to ask.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T03:33:31Z\u0022 title=\u002203/13/2018 03:33  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2018-03-13T01:59:29Z","Content":"\n\u003Cp\u003E\nWhen it comes to interpreting legalese, my brother (a lawyer) has thoroughly disabused me of any notions like trying to defend myself in court or drafting my own contracts. They don\u0027t exactly twiddle their thumbs in law school for three years. There are countless other factors: contracts do not supercede law, reasonable interpretations, judicial precedent, all sorts of other factors that can potentially render a plain-English reading of a legal document a spectacularly incorrect one.\n\u003C/p\u003E\n\u003Cp\u003E\nYou have no evidence even of intent: no historical precedent, no expert opinion on what exactly was meant in the EULA and how broadly it could be applied, nothing. Just fear, an Internet connection, and other fearful people to produce an echo chamber.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve said it again and again: Take Two would be blindingly, staggeringly, jaw-droppingly foolish to try installing spyware. The PR backlash alone would hugely harm their future sales, nevermind the strong possibility that a judge would interpret the EULA in such a way as to forbid spyware and force Take Two to pay an enormous class-action settlement.\n\u003C/p\u003E\n\u003Cp\u003E\nHalf of what props up EULAs is that they\u0027ve never been seriously tested, and Take Two isn\u0027t going to risk the EULA of not just KSP, but every single video game they publish under that same EULA by seeing how moustache-twirlingly evil they can be.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no, they are under no obligation to respond to your petition. The paranoia of a few people isn\u0027t worth Take Two\u0027s time.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not worth any more of my time either. It seems that no matter how many times I point out \u0022you haven\u0027t got a professional to read the EULA, and the sole point of installing spyware would literally be to prove how moustache-twirlingly evil they can be\u0022, nothing seems to stick. Every time the obvious motive of simplifying their legal status by applying the same EULA to everything is pointed out, people assume Take Two has infinite money to draft a custom EULA for everything. Every single time I point out this hysteria is giving potential new players a wholly unjustified false impression and splitting the community of existing players, you just get more hysterical.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T03:34:18Z\u0022 title=\u002203/13/2018 03:34  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EQuoting removed comment.\n\u003C/span\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2018-03-13T02:06:51Z","Content":"\n\u003Cp\u003E\nYou keep ignoring his point, which is:  YOU ARE NOT A LAWYER!\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t care how many so-called EULAs you have written.   Did a lawyer review any of them?  Why don\u0027t you post a link to one of these \u0022EULA\u0022s that you have written so we can see how brilliant you are.  Who knows, maybe you are the most brilliant non-lawyer I\u0027ve ever met.\n\u003C/p\u003E\n\u003Cp\u003E\nBut, until YOU have a lawyer read it, and explain it to  you, then you have no real understanding of what it is saying, and how it is, and can be, interpreted. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T03:34:45Z\u0022 title=\u002203/13/2018 03:34  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EQuoting removed comment.\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2018-03-13T02:11:56Z","Content":"\n\u003Cp\u003E\nAny butcher can hold a knife. And yet. I\u0027d rather have a certified surgeon cut me open to remove an infected appendix than the local meat cleaver \u0022\u003Cem\u003Ewho has plenty experience with cutting meat it.\u003C/em\u003E\u0022 Would you let the gas pipes in your house be fixed by your brother-in-law who has watched \u003Cem\u003E\u0022three or four youtube videos, it\u0027s really not that hard\u0022\u003C/em\u003E or do you play safe and use an licensed \u0026amp; bonded plumber?\n\u003C/p\u003E\n\u003Cp\u003E\nIt works the same with law. Yes, it would be \u003Cem\u003Enice\u003C/em\u003E if it were readable as plain English. But the words do not always have the same meaning, and punctuation matters. An experienced eye can spot deficiencies where you don\u0027t, and won\u0027t get alarmed where you will. So yes, I\u0027ll be more likely to take the word from \u0022\u003Cem\u003Esomeone who studied for it\u003C/em\u003E\u0022 than from a good willing but untrained layman whose approach is \u0022\u003Cem\u003Ehow hard can it be.\u003C/em\u003E\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T03:35:12Z\u0022 title=\u002203/13/2018 03:35  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EQuoting removed comment.\n\u003C/span\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:14:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223317988\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520865912\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E[snipped for brevity]\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell said\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318673\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520904796\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHe keeps ... discussing \u0022evidence\u0022 when I\u0027m just talking about intent. \u0022Conflict-of-interest\u0022 doesn\u0027t happen with individuals or corporations, it only applies to government officials or lawyers with clients on both sides of the same case.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd just to be clear: \u003Cu\u003EI never said Take Two Interactive is distributing spyware. \u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI have said they are using (indeed are insisting on) a License Agreement that gives them \u003Cu\u003Epermission\u003C/u\u003E to install spyware\u003C/strong\u003E. (If you are agreeing to it, then you are agreeing to spyware.) And IF they REFUSE to change this license agreement, then I am left with NO OTHER conclusion than it is their intent to install spyware.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease! Disabuse me of this notion! \n\u003C/p\u003E\n\u003Cp\u003E\nPlease alter this agreement so that it is clear that this is not spyware. That is not too much for any consumer to ask.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell said, you forgot \u0022legalese\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nno offence \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022122674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0022 rel=\u0022\u0022\u003E@Starman4308\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nthat gets really annoying really fast\n\u003C/p\u003E\n\u003Cp\u003E\nIs anyone against changing the EULA like directly against it? \n\u003C/p\u003E\n\u003Cp\u003E\nIf your just against the speculation and concern why. I\u0027m asking honestly why the opposition against changing the EULA to be less spyware type even cares? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T03:36:42Z\u0022 title=\u002203/13/2018 03:36  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EQuoting removed comment.\n\u003C/span\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2018-03-13T02:29:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318709\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520906369\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen it comes to interpreting legalese, my brother (a lawyer) has thoroughly disabused me of any notions like trying to defend myself in court or drafting my own contracts\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, (1) that\u0027s you.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd (2) that\u0027s hilarious. Because I have (A) drafted my own contracts, (B) defended them court myself (it\u0027s called a Pro Se defense)  and (C) WON. (against lawyers, they never got a penny).\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2018-03-13T02:31:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318731\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520907276\u0022 data-ipsquote-userid=\u0022183218\u0022 data-ipsquote-username=\u0022Cheif Operations Director\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Cheif Operations Director said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs anyone against changing the EULA like directly against it? \n\u003C/p\u003E\n\u003Cp\u003E\nIf your just against the speculation and concern why. I\u0027m asking honestly why the opposition against changing the EULA to be less spyware type even cares? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSuppose that somehow, the stars align, and this \u0022open letter\u0022 gets the attention of Squad management.\n\u003C/p\u003E\n\u003Cp\u003E\nSuppose that, not only do the stars align, but the heavens open and out come angels blowing their trumpets and sprinkling pixie dust, and Squad management decides to forward it to Take Two management with the title \u0022An open letter from one of our customers regarding privacy concerns in the EULA\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd suppose that, not only do the stars align, and the heavens open, and we have angels blowing their trumpets and sprinkling pixe dust, \u003Cem\u003Ebut we also have unicorns farting rainbows, \u003C/em\u003Eand Take Two management actually opens the email and reads it.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, at this point, we all agree we\u0027re pretty deep already in fantasy land, right?\n\u003C/p\u003E\n\u003Cp\u003E\nThe email gets read, and is forwarded to T2\u0027s attorneys. I wonder if, in downtown Manhattan, they\u0027ll be able to find a good one. Do they even have attorneys there? But I digress. The attorneys reaction to this letter: \u0022\u003Cem\u003EBWAHAHAHAHA. HAHAHAHAHA. HAHAHAHAHAHA.\u003C/em\u003E\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nReally, you need a lawyer for this stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2018-03-13T02:32:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318726\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520907116\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo yes, I\u0027ll be more likely to take the word from \u0022\u003Cem\u003Esomeone who studied for it\u003C/em\u003E\u0022 than from a good willing but untrained layman whose approach is \u0022\u003Cem\u003Ehow hard can it be.\u003C/em\u003E\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat about a trained layman whose approach is, \u0022I deal with this every day and every night and I know THIS PART way better than you.\u0022 Because that\u0027s what won for me in Court.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T02:35:36Z\u0022 title=\u002203/13/2018 02:35  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:33:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318739\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520908282\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSuppose that somehow, the stars align, and this \u0022open letter\u0022 gets the attention of Squad management.\n\u003C/p\u003E\n\u003Cp\u003E\nSuppose that, not only do the stars align, but the heavens open and out come angels blowing their trumpets and sprinkling pixie dust, and Squad management decides to forward it to Take Two management with the title \u0022An open letter from one of our customers regarding privacy concerns in the EULA\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd suppose that, not only do the stars align, and the heavens open, and we have angels blowing their trumpets and sprinkling pixe dust, \u003Cem\u003Ebut we also have unicorns farting rainbows, \u003C/em\u003Eand Take Two management actually opens the email and reads it.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, at this point, we all agree we\u0027re pretty deep already in fantasy land, right?\n\u003C/p\u003E\n\u003Cp\u003E\nThe email gets read, and is forwarded to T2\u0027s attorneys. I wonder if, in downtown Manhattan, they\u0027ll be able to find a good one. Do they even have attorneys there? But I digress. The attorneys reaction to this letter: \u0022\u003Cem\u003EBWAHAHAHAHA. HAHAHAHAHA. HAHAHAHAHAHA.\u003C/em\u003E\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nReally, you need a lawyer for this stuff.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo your going to not answer my question?\n\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2018-03-13T02:34:26Z","Content":"\n\u003Cp\u003E\nBut is it really even worth suing over this? We don\u0027t even know if it\u0027ll turn out negatively yet or not. Everything thus far is only speculation.\n\u003C/p\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:38:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318244\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520882685\u0022 data-ipsquote-userid=\u0022111598\u0022 data-ipsquote-username=\u0022LordFerret\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, LordFerret said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110905-brainlord-mesomorph/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110905\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110905-brainlord-mesomorph/\u0022 rel=\u0022\u0022\u003E@Brainlord Mesomorph\u003C/a\u003Eand \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261025\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0022 rel=\u0022\u0022\u003E@KSK\u003C/a\u003E\u0027s point. To put it plainly, this EULA is outright devious and manipulative. Not happening. I am not your marketing fodder to have and play with.\n\u003C/p\u003E\n\u003Cp\u003E\nI have however clicked on the \u0027Agree\u0027 button to access these forums, access the Wiki, and to download the update from the store. That\u0027s all I\u0027m going to click on and \u0027Agree\u0027 with though, just enough to obtain updates to my stock install. Now, with that in mind...\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a solution here; It\u0027s called \u003Cstrong\u003E\u003Cu\u003EPULL THE PLUG\u003C/u\u003E\u003C/strong\u003E. That is \u003Cem\u003E\u003Cu\u003Eexactly\u003C/u\u003E\u003C/em\u003E what I\u0027m going to do from here on in. No aspect of this software will be allowed access to the web what-so-ever while it executes. I\u0027ll play my install on an isolated PC with no web access at all if necessary; I don\u0027t need anything (mods, \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, etc) checking for updates for me, I\u0027m perfectly capable of doing that myself. And when it comes to the point where the game will not play without web access, then it will be time for me to move on... \u003Cem\u003Eand I will\u003C/em\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think it collects it while offline and transmits when your online.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318324\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520887808\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell the simple answer to that is for Take Two to not put out a wall of legalese that\u0027s open to misinterpretation and doubt and then stay resolutely silent when people get concerned about it. Instead, they could pull their collective thumbs out and craft a reasonable agreement that\u0027s more suitable to a game like KSP which has grown up as an early-access game with a heavy emphasis on community involvement. But instead they throw their standard \u0027we reserve the rights to own everything and have total control\u0027 boilerplate at us.\n\u003C/p\u003E\n\u003Cp\u003E\nOr in other words - don\u0027t pull a dork move, refuse to explain said dork move  and then act surprised when people call you on it, reasonably or unreasonably.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yeah - about explaining themselves. I\u0027m curious why you think that Take Two would conflict themselves by providing clarification on their own damned agreement. Because I\u0027m really not seeing how that works. If you are right (which is possible I suppose), then you end up with some ridiculous situations:\n\u003C/p\u003E\n\u003Cp\u003E\nParty A:  This is our draft contract - please read it over and sign it if you\u0027re happy.\u003Cbr\u003E\nParty B:  Umm, it\u0027s mostly OK but we\u0027re not sure about clauses 4.1, 5.4 and 7.8. We think we could make them work but could you give us some background, so we can see where you\u0027re coming from and why you need them?\u003Cbr\u003E\nParty A:  Nope - can\u0027t do that because we\u0027d be giving you legal advice which would a conflict of interest on our part.\u003Cbr\u003E\nParty B:  ...\n\u003C/p\u003E\n\u003Cp\u003E\nAll I can say is that I\u0027ve been involved in plenty of contract negotiations alongside our legal team and I can safely say I\u0027ve never seen anything like the above. I have seen plenty of examples of Party B stonewalling with a \u0027these are our standard terms\u0027 line, without further explanation (which isn\u0027t terribly helpful) but I\u0027ve never seen them claim that telling us anything else would be a conflict of interest.\n\u003C/p\u003E\n\u003Cp\u003E\nOh - and to the folks who aren\u0027t really fussed about the new terms and conditions because they don\u0027t believe it\u0027s in Take Two\u0027s interest to enforce the more draconian ones? Well you might be right. Or you might not. Now, I could be missing something but since Take Two bought out the rights to KSP, I haven\u0027t seen anything from them about the game. I have no idea what their intentions are, how they feel about the community or anything. In fact the sole interaction I\u0027ve had with them, is the introduction of these egregiously lopsided terms and conditions. I have no basis for trusting them or for assuming that I should take the EULA and privacy policy at anything other than face value. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, for what it\u0027s worth, I agree that they would be stupid to enforce various terms of their EULA. But it would hardly be the first time that a large company has made a stupid decision in the name of greed or short term gain.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly companies are companies \n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2018-03-13T02:40:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318740\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520908364\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat about a trained layman whose approach is, \u0022I deal with this every day and every night and I know THIS PART way better than you.\u0022 Because that what won for me in Court.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou still haven\u0027t posted any of your so-called self-written EULAs.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far, all I see is someone who is blowing smoke, without anything to back up anything he says.\n\u003C/p\u003E\n\u003Cp\u003E\nYou say you\u0027ve won in court.  Ok, then prove it.  Court cases are public records, tell us the details so that we can see if you can prove anything you\u0027ve been saying about yourself.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, city, state (I assume that you are in the US, if not then the equivalent would do), court case #, date, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nParaphrasing your own words:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E I will assume that if you do not provide the requested information, then you are simply blowing hot air (I\u0027d prefer to say something else, you can guess what).  \u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:45:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318359\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520889285\u0022 data-ipsquote-userid=\u0022178900\u0022 data-ipsquote-username=\u0022invision\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, invision said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nno one is forcing you to agree. if you dont like the EULA then you do not have to accept it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually you do have to accept it or not play it. See the below quote\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318393\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520891271\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLOL I disagree.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027ll have to get a judge to tell me that they get to turn a game I already bought into spyware, and then tell me not to play it while they keep my money. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly you prove my point\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318549\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520898514\u0022 data-ipsquote-userid=\u0022181383\u0022 data-ipsquote-username=\u0022TheMadKraken2297\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, TheMadKraken2297 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven more so they\u0027re not invested in the community, they just Control- C Control- V\u0027d their other EULAs. I know I\u0027m just feeding the flame, but from what I understand about computers,  you cannot get our info from a game which is not connected to the internet without a software bug. Might just be me but I feel like that\u0027s the definition of spyware- or a Trojan horse. Hey look, here\u0027s a game about explosions and happy green guys! (Company is allowed to issue an update in which spyware- is included).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318389\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520891005\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, you probably have seen a popup about new terms of use, few days ago, here on the forums, and also on wiki. If you\u0027re still using this forum, then you have already accepted new rules. Because it stated clearly, paraphrasing here: \u0022if you\u0027re not accepting it, you must stop using the software from this moment\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2018-03-13T02:46:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318752\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520909106\u0022 data-ipsquote-userid=\u0022183218\u0022 data-ipsquote-username=\u0022Cheif Operations Director\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Cheif Operations Director said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually you do have to accept it or not play it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou don\u0027t have to accept it if you don\u0027t run it through Steam.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-13T02:51:36Z\u0022 title=\u002203/13/2018 02:51  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 13, 2018\u003C/time\u003E by Clockwork13\u003C/strong\u003E\n\u003Cbr\u003Emistaking ppl\n\u003C/span\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:48:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318573\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520899671\u0022 data-ipsquote-userid=\u0022181383\u0022 data-ipsquote-username=\u0022TheMadKraken2297\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, TheMadKraken2297 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027re not saying that that WILL, we are saying that the EULA is so broad to the point that it dosen\u0027t even specify where they\u0027re collecting the info from. Sure I might not be putting my bank account information in my Module Manager but given the EULA they\u0027re allowed to collect our info from \u003Cem\u003Eanywhere, \u003C/em\u003Enot just our KSP files.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso: have you even \u003Cem\u003Eread \u003C/em\u003Ethe EULA? If not I\u0027d suggest to stop suggesting a lawyer. You don\u0027t need a lawyer when it\u0027s so blantantly stated. Any common idjit can understand it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318755\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520909214\u0022 data-ipsquote-userid=\u0022100102\u0022 data-ipsquote-username=\u0022Clockwork13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Clockwork13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou don\u0027t have to accept it if you don\u0027t run it through Steam.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW, please stop trying to dodge \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129964\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0022 rel=\u0022\u0022\u003E@linuxgurugamer\u003C/a\u003E\u0027s question\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI bought it on steam\n\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2018-03-13T02:51:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318757\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520909280\u0022 data-ipsquote-userid=\u0022183218\u0022 data-ipsquote-username=\u0022Cheif Operations Director\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Cheif Operations Director said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI bought it on steam\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can run directly run KSP.exe from your KSP directory.\n\u003C/p\u003E\n"},{"CreatedByName":"Cheif Operations Director","CreatedById":183218,"CreatedDateTime":"2018-03-13T02:52:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318759\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520909483\u0022 data-ipsquote-userid=\u0022100102\u0022 data-ipsquote-username=\u0022Clockwork13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Clockwork13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can run directly run KSP.exe from your KSP directory.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI already accepted because I trusted them to not back stab me..\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2018-03-13T02:52:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318747\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520908802\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou still haven\u0027t posted any of your so-called self-written EULAs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell I\u0027ve just spent a good  20 minutes poking around the web and don\u0027t find any to link to anymore. Your welcome to go buy this: \u003Ca href=\u0022https://www.renderosity.com/mod/bcs/pzdb-1-3/72733/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.renderosity.com/mod/bcs/pzdb-1-3/72733/\u003C/a\u003E  there\u0027s one in there.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the case I won, It was 10 years of litigation between 2000 and 2010, Palm Beach County, used to know the docket number. But more to the point I really don\u0027t care if you believe me or not.\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2018-03-13T02:52:59Z","Content":"\n\u003Cp\u003E\nOk, guys, this is getting a bit heated. Let\u0027s take some time to cool off, shall we? I\u0027m locking this thread for a bit so everyone can take a step back and reflect.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-03-13T03:43:36Z","Content":"\n\u003Cp\u003E\nOkay, a fair number of personal remarks have been removed from the thread. We will re-open the thread for discussion, but if it turns personal again, we might need to close it for good. \n\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2018-03-13T03:49:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223318746\u0022 data-ipsquote-contentid=\u0022172075\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520908682\u0022 data-ipsquote-userid=\u0022183218\u0022 data-ipsquote-username=\u0022Cheif Operations Director\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Cheif Operations Director said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think it collects it while offline and transmits when your online.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor it to transmit anything the software would have to be executing. Anything \u0027alien\u0027 trying to execute on my system would be squashed like a bug before it got launched... and I keep very close watch on what processes run on my system. Don\u0027t we all?\n\u003C/p\u003E\n"}]}