{"TopicId":172763,"ForumId":98,"TopicTitle":"Around the World in 80 Minutes?!","CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2018-03-21T13:26:34Z","PageNum":1,"Articles":[{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2018-03-21T13:26:34Z","Content":"\n\u003Cp\u003E\nTime to announce my first mission that took several hours to test and put together.  A mission called \u0022Around the World in 80 Minutes?!\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is the objective of this mission?  Well, just circumnavigate Kerbin within an 80 minute (1 hour and 20 minutes) time frame.  You can play four of your favorite kerbals (two who are pilots) or you can play even a guest Kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\nWho is this guest Kerbal?  Why, it\u0027s none other than Chuck Kermanl!  In fact, playing him we\u0027ll lead to quite a few interesting easter eggs.  Play the mission and find out!\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of overall difficulty, it can range from normal to difficult depending on skill and aircraft design.  I decided to classify it as a hard mission as circumnavigating and then landing can be a difficult feat.  Even more difficult is doing it in an 80 minute time frame.  However, it is possible to do as I tested it.  There is even a special reward (which admittedly, I haven\u0027t even got yet.) that gives you points for doing it in 60 minutes!  This is actually quite possible depending on design and skill.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the long awaited link:  \u003Ca href=\u0022https://drive.google.com/open?id=1Wll6qYMPojKb5dMH-mcw3IUONOKVUzpK\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/open?id=1Wll6qYMPojKb5dMH-mcw3IUONOKVUzpK\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFeel free to use this mission as a foundation for your own missions or even ideas from the mission.  Heck, this could even encourage a pack of missions dealing with Chuck Kerman and his life as a highly skilled test pilot!\n\u003C/p\u003E\n"}]}