{"TopicId":172886,"ForumId":15,"TopicTitle":"Adding a seat to IVA newbie modding from scratch","CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2018-03-23T18:22:00Z","PageNum":1,"Articles":[{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2018-03-23T18:22:01Z","Content":"\n\u003Cp\u003E\nHi modding gurus,\n\u003C/p\u003E\n\u003Cp\u003E\nInspired in part by MacLuky and the undersized MHdlc LEM, I  want to add a seat in to the stock MK1 and Mk2 Landercan IVAs - as it has been proven that there is plenty of space! Yes I can add a seat via crew capacity - but I want to see the little green lasses and laddies properly.  I\u0027m also not interested in additional props like ASET.\n\u003C/p\u003E\n\u003Cp\u003E\nI have installed Unity, and part tools, added a passenger seat prop, or a pilot seat from the props and \u0027wrote\u0027 the .mu file.  Changing the part\u0027s CFG for number of seats and for Internal model  doesn\u0027t seem to work as no IVA shows up?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m assuming it isn\u0027t as simple as this what I assumed.\n\u003C/p\u003E\n\u003Cp\u003E\nDo I need to be working with both the part and the internal in the same scene?  As I\u0027ve only been loading in the internal.   Do I need to include texture files as well?\n\u003C/p\u003E\n\u003Cp\u003E\nOr do I need to add the seat to the internal in blender and then export to unity?\n\u003C/p\u003E\n\u003Cp\u003E\nKinda really starting from scratch here sorry.  I\u0027ve seen that there are a few hour plus videos.  I don\u0027t have much time, like 30 mins a day to do any \u0027work\u0027 or gameplay, so pointing me at the best tutorial for this would be appreciated if that would be more beneficial. Thank you!\n\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2018-03-23T19:24:41Z","Content":"\n\u003Cp\u003E\nHi adding this extra seat is going to take a little more than dragging the models into the IVA , but it\u0027s not extra tough, although having worked out the how to , it\u0027s not extra easy either \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n  You\u0027ll not be able to do this to an existing IVA as such and have it show.  You\u0027ll need to export the IVA you wish to add the seat to,  duplicate the parts and fitting layout , Add in your extra seat . seat Transforms, eye transforms etc if you want full use, as these have to be baked into the mu, as that\u0027s what the internal cfg is looking for in a section like this\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003EMODULE\n\t{\n\t\tname = InternalSeat\n\t\tseatTransformName = seat1\n\t\tportraitCameraName = Cam1\n\t\tallowCrewHelmet = false\n\t}\n\tMODULE\n\t{\n\t\tname = InternalCameraSwitch\n\t\tcolliderTransformName = driverglass\n\t\tcameraTransformName = EyeTransform1\n\t}\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\nAll those named items are unity game objects baked into the mu,  and if it doesn\u0027t find them there it\u0027ll throw errors .\n\u003C/p\u003E\n\u003Cp\u003E\n  When you add things to a spawned by part tools IVA  the only items you can add with any success are prop items, those not being individual remote models. All the important seat  eye and cm transforms are already baked into that spawned iva.\n\u003C/p\u003E\n\u003Cp\u003E\nA thought occurred while writing this,  a possible way around all this messing around would be to create a seat part complete with all the required transforms,  run it through unity , create a prop cfg for it , have part tools spawn it, and then maybe it would perhaps work, can\u0027t say, but done a lot of IVA\u0027s the normal way \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  You wouldnt get the window and eye transforms right BUT you\u0027 have a good chance with the seat and cam transform\n\u003C/p\u003E\n\u003Cp\u003E\nSomething i\u0027ve found useful over the years\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/2eb6w9ggjd27add/kerbonaut-for-camera-positioning.dae?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/2eb6w9ggjd27add/kerbonaut-for-camera-positioning.dae?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNote that with this fella when he\u0027s placed on a seat , the seat transform needs to be at around the same height as his feet in order not to hover above the seat\n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2018-03-23T20:01:03Z","Content":"\n\u003Cp\u003E\nThanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/50907-spannermonkeysmce/\u0026amp;do=hovercard\u0022 data-mentionid=\u002250907\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/50907-spannermonkeysmce/\u0022 rel=\u0022\u0022\u003E@SpannerMonkey(smce)\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the \u0027normal way\u0027 to add to an existing IVA is to put .mu file into blender (there are instructions somewhere for this i know) 3d model/ manipule the objects which includes actual seat, the .seat transforms which is where the kerbal will appear? and .eye transform camera position? for iva and I guess a camera spot to view the kerbal in flight view?\n\u003C/p\u003E\n\u003Cp\u003E\nThen put back into unity for export as a .mu file for a win.\n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2018-03-23T21:20:05Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223332523\u0022 data-ipsquote-contentid=\u0022172886\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521835263\u0022 data-ipsquote-userid=\u0022122369\u0022 data-ipsquote-username=\u0022theJesuit\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, theJesuit said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo the \u0027normal way\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell NORMALLY,  (for me) it\u0027s done at the time the pod is created, so from the raw model file, which gives you a unity scene you can rearrange and re export to your desires.  Aside from exporting the IVA mu and re sorting all the transforms ( as i find they\u0027re  rotated wrong by the exporter local rotations become global rotations )  colliders and textures and then back to unity i cant see any other way to get the result you want. \n\u003C/p\u003E\n\u003Cp\u003E\nNot saying among all the modders here we don\u0027t all have sneaky little tricks,  and there may yet be a way to do it, that i haven\u0027t thought of,  One thing you learn about modding  KSP is that there are many ways to get to the same end point\n\u003C/p\u003E\n"}]}