{"TopicId":173112,"ForumId":50,"TopicTitle":"Deploy those tail fins!","CreatedByName":"NewtSoup","CreatedById":178829,"CreatedDateTime":"2018-03-27T19:17:37Z","PageNum":1,"Articles":[{"CreatedByName":"NewtSoup","CreatedById":178829,"CreatedDateTime":"2018-03-27T19:17:37Z","Content":"\n\u003Cp\u003E\nI\u0027ve often wondered what the deploy function was for on winglets and tail fins.  They didn\u0027t seem to have much use at all.  So I\u0027ve never, ever bothered binding that function to an action group.  \u003Cbr\u003E\u003Cbr\u003E\nThis is my current \u0022Science Plane\u0022 - It\u0027s got an octo for stability control - a load of science bits a couple of engines and two tail fins, the reaction wheel is not necessary, I just like it for making \u0022on the spot\u0022 turns instead of faffing around taxiing in a circle.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00222xFriKw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/2xFriKw.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIts ugly but it flies pretty well and it does the job.  The wing section at the front is for a kerbal to stand on when they climb out of the cockpit.  As long as you are doing less than 80m/s you don\u0027t get blown off the wing.  Though I wouldn\u0027t recommend \u0022let go\u0022  or \u0022climb out\u0022 or you will disappear into the distance which is why everything can be reset from the cockpit door - no the wing is to stand on to take surface samples when landed really.\u003Cbr\u003E\u003Cbr\u003E\nAnyway back to my point - I\u0027ve always had to slow down to do EVA\u0027s in flight and to reset the science stuff.  This has led me to wish I had air brakes.  Today though I thought \u0022I wonder?\u0022 so I went back to the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E and bound the deploy function to \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E toggle because I only have basic action groups available right now.\u003Cbr\u003E\u003Cbr\u003E\nLo and Behold a PAIR, you must have 2 or things will go very bad for you, a PAIR of  fins turn in on each other and produce a massive amount of drag working just like an air brake!.  This resulted in my first ever successful landing at the abandoned island air field.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022ywo0lji.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://imgur.com/ywo0lji.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see the tail fins are turned inward this allows me to really control my speed on approach to a runway and indeed on the runway itself to aid in braking.\u003Cbr\u003E\u003Cbr\u003E\nI would highly recommend this kind of setup (2 fins or winglets ) to anyone making planes because it\u0027s just so useful.\u003Cbr\u003E\u003Cbr\u003E\nThe first deployables you get are in Aviation  ( Tail Fin ) and Flight Control ( AV-8 Winglet) - Obviously you need Aviation for making planes anyway but there may be a use for deployed winglets in aerobraking maneuvers.\n\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2018-03-27T19:39:39Z","Content":"\n\u003Cp\u003E\n\u0022Deploying\u0022 just actuates the control surface either up or down depending on the tweakable.   I\u0027ve found it handy for flaps on approach as well as airbrakes.\n\u003C/p\u003E\n"},{"CreatedByName":"Dark Lion","CreatedById":166634,"CreatedDateTime":"2018-03-27T20:19:03Z","Content":"\n\u003Cp\u003E\nI stumbled onto this a completely different way, but I digress, we mustn\u0027t overlook the fact that the fins of yours are higher from center, aiding the nose up too! This force is much greater applied with low-attached forward canards, of course, where you can get even bigger-booty-birdies with lower thrust-to-weight ratios out of the water if you need to. Used in combination... and just perfectly placed, your birds might just land \u003Cem\u003Ethemselves\u003C/em\u003E safely!\n\u003C/p\u003E\n"}]}