{"TopicId":17331,"ForumId":18,"TopicTitle":"Harddrive failing","CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-08-20T00:59:12Z","PageNum":1,"Articles":[{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-08-20T00:59:12Z","Content":"\n\u003Cp\u003EAlright here\u0027s the low-down\u003C/p\u003E\u003Cp\u003EI was given a computer (11 years old Dell) that would endlessly reboot, after BIOS loaded it would display a quick message that I believe said \u0022Invalid Boot Directory\u0022 or something along those lines, it flashed by too quick too read.\u003C/p\u003E\u003Cp\u003EI put in Ubuntu 10.04 live cd to figure out what was going. During the installation process Ubuntu said there was no OS on the drive and wanted to use the whole thing.\u003C/p\u003E\u003Cp\u003EHowever, looking at the partition table I could see /dos and /windows as possible mount points.\u003C/p\u003E\u003Cp\u003EI exited the installation and went right to the live cd part and found a 54gb drive available (harddrive is 80gb total)\u003C/p\u003E\u003Cp\u003E\u0022Great!\u0022 Thought I.\u003C/p\u003E\u003Cp\u003E\u0022Now I can just copy the files over and save them!\u0022 But naive was I, and Ubuntu was quick to point that out.\u003C/p\u003E\u003Cp\u003EWell rather, it was slow. 15 seconds later it spat back an \u0022Input/Output\u0022 error and was unable to mount the drive.\u003C/p\u003E\u003Cp\u003EI then ran some harddrive tests and it came back with a couple of bad sectors, but it didn\u0027t say the drive was failing interestingly enough.\u003C/p\u003E\u003Cp\u003ESo any suggestions on how to save the data? I have a spare HD upstairs I can plugin, I also have a flashdrive to use.\u003C/p\u003E\u003Cp\u003EBut my most obvious issue is getting the Drive to mount. I\u0027m not sure how to handle this\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-08-20T02:22:26Z","Content":"\n\u003Cp\u003EI\u0027m having a hard time understanding what the real issue is. The old drive was a Windows OS drive, yes? And you want to save the information on the 11 year old drive, or just get it to boot? If all you want is some files off it, install an OS on your spare HD and then mount the old drive as a slave so you can access it and copy what you need. If it fails to read or mount at that point, the drive is likely failing.\u003C/p\u003E\u003Cp\u003EThe last time I had an invalid boot error on a drive that caused it to reset repeatedly after bios, it turned out it was an invalid boot.ini file and running the Recovery option off the Windows OS CD fixed the problem. It\u0027s been a long time since I did anything with Ubuntu though, so I dunno why it won\u0027t mount the drive. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-08-20T02:28:21Z","Content":"\n\u003Cp\u003EYeah the goal is just to get the files off. It won\u0027t mount though, that\u0027s my issue.\u003C/p\u003E\u003Cp\u003EI\u0027m trying a program I found called ddrescue, although it\u0027s just installing it is giving me issues. I think it\u0027s because I\u0027m using an old version of ubuntu.\u003C/p\u003E\u003Cp\u003EI wanted to do a windows recovery, but it\u0027s Windows XP (I don\u0027t have it) and the original CD has been lost to the nether realm.\u003C/p\u003E\u003Cp\u003EI just installed Ubuntu 10.04 on my spare HD and hooked up the Failing HD on the side, just as you said, but I noticed immediately that the Grub Boot Loader flashed the HD in red and didn\u0027t give me the option to boot from there, and now Ubuntu isn\u0027t even showing it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m really hoping something like ddrescue will be able to spot the HD, or it\u0027s something simple like me not hooking it up correctly.\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-08-20T02:57:23Z","Content":"\n\u003Cp\u003EI am almost willing to bet you can find a .iso file of the windows recovery tool only somewhere on the net that would allow you to make a bootable recovery CD without the full Windows OS CD. The drive won\u0027t mount in Ubuntu, but it\u0027s still recognized in the bios right?\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-08-20T03:25:45Z","Content":"\n\u003Cp\u003EI haven\u0027t checked in BIOS yet, but the GRUB Bootloader finds it. As I said, it flashes the title \u0022Maxtor 80Gb\u0022 in red at while it checks the drives for valid Boot directories. After that, though, I can\u0027t find it.\u003C/p\u003E\u003Cp\u003EI\u0027ll check out the boot recovery. It should be worth an investigation tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"Joe Pinball","CreatedById":12672,"CreatedDateTime":"2012-08-20T22:32:09Z","Content":"\n\u003Cp\u003E\u0022find\u0022 yousrelf a copy of Hiren\u0027s BootCD\u003C/p\u003E\u003Cp\u003EBoot said CD, select the Mini Windows XP\u003C/p\u003E\u003Cp\u003Erun partition find \u0026amp; mount thats on the Live XP you\u0027ve just booted\u003C/p\u003E\u003Cp\u003Ecopy off all you can grab (try RoadKil\u0027s Unstoppable Copier, bung it on a pendrive)\u003C/p\u003E\u003Cp\u003EJoe\u003C/p\u003E\n"}]}