{"TopicId":173536,"ForumId":51,"TopicTitle":"Horizons: a Journal from a Mission Controller","CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-06T01:14:04Z","PageNum":1,"Articles":[{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-06T01:14:04Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EEntry 1\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJune 29, 1956\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMany of us at the Mission Control Center are becoming anxious for our first orbital launches. Gene and Bobak seem especially restless. With the recent speech by USKR leader Aaron Kerman, many of us are starting to doubt that it will be us - the Kerbal States - sending the first satellite into orbit. The administrators told us to not focus too hard on it, and as a result the Spaceplane Hangar teams have been a little more than busy over the past few months. In the tail end of 1955, we accomplished the first polar landing by plane, even though the crew was bound to the plane and didn\u0027t have enough fuel to get back. The KS Navy thankfully had a patrol ship in the area loading up on supplies in a village a bit further north. The plane was damaged beyond repair on the second landing in the local area, flipping on its roof. We\u0027ve even tried to send a flight out to the North Pole, but simulations showed the mountains on the way are a little too high for the Freedom 1 to pass over.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from that, we\u0027ve already achieved suborbital flight. An engineer swung by earlier today and told us their readying Voyager III for launch again. Some say the Voyager series was a ripoff of the USKR\u0027s \u0022Grestin\u0022 series, or the USKR stole the design from us - I personally think it\u0027s a coincidence of designs, but it\u0027s a little controversial around the space center. Back on topic, the launch will probe the outer space region with a magnetometer - which none of us really know what it does, which is why we have a scientist on staff during missions.\n\u003C/p\u003E\n\u003Cp\u003E\nSome of the controllers are also being reassigned to a tracking facility in the East across the bay from the space center. They haven\u0027t released a list of names yet, but for some reason I heavily suspect I\u0027m going there instead of staying for the action here at the space center. Gene told me not to worry so much - the team there will still get a chance to control satellites once they lose connection with the space center. It probably won\u0027t be the only tracking facility operating. To take my mind off of some of the stresses of working at a space center, I set up my telescope I got for Christmas last year. I haven\u0027t shared any discoveries with the science team, mainly due to the lack of anything they would find interesting up there that they haven\u0027t found first. Gene is encouraging me to keep a record of what I find in the sky and eventually report it to the science team. So far, I haven\u0027t found anything especially of interest.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(Out of the entry, OOC: This is my first fan work of literally any game, and I\u0027ve been inspired to start one after reading Ussari, Alien Skies, Kerbin Elcano Exploration Project, and now Kerny Kerman\u0027s Journal. If any of the authors of those series happen to be reading this - thank you for your inspiration!)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-07T00:37:56Z\u0022 title=\u002204/07/2018 12:37  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 7, 2018\u003C/time\u003E by Unturned_Fighter\u003C/strong\u003E\n\u003Cbr\u003ENaming error\n\u003C/span\u003E\n"},{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-06T20:22:09Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EEntry 2\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJuly 16, 1956\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EGene informed me I was not, in fact, going to the new tracking facility. I would instead be focusing on some contracts to verify the functionality of some experimental parts. It’s not one of the most interesting things in the world, but it will give us some more money to operate with. That isn\u0027t the main focus of this entry, though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EBefore we start focusing on the part test contracts, Gene wants somebody to verify the southern point of the continent to potentially set up an “ship graveyard” dock. While I haven’t been there myself, I hear it’s beautiful. I don’t really have an interest, personally. I’ve never been much of a traveler.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EThis will probably be the final deployment for a little while of the Freedom 1 before it gets sent to the Ship Graveyard itself. The problem is it’s too expensive to operate – I’ve been spending some of my off-time designing a few plane concepts that I’ll propose to some engineers in the aircraft hangar tomorrow. I just hope nobody raids my locker until then. I dub the new plane “Liberty 1.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003ELiberty 1 is not all that special of a design. If put into service, it can only fit one kerbal inside of it and has extremely limited storage capacity. The building materials will be relatively cheap and will include a “Continental” prop engine. Unlike the Freedom 1, it will have wings mounted to the roof instead of the cabin itself, which if the seaplane version is also put into service, will have two Continental engines mounted to the wings instead of one to the front of the cockpit. We’ll see how it plays out tomorrow.\n\u003C/p\u003E\n"},{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-07T20:45:55Z","Content":"\n\u003Cp\u003E\n\u003Ci\u003EEntry 3\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EJuly 17, 1956\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003ESince the mission to find the local southernmost point hasn’t actually begun, I took a chance to swing by the engineers’ rec room on my morning break and dropped off the designs. The engineer in charge took a look at them, and to my amazement and confusion, starting laughing. After the fit was over, he simply looked at me and said “I didn’t expect this from a controller.” I take that as a “it’ll be put to trials as soon as possible.” I hope it gets a chance to fly the mission in a few days’ time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EThe House of Senators also recently passed legislation regarding the space agency. I’m not one to jump into politics, but I had to write this after I heard what the legislation was about. The legislation proposed sending kerbals into space, and as an agency owned and run by the government, we are required by law to listen to this legislation. Jebediah is in training sessions at Space City* to become the first kerbal in space, or so I hear. We won\u0027t be immediately rushing astronauts into space. We can only imagine how the USKR will respond.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EThe Control Center is also going under a refit over the next couple of days to allow for manned missions of all sorts. It won’t be that big of an expansion, but most notably we get these new-fangled computers instead of having to write down important information all the time. I’m personally a little indifferent towards these computers. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EI’ve been particularly observing a new little moonlet orbiting Kerbin. I don’t really call it anything, but I’ll be sure to take some of my reports to the Science Conference tomorrow. In the mean time, Gene called me to a mass conference in the large Briefing Room. Gene said that the Liberty 1 will be put to airspace patrols near the space center, and that I will be the first to fly it – he also said Jebediah and Valentina will get a chance at flying the Liberty 1 as well. I hope they like it just as much as I do.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003E*Space City is a reference to the Soviet/Russian Star City used to train their cosmonauts. If I remember correctly, it has the Yuri Gagarin Cosmonaut Training Center\u003C/i\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-08T21:39:24Z","Content":"\n\u003Cp\u003E\n\u003Ci\u003EEntry 4\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EAugust 30, 1956\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EYesterday, in order to get us a little bit of money, we built a craft to test a protective fairing and a wheel. Not much happened during that bit of testing, but we got the job done and a little bit of funds with it. The craft didn’t last long.\n\u003C/p\u003E\n\u003Cp align=\u0022center\u0022 style=\u0022text-align:center;\u0022\u003E\nAnyway, I was assigned to the control room today for the flight. The plane used will be the Liberty 1, but since I am not technically a private pilot yet, I cannot test fly it so Jebediah will be flying it for the mission. The flight was an overwhelming success if not a little long – Jebediah found what he calls Southern Point but did not perform a landing due to fears that the ground is a little less than flat.\u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022center\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022X9mo8J1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022669\u0022 src=\u0022https://i.imgur.com/X9mo8J1.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EGene sternly told Jebediah that we \u003Ci\u003Ewill \u003C/i\u003Eland there but failed to provide a date of when this might happen. The report said it had a beautiful view of the ocean right at the foot of a mountain with a relatively steep cliff going to the ocean – not the gentle, sandy beaches we have at the space center. Bill got a little excited when Gene said they would get around to building a few residences there for the astronauts, being the engineer and all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EFrom what I hear, the next biggest challenge is flying supplies to the location, which with the size of the storage in the Liberty 1, will be next to impossible. The flights will be spendy, since not only will we have to deploy the 30 grand Freedom 1, we will have to purchase the inflatable materials which add to the cost of the deployment, guaranteed to go above our current budget by a longshot.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EEarlier in the day, Gene handed me a couple of reports from the government outlining our performance, giving us 12 and 9 grand per report. Gene expects that once we achieve orbit, our funding will be upped by a few notches to encourage us to push ever further with our new-found money. We’re beginning to rely less and less on contracts, but Gene says we should still take a few in between quarterly reports.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EIn this mornings briefing folder, the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E crews elected to include that Jebediah would begin his training this October, in preparation to become the first kerbal in space. As Flight Director of this particular mission, Gene said there would be less fault directed towards me since it is a manned mission. I’ve always appreciated Gene’s encouraging words, but things are only going to get stressful from here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EIn related news, the payload is absolutely amazing! Well, not the payload. The payload itself is actually quite ugly – a computer core, a flywheel to help turn the craft in space, and a radio antenna so we can talk to the satellite when we get line of sight. We have a few around the equator, but only for a fraction of the orbit will we have a direct connection to the satellite, and it doesn’t help that we might have to talk by phone to other tracking centers as the “supreme commander.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EWernher von Kerman, our chief scientist, payed a visit to me on my lunch break and ran down a few issues with my design for a new plane. It was much cheaper, and he commended me on that, but since I wasn’t directly observing the takeoff I only now learned that the plane had a tendency to tilt back onto its tail. The plane will be put out of service for a little while until both I and the engineering team can agree on how to fix it – I’m not a fan of the style of the tail anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E                \u003C/span\u003EBob said he is getting a little antsy to get into space, and can’t wait to get to the Mun or Minmus. It’s only going to be stressful for the probes we inevitably send there first, but I share his excitement in seeing the first pictures from the far side of the Mun. Not only is this entry getting long, but it’s now 10:45 in the evening and I should probably be getting some sleep for tomorrow – Gene wants to see me in his office about an hour before Kerbolrise. I can only wonder for what he might want.\n\u003C/p\u003E\n"},{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-09T20:10:45Z","Content":"\n\u003Cp\u003E\n\u003Ci\u003EEntry 5\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EAugust 31, 1956\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI walked into Gene’s office simply not knowing what to expect. Gene was only one of \u003Ci\u003Efour \u003C/i\u003Ekerbals who had wanted me in his office this early in the morning. The other kerbals waiting for me was Dr. Wernher von Kerman, our resident scientist, Dr. Henry, the chair of the Committee of Field Science, and then Walt Kerman, who was simply our Public Relations Department representative. No one really knows why he was a hazmat suit…\n\u003C/p\u003E\n\u003Cp\u003E\nThe rooms\u0027 walls were covered in wood paneling, with the far wall having various newspapers such as The Daylight Register and The Today’s Chronicle. Gene was always the type of kerbal to read the newspaper before his daily briefing, which is unique for a kerbal who sits upon a vast wealth of power.\n\u003C/p\u003E\n\u003Cp\u003E\nThe group of 4 kerbals, collectively known as the Group of 4, weren’t the only kerbals in the room. There was one from the Bureau of Naval Defense and another from the Civil Aerospace Defense Service. The kerbal from the BND was proudly wearing the Marine Commendation ribbon on his uniform, and it seemed he prized it well.\n\u003C/p\u003E\n\u003Cp\u003E\nDr. Henry was the first to speak to me. As he began to speak, the door behind me was locked, with two more Bureau of Naval Defense officers guarding it.\n\u003C/p\u003E\n\u003Cp\u003E\n“So, Mark, if that’s what you prefer to be called. Before we begin our order of business, we all would like to congratulate you on your promotion to Flight Director-“\n\u003C/p\u003E\n\u003Cp\u003E\n“Wait, what?” was my simple, only response. I was rather surprised, as I had always imagined Gene being the Flight Director. I was patiently awaiting a response from any of the kerbals in the room before me. Gene was the next to speak up.\n\u003C/p\u003E\n\u003Cp\u003E\n“Were you not informed, Mark?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Nope. Nobody said so much as a whisper towards me about it.” I was still rather confused.\n\u003C/p\u003E\n\u003Cp\u003E\n“Well, suffice to say I voluntarily stepped down from my position as Flight Director in order to focus more on running the agency. You were a valuable part of my team, and as such I intended to have you as my successor whenever I retired or stepped down.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Well, nobody told me anything. Now I do sincerely apologize Dr. Henry, please continue what you were saying.” Deep down, I was never informed of this change in my position, or that Gene intended to make me his successor, but it was all done and over with and I couldn’t change much unless I wanted to name someone \u003Ci\u003Emy\u003C/i\u003E successor and step down. Dr. Henry continued where he left off.\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes, we would like to congratulate you on your promotion to Flight Director, Mark. Upon the recommendation of Gene Kerman and the Group of 4, you are hereby an official member of Sector J and the Group of 4 – now to be renamed the Group of 5. As Flight Director, you are now authorized to know \u003Ci\u003Eeverything \u003C/i\u003Eat the space center, including classified projects.” The airman and sailor in the room didn’t so much as flinch since I entered the room. Dr. Henry passed along two folders towards my end of the table.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the folders was marked “Classified Projects” in bold, red letters. The other was marked “Your Responsibilities and Duties as a Flight Director” in bold, but black letters. Dr. Henry instructed me to open whichever folder I pleased. I then opened the folder containing my responsibilities and duties. Reading the only booklet in the folder, I know learned my responsibilities included:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nOverseeing flight operations\n\u003C/li\u003E\n\u003Cli\u003E\nMaking sure my team is on task\n\u003C/li\u003E\n\u003Cli\u003E\nTaking responsibility for both my actions and my teams\u0027 actions\n\u003C/li\u003E\n\u003Cli\u003E\nAnd selecting a compatible team to ensure proper functionality.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI also learned that, excluding myself, the entire Mission Control Center was on leave until I get spare time to select members of my team. Upon asking Dr. Henry, he said to pick whenever you want. I elected to conduct the interviews on the 1\u003Csup\u003Est\u003C/sup\u003E of October.\n\u003C/p\u003E\n\u003Cp\u003E\nThe final pages of the booklet contained names of potential team members and their most compatible positions within the control center. I elected to leave out the Public Affairs Officer that I would have for my team, as I felt it was not necessary at this stage of space travel.\n\u003C/p\u003E\n\u003Cp\u003E\nDr. Henry then instructed me to open the Classified Projects folder at my leisure, but strictly when I was alone, and with that, ended the meeting. The door was unlocked, and we all filed out of the room followed by the guards. I suspected this wasn’t the last I would see of them.\n\u003C/p\u003E\n\u003Cp\u003E\nReturning to my station with lunch, there was a very important looking kerbal standing at the entrance to my office. He had to be wearing at least 13 ribbons on his chest, one of which also happened to be the Marine Commendation ribbon. He introduced himself as Brigadier General Hayes. I unlocked my door and he followed me into my office – I took an educated guess that he might want the door locked and the blinds shut.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneral Hayes announced he was working for Project Sandcastle. He shared with me sensitive information that essentially dimmed down to the government’s plans to put a kerbal on the Mun sometime in the future, and elaborated secondary goals that included putting the first kerbal in space, the first satellite in orbit around both Kerbin and the Mun, and then the first kerbal in orbit of both bodies as well. He said I was also considered the “flag officer of the space agency,” and was hereby promoted to Air Kadet of the Kerbin Military Defense Force Space Forces.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneral Hayes, finished with his briefing, asked for the door to be unlocked as he had to return to a classified site, obviously not knowing I was now part of Sector J. Like the guards, I assumed this would not be my last encounter with him, but merely my first. As I am writing this entry, it is now getting later and later by the minute and I should close this entry for the night. I have a sneaking suspicion It will be a busy day for me.\n\u003C/p\u003E\n"},{"CreatedByName":"Unturned_Fighter","CreatedById":183292,"CreatedDateTime":"2018-04-13T10:39:26Z","Content":"\n\u003Cp\u003E\nI just wanted to let folks know that the thread is not dead - I am busy doing some play sessions for future chapters and writing the next said chapter - it should be ready in a day or two.\n\u003C/p\u003E\n"}]}