{"TopicId":17356,"ForumId":32,"TopicTitle":"Confessions of a KSP-aholic","CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2012-08-20T12:51:24Z","PageNum":1,"Articles":[{"CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2012-08-20T12:51:24Z","Content":"\n\u003Cp\u003EI thought it would be fun if we had a thread where we all confess the shameful, secretive or crazy things we do in KSP.\u003C/p\u003E\u003Cp\u003EI\u0027ll get us going:\u003C/p\u003E\u003Cp\u003ESometimes, if a rocket test is going well, I tend to keep going to see how far I can get.\u003C/p\u003E\u003Cp\u003EI secretly love it when a rocket launch goes catastrophically wrong and everything explodes..\u003C/p\u003E\u003Cp\u003EYour turn!\u003C/p\u003E\n"},{"CreatedByName":"dt890","CreatedById":8704,"CreatedDateTime":"2012-08-20T13:07:47Z","Content":"\n\u003Cp\u003EI leave kerbals to die in orbit around kearth instead of leaving them on the launchpad, to save other crew members stranded elsewhere.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-08-20T13:14:54Z","Content":"\n\u003Cp\u003EI have a strange relationship with Kerbonaut safety.\u003C/p\u003E\u003Cp\u003EI don\u0027t willfully do any harm to them. If any are stranded in any way, I put a lot of effort in saving them.\u003C/p\u003E\u003Cp\u003EHowever I routinely put them into rockets with highly questionable success of getting off the pad without exploding, and think nothing of it.\u003C/p\u003E\n"},{"CreatedByName":"SLAMS","CreatedById":27519,"CreatedDateTime":"2012-08-20T13:39:41Z","Content":"\n\u003Cp\u003ESame as Bsalis.\u003C/p\u003E\u003Cp\u003EAlso, I tend to make a working design for a mission in one or two shots. Then once it works I pile on more and more power until it is almost unflyable...\u003C/p\u003E\u003Cp\u003EWhy, because kerbals.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-08-20T13:58:57Z","Content":"\n\u003Cp\u003EI sometimes strand Kerbals, so I send a rescue mission. However, I never remember to EVA someone at the start, and so I get to a high orbit, lower periapsis into the ground, and EVA one. Kind of defeats the purpose, though.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-08-20T14:03:27Z","Content":"\n\u003Cp\u003ESometimes i build ships just to carpet bomb the moons with debris.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-08-20T14:06:29Z","Content":"\n\u003Cp\u003EI also sometimes make ships just to see how fast I can hit a Kerbal into Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Czman007","CreatedById":22578,"CreatedDateTime":"2012-08-20T14:32:10Z","Content":"\n\u003Cp\u003EI usually see how big an orbit a rocket can make without running out of fuel instead of doing a reentry burn.\u003C/p\u003E\n"},{"CreatedByName":"flaillomanz","CreatedById":8088,"CreatedDateTime":"2012-08-20T14:38:34Z","Content":"\n\u003Cp\u003EI feel bad for ending flights. If a kerbal survives a mislaunch, I let them live instead of reusing them. That isn\u0027t very eco-friendly, though... most people like to recycle their Kerbals instead of leaving them to pollute the environment.\u003C/p\u003E\u003Cp\u003EI also have a habit of putting too many parachutes on test-flights, landers for example. My rationalization is that the poor sods testing my death tra-- Erm, brilliant rocketry experiments- well, they don\u0027t deserve death if I forget something important.\u003C/p\u003E\u003Cp\u003EAnd I NEVER delete persistence files... just move them to a safe place.\u003C/p\u003E\u003Cp\u003EKSP also seeps into real life occasionally. Strange dreams. Weird thoughts (\u0022I should turn warp on - sure, it disables physics, but this bus is going \u003Cem\u003Eslo-o-oooow\u003C/em\u003E\u0022).\u003C/p\u003E\u003Cp\u003EIt\u0027s also given me a strange appreciation for the world we live in. (Don\u0027t ask.)\u003C/p\u003E\n"},{"CreatedByName":"TheKerbinator","CreatedById":29261,"CreatedDateTime":"2012-08-20T14:58:15Z","Content":"\n\u003Cp\u003EI like to fire a rocket straight up, creating a very elliptical orbit. Then when the ship enters the atmosphere again at ludicrous speeds I love to see the G-meter spike the red like it\u0027s nobodies business when the ship plows into the lower atmosphere like a brick wall.\u003C/p\u003E\n"},{"CreatedByName":"UtterN","CreatedById":30360,"CreatedDateTime":"2012-08-20T15:10:22Z","Content":"\n\u003Cp\u003EWell, my relation to kerbal safety is very strange. Whenever a kerbal dies after having done something stunning such as landed on the mun (yes it\u0027s still a fantastic accomplishment for whenever I land successfully on the mun) I fell kind of sad that I could not save the kerbal. But when I\u0027m testing new rocket designs I just go through kerbal life like if it was baking soda.\u003C/p\u003E\n"},{"CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2012-08-20T15:19:34Z","Content":"\n\u003Cp\u003EI secretly cross my fingers every time I land on the Mun in hopes of a non-fatal catastrophic accident so I can send a rescue mission... Or make the crew walk halfway across the Mun to a permanent research base to catch a flight there. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Seanoog","CreatedById":8599,"CreatedDateTime":"2012-08-20T16:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbalnaut\u0022 data-cite=\u0022Kerbalnaut\u0022\u003E\u003Cdiv\u003ESometimes i build ships just to carpet bomb the moons with debris.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny pictures Kerbalnaut?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheKerbinator\u0022 data-cite=\u0022TheKerbinator\u0022\u003E\u003Cdiv\u003EI like to fire a rocket straight up, creating a very elliptical orbit. Then when the ship enters the atmosphere again at ludicrous speeds I love to see the G-meter spike the red like it\u0027s nobodies business when the ship plows into the lower atmosphere like a brick wall.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI love doing the opposite, strapping massive amounts of boosters, in an attempt to find craft designs, that subject my kerbals too 10\u002B G Starts.\u003C/p\u003E\u003Cp\u003EI launch 90% of my rockets, an get them into stable orbits, or land on Kerbin/Mun/Minimus, an then just leave the craft\u002BKerblas there.\u003C/p\u003E\u003Cp\u003EHeck some times, I build entire colonies on planets just too see lots of craft/kerbals in one place, never with the intention of returning them to home...\u003C/p\u003E\u003Cp\u003EIn craft construction, A craft spends its entire life designationed PROTO-1/2/3, an litterally goes throught HUNDREDS of Design itterations, in the persuit of perfect craft designs, an only then does it get a Full ship name (Typically named after Star Trek, Ship classes \u0022TRIDENT/CONSTITUTION\u0022)\u003C/p\u003E\u003Cp\u003EI laught out loud all the time, when my poor Kerbals are subjected to horrable/firey deaths! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kaijar","CreatedById":34932,"CreatedDateTime":"2012-08-20T16:33:30Z","Content":"\n\u003Cp\u003EWhen I successfully landed on the moon for the first time, I jumped up and down in my room and yelled several things that can\u0027t be repeated here. Ever since then, I keep a soda next to my computer as a celebratory reward for whenever I complete a particularly tricky mission.\u003C/p\u003E\u003Cp\u003EI also usually design my munar landers to be a two stage rocket like the Eagle just for the heck of it. I like seeing the debris after of where I was able to land.\u003C/p\u003E\n"},{"CreatedByName":"ZootinZack","CreatedById":38280,"CreatedDateTime":"2012-08-20T16:44:50Z","Content":"\n\u003Cp\u003EI played so much that when I\u0027m just idle at my laptop (watching a video or whanot) my left hand automatically goes in W-A-D configuration with my pinkie alternatively on the Shift or Ctrl key.\u003C/p\u003E\u003Cp\u003EAlso when I watch KSP videos, I get so into it that I try to rotate view or go to map mode, then realize I\u0027m watching a video... then feel like a dumbass.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2012-08-20T18:00:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022flaillomanz\u0022 data-cite=\u0022flaillomanz\u0022\u003E\u003Cdiv\u003EKSP also seeps into real life occasionally. Strange dreams. Weird thoughts (\u0022I should turn warp on - sure, it disables physics, but this bus is going \u003Cem\u003Eslo-o-oooow\u003C/em\u003E\u0022).\u003Cp\u003EIt\u0027s also given me a strange appreciation for the world we live in. (Don\u0027t ask.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can so relate. I often have KSP inspired moments of madness when waking up; like feeling like I don\u0027t have enough fuel to overcome the gravitational pull of bed or that I need to rendezvous with the alarm clock! I\u0027m getting used to it now, after all, madness is a way of life. The appreciation of world thing is harder to explain! Stupid little things; like the apoapsis and thrust needed to come off the roundabout at optimal speed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZootinZack\u0022 data-cite=\u0022ZootinZack\u0022\u003E\u003Cdiv\u003EAlso when I watch KSP videos, I get so into it that I try to rotate view or go to map mode, then realize I\u0027m watching a video... then feel like a dumbass.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes! I can\u0027t help myself from trying to rotate the view in vids. Everytime! Pavlov suggests I should learn, but noooo.\u003C/p\u003E\n"},{"CreatedByName":"FishyFishy13","CreatedById":21494,"CreatedDateTime":"2012-08-20T18:15:23Z","Content":"\n\u003Cp\u003EI will launch ship after ship that blow up in atmosphere to save one kerbal stuck on the Mun. I kill like 21 kerbals to save one.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-08-20T18:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seanoog\u0022 data-cite=\u0022Seanoog\u0022\u003E\u003Cdiv\u003EAny pictures Kerbalnaut?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike, bombing, so they crash into the terrain. Not staying in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2012-08-20T18:34:30Z","Content":"\n\u003Cp\u003EI find myself hitting \u0026gt; key during downloads or loading bars... ALL THE TIME.\u003C/p\u003E\n"},{"CreatedByName":"that1guy","CreatedById":14276,"CreatedDateTime":"2012-08-20T19:07:37Z","Content":"\n\u003Cp\u003EWhen I play KSP, I play by the mentality of, \u0022huh, I wonder if that failure was my design or some fluke during launch\u0022 I then try the same flight over again.\u003C/p\u003E\u003Cp\u003EAlso, I only care about 4 kerbals Jeb, Bill, Bob, and Kyle J. (I renamed one), everyone else is a piece of rocket fodder with a weird first name\u003C/p\u003E\n"},{"CreatedByName":"segaprophet","CreatedById":14087,"CreatedDateTime":"2012-08-20T19:34:46Z","Content":"\n\u003Cp\u003EBeing crazy enough to attempt landing trailer-sized (3 crewtank) hab modules on the Mun.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/5621-Supersonic-Laboratories-Excellence-In-Engineering\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/2850668/_ksp/Misc/torus_preview.jpg\u0022 alt=\u0022torus_preview.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-08-20T19:40:26Z","Content":"\n\u003Cp\u003EI tell myself I built these things to make re-entry tests on heat shields and parachutes. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/gciHy.jpg\u0022 alt=\u0022gciHy.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?9b8ybchreawapp7\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?9b8ybchreawapp7\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/mW2Bh.jpg\u0022 alt=\u0022mW2Bh.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?6wjxgxl6cz8hhz6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?6wjxgxl6cz8hhz6\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI did not build these things to test parachutes and heat shields. \u003C/p\u003E\u003Cp\u003E(Start the engines (throttle 2 notches over 2/3rds for the second one) and wait for the decouplers to cook off. First one: \u0022light fuse and get away.\u0022 Second one: See how many times you can get the capsule to bounce in the exhaust flow without touching anything.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-20T19:47:54Z\u0022 title=\u002208/20/2012 07:47  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 20, 2012\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-08-21T08:07:43Z","Content":"\n\u003Cp\u003EI will confess that I built a payload delivery system tonight that included three mounts for kerbals to ride along. After a few hilarious failures at getting the rocket into orbit, I finally achieved space. While still in suborbital trajectory, I noticed I was coming up on a perfect opportunity for an attempt at a TMI burn with the payload. So I sent two of the crew to board the payload, and after re-adjustment of the craft\u0027s attitude I launched the payload. Now this payload system used three large stock SRB\u0027s as the thrust, as I trusted they would make a decent difference in orbital velocity. (Inspired by Cap\u0027n Skunky\u0027s recent comic at attempts of dealing with the Space Kraken.)\u003C/p\u003E\u003Cp\u003EThe PDS stayed on course for quite a fair amount of the burn, but then it started to spiral out of control. In the course of the spiralling, both kerbals lost their grip. One lost its life due to impact with the PDS itself, but the other was sent on a trajectory that I was quickly able to determine would pass under the Mun and into Kerbol orbit. Using the EVA pack, I managed to adjust the heading for a Munar SOI insertion. It wasn\u0027t enough to establish orbit, but at least that adventurous kerbal will get a nice view of the Mun before leaving the Kerbin neighborhood.\u003C/p\u003E\u003Cp\u003EIt was all an entirely fun adventure that I did out of spontaneity. The remaining kerbal that remained in the CM was visibly upset at being the only one left to return home. But I did make sure to get him home safely so he could be consoled by his friends and family.\u003C/p\u003E\u003Cp\u003EI think it might be worth working on stabilizing the PDS in order to work a Free Return Trajectory, and give two or even three kerbals a trip for the record books.\u003C/p\u003E\u003Cp\u003EYes, I could use MechJeb for more control, but I like leaving it to the whims of fate.\u003C/p\u003E\u003Cp\u003EI would like to thank Cap\u0027n Skunky and Scott Manley(szyzyg) for the ideas and help in making the craft.\u003C/p\u003E\n"},{"CreatedByName":"Grand Lander","CreatedById":31521,"CreatedDateTime":"2012-08-21T08:19:26Z","Content":"\n\u003Cp\u003EI make many different models of crafts and leave them on the mun or minumus and dont interact with them after i land them =p no return missions yet. i got one craft going to return to kerbal in 4 days kerbal time.\u003C/p\u003E\n"},{"CreatedByName":"ScramUK","CreatedById":26224,"CreatedDateTime":"2012-08-21T11:20:25Z","Content":"\n\u003Cp\u003EI like to collide kerbals at high velocity...\u003C/p\u003E\u003Cp\u003EThe things I have done -they keep me up at night. On a VERY low orbit on Mun using the ship I simply called \u0027Orbiter V1\u0027; The periapsis got as low as 3k, and happened to be directly over a ship I previously landed \u0027TAK v2\u0027... Bringing a kerbal out of each ship, I tried to get them to high five one another on passing. It\u0027s kind of like trying to hit a pin with another pin took a few passes to accomplish it..\u003C/p\u003E\u003Cp\u003EUpon collision the brave little Kerbinaut from TAK v1 was shot into the nearby ship at around 200 m/s, vaporised onto the ships hull with enough force to induce a spin on the craft.\u003C/p\u003E\u003Cp\u003EStatus of Orbiter v1 cew:\u003C/p\u003E\u003Cp\u003EBill \u0026amp; bob are freaking out...\u003C/p\u003E\u003Cp\u003EJeb remains in orbit.....somewhere in the northern hemisphere of Mun\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-21T11:23:25Z\u0022 title=\u002208/21/2012 11:23  AM\u0022 data-short=\u002211 yr\u0022\u003EAugust 21, 2012\u003C/time\u003E by ScramUK\u003C/strong\u003E\n\u003C/span\u003E\n"}]}