{"TopicId":174016,"ForumId":51,"TopicTitle":"Flight to Laythe","CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2018-04-17T20:58:06Z","PageNum":1,"Articles":[{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2018-04-17T20:58:06Z","Content":"\n\u003Cp\u003E\nAfter reading a few of the great mission reports \u0026amp; stories on here, I decided to try telling the story of my career mission to Laythe.  I hope you all enjoy this first chapter. \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ci\u003EPresent Day -\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022By the Kraken, that was a long flight.\u003Cspan\u003E  \u003C/span\u003EGood thing the seats fold down in the passenger cabin.\u0022\u003Cspan\u003E  \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hJgTdZJ.png?1\u0022 class=\u0022ipsImage\u0022 height=\u0022322\u0022 src=\u0022https://i.imgur.com/hJgTdZJ.png?1\u0022 width=\u0022572\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Oy4j5Gl.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022361\u0022 src=\u0022https://i.imgur.com/Oy4j5Gl.png?2\u0022 width=\u0022571\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb looked back from the controls of the Pumera-Laythe at Kelrik Kerman, senior engineer \u0026amp; his companion for the last several years.\u003Cspan\u003E  \u003C/span\u003EFinally, they were in orbit of Laythe \u0026amp; ready to rendezvous with the Laythe science station to rejoin the rest of the team.\u003Cspan\u003E  \u003C/span\u003EOnce they were all squeezed in, there was one more leg – down to Lancer-Laythe base, and the first footsteps on Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile Jeb was thinking about the rendezvous, Kelrik looked over the readouts from the ground station again.\u003Cspan\u003E  \u003C/span\u003EAutomated systems all reported fully functional.\u003Cspan\u003E  \u003C/span\u003EIt had already mined enough ore to fill its own tanks, so there shouldn’t be any issues getting the Pumera refueled once they were on the ground.\u003Cspan\u003E  \u003C/span\u003EIt may take a while – Lancers were bare bones ground facilities designed to give minimal lodging \u0026amp; refueling capability in remote locations.\u003Cspan\u003E  \u003C/span\u003EKel didn’t relish the idea of the six of them being stuck in Lancer-Laythe for the next 4 years waiting on a recovery mission.\u003Cspan\u003E  \u003C/span\u003EAt least there was also the Sagan Sea floating base, if it landed intact two days from now.\u003Cspan\u003E  \u003C/span\u003EThe idea of dropping the massive floating base – with attached pontoon boat no less – through Laythe’s atmosphere, and hitting the water without destroying major components sent a shiver down Kel’s spine.\u003Cspan\u003E  \u003C/span\u003EHe knew it was possible – he’d run the numbers himself – but it was still an amazing feat with plenty of opportunities for the Kraken to rear its head.\n\u003C/p\u003E\n\u003Cp\u003E\nDespite the long journey, Kel was glad he had been chosen to ride with Jeb on the Pumera.\u003Cspan\u003E  \u003C/span\u003EThe new spaceplane design was a thing of beauty and other than a quick spacewalk to jettison the ferry tanks after they were empty, the trip was really just a long, scenic vacation.\u003Cspan\u003E  \u003C/span\u003EConsidering all the rescues, station construction and practice flights leading up to the Jool mission, he appreciated the break.\u003Cspan\u003E  \u003C/span\u003EThe only downside was his wife was assigned to the crew transfer vehicle with Val.\u003Cspan\u003E  \u003C/span\u003ESomebody at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had made that decision despite multiple protests.\u003Cspan\u003E  \u003C/span\u003EAt least they were all close enough to maintain comms during the flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x6jOWnW.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022467\u0022 src=\u0022https://i.imgur.com/x6jOWnW.png?2\u0022 width=\u0022570\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe one thing that still nagged at Kelrik was the choice of a Jool mission on this scale so soon.\u003Cspan\u003E  \u003C/span\u003EThey didn’t have lander or even orbital probes in position around all the moons yet.\u003Cspan\u003E  \u003C/span\u003EIn fact, nothing had arrived when the crewed mission launched.\u003Cspan\u003E  \u003C/span\u003EAnd what a mission – nearly 80% of the program\u0027s budget was spent on the launches.\u003Cspan\u003E  \u003C/span\u003ETwo surface bases, an orbital science station, the crew transfer vehicle, communication \u0026amp; survey satellites, two separate probe landers and not one but two spaceplanes – a Xerosere-Laythe Amphibian was also arriving in about a month, being pushed backwards the whole way by a nuclear tug. \u003Cspan\u003E \u003C/span\u003ENot to mention additional comm and survey sats for the other moons \u0026amp; Jool itself.\u003Cspan\u003E  \u003C/span\u003EThe intent was to send mining rigs to Vall, Bop or Pol at the next window once they’d been properly surveyed \u0026amp; the best option  chosen.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lk71YRh.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022326\u0022 src=\u0022https://i.imgur.com/lk71YRh.png?2\u0022 width=\u0022471\u0022\u003E\u003Cimg alt=\u0022HR7oiCf.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022325\u0022 src=\u0022https://i.imgur.com/HR7oiCf.png?2\u0022 width=\u0022474\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut Kel knew something must be going on that the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E leadership wasn’t sharing.\u003Cspan\u003E  \u003C/span\u003EWhile Eve may be a hard target to plant a flag on, Moho was more than feasible.\u003Cspan\u003E  \u003C/span\u003EDuna still didn’t have any ground bases, and the second crewed Duna mission was already on its way back home.\u003Cspan\u003E  \u003C/span\u003ECertainly Jool - and Laythe in particular - were very appealing, but the rush was unusual.\u003Cspan\u003E  \u003C/span\u003EThe first set of probes to Jool weren’t even half-way there when the manned missions launched - unlike the first missions to both moons \u0026amp; Duna.\u003Cspan\u003E  \u003C/span\u003EThey could well have gotten here to find conditions totally unsuitable, with only the orbital station for support until the return window.\u003Cspan\u003E  \u003C/span\u003EYet they went – so many flights going to Jool, the tracking display looked like there was a tear in space from the volume of white orbital tracks.\u003Cspan\u003E  \u003C/span\u003EStill, back to the business at hand.\n\u003C/p\u003E\n\u003Cp\u003E\n“Jeb, looks like you’re going to need to burn 112.4 m/s to match velocity with the station.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Thanks, I’ve got it programmed in.\u003Cspan\u003E  \u003C/span\u003EJust a few minutes now.”\n\u003C/p\u003E\n\u003Cp\u003E\nThe minutes ticked down till Jeb fired the Rapiers to match velocity.\u003Cspan\u003E  \u003C/span\u003EThey didn’t have much oxidizer left, but the station was too close to the exhaust to safely fire the NERV.\u003Cspan\u003E  \u003C/span\u003EAfter a few seconds, silence returned to the Pumera, then the radio crackled to life:\n\u003C/p\u003E\n\u003Cp\u003E\n“Okay boys, we’re all suiting up to EVA over to you.”\n\u003C/p\u003E\n\u003Cp\u003E\nJeb smiled as he replied, “Come on, Laythe is waiting for us.”\n\u003C/p\u003E\n\u003Cp\u003E\nOne by one, the rest of the team EVA’d to the waiting spaceplane, leaving Lisa to tend to the station \u0026amp; continue research on data gathered so far.\u003Cspan\u003E  \u003C/span\u003EOnce they were all in, Kel repressurized the cabin \u0026amp; opened the door to see his wife floating on the other side, grinning ear to ear.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222VcbDJG.png?3\u0022 class=\u0022ipsImage\u0022 height=\u0022463\u0022 src=\u0022https://i.imgur.com/2VcbDJG.png?3\u0022 width=\u0022529\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DC4Pd8Q.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022343\u0022 src=\u0022https://i.imgur.com/DC4Pd8Q.png?2\u0022 width=\u0022611\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ETo be continued...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-17T20:58:40Z\u0022 title=\u002204/17/2018 08:58  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 17, 2018\u003C/time\u003E by Cavscout74\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-04-23T17:48:05Z","Content":"\n\u003Cp\u003E\nVery nice! Good writing and story \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181783-cavscout74/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022181783\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181783-cavscout74/\u0022 rel=\u0022\u0022\u003E@Cavscout74\u003C/a\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2018-04-23T18:18:35Z","Content":"\n\u003Cp\u003E\nThanks for the compliment.  I was enjoying writing it, but I\u0027m on pause right now due to me getting fed up with bugs in the latest version of KSP.   I\u0027m currently back enjoying my 1.3.1 hard career right now till we get a working version of KSP again.   Besides loading slower, running slower, fairings that don\u0027t actually do their job (the floating base was a HUGE pain to launch), \u0026amp; docking ports that won\u0027t connect, the last time I played the career for this story, my \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E decided to quit working while trying to dock with Laythe station.  Twice.\n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2018-04-23T19:35:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223361981\u0022 data-ipsquote-contentid=\u0022174016\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524507515\u0022 data-ipsquote-userid=\u0022181783\u0022 data-ipsquote-username=\u0022Cavscout74\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Cavscout74 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the compliment.  I was enjoying writing it, but I\u0027m on pause right now due to me getting fed up with bugs in the latest version of KSP.   I\u0027m currently back enjoying my 1.3.1 hard career right now till we get a working version of KSP again.   Besides loading slower, running slower, fairings that don\u0027t actually do their job (the floating base was a HUGE pain to launch), \u0026amp; docking ports that won\u0027t connect, the last time I played the career for this story, my \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E decided to quit working while trying to dock with Laythe station.  Twice.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI hear you. My game refuses to load ships other than the active one, which includes kerbals... I can\u0027t EVA anymore...\u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-23T22:09:54Z\u0022 title=\u002204/23/2018 10:09  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 23, 2018\u003C/time\u003E by obney kerman\u003C/strong\u003E\n\u003Cbr\u003ETO, NOT OT!\n\u003C/span\u003E\n"}]}