{"TopicId":174258,"ForumId":32,"TopicTitle":"Have I reached the end?","CreatedByName":"Scarecrow","CreatedById":65767,"CreatedDateTime":"2018-04-25T16:06:35Z","PageNum":1,"Articles":[{"CreatedByName":"Scarecrow","CreatedById":65767,"CreatedDateTime":"2018-04-25T16:06:35Z","Content":"\n\u003Cp\u003E\nI\u0027ve been playing KSP for quite some time now (since 0.17 I think) and have welcomed each upgrade as it came along.  Along the way I have sent manned missions to all of the landable planets and moons, and actually managed to bring everyone home safe again.  I\u0027ve completed a career mode through to unlocking all of the tech tree, but for the most part usually play sandbox mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI am still on v1.3.1 as I believe a few new bugs were introduced with 1.4 and the version I am currently playing seems quite stable.  On top of that, I also understand there is new DLC, but you need to pay for that to have access.  At this point I feel that I have had my money\u0027s worth out of the game and will no longer be chasing each new upgrade as it is made available. \n\u003C/p\u003E\n\u003Cp\u003E\nThere are a couple of reasons for this.  I\u0027ve always enjoyed sharing my creations with other players, and have downloaded many a vessel from the Craft Exchange thread and KerbalX.  As I don\u0027t feel inclined to hand over more money for the DLC (looking upon it as a slippery slope that is only likely to get steeper) it\u0027s obvious that my version of the game will soon be completely incompatible with the latest iteration, and such sharing will no longer be possible.  As there appears to be no new gameplay content in the update, I can\u0027t see that it will offer me much more than I can already get from the version I am playing.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe I have become jaded after playing the game for so long, but I have to admit that it has been one of the best games I have ever played, have learned loads about orbital mechanics, and feel that you would need to look long and hard to find a game that gives anywhere near the bang for buck that KSP gives.  But I somehow feel that for me, I have reached the end of the road.\n\u003C/p\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2018-04-25T16:26:57Z","Content":"\n\u003Cp\u003E\nGet a planet pack and start anew \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are lots of mods out there which bring replayability to the game.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2018-04-25T16:41:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363560\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524672395\u0022 data-ipsquote-userid=\u002265767\u0022 data-ipsquote-username=\u0022Scarecrow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Scarecrow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been playing KSP for quite some time now (since 0.17 I think) \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E[…]\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003Ethere is new DLC, but you need to pay for that to have access\u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot if you bought the game before may(?) 2013. I assume you did since you say you were playing since 0.17, but assumptions can be wrong.\n\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2018-04-25T17:11:22Z","Content":"\n\u003Cp\u003E\nI\u0027ve been thinking much the same for much the same reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nI got the game in September of 2013. I played through Steam for a while but found it interfered with the game so I started going right to the EXE file.\n\u003C/p\u003E\n\u003Cp\u003E\nGot tired of only being able to play 32 bit so I installed Linux Just so I could play in 64 bit.\n\u003C/p\u003E\n\u003Cp\u003E\nIt helped a lot. The memory leak took longer to crash the game and the game was generally smoother.\n\u003C/p\u003E\n\u003Cp\u003E\nI have landed and returned from everywhere. I have played with most of the mods. Most of which, like the game are buggy and need workarounds.\n\u003C/p\u003E\n\u003Cp\u003E\nStill.. must be well over 5000 hours... That\u0027s like 8 months in game? my goodness.. that\u0027s a long time... many people have had marriages that have lasted less time than that.\n\u003C/p\u003E\n\u003Cp\u003E\nI was about 3 months shy of the date for free DLC and I am not sure that I am up to buying it or if it would have made me feel more like playing had I got it. If I knew it would extend the life of the game for me enough then perhaps I\u0027d talk my hands into my pockets.\n\u003C/p\u003E\n\u003Cp\u003E\nI keep looking in the \u0027What do you do in KSP Today\u0027 thread to see if anything inspires or teases me enough to have another bash at something but so far the well is dry.\n\u003C/p\u003E\n\u003Cp\u003E\nahhhh ya never know.. the wind might change again yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GrouchyDevotee","CreatedById":175115,"CreatedDateTime":"2018-04-25T18:19:28Z","Content":"\n\u003Cp\u003E\nI\u0027ve only ever played KSP on my PS4, so I don\u0027t know about any MOD\u0027s, or even vehicle exchanges.\n\u003C/p\u003E\n\u003Cp\u003E\nBut as an aspiring Kerbalnaught, I love this game.\n\u003C/p\u003E\n\u003Cp\u003E\nSince it\u0027s only relatively recently that the console version has become stable enough to complete the tech tree, I\u0027m only really just beginning.\n\u003C/p\u003E\n\u003Cp\u003E\nI, and many others agree, that continuous DLC and expansion pak releases with no real content, have contributed to the demise of many other game titles. But some MOD\u0027s or expansions for the console crowd would certainly be extremely welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nI really hope KSP isn\u0027t brought down by $$$.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a relative noob, I would ask the wiley veterans what expansion or DLC would make the game better for you?\n\u003C/p\u003E\n"},{"CreatedByName":"AngrybobH","CreatedById":165814,"CreatedDateTime":"2018-04-25T18:40:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363570\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524673617\u0022 data-ipsquote-userid=\u0022110725\u0022 data-ipsquote-username=\u0022Enceos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Enceos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGet a planet pack and start anew \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are lots of mods out there which bring replayability to the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is how I feel about it. Mods can completely change the game to a new experience. Also, 1.4.x will eventually become stable and people will share ships as they did before(if they aren\u0027t already). There will be ships you might not be able to have because the builder had the DLC, but this is no different than needing a certain mod for a certain craft. When 1.3 came out, I remember quite a number of people staying with 1.2. I don\u0027t see 1.4 as anything different and besides, you get 1.4 for free, it\u0027s just the mission builder and some minor things in the paid DLC. I would call that totally optional to the larger experience of playing KSP your way.\n\u003C/p\u003E\n"},{"CreatedByName":"starcaptain","CreatedById":166799,"CreatedDateTime":"2018-04-25T18:44:21Z","Content":"\n\u003Cp\u003E\nI\u0027ve been playing since 0.13, but many times my grandest expeditions were frustrated by two things:\n\u003C/p\u003E\n\u003Cp\u003E\n1. my computer wasn\u0027t powerful enough to do a grand mission because it couldn\u0027t handle the large crafts. (Not a problem anymore)\n\u003C/p\u003E\n\u003Cp\u003E\n2. I would get into a vicious cycle: make grand mission, launch , think \u0022it\u0027ll be a while until it arrives. I could use the time to start another grand mission\u0022, make a grand mission, launch, think \u0022it\u0027ll be a while until-- and my calendar gets bogged down in the game where I\u0027m paralyzed with not knowing when what\u0027s supposed to arrive. I should\u0027ve got Kerbal Alarm Clock.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I\u0027m committing myself to the effort of putting 1 flag on every biome before the end of the year, and then I\u0027ll say I\u0027ve reached the end of what I started.\n\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2018-04-25T19:02:15Z","Content":"\n\u003Cp\u003E\nI\u0027m thinking I might not update past 1.3.1 for a very long time. It took so long to get a collection of mods working together and configured for how I want to play... I haven\u0027t reached the end of the game by any means, but I believe I\u0027ve reached the end of starting over. This install is remaining locked in the past until my Kerbals actually attain some of the larger goals I\u0027ve sought for years.\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2018-04-25T21:07:51Z","Content":"\n\u003Cp\u003E\nThe problem with keeping an older version is presumably going to be the compatibility of mods.  If you\u0027re playing a set you like then no reason not keep on with the current version, but as soon as you want to start to playing with some new mods, you might struggle to find them for the older version.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve started a new 1.4.2 career with kOS and MKS, which should prove enough of a challenge for a while.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2018-04-25T21:57:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363586\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524674497\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot if you bought the game before may(?) 2013. I assume you did since you say you were playing since 0.17, but assumptions can be wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo I looked at his used profile: He joined the forums May 10, 2013\u003C/p\u003E\n\u003Cp\u003E\nIf he joined less than 10 days before he bought it... ouch... if he bough it and didn\u0027t sign up to the forums until 11\u002B days later, then he gets it for free.May 10, 2013\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363560\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524672395\u0022 data-ipsquote-userid=\u002265767\u0022 data-ipsquote-username=\u0022Scarecrow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Scarecrow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am still on v1.3.1 as I believe a few new bugs were introduced with 1.4 and the version I am currently playing seems quite stable.  On top of that, I also understand there is new DLC, but you need to pay for that to have access.  At this point I feel that I have had my money\u0027s worth out of the game and will no longer be chasing each new upgrade as it is made available. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI also felt that I got more than my money\u0027s worth, so I bought the DLC even though most of the features (ie the missions and mission maker) didn\u0027t really appeal to me. I wanted to support KSPs continued development. You can\u0027t really expect them to be developing a game for free 5 years later without some special circumstance (like continuously strong sales, even 5 years after release).\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yea, 1.4 came with some bugs... 1.4.3 should be out very soon, which should fix them... but I agree, 1.3.whatever did seem to be quite stable.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit\u0027s obvious that my version of the game will soon be completely incompatible with the latest iteration, and such sharing will no longer be possible.  As there appears to be no new gameplay content in the update, I can\u0027t see that it will offer me much more than I can already get from the version I am playing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, 1.4 is supposed to come with performance improvements (I haven\u0027t quantified this). It does come with some new gameplay content. One is relatively minor, and that is alternate versions of parts (like changing the paint jobs on fuel tanks). The also allows for changing node sizes and part models (which can be implemented by mods, and is used with the DLC engines).\n\u003C/p\u003E\n\u003Cp\u003E\nA fun, but also sort of pointless once the novelty wears off, new gameplay feature are parachutes for Kerbals - that isn\u0027t part of the DLC, its in the base game with 1.4.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know if it appeals to you, but it is new gameplay content that isn\u0027t just cosmetic (without the DLC or mods).\n\u003C/p\u003E\n\u003Cp\u003E\nI have confidence that 1.4 will become as stable as 1.3, and when it does... why not update and get a few new features and maintain compatibility with the rest of the community?\n\u003C/p\u003E\n"},{"CreatedByName":"RatchetinSpace","CreatedById":65526,"CreatedDateTime":"2018-04-26T03:12:07Z","Content":"\n\u003Cp\u003E\nIf you\u0027ve been playing since 0.17 you should get the DLC free. 0.18 came out December 2012.\n\u003C/p\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2018-04-26T03:15:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363656\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524680368\u0022 data-ipsquote-userid=\u0022175115\u0022 data-ipsquote-username=\u0022GrouchyDevotee\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, GrouchyDevotee said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs a relative noob, I would ask the wiley veterans what expansion or DLC would make the game better for you?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSpeaking only for myself, I dont want any further expansions or DLC (and I dont have or want the current DLC). What I would like is for Squad to polish the stock game and finish it off. Fix the outstanding bugs and issues, redo the tech tree and career mode, and finish the part re-texturing they started and then abandoned. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-26T11:46:24Z\u0022 title=\u002204/26/2018 11:46  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 26, 2018\u003C/time\u003E by Johnny Wishbone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-04-26T07:15:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363570\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524673617\u0022 data-ipsquote-userid=\u0022110725\u0022 data-ipsquote-username=\u0022Enceos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Enceos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGet a planet pack and start anew \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are lots of mods out there which bring replayability to the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis.   Redo your mod set, and it\u0027s basically a new game. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363778\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524690471\u0022 data-ipsquote-userid=\u0022123362\u0022 data-ipsquote-username=\u0022RizzoTheRat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, RizzoTheRat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe problem with keeping an older version is presumably going to be the compatibility of mods.  If you\u0027re playing a set you like then no reason not keep on with the current version, but as soon as you want to start to playing with some new mods, you might struggle to find them for the older version.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5393785421\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/173371-how-to-get-old-versions-of-mods/\u0026amp;do=embed\u0022 style=\u0022height:228px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Tewa","CreatedById":186951,"CreatedDateTime":"2018-04-26T09:16:34Z","Content":"\n\u003Cp\u003E\nI don\u0027t get why some people think $15 for a game expansion is like the end of the world.\n\u003C/p\u003E\n\u003Cp\u003E\nI have zero interest in the mission builder (which is the primary focus of the expansion), but bought it anyway just to support the people who brought us this wonderful game. I\u0027ve only been playing since Christmas but have over 1000 hours already, for a game I got on sale for $20. That\u0027s a ridiculous value for the dollar.\n\u003C/p\u003E\n\u003Cp\u003E\nSome parts of gaming these days are in this really weird space, where people complain about paying $15 for DLC, or $40 for a title, but think nothing of giving $50 to a streamer to watch them play the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeriously. What\u0027s happened to gamers that they got to this bizarre place? Is it phone games convincing people that everything should be free? Entitled Millennials? I really don\u0027t know.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the fact that people are more willing to give money to streamers, to watch them play the game, instead of to the people who actually created the game.... that\u0027s just wrong.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-26T09:17:39Z\u0022 title=\u002204/26/2018 09:17  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 26, 2018\u003C/time\u003E by Tewa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2018-04-26T10:04:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223364136\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524734194\u0022 data-ipsquote-userid=\u0022186951\u0022 data-ipsquote-username=\u0022Tewa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Tewa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have zero interest in the mission builder (which is the primary focus of the expansion), but bought it anyway just to support the people who brought us this wonderful game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was intending to do the same... but I won\u0027t until exploding landing gear and nonfunctional joysticks on Linux are sorted.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223364136\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524734194\u0022 data-ipsquote-userid=\u0022186951\u0022 data-ipsquote-username=\u0022Tewa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Tewa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve only been playing since Christmas but have over 1000 hours already, for a game I got on sale for $20. That\u0027s a ridiculous value for the dollar\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI bought the game when it was still in alpha, and sure, I got a lot of entertainment for my money.\u003Cbr\u003E\nThing is though, people who buy games in alpha do so with the expectation that their faith in the developer will one day be rewarded with a finished, release-quality game. I\u0027m still waiting, and every release is still full of bugs.\u003Cbr\u003E\u003Cbr\u003E\nI\u0027d use 1.3.1 and call it a day, but landed craft randomly explode or launch into the air. I\u0027d say 1.2.2 was the one, but it\u0027s got janky wheels and seams all over the terrain. I could go back to 1.1.3, but that one crashes every 30 minutes... 1.0.5? Nope, parts overheat for no reason and explode.\u003Cbr\u003E\nYou could say I got a good deal. But I didn\u0027t get \u003Cem\u003Ewhat I paid for\u003C/em\u003E. When I do, I\u0027ll happily pay again for a DLC I don\u0027t want, just to show support.\n\u003C/p\u003E\n\u003Cp\u003E\nRight now though, I\u0027m just about done with this mess. I\u0027m at the point in my 1.3.1 career save where I\u0027d like to build some \u003Cs\u003Esurface bases\u003C/s\u003E nitroglycerine-fed kangaroos. I give up. I\u0027ve reached the end (of my patience).\u003Cbr\u003E\nWake me up when there\u0027s a KSP release I can just \u003Cem\u003Eplay\u003C/em\u003E, without encountering the latest batch of ridiculous bugs.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223364136\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524734194\u0022 data-ipsquote-userid=\u0022186951\u0022 data-ipsquote-username=\u0022Tewa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, Tewa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\npeople complain about paying $15 for DLC, or $40 for a title, but think nothing of giving $50 to a streamer to watch them play the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUhh, there are people that pay streamers $50? The mind boggles.\n\u003C/p\u003E\n"},{"CreatedByName":"Tewa","CreatedById":186951,"CreatedDateTime":"2018-04-26T10:06:40Z","Content":"\n\u003Cp\u003E\nI\u0027m playing 1.4.1 due to the landing gear bug and it\u0027s going well. And 1.4.2 mods seem to be working fine with 1.4.1.\n\u003C/p\u003E\n\u003Cp\u003E\n(And there are people who pay streamers $500 chunks....and I just imagine the same people raging at a $10 DLC, and I really don\u0027t get it.)\n\u003C/p\u003E\n"},{"CreatedByName":"cfds","CreatedById":82109,"CreatedDateTime":"2018-04-26T10:06:58Z","Content":"\n\u003Cp\u003E\nI am not sure what you are talking about. People who say that they do not want to buy the DLC usually add that it does offer nothing to them. I have seen no example of anyone saying that they are giving the money to streamers instead.\n\u003C/p\u003E\n"},{"CreatedByName":"Tewa","CreatedById":186951,"CreatedDateTime":"2018-04-26T10:13:40Z","Content":"\n\u003Cp\u003E\nNot anyone in this thread, just as a general idea. There are people who complain about paying for DLC. There are people who give large sums of cash (relatively speaking) to watch other people play games.\n\u003C/p\u003E\n\u003Cp\u003E\nNow imagine a group of people that fits both descriptions. There must be some, surely. \n\u003C/p\u003E\n\u003Cp\u003E\nBut anyway, this is just a general reaction I have to people questioning whether to spend $15 on DLC for any game.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause $15 is trivial.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-26T10:14:17Z\u0022 title=\u002204/26/2018 10:14  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 26, 2018\u003C/time\u003E by Tewa\u003C/strong\u003E\n\u003Cbr\u003ETo clarify.\n\u003C/span\u003E\n"},{"CreatedByName":"bigcalm","CreatedById":143587,"CreatedDateTime":"2018-04-26T10:48:26Z","Content":"\n\u003Cp\u003E\nI\u0027m also still on 1.3.1 though I have bought the DLC - more as a \u0022thank you\u0022 to Squad rather than it having content that I\u0027m particularly interested in (let\u0027s face it, I got my money\u0027s worth a long time ago).\n\u003C/p\u003E\n\u003Cp\u003E\nI too have been to every planet and every moon, but really I don\u0027t find KSP getting old - it\u0027s more the additional challenges that you can set for yourself, though I think I would have stopped a long time ago if I couldn\u0027t have mods.  Planet are a small bonus but increasing the longevity for me is adding more stuff to think about - adding MKS so I have to care about life support, adding Extra-planetary launchpads, adding electric propellers, sea-plane and submarine mod packs so I can explore areas that I wouldn\u0027t normally go to.  My fondest wish for a KSP improvement is simply better memory management so that I can have fifty mods and a career with 150 craft on the go - my game does crash a \u003Cem\u003Elot\u003C/em\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2018-04-26T11:42:25Z","Content":"\n\u003Cp\u003E\ni\u0027m going to say something crazy here, but...it\u0027s okay to finish games.  Millions of people do it every year.  Hundreds of games are finished.  It\u0027s quite an astonishing thing actually.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP is this weird thing that is sometimes seen as more lifestyle than game.  Understand that, to the contrary, it is just a game, and it is, in fact, okay to be finished with it.\n\u003C/p\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2018-04-26T11:52:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223364190\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524742945\u0022 data-ipsquote-userid=\u0022105132\u0022 data-ipsquote-username=\u0022klgraham1013\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, klgraham1013 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni\u0027m going to say something crazy here, but...it\u0027s okay to finish games.  Millions of people do it every year.  Hundreds of games are finished.  It\u0027s quite an astonishing thing actually.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP is this weird thing that is sometimes seen as more lifestyle than game.  Understand that, to the contrary, it is just a game, and it is, in fact, okay to be finished with it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI \u0022finished\u0022 Fallout 4 about a month after it came out. Now, almost 2 years later, I still play it almost every day. I\u0027ve done over a dozen playthroughs of the main story and I still love it for what it is while hating it at the same time for all the ridiculous bugs and issues that aren\u0027t fixed even years after release (Randolph Safehouse quest, for example).\n\u003C/p\u003E\n"},{"CreatedByName":"Kevin Kyle","CreatedById":110492,"CreatedDateTime":"2018-04-26T12:52:57Z","Content":"\n\u003Cp\u003E\nI would recommend trying the realism overhaul. Makes it a whole new situation with much much more to learn and a real challenge for those who have done all the other. Im following a tutorial on youtube to get me through it. Realism overhaul makes regular KSP feel like child\u0027s play.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8110318681\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155700-131-realism-overhaul-v1200-03-apr-2018/\u0026amp;do=embed\u0022 style=\u0022height:228px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2018-04-26T15:52:49Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave I reached the end?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, you have. \n\u003C/p\u003E\n\u003Cp\u003E\nGo outside. Walk to the nearest pub/bar. Have a beer or two. Talk to a girl. Laugh. Don\u0027t look back. \n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-04-26T16:07:07Z","Content":"\n\u003Cp\u003E\nThe end? Of KSP?\n\u003C/p\u003E\n\u003Cp\u003E\n*laughs so hard he cries*\n\u003C/p\u003E\n\u003Cp\u003E\nAh, my fellow Kerbalnaut... You\u0027ve only just begun.\n\u003C/p\u003E\n\u003Cp\u003E\nI would suggest getting Outer Planets Mod. You though Eeloo was a long mission? Wait until you gun for Plock. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Corona688","CreatedById":2511,"CreatedDateTime":"2018-04-26T16:49:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223363998\u0022 data-ipsquote-contentid=\u0022174258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524712526\u0022 data-ipsquote-userid=\u0022118096\u0022 data-ipsquote-username=\u0022Johnny Wishbone\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Johnny Wishbone said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSpeaking only for myself, I dont want any further expansions or DLC (and I dont have or want the current DLC). What I would like is for Squad to polish the stock game and finish it off. Fix the outstanding bugs and issues, redo the tech tree and career mode, and finish the part re-texturing they started and then abandoned. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNothing in this world is free, my friend.\n\u003C/p\u003E\n"}]}