{"TopicId":174549,"ForumId":32,"TopicTitle":"Solar Panels at Eeloo","CreatedByName":"Zosma Procyon","CreatedById":151656,"CreatedDateTime":"2018-05-03T00:52:28Z","PageNum":1,"Articles":[{"CreatedByName":"Zosma Procyon","CreatedById":151656,"CreatedDateTime":"2018-05-03T00:52:28Z","Content":"\n\u003Cp\u003E\nI have a launch window for Eeloo coming up in 39 in game days, so I\u0027m preparing three relay satellites for launch to the frozen dwarf. These sats all have 36 Nuks and 7000 battery storage, but I still feel compelled to outfit them with 5 or 6 gigantor solar arrays. Satellite just don\u0027t look/feel right without them. Does anyone else include useless solar panels on extreme deep space craft?\n\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2018-05-03T01:41:38Z","Content":"\n\u003Cp\u003E\nHeck yeah,  I\u0027d keep gigantors  at 4 and add a fuel cell array.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2018-05-03T06:53:26Z","Content":"\n\u003Cp\u003E\nSolar panels are fine everywhere unless you use ion propulsion, when they become useless basically past Dres.\n\u003C/p\u003E\n"},{"CreatedByName":"Ixamus","CreatedById":186689,"CreatedDateTime":"2018-05-03T07:12:41Z","Content":"\n\u003Cp\u003E\nWhen I sent a SCANsat satellite to Eeloo I was afraid that I messed it up when I forgot to add any \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003Ertg\u003C/abbr\u003E\u0027s. I was wrong. Four gigantors made it to work just fine. No issues as long as the satellite stays out of shadows. Solar power seems to be useful in all areas of the Kerbol system.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2018-05-03T07:27:58Z","Content":"\n\u003Cp\u003E\nSolar power works fine at Eeloo, its a similar distance from the sun as Jool... which is proportionately as close to the sun/solar power is just as good as solar power is in real life at Jupiter.\n\u003C/p\u003E\n\u003Cp\u003E\nIn real life, Solar power has been used at Jupiter, although Gallileo was \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E powered. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Juno_(spacecraft)\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Juno_(spacecraft)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIts not very mass efficient to use solar panels at Jool and beyond (actually at dres), and in KSP, we don\u0027t have the drawbacks of RTGs (power declines over the course of decades, difficultu producing plutonium 239, people objecting to putting highly radioactive stuff on top of a \u0022column of boom\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, If you play with a mod like OPM, solar power becomes very very weak out past Sarnus... to the point that at Neidon (or was it Nedion? whatever) and Plock you need a gigantor just to supply a probe core and keep it online (and recharging batteries for data transmission or powering reaction wheels takes a long time)\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-05-03T18:29:57Z","Content":"\n\u003Cp\u003E\nIt\u0027s also worth noting that relay satellites require virtually no power.  As long as you have enough power to keep a probe core running-- which you can get from a single \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E-- that\u0027s all they need.  So unless you have some power-hungry process like \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E refining or science lab research going on, you can just stick a single \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E on the satellite and you\u0027re done.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my own gameplay, I tend to optimize for mass-- i.e. the smallest, most lightweight ship that gets the job done.  At Jool and beyond, kilogram for kilogram an \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E does a better job than a solar panel (especially if you\u0027re using Gigantors, whose mass-per-watt is significantly worse than the smaller panels).  So for those outer-system missions, I generally just put an \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E on it and call it done.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I have an outer-system mission that uses drilling or refining, which are heavy energy hogs, then I use fuel cells for that, since they\u0027re high power, and the drilling/refining process provides the \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E they need.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout the only high-continuous-electricity application that isn\u0027t covered by this strategy is having an actively researching science lab.  However, since I never use the science lab for any researching ever (because I find it game-breakingly overpowered), that doesn\u0027t come up for me.  If it did, I guess I\u0027d either need to spam RTGs (and be willing to foot the enormous bill for that), or else include \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E capability and have it run off fuel cells.\n\u003C/p\u003E\n"},{"CreatedByName":"OrbiterAirFields","CreatedById":197731,"CreatedDateTime":"2018-05-03T18:56:32Z","Content":"\n\u003Cp\u003E\nyes, but they are not useless, they will give your ship power.\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2018-05-03T19:30:58Z","Content":"\n\u003Cp\u003E\nMost of my unmanned stuff - survey, comm relay \u0026amp; science sats - are made to go anywhere, so they typically have some solar \u0026amp; a small \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E or two.  I can\u0027t remember which mod it\u0027s from, but I have a small, low-cost \u0026amp; mass \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E that puts out ~0.1 ec/s, looks kinda like somebody cut a slice off the top of a stock \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E.  I stick them on just about everything once they\u0027re available, but still hang on to at least a pair of 1x6 panels.  Now once I start getting into \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E,  I tend to build for wherever they\u0027re going, and don\u0027t waste mass on solar if they\u0027re going far too far out.  I\u0027ll just stick with \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u0027s for routine power \u0026amp; fuel cells or nuclear/fusion reactors for the drills \u0026amp; convertors.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2018-05-05T06:44:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223370331\u0022 data-ipsquote-contentid=\u0022174549\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221525372197\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/3/2018 at 8:29 PM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nespecially if you\u0027re using Gigantors, whose mass-per-watt is significantly worse than the smaller panels).  So for those outer-system missions, I generally just put an \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E on it and call it done.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, this used to be the case, but now they are:\n\u003C/p\u003E\n\u003Cp\u003E\n* better than the fixed panels\n\u003C/p\u003E\n\u003Cp\u003E\n* better than the small retractable panels\n\u003C/p\u003E\n\u003Cp\u003E\n* 13.2% worse than the small non-retractable panels\n\u003C/p\u003E\n\u003Cp\u003E\nSo in the end, if re tractability matters, they are the best. Also for many applications where you\u0027re not free to orient your craft in any direction, multiple small panels will end up occluding each other.\n\u003C/p\u003E\n\u003Cp\u003E\nThey are somewhere between the small retractable and non retractable panels. They retract but are still more vulnerable to breaking than the small retractable ones, and they are less heat tolerant, but more so than the small non retractable ones.\n\u003C/p\u003E\n"}]}