{"TopicId":17475,"ForumId":16,"TopicTitle":"Efficient sun orbit.","CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-22T03:05:29Z","PageNum":1,"Articles":[{"CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-22T03:05:29Z","Content":"\n\u003Cp\u003EWhat is the most fuel efficient way to get into an orbit around the sun? When i do it i keep burning straight up and dont stop until im on an escape trajectory.\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-08-22T03:39:28Z","Content":"\n\u003Cp\u003EThe most efficient way would be via a slingshot around the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-08-22T05:57:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kosmo-not\u0022 data-cite=\u0022Kosmo-not\u0022\u003E\u003Cdiv\u003EThe most efficient way would be via a slingshot around the Mun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eand minmus but thats a hard shot its better to go for the mun if you can only hit 1\u003C/p\u003E\n"},{"CreatedByName":"ggPeti","CreatedById":28355,"CreatedDateTime":"2012-08-22T07:40:30Z","Content":"\n\u003Cp\u003EThe most efficient way is to never lift off. You\u0027re already orbiting the Sun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UNSC","CreatedById":31653,"CreatedDateTime":"2012-08-22T07:44:58Z","Content":"\n\u003Cp\u003EI see what you did there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2012-08-22T07:54:48Z","Content":"\n\u003Cp\u003EMost efficient way to get into a solar orbit (as a free-flying spacecraft..) is to first establish a kerbin orbit so as not to waste fuel due to gravity drag. Also, the lower your altitude when burning for escape, the more efficient it is (an intuitive way to think about it is that the fuel you\u0027re burning hasn\u0027t been lifted as high, thus having had less previous fuel \u0027wasted on it\u0027. This adds up when doing long \u0027straight up\u0027 burns).\u003C/p\u003E\u003Cp\u003EThen from LKO, burn for kerbin escape, if possible incorporating a mun slingshot, however be sure to have the mun slingshot happen AFTER all your fuel is expended. If you burn a little, wait untill you\u0027re out at munar orbit, get the slingshot and then complete the burn to escape it might well be less efficient than just burning till escape directly from LKO. Same goes for minmus, but it\u0027s going to be a teensy tiny little slingshot which might not be worth the effort. \u003C/p\u003E\u003Cp\u003EAs for getting a specific (higher or lower than kerbins, for instance) sun orbit, do as you normally do and aim pro/retro. Keep in mind that even though you\u0027re doing orbital maneuvers you\u0027ll be going fast (relative to kerbin), so on the scale of kerbin your kerbol inject trajectory will more resemble a straight line than an ellipse. Keep this in mind when aiming for pro/retro grade.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"}]}