{"TopicId":17492,"ForumId":20,"TopicTitle":"Cargo bay doors?","CreatedByName":"Yasashii","CreatedById":8027,"CreatedDateTime":"2012-08-22T08:38:21Z","PageNum":1,"Articles":[{"CreatedByName":"Yasashii","CreatedById":8027,"CreatedDateTime":"2012-08-22T08:38:21Z","Content":"\n\u003Cp\u003EHi. I just wanted to ask if there\u0027s a plugin out there that would allow me to put space shuttle-like cargo bay doors on my rocket/shuttle.\u003C/p\u003E\u003Cp\u003EThe point is, of course to have an easy and rigid cargo bay in which I can deliver cargo to orbit and deploy it there. I built something like this using novapunch pack\u0027s firings but they were too weak and tended to wobble and sometimes break apart which is not acceptable. Also I had to open the cargo bay by jettisoning half of the firings which is not realistic at all. I want ones that I can open and close at will.\u003C/p\u003E\n"},{"CreatedByName":"madspy","CreatedById":24257,"CreatedDateTime":"2012-08-22T09:13:02Z","Content":"\n\u003Cp\u003EThere is something called damned robotics:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/9675-v0-16-Damned-Robotics-Version-1-2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/9675-v0-16-Damned-Robotics-Version-1-2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIs has moving parts like pistons, motors (they rotate) and hinges... It doesn\u0027t give you a cargo bay door but you could probably make something and use these parts to allow it to rotate. Like a box made out of the rectangular wing pieces with the top on hinges, letting it rotate... I don\u0027t know, I hope you get what I am getting at \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Yasashii","CreatedById":8027,"CreatedDateTime":"2012-08-22T12:45:26Z","Content":"\n\u003Cp\u003EEven if I constructed something like that it would miss the point. My previous space shuttles broke apart because the cargo bays were made of separate firings. For that to work it would have to be only one part. It\u0027s the same case with fuel tanks. if you construct your rocket of multiple small tanks it will wobble a lot and may break apart. If you construct it of a single tank that can hold the same amount of fuel, it will be strong and rigid. That\u0027s what I need. Only with a cargo bay.\u003C/p\u003E\n"},{"CreatedByName":"madspy","CreatedById":24257,"CreatedDateTime":"2012-08-24T20:24:10Z","Content":"\n\u003Cp\u003EIm sure some modder will do this at some point, because it is a very frequent request...\u003C/p\u003E\n"},{"CreatedByName":"tom2018","CreatedById":37710,"CreatedDateTime":"2012-08-24T22:09:02Z","Content":"\n\u003Cp\u003Ei haven\u0027t seen any cargo bays but maybe you could try the \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/13692-Mechanical-Mouse-Industries-Kethane-Payload-Packs-Released%21%21%21?highlight=mouse\u0022 rel=\u0022external nofollow\u0022\u003Epayload pack\u003C/a\u003E its good for rockets!\u003C/p\u003E\n"},{"CreatedByName":"ledo1222","CreatedById":1363,"CreatedDateTime":"2012-08-25T04:46:37Z","Content":"\n\u003Cp\u003EIm currently working on something similar to a cargo bay type part. but its for a rover, if you can draw me a concept of what you want I can model it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}