{"TopicId":175022,"ForumId":70,"TopicTitle":"MKS Drills broken in KSP 1.3.1","CreatedByName":"ajedgar33","CreatedById":158383,"CreatedDateTime":"2018-05-16T23:36:35Z","PageNum":1,"Articles":[{"CreatedByName":"ajedgar33","CreatedById":158383,"CreatedDateTime":"2018-05-16T23:36:35Z","Content":"\n\u003Cp\u003E\nHi there,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried everything I can think of and still am seeing the problem described by others; drill selections don\u0027t stay configured and the \u0022start\u0022 buttons disappear after the drill is deployed for the first time - they cannot be restarted. \n\u003C/p\u003E\n\u003Cp\u003E\nI just reinstalled a brand new freshly downloaded KSP 1.3.1 -- to ensure I had not made any inadvertent changes to my test version -- installed the latest MKS for KSP 1.3.1 version 0.53.2.0 from github and reproduced the problem. Here\u0027s how to reproduce: make a simple craft with an MEU-500-A Pulse Drill on it, launch it, start the drill bits and deploy the drill, that all works. When you retract the drill the start buttons will disappear; sometimes when you re-deploy the drill the tooltip menu will briefly show start buttons for all the resources than collapse to no start buttons; you can retract the drill, re-deploy it, but never see the start buttons again. Also the tooltip menu shows \u0022S1 Active separator: minerals\u0022, \u0022S2 Active separator: ???\u0022, \u0022S3 Active separator: ???\u0022; even though S2 and S3 are configured for substrate and metalicOre respectively and producing. \n\u003C/p\u003E\n\u003Cp\u003E\nRelated note: when selecting the drill tip separator in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E it says \u0022Reconfiguration from dirt to dirt completed\u0022 (or whatever the next enum resource is). \u003Cbr\u003E\u003Cbr\u003E\nIs there a working version of the MKS drills and material processors for KSP 1.3.1 available?\u003Cbr\u003E\u003Cbr\u003E\nIf someone has this all working can you tshare the exact versions your are using?\u003Cbr\u003E\u003Cbr\u003E\nMany thanks in advance,\u003Cbr\u003E\nAJ\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nVersion info:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n$ md5sum MKS_0.53.2.0.zip\u003Cbr\u003E\nccd583b5f322692c8af811b7073c7ac7  MKS_0.53.2.0.zip\n\u003C/p\u003E\n\u003Cp\u003E\n$uname -a \u003Cbr\u003E\nLinux ASUS-Z170-P-4Ghz 4.4.0-59-generic #80-Ubuntu SMP Fri Jan 6 17:47:47 UTC 2017 x86_64 x86_64 x86_64 GNU/Linux\u003Cbr\u003E\u003Cbr\u003E\nKerbal Space Program - 1.3.1.1891 (LinuxPlayer) en-us\n\u003C/p\u003E\n\u003Cp\u003E\nOS: Linux 4.4 Ubuntu 16.04 64bit\u003Cbr\u003E\nCPU: Intel(R) Core(TM) i7-7700K CPU @ 4.20GHz (4)\u003Cbr\u003E\nRAM: 15991\u003Cbr\u003E\nGPU: GeForce GTX 970/PCIe/SSE2 (4096MB)\u003Cbr\u003E\nSM: 30 (OpenGL 4.5 [4.5.0 NVIDIA 370.28])\u003Cbr\u003E\nRT Formats: ARGB32, Depth, ARGBHalf, Shadowmap, RGB565, ARGB4444, ARGB1555, Default, ARGB2101010, DefaultHDR, ARGBFloat, RGFloat, RGHalf, RFloat, RHalf, R8\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-05-17T02:24:50Z","Content":"\n\u003Cp\u003E\nThread moved to Modded Support and good luck with your problem. \n\u003C/p\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2018-05-17T03:19:32Z","Content":"\n\u003Cp\u003E\nYour best bet is to scour the MKS thread.  Honestly I cannot remember if the drill issue was patched in 1.3.1 or not fixed until 1.4.  You\u0027re largely on your own for support with old versions.\n\u003C/p\u003E\n"}]}