{"TopicId":175227,"ForumId":16,"TopicTitle":"\u0026quot;Wobble\u0026quot; free space stations?","CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2018-05-23T17:56:54Z","PageNum":1,"Articles":[{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2018-05-23T17:56:54Z","Content":"\n\u003Cp\u003E\nI need to build a larger refueling station in Kerbin orbit. My current one does not have the fuel capacity I would like. One problem I have with the current station is what I\u0027ll call progressive \u0022wobble\u0022. Orbiting by itself the station was fine, but after docking other ships to it and especially transferring fuel, LoX, etc., it sometimes starts to wobble, which seems to have connection points as the \u0022weak\u0022 areas. This will get progressively worse until parts start flying off (tanks, large antennas) or it simply explodes. I asked a few questions in a previous post but thought I would start one dedicated to the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nSome points:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EAutostruts\u003C/u\u003E: I was using stock EAS-4 struts during construction and \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E CS-R2 portable struts during assembly of modules in orbit. These did not seem to really solidify the structure as I would have thought...or prevent the issue. Part of the earlier discussion was about autostruts (I was not using them) and how to use them (Grandparent, Root, Heaviest part). I\u0027m not sure a consensus was reached on the \u0022how\u0022 but Grandparent seemed to be more in favor. I would ask for more information on autostruts from the expert builders here...where to use them and how.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003ERigid attachment\u003C/u\u003E; sounds straightforward but what is it, really, and would it help stabilize and solidify my station?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EAttaching station modules in orbit\u003C/u\u003E: AFAICT, the only way to attach station modules in orbit is using docking ports, which seem to me to be the weak link in the \u0022wobble\u0022 issue. Is this the only way?\n\u003C/p\u003E\n\u003Cp\u003E\nSome other points that were brought up: turning off reaction wheels on docked ships and turning off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E on docking ships \u003Cem\u003Ebefore \u003C/em\u003Edocking with station. These confuse me as, once docked, shouldn\u0027t the entire thing act as one ship, with reaction wheels and \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E (no matter where) acting in harmony to control orientation? I do, however, go to the command part of the station (cupola, etc.) and set \u0022control from here\u0022 after each docking.\n\u003C/p\u003E\n\u003Cp\u003E\nAny other tips and tricks from the experts on reducing or eliminating the wobble, whether through construction techniques, operations, etc. would be greatly appreciated.\n\u003C/p\u003E\n\u003Cp\u003E\nVic \u0022who turned on the darn Wobbulator??\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"4x4cheesecake","CreatedById":187982,"CreatedDateTime":"2018-05-23T18:58:54Z","Content":"\n\u003Cp\u003E\nEven though I\u0027m far away from being a expert, but I like to share my experience anyway \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E^^\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter building several stations, the most stable design was always a huge tank used as core module and placing everything else around it, at least if the station is used to refuel other vessels. Everytime I\u0027ve used multiple tanks radial attached, the station starts to wobble at some point.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostruts (Grandparent) seem to be useful whenever a part is surface attached, especially if the part angle is not 90°. The best explanation I can find for this is: Everytime you dock a vessel to your station, the station and the vessel are combined to one vessel which need to be recalculated by the game. At the end of this recalculation, the physics \u0027kicks\u0027 in and may cause a little impulse which causes your (angled) parts to wobble.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I don\u0027t like rigid attachment. It is more like surpressing the wobble instead of preventing it which causes the station to become more brittle and things are more likly to explode instantly instead of wobble around (btw. you can stop the wobble with a quick \u0022on-rails\u0022 time warp)\n\u003C/p\u003E\n\u003Cp\u003E\nDocking is indeed the only way to build things in space. Maybe some mods like \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E have some other possibilities, but I don\u0027t use them so nothing I can tell you about. An alternative would be to build and launch your whole station at once but this requires some symetrical design and a massiv (expensive) lifter.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the best advice I have to you: Try to find a design with no long \u0022arms\u0022, use the biggest available docking ports as often as possible, use autostruts on surface attached parts and if you use EAS-4 struts, you might want to take a look at this mod:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5670805149\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127378-141-editor-extensions-redux-released-with-selectroot-merge-stripsymmetry-nooffsetlimits/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=2314915\u0026amp;embedComment=2314915\u0026amp;embedDo=findComment#comment-2314915\u0022 style=\u0022height:313px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nIt allows you to place struts perfectly symetrical and I got the feeling, that symetrical struts are more stable after the physics \u0027kick\u0027.\n\u003C/p\u003E\n"},{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2018-05-23T19:20:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223384697\u0022 data-ipsquote-contentid=\u0022175227\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527101934\u0022 data-ipsquote-userid=\u0022187982\u0022 data-ipsquote-username=\u00224x4cheesecake\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, 4x4cheesecake said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven though I\u0027m far away from being a expert, but I like to share my experience anyway \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E^^\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter building several stations, the most stable design was always a huge tank used as core module and placing everything else around it, at least if the station is used to refuel other vessels. Everytime I\u0027ve used multiple tanks radial attached, the station starts to wobble at some point.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostruts (Grandparent) seem to be useful whenever a part is surface attached, especially if the part angle is not 90°. The best explanation I can find for this is: Everytime you dock a vessel to your station, the station and the vessel are combined to one vessel which need to be recalculated by the game. At the end of this recalculation, the physics \u0027kicks\u0027 in and may cause a little impulse which causes your (angled) parts to wobble.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I don\u0027t like rigid attachment. It is more like surpressing the wobble instead of preventing it which causes the station to become more brittle and things are more likly to explode instantly instead of wobble around (btw. you can stop the wobble with a quick \u0022on-rails\u0022 time warp)\n\u003C/p\u003E\n\u003Cp\u003E\nDocking is indeed the only way to build things in space. Maybe some mods like \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E have some other possibilities, but I don\u0027t use them so nothing I can tell you about. An alternative would be to build and launch your whole station at once but this requires some symetrical design and a massiv (expensive) lifter.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the best advice I have to you: Try to find a design with no long \u0022arms\u0022, use the biggest available docking ports as often as possible, use autostruts on surface attached parts and if you use EAS-4 struts, you might want to take a look at this mod:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed375149280\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127378-141-editor-extensions-redux-released-with-selectroot-merge-stripsymmetry-nooffsetlimits/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=2314915\u0026amp;embedComment=2314915\u0026amp;embedDo=findComment#comment-2314915\u0022 style=\u0022height:313px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nIt allows you to place struts perfectly symetrical and I got the feeling, that symetrical struts are more stable after the physics \u0027kick\u0027.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks 4X4! I have \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E and I don\u0027t believe they have anything that would allow orbital construction without docking ports, AFAIK.\n\u003C/p\u003E\n\u003Cp\u003E\nStill looking for definitions of \u0022Grandparent, Root and Heaviest\u0022. Heaviest of the entire ship, or the heaviest of the sub-assembly being attached...stuff like that.\n\u003C/p\u003E\n\u003Cp\u003E\nWould docking ports be considered \u0022surface attached\u0022? As you can tell, the construction terminology is sorta escaping me? LOL!\n\u003C/p\u003E\n"},{"CreatedByName":"mystifeid","CreatedById":187479,"CreatedDateTime":"2018-05-23T20:03:02Z","Content":"\n\u003Cp\u003E\nHardly an expert but I use autostruts as little as possible because at the least, \u0022heaviest part\u0022 is dynamic - ie if you dock a ship with a very heavy part all the auto strut configuration changes which can destabilize/destroy the station. And I turn off the station \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E. If I want to stabilize it I quickly go to 5x warp for a second or two.\n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest problem I have is a fairly hefty lander which is usually docked at my stations when other ships arrive and they sometimes have a very heavy part. Now the legs on the landers have heaviest part autostruts enabled and this cannot be disabled. I find that if I dock the new ship along the same axis as the lander then the station begins to wobble - very slightly at first but within about 60 seconds it is at the point of tearing itself apart.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, if I dock at a port that is aligned at right angles to the lander\u0027s docking port, everything remains stable.\n\u003C/p\u003E\n"},{"CreatedByName":"CrashyMcCrashFace","CreatedById":187039,"CreatedDateTime":"2018-05-23T20:04:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223384664\u0022 data-ipsquote-contentid=\u0022175227\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527098214\u0022 data-ipsquote-userid=\u0022159656\u0022 data-ipsquote-username=\u0022Victor3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Victor3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...shouldn\u0027t the entire thing act as one ship, with reaction wheels and \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E (no matter where) acting in harmony to control orientation?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe should (in a perfect world) but they don\u0027t.  I think it\u0027s called oscillation and overshoot in a negative feedback loop. If not maneuvering you need very little \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E reaction wheel to stay stable. Turn off all the wheels except a central one on the heaviest part.\n\u003C/p\u003E\n"},{"CreatedByName":"4x4cheesecake","CreatedById":187982,"CreatedDateTime":"2018-05-23T20:15:34Z","Content":"\n\u003Cp\u003E\nWell, to understand the definition of grandparent, root and heaviest, you need to know a bit about the way how the game creates the crafts. You can imagine the structre like a tree:\n\u003C/p\u003E\n\u003Cp\u003E\nThe very first part you place is your root part. You can change the root part within the editor but to keep it simple, lets say, it is the very first part. Then, you attach the next part on the root part. The root part is now also the parent of the second part. Then, place a third part on the second part. Now, the root part is still the root part \u002B parent of the second part \u002B grandparent of the third part. This will go on until your craft is finished.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, autostrut (root) will always connect to your very first part.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostrut (grandparent) will always connect to the part placed two build steps ahead.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostrut (heaviest) will always connect to your heaviest part (guess that obvious, isn\u0027t it?^^)\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is: the root part will change when docking, because there is only one root part allowd but you will merge to vessels into one. The heaviest part will also change as soon as you transfer fuel or dock a massiv vessel. Grandparent is the best option because most parents and grandparents parts will not switch after docking. And everytime you use heaviest or root autostruts, the struts will move around, depending which part is the new root or heaviest one which will cause some serious wobbel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen I say \u0027surface attached\u0027, I think of structures like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022h5FPS0s.png\u0022 class=\u0022ipsImage\u0022 height=\u0022342\u0022 src=\u0022https://i.imgur.com/h5FPS0s.png\u0022 width=\u0022399\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gqck1um.png\u0022 class=\u0022ipsImage\u0022 height=\u0022481\u0022 src=\u0022https://i.imgur.com/gqck1um.png\u0022 width=\u0022395\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBest way to stabilise these structures is to place an grandparent autostrut on the docked part (fuselage on the right) becaue this autostrut will go through the docking port (left docking port is parent of the right docking port and grandparent for the fuselage)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-05-23T20:18:54Z\u0022 title=\u002205/23/2018 08:18  PM\u0022 data-short=\u00226 yr\u0022\u003EMay 23, 2018\u003C/time\u003E by 4x4cheesecake\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2018-05-23T22:02:17Z","Content":"\n\u003Cp\u003E\nThank you for explaining that, 4X4!\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-05-24T00:33:11Z","Content":"\n\u003Cp\u003E\nPart of the point of \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E is to allow orbital construction, yes -- but you need an electric screwdriver.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostruts hook two parts together so they can\u0027t move with respect to each other. Everything between them can move, though. The first few (let\u0027s say 5) autostruts you add will reduce the wobbles in your station. But they also add stresses to your station, and there comes a point where each additional autostrut will increase your wobble rather than reducing it. As said above, if you have them turned on at the moment that you dock, they often change connection points -- which is a very forceful process and can cause a lot of wobbles. Often it\u0027s best to have them all turned off when you dock -- then turn a few selected ones on to kill the wobble. Then turn on a handful more.\n\u003C/p\u003E\n\u003Cp\u003E\nRigid attachment reduces the flexibility of joints between parts. So they bend less with the same force applied. But the joints break more easily.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can also attach station parts with Klaws. I think they are less bendy than docking ports. But your station won\u0027t be nearly so pretty.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Fadly","CreatedById":187754,"CreatedDateTime":"2018-05-24T04:11:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223384745\u0022 data-ipsquote-contentid=\u0022175227\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527105851\u0022 data-ipsquote-userid=\u0022187039\u0022 data-ipsquote-username=\u0022CrashyMcCrashFace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, CrashyMcCrashFace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe should (in a perfect world) but they don\u0027t.  I think it\u0027s called oscillation and overshoot in a negative feedback loop. If not maneuvering you need very little \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E reaction wheel to stay stable. Turn off all the wheels except a central one on the heaviest part.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. Only have ONE reaction wheel, or none at all. this include build in reaction wheel in a probe and capsule.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal101","CreatedById":157058,"CreatedDateTime":"2018-05-24T08:08:46Z","Content":"\n\u003Cp\u003E\nHi! As an alternative to docking ports, I recommend \u0022weldable\u0022 Docking ports from the Konstruction mod by \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105198-roverdude/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022105198\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105198-roverdude/\u0022 rel=\u0022\u0022\u003E@RoverDude\u003C/a\u003E.\u003Cbr\u003E\nThey look like normal Docking ports, but these have a special option \u0022Compress\u0022 that explodes the two connected ports (\u0022compression\u0022) and permanently connects the parts. It is also part of (larger) MKS package.\u003Cbr\u003E\nThe last version is 0.5.0 and supports 1.4.x\u003C/span\u003E\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed532079069\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/149233-13-konstruction-weldable-ports-servos-cranes-and-magnets-013/\u0026amp;do=embed\u0022 style=\u0022height:228px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"blakemw","CreatedById":168819,"CreatedDateTime":"2018-05-24T08:44:38Z","Content":"\n\u003Cp\u003E\nThe key to a wobble free station is clever use of autostruts. Autostruts are also the key to a station which violently tears itself apart. So getting a wobble free station involves mastering the arcane arts of autostrut mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen a whole lot of autostruts converge on one part, this creates a concentration of forces which results in the wobble of doom. This will be what tends to happen with root part, and usually heaviest part and in some cases grandparent part, but not in all cases.\n\u003C/p\u003E\n\u003Cp\u003E\nThe trick is how autostrut combines with symmetry placement. When autostrut targets a part with \u0022symmetry siblings\u0022, a strut is created to ALL the symmetry siblings, who knows why, it is just how it works, this works whether the target is \u0022acquired\u0022 via grandparent part or heaviest part (and with heaviest part, it doesn\u0027t matter if some of the syemmtry siblings are less heavy,  the game first finds the heaviest part, which might be a full fuel tank, and then creates autostruts to it and all it\u0027s symmetry siblings, some of which might be empty). This creates a star-like pattern of autostruts which is very strong and wobble resistant. The basic idea then is to make the core of your station a symmetry structure, for example a cross. This can be braced with symmetry autostruts, and whats more when something docks to a symmetry docking port, you can use \u0022grandparent part\u0022 on the docked vessel to connect to all the symmetry siblings of the core:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022A8nkoeb.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/A8nkoeb.jpg\u0022 width=\u0022916\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWorks well with Heaviest part too:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vxIyArS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/vxIyArS.png\u0022 width=\u0022813\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnderstand and abuse this game mechanic and you can have rock solid stations which are pretty resistant to wobble of doom.\n\u003C/p\u003E\n\u003Cp\u003E\nNote: In general I would advise bracing the \u0022symmetrical core\u0022 with conventional struts. Conventional struts remember their original length and try to restore a vessel to its original \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E shape. Autostruts are re-created every time a vessel docks/undocks or the game is loaded and so autostruts don\u0027t remember what a vessel originally was shaped like and distortions can accumulate.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-05-24T09:12:18Z\u0022 title=\u002205/24/2018 09:12  AM\u0022 data-short=\u00226 yr\u0022\u003EMay 24, 2018\u003C/time\u003E by blakemw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"4x4cheesecake","CreatedById":187982,"CreatedDateTime":"2018-05-24T08:55:51Z","Content":"\n\u003Cp\u003E\nWait, symetrie siblings are included when using grandparent autostruts? Thats awsome and really good to know \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2018-05-25T02:28:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223384940\u0022 data-ipsquote-contentid=\u0022175227\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527121991\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎5‎/‎23‎/‎2018 at 6:33 PM, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPart of the point of \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E is to allow orbital construction, yes -- but you need an electric screwdriver.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHi bewing. Are you saying that with \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E I can do an EVA with my engineer and tools and attach station modules without using docking ports?\n\u003C/p\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-05-25T12:29:17Z","Content":"\n\u003Cp\u003E\nThere are wielding mods that make new parts out of existing ones. Drastically reduces fiel tank counts.\n\u003C/p\u003E\n"},{"CreatedByName":"Bakkerbaard","CreatedById":188253,"CreatedDateTime":"2018-06-02T05:08:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223385769\u0022 data-ipsquote-contentid=\u0022175227\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527215282\u0022 data-ipsquote-userid=\u0022159656\u0022 data-ipsquote-username=\u0022Victor3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/25/2018 at 4:28 AM, Victor3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHi bewing. Are you saying that with \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E I can do an EVA with my engineer and tools and attach station modules without using docking ports?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think I am Bewing, but I\u0027m gonna respond to this anyway. In theory that should work, but you\u0027ll need both parts close enough that the Kerbal with the screwdriver can reach them. I haven\u0027t attempted this with giant station parts yet, but I have been cursing under my breath trying to put fancy caps on ends of my station, which were also too heavy for Bill to carry. The only way I managed it was to float one next to the container it came in, quickly float the magnet over the cap, plug in the magnet, lock on the magnet, turn on the winch the magnet is now attached to which is sitting next to the end I want to put the cap on and wait.\n\u003C/p\u003E\n\u003Cp\u003E\nThen when the winch had pulled the cap close enough I had Bill stick it on the end of which ever tube needed capping.\n\u003C/p\u003E\n\u003Cp\u003E\nPro-tip: Don\u0027t drag your load through your solar array...\n\u003C/p\u003E\n"}]}