{"TopicId":175625,"ForumId":44,"TopicTitle":"Space Colonization/Settlement Discussion Thread","CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-06-05T02:08:22Z","PageNum":1,"Articles":[{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-06-05T02:08:23Z","Content":"\n\u003Cp\u003E\nA thread for discussing various matters related to the idea of people living in space. There has been a Mars colonization thread in the past, but there hasn\u0027t been a thread about space settlement in general, which would be quite useful to have given the differing directions of where and how space colonization should occur.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-05T02:10:56Z\u0022 title=\u002206/05/2018 02:10  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 5, 2018\u003C/time\u003E by SaturnianBlue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2018-06-05T02:32:50Z","Content":"\n\u003Cp\u003E\nVenus upper atmosphere:\n\u003C/p\u003E\n\u003Cp\u003E\nSame temperature\n\u003C/p\u003E\n\u003Cp\u003E\nSame pressure\n\u003C/p\u003E\n\u003Cp\u003E\nSame gravity\n\u003C/p\u003E\n\u003Cp\u003E\nLow radiation\n\u003C/p\u003E\n\u003Cp\u003E\nCan use electric ramjets to help with ascent\n\u003C/p\u003E\n\u003Cp\u003E\nCan get minerals from tethered robots\n\u003C/p\u003E\n\u003Cp\u003E\nFertilizer in the air\n\u003C/p\u003E\n\u003Cp\u003E\nDensity makes airships easy\n\u003C/p\u003E\n\u003Cp\u003E\nShorter trips than to Mars\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-06-05T02:37:22Z","Content":"\n\u003Cp\u003E\nEquatorial LEO stations. High enough to minimize reboosting, low enough to mitigate radiation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-06-05T02:45:44Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119411\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0022 rel=\u0022\u0022\u003E@tater\u003C/a\u003E Reminds me of this \u003Ca href=\u0022http://space.alglobus.net/papers/Easy.pdf\u0022 rel=\u0022external nofollow\u0022\u003Epaper\u003C/a\u003E for just that sort of settlement, which also added that with adjustment, people could probably live with 4 to 6 rpm habitats, allowing for small ones that could be in the range of rocket launches.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-06-05T03:11:49Z","Content":"\n\u003Cp\u003E\nELEO habitats. They can be as light as 10 thousand tonnes (or lighter) initially with a population in the hundreds. LEO is the easiest place to get to. And if the cost of lifting the materials is reduced, and the technology is developed and matured enough, then it could happen. Eventually we can build habitats in SSO, permanently in sunlight, but also needing radiation shielding. Then, we could use similar infrastructure to build habitats in higher orbits. Eventually we may develop propulsion technology that can take a well sized habitat plus mining and manufacturing equipment to another planet or to another location in the solar system. And of course more powerful propulsion systems can take habitats to other star systems.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, any space colonization is exceedingly difficult. Orbital habitats are not exactly easy. But they do provide a better colony than planets. To put this in perspective: the second most habitable place in the solar system, after Earth, is the ISS, and it\u0027s a very distant second. Any colony will be an artifical environment. As such, there are few advantages to planets. But orbital habitats retain many advantages: energy is abundant (solar can be used as far out as Saturn, you just need bigger solar panels or solar concentrators), controlled levels of pseudo-gravity, better controlled radiation doses, easy access to freefall and vacuum conditions, and enormous potential for growth. If space colonization happens, orbital habitats will be the preferred option, provided the people doing the colonizing are smart enough to realize that access to energy is of extreme importance. Planets would probably be colonized regardless, but I don\u0027t expect them to grow very much.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-05T05:54:35Z","Content":"\n\u003Cp\u003E\nAn early-on habitat anyway should be first tested and approved.\u003Cbr\u003E\nSo, fast evacuation is a must-have. This means a near-Earth orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n1. LEO means air drag, so you should be raising its orbit from time to time.\u003Cbr\u003E\nThis is not a problem with tiny things like ISS (~400 t, just 1/2 of Proton launch mass), but a serious habitat with artificial gravity would weight at least tens thousands tonnes.\n\u003C/p\u003E\n\u003Cp\u003E\n2. As the habitat should be big, its hull would be thick.\u003Cbr\u003E\nAnd abyway its outer layers would be technical.\u003Cbr\u003E\nSo, it would be naturally radiation-proof.\u003Cbr\u003E\nThis means, magnetospeher is less significant, and LEO is not a requirement.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Further habitat development would anyway be purposed to the other planets occupation.\u003Cbr\u003E\nSo, its important to make a standard habitat, enough protected regerdless of a magnetosphere.\u003Cbr\u003E\nThus, there is no much sense to build a habitat in LEO with hope for radiation belts above. It should be self-sufficient from the very beginning, otherwise you should develop it twice.\n\u003C/p\u003E\n\u003Cp\u003E\n4. A big station should be a transit port between LEO and outer space.\u003Cbr\u003E\nA shipyard could/should be in LEO - just to make assembling easy.\u003Cbr\u003E\nSo, the habitat again should be in high near-Earth orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, imho, the only choice is: geostationary vs lagrange.\u003Cbr\u003E\nAs the traffic would be mostly between the Earth and the habitat, geostationary looks better.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2018-06-05T07:43:31Z","Content":"\n\u003Cp\u003E\nAnother thread ?\n\u003C/p\u003E\n\u003Cp\u003E\nBefore selecting the location, you need to ask what the purpose of your settlement is, and how you\u0027re going to fund it. The location question depends on those answers.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-05T10:05:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223393212\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528184611\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBefore selecting the location, you need to ask what the purpose of your settlement is, and how you\u0027re going to fund it. The location question depends on those answers.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA testbed for extraterrestrial sci/tech outposts across the Solar System.\n\u003C/p\u003E\n\u003Cp\u003E\n(By definition, as it\u0027s \u0022early on\u0022)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-05T10:06:25Z\u0022 title=\u002206/05/2018 10:06  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 5, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-05T11:19:02Z","Content":"\n\u003Cp\u003E\nI voted \u0027Permanently\u0027 for the living in the colony question.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it depends. If I was chosen to help terraform Mars I would almost certainly go and do my best to help making that planet blue again (I don\u0027t have children and I doubt I ever will. Might as well dedicate the rest of my life to something I really believe in). Especially knowing that someone will continue my and other\u0027s effort to achieve the goal. Definitely wouldn\u0027t mind staying there for a couple of years and then returning. Especially if I was getting paid for working there. But I\u0027m pretty sure I don\u0027t have the right education and I can\u0027t really imagine a non-engineer/biologist/geologist being useful in such environment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-08T10:27:13Z\u0022 title=\u002206/08/2018 10:27  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 8, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-05T11:45:23Z","Content":"\n\u003Cp\u003E\nI voted for \u0022Yes—But with the Intention of returning.\u0022 \u003Cspan\u003E\u003Cspan\u003E:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan\u003E To cowardly run away \u003Cs\u003Eif\u003C/s\u003E when something goes wrong.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nBecause I would like to change several extraterrestrial settlements to visit different planets.\n\u003C/li\u003E\n\u003Cli\u003E\nProbably they have special taxes for the newcomers.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-05T11:45:46Z\u0022 title=\u002206/05/2018 11:45  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 5, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2018-06-05T18:28:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223393271\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528193119\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA testbed for extraterrestrial sci/tech outposts across the Solar System.\n\u003C/p\u003E\n\u003Cp\u003E\n(By definition, as it\u0027s \u0022early on\u0022)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI guess the ISS qualifies for that (or some sort of ISS-2). So I\u0027d answer LEO.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-05T18:29:01Z\u0022 title=\u002206/05/2018 06:29  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 5, 2018\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-05T19:20:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223393574\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528223304\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI guess the ISS qualifies for that (or some sort of ISS-2). \u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nISS is in 20 minutes from the Earth, it is not designed to withstand fatal circumstances far from the Earth for years without support or escape options.\u003Cbr\u003E\nIt\u0027s a Skylab\u002BMir on steroids, not a brutal extraterrestrial outpost.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t have any kind of artificial gravity - neither for habitat, nor just medical/physiotherapy one. \u003Cbr\u003E\nThis is not a big problem if send several humans per year and then restore them, sitting in chairs, for months.\u003Cbr\u003E\nBut it probably should be a big problem if these humans have to spent 8 months in a Martian ship, then get to the planet surface and begin digging.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso it should be a problem when you have tens-hundreds humans per planetary orbital base. People of more average health would be required, and you can\u0027t pay such attention to everybody. They should keep being as healthy as possible all their shift.\n\u003C/p\u003E\n\u003Cp\u003E\n(Any low-gravity health experiments at all? None. The biolab with centrifuges has been cancelled.)\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nISS is not protected from radiation events. The crew even has phosphenes due to high energy events.\u003Cbr\u003E\nOf course, we may say that that\u0027s just a question of shielding. But even passive shielding changes mass, heat capacity, electrical capacity, and other station parameters.\u003Cbr\u003E\nMaking a tankette, you can\u0027t be sure you can build a heavy tank until you try, though principle is the same.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso ISS doesn\u0027t have any kind of active shielding.\u003Cbr\u003E\nIt just hopes on magnetosphere mercy.\n\u003C/p\u003E\n\u003Cp\u003E\nISS has no radiation shelter. An extraplanetary one should have a specially designed architecture for this. To keep it relatively lightweight, but to hide the crew behind thick layer of material.\u003Cbr\u003E\nISS is all wide-open.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nISS doesn\u0027t have any kind of advanced medical equipment. There is no surgery, laparoscopy, or dentistry equipment, never such operations have been performed. Especially in zero-G.\u003Cbr\u003E\nIf something serious happens, they will just fix the patient with \u0022medical duct tape\u0022 and send him to home. 20 minutes - and he is in doctors\u0027 hands.\u003Cbr\u003E\nThis is absolutely inappropriate for an extraterrestrial outpost. All surgery and dentistry should be done right in situ.\u003Cbr\u003E\nEven laparoscopy won\u0027t work due to the lightspeed delay. They should have a professional butcher and a full set of field hospital equipment.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, they can spend 1-2 crewmen for fun and romantic spirit, but this is not appropriate if send many people there, as bodycount will be growing too fast.\n\u003C/p\u003E\n\u003Cp\u003E\nTheir original health doesn\u0027t matter at all here. They are going to dig a stone desert, drill, and so on. Daily injuries are inevitable and should be repaired asap, not two years later.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nISS has very limited abilities in resource recycling.\u003Cbr\u003E\nThey can restore iirc ~70% of urine water, they never take shower or bath (like they did in previous editions), never wash their clothes.\u003Cbr\u003E\nThey just wear the clothes for 3..4 days and discard it. It\u0027s a little expensive way to support an extraterrestrial habitat, whether it\u0027s a station or an interplanetary ship on its way.\n\u003C/p\u003E\n\u003Cp\u003E\nThey must wash clothes because it\u0027s easier to recycle the water than replace the clothes.\u003Cbr\u003E\nThey must have a regular bath because they will spend 3 years far from the Earth. It\u0027s necessary to keep their ship, bodies, and minds as clean as possible.\u003Cbr\u003E\nSo, they must not just restore ~5 l of water per day, but 100..200 liters. And not only from urine and feces, but from hygienic water with washing chemicals.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, they have to have these life support systems redundant. Because ISS every several times has some toilet out of order.\u003Cbr\u003E\nIt may be funny in LEO, but it can make a mass disease in a human terrarium far from the Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, they must have toilets, bath/shower cabins, washing machines, hand washers, other hygienic stuff.\u003Cbr\u003E\nConnected to a recycling equipment several tens times as productive as ISS\u0027s ECLSS, Electron-VM, and other S...-... recycling devices.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nISS computer system looks like a hell department for sysadmins.\u003Cbr\u003E\nPacks of notebooks inserted here and there, clouds of wires, so on.\u003Cbr\u003E\nThis defintely tells us how much carefully considered it is.\u003Cbr\u003E\nImagine this horror in any Earth office.\u003Cbr\u003E\nBtw, where is an ISS server room? Does it have it?\n\u003C/p\u003E\n\u003Cp\u003E\nCertainly, improvisation is great, but not in 2 AU from the Earth. \n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nAll these things require a lot of energy. And not tens kW like on ISS.\u003Cbr\u003E\nAny tested equipment?\u003Cbr\u003E\nAny nuke reactor in real life serviced by a (non-professional) crew in orbit?\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nSo, ISS is a nice preliminary mockup of an orbital base in whole, but unlikely it\u0027s in any sense a real precursor of an extraterrestrial habitat, a station or a ship.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-06-05T20:26:01Z","Content":"\n\u003Cp\u003E\nEven so, the ISS is more habitable than any location in the solar system save for Earth.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2018-06-05T21:02:26Z","Content":"\n\u003Cp\u003E\nGo to Titan and suck them oil !\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2018-06-05T21:36:56Z","Content":"\n\u003Cp\u003E\nI think a giant spinning habitat in space is probably the best option for a full on \u0027colony\u0027. \n\u003C/p\u003E\n\u003Cp\u003E\nPlanets are harsh uncontrollable places. Spinning habitats on the other hand are completely controllable, from gravity to atmospheric composition. Another advantage of spinning habitats is that there is no gravitational pull or external atmosphere that could increase the mass/delta-v requirements of any spacecraft that wants to visit. \n\u003C/p\u003E\n\u003Cp\u003E\nThe disadvantages of a spinning habitats are the lack of available resources and radiation protection, but you can just put a spinning colony inside an asteroid to provide resources and radiaton protection. Then there is the fact that spinning habitats have to be huge in order to not make us sick from claustrophobia or merry-go-round-sickness, but remember, \u0027colonies\u0027 aren\u0027t just permanent bases, colonies are full on cities meant to sustain the lives of hundreds of thousands of people, and a base on Mars isn\u0027t going to be less huge.\n\u003C/p\u003E\n\u003Cp\u003E\nIm not saying we shouldn\u0027t go to Mars, the Moon and beyond however. The Moon and Mars would make great scientific and industrial outposts.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2018-06-05T21:44:16Z","Content":"\n\u003Cp\u003E\nAll has their points, LEO is close as in less time and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to reach or return, inside the Van Allen belt so little radiation. Nice for an staging area, space assembly and industry also very nice for tourism. \u003Cbr\u003E\nGEO  like all other locations is outside of the Van Allen belt so you need shielding, main attraction is the communication hotpot, yes it would compete with low orbit clouds of satellites  but you could build structures who would build giant structures here who hover over an area, for streaming delay is not an issue, only for two way communication. \u003Cbr\u003E\nWith large structures its kilometer sized arrays with solar farms to supply all the megawatt they need, military its also the place to put you ABM weapons, up to stuff like hollowed asteroid battle stations.\u003Cbr\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);text-align:left;\u0022\u003E\u003Cspan style=\u0022font-size:13px;\u0022\u003ELagrange Points, add high moon orbit here, breaking up asteroids and other dirty  industrial operations you don\u0027t want in GEO or LEO, yes this will obviously be regulated, the L points it the obvious places, so heavy industry mostly also the real mega-structures, you don\u0027t want them closer because of eclipses but this is scifi \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:13px;\u0022\u003EMoon, I rank second to LEO, radiation shielding is easy, cooling should be pretty easy. Plenty of resources, an premium tourist attraction, no you can not kiss the bride if both is in space suits but you can run on water \u003C/span\u003E\u003Cspan style=\u0022font-size:13px;\u0022\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E still close enough that you can bail out in a few days.\u003C/span\u003E\u003Cbr\u003E\nDownside is that you are in an gravity well, an coil gun can negate some of this but still an issue more so that the south pole looks like the primarily target with its plane change issues. \u003Cbr\u003E\nMars, land and do science until bored, then ignore an level up some so you can terraform. \u003C/span\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2018-06-06T18:33:59Z","Content":"\n\u003Cp\u003E\nRelated to the topic.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://amp.cnn.com/cnn/2018/06/06/us/pew-study-millennials-space-tourism-trnd/index.html?__twitter_impression=true\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://amp.cnn.com/cnn/2018/06/06/us/pew-study-millennials-space-tourism-trnd/index.html?__twitter_impression=true\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe most important thing of space colonization is that there have to be people who want to go to space. Space tourism will likely become a thing within the next 50 years, the cost for tourism will get lower, thus more people will go to space. If space tourism becomes a thing, people will decide if they want to live permanently in space.\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2018-06-08T02:47:14Z","Content":"\n\u003Cp\u003E\nI\u0027ve long been an advocate of colonizing Mars first, mostly because of the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E potential. People forget how close Mars is to Earth in terms of chemical composition. All the raw materials we need to build more or less anything are there in sufficient quantity to be useful, which reduces the problem to extraction and processing. Mars has enough ice in the poles, in the regolith, and in subsurface glaciers to fill an ocean or two, and enough carbon for at least a decently sized biospehere. Compare this to the Moon, which has no carbon, at least as far as we\u0027ve found, and a very small amount of highly inaccessible water ice near the poles. Space itself, of course, is even more useless, since it (by definition) has no usable resources other than constant sunlight. Oh, that\u0027s another thing about the Moon. Its day is 28 Earth days long. Compare to Mars, whose day is 24h 38m 35s, a figure that\u0027s conveniently quite compatible with the human sleep cycle and also solar panels and temperature regulation. Mars is as benign a habitat as we\u0027re likely to find in the solar system outside of Earth itself, while the Moon is an airless rock floating in the void.\n\u003C/p\u003E\n\u003Cp\u003E\nLots of people are suggesting a colony in LEO, but that\u0027s going to be a constant drain on resources. In principle, it\u0027s possible to build a completely closed-loop life support system, but everything wears out with time, and in space there\u0027s nowhere to go for replacement parts, other than back to Earth. With Mars, there\u0027s at least the faintest possibility (however remote it may seem) for self-sufficiency. Mars, at least, has real potential for independent growth, once sufficiently established. And make no mistake, self-sufficiency is something to strive for. A settlement that depends on constant supply will have a very hard time growing, and will amount to little more than a flashy show of technology.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m actually of the opinion that we won\u0027t see large permanent deep-space (including LEO/GEO) habitats for a long, long time. They just don\u0027t make any sense for anything other than research - in a sense, they\u0027re a less practical alternative to building a city in the middle of the Pacific Ocean. Mars isn\u0027t much better, but there\u0027s just something about that red rock in the sky that appeals to people (for whatever reason), and it\u0027s the least bad option.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-06-09T17:25:07Z","Content":"\n\u003Cp\u003E\nThere\u0027s carbon on the Moon. If you built an orbital habitat with material from the Moon, you can expect to have to process millions of tonnes of the lunar regolith. In doing so, you can extract hundreds of tonnes of carbon using abundant solar energy. And while we\u0027re at it, we could make water, using some hydrogen brought from Earth. Water is mostly oxygen and oxygen makes up almost half of the lunar surface composition. Not to mention NEOs, some of which require less delta-v to reach than the Moon, which can be a source of resources as well. Of course, mining the required resources will be difficult.\n\u003C/p\u003E\n\u003Cp\u003E\nAny space colony will be an artificial environment. As such, the only advantage Mars has is resource availability, but this isn\u0027t a very big advantage, since you need energy to acquire, process, and use the resources, not to mention the disadvantages of distance and travel time. Getting the large amounts of energy required on Mars is somewhat problematic. Solar arrays can be used on the surface but that has issues, and nuclear energy is an option but carries significant risks for use in space. Compare this to the abundance of energy in space, where there is no night. Then it\u0027s a matter of accessing the energy. It is still difficult to get access to the large amounts required, but establishing the infrastructure near Earth will be easier than on Mars, due to sheer travel time and the required energy to reach Mars. Once the solar energy system is up and running we can use the abundant energy provided to acquire, process, and use materials, for many purposes. Orbital habitats could be built, but other structures may be useful as well. Large telescopes of various kinds, large manned spacecraft, more solar arrays, and quite a bit more useful things can be built. In-space manufacturing is likely to be developed, eventually, and then it\u0027s a matter of life support technology and engineering.\n\u003C/p\u003E\n\u003Cp\u003E\nStill quite difficult, but definitely possible.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-09T19:30:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396289\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528565107\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s ca\u003Cspan\u003E﻿\u003C/span\u003Erbon on the Moon. If you built an orbital habitat with material from the Moon, you can expect to have to process millions of tonnes of the lunar regolith. In doing so, you can extract hundreds of tonnes of carbon using abundant solar energy. And while we\u0027re at it, we could make water, using some hydrogen brought from Earth. Water is mostly oxygen and oxygen makes up almost half of the lunar surface composition. \u003Cspan\u003E﻿\u003C/span\u003ENot to mention NEOs, some of which require less delta-v to reach than the Moon, which can be a source of resources as well. Of course, mining the required resources will be difficult.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEarth escape speed = 11.2 km/s.\u003Cbr\u003E\nLunar escape speed = 2.3 km/s.\u003Cbr\u003E\nSo, it takes roughly about 16 km/s to deliver something from Earth to the Moon surface.\n\u003C/p\u003E\n\u003Cp\u003E\n16000\u003Csup\u003E2\u003C/sup\u003E/2/10\u003Csup\u003E6\u003C/sup\u003E ~= 130 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg\n\u003C/p\u003E\n\u003Cp\u003E\nSo, everything requiring  \u0026gt;150 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg to be extracted on the Moon, is energetically cheaper to deliver from the Earth.\u003Cbr\u003E\u003Ca href=\u0022http://wordpress.mrreid.org/2011/07/15/electricity-consumption-in-the-production-of-aluminium/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wordpress.mrreid.org/2011/07/15/electricity-consumption-in-the-production-of-aluminium/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(20,20,18);\u0022\u003EAccording to \u003C/span\u003E\u003Ca href=\u0022http://www.alcoa.com/global/en/home.asp\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#ffffff;color:#0a54bc;font-size:16px;\u0022 title=\u0022Alcoa website\u0022\u003EAlcoa\u003C/a\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(20,20,18);\u0022\u003E, the world’s largest producer of aluminium, the best smelters use about 13 kilowatt hours (\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Ca href=\u0022http://www.wolframalpha.com/input/?i=13kWh\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#ffffff;color:#0a54bc;font-size:16px;\u0022 title=\u0022Calculation of 13kWh\u0022\u003E46.8 megajoules\u003C/a\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(20,20,18);\u0022\u003E) of electrical energy to produce one kilogram of aluminium; the worldwide average is closer to 15 kWh/kg (54 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg).\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n(And that doesn\u0027t include ~600 of cryolite and graphite electrodes to be spent per tonne of aluminium, and solar panels or nuclear fuel to be produced and spent to give that energy).\n\u003C/p\u003E\n\u003Cp\u003E\nThis means that in any case alumina splitting into aluminium and oxygen cannot be cheaper than import of aluminium and oxygen from the Earth.\u003Cbr\u003E\nAny splitting of lunar regolith makes sense only in homeopathic amounts - to give several kilograms of oxygen for breathing, which in turn also makes no sense at all.\n\u003C/p\u003E\n\u003Cp\u003E\nLunar regolith is a totally useless slag. \u003Cbr\u003E\nMoon is a slagball, a fully and completely burnt Mordor, even without volcano. You can\u0027t even burn it more, it\u0027s already the burnt\u0027est.\u003Cbr\u003E\nIt\u0027s at the very bottom of energetic well, it consists of most heatproof materials. Any other material has been  lost in the Moon birth act.\u003Cbr\u003E\nEverything you can extract there, it\u0027s cheaper to deliver from the Earth just in 16 km/s from there.\n\u003C/p\u003E\n\u003Cp\u003E\nNo lunar metallurgy or oxygen extraction can make any sense just for the simple power requirements. Never, at any tech level.\u003Cbr\u003E\nJust because alumina won\u0027t be less heatproof in future. The same with iron and titanium oxides.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same with lunar carbon. If you have to mine thousand tonnes of regolith to get one tonne of carbon, you just have to deliver this tonne from the Earth and leave alone the regolith.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396289\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528565107\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs such, the only advantage Mars has is resource availability, but this isn\u0027t a very big advantage, since you need energy to acquire, process, and use the resources, not to mention the disadvantages of distance and travel time.\u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMars atmo consists of CO\u003Csub\u003E2\u003C/sub\u003E and N\u003Csub\u003E2\u003C/sub\u003E, and it has water.\u003Cbr\u003E\nThis means you can provide the near-Mars orbital infrastructure with cheap nitrogen and hydrocarbons.\u003Cbr\u003E\nA Nexus/Sea-Dragon/whatever huge reusable \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E methalox rocket, shuttling between the polar \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E facility and the orbit.\u003Cbr\u003E\nDelivering thousands tonnes of methanol, hydrazine, cyanic acid to the orbital plants and interplanetary fuel station.\n\u003C/p\u003E\n\u003Cp\u003E\nPhobos and Deimos.\u003Cbr\u003E\nConsisting also of heatproof oxides, but out of gravity well and farther from the Sun, with much less heliocentric orbital speed. (30 / sqrt(1.524) = 24 km/s, so you gain 6 km/s for interplanetary transfers \u002B several km/s due to the Martian low escape speed)..\u003Cbr\u003E\nYou can melt aluminium there and make rough metal, ceramic, and plastic parts, delivering hi-tech equipment for the ships from the Earth.\u003Cbr\u003E\nA Solar System main shipyard and fuel refinery.\n\u003C/p\u003E\n\u003Cp\u003E\nBuilding between others near-Sun power collectors/emitters and sending them to near-Sun orbit.\u003Cbr\u003E\nIt\u0027s energetically by orders of magnitude cheaper that trying to do this on Mercury.\u003Cbr\u003E\nMercury is another useless piece of slag, like Moon.\n\u003C/p\u003E\n\u003Cp\u003E\nUntil you totally spend Phobos, Deimos, Martian atmo, and Martian cryo.\u003Cbr\u003E\nThen (in far future) the Mars will become another one piece of useless slag. That\u0027s its purpose. Not terraforming.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396289\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528565107\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003EGett\u003Cspan\u003E﻿\u003C/span\u003Eing the large amounts of energy required on Mars is somewhat problematic. Solar arrays can be used on the surface but that has issues, and nuclear energy is an option but carries significant risks for use in space.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThose risks are included in check. This is another planet utilization, btw. Nothing to do there without fusion reactors, except flag planting and stones gathering.\n\u003C/p\u003E\n\u003Cp\u003E\nMars has water. Water means hydrogen. Some part of hydrogen is deuterium. Deuterium is fusion.\u003Cbr\u003E\nSo once you can burn deuterium, you have no problem with energy.\u003Cbr\u003E\nUntil that you anyway have nothing to do with Mars.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-09T19:50:28Z\u0022 title=\u002206/09/2018 07:50  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 9, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2018-06-09T23:38:27Z","Content":"\n\u003Cp\u003E\nEven useless slag is very well suited for an orbital colony: 95% or more of its mass will be made of the stuff, for the purpose of radiation shielding. No problem there. That is exactly what we need.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not the best source out there, but we can figure out how to extract what we need.\n\u003C/p\u003E\n\u003Cp\u003E\nDelivering mass to the Moon from Earth is energetically expensive. As such, the mass to be delivered to the Moon will be minimized as much as possible. Even so, if a base is constructed that will extract the necessary material, then it will take less energy per kg than delivering that mass from Earth. Once the infrastructure is in place, the energy required to move the extracted material to the destination will be vastly reduced. The concept does not involve sending millions of tonnes to the lunar surface and then bringing it back into orbit, rather, the concept is to build a moonbase for the purpose of extracting local material, and then that material would be processed and delivered to wherever it needs to go. The mass of the moonbase would be as small as practical. Further processing would be done in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t have to compete with Earth sources, not so long as launch costs prohibit putting millions of tonnes into space economically, or even hundreds of thousands of tonnes of aluminum. The cost would be quite high even with much lower launch costs. Energy is quite important, but so is cost. Sourcing aluminum and other materials from the Moon would only happen if it was economical to do so. Considering the large masses that would be needed for a colony, unless launch prices hit rock bottom, it would be cheaper to go for the Moon and, potentially, asteroids.\n\u003C/p\u003E\n\u003Cp\u003E\nDelivering material from the Moon to a high altitude Earth orbit will take less energy than delivering the same mass to the same location but from Earth. Taking GEO as just one example of such an orbit, the delta-v from the lunar surface is 3.92 km/s. Less than 8 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg. Of course, GEO is just an example orbit. The energy cost is less to acquire the massive amount of required material from the surface of the Moon, for the most part, when compared to Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nLunar carbon is just a convenient by-product. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat you suggest is quite difficult. Getting a number of super rockets to Mars would be an even more difficult task than getting the equipment for scooping out lunar regolith to the Moon. And if we were to set up the infrastructure to build the rockets at Mars, we could also set up an infrastructure to source materials from the Moon.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a number of asteroids that are energetically closer than Phobos and Deimos.\n\u003C/p\u003E\n\u003Cp\u003E\nIf there\u0027s nothing to do there without fusion, and fusion research is currently massively underfunded, Mars utilization won\u0027t happen for a good while.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain: useless slag is perfect. Exactly what we need.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-10T04:48:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDelivering mass to the Moon from Earth is energetically expensive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs we can see, it\u0027s less energetically expensive than extracting it from lunar regolith.\u003Cbr\u003E\nBoth metals and oxygen.\u003Cbr\u003E\n~150 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg to deliver from already existing Earth plants\u003Cbr\u003E\nvs\u003Cbr\u003E\n50 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg just to split the oxides \u002B energy to deliver expendables from the Earth \u002B energy to extract and enrich the raw material \u002B energy for plants support \u002B energy for the plant personnel habitat life support.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s why it will be always energetically cheaper to deliver it from the Earth than produce on the Moon.\u003Cbr\u003E\nAnd why even the oxidizer will be fully imported. Because to get oxygen you still need to split alumina, spending at least as much energy as you need to deliver it from the Earth atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso don\u0027t forget that they will be either spending energy to.keep the oxygen cryotanks, or (like in ISS) convert the oxygen into something storable, say, water.\u003Cbr\u003E\nEverything storable requires hydrogen or nitrogen, which in turn can be only delivered from the Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nSo for breathing they will anyway use imported water and waste recycling.\u003Cbr\u003E\nWhile any fuel or construction material would be only delivered from the Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only purpose of regolith is a protective layer around the base. A sand for bags.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs such, the mass to be delivered to the Moon will be minimized as much as possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo. Total energy requirements will be.\u003Cbr\u003E\nAnd here we have a pure case when it\u0027s cheaper to import than to make at place.\u003Cbr\u003E\nEspecially when the colony can give nothing to pay back,.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOnce the infrastructure is in place, the energy required to move the extracted material to the destination will be vastly reduced.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlumina oxide entalpy depends on human infrastructure?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe concept does not involve sending millions of tonnes to the lunar surface and then bringing it back into orbit, rather, the concept is to build a moonbase for the purpose of extracting local material, and then that material would be processed and delivered to wherever it needs to go.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe concept involves producing millions of tonnes for the price of tens millions of tonnes delivery.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDelivering material from the Moon to a high altitude Earth orbit will take less energy than delivering the same mass to the same location but from Earth.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt will take so much energy to produce this material, that its delivery would not play great role.\u003Cbr\u003E\nBut instead it needs fuel to deliver it from Moon, which in turn should be first delivered from the Earth.\u003Cbr\u003E\nBecause it\u0027s energetically cheaper to deliver even oxidizer from Earth rather than extract it from the heatproof oxides on Moon.\u003Cbr\u003E\nThey are the most heatproof materials in the Universe, that\u0027s why solid planets are made of them.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat you suggest is quite difficult.\u003Cspan\u003E﻿\u003C/span\u003E Getting a number of su\u003Cspan\u003E﻿\u003C/span\u003Eper rockets to Mars would be an even more difficult task than getting the equipment for scooping out lunar regolith to the Moon. And if we were to set up the infrastructure to build the rockets at Mars, we could also set up an infrastructure to source materials from the Moon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExtracting alumina and oxygen on Moon - that\u0027s not less difficult.\u003Cbr\u003E\nAnd makes no sense when you have a whole Earth industry right there, which anyway will be first delivering to the Moon everything to deliver the hardly extracted alumina from the Moon.\n\u003C/p\u003E\n\u003Cp\u003E\nOne \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E super rocket on Mars can perform many flights because its atmosphere is not so deadly..\u003Cbr\u003E\nAnd new superrockets tanks can be being built out of metals extracted on Phobos, like you suggest to do this on Moon. A self-replicated colony of superrockets.\u003Cbr\u003E\nAnd rather than Moon, Mars/Phobos has all fluids much more available. Because it\u0027s orbital speed is ~3.6 km/s, rather than 7.8 km/s of Earth.\u003Cbr\u003E\nAlso, unlike on Earth, on Mars you can use reusable chemical \u003Cem\u003Esingle-stage \u003C/em\u003Erockets fueled with local materials (methalox).\n\u003C/p\u003E\n\u003Cp\u003E\nOn Mars you don\u0027t need to split alumina to get the oxygen.\u003Cbr\u003E\nThis makes a Phobos shipyard production cheaper than lunar one.\u003Cbr\u003E\nAlso, having a near-Mars shipyard, you gain delta-V in both directions: to the outer planets, and to the inner ones, including Earth.\u003Cbr\u003E\nAnd unlike on Moon, you can spend cheap propellant from the Martian gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd near Phobos you don\u0027t have to lift the metal products from the lunar gravity well. Like it\u0027s already floating in orbit. \u003Cbr\u003E\nThis both saves energy and allows to build more complicated and lightweight structures, because they don\u0027t need to withstand the launch.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLunar carbon is just a convenient by-product. \u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn such amounts it\u0027s not a by-product, but a pollution.\u003Cbr\u003E\nYou anyway have to deliver much more carbon from Earth.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere are a number of asteroids that are energetically closer than Phobos and Deimos.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAsteroids can make sense only in two cases:\u003Cbr\u003E\n1. A transit refueling station (use the ice as propellant to refuel transit ships).\u003Cbr\u003E\n2. A compact deposit of very rare metals is found.\u003Cbr\u003E\nMars\u002BPhobos = metals \u002B fluids at once, in one place. Also you have 0.4 g gravity for technologies which prefer gravity, Say, you can\u0027t build distillation columns on asteroids, the gravity is too low.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, asteroids are rather useless, except several ones used to mine ice to refuel the transit ships to the outer planets.\u003Cbr\u003E\nAnd, if a miracle happens, a pure platinum asteroid, not just a big piece of polluted iron.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396454\u0022 data-ipsquote-contentid=\u0022175625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528587507\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf there\u0027s nothing to do there without fusion, and fusion research is currently massively underfunded, Mars utilization won\u0027t happen for a good while.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, it won\u0027t. \u003Cbr\u003E\nThat\u0027s why nowadays Martian plans are just an expensive way to play KSP irl, nothing more.\n\u003C/p\u003E\n\u003Cp\u003E\nThey have reached the South Pole a century ago. What has been changed since then?\u003Cbr\u003E\nAn empty ice desert stays an empty ice desert, though it even doesn\u0027t need to deliver air and water from another planet or extract it from stones.\n\u003C/p\u003E\n\u003Cp\u003E\nUntil they get an ocean of fusion energy, nothing will change neither in Antarctica, nor on Moon, nor on Mars.\u003Cbr\u003E\nSeveral houses with scientists surviving in snow - in the best case.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-10T05:09:04Z\u0022 title=\u002206/10/2018 05:09  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 10, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}