{"TopicId":176176,"ForumId":16,"TopicTitle":"FlyBy and science","CreatedByName":"conao","CreatedById":189986,"CreatedDateTime":"2018-06-25T17:48:33Z","PageNum":1,"Articles":[{"CreatedByName":"conao","CreatedById":189986,"CreatedDateTime":"2018-06-25T17:48:34Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nIn Career mode, there\u0027s a contract that asks for a flyby on the Mun and to get science from it. However, if I try to get science during the flyby, although I\u0027m in the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E of the Mun, I get the science from Kerbin upper space, which doesn\u0027t fulfil the contract. I guess it\u0027s because I\u0027m, in fact, still orbiting Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, does anyone know if I need to get into an orbit around the Mun to get this contract fulfilled, although it says only flyby, not orbit? Or do I need to get closer to the Mun during the flyby, in which case, how close the flyby needs to be?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nMarconi\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-06-25T21:24:40Z","Content":"\n\u003Cp\u003E\nNo, something is wrong. Either you took the experiment while you were outside the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, or you have a mod that\u0027s causing an error.\n\u003C/p\u003E\n\u003Cp\u003E\nAny experiment that is done even 1 meter inside the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E will return Mun science. Not \u0022Kerbin High\u0022 science.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-06-26T03:22:03Z","Content":"\n\u003Cp\u003E\nA flyby must pass through the sphere of influence of the body in question. Looks like you\u0027re pretty new to the game, so do you know what that means? In this first picture, the yellow part of my projected path line passes through Mun\u0027s sphere of influence (\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E), and is therefore a flyby. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/vb3ziq9.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022vb3ziq9.png\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nOnce the ship actually gets there, the colors of the lines change. In this pic, the ship is inside Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Ithe5Ah.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022Ithe5Ah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs long as you\u0027re taking your science readings within that sphere around Mun, you should meet the contract\u0027s requirements. \n\u003C/p\u003E\n"},{"CreatedByName":"conao","CreatedById":189986,"CreatedDateTime":"2018-06-26T18:52:36Z","Content":"\n\u003Cp\u003E\nThanks guys, that confirms what I thought it should be, so I must have done something wrong. \n\u003C/p\u003E\n\u003Cp\u003E\nYes, I\u0027m very new to the game, but I\u0027ve learned what a \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E is... but maybe I\u0027m still confused.  \u003Cspan\u003E:-)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ELet\u0027s try it again!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E/Marconi\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"conao","CreatedById":189986,"CreatedDateTime":"2018-07-08T20:13:44Z","Content":"\n\u003Cp\u003E\nOk, here\u0027s what I missed: the two icons that indicate when you get in and out of an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. I probably waited too long to take the science logs and by the time I did it, I was already out of the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for your help guys!\n\u003C/p\u003E\n\u003Cp\u003E\n/Marconi\n\u003C/p\u003E\n"}]}