{"TopicId":176286,"ForumId":44,"TopicTitle":"Need Some Scientific Facts For an Idea of Mine","CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-06-30T02:53:34Z","PageNum":1,"Articles":[{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-06-30T02:53:34Z","Content":"\n\u003Cp\u003E\nOkay, so I have this idea for a Sci-Fi story called \u003Cem\u003EBlackout\u003C/em\u003E. And I\u0027d like some of the super smart people here to tell me if this can happen, and if so, how will it happen?\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, the story goes like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIn the near future, radio astronomers begin to detect strange signals coming from nearby stars. The signals are continuous, repeating patterns. At first, thought to be alien transmissions, that hope is turned to terror when the signals begin to get louder and louder, culminating in the stunning and horrifying collapse of the entire star into a black hole -- the final process itself taking only an hour.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThis happens several times over the decades, the star-killing phenomenon getting closer and closer to Sol. Finally, it is reported to the horror of all humanity that these signals are now coming from our sun and that we have only twenty years before the collapse.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s how I imagine the collapse happening:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nSome sort of unexplained force starts compressing the star, this process takes an hour.\n\u003C/li\u003E\n\u003Cli\u003E\nAs the star gets further and further squished, the added friction creates more heat, and the fusion process becomes more powerful.\n\u003C/li\u003E\n\u003Cli\u003E\nAs it shrinks, the star gets exponentially brighter (somewhere in the range of several thousand times), in the process vaporizing the innermost planets and melting the crust off of those further out, sterilizing the entire system.\n\u003C/li\u003E\n\u003Cli\u003E\nFinally, the star can\u0027t be squeezed any further, and it collapses into a black hole, plunging the entire remaining solar system into darkness.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo what I\u0027d like to know is: How bright will the Sun get as it\u0027s squished? What is the curve for that? And what will happen to planets and moons based on their distances? Will Mercury be vaporized? Earth and Luna melted? Will Jupiter\u0027s atmosphere be blown away? Are Uranus and Neptune safe? These are all things I\u0027d like to know.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2018-06-30T03:16:50Z","Content":"\n\u003Cp\u003E\nWell, first of all: Sun is too small to collapse into a black hole. Red giant and then white dwarf is the most likely final outcome of our star\u0027s life. But you are using space magic anyway, so... \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E Mercury may not survive. Venus and Earth will be stripped of their atmospheres and burnt to cinders - but they will still be there as planets. Same for Mars probably. Jupiter and the rest of gas giants probably will be untouched. Though smaller satellites of Jupiter and Saturn might be in trouble - increase in solar energy can cause a partial meltdown and escape of volatiles.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-30T09:57:31Z","Content":"\n\u003Cp\u003E\nNot to bash your idea but you might as well add mutated neutrinos or monoliths to the story. But then the monoliths from 2001 weren\u0027t indestructible because one of them got hit by a meteorite and got damaged so they would probably not survive the interior of the Sun. Also, why does it have to involve some sort of catastrophy? I mean, I know a lot has been already invented by the Sci-Fi genre and it\u0027s hard to come with some interesting ideas (I\u0027m struggling to come up with anything on my own tbh) but if I was to write a story I would make it about humans and how they deal with stuff. Part of the reason why I like The Martian and The Expanse so much is because of its complexity and how humans interact with their environment instead of \u0022The Sun/Earth\u0027s core is dying and we need to drop nukes on it to reignite it\u0022. Maybe try something semi-realistic like that. There\u0027s really not many options left when your star is about to die/explode. Either just get the hell out of your solar system or build fusion reactors and rely on that.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW, don\u0027t stars get brighter because they get bigger not the other way around? The more surface for light to escape from the birghter it should be, right?\n\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-06-30T10:57:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407774\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530352651\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Wjolcz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBTW, don\u0027t stars get brighter because they get bigger not the other way around? The more surface for light to escape from the birghter it should be, right?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA star like the sun will get bigger as it goes into it\u0027s red giant phase.  As the interior of the sun heats up the outer layers will get fluffed up and expand, the surface will be cooler and redder.  \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407665\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530327214\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Col\u003E\u003Cli\u003E\nSome sort of unexplained force starts compressing the star, this process takes an hour.\n\u003C/li\u003E\n\u003Cli\u003E\nAs the star gets further and further squished, the added friction creates more heat, and the fusion process becomes more powerful.\n\u003C/li\u003E\n\u003Cli\u003E\nAs it shrinks, the star gets exponentially brighter (somewhere in the range of several thousand times), in the process vaporizing the innermost planets and melting the crust off of those further out, sterilizing the entire system.\n\u003C/li\u003E\n\u003Cli\u003E\nFinally, the star can\u0027t be squeezed any further, and it collapses into a black hole, plunging the entire remaining solar system into darkness.\n\u003C/li\u003E\n\u003C/ol\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you are right that compressing a star would make it brighter but you might run into some troubles with the amount of time you are talking about.  Stars are generally really big so any event that affects the entire star might take a bit longer than an hour. \n\u003C/p\u003E\n\u003Cp\u003E\n  Another thing to consider would be conserving the angular momentum of the star\u0027s rotation.  As the star gets \u0022crushed\u0022 it would start spinning faster and faster, probably causing some really crazy things to happen with it\u0027s magnetic fields.  You also might get some kind of gravitational wave signal detected at LIGOS of the event.  \n\u003C/p\u003E\n\u003Cp\u003E\nI have a hard time buying the idea that a stellar process could be \u0022contagious\u0022 between stars.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if this was happening in our little corner of our galaxy chances are we would have detected the same thing happening somewhere else in the universe.  \n\u003C/p\u003E\n\u003Cp\u003E\n  Good luck with your story!\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-30T11:17:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407791\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530356249\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA star like the sun will get bigger as it goes into it\u0027s red giant phase.  As the interior of the sun heats up the outer layers will get fluffed up and expand, the surface will be cooler and redder.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m aware of this but redder =/= brighter so this doesn\u0027t answer my question. I\u0027m sure it\u0027s not just the case of bigger = birghter because it also depends on the spectrum of the star. Red dwarves are bright but in infrared spectrum (like Proxima Centauri). Unless we\u0027re assuming the spectrum doesn\u0027t change then I\u0027m pretty sure if the Sun shrunk and kept the same spectrum it would actually lead to an ice age on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, are we assuming this catastrophic phenomenon turns the Sun into a fully convective star like red dwarves? If so then the X-rays from the core would get blasted out and wreak havoc in Earth\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nDo keep in mind I\u0027m not any kind of cosmologist so anything I write here might be wrong.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-30T11:18:07Z","Content":"\n\u003Cp\u003E\nAlien stellar parasites invade into stars, suck their elecromagnetic field, and as nothing can withstand gravitation, contaminated stars collapse, at any mass.\n\u003C/p\u003E\n\u003Cp\u003E\nThe repeating patterns are their chewing.\u003Cbr\u003E\nBlack holes are their cocoons.\u003Cbr\u003E\n\u0022The Invasion of Light-Sucking Cocoons.\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-30T11:24:01Z\u0022 title=\u002206/30/2018 11:24  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 30, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-06-30T11:21:17Z","Content":"\n\u003Cp\u003E\nI like the concept \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EIf you\u0027re burning up billions of years of hydrogen in just an hour, then the radiation (light and others) would be billions of times higher. I\u0027d compare the brightness to the interior of an h-bomb, except even an h-bomb isn\u0027t *that* bright.\u003C/span\u003E\u003Cbr\u003E\u003Cimg alt=\u0022hertzsprung_russell_diagram.png\u0022 class=\u0022ipsImage\u0022 height=\u0022585\u0022 src=\u0022https://imgs.xkcd.com/comics/hertzsprung_russell_diagram.png\u0022 width=\u0022441\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI think you\u0027d have a difficult time describing the effects.\n\u003C/p\u003E\n\u003Cp\u003E\nAs was pointed out by Scotius, the sun lacks the mass to collapse into a black hole under it\u0027s own weight. *However*, whatever is compressing it may be strong enough to pack it into it\u0027s own Schwarzschild radius.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck on the story!\n\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-06-30T15:59:40Z","Content":"\n\u003Cp\u003E\nI think you might also briefly see jets at the polls of the stars as they collapse.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Astrophysical_jet\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Astrophysical_jet\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2018-06-30T23:35:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407802\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530357478\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Wjolcz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m aware of this but redder =/= brighter so this doesn\u0027t answer my question. I\u0027m sure it\u0027s not just the case of bigger = birghter because it also depends on the spectrum of the star. Red dwarves are bright but in infrared spectrum (like Proxima Centauri). Unless we\u0027re assuming the spectrum doesn\u0027t change then I\u0027m pretty sure if the Sun shrunk and kept the same spectrum it would actually lead to an ice age on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, are we assuming this catastrophic phenomenon turns the Sun into a fully convective star like red dwarves? If so then the X-rays from the core would get blasted out and wreak havoc in Earth\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nDo keep in mind I\u0027m not any kind of cosmologist so anything I write here might be wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, it\u0027s the opposite. Bigger = dimmer. Generally-speaking. There are some stars out there that are both big and bright. But I\u0027m inclined to agree that if you could somehow compress the sun like squeezing an egg, it would get brighter and hotter.\n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-06-30T23:47:17Z","Content":"\n\u003Cp\u003E\nMost stars are found along something called the Main Sequence, characterized by their balance between inward gravity and outward pressure generated by hydrogen fusion. Other stars exist that are off of it and fusing other elements, or else are dead or dying. These types have varying letters (spectral classifications) applied to them, with numerical sub-groups and a corresponding informal color (you can see the color in a good telescope). The higher up the scale, the bigger (and brighter) the star, but the faster the rate at which the hydrogen in them is used up and so the shorter their lifespan. For a number of reasons, very large stars - called giants, supergiants and hypergiants - like to live at the extreme ends of the spectral scales. Giant stars really do not like to be classes F or G, seeming to stay there for a very short time while heating up or cooling down to either extreme. There are a few known, but are decidedly in the minority. In general, most of the visible giants are either class-M or rather cool class-K (Betelgeuse, Arcturus) red giants, or class-B (Eta Carinae, Rigel, Deneb) blue giants. Main Sequence Classifications, in order from hottest to coolest:\n\u003C/p\u003E\n\u003Cp\u003E\nO – Blue-violet stars. The hottest and most massive main sequence stars, with most of their energy output in the ultraviolet regions of the spectrum. Pretty rare, but also conspicuous. Delta Orionis and Zeta Puppis (Naos) are examples.\n\u003C/p\u003E\n\u003Cp\u003E\nB – Blue-white stars, e.g. Rigel, or all the bright stars in the Pleiades.\n\u003C/p\u003E\n\u003Cp\u003E\nA – White stars. Sirius A and Vega are examples.\n\u003C/p\u003E\n\u003Cp\u003E\nF – Yellow-white stars. Upsilon Andromedae and Procyon are of this type. Canopus is a rare class F giant.\n\u003C/p\u003E\n\u003Cp\u003E\nG – Yellow stars. The most famous is a G2V type known in Latin as Sol, and in English as The Sun. Alpha Centauri A, Tau Ceti and Zeta Reticuli are this type as well.\n\u003C/p\u003E\n\u003Cp\u003E\nK – Orange stars. Alpha Centauri B, Epsilon Eridani.\n\u003C/p\u003E\n\u003Cp\u003E\nM – Red dwarf stars. Have very long life-spans i.e. a trillion years. Proxima Centauri and Barnard\u0027s Star are of this type. Luminosity class is always V or VI, as more massive types are actually red giants, an entirely different kind of creature.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to memorize the above sequence, use a handy mnemonic like \u0022Oh Be A Fine Girl, Kiss Me\u0022 or \u0022Oh Big And Ferocious Gorilla, Kill Mikey.\u0022 Compressing the sun would likely increases the pressure inside, which, if I predicted correctly, would increase the luminosity and thermal output\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2018-07-01T00:23:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407665\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530327214\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis happens several times over the decades, the star-killing phenomenon getting closer and closer to Sol. Finally, it is reported to the horror of all humanity that these signals are now coming from our sun and that we have only twenty years before the collapse.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like the idea.... \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-07-01T01:47:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223407681\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530328610\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, first of all: Sun is too small to collapse into a black hole.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUnder it\u0027s own mass.   But if there is a mystical outside force acting on it, then I see no reason (within the realms of sci fi) that it cannot.   Stellar mass and smaller black holes are theorized to exist. \n\u003C/p\u003E\n\u003Cp\u003E\nBut an hour seems a bit fast.    I haven\u0027t done any of the math, but anything traversing a solar radius within an hour might be experiencing some relativistic effects.  This might be a good thing though.    But it also means that you probably have a force that can accelerate material to a fraction of light speed (Ok I just did the math, about 16% of the speed of light), and also push against the outward force of the star itself, and then against the quantum forces that keep atoms from collapsing, is a pretty strong force.   \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-01T01:55:28Z\u0022 title=\u002207/01/2018 01:55  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 1, 2018\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-07-01T02:35:57Z","Content":"\n\u003Cp\u003E\nSomeone would estimate the energy required to force a Sun to collapse, while it\u0027s desperately attempts to uncollapse back.\n\u003C/p\u003E\n\u003Cp\u003E\nCan\u0027t do this myself, but wouldn\u0027t such energy be comparable to an energy to addd 1.5 M\u003Csub\u003ESun\u003C/sub\u003E more.\u003Cbr\u003E\nIf so, they wouldn\u0027t need the original Sun, they could be making blackholes right from the interstellar gas.\n\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-07-01T02:44:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408169\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530412557\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSomeone would estimate the energy required to force a Sun to collapse,\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E while it\u0027s desperately attempts to uncollapse back.\n\u003C/p\u003E\n\u003Cp\u003E\nCan\u0027t do this myself, but wouldn\u0027t such energy be comparable to an energy to addd 1.5 M\u003Csub\u003ESun\u003C/sub\u003E more.\u003Cbr\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E If so, they wouldn\u0027t need the original Sun, they could be making blackholes right from the interstellar gas.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not really speculating on motivations right now. I can just chop it up to being a weird phenomenon or hyper-advanced aliens of unexplainable motives -- it\u0027s SF you know. \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027d kinda like to know, however, is how much damage could such a process do. Aside from the freezing, the comes after the collapse, the process itself would cause the collapsing star to brighten exponentially, and cook everything within range. But what is that range? Which planets would survive, which wouldn\u0027t, and what would the effects on them be? Blown-away atmospheres? Melted crust? Vaporized?\n\u003C/p\u003E\n\u003Cp\u003E\nI want to be as scientifically accurate about these effects as possible. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2018-07-01T04:50:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408093\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530402437\u0022 data-ipsquote-userid=\u0022168061\u0022 data-ipsquote-username=\u0022ARS\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, ARS said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nO – Blue-violet stars. The hottest and most massive main sequence stars, with most of their energy output in the ultraviolet regions of the spectrum. Pretty rare, but also conspicuous. Delta Orionis and Zeta Puppis (Naos) are examples\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, dang. Somehow I never knew that O-class emitted primarily UV. Heh... too bad they don\u0027t look like black lights in the sky \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/span\u003E\u003C/span\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408175\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530413070\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m not really speculating on motivations right now. I can just chop it up to being a weird phenomenon or hyper-advanced aliens of unexplainable motives -- it\u0027s SF you know. \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027d kinda like to know, however, is how much damage could such a process do. Aside from the freezing, the comes after the collapse, the process itself would cause the collapsing star to brighten exponentially, and cook everything within range. But what is that range? Which planets would survive, which wouldn\u0027t, and what would the effects on them be? Blown-away atmospheres? Melted crust? Vaporized?\n\u003C/p\u003E\n\u003Cp\u003E\nI want to be as scientifically accurate about these effects as possible. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs the \u0022force\u0022 going to keep the star compressed after it reaches singularity size,  or does it terminate at that point? Considering that the sun\u0027s mass isn\u0027t actually being increased, would it be a stable black hole even if you could somehow do this? Seems like turning off the force would just cause the star to immediately go supernova.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-01T05:00:45Z\u0022 title=\u002207/01/2018 05:00  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 1, 2018\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-07-01T05:10:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408208\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530420618\u0022 data-ipsquote-userid=\u002267603\u0022 data-ipsquote-username=\u0022vger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, vger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs the \u0022force\u0022 going to keep the star compressed after it reaches singularity size,  or does it terminate at that point? Considering that the sun\u0027s mass isn\u0027t actually being increased, would it be a stable black hole even if you could somehow do this? Seems like turning off the force would just cause the star to immediately go supernova.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe force goes away once the squeezing is done and the star has become a bottomless pit.\n\u003C/p\u003E\n\u003Cp\u003E\nA stable black hole can exist at any mass, though smaller ones have shorter lifespans due to decay by Hawking Radiation. So you could theoretically compress \u003Cem\u003Eanything\u003C/em\u003E into a black hole.\n\u003C/p\u003E\n\u003Cp\u003E\nEverything is held together and apart by certain forces. Enough gravity, however, can overwhelm those forces. Enough gravity can collapse the electrons of atoms onto their nuclei. Whenever an electron collides with a proton, it forms a neutron. So this process of collapsing atoms will create a body of solid neutrons of extreme density.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even there it doesn\u0027t quite end. Enough pressure and you can break the forces holding \u003Cem\u003Ethose\u003C/em\u003E particles together until there\u0027s physically nothing left but a single point of infinite density. Nobody even knows what a singularity is made of, I think.\n\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-07-01T06:06:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408175\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530413070\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027d kinda like to know, however, is how much damage could such a process do. Aside from the freezing, the comes after the collapse, the process itself would cause the collapsing star to brighten exponentially, and cook everything within range. But what is that range? Which planets would survive, which wouldn\u0027t, and what would the effects on them be? Blown-away atmospheres? Melted crust? Vaporized?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n  Ok, your talking about several billion years worth of the sun\u0027s fusion taking place in minutes... cool!  It would be interesting to view this from the night side of the moon (viewing it from the night side of the earth might be complicated by the earth\u0027s atmosphere and oceans on the daylight side wanting to leave the planet in a hurry).  As this tsunami of photons travelled past the moon you would probably be broiled by light reflected by light reflecting off everything else in the solar system.  Most of this material is concentrated within a disc surrounding the sun.  Asteroids and planets would appear to brighten many times than the (normal) sun.  Zodiacal light is sunlight reflected off of dust orbiting the sun and is visible as a faint glow at certain times of the year would become deadly bright as well.  \u003Ca href=\u0022https://en.wikipedia.org/wiki/Zodiacal_light\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Zodiacal_light\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOk here is an XKCD what if that talks about what would happen if everyone on the earth pointed a lazar pointer at the moon.  At the end of the article he takes it to ridiculous extreme and vaporizes the surface of the moon.\n\u003C/p\u003E\n\u003Cp\u003E\n     \u003Ca href=\u0022https://what-if.xkcd.com/13/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://what-if.xkcd.com/13/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n    \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-07-01T06:39:06Z","Content":"\n\u003Cp\u003E\nIf indeed take this assumption as given, that total energy of Sun radiation gets released at once (sounds reasonable for me), then:\n\u003C/p\u003E\n\u003Cp\u003E\nSay, 3.83*10\u003Csup\u003E26\u003C/sup\u003E W * 6*10\u003Csup\u003E9\u003C/sup\u003E yr * 365.2422 d/yr * 86400 s/d = 7.3*10\u003Csup\u003E43\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\nAt 1 AU from Sun energy density = 7.3*10\u003Csup\u003E43\u003C/sup\u003E / (4 * pi * (1.5*10\u003Csup\u003E11\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E) = 2.6*10\u003Csup\u003E20\u003C/sup\u003EJ/m\u003Csup\u003E2\u003C/sup\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nSo, Earth receives 2.6*10\u003Csup\u003E20\u003C/sup\u003E * pi * (6.37*10\u003Csup\u003E6\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E = 3.3*10\u003Csup\u003E34\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\nEnergy per mass = 3.3*10\u003Csup\u003E34\u003C/sup\u003E/6*10\u003Csup\u003E24\u003C/sup\u003E = 5.5*10\u003Csup\u003E9\u003C/sup\u003E J/kg.\n\u003C/p\u003E\n\u003Cp\u003E\nVaporization heat ~  several \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/k, i.e. negligible\n\u003C/p\u003E\n\u003Cp\u003E\nIf convert this into kinetic energy, this corresponds to speed ~= sqrt(5.5*10\u003Csup\u003E9\u003C/sup\u003E * 2) = 105 000 m/s = ~100 km/s,\n\u003C/p\u003E\n\u003Cp\u003E\nI.e. Earth would become a dissipating hot gas cloud, escaping from Solar System.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nSo, Jupiter receives 2.6*10\u003Csup\u003E20\u003C/sup\u003E * pi * (70*10\u003Csup\u003E6\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E / 5.2\u003Csup\u003E2\u003C/sup\u003E= 1.5*10\u003Csup\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E35\u003C/span\u003E\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\nEnergy per mass = 1.5*10\u003Csup\u003E35\u003C/sup\u003E/(318*6*10\u003Csup\u003E24\u003C/sup\u003E) = 80*10\u003Csup\u003E6\u003C/sup\u003E J/kg.\n\u003C/p\u003E\n\u003Cp\u003E\nVaporization heat is negligible\n\u003C/p\u003E\n\u003Cp\u003E\nIf convert this into kinetic energy, this corresponds to speed ~= sqrt(8*10\u003Csup\u003E7\u003C/sup\u003E * 2) ~= 13 km/s,\n\u003C/p\u003E\n\u003Cp\u003E\nI.e. Jupiter has survived, but has partially lost its upper atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-07-01T06:47:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408232\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530427146\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf indeed take this assumption as given, that total energy of Sun radiation gets released at once (sounds reasonable for me), then:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E Say, 3.83*10\u003Csup\u003E26\u003C/sup\u003E W * 6*10\u003Csup\u003E9\u003C/sup\u003E yr * 365.2422 d/yr * 86400 s/d = 7.3*10\u003Csup\u003E43\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E At 1 AU from Sun energy density = 7.3*10\u003Csup\u003E43\u003C/sup\u003E / (4 * pi * (1.5*10\u003Csup\u003E11\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E) = 2.6*10\u003Csup\u003E20\u003C/sup\u003EJ/m\u003Csup\u003E2\u003C/sup\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E ***\n\u003C/p\u003E\n\u003Cp\u003E\nSo, Earth receives 2.6*10\u003Csup\u003E20\u003C/sup\u003E * pi * (6.37*10\u003Csup\u003E6\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E = 3.3*10\u003Csup\u003E34\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\nEnergy per mass = 3.3*10\u003Csup\u003E34\u003C/sup\u003E/6*10\u003Csup\u003E24\u003C/sup\u003E = 5.5*10\u003Csup\u003E9\u003C/sup\u003E J/kg.\n\u003C/p\u003E\n\u003Cp\u003E\nVaporization heat ~  several \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/k, i.e. negligible\n\u003C/p\u003E\n\u003Cp\u003E\nIf convert this into kinetic energy, this corresponds to speed ~= sqrt(5.5*10\u003Csup\u003E9\u003C/sup\u003E * 2) = 105 000 m/s = ~100 km/s,\n\u003C/p\u003E\n\u003Cp\u003E\nI.e. Earth would become a dissipating hot gas cloud, escaping from Solar System.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nSo, Jupiter receives 2.6*10\u003Csup\u003E20\u003C/sup\u003E * pi * (70*10\u003Csup\u003E6\u003C/sup\u003E)\u003Csup\u003E2\u003C/sup\u003E / 5.2\u003Csup\u003E2\u003C/sup\u003E= 1.5*10\u003Csup\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E35\u003C/span\u003E\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp\u003E\nEnergy per mass = 1.5*10\u003Csup\u003E35\u003C/sup\u003E/(318*6*10\u003Csup\u003E24\u003C/sup\u003E) = 80*10\u003Csup\u003E6\u003C/sup\u003E J/kg.\n\u003C/p\u003E\n\u003Cp\u003E\nVaporization heat is negligible\n\u003C/p\u003E\n\u003Cp\u003E\nIf convert this into kinetic energy, this corresponds to speed ~= sqrt(8*10\u003Csup\u003E7\u003C/sup\u003E * 2) ~= 13 km/s,\n\u003C/p\u003E\n\u003Cp\u003E\nI.e. Jupiter has survived, but has partially lost its upper atmosphere.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHoly... wow.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd what about Neptune? Could somebody living on (or inside) a moon of Neptune survive? If not, how far out would somebody have to go to survive either in the open or living underground inside an asteroid, moon, or dwarf planet?\n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-07-01T06:48:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408175\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530413070\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u003Cspan\u003E﻿\u003C/span\u003E I\u0027d kinda like to know, however, is how much damage\u003Cspan\u003E﻿\u003C/span\u003E could such a process do. Aside from the freezing, the comes after the collapse, the process itself would cause the collapsing star to brighten exponentially, and cook everything within range. But what is that range? Which planets would survive, which wouldn\u0027t, and what would the effects \u003Cspan\u003E﻿\u003C/span\u003Eon them be? Blown-away atmospheres? Melted crust? Vaporize\u003Cspan\u003E﻿\u003C/span\u003Ed?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe humans evolved on, and (so far) all grew up on, Earth. We instinctively expect the air to be breatheable, the temperature to be liveable, the gravity to be 9.8 m/s2, the days to last 24 hours, trees and grass, animals and plants and fungi, et cetera, et cetera.\n\u003C/p\u003E\n\u003Cp\u003E\nThe sad fact is, though, that no other planet we\u0027ve detected thus far is even remotely habitable by human standards. The bigger ones are Jupiter-like balls of gas, while the smaller ones are almost universally airless balls of rocks or balls of ice. The few worlds we\u0027ve found that do have both an atmosphere and a solid surface have been blanketed in gases that no human can breathe, at pressures anywhere from near-vacuum to 90 times Earth\u0027s sea level. While it\u0027s theoretically possible that a planet out there might harbor life as we know it, it would have to fit a long, narrow list of parameters, and even then, the kind of life that might have actually evolved there will most likely be very different from the multicellular-eukaryote-rich biome inhabiting Mother Terra.\n\u003C/p\u003E\n\u003Cp\u003E\nIn order for a planet to be able to support life as we know it on its surface at all, it will have to lie in a very narrow range of distances from its parent star. Too close, and any water would evaporate. Too far, and any water would freeze. Liquid water — and life as we know it requires liquid water — can only exist if the planet lies within that narrow zone where it\u0027s receiving just the right amount of energy from its star for the surface temperature to allow it. This is called the star\u0027s \u0022comfort zone,\u0022 or \u0022Goldilocks Zone\u0022 (as in: not too close, not too far, but juuuuuuuust right). The exact width of a star\u0027s Golilocks zone is a matter of some debate, due to the fact that some atmospheres can trap heat (Venus) and some can\u0027t, and a number of other factors that astrogeologists can make whole careers out of. All we can say for sure is that, for a star as bright and hot as the sun, Venus is too close, Earth is clearly within the Goldilocks zone, and Mars is probably close to the tail end of it.\n\u003C/p\u003E\n\u003Cp\u003E\nHow far away from the star the Goldilocks zone is depends on the star\u0027s energy output. A very dim red dwarf star, like Wolf 359, would require a planet to be only about 1.5 million kilometers away from it to receive as much energy as Earth does from our sun — that\u0027s only 0.01 A.U., 1% of the Earth-sun distance. A bright and powerful star like Sirius A, on the other hand, would require a planet to be 5 A.U. away from it to receive as much energy as the Earth does from the sun.\n\u003C/p\u003E\n\u003Cp\u003E\nInterestingly, both of those distances have potentially disastrous consequences. If a planet is only 0.01 A.U. away from its star, the star\u0027s tidal influence is going to be enormous. The strength of tidal forces varies directly with the larger object\u0027s (i.e. the star\u0027s) mass, but inversely with distance cubed. The tidal forces on a planet only 0.01 A.U. from a star 1/10 the mass of the sun are, therefore, going to be 0.1 / 0.013 = 100,000 times as strong as the tidal forces the Earth experiences from the sun. This all but guarantees that the planet will be locked in synchronous rotation with its star — that is, its rotational period must match its orbital period, so the same side is always facing the star. One side of such a planet would be in perpetual daylight, while the other would be in perpetual night. The climate on such a world would be much different than the climate on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nDim stars also have the disadvantage that their Goldilocks Zones are going to be narrower. There is disagreement as to exactly how wide the Goldilocks Zone around the sun is — different models compute widths anywhere from 0.5 A.U. down to 0.02 A.U. — but however wide the zone actually is, it will be proportionally narrower with a dimmer star (and wider with a brighter star). The star 61 Cygni is about 1/10 of the sun\u0027s brightness, so its Goldilocks Zone will be (the square root of 1/10) of the sun\u0027s, or a little less than 1/3 of the sun\u0027s Goldilocks Zone distance. But this means both the inner edge and the outeredge of the Goldilocks Zone will be 1/3 of the distance compared with the sun — and that means the zone as a whole will only be 1/3 as wide. The narrower the Goldilocks Zone, the less a chance that a planet would happen to have formed within it.\n\u003C/p\u003E\n\u003Cp\u003E\nWorse, many red dwarf stars — Wolf 359 included — are flare stars, which emit semi-regular bursts of X-rays every bit as powerful as those emitted from a flare taking place on the sun. At 0.01 A.U., that much ionizing radiation can easily disassemble the organic molecules necessary for life. And X-rays can scatter. Regular flare outbursts so close by probably means that any life would have to be buried underground.\n\u003C/p\u003E\n\u003Cp\u003E\nA planet orbiting Sirius A at 5 A.U. wouldn\u0027t have any of these problems, of course, but it runs into another issue. Sirius is a binary system. Sirius B (a white dwarf) makes one complete orbit around Sirius A every half century, and at one point in this orbit the two stars come within 8 A.U. of each other. As any budding astrophysicist will tell you, the three-body problem is a chaotic one for which there is no solution. Any planet orbiting Sirius A farther away than 1/4 of this 8 A.U. closest-approach distance will be thrown out of the star system by Sirius B\u0027s gravity. The farthest a stable planetary orbit can be from Sirius A is, therefore, only 2 A.U. — which is barely 2/5 of the Goldilocks Zone distance. Therefore, no planet can exist in the habitable, liquid water zone around Sirius A. (A planet could theoretically orbit both Sirius A and Sirius B as a pair, but then its minimum orbital distance has to be at least four times the greatest separation distance between the two stars in their orbit of each other. Sirius B\u0027s orbit is rather eccentric, and at one point in its orbit it\u0027s over 30 A.U. away from Sirius A. A planet orbiting both Sirius A and B would therefore need to be at least 120 A.U. away from their common center of mass, and at that distance the combined brightness of Sirius A and Sirius B would be far too weak to keep the planet from freezing.)\n\u003C/p\u003E\n\u003Cp\u003E\nEven if a planet happens to lie within the Goldilocks Zone, that\u0027s no guarantee that it can harbor surface life — let alone that life will actually arise there on its own, or that said life will have had sufficient time to evolve to the point where space-faring beings can emerge. The atmospheric pressure must be high enough for liquid water to exist, and that can\u0027t happen unless the planet has sufficiently strong surface gravity to keep its atmosphere from escaping into space. \u003Cspan style=\u0022line-height:1.6;\u0022\u003EYou\u0027ll note that the Martian atmosphere is extremely thin, less than 1% of the surface pressure of Earth\u0027s atmosphere. One factor that contibutes to Mars\u0027s thin atmosphere is this low surface gravity. Despite being farther from the sun than the Earth, and thus receiving less heat that could potentially boil its atmosphere away into space, Mars still has less of an atmosphere than the Earth does. A resonably strong surface gravity may be required for a planet to retain a thick atmosphere. There are exceptions in our own solar system, of course: Saturn\u0027s moon Titan has less than a sixth of Earth\u0027s surface gravity yet its surface atmospheric pressure is higher than Earth\u0027s, and while Venus is both closer to the sun and has only 90% of Earth\u0027s surface gravity its surface pressure is ninety times that of Earth\u0027s atmosphere. But you need at least some gravity, and possibly quite a lot of gravity, to retain an atmosphere within the Goldilocks Zone.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnother factor that can mean no life-bearing planets are possible in a given star system is the lack of heavy elements. The Milky Way galaxy is over ten billion years old. When it first formed, it consisted almost entirely of hydrogen and helium; almost no heavier elements (like carbon and the other elements necessary for organic life) existed. Several generations of stars have been born and died since then, and some of the more spectacular star deaths have peppered the interstellar medium with heavy elements synthesized by those stars\u0027 death throes. The sun, for instance, is a third-generation star — the cloud of gas and dust out of which it formed contained material expelled by a supernova which, in turn, had formed out of an earlier cloud that contained material from an even earlier supernova. This is why there was enough carbon, oxygen, silicon, iron, etc. to form solid, rocky planets and organic molecules. Astrophysicists refer to all elements heavier than helium as \u0022metals\u0022 (even if the element in question is oxygen or neon), and sometimes call a star system\u0027s heavy element abundance its \u0022metallicity.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBy contrast, Barnard\u0027s Star (a red dwarf approximately 6 light-years from the sun) formed in the Milky Way\u0027s first wave of star formation. It has almost no heavy elements. If the star itself is metal-poor, that means the cloud out of which it formed was also metal-poor, and therefore any planets that would have formed out of that cloud would be metal-poor as well. There might be some Jupiter-like balls of hydrogen or helium orbiting Barnard\u0027s Star, but there isn\u0027t going to be anything with a solid surface. \u003Cspan style=\u0022line-height:1.6;\u0022\u003ESo, to sum up, the requirements for a habitable Earth-like planet are:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1. The planet must lie within the Goldilocks Zone for its star.\n\u003C/p\u003E\n\u003Cp\u003E\n2. The star cannot be too dim, since this will mean its Goldilocks Zone will be too narrow, any planet in the zone will be in synchronous rotation with the star, and the Goldilocks Zone will lie within the Danger Zone for stellar flares.\n\u003C/p\u003E\n\u003Cp\u003E\n3. If a binary star system, the companion star cannot come closer to the primary than 4 times the Goldilocks Zone distance.\n\u003C/p\u003E\n\u003Cp\u003E\n4. The star system cannot be metal-poor, or (if its metallicity isn\u0027t known) so old that it would have formed when the galactic medium was still metal-poor.\n\u003C/p\u003E\n\u003Cp\u003E\n5. The planet cannot be too small or light, as this will prevent it from retaining an atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that if you\u0027re willing to accept non Earth-like planets, many more possibilities open up. For example, Europa, one of Jupiter\u0027s moons, is thought to contain liquid water despite being nowhere near the Goldilocks zone. A thick or rapidly rotating atmosphere like Venus\u0027s can distribute heat evenly around the planet, thus solving the problem with tidal locking mentioned above. Greenhouse effect atmospheres, tidal heating from a nearby planet, and internal heating from other unknown mechanisms can all lead to potentially habitable conditions in unexpected places. However, these all lead to new problems and obviously won\u0027t resemble Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nFor that matter, even liquid water might not be necessary. There are theories that life might be possible with alternate biochemistries based on liquid ammonia, methane, or even interstellar gases. Since all we have to go on is observations of Earth, there\u0027s no way to tell for sure if this is actually possible. But the less Earthlike you get, the more problems you have with an actual story involving anything other than Aliens. A hypothetical ammonia based organism, for instance, would constantly argue over the thermostat with Earthlings given that ammonia boils at -28F. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want anything more interesting than bacteria to have evolved, another problem arises. The star must have been shining at roughly the same energy output for at least a couple billion years, in order to give time for complex life to have evolved.\n\u003C/p\u003E\n\u003Cp\u003E\nThis last requirement is a real buzzkill, as it eliminates damn near every bright star you can see in Earth\u0027s night sky. Big, bright stars like Sirius A only live for a few hundred million years before they run out of gas. (The candle that burns twice as bright lasts half as long, after all.) Red giant stars like Arcturus had a long, stable lifetime as a dimmer star in the past, but will only last for a couple of million years at the red giant stage — so if they did harbor life bearing planets in the past, those ecosystems were snuffed out when the star expanded to its current red giant state, and any planets in the star\u0027s newGoldilocks Zone won\u0027t have long enough for evolution to run its course.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for our Sun, its core will run outta gas some 5 billion years from now, in the meanwhile, its luminosity will increase slowly as its core contracts to continue fusing the each time more and more scarce hydrogen. That will mean serious trouble for life on Earth in just around six hundred million years from now onwards. When this happens, the sun will inflate a lot. \u0022But wait!\u0022 I hear you cry. \u0022If the core is no longer providing any radiative pressure to support the sun\u0027s upper layers, why will it expand instead of shrinking under its own weight?\u0022 I\u0027m glad you asked. When the core fizzles, the layer immediately above the core will collapse down upon it, and in the process this layer will get more and more compressed until it ignites in nuclear fusion itself, forming a hydrogen-burning shell. and consume at least some of the inner planets—likely including Earth, causing a solar system level apocalypse. Even if Earth survived, its fate would be to lose whatever water remains and atmosphere, becoming a planet covered by a magma ocean under the intense light of the huge red giant Sun. This inflation will take a time in astronomical terms and will be very gradual by human-lifetime standards: computer models of evolution of Sun-like stars suggest the sun will need more than 2 billion years to grow from its end-of-main-sequence normal size to its full red-giant glory. Delta Pavonis, a star extremely similar and very close—about 20 ly—to the Sun is currently going through this phase. It started the process during the time that modern humans have existed—possibly even during recorded history—but only our descendants to the umpteenth generation will get to see the transformation in full. Astronomers have a mild interest in this star, since being the Sun\u0027s \u0022near-identical older brother\u0022—as we put it—its evolution will give hints about what\u0027s to come for old Sol. After a couple of million of years in this red giant phase, it will shrink again in just a few thousand years as its core begins fusing helium into carbon and oxygen. Helium ignition is a very violent process, liberating energies comparable to that of a supernova. However, all of that energy is used to re-expand the core and nothing unusual is visible from the outside. The Sun will be then a red clump star, roughly fifty times as luminous as is now and eleven times larger, re-expand again as red giant (as an Asymptotic giant branch, to be more exact) when it runs out of helium at its core 100 million years later, and then finally shed its outer layers in a breathtaking display known as a \u0022planetary nebula.\u0022 So named because such nebulas appear as an extensive disc in a telescope, and can be confused for a planet by an observer who doesn\u0027t know any better. What will remain afterward is the tiny, exposed core of the sun, now shrunk to a super-dense white dwarf the size of the Earth, slowly cooling to a black dwarf over the next quadrillion years (more than 70 times the current age of the universe). More than a few astronomers and physicists have pointed out that at least by this point, the Sun will be harboring one big-ass diamond. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMy prediction is, as the sun expands, the goldilocks zone would be pushed outward, roughly around the orbit of Saturn or Uranus, which could, theoretically make Titan habitable. Mercury and Venus is certainly being totally engulfed. As for gas giants, while the sun\u0027s size expands into red giant, it\u0027s temperature also become lower, so I cannot say for certain if the gas giants will be fully vaporized, but one thing is certain: gas giants WILL change. \u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003EOne of the theory why gas giants is so large is, since outer planets that\u0027s classified as gas giants lies on the outside of goldilocks zone, which is referred as \u0022ice line\u0022. Water and other liquid froze, which causes them to expand in volume, so the planet-building material becomes larger, since it provides more material. So it\u0027s only a matter of guessing what\u0027s gonna happen to the gas giants if the \u0022ice line\u0022 is pushed outward further. But I think \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129408-kerbiloid/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129408\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129408-kerbiloid/\u0022 rel=\u0022\u0022\u003E@kerbiloid\u003C/a\u003E is right, Jupiter is most likely survived, albeit not like what it\u0027s used to be.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-07-01T09:56:43Z","Content":"\n\u003Cp\u003E\nWell, as stuff gets squished together, fusion happrns more quickly, so  i would say thatthe Suns size remains the same after a bit of squishing.\n\u003C/p\u003E\n\u003Cp\u003E\nThe end point of fusions is iron, so i would imagine a lot of iron in the Sun.\n\u003C/p\u003E\n\u003Cp\u003E\nThen, a supernova explosion, just smaller scale. Presumably blowing away half the solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nThen a neutron star, then a black hole.\n\u003C/p\u003E\n\u003Cp\u003E\nI am just a kid, so these are not accurate.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2018-07-01T11:22:15Z","Content":"\n\u003Cp\u003E\nWhatever your process is, it must continue to work until the Sun\u0027s radius is only 3 km or even smaller.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Sun will get more and more brighter until it becomes insanely incredulously *bright* (mind the parenthesis) just before it\u0027s mass entered it\u0027s own scwarzschild radius.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I guess not only the planets going to be \u0022dead\u0022 because sunlight is no longer there, but the flash before it\u0027s demise will scour the face of every bodies in the Solar System.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming the total lumimosity doesn\u0027t change, the last moment of Sunlight will occur with most of the peak wavelength at γ-ray wavelength, as the surface temperature will reach what today is Sun\u0027s core temperature (~ 15 milion K/deg C - doesn\u0027t matter this high up). Oddly enough this means the Sun will look \u0022black\u0022 to the eye but it\u0027s been bombarding us with X-rays and γ-rays for some tens of minutes (wien law gives the max wavelength at 1 Å - for comparison blue light is 4000 Å).\n\u003C/p\u003E\n\u003Cp\u003E\nBut solar photon takes insane amount of time just to reach the surface, thanks to a phenomenon known as \u0022random walk\u0022 and mean free path. So in the 1 hour collapse, it\u0027ll free up to hundreds of thousands or even millions of years of solar energy.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming the mean free path means that it takes about 100,000 years for photons in the core to reach the surface, and assuming a constant radiation rate, the sun luminosity will reach 870 million times it\u0027s current lumimosity in the given hour. This gives an initial surface temperature of 1 million K... and an end temperature of \u003Cem\u003E2.5 \u003Cu\u003Ebillion\u003C/u\u003E K\u003C/em\u003E. (at least it\u0027s not Planck temperature !)\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, that is all bad news. In UV, X-ray and γ-ray.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-01T11:23:28Z\u0022 title=\u002207/01/2018 11:23  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 1, 2018\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-07-01T12:47:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408236\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530427673\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd what about Neptune? Could somebody living on (or inside) a moon of Neptune survive? If not, how far out would somebody have to go to survive either in the open or living underground inside an asteroid, moon, or dwarf planet?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell... even at Neptune, the flux is still on the scale of a thermonuclear warhead at point blank range... detonating continuously for an hour. Nothing can survive anywhere the light touches. Exposed regolith would probably heat to incandescence and fuse, but would probably not vaporize.\u003Cbr\u003E\n You *might* be able to survive for a time if you\u0027re far enough underground, but I don\u0027t know how you\u0027d survive in the long term.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-07-01T12:53:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408236\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530427673\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd what about Neptune? Could somebody living on (or inside) a moon of Neptune survive? If not, how far out would somebody have to go to survive either in the open or living underground inside an asteroid, moon, or dwarf planet?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(With the same assumption about the total energy).\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nNeptune receives 2.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E20\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003E* pi * (24.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E)\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E / 30.07\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E= 5.5*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E32\u003C/span\u003E\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nEnergy per mass = 5.5*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E32\u003C/sup\u003E/(17.2*6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E24\u003C/sup\u003E) = 5.3*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003EJ/kg.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nVaporization heat is negligible\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EIf convert this into kinetic energy, this corresponds to speed ~= sqrt(5.3*10\u003C/span\u003E\u003Csup\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E6\u003C/span\u003E\u003C/sup\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E \u003C/span\u003E* 2) ~= 3.2 km/s,\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nSo, Neptune lost some part of the upper atmosphere.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n***\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nTriton receives 2.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E20\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003E* pi * (1.35*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E)\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E / 30.07\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E= 1.7*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E30\u003C/span\u003E\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nEnergy per mass = 1.7*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E30\u003C/sup\u003E/2*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E22\u003C/sup\u003E = 85*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003EJ/kg.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nVaporization heat is ~3 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg, negligible.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EIf convert this into kinetic energy, this corresponds to speed ~= sqrt(85*10\u003C/span\u003E\u003Csup\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E6\u003C/span\u003E\u003C/sup\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E \u003C/span\u003E* 2) ~= 13 km/s,\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nTriton turns into a thick ring around the Neptune, with random icebergs inside,\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n***\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nPluto receives 2.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E20\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003E* pi * (1.2*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E)\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E / 39.4\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E2\u003C/sup\u003E= 7.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E29\u003C/span\u003E\u003C/sup\u003E J.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nEnergy per mass = 7.6*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E29\u003C/sup\u003E/1.3*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E22\u003C/sup\u003E = 58*10\u003Csup style=\u0022font-size:10.5px;vertical-align:baseline;\u0022\u003E6\u003C/sup\u003E\u003Cspan\u003E \u003C/span\u003EJ/kg.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nVaporization heat is ~3 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E/kg, negligible.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EIf convert this into kinetic energy, this corresponds to speed ~= sqrt(58*10\u003C/span\u003E\u003Csup\u003E\u003Cspan style=\u0022font-size:10.5px;\u0022\u003E6\u003C/span\u003E\u003C/sup\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E \u003C/span\u003E* 2) ~= 11 km/s,\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nPluto\u0026amp;Charon become a cloud of ice and rocks.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\n***\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nBut happily, there is Jupiter. It\u0027s just 10 times smaller than Sun (70 000 km vs 700 000 km radius).\u003Cbr\u003E\nSo, it shades up to 70/700*5.2 = 0.5 AU beyond its orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nAnd also there is Saturn.\u003Cbr\u003E\nIt shades to 58/700*9.6 = 0.8 AU beyond its orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nAlso Neptune makes a shade 24.6/700*30.07 = 1 AU deep.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nAnd fortunately, the last phase of the Sun collapse was running very fast, and most part of this energy had been released in an hour or two,\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nSo, once the Sun imploded, a little but brave Kuiperoid (or maybe that was even Pluto itself), was passing right behind the Neptune, in its shadow, \u003Cbr\u003E\nEverybody who was on that lurking planet saw a blinding crown of flames around Neptune \u003Cs\u003Eand lost eyes\u003C/s\u003E  \u003Cs\u003Eand burnt wallpapers right throw the back of the head if were watching in telescope\u003C/s\u003E and said wow.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nNeptune had eclipsed the planetoid, so it survived.\u003Cbr\u003E\nBut gaseous clouds from vaporized icy moons, trojans, comets, whatever on its way have changed its orbit, sending it to pass by the former Sun.\u003Cbr\u003E\nAlso its own ice was partially evaporated days earlier before it entered the shadow. This was like a reactvie jet. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nBut a little closer that gaseous chaos made its orbit more round, though inclined (they can from time to time look at Solar System from above, what a happy coincidence!) and eccentric (they can withstand both heat and cold when its needed).\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nSomebody says, that Triton survived, too, by the same reason. But it\u0027s currently surrounded by a dense cloud ring of fluids evaporated from Neptune, so that\u0027s just rumors.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);\u0022\u003E\nAnother luck was that the former Sun is surrounded by gas-dust cloud of planet and crown remains, which is highlighted with X-rays from inside and shines in IR and even a little visible light.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-01T13:00:41Z\u0022 title=\u002207/01/2018 01:00  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 1, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-07-01T12:57:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408208\u0022 data-ipsquote-contentid=\u0022176286\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530420618\u0022 data-ipsquote-userid=\u002267603\u0022 data-ipsquote-username=\u0022vger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, vger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs the \u0022force\u0022 going to keep the star compressed after it reaches singularity size,  or does it terminate at that point? Considering that the sun\u0027s mass isn\u0027t actually being increased, would it be a stable black hole even if you could somehow do this? Seems like turning off the force would just cause the star to immediately go supernova.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nvger,\n\u003C/p\u003E\n\u003Cp\u003E\n Once the sun\u0027s mass is compressed inside a radius of 3km or so, it\u0027s immaterial whether the force stops or not; the effect is the same. It becomes impossible for any particle or photon to escape; every direction is inward.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"}]}