{"TopicId":176316,"ForumId":18,"TopicTitle":"KSP Stock War - Kerbin Kollapse","CreatedByName":"TheNordicToast","CreatedById":190097,"CreatedDateTime":"2018-07-01T20:04:56Z","PageNum":1,"Articles":[{"CreatedByName":"TheNordicToast","CreatedById":190097,"CreatedDateTime":"2018-07-01T20:04:56Z","Content":"\n\u003Cp\u003E\nKerbin Kollapse is our attempt at starting a stock multiplayer war in KSP. We\u0027re using a discord server to organize the war and keep track of everything. The link for the discord is down below for those who don\u0027t need more info and want to jump right in.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin Kollapse isn\u0027t entirely stock. It has to take in use a few mods to make it work. The most important of these are LunaMultiplayer and vesselmover. There\u0027s no part mods or anything that makes the weaponry and such easier to make. All the vehicles need to be made fully functional in stock version of KSP. It might be hard, but the challenge is the entire point of it.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can choose from a small number of nations. Each one has borders that can only be expanded by taking land from others. You will need to play tactically. This is not like those small dogfights and such we have right outside the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E. It will happen all around Kerbin. (Note that this war will not have space combat. Inside atmosphere only.)\n\u003C/p\u003E\n\u003Cp\u003E\nYou can ally with other nations and form alliances if you want, but you have to talk with the rest of the players in your nation/team before allying someone.\u003Cbr\u003E\nYour can also do trading with other nations. And example would be exchanging a tank design for ore (ore is the resource required to spawn in crafts).\n\u003C/p\u003E\n\u003Cp\u003E\nWe are not very strict here and will help you with anything you need. Can\u0027t make a good autoloader, gun, or warhead? Need better tracks, engine or turret mechanisms? Ask for ideas. Don\u0027t be scared off. The game is complicated, but you\u0027ll understandt it quickly. We\u0027ll explain any questions you might have. Minor details can be found in the discord server.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin Kollapse is still w.i.p. By the time of this post we still have no LMP server up running, but we\u0027re working on it. Kerbin Kollapse is not flawless. There\u0027s still some stuff to be done.\n\u003C/p\u003E\n\u003Cp\u003E\nDiscord link: \u003Ca href=\u0022https://discord.gg/tAFcTrd\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://discord.gg/tAFcTrd\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- TheNordicToast\u003Cbr\u003E\n- General Incompetence \n\u003C/p\u003E\n"},{"CreatedByName":"KerbalsAreKute","CreatedById":190741,"CreatedDateTime":"2018-07-24T20:39:20Z","Content":"\n\u003Cp\u003E\nHow do i do LunaMultiplayer?\n\u003C/p\u003E\n\u003Cp\u003E\nDo i install it like regular mods?\n\u003C/p\u003E\n\u003Cp\u003E\nOr is it complex?\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2018-07-26T19:51:18Z","Content":"\n\u003Cp\u003E\nluna is pretty straight forward, install the client like any other mod. the server looks like its stand alone executable. \n\u003C/p\u003E\n"}]}