{"TopicId":176585,"ForumId":20,"TopicTitle":"Recommendations for a Vanilla-flavored KSP","CreatedByName":"DunnoAnyThing","CreatedById":180004,"CreatedDateTime":"2018-07-09T11:17:31Z","PageNum":1,"Articles":[{"CreatedByName":"DunnoAnyThing","CreatedById":180004,"CreatedDateTime":"2018-07-09T11:17:31Z","Content":"\n\u003Cp\u003E\nHi to all the modders and mod-users!\u003Cbr\u003E\nRecently me and my friend had a talk on what mods to include in our mod packs(really just a .7z of mods) that we share.\u003Cbr\u003E\nThis time, we had a discussion on what would be in a \u0022Vanilla-flavored\u0022 modpack.\u003Cbr\u003E\nHere, we used the word Vanilla-flavored as following the rules below:\u003Cbr\u003E\n1. does not make something that is impossible (even in theory) in stock be possible\u003Cbr\u003E\n2. does not add/modify any parts(so leaving out \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E and \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E but can include \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u0026amp;\u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E for all)\u003Cbr\u003E\n3. does not change game mechanisms that cannot be achieved through setting changes and gameplay.\u003Cbr\u003E\n4. assistance mods are allowed, such as showing information/doing automated procedures that can (in theory) be done in stock(just like what TASbots can do, only without breaking the game:) )\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, all visual mods can be included, but there still are several mods that apply to these rules, such as AtmosphericAutopilot, [x] science and DockingPortAlignmentIndicator(theoretically can be done by eyeballing...theoretically.).\n\u003C/p\u003E\n\u003Cp\u003E\nUnable to come up with the best set of mods, I decided that I\u0027d ask the Community for help!\u003Cbr\u003E\u003Cbr\u003E\nTo sum up, what would you put in(\u003Cspan style=\u0022color:#bdc3c7;\u0022\u003E\u003Cs\u003Enot Putin\u003C/s\u003E\u003C/span\u003E!) a \u0022Vanilla-flavor modpack\u0022?\u003Cbr\u003E\u003Cbr\u003E\nP.S. if the above article seems to be misleading/hard to understand, I may edit the rules/sentences. Just sayin\u0027 .\n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2018-07-09T20:16:09Z","Content":"\n\u003Cp\u003E\nInteresting proposition \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180004-dunnoanything/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022180004\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180004-dunnoanything/\u0022 rel=\u0022\u0022\u003E@DunnoAnyThing\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nMy own rule operates along the same lines to utilise part packs but only for looks... I do use IFI LifeSupport or Kerbalism but I \u003Cstrong\u003Edon\u0027t use engines from mod packs\u003C/strong\u003E.  I think that is the biggest part of \u0027keepin\u0027 it stock-a-like\u0027 or vanilla flavoured.\n\u003C/p\u003E\n\u003Cp\u003E\nI also use mods that change the stock part looks like colour coded canisters, vens or sspx, but I mod their mm patches when they adjust stock values to keep values stock.\n\u003C/p\u003E\n\u003Cp\u003E\nI also play with kOS and \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E available partless and available for all, and often allow action groups at whatever level the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is.  kOS is to automate launches but I take over once in vacuum setting encounters and burning nodes.  I figure if I have to compose the programme then it isn\u0027t SO cheaty :).\n\u003C/p\u003E\n\u003Cp\u003E\nI also play at 120% retry heating and 100% funds/penalty but 50% science and rep.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso KEI which gives all science from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E biomes probably the only thing that breaks the guidelines you have set.  Oh and also Transfer Window Planner and Kerbal Alarm Clock.\n\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n"}]}