{"TopicId":177425,"ForumId":46,"TopicTitle":"What were the \u0026quot;Rocket Builders\u0026quot;?","CreatedByName":"HansonKerman","CreatedById":185809,"CreatedDateTime":"2018-08-08T22:54:44Z","PageNum":1,"Articles":[{"CreatedByName":"HansonKerman","CreatedById":185809,"CreatedDateTime":"2018-08-08T22:54:44Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/139256-mad-rocket-scientist/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022139256\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/139256-mad-rocket-scientist/\u0022 rel=\u0022\u0022\u003E@Mad Rocket Scientist\u003C/a\u003E \u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003Eshould \u003C/span\u003E\u003Cfont face=\u0022Lucida Sans Unicode, Lucida Grande, sans-serif\u0022\u003Eknow.\u003C/font\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-09T00:42:51Z","Content":"\n\u003Cp\u003E\nBefore the november 2015 forum update, there was a subforum in the spacecraft exchange called the rocket builders. To quote \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/26298-ted/\u0026amp;do=hovercard\u0022 data-mentionid=\u002226298\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/26298-ted/\u0022 rel=\u0022\u0022\u003E@Ted\u003C/a\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022This is a Forum for all your Rocket/Craft Building needs. \u003Cbr\u003E\nEssentially, if you, or a group of people, are churning out rockets under a single name post them here. Additionally, if you need a rocket built for you, simply post in one of the existing threads asking the \u0027Company\u0027 to design and build you a rocket/craft.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you made many craft they could be shown there under one banner, or you could work as a group. Also, you could make requests to have craft built by the \u0022companies\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I believe it was started before rules against role-playing were instituted on the forums, and so it was removed from public view entirely during the forum update (the moderators likely have a copy of it). Strictly speaking, the entire concept was based around roleplaying, however many people were upset by the decision to remove it, especially since some of the older threads were entirely wiped because (unlike active threads) the OPs were not active during the grace period to copy their threads over. I believe there were some actual examples of rule-breaking happening in some of the older threads too, and the rule against roleplay makes sense, but many of the threads were simply showcases and requests, although that was allowed to continue in the spacecraft exchange, minus the roleplay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/23840-zekes/\u0026amp;do=hovercard\u0022 data-mentionid=\u002223840\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/23840-zekes/\u0022 rel=\u0022\u0022\u003E@zekes\u003C/a\u003E said this about it, which I think is pretty much what everyone thought:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well this is a large blow to me and I\u0027m going to try to come up with some two cents to say about it, if I end up just blowing hot air in circles feel free to ignore me.\u003Cbr\u003E\u003Cbr\u003E\nThe Rocket Builders have been dying. It\u0027s gone on for the past year, and I\u0027ve been discussing it with a lot of other people. It was a great fun place a few years ago, but now it\u0027s hollow, the companies mean nothing anymore, there are no engineers working for them, and partnerships don\u0027t have a meaning (if they ever did at all, it\u0027s been lost on me). \u003Cbr\u003E\u003Cbr\u003E\nNevertheless, I feel a certain nostalgia to the place that really is tied to KSP. I started on the forums because of SSL and Giggleplex, and their companies. My own company was based off of SSL, and For the past 3 years it\u0027s been where I hang out and enjoy KSP the most. Now, granted it\u0027s had it\u0027s ups and downs and I am partially responsible for a lot of the downs, but for better or for worse it was a part of me, of KSP. Just deleting the Rocket Builders will tear out three years of my life, three years of KSP conversations, of working to build up a community, of the past glory days of massive craft releases and conversations between builders. Getting rid of the Rocket Builders means things that i have worked on, names that I built will be lost. I\u0027m quite sure most of you have at least heard of Zokesia Skunkworks through the years. But now that\u0027s *POOF* gone. Three years of legacy just deleted. \u003Cbr\u003E\u003Cbr\u003E\nHow can I go on playing KSP knowing that most of the things I\u0027ve built, most of the things I\u0027ve spent my time in will be gone? I have put in hours and hours of work into running and managing my Rocket Builder Company, and I imagine the moderators see us as nothing but an annoying subforum, but Please at least understand we put so much time into what we built. So much time and memories will be gone if you just delete our forum. I say \u0022our\u0022 forum because I really never felt part of the rest of the KSP forum - i\u0027m not a modder, I\u0027m not a craft competetor, I\u0027m not a troubleshooter, I\u0027m not a greeter or game player. Or at least that doesn\u0027t mean as much to me as the RB forum does. \u003Cbr\u003E\u003Cbr\u003E\nSo if you\u0027re going to delete it, remember how much love, time, and effort some of us have put into it. Remember that without my company there is little reason to play KSP apart from the occasional craft release. I\u0027m just sorry after all these years our forum\u0027s only achievement is being a nuisance to the rest of the forum and that we\u0027re not fit to continue on existing, or ever having a record of existing, in the future of the community.\u003Cbr\u003E\u003Cbr\u003E\nRespectfully,\u003Cbr\u003E\u003Cbr\u003E\nZekes, CEO and Founder of Zokesia Skunkworks.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI was not as badly affected, as I had joined much more recently, and never did very much collaborative building.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried to backup the entirety of the subforum (there were only 25 pages) to the internet archive, but with only 7 days between the announcement and the wipe, I was only able to archive some of the larger threads.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter that, some of the people (like myself) moved their threads to the spacecraft exchange, but since it used to be more busy, they would only be visible when a new craft was released, and served just as showcases. Which, in many ways, was fine, but it was never the same. Personally, I mostly made replicas of real world or fictional vehicles, so it worked fine. \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, even later I and many of the serious replica builders began to drift away from the forums, or at least from replica building. I got burned out on KSP, and that, combined with college, meant that I stopped looking at the forums for a while. Even now I only have time for this tanks for summer break, and once school starts in a few days I\u0027ll be less active here. I think many others have had similar experiences.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short, it is a forgone conclusion that all forums will die, and the KSP forum is no exception. At the time of the removal, the rocket builders, as a smaller part of the forums, was already dying. While that meant that objectively, it impacted the forums as a whole less than if it was very active, it still felt like it was being killed instead of being left to die in peace. And I cannot complain about rules against roleplaying, since it is almost impossible to moderate it, I and many others were sad over the loss of what was, even if it was already gone.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully that\u0027s a mostly unbiased and clear explanation.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-08-09T01:52:49Z","Content":"\n\u003Cp\u003E\nIts demise was due primarily to the roleplay aspect, which did keep cropping up in that sub, causing arguments which resulted in some bans and many warns. \n\u003C/p\u003E\n"},{"CreatedByName":"HansonKerman","CreatedById":185809,"CreatedDateTime":"2018-08-09T14:27:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EOkay...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ESo what should I do with this thread now?\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-08-09T16:46:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223430640\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533824827\u0022 data-ipsquote-userid=\u0022185809\u0022 data-ipsquote-username=\u0022HansonKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, HansonKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo what should I do with this thread now?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat do you mean, \u0022do\u0022?  If your question\u0027s answered and you\u0027ve got nothing more to say on the topic, no need to \u0022do\u0022 anything.  Just let it lie.\n\u003C/p\u003E\n\u003Cp\u003E\nEither other people will keep posting and discussing and the thread stays alive... or else people stop posting and the thread goes quiet.  In which case the thread will fade away the same way all threads eventually do, if they\u0027re not something ongoing:  it\u0027ll start dropping lower on the page as other threads get posts in them and become more recent, and eventually it\u0027ll drop far enough that it falls off the front page and everyone forgets about it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003EUntil somebody in 2022 googles it, doesn\u0027t realize (or doesn\u0027t care) that it\u0027s a dead thread, and necros it.\u003C/span\u003E  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-09T23:46:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223430386\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533779569\u0022 data-ipsquote-userid=\u002227914\u0022 data-ipsquote-username=\u0022Vanamonde\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Vanamonde said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIts demise was due primarily to the roleplay aspect, which did keep cropping up in that sub, causing arguments which resulted in some bans and many warns. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI should have made it more clear that I have/had no idea how much rule breaking was going on, since successful moderation is invisible. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-08-10T00:15:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223430945\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533858363\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nsuccessful moderation is invisible\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe are \u003Cem\u003E\u003Cu\u003Eeverywhere\u003C/u\u003E\u003C/em\u003E!  And we are n\u003Cspan style=\u0022font-size:12px;\u0022\u003Eo\u003C/span\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003Ew\u003C/span\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Eh\u003C/span\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003Eer\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ee\u003C/span\u003E...  \u003Cem\u003EHahahaha!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E(sorry, couldn\u0027t resist)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes, when successful it \u003Cem\u003E\u003Cu\u003Emay\u003C/u\u003E\u003C/em\u003E be invisible... but it often leaves visible traces.  For example, a user may make an angry post that\u0027s mostly \u0022legitimate\u0022 rebuttal of someone else, but may contain a few snide personal jabs as well.  We generally don\u0027t remove an \u003Cem\u003E\u003Cu\u003Eentire\u003C/u\u003E\u003C/em\u003E post unless there\u0027s something wrong with the whole thing (belligerent, or off-topic, or spam, or whatever).  In cases where it\u0027s a mostly-okay post with just a few rotten bits in it, we snip out those bits-- and when we do, we always leave a visible \u003Cem\u003E[snip]\u003C/em\u003E or something and a \u0022Redacted by moderator\u0022 comment, so that people can see what we\u0027ve done.  Otherwise it would be unfair to the poster, since it would look like they wrote something they didn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issues with Rocket Builders is not just that it caused a lot of grief that required undue amounts of time from the moderator team, which is 1. not very big, and 2. composed of volunteers who do this for free in their spare time.  It also made life less fun in the forums-- people were exposed to lots of bickering.  (Stuff only becomes invisible \u003Cem\u003E\u003Cu\u003Eafter\u003C/u\u003E\u003C/em\u003E the moderator arrives to do damage control, which isn\u0027t instantaneous.)  In general, it was making the forum a less pleasant place to be for everyone, which is why it had to go.\n\u003C/p\u003E\n"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2018-09-10T03:43:39Z","Content":"\n\u003Cp\u003E\nThe idea behind Rocket Builders was pretty cool. The community could always use some collaboration when it comes to launching virtual space missions and building cool stuff. \n\u003C/p\u003E\n\u003Cp\u003E\nThe stuff Zekes did always blew my brain back in the day. A lot of the stuff that group did is still amazing even to this day. Its depressing that he essentially quit the forums when the Rocket Builders were shut down, but that\u0027s understandable. \n\u003C/p\u003E\n\u003Cp\u003E\nNot sure what damage a little bit of roleplay ever did, as the current spacecraft exchange still sees a modest amount of this. As Mad said though, the damage and subsequent moderation was mostly invisible to begin with; even with me on the receiving end at points. Have to take people\u0027s words that it actually got toxic somehow. Even though its hard to image people obsessed with space exploration and engineering to engage in that sort of harassing or hateful behavior. I might be biased due to my continuous presence there, but the spacecraft exchange in general is the least appreciated part of the forum. So much creativity happens in this game and not enough people get to see it these days. \n\u003C/p\u003E\n\u003Cp\u003E\nI think though that in its absence a lot of us senior designers have been trapped in our own worlds making stuff rather than actually collaborating like in the Rocket Builders days, which is kind of sad. \n\u003C/p\u003E\n\u003Cp\u003E\nThere was lots of drama and in the end this isn\u0027t the type of forum for that lol. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-10T03:45:59Z\u0022 title=\u002209/10/2018 03:45  AM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 10, 2018\u003C/time\u003E by Jon144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-09-10T23:46:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223448468\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536551019\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot sure what damage a little bit of roleplay ever did\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTwo main problems. \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFirst, people who are roleplaying \u003Cem\u003E\u003Cu\u003Eas\u003C/u\u003E\u003C/em\u003E kerbals ended up taking things \u003Cem\u003E\u003Cu\u003Emuch\u003C/u\u003E\u003C/em\u003E more personally, and were quick to take umbrage at perceived criticism.  (And sometimes feel license to behave in unpleasant ways-- \u0022no, that\u0027s not \u003Cem\u003E\u003Cu\u003Eme\u003C/u\u003E\u003C/em\u003E, I was just speaking \u003Cem\u003E\u003Cu\u003Ein character\u003C/u\u003E\u003C/em\u003E!\u0022)\n\u003C/li\u003E\n\u003Cli\u003E\nSecond, having an \u003Cem\u003E\u003Cu\u003Eorganization\u003C/u\u003E\u003C/em\u003E with defined roles for different people, where person A gets to decide what person B can or cannot do (\u0022I\u0027m the company president, and you\u0027re fired!\u0022, etc.) was just a recipe for hurt feelings and grudges.  It got seriously ugly, and then those folks brought those grudges into other areas of the forum.  It was bad, it caused hurt feelings all around, and it caused a neverending nightmare for the moderators to keep things sorted out.  (And there are only a few of us moderators, who are volunteers who do this in our scarce free time.  If we\u0027re wasting our time sorting out yet \u003Cem\u003E\u003Cu\u003Eanother\u003C/u\u003E\u003C/em\u003E roleplay-caused catfight, it means we can\u0027t be spending that time helping out in \u003Cem\u003E\u003Cu\u003Eother\u003C/u\u003E\u003C/em\u003E ways.  Resulting in a degradation of the forum experience that\u0027s very real, but hard to point a finger at.)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223448468\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536551019\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven though its hard to image people obsessed with space exploration and engineering to engage in that sort of harassing or hateful behavior.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, \u003Cem\u003E\u003Cu\u003Eabsolutely\u003C/u\u003E\u003C/em\u003E.  People obsessed with space exploration and engineering are people who are obsessed with \u003Cem\u003E\u003Cu\u003Eideas\u003C/u\u003E\u003C/em\u003E.  Meaning their \u003Cem\u003E\u003Cu\u003Eown\u003C/u\u003E\u003C/em\u003E ideas.  Meaning that personal egos get involved.\n\u003C/p\u003E\n\u003Cp\u003E\nBeing into space and engineering doesn\u0027t change fundamental human nature.  I\u0027m an engineer, and I\u0027ve worked with engineers for a quarter-century, and I can tell you that on average they\u0027re no \u0022nicer\u0022 or \u0022meaner\u0022 (or even more rational, when it comes to interpersonal interaction) than any other group of people-- they \u003Cem\u003E\u003Cu\u003Edefinitely\u003C/u\u003E\u003C/em\u003E have egos, and their feelings can be hurt like anyone else.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223448468\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536551019\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think though that in its absence a lot of us senior designers have been trapped in our own worlds making stuff rather than actually collaborating like in the Rocket Builders days, which is kind of sad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s nothing wrong with sharing stuff, and there\u0027s nothing wrong with collaboration.  Plenty of people \u0022get\u0022 to see the Spacecraft Exchange-- it\u0027s right there.  It\u0027s just that it happens not to draw a lot of interest, for whatever reason.\n\u003C/p\u003E\n\u003Cp\u003E\nWe generally like to let people do whatever they want, as long as it doesn\u0027t become a problem for the forum.  So the only things that are specifically disallowed are the things that have specifically shown themselves to be radioactive (i.e. they routinely result in toxic behavior).  In this case, there are two things that are specifically not allowed:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nPretending to be a kerbal or someone else-- i.e. you need to write \u003Cem\u003E\u003Cu\u003Eas yourself\u003C/u\u003E\u003C/em\u003E, not as some character.\n\u003C/li\u003E\n\u003Cli\u003E\nHaving an organization with assigned roles where anyone gets to decide what someone else can do.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAs long as you don\u0027t do those two specific things, you can do whatever you want.  It\u0027s a pity that those two things are disallowed-- there are some fun things that can happen when they go well.  It\u0027s just that, alas, the population-of-the-internet, in the aggregate, has shown that it can\u0027t handle these two factors without getting nasty.  It\u0027s a \u0022this is why we can\u0027t have nice things\u0022 sort of situation.  \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2018-09-11T16:14:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449029\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536623167\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs long as you don\u0027t do those two specific things, you can do whatever you want.  It\u0027s a pity that those two things are disallowed-- there are some fun things that can happen when they go well.  It\u0027s just that, alas, the population-of-the-internet, in the aggregate, has shown that it can\u0027t handle these two factors without getting nasty.  It\u0027s a \u0022this is why we can\u0027t have nice things\u0022 sort of situation.  \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll excellent points that I agree with in hindsight. Of course there\u0027s a lot of ego when it comes to creative minds even when it comes to a more mature audience. \n\u003C/p\u003E\n\u003Cp\u003E\nMy main assumption is that due to the relatively low traffic that befell the rocket builders and spacecraft exchange as a whole, it was a simpler decision to disallow all role-play rather than spend the extra time policing bad behavior so the moderators could spend their time better on other parts of the forum. That is, the rocket builders required a disproportionate amount of moderation to the actual size of its regular membership.\n\u003C/p\u003E\n\u003Cp\u003E\nNear the end of the rocket builder\u0027s life, my collaborations with Zekes didn\u0027t see much traffic as is. \n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t change the fact that a good portion of the communities best builders effectively vanished from the forum after this series of events. Short of the release of a whole new game like a hypothetical KSP2, the current forums will never see the same base of creators again. The spacecraft exchange is really only limping along at this point in my opinion. I remembered the days when your post could get 10\u002B reactions that very day and now you\u0027re lucky to get 2 likes on a post or thread by the next morning. \n\u003C/p\u003E\n\u003Cp\u003E\nIf there ever is a KSP2, we should learn from our mistakes and have a sort of rocket builders 2 that is either free of roleplay or on a completely different section of the forums where the creators moderate their own threads.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-11T16:17:24Z\u0022 title=\u002209/11/2018 04:17  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 11, 2018\u003C/time\u003E by Jon144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-09-11T16:25:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449410\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536682460\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI remembered the days when your post could get 10\u002B reactions that very day and now you\u0027re lucky to get 2 likes on a post or thread by the next morning.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure, but that\u0027s true of pretty much the whole forum these days, to one degree or another-- KSP is a pretty mature game at this point (it\u0027s been around for 6\u002B years, which is an eternity in video-game time), and the general level of traffic has dropped off a lot compared with what it was a few years ago, as one would expect.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449410\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536682460\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf there ever is a KSP2, we should learn from our mistakes and have a sort of rocket builders 2 that is either free of roleplay or on a completely different section of the forums where the creators moderate their own threads.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, given that the reasons why Rocket Builders had to be shut down were due to fundamental properties of human nature rather than anything specific to KSP itself, I don\u0027t see any reason why we should assume that human nature will change if-and-when there\u0027s ever a KSP2.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd, therefore, I don\u0027t see a reason why it\u0027s especially likely that the \u0022no roleplay\u0022 rule would be rescinded for that, either, unless some new and currently unforeseen circumstances came about to make us think it\u0027s less likely to be a problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2018-09-11T16:29:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449421\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536683153\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell, given that the reasons why Rocket Builders had to be shut down were due to fundamental properties of human nature rather than anything specific to KSP itself, I don\u0027t see any reason why we should assume that human nature will change if-and-when there\u0027s ever a KSP2.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAbsolutely. I\u0027m more-so suggesting that better rules would be implemented going in to prevent such things from happening again after witnessing what happened to the original. Keeping the rocket builders as a subforum for collaboration and only collaboration to compliment the spacecraft exchange for showcases. It might be a pipe-dream but we have a right to dream. Of course there\u0027s no point to do such things now given the loss of traffic as you\u0027ve pointed out. It\u0027s all hypothetical given that a KSP2 may never exist. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-11T16:32:20Z\u0022 title=\u002209/11/2018 04:32  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 11, 2018\u003C/time\u003E by Jon144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-09-11T16:36:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449423\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536683353\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m more-so suggesting that better rules would be implemented going in to prevent such things from happening again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, of course we\u0027re always interested in improving the rules, if possible, so we always welcome suggestions.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHowever, the \u0022no roleplaying as a kerbal\u0022 and \u0022no organizations with assigned roles\u0022 rules appear to have been both necessary and sufficient... so how would you suggest modifying them?  (I\u0027m having trouble seeing any wiggle room to make them less restrictive without opening the doors to prior bad behavior-- they\u0027re as permissive as we felt we could make them without losing effectiveness.)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449423\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536683353\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKeeping the rocket builders as a subforum for collaboration an\u003Cspan\u003E﻿\u003C/span\u003Ed only collaboration.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, people are free to do that \u003Cem\u003E\u003Cu\u003Enow\u003C/u\u003E\u003C/em\u003E, in Spacecraft Exchange.  As you\u0027ve noted, there doesn\u0027t appear to be a lot of demand for that, at the moment.  Part of that lack-of-demand might be due to people missing the roleplay aspect-- which is unlikely to change in the future, so anyone who\u0027s staying away for that reason, will likely continue to stay away.  But another part of the reason may simply be that KSP has gotten a bit long in the tooth and people aren\u0027t as revved up about it as they used to be, these days-- so if there were a really major new KSP coming out, I could see \u003Cem\u003E\u003Cu\u003Ethat\u003C/u\u003E\u003C/em\u003E firing things up again.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449423\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536683353\u0022 data-ipsquote-userid=\u002280626\u0022 data-ipsquote-username=\u0022Jon144\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Jon144 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt might be a pipe-dream but we have a right to dream. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAbsolutely, no arguments there!  \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2018-09-11T16:48:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449427\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536683776\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHowever, the \u0022no roleplaying as a kerbal\u0022 and \u0022no organizations with assigned roles\u0022 rules appear to have been both necessary and sufficient... so how would you suggest modifying them?  (I\u0027m having trouble seeing any wiggle room to make them less restrictive without opening the doors to prior bad behavior-- they\u0027re as permissive as we felt we could make them without losing effectiveness.)\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with no roleplay as a kerbal. Its a rule that makes sense for the forum given the complications it could pose. When I spent time in the rocket builders I had a hard time understanding when someone was being legitimate or not. It\u0027s unfortunate but makes sense and should probably stay. Could always go on some private forums and do it where people won\u0027t get confused. \n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is a collaboration thread like the rocket builder\u0027s can\u0027t exist without some sort of assigned roles and hierarchy... Like... so and so... build this by this deadline... etc. even if it doesn\u0027t have to do with roleplay.  \n\u003C/p\u003E\n\u003Cp\u003E\nA simple solution could be to just keep these discussions through private messages or emails while later posting progress on these projects in the threads themselves. \n\u003C/p\u003E\n\u003Cp\u003E\nThis sort of thing is already possible on the spacecraft exchange.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem though is that in a high volume scenario a lot of stuff gets pushed off the front page of the forum if you have people repeatedly posting in these rocket builders megathreads. If you had like 12 of these threads going on at the same time with a continuous presence on the front page lots of personal showcase threads would be pushed off and not many people would get to see them. That\u0027s why it would make sense to make two separate sub-forums in this event in my opinion. It only works as-is now due to the much lower traffic compared to the peak days. \n\u003C/p\u003E\n\u003Cp\u003E\nJust my 5-cents. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-11T16:49:34Z\u0022 title=\u002209/11/2018 04:49  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 11, 2018\u003C/time\u003E by Jon144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-09-11T18:32:42Z","Content":"\n\u003Cp\u003E\nYou know the kinds of bizarrely acrimonious disputes you see between individuals on the forum? Now imagine that but with \u003Cem\u003Ecoalitions\u003C/em\u003E of players hating and attacking each other, not just in a Rocket Builders subforum, but in unrelated threads and ranting PM exchanges as well. Rival \u0022companies\u0022 having feuds and insulting each other\u0027s designs. \u003Cstrong\u003EThat\u003C/strong\u003E is what got the RB subforum shut down. The worst of it was just before I joined the moderating team, but at least one person got permabanned over it, there were several tempbans, and lots of warns issued. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-25T02:58:09Z\u0022 title=\u002209/25/2018 02:58  AM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 25, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HansonKerman","CreatedById":185809,"CreatedDateTime":"2018-09-16T21:15:39Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EAbleesh! I can\u0027t \u003C/span\u003E\u003Cfont face=\u0022Lucida Sans Unicode, Lucida Grande, sans-serif\u0022\u003Ebelieve how many posts this has! \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/font\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2018-09-24T22:33:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449480\u0022 data-ipsquote-contentid=\u0022177425\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536690762\u0022 data-ipsquote-userid=\u002227914\u0022 data-ipsquote-username=\u0022Vanamonde\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/11/2018 at 11:32 AM, Vanamonde said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou know the kinds of bizarrely acrimonious disputes you see between individuals on the forum? Now imagine that but with \u003Cem\u003Ecoalitions\u003C/em\u003E of players hating and attacking each other, not just in a Rocket Builders subforum, but in unrelated threads and ranting PM exchanges as well. Rival \u0022companies\u0022 having feuds and insulting each other\u0027s designs. \u003Cstrong\u003EThat\u003C/strong\u003E is what got the RB subforum shut down. The worst of it was just before I joined the moderating team, but at least one person got permabanned over it, there were several tempbans, and lots of warns issued. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, pretty sure we\u0027d get worked up over manufacturing impurities in tin foil if you let us. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-25T02:57:47Z\u0022 title=\u002209/25/2018 02:57  AM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 25, 2018\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"}]}