{"TopicId":178200,"ForumId":21,"TopicTitle":"KNS submarine/sea-plane fleet (WIP) (a new sub and catapult-plane in WIP stage))","CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-10T10:29:41Z","PageNum":1,"Articles":[{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-10T10:29:41Z","Content":"\n\u003Cp\u003E\nThis time doing WIP stuff along with the usual stuff. I taught this would be good idea since im going to be releasing quite a bit of more interesting tech here, so i taught you guys would probably like to see that how it\u0027s made so that you can maby do something similar yourself. And of-course avoid doing the same mistakes i will inevitably do \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason why this is a separate post, rather than me including this stuff in the KNS project witch this is still a part of, is because all of this stuff will be a little more connected to one-another. The submarine tender for instance, will have the ability to refuel the new sub im making...that sort of thing, so it only seemed correct to have them all under one roof where they can easily be found.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWIP stuff (Gato-class)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThere\u0027s so much WIP stuff that putting all off it from every craft in one spoiler would be wayyyy to much, so each ship will now have their own spoiler.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EGato class\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI decided to start working on the Gato-class, and the first thing i wanted to do, was some boyancy test\u0027s to see if tweackscaled parts behave like they should.\n\u003C/p\u003E\n\u003Cp\u003E\nThe answer is NO, they dont.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00228pJkj93.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/8pJkj93.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI had one huge ore-tank in the middle completely filled. Even 10x gravity did nothing...so that\u0027s a definite NOPE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022HnKpWU7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HnKpWU7.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSecond test rig used a ore-tank hull, it worked a little better, but was still far too buoyant to even think of making it into a submarine.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ESo, the lesson of today kids: DO NOT use tweackscale on anything if you want to make a working submarine.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSo, i will now have to continue with one less mod on the list, \u003Cs\u003Eand basically do what i did on the \u0022wolf\u0022.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTime for some more progress. I decided to try a completely new idea and use fairings with the new structural tubes from the DLC, if this idea works, ill save a lot of parts...but since i haven\u0027t ever tested those for buoyancy, it\u0027s a total guessing game right now.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nJust for the fun of it, i might as-well show you my sure to work backup.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00225iA2bXh.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/5iA2bXh.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe fuel-tank works as a jig so that i can get the structural panels to be as \u0022circular\u0022 as possible.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nBut, here\u0027s the actual hull im working on.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022nmTwoyt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/nmTwoyt.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI really wanted an open interior into witch i can place all the technical stuff.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe torpedo-tubes i wanted i decided to scarp since they where a little too big.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022DxxyetY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/DxxyetY.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe torpedoes are instead now just hanging in mid air...or water.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022UdKEEKq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/UdKEEKq.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe setup might not be the prittiest, but that\u0027s not the point, it\u0027s supposed to be simple and functional.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd this is what it looks now.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00220qL1x3x.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0qL1x3x.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe nose is complete, and so is the bridge. while i was doing this, i found a new way of getting struts to bend to my will...or like the way they used to.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ERecently no offset limits hasn\u0027t been working with struts any more, this caused me to drop making rigging as i couldn\u0027t get the struts to reach far enough. This time what i did, is that i put down the part i wanted the strut to connect to, and then offset that to it\u0027s proper place, thus stretching the strut beyond it\u0027s usual limits.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe deck turret on this one is simply just my DD-turret subassembly without the shield.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI wanted to use the \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131541-ptrevtrevs/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022131541\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131541-ptrevtrevs/\u0022 rel=\u0022\u0022\u003E@pTrevTrevs\u003C/a\u003E retractable drill periscopes, but i noticed from my reference material that the periscopes in the Gato class...for the most parts at-least, are fixed. Plus, \u003Cstrong\u003Ei wanted to have a \u0022functional\u0022 periscope, that has the BD-armory targeting-camera on it\u0027s tip.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI decided to make the bridge a little more my own. I will most likely be making some changes to it, so more details later.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIm trying to give as much info during this build...but i don\u0027t thinks there\u0027s much else to say for now, i think im gonna make the next update when the hull is complete.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime to continue again\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI decided to skip ahead a bit and already completed and tested the sub.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022C3jw2cx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/C3jw2cx.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe rear hull is pretty much empty inside. \u003Cstrong\u003EThe ore-tanks are part of the main \u0022ballast-tanks\u0022, witch pretty much go trough the entire length of the sub\u003C/strong\u003E. The only other slightly interesting bit \u003Cstrong\u003Ethere is the girder i offset from inside the hull to make sure i had a straight as an arrow mounting point for the rudders\u003C/strong\u003E, it also serves as a mounting point for the batteries and \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u0027s.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EI currently in the latest version have 4 rudders for turning (Big-S 2) and 10 Big-S 2\u0027s and 14 R8 winglets for altitude adjusting. The sub also has 14 Goliath engines. Oh, and there\u0027s also 17 of the largest \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modules.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ESo definitely remember to put plenty of those bits if you want your own subs to work.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022X3UJ0XC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/X3UJ0XC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002211tusrS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/11tusrS.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe nose is also quite empty on the inside, especially so on the AWACS modification that has no torpedoes.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022H36isUe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/H36isUe.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThis is why i wanted an empty hull, it allows me to place the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modules, fuel-tanks, and ore-tanks inside while still being able to access and tweak them easily.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe ore-tanks run the entire length of the tubes, and also extend a little inside the tail section. As for fuel-tanks, some of the fuel comes from the bridge structure, but i also have 6 MK-1 tanks to give little extra range, i didn\u0027t want to put any more, as i feared they would give me too much buoyancy. The \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modules you can see clearly, so no need to talk about those. It would have been a good idea to place a couple of those super coin-cell batteries in there, but their not really necessary as the engines produce a power-plant worth of electricity.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00221fGnN0h.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1fGnN0h.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nLike i mentioned above, i did some changes to the bridge. It now has 2 fake hatches, a spinning radar instead of the orange ball, and a torpedo aiming device that looks like a pair of binoculars. Oh, and there\u0027s also some railings and a small crane on deck with the crew hatches (they have the docking-ports on them in the latest version).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd here\u0027s something you can add to your own sub, that i decided to leave out due to pure paranoia of unwanted detonations.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022bxaYkg5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/bxaYkg5.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022LERYtWN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/LERYtWN.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nBasic doors for the torpedo-\u0022tubes\u0022.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd here\u0027s a shot of the AWACS version of this sub.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022CGGLUZH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CGGLUZH.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n18 instead of 88, radars (smaller one spins around) instead of a torpedo-aiming device and rangefinder (for the removed deck gun), an extra AA-mount, an AWACS radar, a sonar-pod in the nose, and a big \u0022radar-pod\u0022 with a radome in it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd of-course no torpedoes.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00221vWIVO0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1vWIVO0.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EOh, and before i forget, to get you sub to go underwater, it is advisable to fill you ore-tanks/place them in such a way that your nose is clearly lower than you rear, this will help a lot.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EAnd as far as balance between engine,ore-tanks...i don\u0027t really have a clear formula for that as each sub is different, and needs it\u0027s own tweaks and fixes.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EBut, as soon as you get to the point where your can go underwater in any shape of form (for me it has been nose first towards the sea bottom without much control), it\u0027s advisable to tweak your ballast first (basically shift your weight), then tweak the engines and control surfaces.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EAnd if your wondering about structural stuff, this one is pretty much completely held together with auto-struts to save parts.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd that\u0027s pretty-much it for the Gato-class based one. If there is any more info you want, just ask and i will try to provide it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWIP stuff (Prairie based one)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThis time there ain\u0027t much in the way of WIP stuff, as all of this is very simple construction with a few details sprinkled on top.\n\u003C/p\u003E\n\u003Cp\u003E\nUnlike the Great White III witch is pretty much a replica of the Gato-class, this one is a little more my own.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSo, lets delve in deeper and see how it\u0027s made.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022fWpJaYB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/fWpJaYB.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe biggest difference to the real one is the addition of a third funnel and the refuelling crane at the front. I will most likely be relocating the crane and doing some changes, as i think it looks pretty horrible, plus...i don\u0027t know if it even works yet.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022rWFM6M3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/rWFM6M3.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIt would be pretty cool to make the cranes at the back the refuelling cranes, but there\u0027s just too long of a way down to the subs deck for me to use them effectively...i mean, yea sure, i could place a really long pole of pistons...but that just looks horrible, but there is always a chance i might go for that.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nPretty much the entire hull (minus some bits in the nose), and majority of the superstructure is made from MK-3 hulls. They won\u0027t give you the cleanest look, but you save so many parts that way, that it just makes more sense, plus...it makes everything way more sturdy and easy to strut up as-well, though just like in the Gato-class one, pretty much the entire ship is held together with autostruts.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThank god i figured out the way to stretch struts and fuel-lines as far as i want them, as using that, i was once again after a long time able to do some rigging, and for the first time, part-count friendly railings.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022BU4NEwB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/BU4NEwB.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nYou should be able to see the little cubic struts i attached the fuel-lines to, once those where attached, i just offset the strut to where i wanted the \u0022railing\u0022 to end.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nOne thing i also found out during this build concerning fuel-lines, is that unlike struts, if you attach a fuel.line between parts that are at the opposite ends of a piston, if you move the piston, the fuel-line stretches with it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022J1LUF2n.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/J1LUF2n.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTo get the rigging between the masts, i basically just offset the I-beams from the other mast close enough that i could connect the struts, and then offset them back into place.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022lrX0OFX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/lrX0OFX.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSince im using IR anyways wit this one, i taught id spice things up a little and add some custom radars as-well.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe big gray plate is supposed to be the \u0022cargo-hatch\u0022, the \u0022windows\u0022 in the cranes are back-sides of batteries (oscar\u0027s in the bridge). I could list all the other details, but i think you can already guess what all the other detail bit\u0027s are made out of, and what they are pretending to be, like doors, lifeboat\u0027s, rangefinders...that sort of stuff.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nOh, and BTW, the hull i use in this one is just a modified version of the \u0022destroyer hull 2\u0022 that you can find in the main \u0022KNS reloaded\u0022 post.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd that\u0027s pretty much bit for this ship for now, just need to do some testing and she\u0027ll be good to go.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWIP stuff (Aircraft catapult/catapult-plane)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022wRGJuYc.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/wRGJuYc.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWIP stuff (Small attack sub) \u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229ifm1s0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9ifm1s0.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ECompleted crafts \u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EK.S.S Great White III and K.S.S SeaScout\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022noNNcup.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/noNNcup.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n(SeaScout in the foreground with Great White III in the background)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/B5MV-ptm894?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nYou can see in the video that i had some problems firing the guns, i don\u0027t know why, but BD-armory just seems to have a mind of it\u0027s own sometimes. \u003Cstrong\u003EOh, and BTW, turret turning was bound to 2 and 3.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ETechnical specks:\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTop speed:\n\u003C/p\u003E\n\u003Cp\u003E\n-Above water:  about 35-40 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n-Under water: about 15 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nRange: not sure, but really not that great.\n\u003C/p\u003E\n\u003Cp\u003E\nArmament:\n\u003C/p\u003E\n\u003Cp\u003E\n-Great White III: 1x Howitzer, 2x 30mm chaingun.\n\u003C/p\u003E\n\u003Cp\u003E\n-SeaScout: 1x 50.cal turret, 2x 30mm chaingun.\n\u003C/p\u003E\n\u003Cp\u003E\nLength: 51.9m\n\u003C/p\u003E\n\u003Cp\u003E\nWidth: 8.5m\n\u003C/p\u003E\n\u003Cp\u003E\nHeight: 13.6m\n\u003C/p\u003E\n\u003Cp\u003E\nMass:\n\u003C/p\u003E\n\u003Cp\u003E\n-Great White III: 786 tons\n\u003C/p\u003E\n\u003Cp\u003E\n-SeaScout: 784 tons\n\u003C/p\u003E\n\u003Cp\u003E\nParts:\n\u003C/p\u003E\n\u003Cp\u003E\n-Great White III: 377\n\u003C/p\u003E\n\u003Cp\u003E\n-SeaScout: 350\n\u003C/p\u003E\n\u003Cp\u003E\nFurther details will of-course be inside the WIP stuff section.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EMods used:\u003C/strong\u003E\u003C/span\u003E BD-armory, Infernal robotic and Making History DLC.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EDownload link:\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003E-Great White III: \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://www.dropbox.com/s/fpmt3vyi9bwixgh/K_S_S%20Great%20White%20III.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/fpmt3vyi9bwixgh/K_S_S Great White III.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003E-Sea Scout: \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://www.dropbox.com/s/cowhooahfwxug5q/K_S_S%20SeaScout.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/cowhooahfwxug5q/K_S_S SeaScout.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EList of completed ships:\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAttack submarine \u003Cstrong\u003EK.S.S Great White III\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAWACS submarine \u003Cstrong\u003EK.S.S SeaScout\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EList of stuff that that im planning on making.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nLet\u0027s start with what im going to likely do first, witch is the \u003Cstrong\u003ESubmarine-fleet side of things.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cs\u003EWill likely be named\u003Cstrong\u003E K.S.S Kato\u003C/strong\u003E\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nEdit: Since my new plan has me mix the Gato, Balao, and Piper, im gonna have to come up with a new name for it (something original), and the AWACS sub that im gonna build from it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIm thinking \u003Cstrong\u003EK.S.S Great White III\u003C/strong\u003E for the regular one (was originally the name for a CV and then a BB witch are both gone now),\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd maby...i dunno \u003Cstrong\u003EK.S.S SeaScout\u003C/strong\u003E...or something like that, for the AWACS sub.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022vwzRA0Q.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022541\u0022 src=\u0022https://i.imgur.com/vwzRA0Q.jpg\u0022 width=\u0022900\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe submarine itself will be based on the US Gato-class of submarines.\n\u003C/p\u003E\n\u003Cp\u003E\nMy plan for this one is to use tweackscale this time to simplify things, as the last time i made a sub, it was filled to the brim with dozens of ore-tank\u0027s, struts, control-surfaces...that sort of stuff, and it became a huge mess. Also, the Gato-class is quite big as-well.\n\u003C/p\u003E\n\u003Cp\u003E\nMain improvements over the old one will hopefully be:\n\u003C/p\u003E\n\u003Cp\u003E\n1. A more reasonable part-count. \u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003Elesson of today kids: DO NOT use tweackscale on anything if you want to make a working submarine.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ELooks like this part will actually happen...well...\u003Cs\u003Eif my idea of using the new structural-tubes from the DLC with fairings as the hull actually works.\u003C/s\u003E Yep, the new hull idea works, and may just be THE way to build submarines, as it gives so many options in size and shape.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2. Working torpedo-tubes with torpedo\u0027s\n\u003C/p\u003E\n\u003Cp\u003E\nThe tubes are gone, but it remain to be seen if the torpedoes work\u003Cs\u003E, or will they just detonate as soon as i release them. \u003C/s\u003EYep, the torpedoes work, but ive only tested them while staying still, as i fear they will get eaten inside the nose if i fire them from the move.\n\u003C/p\u003E\n\u003Cp\u003E\nThe torpedoes take a while to actually go anywhere BTW, probably to enable them to be dropped from aircraft...witch kinda sucks in this case, but in general, it\u0027s probably for the best.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n3. much higher speed and bigger operating range (the old one was really slow under water...bout 11 m/s, and had fuel for like 12 minutes).\n\u003C/p\u003E\n\u003Cp\u003E\nThe speed is definitely bigger and the range is longer, but it still ain\u0027t that great.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo allow for a longer operating range, and maby even rearming it (rearming torpedo\u0027s will be impossible, but other weapons could possibly be rearmed by having a sort of ammo-pallet that could be docked/un-docked using a crane), im going to build a submarine tender.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: So, i did some more research by reading some books i borrowed from the library yesterday (mostly to satisfy my interest in the Gato-class, but also to maby get some new ideas), and it seems that the Gato-class was more popular than i taught, as it spawned two new classes that are based on the it, the Balao-class, and the Tench class.\n\u003C/p\u003E\n\u003Cp\u003E\nSo looks like im instead going to make my own variation of the Gato-class. I also think im gonna make a second Gato like submarine, and turn it into a radar-surveillance sub just like some Gato\u0027s where in the cold-war days. Basically they did the same to the Gato as they did with the E-3 Sentry, just take an old craft and stuff an AWACS/AEW style radar and all the stuff needed for it inside. Im planning to give that version a different style of bridge, maby some sort of a radar-dome and im also gonna remove the torpedo-armaments from it...or something like that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nWith the new Gato-class and AWACS version of it, i taught id also do a smaller attack-sub...\u003Cs\u003E\u003Cstrong\u003Eif\u003C/strong\u003E the Gato-class is a success and not a repeat of the previous attempt.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI decided to do this one cause i just felt like it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nProbably gonna be named \u003Cs\u003E\u003Cstrong\u003EK.S.S Hammerhead\u003C/strong\u003E.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nNow named \u003Cstrong\u003EK.S.S Barracuda.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022mUpdpXV.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022620\u0022 src=\u0022https://i.imgur.com/mUpdpXV.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI think the British E-class should service that ambition just fine, tough i have a bit of a feeling that this small sub wont be so close to the original in the end.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMy main hope is to get this one to be more nimble and fast compared to the big Gato (it is about 40m shorter IRL).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cs\u003EDunno the name for it yet.\u003C/s\u003E She shall be named \u003Cstrong\u003EK.S.S Mule\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nForget the \u003Cstrong\u003EU.S.S Prairie\u003C/strong\u003E looking one, i don\u0027t really like the look of my own version that much...so, say hello to what the new Mule will look like.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229UvfkTj.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022597\u0022 src=\u0022https://i.imgur.com/9UvfkTj.jpg\u0022 width=\u0022850\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMy basic plan is to have one of the cranes/hoists on one of the mast\u0027s serve as my refuelling crane for the subs.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnd now to the \u003Cstrong\u003Esea-plane fleet\u003C/strong\u003E of things.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nDunno the name for this one yet either. \u003Cstrong\u003EK.S.S Pathfinder\u003C/strong\u003E shall be it\u0027s name (fit\u0027s the task of the ship a little better)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229agJH4T.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022125\u0022 src=\u0022https://i.imgur.com/9agJH4T.jpg\u0022 width=\u0022402\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nQuite small isn\u0027t it, basically it\u0027s a converted old Clemson class destroyer.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nBasically this one will be there more for looks than variety. as the original was used for maintaining of marked landing areas and for ferrying of sea-plane crews, not for refueling or rearming like i originally taught.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMine will most likely have a bunch of fuel-tanks with lights and antennas that can be dropped in the sea as markers for...whatever it is that you need a marker for.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nFor refueling of sea-planes, im planning on making something in the lines of this.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nProbably gonna be named \u003Cs\u003E\u003Cstrong\u003EK.S.S Pathfinder\u003C/strong\u003E. \u003C/s\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022YWPgKEl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022239\u0022 src=\u0022https://i.imgur.com/YWPgKEl.jpg\u0022 width=\u0022775\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cs\u003EDunno what the ship in this picture is\u003C/s\u003E (some searching later, U.S.S Pocomoke, a sea-plane tender...lucky me), just happened to come across it and liked the look of it.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically i just wanted a basic cargo-ship type thing that i will load with fuel and some sort of refueling cranes.\n\u003C/p\u003E\n\u003Cp\u003E\nI also feel that a ship like this would serve as a perfect platform for my aircraft-catapult and the possible recovery-crane for it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIf the ship has enough space, and i can make the catapult large enough, i will most likely use my existing \u0022Gladiator\u0022 as the catapult plane.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIt has some amazing STOL capabilities, so good in fact, that it can be landed on the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E helipad.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022x7el7GR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://i.imgur.com/x7el7GR.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nJust need to add some floats and it should be all good, tough it will never be that easy, as sea-planes, especially ones like this are very tricky to get right.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAs for the other sea-planes that the tenders will be tending to.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI have decided to make all the sea-planes custom instead of basing them directly on real-life aircraft.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nBut i will of-course be taking inspiration from different real-life designs.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: some of you may be wondering, that why aren\u0027t there anything used by the axis in this project...well, i felt it made sense to stay in the allied side of things for compatibility and because most of the stuff in the KNS project is USN based anyways, plus, most of my research/knowledge is centered around the US navy. I will most likely do some German and Japanise stuff in the future, as im seriously planning on making some naval stories with my ships (or maby even some short films), and for that i really need a rival navy, so don\u0027t worry, ive got plenty of that stuff coming in the future.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, should make for an interesting project. \u003Cs\u003EAll the WIP stuff will go on it\u0027s own section and stay there \u003C/s\u003E(there\u0027s so much WIP stuff per craft, that every craft will have their own WIP Spoiler), while all the completed crafts have their own section.\n\u003C/p\u003E\n\u003Cp\u003E\nI was planning on removing stuff from the \u0022\u003Cspan style=\u0022font-size:14px;\u0022\u003EList of stuff that that im planning on making\u0022 as i make these crafts, but now i kinda wanna keep it there, so i dunno, it might disappear...or not...or then i\u0027ll just put that stuff on their own WIP sections.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd there you have it, a nice little growing project. I hope you enjoy following the progress \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPS: i don\u0027t want to clog up the comments with constant updates, so be sure to comeback every now and then if you want to know what\u0027s going on (title will tell you the progress).\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-27T22:05:30Z\u0022 title=\u002211/27/2018 10:05  PM\u0022 data-short=\u00225 yr\u0022\u003ENovember 27, 2018\u003C/time\u003E by kapteenipirk\u003C/strong\u003E\n\u003Cbr\u003ESome more WIP stuff and new ideas/changes\n\u003C/span\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-09-10T16:10:02Z","Content":"\n\u003Cp\u003E\nIf you haven\u0027t seen it before, you may be interested in checking out an old \u003Cem\u003EGato\u003C/em\u003E submarine I built about two years ago:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed2145015376\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135986-gato-class-submarine-more-or-less/\u0026amp;do=embed\u0022 style=\u0022height:225px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KBnALWq.jpg\u0022 src=\u0022https://i.imgur.com/KBnALWq.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nProbably won\u0027t work in the latest version of KSP (not that it ever worked well, but maybe you can gain some inspiration from the pictures I have on the thread. \n\u003C/p\u003E\n"},{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-10T16:25:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223448745\u0022 data-ipsquote-contentid=\u0022178200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536595802\u0022 data-ipsquote-userid=\u0022131541\u0022 data-ipsquote-username=\u0022pTrevTrevs\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, pTrevTrevs said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nProbably won\u0027t work in the latest version of KSP (not that it ever worked well, but maybe you can gain some inspiration from the pictures I have on the thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, i remember that one, as well as both of the U-Boats, and they where the inspiration/driving force that made want to do the \u0022Wolf\u0022 submarine.\n\u003C/p\u003E\n\u003Cp\u003E\nBut thanks for the reminder \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E, will have to take a look...tough right now i have 3 large books about subs and WWII ships that i just got from the library i have to go trough. Not only for further research/idea sake, but because i just really enjoy reading about that sort of stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nShould be able to get at-least a few good ideas from it, even tough my approach will most likely be very different.\n\u003C/p\u003E\n"},{"CreatedByName":"Heckspress","CreatedById":8020,"CreatedDateTime":"2018-09-11T23:28:02Z","Content":"\n\u003Cp\u003E\nyea the way buoyancy is calculated just by mass/volume so if tweakscale scales the ore tank incorrectly and adds too much volume without enough mass, then it floats. \n\u003C/p\u003E\n\u003Cp\u003E\nquick trick that i found out: if you get really close to neutral buoyancy you can actually use landing gear as \u0022ballast tanks\u0022, if you extend them it reduces density so it actually causes your depth to rise\n\u003C/p\u003E\n"},{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-12T05:29:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449623\u0022 data-ipsquote-contentid=\u0022178200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536708482\u0022 data-ipsquote-userid=\u00228020\u0022 data-ipsquote-username=\u0022Heckspress\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Heckspress said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyea the way buoyancy is calculated just by mass/volume so if tweakscale scales the ore tank incorrectly and adds too much volume without enough mass, then it floats. \n\u003C/p\u003E\n\u003Cp\u003E\nquick trick that i found out: if you get really close to neutral buoyancy you can actually use landing gear as \u0022ballast tanks\u0022, if you extend them it reduces density so it actually causes your depth to rise\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, interesting stuff, might have to see about using that \u003Cspan\u003E\u003Cspan\u003E\u0022ballast-tank\u0022 idea on some future design.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EThanks for the info.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"klond","CreatedById":38787,"CreatedDateTime":"2018-09-13T01:39:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223449623\u0022 data-ipsquote-contentid=\u0022178200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536708482\u0022 data-ipsquote-userid=\u00228020\u0022 data-ipsquote-username=\u0022Heckspress\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/11/2018 at 6:28 PM, Heckspress said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyou can actually use landing gear as \u0022ballast tanks\u0022, if you extend them it reduces density so it actually causes your depth to rise\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n Yes!  But a bunch of landing gear popped out will add lots of drag too.  Pretty realisic if your sitting still tho.  Cargo canisters change buoyancy too with doors open/closed.  We should look into other items that move (solar panels, antennas, etc).\n\u003C/p\u003E\n"},{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-20T18:01:22Z","Content":"\n\u003Cp\u003E\nSorry it took me this long to get some new stuff here, but i\u0027ve been keeping myself so damn busy with model projects IRL that i just haven\u0027t had the time \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAs expected, the ship im working on right now is the Prairie based submarine-tender.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI can tell you, that after going trough all my research material from the library, i have so many ideas for new ships, that soon im gonna have a fully fledged fleet or two with pretty-much everything a real fleet has (well...that has kinda been my goal from the start).\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and then there\u0027s also that book on modern navies \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E...i really should get all the ship names up on some notebook so that i can remember them (searching them on google and saving the picks might be a better idea tough).\n\u003C/p\u003E\n\u003Cp\u003E\nFor this project tough, \u003Cs\u003Ethere aren\u0027t really any ships left in the USN arsenal\u003C/s\u003E, (scratch that, there are tons more) but there are always some Japanise ships that would fit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd just for the fun of it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E, and to prove ive done my research \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E, why not show you some other possibilities for variety sake\u0027s (beware, as there\u0027s a lot of this stuff, but not all of them...basically USN, IJN, Kriegsmarine and Royal navy)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERoyal navy\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHMS Adamant (submarine tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022viyAnZi.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/viyAnZi.jpg\u0022 width=\u00221016\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHMS Woolwich (submarine depot ship)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022arV9oif.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022https://i.imgur.com/arV9oif.jpg\u0022 width=\u0022793\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHMS Tyne (tender of some sort)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W7Yr8Ws.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022599\u0022 src=\u0022https://i.imgur.com/W7Yr8Ws.jpg\u0022 width=\u0022800\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHMS Maidstone (submarine depot ship)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pzTO7DY.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022500\u0022 src=\u0022https://i.imgur.com/pzTO7DY.jpg\u0022 width=\u0022490\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAnd a selection of small converted trawlers and PT-boats.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUS Navy\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFulton class and Vulcan class (pretty much the same as the Prairire)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Altair (destroyer tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yqykzmW.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022767\u0022 src=\u0022https://i.imgur.com/yqykzmW.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Klondike (destroyer tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bhbxvPi.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022593\u0022 src=\u0022https://i.imgur.com/bhbxvPi.jpg\u0022 width=\u0022735\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETangier class (Pocomoce belongs to this)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBarnegat class (sea-plane tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SoNfloO.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022615\u0022 src=\u0022https://i.imgur.com/SoNfloO.jpg\u0022 width=\u0022740\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECumberland sound (sea-plane tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aaAxtiH.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022453\u0022 src=\u0022https://i.imgur.com/aaAxtiH.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Currituc (sea-plane tender. Already replicated)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228yALoWj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022https://i.imgur.com/8yALoWj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c8NApOu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022https://i.imgur.com/c8NApOu.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Griffin and Fulton class (says it right on the plaque)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FoP7gHe.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022683\u0022 src=\u0022https://i.imgur.com/FoP7gHe.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Whitney (destroyer tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MVfJkWq.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022675\u0022 src=\u0022https://i.imgur.com/MVfJkWq.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUSS Melville (again, pretty obvious)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y8cchiu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022745\u0022 src=\u0022https://i.imgur.com/y8cchiu.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EProbably a whole bunch of converted destroyers and other small crafts (like the USS Ballard)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN Kamoi and notoro (only slight differences between the two)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iEqMSJh.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022280\u0022 src=\u0022https://i.imgur.com/iEqMSJh.jpg\u0022 width=\u0022600\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN Trugizaki (submarine tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qyVv8YJ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022132\u0022 src=\u0022https://i.imgur.com/qyVv8YJ.jpg\u0022 width=\u0022516\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN Taigei (submarine tender)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FULgvAS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022282\u0022 src=\u0022https://i.imgur.com/FULgvAS.jpg\u0022 width=\u0022600\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWouldn\u0027t be surprised if there where some converted destroyers and other small crafts too\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN Tiyoda (sea-plane carrier)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Qkhrr7F.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022426\u0022 src=\u0022https://i.imgur.com/Qkhrr7F.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(the ship on the lower part of the photo is, the light aircraft carrier Zuiho (if im not mistaken).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJN Akitsushima (sea-plane carrier)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XnkCwNK.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022374\u0022 src=\u0022https://i.imgur.com/XnkCwNK.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hOdCwwH.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022513\u0022 src=\u0022https://i.imgur.com/hOdCwwH.jpg\u0022 width=\u0022800\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKriegsmarine\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBuzzard (sea-plane carrier)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225M9xGJ5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022396\u0022 src=\u0022https://i.imgur.com/5M9xGJ5.jpg\u0022 width=\u0022901\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAnd a bunch of old converted trawlers and destroyers.\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSo, lot\u0027s to choose from, even in this front. And there are plenty more to go on if your willing to dig deeper, look at other navies, and look at all the stuff before WWII.\n\u003C/p\u003E\n\u003Cp\u003E\nSomething like the Taigei and the Tiyoda i will most likely make once i get to the enemy fleet side of things (basically Germany and Japan, and maby Italy), but that remains to be seen.\n\u003C/p\u003E\n"},{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2018-09-21T21:35:51Z","Content":"\n\u003Cp\u003E\nI know im kinda braking my own rules by posting to the comments so quick, but i created something today that deserves it\u0027s own mention...i mean seriously, i think im in love.\n\u003C/p\u003E\n\u003Cp\u003E\nPlus, there\u0027s also a pretty awesome little design i did some time ago that i was supposed to include in this project, but didn\u0027t because of it having such a high part-count.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAlright, let\u0027s start with the design that i absolutely freaking love.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022wq4ujA6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/wq4ujA6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIf your wondering, \u0022hey, i think ive seen that before\u0022 you would be right, as this is the old SeaMaster...MK III in this case.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI used to really like this aircraft when i originally created it, but back then it was a laggy mess that was a bit hard to operate with a mess of different engines powering it...but now, it\u0027s exactly the way i wanted it to be when i first imagined this Sunderalnd\u0027ish sea-giant...it\u0027s easy to fly, has \u00224-engines\u0022 and can takeoff from water without the need of extra boosters \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E. Pretty much the plane of my dreams.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nWell...why not just show you what it looked like back then.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00221dve4QN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022https://i.imgur.com/1dve4QN.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe KAX props where way too small and under-powered, the Goliath\u0027s looked way out of place, and the shuttle-engines where way too fuel-hungry.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nBut, i still really liked the overall design, especially the double-decker fuselage and the surprisingly simple and low-part custom cockpit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022IqUHmOC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022https://i.imgur.com/IqUHmOC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThose \u00224-engines\u0022 are actually a combination of 12 engines.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI call this new engine the \u0022Poseidon\u0022, with a thrust of about 1000 KN per engine, it\u0027s quite the beast. Basically it has a scaled up Wheelsey working as the engine cowling, a V22 Osprey engine (\u0022Kitty\u0022) as the propeller, and a Goliath as the intake for cooling and stuff.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nOne little fun bonus in this one is, that remember how Stukas had the signature...howl...or whatever you wanna call it when their diving...well, when you slow down for an attack run, the propellers will slightly over-heat and glow red, warning anyone to run while they still can, as this plane has 4 30mm cannons and 24 bombs/torpedoes in it\u0027s arsenal, along with 6 50.cal turrets \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022hsuTgRR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/hsuTgRR.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIn order to get this to even happen in the first place, i had to do something i\u0027ve never done before.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIn the retro pick of the craft you can see KAX engines...i haven\u0027t used KAX in a LOOONG time, so normally i would have had to rebuild this from scratch (MKII version had dissapeard somewhere), but since i care for this craft so much, i decided to use the old \u0022open the craft file in notepad and remove the engines there\u0022 trick, and it worked, but some side-effects where bound to happen.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSo, here is what the thing looked after i got the craft opened, re-rooted and so that it can actually be edited\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022DyO9lV7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/DyO9lV7.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nYea, some slight corruption, but not too much. There where also some parts that had lost their mirroring, so bit\u0027s like the 30mm cannons had to be placed and edited one by one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMore detail will be given on release.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd now for the other sea-plane. This one was a solo project, so that\u0027s why it has so much detail and such a high part-count...it just wasn\u0027t designed to operate with other crafts around it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe design of this one is quite heavily based on the old British \u0022Supermarine Stranraer\u0022, a twin engined bi-plane flying boat, that if i remember correctly, didn\u0027t do so well and was quite unpopular at first.\n\u003C/p\u003E\n\u003Cp\u003E\nBut, i really like the design of it, and a lot of other bi-plane type sea-planes from the same era.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022byZrmEQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/byZrmEQ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThis one carries the colors of the Search and Rescue squadron.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022nPdMGU3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/nPdMGU3.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229lPLkp8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9lPLkp8.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n(i lost the nose-turret during that landing)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOh, and btw, i think that all the sea-planes in this project will be custom designs. I just have so many good ideas in my head, and i can still remember all the troubles i had with my old Catalina like sea-plane...missing engines and upside-down explains it pretty well \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-22T11:02:51Z\u0022 title=\u002209/22/2018 11:02  AM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 22, 2018\u003C/time\u003E by kapteenipirk\u003C/strong\u003E\n\u003C/span\u003E\n"}]}