{"TopicId":178311,"ForumId":44,"TopicTitle":"Ascent Profile","CreatedByName":"Spaced Out","CreatedById":178039,"CreatedDateTime":"2018-09-15T01:49:11Z","PageNum":1,"Articles":[{"CreatedByName":"Spaced Out","CreatedById":178039,"CreatedDateTime":"2018-09-15T01:49:11Z","Content":"\n\u003Cp\u003E\nAre these the criteria for the nost efficient ascent profile possible?\n\u003C/p\u003E\n\u003Cp\u003E\n1. It is a gravity turn to reduce cosine losses.\n\u003C/p\u003E\n\u003Cp\u003E\n2. You want to be turning horizontally at a rate where you get as close as possible to failing due to heat or aerodynamic stress or to your safety parameters for those things so that you reduce gravity losses for the entire flight. This is because the more horizontal you are at any point, the less of the delta-v you are putting in is able to be taken by gravity, and as you turn less of your delta-v is used for vertical velocity which isn\u0027t needed for getting into orbit, so more of your delta-v is used for horizontal velocity which is all you need for orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n3. You only want to throttle at Max-Q during the beginning of ascent because that is the point with the most aerodynamic stress and drag, and both of those things go down very quickly after it. And if you throttle any other time which would probably not be necessary, you lose delta-v from gravity.\n\u003C/p\u003E\n\u003Cp\u003E\n4. You want to be at full throttle because you are unlikely to hit terminal velocity during the slow parts of ascent in the low parts of the atmosphere, and not in the high parts either because the atmosphere thins so much and until you are mostly horizontal you just waste delta-v to gravity by throttling which is worse.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I got anything wrong please tell me, and if you have any other insight please tell me that also.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso are there any scenarios where another sort of ascent profile is better than a gravity turn too?\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-09-15T02:13:20Z","Content":"\n\u003Cp\u003E\nThis will generally put you in the ballpark. Exact optimization has a pretty weird profile of thrust and pitch which will depend on a whole bunch of factors, including how your engine\u0027s I\u003Csub\u003ESP\u003C/sub\u003E varies with altitude and when your staging kicks in.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only way I know to get the correct profile for a specific rocket is to have a good simulation and run optimization on it. There was a thread here very long time ago where several optimization strategies were used. Personally, I tried out a genetic algorithm, which gave decent results, but using splines and running a generic multivariate optimization seemed to work better.\n\u003C/p\u003E\n\u003Cp\u003E\nLosses of the \u0022good rule of thumb\u0022 ascent vs optimized solution are pretty minimal, though. So in KSP, I wouldn\u0027t bother. In the real world, there could be any number of more important constraints, like reducing max dynamic pressure, giving better abort opportunities, etc. So you\u0027d probably design around these, rather than chase after fuel-optimal solutions.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaced Out","CreatedById":178039,"CreatedDateTime":"2018-09-15T02:29:19Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257710\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0022 rel=\u0022\u0022\u003E@K^2\u003C/a\u003E Are there any sort of simulation websites or tools I could use to try out exact optimization just because?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso if you don\u0027t mind could you elaborate more on the first part of your reply? I\u0027m just a bit curious about this part.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2018-09-15T09:36:35Z","Content":"\n\u003Cp\u003E\nAfter max Q you want full throttle until g forces get to high because your rocket weight goes down. \u003Cbr\u003E\nAnd yes lots of other factors like if upper stage is weak you might have to do less gravity turn and lob upper stage higher so it get long enough time to burn before reentering. \u003Cbr\u003E\nThis is also an thing in KSP if you launches huge interplanetary ships with low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E, they need enough time to circulate \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-09-17T04:10:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223451481\u0022 data-ipsquote-contentid=\u0022178311\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536978559\u0022 data-ipsquote-userid=\u0022178039\u0022 data-ipsquote-username=\u0022Spaced Out\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/14/2018 at 7:29 PM, Spaced Out said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257710\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0022 rel=\u0022\u0022\u003E@K^2\u003C/a\u003E Are there any sort of simulation websites or tools I could use to try out exact optimization just because?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso if you don\u0027t mind could you elaborate more on the first part of your reply? I\u0027m just a bit curious about this part.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNone that I know of. Everything we\u0027ve used in our experiments was either written from scratch in C/C\u002B\u002B or in something like Mathematica/Matlab/Octave. You could probably get good results with something like SciKits in Python, but I\u0027ve never used these in this kind of context. Regardless, it\u0027s unlikely you\u0027ll find something that just works out of the box. You\u0027ll need to be comfortable with programming, have some basic understanding of simulation and numerical integration, and various optimization approaches. This is the kind of problem that gives a phrase, \u0022this isn\u0027t rocket science,\u0022 it\u0027s meaning. This is definitely rocket science. Of course, not doing it to aerospace precision standards makes it a bit easier, but only so much.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what we\u0027ve seen, is that in an unconstrained \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E problem, the rocket \u0022likes\u0022 to lift off at \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of about 2, throttle up to 3 as it begins gravity turn, and then cut back almost to zero and coast until close to parking orbit, at which point it throttles up to 100% until circularized in the parking orbit. It\u0027s not that different from what people usually do in KSP, but naive expectation would have been more consistent use of the engines during ascent.\n\u003C/p\u003E\n\u003Cp\u003E\nAdding dynamic pressure limits, staging, and available throttle bands for each engine makes the solution a lot more exciting, of course.\n\u003C/p\u003E\n"}]}