{"TopicId":179419,"ForumId":44,"TopicTitle":"Special Relativity Questions","CreatedByName":"HeliosPh0enix","CreatedById":181527,"CreatedDateTime":"2018-10-31T02:10:36Z","PageNum":1,"Articles":[{"CreatedByName":"HeliosPh0enix","CreatedById":181527,"CreatedDateTime":"2018-10-31T02:10:36Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to get a better understanding of special relativity and had a few questions I was hoping some helpful forum users could answer.  First off, suppose I am moving at 0.5c relative to the earth.  If I shine a light directly ahead of me, one would think it would appear to move at 0.5c relative to me because that would make its total velocity relative to earth equal to c.  However, according to what I have learned, that does not seem to be true.  To me, the light will still appear to be moving at c, which would make its velocity relative to the earth 1.5c, which is impossible.  How does the speed of light relate to these difference frames of reference?  Secondly, it is my understanding that mass (or apparent mass) increases as matter gets closer to the speed of light.  There seems to be a contradiction when this is in a different reference frame, however.  Say a spaceship is traveling at .99c relative to earth.  Now say a smaller ship comes out of its cargo bay and starts to accelerate.  In its frame of reference, the smaller ship will appear to be accelerated from a standstill, so should not have to worry about increasing mass until it gets closer to its own relative speed of light.  However, from earth\u0027s frame of reference, it is already moving at extreme relativistic speeds so should find it nearly impossible to accelerate and encounter an asymptote with diminishing returns as it approaches the speed of light.  Which of these situations would actually happen, or is it some weird mix of the two?  My brain has been wired for Newtonian mechanics (too much KSP, yada yada) and I am just trying to build a better intuition and grasp on the concepts of special relativity and how it relates to light.  Thank you for your help, and please don\u0027t be (too) condescending about my lack of knowledge on the subject!\n\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2018-10-31T08:44:34Z","Content":"\n\u003Cp\u003E\nSpecial relativity is a difficult subject, doubt feel bad for not understanding it! I can\u0027t answer the mass question, but as to the speed of the light beam that you project in front of yourself, I believe that this is countered by time dilation. Basically, you will see the light moving at the speed of light away from you, but the Earth would see time slow down for you and the emitted photons, and that would mean that the photons move at the speed of light relative to earth as well. \n\u003C/p\u003E\n\u003Cp\u003E\nTLDR: Time dilation! \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-10-31T09:20:14Z","Content":"\n\u003Cp\u003E\nFirst: I am not a physicist and my understanding is probably not much better than yours.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat i think is that you see earth (or one of the frames) as an absolute reference frame. But that is not the case.\n\u003C/p\u003E\n\u003Cp\u003E\nTo transform one frame to another you must apply the Lorentz transformation to time dilation, relativistic mass, relativistic length and relativistic speed. The closer you get to c as a relative speed when transforming between two frames, the faster the term grows until it produces a division by 0 when c is reached. So, if you observe the dinghi that starts from a ship moving at 0.99c relative to earth (which makes the ship almost stand still when seen from earth due to time dilation) and the dinghi accelerates away from the ship to 0.9c relative to the mothership, it only accelerates 0.999c (or so) relative to earth.\n\u003C/p\u003E\n\u003Cp\u003E\nHope that wasn\u0027t totally nonsensical. Maybe one of our physicists shows up and clarifies \u003Cspan\u003E:-)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-31T09:25:57Z\u0022 title=\u002210/31/2018 09:25  AM\u0022 data-short=\u00225 yr\u0022\u003EOctober 31, 2018\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-10-31T09:23:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223478381\u0022 data-ipsquote-contentid=\u0022179419\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221540951836\u0022 data-ipsquote-userid=\u0022181527\u0022 data-ipsquote-username=\u0022HeliosPh0enix\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, HeliosPh0enix said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m trying to get a better understanding of special relativity and had a few questions I was hoping some helpful forum users could answer.  First off, suppose I am moving at 0.5c relative to the earth.  If I shine a light directly ahead of me, one would think it would appear to move at 0.5c relative to me because that would make its total velocity relative to earth equal to c.  However, according to what I have learned, that does not seem to be true.  To me, the light will still appear to be moving at c, which would make its velocity relative to the earth 1.5c, which is impossible.  How does the speed of light relate to these difference frames of reference?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBoth you and earth will observe light moving at c. When you move ar 0.5c relative to the earth, your time slows down relative to the earth, and the earth\u0027s time slows down relative to you. So, both of you will observe light speed at c. I dont want to type out all the equations, someone help me\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223478381\u0022 data-ipsquote-contentid=\u0022179419\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221540951836\u0022 data-ipsquote-userid=\u0022181527\u0022 data-ipsquote-username=\u0022HeliosPh0enix\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, HeliosPh0enix said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n  Secondly, it is my understanding that mass (or apparent mass) increases as matter gets closer to the speed of light.  There seems to be a contradiction when this is in a different reference frame, however.  Say a spaceship is traveling at .99c relative to earth.  Now say a smaller ship comes out of its cargo bay and starts to accelerate.  In its frame of reference, the smaller ship will appear to be accelerated from a standstill, so should not have to worry about increasing mass until it gets closer to its own relative speed of light.  However, from earth\u0027s frame of reference, it is already moving at extreme relativistic speeds so should find it nearly impossible to accelerate and encounter an asymptote with diminishing returns as it approaches the speed of light.  Which of these situations would actually happen, or is it some weird mix of the two?  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, again, time dilation makes earth (you) think that the spaceship has trouble accelerating.\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2018-10-31T09:48:04Z","Content":"\n\u003Cp\u003E\nFirst example:\n\u003C/p\u003E\n\u003Cp\u003E\nIn your own rest frame you can observe relative speeds between different objects greater than 1c. Easiest example is if you emit two photons in opposite direction. What you will not be able to observe is a speed greater than 1c relative to *yourself*.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond example:\n\u003C/p\u003E\n\u003Cp\u003E\nThis one is more interesting. Time dilation and length contractions are the items that are important here. For an observer outside the spaceship (observing the spaceship at 0.99 c) the smaller ship will expend a lot of energy to move just slightly faster. But much less time will seem to pass for the smaller ship than for the larger ship. So for the observer the ships will arrive at some distant target at almost the same time, but the crew of the smaller ship will have aged much less.\n\u003C/p\u003E\n\u003Cp\u003E\nFor an observer inside the spaceship, the smaller ship will have a larger relative speed but the difference in perceived time will be smaller. So for the larger ship the smaller ship seems to reach the target much faster.\n\u003C/p\u003E\n\u003Cp\u003E\nSo putting it in a simplified matter, in one frame (from inside the larger ship) the crew of the smaller space ship arrives at a younger age because they just got there a lot faster in the classical manner (assuming the relative speed is still small in relativistic terms). For the outside observer the ships arrive at roughly the same time, but the crew of the smaller space ship is still younger, but this time due to time dilation.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, this is a bit simplified as I do not define the target and the speed of this would need to be taken into account.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-11-01T09:33:05Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181527-heliosph0enix/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022181527\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/181527-heliosph0enix/\u0022 rel=\u0022\u0022\u003E@HeliosPh0enix\u003C/a\u003E i made a mistake answering the 2nd question.\n\u003C/p\u003E\n\u003Cp\u003E\nSince the spaceship is acceleratong, it will feel that it is moving at speeds.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth the cargo ship and earth will find it true that the ship is accelerating, and all physics laws (relativity) applies to it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-01T09:34:07Z\u0022 title=\u002211/01/2018 09:34  AM\u0022 data-short=\u00225 yr\u0022\u003ENovember 1, 2018\u003C/time\u003E by Xd the great\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-11-01T12:55:47Z","Content":"\n\u003Cp\u003E\nI\u0027m not a physicist either but I have put some thought into this.  Anyone else can feel free to jump in and help me out!  \n\u003C/p\u003E\n\u003Cp\u003E\nThe speed of light is constant for everyone evolved and there lies the tricky bit.  Say you wanted to go to Alpha Centauri 4 light years away but you only wanted to spend 2 years traveling there.  All technical aspects aside you can do this.  You calculate how much fuel you need to accelerate to 2c, light the fuse and away you go!  Newtonian physics works for you the same way it always seems to work.  You burn up the fuel, accelerate to 2c, Alpha Centauri in only 2 years... for you.   Now if you\u0027ve decided to drag race a photon from earth to Alpha Centauri you will be disappointed.  You back up a bit so you\u0027ve already accelerated to 2c when you pass the earth on your way to AC.  So there you are traveling past the earth at twice the speed of light!  Your ship is working perfectly at 2c, even the headlights and tail lights are working normally (despite what you might see out the windshield or rear view mirrors).  You blow right past the earth at 2c when the photon you are racing leaves the earth at the poky speed of only 299,792,458 meters per second.  You are traveling twice the speed of that photon but somehow it still passes you literally like you are standing still (at the speed of light).  Still according to your clock it takes only 2 years to get to Alpha Centauri but to folks back on earth it\u0027s taken the photon 4 years and even more than 4 years for you to get there.  That photon is going to beat you EVERY time and pass you at the speed of light no matter how much rocket fuel you burn up or how fast you are going, 2c, 20c, 20,000c.  You can not change your relationship to the speed of light but what can do is change your relationship to time and space.                \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2018-11-01T14:44:37Z","Content":"\n\u003Cp\u003E\nTwo notes: I\u0027d suggest reading Einstein\u0027s own description.  It helps to think of c as \u0022the speed of casuality (or time)\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other thing that I got wrong (for decades) was the idea of \u0022relativistic mass\u0022.  It works fine for special relativity, but really shouldn\u0027t be used (it doesn\u0027t work at all once general relativity is considered).  Momentum is still conserved, but forcing it to equal mass*velocity causes problems since such \u0022relativistic mass\u0022 doesn\u0027t create gravity quite the same way.  An easy thought experiment to prove this would be to imagine a spacecraft accelerating to the point it turns into a black hole to an outside observer, and returns to \u0022space\u0022 after decelerating (also consider how observers in multiple coordinate systems would view it), this is absurd and not how gravity works at all (although I have to take the word of other people who claim to be able to solve the equations.  I have zero tensor calculus).  I think all of Einstein\u0027s pre-general relativity work includes it, so the concept comes up a lot (and should be taken with a grain of salt when reading Einstein\u0027s own work (later explanations have the benefit of hindsight into Einstein\u0027s truly great work)).\n\u003C/p\u003E\n"}]}