{"TopicId":17979,"ForumId":16,"TopicTitle":"Minmus transfer burn.","CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-27T22:29:53Z","PageNum":1,"Articles":[{"CreatedByName":"99TheCreator","CreatedById":31144,"CreatedDateTime":"2012-08-27T22:29:53Z","Content":"\n\u003Cp\u003EWell, I have succesfully conquered the moon. But now its time to move on to bigger and better things. Okay not really bigger, Minmus is quite small, but better. I have been doing some testing and i think i found the rocket capable of reaching minmus. I just cant figure out when to begin the transfer burn. Got any ideas?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-27T22:37:20Z","Content":"\n\u003Cp\u003EI recommend you first make sure your orbit matches Minmus\u0027s inclined orbit, I like to aim a little off to the north or south, so I\u0027m on about the right plane.\u003C/p\u003E\u003Cp\u003EThen when you see that one extra bright star peek over the horizon, open the taps on your engines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jimbow","CreatedById":37863,"CreatedDateTime":"2012-08-27T22:42:48Z","Content":"\n\u003Cp\u003EI wait for Minmus to rise over the horizon then do a burn until my apoapsis to reaches the orbit of Minmus. When about half way there I either burn South or North until I encounter it. Just hope the moon stays out of the way or you end up been caught by it.\u003C/p\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2012-08-29T03:57:35Z","Content":"\n\u003Cp\u003EI get into a standard circular orbit around Kerbin. Then I go with my gut. If you look at the radius of Minmus\u0027s orbit around kerbin, you can use that to roughly guess where minmus has to be for your trip to be roughly equal in time for you to travel and for minmus to meet you. There is math for this, but I for one don\u0027t know what it is. I just guess by best judgement. \u003C/p\u003E\u003Cp\u003EThen its just burn till you get captured by minmus\u0027s sphere of influence (which is quite a bit smaller than the Mun\u0027s). Do your retrograde burn to complete your circular orbit around Minmus. Pick a good time and do a landing burn so you land in a lake. I promise you won\u0027t regret it, you probably don\u0027t want to land on a hill. I did my first time and hopping out tipped my ship over. Jeb is still stuck out there.\u003C/p\u003E\u003Cp\u003EThen you just have to get back.\u003C/p\u003E\u003Cp\u003EI\u0027ve done 4 trips so far off my guessing. The first time I missed and it took me 300 days to find a fix to get to minmus. The rest have made orbit on my first try.\u003C/p\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2012-08-29T04:01:28Z","Content":"\n\u003Cp\u003EOh! and my intial circular orbit I burn at 10 degrees off of 90 (can\u0027t remember which way) which does a lot to make me match minmus\u0027s orbit.\u003C/p\u003E\n"}]}