{"TopicId":180196,"ForumId":55,"TopicTitle":"Magnetic boots for EVA.","CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-11-29T23:05:25Z","PageNum":1,"Articles":[{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2018-11-29T23:05:25Z","Content":"\n\u003Cp\u003E\nWhile bouncing in low-g like the Apollo astronauts can be fun for the first thirty seconds, the trouble it causes outlasts the enjoyment. Players on low-g worlds like Minmus are heavily tempted just to use the jetpack rather than walk, and on Gilly walking is completely impossible. Wouldn\u0027t it be nice if the Kerbal could stick to any surface and walk on it? Even in the null-g of open space, your Kerbal can take a pleasant stroll on the hull of your spacecraft, and tiny worlds like asteroids and moons suddenly become way more livable. The camera would adjust to give a proper sense of direction.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I\u0027m suggesting that Kerbals on EVA should have magnetic boots that allow them to walk on any surface regardless of gravity -- of course, that means they could become SpiderJeb, but the devs could always make natural gravity, say, 1g, capable of overpowering the boots.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2018-11-29T23:21:49Z","Content":"\n\u003Cp\u003E\nMagnetic boots working on the hull, \u003Cem\u003EThe Expanse-\u003C/em\u003Estyle is something I\u0027m all in favor of.\n\u003C/p\u003E\n\u003Cp\u003E\nFor asteroids and moons... First, the inability to stick to the surface is what makes it a challenge (look how much problems we have in real life with landers on asteroids). And second, while realism is not a prime driver with KSP (and we need to be careful about \u0022realism for the sake of realism\u0022), it\u0027d just feel wrong to me.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s implemented, I\u0027d like to see it somewhere in the Alt\u002BF12 menu.\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2018-11-30T00:06:59Z","Content":"\n\u003Cp\u003E\nMagnetic Cramps for cargo would also be good. Still feels odd you need a docking port inside a cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"lunardog15","CreatedById":192528,"CreatedDateTime":"2018-11-30T02:01:08Z","Content":"\n\u003Cp\u003E\nthey could be called klaw boots\n\u003C/p\u003E\n"},{"CreatedByName":"Kroslev Kerman","CreatedById":191310,"CreatedDateTime":"2018-11-30T03:26:30Z","Content":"\n\u003Cp\u003E\ni think the Nitrogen jet pack is enough for me(the real life kerbal jetpack actually exist its called the safer its a Nitrogen as its fuel)\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-30T04:04:31Z","Content":"\n\u003Cp\u003E\nFirst thing to flash in my mind at walking on the hull of a ship in space was the scene in Star Trek First Contact when Worf, Picard and that other crew member whose name escapes me atm went eva on the hull of the Enterprise E to jettison the deflector dish before the Borg could establish an interplexing beacon. The idea of doing the same sounds awesome, but for non metallic surfaces like planetary bodies? No. The EVA jetpack is sufficient imho.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2018-11-30T07:35:31Z","Content":"\n\u003Cp\u003E\nYes for spacecraft parts, no for planetary bodies - besides, the jetpack on GIlly for example is a greeeeaaaattt way to get around. This would e more desirable if EVA propellant did not have infinite refills just by boarding and unboarding your kerbal (an old proposal is that any EVA propellant that you use comes from monopropellant stores of the craft that you board).\n\u003C/p\u003E\n"},{"CreatedByName":"Cassel","CreatedById":181728,"CreatedDateTime":"2018-11-30T13:21:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223496094\u0022 data-ipsquote-contentid=\u0022180196\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543536419\u0022 data-ipsquote-userid=\u0022118580\u0022 data-ipsquote-username=\u0022mattinoz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, mattinoz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMagnetic Cramps for cargo would also be good. Still feels odd you need a docking port inside a cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI love this idea. Magnetic cramps inside every cargo bay and magnetic cramp as part that can be attached anywhere.\n\u003C/p\u003E\n"},{"CreatedByName":"BGYT","CreatedById":159343,"CreatedDateTime":"2019-01-08T17:50:57Z","Content":"\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed2492048716\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/117892-wip-magneticeva-magnetic-boots-for-your-kerbals/\u0026amp;do=embed\u0022 style=\u0022height:225px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}