{"TopicId":180237,"ForumId":18,"TopicTitle":"Advice required!! Python or C# or C?","CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-12-01T14:05:31Z","PageNum":1,"Articles":[{"CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-12-01T14:05:31Z","Content":"\n\u003Cp\u003E\nSo, I have decided to master a programming language. However, I can\u0027t decide: Python or C# or C... Which is the hot commodity in the market? There are lots of programming genii here, so I will be glad if someone helps me out on this one...\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2018-12-01T17:09:21Z","Content":"\n\u003Cp\u003E\nc teaches good fundamentals, so its a good first language. python is good if you are going into any scientific field. c# is ok, but id rather use c\u002B\u002B. if you are going into programming, then learning as many programming languages as you can will help a lot. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T17:10:03Z\u0022 title=\u002212/01/2018 05:10  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2018-12-01T18:20:49Z","Content":"\n\u003Cp\u003E\nFor fun or to improve your job prospectives? It\u0027s always good to know multiple languages. It shields you better from automatically picking one solution, so consider that as well.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your interest is purely academic there\u0027s no better language than C. Nothing will teach you better how computers are programmed and how they work. The downside is that it\u0027s impossible to program in C without it getting very technical, you\u0027re constantly dealing with memory, pointer arithmetic and what not. If you like tinkering, that\u0027s a fun challenge. If you only want results, it can be frustrating.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your interest is \u0022I have a couple of real world problems that I want to fix myself\u0022 or \u0022I\u0027m looking to automate small parts of my job,\u0022 Python should probably be your first choice (disclosure: I am a Python programmer. But I\u0027m also trying to be unbiased here...). Python is very easy to learn and remarkably productive; if your goal is \u0022\u003Cem\u003EI receive a text file every day and need to turn it into a formatted Excel file\u003C/em\u003E,\u0022 Python is your friend as you\u0027ll have that coded in a matter of hours. It\u0027s also great as a first language as you can focus on programming concepts like branching and looping without having to struggle to make that work on a \u003Cem\u003Emachine\u003C/em\u003E. Personally I think that learning Python first will pay off learning C because you\u0027ll pick up things a lot quicker in C after that. Finally, don\u0027t underestimate Python\u0027s performance; 3/4 of the internet runs on Python these days (Facebook, Youtube, Instagram, Dropbox, to name but a few). For job searchng though, keep in mind that \u0022Python\u0022 itself is pretty useless; you need to demonstrate skills in a certain field like web development (Django), data science (numpy and Pandas), and so on.\n\u003C/p\u003E\n\u003Cp\u003E\nC# is a great language but I\u0027d only pick it if you\u0027re interested in a specific domain that C# is suitable for - generic applications in Windows, KSP mods (of course), etc. From a job market perspective you\u0027re probably better off with Java, that despite all the bashing is still the 800-pound gorilla in the job market. The two languages have a lot of shared concepts and switching between the two shouldn\u0027t be too hard.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10883-nuke/\u0026amp;do=hovercard\u0022 data-mentionid=\u002210883\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10883-nuke/\u0022 rel=\u0022\u0022\u003E@Nuke\u003C/a\u003E pointed out, learning multiple languages is very useful. It gives you a better perspective, and helps to think outside the box when confronted with a problem. Many books on general programming use examples written in C, Java or C\u002B\u002B so it doesn\u0027t hurt to at least be able to \u003Cem\u003Eread\u003C/em\u003E those (and reading code is usually harder than writing it).\n\u003C/p\u003E\n\u003Cp\u003E\nMy personal advice: start with Python, you\u0027ll get quick results. Even if you stick with Python, at least work your way through Kernighan \u0026amp; Ritchie\u0027s \u003Cem\u003EThe C Programming Language\u003C/em\u003E; it\u0027s a classic, and it will give you a much better feel for how computers operate which is never a waste. From a job market perspective, learn Java, or specialize in some kind of Python framework like Django or Pandas. In all cases, showcase your work through projects on Github; it\u0027s easier to convince prospective employers of your skill with actual projects you finished.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally if you\u0027re in an office job right now and want \u0022just some programming skills to improve my position,\u0022 seriously consider \u003Cem\u003EVisual Basic for Applications \u003C/em\u003Eif you\u0027re in a Microsoft Office environment. Don\u0027t start with it (I still recommend the Python/C trajectory for that). It\u0027s outdated and ugly, and I feel like I need to wash my hand every time I\u0027ve touched code in it. But it tends to work in the most restrictive environments, runs on a platform that is nearly always available (at least in corporate office environments) and it can catapult your position from a mere desk-jock to a nearly untouchable status (I work in an industry that has laid off or off-shored 75% of its workforce, and through half a dozen reorganizations I\u0027ve never felt insecure about my job position). It doesn\u0027t get a lot of respect inside the programming world, and the ROI is low (VB is easy to learn, but mastering the object models of the various platforms like Excel and Access takes effort and is key to your skill set) if you pursue a job as a coder, but high if you\u0027re a business analyst who wants to advance their skills.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2018-12-01T19:25:32Z","Content":"\n\u003Cp\u003E\nI prefer C, and have used it quite often for personal projects.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I find that more often I now turn to Python.\n\u003C/p\u003E\n\u003Cp\u003E\nI think \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/78303-kerbart/\u0026amp;do=hovercard\u0022 data-mentionid=\u002278303\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/78303-kerbart/\u0022 rel=\u0022\u0022\u003E@Kerbart\u003C/a\u003E above covered it pretty well.  It really depends on what you want out of the experience.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2018-12-01T21:34:23Z","Content":"\n\u003Cp\u003E\nFull disclosure, I\u0027m not a programmer. I do, however do some programming for my work related suff.\n\u003C/p\u003E\n\u003Cp\u003E\nThe very first program I wrote that had an intended use, other than being purely academic, was written in C#, about eight years ago. The little thing is still used today at my work. It\u0027s a tiny, but marvelous time saver program that does some brute force combinatorial calculations. Incidently, it is also the last program I wrote in C#.\n\u003C/p\u003E\n\u003Cp\u003E\nNowdays, all my programming is in C/C\u002B\u002B since it all ends up in embeded microcontrollers.\n\u003C/p\u003E\n\u003Cp\u003E\nPoint being, the choice of language depends on intended use.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T21:35:00Z\u0022 title=\u002212/01/2018 09:35  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by Shpaget\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-12-01T23:02:28Z","Content":"\n\u003Cp\u003E\nLike others have said, for learning how to program C is a very good language. I only am a bit more optimistic for the productivity with C than with Python once you got the hang of it and use libraries. The step towards C\u002B\u002B is still difficult afterwards, but whatever you do, you will always need the basics of dealing with memory, pointers and basic data structures. The graphics APIs OpenGL and Vulkan are C APIs.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me as hobbyist, if i had to start again, the question would rather be C/C\u002B\u002B or Java.\n\u003C/p\u003E\n\u003Cp\u003E\nMy choice fell on C/C\u002B\u002B 1,5 years ago because there are so many examples and so much free documentation and really good books. K\u0026amp;R as mentioned may be a bit outdated (C has evolved much since the 80s). The learning curve is steep, don\u0027t expect quick results if you\u0027re an autodidact. At least, C is not a mistake to start with as you will learn discipline and in the same time dirty tricks. Somebody wrote, it is punk rock. But at the same time is catching up towards the top again these days in the Tiobe index.\n\u003C/p\u003E\n\u003Cp\u003E\nC\u002B\u002B, if you manage it, together with the STL and standard library, is extremely productive.\n\u003C/p\u003E\n\u003Cp\u003E\nMay i ask, what is your plan ?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: i must add, i am a \u0022linuxer\u0022. Whole development environment and complete documentation comes for free. I did not touch Windows any more since Windows 7.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T23:14:24Z\u0022 title=\u002212/01/2018 11:14  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2018-12-01T23:56:17Z","Content":"\n\u003Cp\u003E\nAs mentioned so many times before; it depends on what you want to use it for. My personal choice was Python and I do think - similarly to what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/78303-kerbart/\u0026amp;do=hovercard\u0022 data-mentionid=\u002278303\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/78303-kerbart/\u0022 rel=\u0022\u0022\u003E@Kerbart\u003C/a\u003E said - it made me understand C code (for Arduino work at school) a lot faster than if I didn\u0027t learn Python first.\n\u003C/p\u003E\n\u003Cp\u003E\nI personally program very little of actual use, and that which I do is mostly just math - estimating Pi by simulating \u003Ca href=\u0022https://www.youtube.com/watch?v=RZBhSi_PwHU\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, generating factorials, prime numbers or the fibonacci series - or writing some programs intended as jokes.\u003Cbr\u003E\nPython is a lot faster to write than C or similar languages and this is reflected in the way I use it - quickly making a program for some very specific (mathematical) thing. It \u003Cem\u003Eis\u003C/em\u003E slower than C if I understood correclty, but still hundreds of thousands of times faster than doing the calculations by hand.\n\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2018-12-02T04:01:31Z","Content":"\n\u003Cp\u003E\nThe first thing you should ask yourself is: \u0022What would be most useful at work?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re working, that is. And if it\u0027s not, it\u0027s still a good question to ask.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me, while being more fluent in C or FORTRAN would be super swell, most of the real coding I do revolves around automating Excel tasks - the real tools we use are made by someone else. So VBA it is.\n\u003C/p\u003E\n"},{"CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-12-02T05:36:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497258\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543705348\u0022 data-ipsquote-userid=\u0022107381\u0022 data-ipsquote-username=\u0022Green Baron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Green Baron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMay i ask, what is your plan ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497107\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543688449\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nF\u003Cspan\u003E﻿\u003C/span\u003Eor\u003Cspan\u003E﻿\u003C/span\u003E fun or to impro\u003Cspan\u003E﻿\u003C/span\u003Eve your job prospecti\u003Cspan\u003E﻿\u003C/span\u003Eve\u003Cspan\u003E﻿\u003C/span\u003Es?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, I want to get in software development. I am pretty serious about it. A programming language that lets me stand out in the job market, while still being flexible enough to have fun with, will be the best pick for me. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s the learning curve of common programming languages? Like C,C\u002B\u002B,C#,Python,Lua...\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2018-12-02T06:27:49Z","Content":"\n\u003Cp\u003E\nStudent of computer science here.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d advocate C over Python, at least for your first language (you can learn Python later if you want to, of course). The reason I say this is that C, while not nearly as practical as Python for scripting, will actually teach you something about how computers work. Python is so complex and heavily abstracted that it\u0027s worthless as a tool for learning about computers. C, on the other hand, is a lot closer to the metal, and it\u0027s impossible to learn the language in any serious capacity without learning something about how computers work. Plus, since C is much simpler it\u0027s a lot easier to learn most of the language spec. Compare this to Python, which is so sprawling that I doubt that even the language\u0027s maintainers know the whole spec.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497408\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543728965\u0022 data-ipsquote-userid=\u0022183478\u0022 data-ipsquote-username=\u0022Nivee~\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Nivee~ said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, I want to get in software development. I am pretty serious about it. A programming language that lets me stand out in the job market, while still being flexible enough to have fun with, will be the best pick for me.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are lots of languages that companies are looking for; it really depends on what sort of software development you want to do. The only thing to do is to learn a bunch of them, figure out which ones you like and which ones you don\u0027t, and get really good at the ones you like. Getting a degree in computer science also helps; there\u0027s a lot more to writing software than just knowing a pile of programming languages.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2018-12-02T06:48:26Z","Content":"\n\u003Cp\u003E\nIf you want to know how computers work, assembly is unmatched.  It\u0027ll drive you insane, but you\u0027ll know exactly what\u0027s going on in the computer.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to learn how to program a computer, language isn\u0027t that big a deal.  You can write a program in most languages.  Some certain specific tasks might be easier or make more sense in one language than another, but it can be done in almost anything.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead, the key is to learn how to look at a problem, break it down into steps, logically work through it, and compare different solutions.  Once you understand why \u003Cem\u003Ethis\u003C/em\u003E sorting algorithm is better than \u003Cem\u003Ethat\u003Cem\u003E\u003Cem\u003E \u003C/em\u003E\u003C/em\u003E\u003C/em\u003Eone, the syntax of implementing it is less important.  Start learning how to do that, and then transfer your ideas into code, using whatever language you choose.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to get a marketable skill you can write on a resume, choice of language becomes more important.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-02T06:49:03Z\u0022 title=\u002212/02/2018 06:49  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 2, 2018\u003C/time\u003E by razark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2018-12-02T07:29:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497408\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543728965\u0022 data-ipsquote-userid=\u0022183478\u0022 data-ipsquote-username=\u0022Nivee~\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Nivee~ said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, I want to get in software development. I am pretty serious about it. A programming language that lets me stand out in the job market, while still being flexible enough to have fun with, will be the best pick for me. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nConsider Javascript. It\u0027s essentially impossible to migrate away from for infrastructural reasons, so tons of companies are stuck using it (including all the big ones of which you\u0027ve heard). Many are even using it outside the browser context thanks to NodeJS. It\u0027s not my personal favorite language, but it has probably the lowest barriers to entry for beginners, since you don\u0027t need any special tools to run a Javascript program other than your browser.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother candidate to take seriously is Objective C, for writing iOS apps. It\u0027s kind of a strange cousin of C\u002B\u002B. If you have an idea for a smartphone app, Objective C could serve you well.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u0027s the learning curve of common programming languages? Like C,C\u002B\u002B,C#,Python,Lua...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nC is good to learn, but I can\u0027t shake the feeling that there\u0027s something better for starting out nowadays. Maybe Go?\n\u003C/p\u003E\n\u003Cp\u003E\nC\u002B\u002B is the hardest to master. The most features and interactions between features, often implemented with quirks and gotchas to support legacy code. C\u002B\u002B conferences are full of presentations about how to do things that other languages take for granted (but with \u0022zero overhead\u0022). And bugs in C\u002B\u002B code can be difficult to fix.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, once you learn C\u002B\u002B, you\u0027ll feel comfortable in C#/Vala, Java, etc. They all follow the same basic paradigm of procedural object orientation, where code is organized into functions which are organized into classes, which relate to and build upon one another. Most large projects use this approach because it provides good tools for organizing code and breaking down big complex tasks into smaller ones. (E.g., KSP, (nearly) all KSP mods, and \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E are written in C# and are organized into lots of classes.)\n\u003C/p\u003E\n\u003Cp\u003E\nPython and Lua are a bit easier. They also use classes, but their syntax and runtimes tend to be friendlier and more complete, so you don\u0027t have to do quite as much work to accomplish simple things.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s healthy to mix in other kinds of languages once in a while. Haskell is quite different from all of the above, usually in good ways, and it can force you to write better code. Once you get used to Haskell, you\u0027ll start to notice things you can improve while working in other languages based on that experience (it makes you feel guilty for using side effects).\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, a quick plug for Perl and Bash, which have both served me quite well over the years. They\u0027re \u0022close to Unix\u0022 the way C is \u0022close to the hardware\u0022, so if you need to manipulate files or strings on a server somewhere, it\u0027s invaluable to be able to whip up a quick Perl or Bash script.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-02T16:34:48Z\u0022 title=\u002212/02/2018 04:34  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 2, 2018\u003C/time\u003E by HebaruSan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-12-02T09:48:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497408\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543728965\u0022 data-ipsquote-userid=\u0022183478\u0022 data-ipsquote-username=\u0022Nivee~\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Nivee~ said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u0027s the learning curve of common programming languages? Like C,C\u002B\u002B,C#,Python,Lua...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is a personal thing and depends on your time and abilities. Lua is a scripting language on its own but also meant to be included in your C/C\u002B\u002B projects.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the path to programming is long and many do this, most of them with an actual degree at the end. Expect competition. If you have a plan on what to actually program that\u0027ll make things easier for you once you are through with the basics.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are eager and doing this on your own just start. Set up a linux pc and get going. Nice thing is you get everything for free, the most actual compiler, editors en masse, linker, assembler, libraries, documentation and a huge helpful community. All the scripting languages you mentioned and many more come for free as well. Python in different versions, Lua, Perl, with a finger snip (like \u0022sudo apt-get install python3.7\u0022). Even C# is available and Go too. If you\u0027re tired of an editor or ide, get another.\n\u003C/p\u003E\n\u003Cp\u003E\nInstall the languages you want (that\u0027ll be \u0022sudo apt-get install gcc g\u002B\u002B\u0022 for C and C\u002B\u002B) and off you gp.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, the learning curve of C may be among the lowest as it does not overwhelm you at the start with objects, inheritance, polymorphism, template programming, prefabricated data structures like stack, queue, sets, maps, lists and whatnot that a beginner has no idea of how to use them. A simple C program has a header, a main routine and several functions to call. Can be mastered and understood in a shorter time, i think, and automatically opens the path to higher things. Whole operating systems are written in C.\n\u003C/p\u003E\n\u003Cp\u003E\nJust start :-) \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-02T09:52:26Z\u0022 title=\u002212/02/2018 09:52  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 2, 2018\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2018-12-02T11:19:57Z","Content":"\n\u003Cp\u003E\nSomething interesting you might keep in mind for later is the fact that Lua and C get along \u003Cem\u003Every\u003C/em\u003E nicely. If you want to learn a low-level (adjust the scale above assembly \u003Cspan\u003E\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E) \u003C/span\u003Elanguage and a high-level one for their respective benefits, this might be a good pair to consider.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to learning curves: There\u0027s a certain initial investment you have to put forth: overall syntax, flow control, memory management or types or what-have-you depending on the features left up to you and the features abstracted away, but once you have a grasp of the way the language is written you can just look at the docs to find specifics for whatever you need. The main thing is to get a solid foothold on the language, and then grow at the pace of the problems you want to solve. Overall, it doesn\u0027t much matter what language you learn first, so long as you learn it. Your second language will be much easier—you may even be able to learn it by analogy with your first one (\u0022oh, so that\u0027s how they index their arrays\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\nSpeaking of which: If you\u0027re looking for problems to solve, I recommend \u003Ca href=\u0022http://projecteuler.net\u0022 rel=\u0022external nofollow\u0022\u003EProject Euler\u003C/a\u003E. It\u0027s effectively an aggregate of progressively more maddening math problems, ranging from the trivial to the incomprehensible, written in a way which strongly encourages you to solve them computationally.\n\u003C/p\u003E\n"},{"CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-12-02T13:15:17Z","Content":"\n\u003Cp\u003E\nWoah! Thanks!! Those are lots of opinions, but I think I have a solid idea now as to how I should proceed!\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497473\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543744129\u0022 data-ipsquote-userid=\u0022107381\u0022 data-ipsquote-username=\u0022Green Baron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Green Baron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust start :-) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s what exactly one of my friends said a couple hours ago! \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2018-12-02T15:52:47Z","Content":"\n\u003Cp\u003E\nFitting to the initial question of \u003Cspan\u003ENivee I\u0027m now wondering whether getting into this industry is a good decision or - conversely - it makes sense to pick up programming merely as a hobby.\u003Cbr\u003E\nI feel like programming is \u0022overhyped\u0022/underestimated in its complexity by the public. It\u0027s not easy - it\u0027s a pain in the bottom, especially if you just began this trip to hell and insanity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESo does it even make sense to pursue a professional career?\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-12-02T16:20:34Z","Content":"\n\u003Cp\u003E\nHobby and job aren\u0027t necessarily converse. At that early stage nobody can say if it makes sense. But one should encourage people who try to do something new. Maybe it works out, maybe not. I know a guy who did an ATPL at the age of 40 and got employed. I studied prehistory at ~ the same age and could have done something had i wanted to. It always makes sense to pursue something not totally impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nI programmed one or two (hobby) things around 25-30 years ago (C) and just a short time ago (1,5 years) got back to it. Because of what i did in between i had forgotten everything. Including what a stack is for example. I also wasted much time running in the wrong directions. I am now doing a naive renderer for myself, and many examples i see in the open source community are far better than what i will ever accomplish in this life. Yet i don\u0027t think it is a pain in wherever, it can be fun and rewarding, and as frustrating as any complex waste of time can be.\n\u003C/p\u003E\n\u003Cp\u003E\nThere \u003Cem\u003Ewill\u003C/em\u003E be these std::chrono::moments when you can just std::throw that bloody machine out of the GlfwWindow-\u0026gt;getWindow(). A reason to take a break;, think it over, try and get help and then continue;.\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2018-12-02T17:36:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497587\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543765967\u0022 data-ipsquote-userid=\u0022173586\u0022 data-ipsquote-username=\u0022Delay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Delay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFitting to the initial question of \u003Cspan\u003ENivee I\u0027m now wondering whether getting into this industry is a good decision or - conversely - it makes sense to pick up programming merely as a hobby.\u003Cbr\u003E\nI feel like programming is \u0022overhyped\u0022/underestimated in its complexity by the public. It\u0027s not easy - it\u0027s a pain in the bottom, especially if you just began this trip to hell and insanity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESo does it even make sense to pursue a professional career?\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, the pay is good and the job prospects are better. So long as you enjoy programming for its own sake I\u0027d say it\u0027s a good idea. It\u0027s the latter point that matters - you can put up with how hard the work is if you like doing it. If you don\u0027t, a job in software is quickly going to turn miserable.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, as \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107381-green-baron/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022107381\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107381-green-baron/\u0022 rel=\u0022\u0022\u003E@Green Baron\u003C/a\u003E said, the best thing to do is to try it. If you like it, try it some more. It might lead somewhere.\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2018-12-02T20:08:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497587\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543765967\u0022 data-ipsquote-userid=\u0022173586\u0022 data-ipsquote-username=\u0022Delay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Delay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI feel like programming is \u0022overhyped\u0022/underestimated in its complexity by the public. It\u0027s not easy - it\u0027s a pain in the bottom, especially if you just began this trip to hell and insanity.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSome would say that\u0027s part of its charm. To put so much effort into a thing, and then watching as the computer comes to life and solves your problem… it\u0027s pretty good fun. And then, of course, something breaks and it\u0027s back to the debugger, but that just means you have more problems to overcome.\n\u003C/p\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2018-12-02T20:14:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497746\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543781315\u0022 data-ipsquote-userid=\u0022110660\u0022 data-ipsquote-username=\u00220111narwhalz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, 0111narwhalz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSome would say that\u0027s part of its charm. To put so much effort into a thing, and then watching as the computer comes to life and solves your problem…\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure, it\u0027s what I like about programming as well. Seeing the computer execute your own code is pretty satisfying.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s why I preceded it with something: The fact that I think programming is underestimated/played down as \u0022You write some stuff and the computer does it\u0022.\u003Cbr\u003E\nIt\u0027s a lot more complicated than it looks.\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2018-12-02T20:25:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223497756\u0022 data-ipsquote-contentid=\u0022180237\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543781692\u0022 data-ipsquote-userid=\u0022173586\u0022 data-ipsquote-username=\u0022Delay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Delay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s why I preceded it with something: The fact that I think programming is underestimated/played down as \u0022You write some stuff and the computer does it\u0022.\u003Cbr\u003E\nIt\u0027s a lot more complicated than it looks.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, no, that\u0027s \u003Cem\u003Eexactly\u003C/em\u003E what happens. The fun is in writing the right thing, so that what the computer does is what you mean for it to do.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2018-12-03T09:42:21Z","Content":"\n\u003Cp\u003E\nUltimately the language doesn\u0027t matter as much as being able to get things done, so learn whatever is easiest and most accessible first. It\u0027s developing the thought processes and mindset for programming that leads to good code (and good job prospects). Doing _anything_ and learning how things work is more important than mastering any specific language when starting out of the gate.\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-12-03T16:55:16Z","Content":"\n\u003Cp\u003E\nAlready provoked the first Segfault, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/183478-nivee~/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022183478\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/183478-nivee~/\u0022 rel=\u0022\u0022\u003E@Nivee~\u003C/a\u003E ? :-)\n\u003C/p\u003E\n"},{"CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-12-03T16:59:04Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107381-green-baron/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022107381\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107381-green-baron/\u0022 rel=\u0022\u0022\u003E@Green Baron\u003C/a\u003EWell, almost \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E! But I picked up a C  book and started doing stuff anyways! I am at arrays already, pointers look scary though...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIts like a snakey  feeling...like pointers are slytherins or something...\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, i had to look up google to know what Segfault is.. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2018-12-03T17:31:48Z","Content":"\n\u003Cp\u003E\nSoon your dreams compile without errors, you\u0027ll see !\n\u003C/p\u003E\n"}]}