{"TopicId":180225,"ForumId":51,"TopicTitle":"DOMA Arigato, Duna!","CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-11-30T23:50:01Z","PageNum":1,"Articles":[{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-11-30T23:50:01Z","Content":"\n\u003Cp\u003E\nIn this mission series, I\u0027ll be attempting the Duna Outpost Mission Architecture Challenge! I\u0027ll also be attempting the Insight challenge in my early colony.\n\u003C/p\u003E\n\u003Cp\u003E\nCraft files - note that practically all of these were modified fairly extensively after launch with \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E-\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E to accommodate their more glaring design flaws. These were launched without prior testing; buyer beware! Bring screwdrivers.\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-1: \u003Ca href=\u0022https://kerbalx.com/direstorm/Aries-Mk5-Duna-Rover\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/Aries-Mk5-Duna-Rover\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-2: \u003Ca href=\u0022https://kerbalx.com/direstorm/Deep-Space-Vessel-Artemis\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/Deep-Space-Vessel-Artemis\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-3: \u003Ca href=\u0022https://kerbalx.com/direstorm/SLV-3-Prospector\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/SLV-3-Prospector\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-4: \u003Ca href=\u0022https://kerbalx.com/direstorm/SLV-4-Rover-Hotel-52\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/SLV-4-Rover-Hotel-52\u003C/a\u003E.  Note that if I were doing this again, I\u0027d give SLV-4 a hard pass. Not worth the trouble. Use a dup of SLV-6 instead.\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-5: \u003Ca href=\u0022https://kerbalx.com/direstorm/SLV-5-Space-Truck-2\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/SLV-5-Space-Truck-2\u003C/a\u003E. I now realize that I probably could have swapped out all those food tins for a honeybadger large cargo or something similar. Next time.\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-6 \u003Ca href=\u0022https://kerbalx.com/direstorm/SLV-6-Rover-Mk-VI\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/SLV-6-Rover-Mk-VI\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-7: \u003Ca href=\u0022https://kerbalx.com/direstorm/SLV-7-Prospector-mk-VII\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/SLV-7-Prospector-mk-VII\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-8:\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-9:\n\u003C/p\u003E\n\u003Cp\u003E\nSLV-10\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EDOMA Achievement Scoring (Currently 22/30)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003ENote that the spacecraft for each achievement\u003C/span\u003E\u003Cstrong style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Emust be unique, or for modular designs must remain viable, at all times\u003C/strong\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003E.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EPresently implemented\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Contingency Plans\u0022: Complete achievements\u003Cspan style=\u0022color:#27ae60;\u0022\u003E \u0022\u003Cstrong\u003EBackup plan\u003C/strong\u003E\u0022\u003C/span\u003E, \u0022\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EDuna Space Station\u003C/strong\u003E\u003C/span\u003E\u0022, \u0022\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EDuna Space Bus\u003C/strong\u003E\u003C/span\u003E\u0022, and \u0022\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EPositive uplink\u003C/strong\u003E\u003C/span\u003E\u0022. Note that the spacecraft for each achievement\u003Cspan\u003E \u003C/span\u003E\u003Cstrong\u003Emust be unique, or for modular designs must remain viable, at all times\u003C/strong\u003E. This will prevent crew from becoming Over-Stressed.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003ECrew safety (\u002B3/6):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EInterplanetary expertise: All crewed interplanetary missions have at least two crew on board. (\u002B1) \u003C/strong\u003E\u003C/span\u003ESo far, so good.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EBackup plan: Duna outpost has a backup ascent system to return all kerbals to Duna orbit separate from the primary Duna ascent module. (\u002B2)\u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#c0392b;\u0022\u003E \u003C/span\u003ERover Hotel \u0022Bacchus\u0022 is now the contingency plan and can lift 40-ish kerbals at a time.\n\u003C/li\u003E\n\u003Cli\u003E\nEmergency Evac: if the \u0027Backup plan\u0027 ascent system is utilized with any kerbal on board. (\u002B3) Not presently implemented.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EMission robustness (\u002B6):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EDuna Space Station: Place a space station in orbit around Duna. The space station must have room for minimum of 3 kerbals (Habitation rule applies). (\u002B1)\u003C/strong\u003E\u003C/span\u003E - Done.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EDuna space bus: Deliver a fully reusable shuttle service to Duna that can ferry at least four crew between Duna\u0027s surface and Ike\u0027s surface (refueling permitted). (\u002B2)\u003C/strong\u003E\u003C/span\u003E Aries Mk5 rover accomplished this on Y2 D173.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EDeep space transit: Implement a fully reusable crew transfer vehicle that can complete a Kerbin \u0026lt;-\u0026gt; Duna round trip without refueling (either direction). Must be capable of carrying a minimum of 4 crew. (\u002B3) \u003C/strong\u003E\u003C/span\u003E- DSV Artemis should qualify and has enough delta-V to likely only need refueling on Ike.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EScience! value (\u002B3/6):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022color:#27ae60;\u0022\u003EDeep space laboratory:\u003C/span\u003E\u003C/strong\u003E Duna outpost must include at least one Science Lab module. If \u0027Duna Space Station\u0027 is scored, it must also include a Science Lab module. (\u002B1) - Completed Y4 D116\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EEarly mission prestige: Safely return at least two kerbals to Kerbin\u0027s surface from a Duna mission before Year 5 Day 1. At least one of the crew members must have walked on either Ike or Duna and return a surface sample with them. (\u002B2)\u003C/strong\u003E \u003C/span\u003E- Completed Y4 D13\n\u003C/li\u003E\n\u003Cli\u003E\nBiome diversity: Return surface samples from at least five of Duna\u0027s biomes. (\u002B3) *This can be done all at once or separate. If scored, \u0022Early Mission Prestige\u0022 sample\u003Cspan\u003E \u003C/span\u003E\u003Cem\u003Edoes not\u003C/em\u003E\u003Cspan\u003E \u003C/span\u003Ecounts toward the five. - In Progress: Sample progress 3/5\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EAdvanced mission objectives (\u002B6/6):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EKerbin space station: Using SLV launch(es), place a space station in orbit around Kerbin. The station must support at least 4 kerbals and may be used as a staging platform for crew to and from Duna, although not required. (\u002B1) \u003C/strong\u003E\u003C/span\u003E- SLV-7 \u002B Prospector will remain in Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and shuttle fuel between Minmus and \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EPositive uplink: Place a minimum of three relay satellites in orbit around Duna and one around Ike. One of the Duna satellites must be in polar orbit. This also requires Advanced game setting \u0027Require Signal for Control\u0027 ON. (\u002B2) \u003C/strong\u003E\u003C/span\u003E- Complete.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EAdvanced deep space transit: If \u0027Deep space transit\u0027 is scored, it must support a minimum of 5 kerbals and refuel only in Duna \u003Cabbr style=\u0022border-bottom:none;\u0022 title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E (travels from Duna -\u0026gt; Kerbin -\u0026gt; Duna without refueling) (\u002B3)\u003C/strong\u003E\u003C/span\u003E - DSV Artemis should qualify.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003ESurface Mobility (\u002B6/6):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EAt least 50% of the Duna crew have access to a seat in a Basic Rover during their outpost surface mission. (\u002B1)\u003C/strong\u003E\u003C/span\u003E - Pressurived rovers count.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EEvery crew member has access to a Pressurized Rover seat. (\u002B2) \u003C/strong\u003E\u003C/span\u003E- Done\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003EThe outpost is land-mobile/Pressurized Rover (Habitation rule applies). (\u002B3)\u003C/strong\u003E\u003C/span\u003E Currently done, subject to change.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nFor the sake of my own sanity, I\u0027ll keep a text log here without pictures, so I have a record that\u0027s easy to look up.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 1, Day 1 - First crew transfer launch for science.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 15 - Second crew transfer launch for science. Rover test to get \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E science rolled over.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 29 - Third crew transfer launch for science. Did not reach space. Returned to runway with damage.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 40 - Standard Launch Vehicle 1 launched Duna Rover \u0022Aries Mk V\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 47 - Rover lands on Minmus. Crew is hungry. Resupply and refuel takes one day. Return will be via moon.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 64 - Rover lands on Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 68 - Rover leaves the Munar surface. I think there was probably a crew flight in here somewhere for a contract but I don\u0027t think I bothered to write it down.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 69 - Rover aerobrakes on Kerbin, but due to low heat tolerance still spends 500 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to circularize. Further missions beyond \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E are put on hold pending SLV 2 due to low \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. Crew transfer vehicle returned crew and science to Kerbin, and tourists toured the rover.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 80 - Second crew transfer vehicle acts as a resupply shuttle for the rover. For these resupply missions, snack supplies aboard the rover are locked and only resources from the resupply ship are being consumed, but no supply transfer takes place.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 133 - \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E rescue mission recruits a new engineer, pioneering a new class of ship called the \u0022Captain\u0027s Gig\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 139 - Resupply ship 2 is low on snacks and returns home. Snacks aboard the rover are unlocked until a new resupply ship can arrive.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 147 - Resupply ship 3 (CG-2) arrives at the rover. Snacks aboard the rover are again locked.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 200 - Resupply ship 4 (CG-3) arrives at the rover with tourists. CG-2 and Aries are docked to CG-3.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 226 - Standard Launch Vehicle 2 launched Duna Recon Orbiter \u0027Ezekiel\u0027, the Deep Space Vessel \u0022Artemis\u0022, two cube satellites \u0022Nehemiah\u0022 and \u0022Hosea\u0022 and two 4-man Duna Escape LifeBoats. Encounted Aries in orbit and went to Minmus for final refueling.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 235 - Second touchdown on Minmus. Refueling commences.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 242 - Minmus ejection burn.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 249 - Kerbin ejection burn to Duna. The unmanned Ezekiel and the cubesats separate from the deep space vessel, now called Expedition Aries. Aries crewmembers may become \u0022Over-stressed\u0022 between Y4 D40 and Y4 D249 depending on how launchd date is figured.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 305 - Expedition Aries does mid-course correction and collects 153 solar science.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 352 - Expedition Aries performs a second mid-course correction because Kerbals were eating 6 snacks per day instead of 3 snacks per day. Snacks adjusted to account for glitch; Kerbals now eat 4 snacks per day.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 412 - Standard Launch Vehicle 3 launched with the Prospector light miner, a science station and habitation pods.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 416 - Expedition Aries entered the Duna system ahead of schedule and made landfall on Ike. Began refueling operation (starting with Snacks!) and collected 1423 science for a total of 1576.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 419 - Prospector made landfall on Minmus and began refueling operation.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 430 - Ezekiel entered the Duna system and reached an equatorial orbit of 200/300km over Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 433 (Y2 D007) - Refueling on Ike complete. Aries rover and two lifeboats made landfall on Duna and began refueling operations. Collected 1229 Duna Highlands science plus 1981 Midlands science for a total of 4786.\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D027 Cubesat 2 \u0022Hosea\u0022 entered synchronous orbit to Ezekiel, trailing Ezekiel by about 800 KM. Hosea has line of sight to Ezekiel and extends amount of time equatorial bases remain in communications with Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D036 - Aries 15G \u0022Elisha\u0022 and Aries Scansat \u0022Daniel\u0022 entered the Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and parked in polar orbit over Ike and Duna, respectively. Daniel nets 50 science for scanning Duna and Aries collects 538 science scanning the Duna Lowlands for a total of 5368 science gathered for Insight.\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D051 - Prospector miner returns to orbiting science lab from SLV-3.\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D082 - Cubesat 1 \u0022Nehemiah\u0022 entered Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and parked in equatorial orbit. This completes \u0022Positive Uplink\u0022 and the \u0022Duna Insight\u0022 challenge. Final score for Insight is 528.4\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D172 - Standard Launch Vehicle 4 \u0022Rover Hotel-52\u0022 launches. Aries rover lifts off from Duna, leaving 2 crew behind in lifeboats.\n\u003C/p\u003E\n\u003Cp\u003E\nY2 D173 - Crew transfer between Aries and Artemis on Ike. Refueling commences. This proves the \u0022Duna Space Bus\u0022 accomplishment for the Aries.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EY2, D358 Standard Launch Vehicle 5 launched Space Truck 2. Moved Wave 2 to Minmus to begin fueling operations. Fleet currently has over 39,000 snack capacity, which should be enough for about 39 kerbals.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nY3, D117 - SLV 6 launched I guess? It was there when I got here, anyhow. Launched Aries for 6 days, leaving just Claufrod and Nelby on the ground while everyone else transferred food and a bit of fuel to Artemis for the long walk home.\n\u003C/p\u003E\n\u003Cp\u003E\nY3, D225 - Artemis departs Duna for Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nY3, D303 - SLV-7 launched. Prospector transfers snacks to SLV-7 and lands on Mun for refueling. Wave 2 (SLV 3, 4, 5, 6) departs Kerbin for Duna, minus Prospector who is staying behind to help fuel Wave 3.\n\u003C/p\u003E\n\u003Cp\u003E\nY4 D13 - Artemis re-entered \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and docked with SLV-7.\n\u003C/p\u003E\n\u003Cp\u003E\nY4 D95 - Aries lifts off from Duna, leaving 3 kolonists in a command rover behind.\n\u003C/p\u003E\n\u003Cp\u003E\nY4 D100 - Rover Hotel \u0022Bacchus\u0022 and Aries land on Duna. They begin refueling, which completes \u0022Backup Plan\u0022. 31 kolonists on Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nY4 D116 Rover Hotel \u0022Mars Technica\u0022 lands on Duna. This completes \u0022Deep Space Laboratory.\u0022 45 kolonists on Duna.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-10-11T03:13:50Z\u0022 title=\u002210/11/2019 03:13  AM\u0022 data-short=\u00224 yr\u0022\u003EOctober 11, 2019\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-01T05:15:57Z","Content":"\n\u003Cp\u003E\nMy first flight to Duna will more or less coincide with the first Duna transfer window. Per the DOMA rules, I\u0027ll have a nominal payload mass of 31 tons with a reusable Standard Launch Vehicle. The Launch Vehicle has a turnaround time of 186 days, so my first flight won\u0027t leave until at least day 226, probably more like Day 240-260 due to \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E operations on Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition to the standard DOMA and Duna Insight challenge restrictions, this will be a career mode campaign. I gave myself initial seed funding of 10 million credits, as well as 5000 science. This is enough to get some fancy engines and the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E technology, but I will be unable to unlock other end-game science nodes until after my first launch gets me some science.\n\u003C/p\u003E\n\u003Cp\u003E\nI can also send Crew Transfer Vehicles to anywhere within Low Kerbin Orbit up to an altitude of 180km, allowing me to gain near-Kerbin science and complete contracts (like \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E rescue contracts for crew members). This also lets me train all my crew to one star. Simply to make sure I don\u0027t abuse the crew transfer too much, I\u0027ll limit myself to one \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E / JATO per week, with an additional one-week downtime if I fail to return the craft to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E or damage it. So I can send one JATO on day one, one on day 15, and so on (my first one splashed down just off the coast of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. It just grabbed some low-altitude and high altitude science to help me grab a couple more nodes before my first SLV launch. I tried to reach orbit, but it didn\u0027t quite make it.). My next launch will probably be a ground crawler for near-\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E ground science and some near-\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E for more funds on day 15, followed by a training flight to get my first crew to one star on day 22 or 29.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first thing I did was upgrade my Space Center using about 4 million of my seed funds. The launchpad and science center are level 3, but everything else is level 2 for now. I may need to upgrade the tracking center to help maintain contact to Duna, but I won\u0027t do that quite yet.\n\u003C/p\u003E\n\u003Cp\u003E\nThe plan for my first launch is a crawler and near-\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E exploration vessel. Its mass on the launchpad is 30.962 tons - bearing in mind our maximum payload mass is 31 tons. But first, I need to get enough near-Kerbin science to research a seismic accelerometer for the Insight challenge! I might need to shuffle the payload on my probes a bit to make room.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rover will launch on day 40.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst launch is success!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qQouI4M.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/qQouI4M.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe landed the SLV upright 43.4 KM from the Space Center with no damage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VnXPaN2.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/VnXPaN2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNote the final iteration of the SLV has payload tanks to allow samples to be returned to Kerbin for money; however on this first flight those tanks will be empty.\n\u003C/p\u003E\n\u003Cp\u003E\nTransfer to Minmus will take the lander 5 days. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180954-prvdancer85/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022180954\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180954-prvdancer85/\u0022 rel=\u0022\u0022\u003E@PrvDancer85\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DMSwIdC.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/DMSwIdC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce landed, we will refuel the Aries Mark 5 and resupply it using potatoes grown in the low-G environment of Minmus in preparation for its full complement of 8 Kerbals. However, it\u0027s unable to hold enough food, even with recycling, to keep all 8 kerbals fed for the entire duration of a Duna transfer, even though it has sufficient delta-V to make the transfer. We\u0027ll have to wait for launch 2 with an interplanetary cargo stage which can carry the vast quantities of Snacks the kerbals require. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-13T10:30:35Z\u0022 title=\u002212/13/2018 10:30  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 13, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-01T08:07:53Z","Content":"\n\u003Cp\u003E\nPrevious iteration of the craft. It evolved quite a lot- one version weighs ten tons and assumes a mission will include several of them, but testing showed that regardless of whether multiple units were better in theory, managing the fleet quickly became tedious and having just one per mission increases the chances that I\u0027ll actually do all the things I need to do for each craft to complete a successful mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227ZyVTS0.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/7ZyVTS0.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd the later version successfully landed on Minmus! The initial craft had about 1500-1600 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E and the \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E map suggested I needed about 1270 to get from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E to Minmus surface, so I should have had loads of \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to spare, but I actually ran out of fuel just above the surface and going about 20 meters per second. Luckily my craft is pretty sturdy, and although I bounced twice I was able to keep my wheels down -- testing on the runway on Day 15 showed that a rollover with this craft at that speed is catastrophic on Kerbin, resulting in the destruction of engines, probes and radiators. Minmus is probably a bit more forgiving about the damage but it\u0027s also a lot harder to effect repairs on whatever damage I do take.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbonauts on this slope have an unfortunate tendency to glitch through the ground and explode, and I feel fully justified in quickloading when that happens. I don\u0027t think I have any mods that affect ground physics in that way (maybe \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E?) -- I think that\u0027s a stock glitch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tcbdtBV.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/tcbdtBV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso had an issue en route with Snack supplies. The vessel launched with about 100 snacks and 3 crew, which should have kept them happily fed for the entire trip (Kerbals eat about 3 snacks per day) -- note that we\u0027re producing more food on day 8. However, they ran out of food roughly two days out from Minmus, and the error message suggested there might be a stowaway aboard -- although I only brought three crew, the captain reported missing food for five kerbals!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T08:11:30Z\u0022 title=\u002212/01/2018 08:11  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrvDancer85","CreatedById":180954,"CreatedDateTime":"2018-12-01T10:47:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223496835\u0022 data-ipsquote-contentid=\u0022180225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543641357\u0022 data-ipsquote-userid=\u002212239\u0022 data-ipsquote-username=\u0022dire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, dire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTransfer to Duna will take the lander 5 days. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180954-prvdancer85/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022180954\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180954-prvdancer85/\u0022 rel=\u0022\u0022\u003E@PrvDancer85\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou ment minmus right? And with landing and kerbin return the mission will take over 10 days. \n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-01T11:00:52Z","Content":"\n\u003Cp\u003E\nI did mean Minmus, sorry. *stealth edits* The return craft has onboard life support systems, which it refuels with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E on Minmus. That\u0027s the green wedge-looking semicircle about 2/3 of the way back on the top of the craft. With MKS not functioning for my game right now and therefore hab time not being an issue, and using the Snacks life support mod, the craft is entirely self-sufficient while landed until the onboard nuclear plant runs out of fuel in about 14 years for its full rated crew of 8 kerbals (simulating hab time by giving every kerbal two seats).\n\u003C/p\u003E\n\u003Cp\u003E\nI thought the SOS challenge was to just get to Minmus within the time limit; once rescued the kerbals use the rescue craft\u0027s life support. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want a real Minmus race, you should challenge people to get there and back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E within seven days. To complete THAT challenge this craft would need to launch with full tanks rather than empty ones (its mass with -just- enough fuel to land on Minmus is 30.9\u002B tons out of 31 tons for my nominal payload, vs 41 tons fully laden) and I\u0027d want to switch out all the probes for more lithium tanks. If it had another 4 tons of wet lithium tankage it\u0027d probably have on the order of 3000 delta-V.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T19:12:33Z\u0022 title=\u002212/01/2018 07:12  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrvDancer85","CreatedById":180954,"CreatedDateTime":"2018-12-01T11:39:40Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/12239-dire/\u0026amp;do=hovercard\u0022 data-mentionid=\u002212239\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/12239-dire/\u0022 rel=\u0022\u0022\u003E@dire\u003C/a\u003E it\u0027s not my challenge and i\u0027ve no clue about mods. However i will follow your missionreport, maybe i learn some stuff about mks\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-01T20:50:25Z","Content":"\n\u003Cp\u003E\nSorry, my mistake.\n\u003C/p\u003E\n\u003Cp\u003E\nSwinging the rover past the Mun for fun and science on my way home, which really kills my round trip time but allows me to circularize to an equatorial Kerbin orbit by landing on the Munar equator from a polar orbit and then launching again after I\u0027ve fueled up. I might be stuck in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E until my second SLV launches, though, as I\u0027m not sure I have enough fuel capacity to leave the munar surface, get to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and then land back on Minmus all on one tank of gas.\n\u003C/p\u003E\n\u003Cp\u003E\nI also learned that Lithium seems to refuel many times faster than \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E, though, which simplifies logistics. I think going forward I\u0027m probably going to focus on VASIMIR-type engines despite their absurd power requirements, with \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E backups, instead of \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E mains and VASIMIR backups like my rover has.\n\u003C/p\u003E\n\u003Cp\u003E\nThis screenshot is mission day 24 for the rover.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wbEjFrM.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/wbEjFrM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-01T20:50:55Z\u0022 title=\u002212/01/2018 08:50  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 1, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-02T00:57:16Z","Content":"\n\u003Cp\u003E\nAerobraking maneuver from the Mun...again...and again...six aerobraking passes (I think? I kinda lost count) in total, just scraping the atmosphere from 50-55km because the relay dish on my probe, in particular, just could not take very much heat. Bill was able to stow a couple of solar panels prior to reentry which were not foldable (there was a menu option to fold them, but it doesn\u0027t seem to have worked).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Ov9tPRN.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022Ov9tPRN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up, sending a boatload of tourists onto the vessel in order to tour it for massive funds, and shuffling the crew so the heroes can spend some time back on Kerbin before shipping out to Duna. My delta-V coming back from the Mun was about 1400 (the VASIMIR engines really confuse \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E) but I spent so much fuel on aerobraking that I will have to wait for SLV 2 for my next trip to Minmus. I really regret having my center fuel segment be \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E, I think at this point I would much rather have a 2.5m lithium tank there (although that would probably have made aerobraking even more painful. I can repaint the Karibou part, but not to Lithium. I swapped it over to ore, since I can process ore into Lithium; I think that\u0027s a reasonable compromise for now.\n\u003C/p\u003E\n\u003Cp\u003E\nI am making notes on how the rover performs because I do expect SLV number 3 to be a more-or-less identical rover, with some minor changes based on my notes. Possibly SLV number 6 also.\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-03T07:42:05Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022305wCZX.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/305wCZX.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTourists made it up without a hitch, although I had to iterate the craft a number of times to get a delta-V figure I was happy with in orbit. Even so, it ran out of oxidizer while deorbiting, and instead of landing at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E I splashed down 454 km off the coast with no damage. Other thoughts on the craft: It\u0027s got plenty of food and elbow room for this sort of crew transfer, but it urgently needs solar panels; I ran out of electric charge while docking and couldn\u0027t replenish it. I think if I add drop tanks to the first four \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s it\u0027ll add enough delta-V to let me make encounters more easily; I wound up spending about 50 delta-V from my NPM, which is totally fine because I\u0027m not doing my next Minmus run until SLV 2 lifts off, but it still stings a bit. The craft has tons of drag on descent with airbrakes up and I felt like the reentry itself was very forgiving. I wound up with 900 liquid fuel after my oxidizer burnt out, which let me cruise for quite a bit but didn\u0027t make up for deorbiting to 53 km instead of 35 km. Now that I\u0027ve got Whiplashes unlocked I should swap out at least two of the Panthers, and that\u0027ll also help my ascent profile.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PiLNsQG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/PiLNsQG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe rover\u0027s jaunt through the near-Kerbin system netted about 3800 science, and the three crew members are my first two-star kerbals! Between the massively profitable \u0022Tour the Rover\u0022 contracts and all the near-Kerbin discovery and world firsts, I\u0027m sitting pretty at 7.8 million funds. \n\u003C/p\u003E\n\u003Cp\u003E\nBarring any juicy near-Kerbin contracts (another \u0022Tour the Rover\u0022 contract maybe?) my next launch is going to be SLV 2, the deep space vessel. I\u0027ve been tinkering with designs and at one point it started looking like the Starship Enterprise, but ultimately I think it\u0027s going to bear only a very passing resemblance. Engine nacelles are a must so it can tug assorted cargo on a rear dock, other than that we\u0027ll see what I come up with. I definitely value function over form, but I can maybe spare a couple tons on this launch to hide the really ugly stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/bExqQLP.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022bExqQLP.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAm thinking I might go for more of a star wars-y look. This version still has almost 4 tons for probes and reserve fuel, so that should be interesting. I think I\u0027m going to roughly estimate that each kerbal needs about a thousand snacks to get to Duna, which in theory should last them for over 300 days! In practice, I plan to also ship with a full ore hold that I can convert to food or fuel as needed, as kind of an insurance policy. The interplanetary vessel also *should* have enough recycling to give two kerbals \u0022free lunches\u0022, so in theory if I pack 6000 food I should have enough for eight kerbals to cycle over to Duna on my first transfer. I have just over 4000 food storage on the transfer vessel, and over 3000 on the rover itself, but after my math fell apart on my trip to Minmus I just have a hard time trusting my Kerbals not to eat themselves to death.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause my soil recyclers all seem to be hab modules, my deep space vehicle effortlessly fits five kerbals comfortably, or eleven in a pinch, and under normal flight conditions each crew member gets their own individual Buffalo Short Crew Cabin (except the pilot, who apparently sleeps in the cockpit). It\u0027s hard to compete with the Buffalo Short for recycler mass efficiency; it recycles 0.5 kerbal-waste-days per day (if I understand how soil works) and the cabin plus an airlock weigh just half a ton dry and can also store 600 snacks, which is enough for just about 0.5 kerbal-transfers! That means two short cabins should comfortably be able to transfer two kerbals to Duna. In theory, anyway. First I have to get SLV 2 into space and load my final crew complement. I\u0027m thinking Val and an engineer aboard the Diplomatic Vessel, and Bill, Bob, and Jeb on the rover plus a miner, a farmer, and a kolonist. Who is not dead weight, he is a morale officer.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-03T09:34:22Z\u0022 title=\u002212/03/2018 09:34  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 3, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-04T07:53:03Z","Content":"\n\u003Cp\u003E\nDay 80 - Recovered the tourist crew transfer vehicle, but realized that the new, larger crew for the rover are going to potentially eat all their snacks before SLV 2 launches and they can refuel on Minmus. So I sent another tourist bus up. Only two tourists, but it also has a whole heap of snacks to keep them happy until it\u0027s time to rock.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 133 - Sent a rescue vehicle into orbit to rescue Lanson Kerman, a level 0 engineer. It took some time to find a spaceplane configuration that I liked; I eventually re-used the big orange tank design I put on the tourist bus just to give it enough drop tankage to get to orbit and encounter. Turns out I gave it a little too much delta-V for its mission, but too much is much better than not enough, and I think I\u0027ll be using the Captain\u0027s Gig again Recovered it on the runway but lost a wheel somewhere along the way. I don\u0027t actually know where the wheel went but I\u0027m reasonably sure I started with 4 rear wheels, not 3. Recovered 68k credits from craft and I now have 7.98 million.\n\u003C/p\u003E\n\u003Cp\u003E\nHad to try re-entry twice because for some reason, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E remains on during plasma blackout, which drained all my batteries because it was fighting the air brakes. On the second round I turned \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off before plasma blackout and the air brakes actually did a good job of directing my nose off of prograde and keeping my nose (relatively) cool.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NkKDMk9.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/NkKDMk9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSLV 2 (31 ton NPM) will launch on day 226 (SLV 1 launched on day 40, plus 186 days for turnaround).\n\u003C/p\u003E\n\u003Cp\u003E\nDay 147 - Rotating out the shuttle providing food to the rover. as the shuttle\u0027s food is depleted. Rover has a skeleton crew eating their their NPM food from day 139 to day 147, but that shold be fine. Tourists return home. Funds go to 8.1 million as the shuttle is recovered on the runway with no damage. Airbrakes are definitely a \u0022get out of jail free\u0022 card for re-entry to Kerbin and I\u0027m starting to consider them essential for any spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iLjWjpU.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/iLjWjpU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAm thinking that in the future, two 2.5 meter hab modules or even three Mk 2 crew cabins will be a superior pick to the Karibou 10-man crew cabin, simply because the Karibou doesn\u0027t do soil recycling which the stock parts do, and I\u0027m starting to consider snacks to likely be the limiting factor to how many kerbals I can transport to Duna.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-04T09:06:35Z\u0022 title=\u002212/04/2018 09:06  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 4, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-05T07:14:40Z","Content":"\n\u003Cp\u003E\nRedesigned my Deep Space vessel again, by the time I actually launch it I\u0027m probably going to be up to about iteration 9 (or so). The reason for that is because I\u0027d really like my original 8 kerbals to stay down for more or less the entire duration (and not be so stressed out that they resign, so their score counts), and therefore I need to score \u0022Contingency Plans\u0022 on my first run, which is my lightest run and doesn\u0027t have any infrastructure in place (like a handy Deep Space Vessel to shuttle it around). \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003E\u0022Contingency Plans\u0022: Complete achievements \u0022Backup plan\u0022, \u0022Duna Space Station\u0022, \u0022Duna Space Bus\u0022, and \u0022Positive uplink\u0022. Note that the spacecraft for each achievement\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cstrong style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003Emust be unique, or for modular designs must remain viable, at all times\u003C/strong\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;text-align:left;\u0022\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis means that, to score Contingency plan on my first launch, I need the following:\n\u003C/p\u003E\n\u003Cp\u003E\n* An orbital space station capable of keeping three kerbals comfortable. Not sure whether it\u0027s required that this be manned to score other achievements, will have to ask. This can also be life support tankage on its maiden voyage, and it needs room to eventually include a science lab. My initial station will be very, very humble, providing little more than a bus stop for kolonists waiting for the bus down to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n* Duna Space Bus - A reusable vessel capable of lifting off from Duna and landing on Ike with four passengers, then refueling and landing back on Duna. My primary rover should be able to fill this role handily.\n\u003C/p\u003E\n\u003Cp\u003E\n* Backup Plan - Additional vehicles capable of returning all Duna colonists to orbit around Duna. I\u0027ve actually specially created some \u0022life boat\u0022 style ships that should handily fulfil this function. Since I hate wasting tonnage, they\u0027ll also act as soil recyclers and life support tankage on the trip over, allowing me to potentially ferry another pair of kerbals on my first mission. However, I only have life boats for eight kerbals, so my initial colony size is still limited to eight.\n\u003C/p\u003E\n\u003Cp\u003E\n* Positive Uplink - Four relay probes, including one around Ike and one in a polar orbit around Duna. This also requires probe communications enabled in the difficulty settings, which I have. The rover already launched with four probes, but dropped one as a relay around Minmus. In addition, SLV 2 is going to launch with a pair of cubesat relay probes which will be fueled on Minmus, then stay for the initial transfer burn to Duna before separating and making their own way. Hopefully at least one of them will be able to capture, otherwise I\u0027ll have to try and direct the Minmus probe to capture on Duna, and I\u0027m not sure it\u0027s able to do that. It has 1600 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and is already Minmus orbit, so we\u0027ll see, I guess. I have a hunch it\u0027ll be a pain to try to synchronize Minmus into a Duna launch window.\n\u003C/p\u003E\n\u003Cp\u003E\nRegardless, if the cube sats make it to Duna in time for the rover to relay through them, that should satisfy the requirements of Tier 2 of the Duna Insight Challenge. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0022 rel=\u0022\u0022\u003E@sturmhauke\u003C/a\u003E Not sure if the deep space vessel satisfies your definition of a Duna Recon Satellite; although it is capable of being a relay point. I could try to separate the rover from the DSV after the initial transfer burn and adjust the DSV to arrive first. They both should have enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to circularize, I would imagine.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrent nominal payload mass for SLV 2 is sitting at 30.989 (I have a couple of really tiny lithium tanks which let me adjust in 20-kilo increments, although I should probably stuff a couple of snacks on board just in case Jeb stows away during launch).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/DybJEuP.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022DybJEuP.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2018-12-05T07:44:21Z","Content":"\n\u003Cp\u003E\nThat\u0027s certainly an ambitious plan. Let me clarify a few things though. For Rank 2 on the InSight challenge, the lander and cubesats need to be launched at the same time, on a single vehicle, and then travel separately to Duna. For Rank 3, the DRO needs to be launched earlier, on a separate vehicle, and be in Duna orbit before the other spacecraft arrive. The assumption is that it was already there on an earlier mission, and InSight is just borrowing some bandwidth.\n\u003C/p\u003E\n\u003Cp\u003E\nLooking at the DOMA requirements, I\u0027ll say for the DRO you can use either the Duna Space Station or one of the Positive Uplink relays. It\u0027s supposed to be a permanent satellite of Duna, not a mobile craft, so the Duna Space Bus and Deep Space Transit are out.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you can fulfill all the requirements of InSight Rank 3 and DOMA at the same time, that will qualify you for Rank 4 madness. Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-05T07:53:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223499213\u0022 data-ipsquote-contentid=\u0022180225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543995861\u0022 data-ipsquote-userid=\u0022190611\u0022 data-ipsquote-username=\u0022sturmhauke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, sturmhauke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s certainly an ambitious plan. Let me clarify a few things though. For Rank 2 on the InSight challenge, the lander and cubesats need to be launched at the same time, on a single vehicle, and then travel separately to Duna. For Rank 3, the DRO needs to be launched earlier, on a separate vehicle, and be in Duna orbit before the other spacecraft arrive. The assumption is that it was already there on an earlier mission, and InSight is just borrowing some bandwidth.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E Looking at the DOMA requirements, I\u0027ll say for the DRO you can use either the Duna Space Station or one of the Positive\u003Cspan\u003E﻿\u003C/span\u003E U\u003Cspan\u003E﻿\u003C/span\u003Eplink relays. It\u0027s supposed to be a permanent satellite of Duna, not a mobile craft, so the Duna Space Bus and Deep Space Transit are out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E If you can fulfill all the requirements of InSight Rank 3 and DOMA at the same time, that will qualify you for Rank 4 madness\u003Cspan\u003E﻿\u003C/span\u003E. Good luck!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOK, I\u0027m thinking the Duna Space Station is an excellent candidate for a DRO, but it needs more tankage and a much beefier relay dish if it\u0027s going to be arriving separate from the rest of the fleet. Also some science. Right now it\u0027s only got about 700 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E, really only there for orbital encounters and stationkeeping.\n\u003C/p\u003E\n\u003Cp\u003E\nTime for more tinkering!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-05T07:53:45Z\u0022 title=\u002212/05/2018 07:53  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 5, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-05T21:24:34Z","Content":"\n\u003Cp\u003E\nDay 200 - Made a spaceplane sandwich with four tourists on board. Contract was to \u0022Tour the Captain\u0027s Gig\u0022 and I\u0027m not sure if they wanted to actually tour the previous resupply ship, or tour the rover. So they get to tour both. It turns out the original model of the Captain\u0027s Gig did in fact launch with three wheels, but Captain\u0027s Gig 2 has 4 wheels and Captain\u0027s Gig 3 also has an additional docking port (I had to undock the rover, dock the new ship to the resupply ship, then flip the mated spaceplanes around to dock the rover on the back).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pHXq0zA.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/pHXq0zA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDay 212 - Recovered Captain\u0027s Gig #2 with four happy tourists and Val with no damage. Val chose an extremely aggressive deorbit profile, dropping almost straight down from 150 km to a periapsis of zero just past the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E rather than waiting an extra orbit for a more gentle insertion. The spaceplane was able to handle it nicely, however, and although her orbit took her well north of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E she was able to turn south, land on the runway and grab her first star. She\u0027ll get about a two week leave of absence before personally taking command of SLV 2 aboard the deep space vessel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002259RHQnl.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/59RHQnl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDay 228. Decided I need to send a space tug to normalize the rover\u0027s orbit before I send Val up in SLV 2 to encounter, dock and head to Minmus. Therefore I need Nelby to come back in CG-3 because having a CG docked to the rover is just going to get in the way of this operation. Nelby doesn\u0027t quite have Val\u0027s touch when it comes to reentry maneuvers, though, and he splashed down in the grasslands 102 km from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E after running out of fuel. Still a 93% recovery and he was able to get 17 grasslands science from it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/uyomDT7.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022uyomDT7.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-06T01:19:55Z\u0022 title=\u002212/06/2018 01:19  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 6, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-06T08:29:17Z","Content":"\n\u003Cp\u003E\nDay 228. Realized I was spending so much time and effort trying to make a spaceplane tug and get it to encounter SLV-1 that I could use the exact same technique and effort with SLV-2 and save myself a trip. SLV-2 launched with what I expect to be a surplus of delta-V; it must first encounter SLV-1 then tug the rover to Minmus for final refueling and snack resupply before hitting the D240 Duna window (with a lot of leeway because really, if fuel were the limiting factor I could just head to Jool and visit all the muns).\n\u003C/p\u003E\n\u003Cp\u003E\nSnacks! says that with 11 crew on board I have enough snacks at 20% capacity (mostly all from the snacks the rover had previously mined) for about 80 days, which means this setup should, in theory, have 400 days of snacks for the 11 kerbals on full tanks, which is promising because for my second flight I can probably bring on the order of 30 or 40 kerbals over. I expect an empty NPM of about one ton per kerbal, roughly, if I only consider snacks, which with other considers means I should be able to bring at least 20 kerbals per launch. At 5 launches per window, my next flight should probably house on the order of 100 kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst though, I have to get Expedition Aries safely to Duna\u0027s surface, with separate flights for the main deep space vehicle tugging the rover, a separate flight for the orbital station which will serve as my primary relay point to Kerbin and act as a Duna Recon Orbiter, and one additional flight for each of two cube satellites, which if I don\u0027t mess anything up will turn into part of my relay network. Or if I do mess something up, they will fly by and I\u0027ll probably have to cobble together a probe out of spare parts in situ. \n\u003C/p\u003E\n\u003Cp\u003E\nSLV-2 launched beautifully with the exception of two medium thermal systems which were outside the main fairing and were destroyed. I had thought I moved those, but apparently not. While unfortunate, this will only limit the maximum reactor and conversion load of the DSV while not coupled to the rover. It won\u0027t completely cripple the DSV on solo refuel runs because it still has small thermal systems and radiator panels, but it will limit the reactor quite a bit.\n\u003C/p\u003E\n\u003Cp\u003E\nI was able to time the launch to coincide with the rover\u0027s orbit passing over \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, and when I decoupled the launch vehicle I only needed a bare whisper of fuel to complete the encounter, which made me very happy as the rover is on a 10-degree inclined orbit and my initial simulation runs met with dismal failure. Nevertheless, the expedition accomplished its first docking successfully and must now proceed to Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a2MAoUK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/a2MAoUK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch vehicle experienced an anomaly on reentry, with a maximum G-force loading of 191 G\u0027s (that\u0027s almost two hundred) and was destroyed. Mission control is calling this a Kraken sighting about two hundred KM southeast of the space center. Recovery of scrap is to be determined. Telemetry indicates the SLV was about 50 meters over the surface and parachutes had been successfully deployed, but now tracks debris on a solar escape trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nDay 235: Second touchdown on Minmus. I am continually amazed and concerned at how a 950 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E transfer, a 150 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E correction and a 300-\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E landing seem to translate into about 2800 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E of Lithium burned. The stuff is amazing on paper but between the fantastic power requirements and the fact that it never seems to perform up to snuff, I think it\u0027s best as a secondary propulsion unit for my main ships. Even with 31000 electric charge and an additional 86000 capacitance (click the capacitors or use an action group to discharge them quickly, and then they charge slowly over time) AND with 500 charge per second between two nuclear plants and a really big solar array, my deep space vessel only gets about 200 meters per second of full thrust and then it has to throttle down to 20% power output. Which I suspect the low-power mode must be less efficient but the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E numbers are the same, so I don\u0027t know what\u0027s going on.\n\u003C/p\u003E\n\u003Cp\u003E\nRegardless, I was able to deorbit over minmus, detach the rover over the surface at 2 meters per second, and touchdown, then reassemble them into a temporary mining base. All is well and refueling is going as planned. And yes, those fuel gauges DO read about 2% fuel remaining. Why do you ask?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/8ypZBY7.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u00228ypZBY7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-06T10:56:51Z\u0022 title=\u002212/06/2018 10:56  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 6, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-06T21:48:21Z","Content":"\n\u003Cp\u003E\nMinmal ejection burn. My map won\u0027t actually tell me what my interplanetary trajectory looks like yet, so I\u0027ll have to make some adjustments when I leave Minmus \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, but I\u0027ll be going in more or less the right direction at roughly the right speed. Should be able to save \u0022a bit\u0022 of delta-V compared to a simple \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E burn, but more importantly, once fully fueled my two 31-ton launch vehicles weigh about 90 tons, in other words I basically got an entire free launch of fuel and food by launching with mostly-empty tanks and filling up on Minmus. About 6000 nominal \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and snacks for between 274 and 394 days according to my snack tray. 11 crew launching with 9100 snacks should eat 33 snacks per day roughly, so unless I accidentally brought \u003Ca href=\u0022https://www.schlockmercenary.com/2008-03-09\u0022 rel=\u0022external nofollow\u0022\u003ESchlock the Mercenary\u003C/a\u003E on board I should be ok for any reasonable transfer.\n\u003C/p\u003E\n\u003Cp\u003E\nMy ejection burn will take at least a week, meaning instead of leaving on day 240 I\u0027m leaving on more like day 250, but in theory I have so much delta-V that shouldn\u0027t matter. I\u0027ll set a nice fast trip and then decouple the DRO and some cube sats who will go even faster.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/8ctLdUW.png\u0022 class=\u0022ipsImage\u0022 alt=\u00228ctLdUW.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2018-12-06T22:22:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223500281\u0022 data-ipsquote-contentid=\u0022180225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221544132901\u0022 data-ipsquote-userid=\u002212239\u0022 data-ipsquote-username=\u0022dire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n30 minutes ago, dire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy map won\u0027t actually tell me what my interplanetary trajectory looks like yet\u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can turn up the number of conics in the settings from the main menu (maybe in-game too? not sure). The max is 6, which is plenty to go interplanetary. You\u0027ll only use all 6 at a time if you\u0027re chaining multiple gravity assists together.\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-07T04:35:40Z","Content":"\n\u003Cp\u003E\nY1 D249: Alright, did a final ejection burn around Kerbin which was 450 m/s or so, but after Minmal orbital costs and everything else I think I maybe spent 850 or 950 total on ejection. Was worried that the cube sats would impact something if I used their decouplers, so I got Bill out on EVA and he detached the by hand. Cubesat 2 still shot into the DSV primary reactor pretty hard, so I\u0027m glad I didn\u0027t use the decoupler. Everything detached OK and I now have a fleet of four ships en route to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UURSnC8.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/UURSnC8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Duna Orbital Station / DRO has been renamed the Ezekiel Duna Recon Orbiter and will enter Duna\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E in about 180 days, after a 250 m/s mid-course correction.\n\u003C/p\u003E\n\u003Cp\u003E\nCubesat 1 will enter the Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E in about 202 days.\n\u003C/p\u003E\n\u003Cp\u003E\nExpedition Aries contains the lander, all 11 crew and the deep space vehicle, and will enter the Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E in about 212 days. I lost about 1300 food when I detached Ezekiel but we still have over 300 days of life support, so we should still be fine. It turns out I didn\u0027t fill up my ore tanks (or my 30 monoprop units) on Minmus so I\u0027ve only got about 130 ore of reserves instead of 1300 ore of reserves, but I also have about 5000 nominal delta-V and 50% more food than I need, so I really shouldn\u0027t need to turn my ore into potatoes or gas.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, Cubesat 2 will enter the Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E in about 252 days.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XQQmZAR.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/XQQmZAR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen Aries arrives, it\u0027ll capture and then land on Ike to restock food and the rover\u0027s \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E. The rover has a few parachutes and can in theory take a 50 m/s fall if it doesn\u0027t roll over, but it doesn\u0027t have a ton of delta-V for landing maneuvers on Duna. I can probably just drop it straight from low orbit to surface, but I\u0027d rather not be proven wrong and have to save scum this. I\u0027ve actually never landed anything on Duna before so I\u0027d rather have more delta-V than I need rather than run out halfway down and see whether my parachutes slow me down enough for a dead stick landing. Also, although I did transfer a large radiator panel from the DSV to act as a heat shield for my long Buffalo cabin, the buffalo parts in particular can\u0027t take reentry heating at all. If they\u0027ve got a Karibou part in front they are usually OK, but if I go belly-to at all, I don\u0027t want the rover to burn in half. That would not be a good day.\n\u003C/p\u003E\n\u003Cp\u003E\nAttached the escape pods to the rover and discovered that I forgot to turn my \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E off when I left Minmus! It\u0027s been burning my ore this entire time and now I have no ore left. However, I do have quite a lot of Lithium.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-07T07:37:35Z\u0022 title=\u002212/07/2018 07:37  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 7, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-08T02:55:19Z","Content":"\n\u003Cp\u003E\nStill Day 249. Upgraded my Astronaut Complex to level 3 and hired 36 applicants, including 3 each scientist, engineer and pilot. I was hoping scouts could do basic piloting, but apparently the only thing they do is \u0022tough it out\u0022 better than other Kerbals. Not sure what they\u0027re actually good for beside that.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I eventually hope to have a ship class that fits 36 colonists into a single NPM, and launch at least 2 or 3 of those for Wave 2, but my next launch is going to be an all-in-one kind of vessel to do my near-Kerbin missions that aren\u0027t in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nHiring all those people and upgrading my complex dropped me about 1.4 million credits. My starting science for Insight is 531 and I\u0027ll keep track of my mission gains separately from the Duna gains.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cK3tt4J.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/cK3tt4J.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0022 rel=\u0022\u0022\u003E@sturmhauke\u003C/a\u003E Does solar science count for the Insight challenge? Or only Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-08T03:05:05Z\u0022 title=\u002212/08/2018 03:05  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 8, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2018-12-08T04:09:09Z","Content":"\n\u003Cp\u003E\nAny science gained from an InSight-eligible craft would count. DOMA has lots of other stuff going on though, so that might complicate your bookkeeping.\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-08T06:39:50Z","Content":"\n\u003Cp\u003E\nWell, I am playing Kerbal Complicated Bookkeeping Program \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here is Expedition Aries, the crew-bearing portion of our armada, just after its mid-course correction showing its low flyby of Ike and a gain of 153 science from high solar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to be spending about 550 of that on new toys for Wave 2, although I\u0027m not sure yet what I\u0027m going to get. Probably nuclear engines for a better interplanetary transit system, these lithium engines are just a huge hassle. They\u0027re basically giant ion engines, but on full power my main engines draw 2000 energy per second. I have my eye on something called a Trinity engine which can run on explodium that incurs negative rep penalties if I use it anywhere near Kerbin, which sounds like just what the doctor ordered xD\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E does say we have over 7000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in our tanks, more than the 6000 we had when we started our interplanetary transit burn. This is because we\u0027ve lost a lot of weight by shedding the DRO and the two cubesats, which are primarily \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E-powered and thus have much lower \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E potential. We are down from 90 tons to 64.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aE9zCHX.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/aE9zCHX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDubbed the cube sats Cube Sat 1 \u0022Nehemiah\u0022 and Cube Sat 2 \u0022Hosea\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-08T06:53:29Z\u0022 title=\u002212/08/2018 06:53  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 8, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-08T10:06:38Z","Content":"\n\u003Cp\u003E\nDisaster is looming large over the expedition. After tinkering with the lifeboats to ensure optimal placement on the rover to survive descent, Bill and Val ran a routine diagnosis of their Snack supplies. The result: 2635 snacks remain out of 8000 snack capacity, meaning the kerbals have eaten 5365 snacks with still about half the voyage ahead of them! The snacks computer insists that there are - barely - enough snacks remaining to reach the Duna \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, with 110 days of snacks left and 109 days to the outer bounds of Duna. It\u0027s then going to be a long, hungry drop to Ike, however, and that\u0027s only if the Kerbals manage to curb their appetites and ration the remaining third of their cookies.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile discussing how a) the Ezekiel departed with almost 1600 snacks still remaining in its cabins and b) how it totally was not Bill\u0027s fault that the processor turned all their ore reserves into Lithium instead of potatoes, Val realized that the only solution would be to perform a high delta-V maneuver - not to reach the Ezekiel and loot its snacks, as Bill had suggested, but rather to reach Ike well ahead of schedule so they could mine more ore.\n\u003C/p\u003E\n\u003Cp\u003E\nVal also made a note to tell Mission Control to add space rock tracking to future expeditions. It\u0027d be very handy to be able to harvest a nearby asteroid for potatoes right about now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ohKPT6S.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/ohKPT6S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kq96HSA.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/Kq96HSA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn order to lighten the load as much as possible, Bill hand-launches a relay satellite and a resource scanning satellite; they can make their own way to Duna and will enter their orbits after the expedition\u0027s food supply is out of danger. And then we begin the long, slow burn at 1.00 meters per second squared.\n\u003C/p\u003E\n\u003Cp\u003E\nConcerned about what other systems might not be reporting accurately, Val aborted her burn early. Despite only burning about 500 delta-V, her computer now estimated she had only 4972 delta-V, down from 7381 previously. Jeb from the Aries rover reminded her that it only reported engines that were active; she had switched off the rover\u0027s \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E engine midway through the burn to power up her plasma thrusters. Regardless, she still had a 163-\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E correction and then would blaze through the Duna system in only a few hours, in just under 65 days. They\u0027d have a 1684 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E braking burn to enter orbit low over Ike, and then touch down on Ike to resupply.\n\u003C/p\u003E\n\u003Cp\u003E\nVal also implemented what was perhaps the most desperate measure she, as commander of the expedition, could do: She measured out 31 nominal days of food, and then locked the rest with her personal password. If the food survived at least 24 days to D375, she could unlock the rest of the food early, but if it survived less than 24 days she\u0027d have to ration out the remainder, flirting with mutiny by starving her loyal expedition a day at a time. By transferring food out only every other day, she hoped to give the reprocessors time to produce more Snacks from the recycled soil; every soil container was full and more was being produced that had to be jettisoned, so every bit of soil that could be recycled meant a better chance of the expedition surviving.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xqTIYGf.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/xqTIYGf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0022 rel=\u0022\u0022\u003E@sturmhauke\u003C/a\u003E Not sure if that disqualifies my DRO, but if my Kerbals all starve to death (my snacks settings make them starve after missing 30 meals, which should be about 10 days) then that is mission failure. In fact, if at least 5 of my kerbals starve I more or less fail the DOMA challenge :p Otherwise I could just jettison a couple of kolonists and have everyone else eat their food. The Ezekiel does not have enough for a matching burn; it has 2200 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, which is enough to reach Duna orbit without burning off anything sensitive in the atmosphere; every \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E I spend to shorten my travel time is a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E I have to spend again when I am slowing down as my craft are generally not aerobraking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68528-death-engineering/\u0026amp;do=hovercard\u0022 data-mentionid=\u002268528\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68528-death-engineering/\u0022 rel=\u0022\u0022\u003E@Death Engineering\u003C/a\u003E If I alternate starving and feeding my Kerbals, will that cause any problems with the DOMA challenge? I can probably get by with starving them for less than ten days total (ideally, I don\u0027t have to starve them at all, but Snacks is acting weird). I did bring enough, my Kerbals are just eating too much \u003Cspan\u003E:p\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-08T11:13:49Z\u0022 title=\u002212/08/2018 11:13  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 8, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2018-12-08T19:47:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223501306\u0022 data-ipsquote-contentid=\u0022180225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221544263598\u0022 data-ipsquote-userid=\u002212239\u0022 data-ipsquote-username=\u0022dire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, dire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190611-sturmhauke/\u0022 rel=\u0022\u0022\u003E@sturmhauke\u003C/a\u003E Not sure if that disqualifies my DRO, but if my Kerbals all starve to death (my snacks settings make them starve after missing 30 meals, which should be about 10 days) then that is mission failure. In fact, if at least 5 of my kerbals starve I more or less fail the DOMA challenge :p Otherwise I could just jettison a couple of kolonists and have everyone else eat their food. The Ezekiel does not have enough for a matching burn; it has 2200 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, which is enough to reach Duna orbit without burning off anything sensitive in the atmosphere; every \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E I spend to shorten my travel time is a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E I have to spend again when I am slowing down as my craft are generally not aerobraking.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou could use an autonomous ghost ship for the DRO, as long as it meets the other requirements. But a bunch of dead kerbals won\u0027t get you to Rank 4.\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-08T23:08:03Z","Content":"\n\u003Cp\u003E\nTesting shows that my 31-day nominal snack load lasted about 15 days, which means snacks is running food twice per meal, more than likely. Turned meals per day down from 3 to 2, which means Kerbals should now eat 4 snacks per day, still more than the 3 they are supposed to but now falling within the contingencies I set up.\n\u003C/p\u003E\n\u003Cp\u003E\nJust prior to the Aries Ike-fall (hopefully a very slow, very graceful fall), SLV-3 launches with its 30.986 ton payload mass! Half of this NPM is going to stay in orbit for a bit, and the other half is going to Minmus for some extra fuel and snacks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Sc7UFGD.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/Sc7UFGD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSLV-3 was recovered 710.7 miles west of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, with 64.8% of its dry value less two airbrakes that burned off during plasma blackout. It recovered 55,126 funds which helps offset some of the fines Val\u0027s been accruing for not feeding her kolonists.\n\u003C/p\u003E\n\u003Cp\u003E\nI do have \u0022Kerbals die after missed meals\u0022 enabled, which is currently set to 30, but I\u0027m not sure if lowering that to 20 will kill my kerbals after 5 days or 10 days because Snacks is broken, so I\u0027m going to leave it there. If I have a kerbal starve to death, we\u0027ll find out then, I suppose.\n\u003C/p\u003E\n\u003Cp\u003E\nA few days later and in high orbit over another planet, it\u0027s become clear that Val\u0027s desperate mid-course correction and her draconian measures limiting the kerbals to only 4 meals a day have saved the expedition, as  even with those measures in place the kerbals consumed about 2200 out of their 2600 available supplies during the shortened remainder of the trip to Duna, leaving less than two weeks of supplies left that would have had to last them for an additional 40 to 50 days, had Val not acted.\n\u003C/p\u003E\n\u003Cp\u003E\nI am burning early to the node because the way the plasma engines work, I spend most of my time at about 20% power on long burns and I\u0027d rather have more control coming into my periapsis rather than trying to play catch up after losing power and shooting past both Duna and Ike at high speed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/cFsITpg.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022cFsITpg.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-09T01:15:59Z\u0022 title=\u002212/09/2018 01:15  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 9, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-09T03:17:44Z","Content":"\n\u003Cp\u003E\nOK, successful landing on Ike and docked on the surface for final refueling. I just now realized I don\u0027t have a food processor on the deep space vessel, but it won\u0027t be a problem in the immediate future. Recording a starting science of 592 and an ending science of 2015 on Ike, which doesn\u0027t count things like high Duna and high Ike discovery, but I didn\u0027t think to grab the science screen just prior to entering Duna. So that\u0027s 1423 science plus the 153 solar science for 1574 total science at the moment. Not counting my Minmus and Munar science which the rover did that came out to about 3600 just because I don\u0027t think I have screen shots of before and after.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/HTz1f5d.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022HTz1f5d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd after...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ePPmA2J.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022ePPmA2J.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCould go roving for fun and profit, but I\u0027m not going to risk the rover at this point. There\u0027s loads of time for that later. Next up, topping up the food tanks and then Ezekiel, the probes and Aries landing, although the exact timing will depend on how fast I can fill my tanks. Probably Aries landing first, then Ezekiel and then the probes.\n\u003C/p\u003E\n"}]}