{"TopicId":180666,"ForumId":44,"TopicTitle":"I wonder how doctors would react in such a situation? if they must decide on life treating procedure for teen and kid legally refuse? And opt for experimental one?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2018-12-18T04:26:24Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2018-12-18T04:26:24Z","Content":"\n\u003Cp\u003E\nAnd parents do not need to pay anything because all is budget founded.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder how doctors would react in such situation, I\u0027ve always dreamed of becoming a doctor but now I\u0027m too old (I\u0027m almost 33) I wonder how doctors approach a child\u0027s lack of consent for a life-saving medical procedure? \u003Cbr\u003E\u003Cbr\u003E\nAnd those apply also for seniors under geriatrics care, does family should impose their will on such a person? \u003Cbr\u003E\u003Cbr\u003E\nLike cancer procedures? \u003Cbr\u003E\u003Cbr\u003E\nIf for example, 16 years old teen boy has some kind of cancer that affects his nethers, and doctor order castration as the best course of action, but it\u0027s also new experimental procedure, with good effectiveness, but parents opt for castration \u003Cbr\u003E\nYet boy not agree in my country kid above 16 can legally refuse even parents are legal guardians and have custody right, kids below 16 and above 13 can also refuse but it\u0027s only advisory but most doctors listen to their patient wish not their little parents because of this \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/IjzY3zjhHAU?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nrather than regulations or money :-) \u003Cbr\u003E\u003Cbr\u003E\nThe case I described is real I read about it boy refused and doctors are in deadlock (literally) \u003Cbr\u003E\nParents could get family court ruling forcing their will on kid ːsteamsadː But our Polish court is sluggish like heal and boy could appeal to court of appeals and the case could bounce back and forth and time for him would running out for him, and it\u0027s maybe too late for both treatment the one that parents want and the one that kid want :-( \u003Cbr\u003E\u003Cbr\u003E\nI read that eventually, his parents stepped down, and they do what they boy wanted :-) \n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: And the same goes for seniors do seniors should have the right to decide on themselves even if their mental capabilities maybe deteriorating?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-18T04:31:19Z\u0022 title=\u002212/18/2018 04:31  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 18, 2018\u003C/time\u003E by Pawelk198604\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-12-18T04:42:59Z","Content":"\n\u003Cp\u003E\nWhomever has the legal right to decide has the legal right to decide. Doctors can\u0027t and shouldn\u0027t override that. If the law is vague and the system is slow, that should be fixed and doctors shouldn\u0027t just do whatever they want.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022First, do no harm\u0022 is great and all but in reality, the first goal is to do what the patient wants you to do. Advise? Yes. Strongly urge? Sure. Refuse to do something the patient asks for on a legal ground? By all means. Do something to a patient against their express wishes when they have the legal right to those wishes? Full stop.\n\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2018-12-18T05:04:38Z","Content":"\n\u003Cp\u003E\nAnd what if is about the kid if is cancer for example? And procedure would result in permanent sterilization or lost of limp, and unproven yet promising experimental treatment is available? and the kid is 16 years old, is what I read. Eventually, parents of this boy agreed after one medical professor and one law professor explained to them that hurling it through court giving the fact how sluggish our Polish Legal system could be could result that may be too late for any treatment at all :-(\n\u003C/p\u003E\n\u003Cp\u003E\nSo the parent relent on that :-)\n\u003C/p\u003E\n\u003Cp\u003E\nIt was not known how it ends:-/\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, I’m more interested in how the doctor make their decision to be good for their patient and be later could look at their face on the mirror without shame :-/\n\u003C/p\u003E\n\u003Cp\u003E\nOne of my friend who is a doctor told me about the procedure called “medical selection” or Triage \u003Ca href=\u0022https://pl.wikipedia.org/wiki/Triage\u0022 rel=\u0022external nofollow\u0022\u003ETriage – Wikipedia, wolna encyklopedia\u003C/a\u003E (french word) I told him that from me combing word “medical” and “selection” I rather associate with railroad ramp in Auschwitz Birkenau concentration camp and this man\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://qph.fs.quoracdn.net/main-qimg-c6d28b205efd75633cbd50e89f44d473\u0022 alt=\u0022main-qimg-c6d28b205efd75633cbd50e89f44d473\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nrather than genuine medicine :-(\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-12-18T07:16:37Z","Content":"\n\u003Cp\u003E\nRemoving a nethers (orchiectomy) is standard of care for testicular cancer, if that\u0027s the particular cancer involved (seems likely, penile cancer is incredibly rare), it\u0027s usually not bilateral. I know that here docs are trained to do the surgery the same day if possible, any delay increases mortality, and if treated \u003Cem\u003Epromptly\u003C/em\u003E, the cure rate is very high.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2018-12-18T08:37:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223506708\u0022 data-ipsquote-contentid=\u0022180666\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221545107184\u0022 data-ipsquote-userid=\u002235539\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Pawelk198604 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif they must decide on life treating procedure for teen and kid legally refuse?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI suppose it\u0027s their right. By this extension the same battle has been fought over and over in comatose patients or \u0027brain-dead\u0027 patients (or PVS or locked-in), or even simply those that seek \u0027alternatives\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only true way to sway them one way or another is to try and give the most complete and bias-less overview of the situation and outcome. Even then they still retain their right as is, and there isn\u0027t a way to go about that. Not to mention \u0022bias-less\u0022 is too often impractical and in some other impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is why I often see any problems in these areas aren\u0027t really out of the laws but rather out of the wills of everyone. It is more than possible to settle almost everything out of court, and as much as there are things that \u003Cem\u003Eshould\u003C/em\u003E be settled in court (esp. in law systems that seeks upon past judgement and not just the written law, and when it deals with monopoly or such), some others are mostly unnecessary process and would\u0027ve been better if solved through other means.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is also partly why if you go against the doctor\u0027s decision sometimes there\u0027s a legal document that has to be signed.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-18T08:38:52Z\u0022 title=\u002212/18/2018 08:38  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 18, 2018\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2018-12-18T15:02:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223506723\u0022 data-ipsquote-contentid=\u0022180666\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221545109478\u0022 data-ipsquote-userid=\u002235539\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Pawelk198604 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of my friend who is a doctor told me about the procedure called “medical selection” or Triage\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI worked with a guy who was a captain in the army reserves, and he mentioned having to train for that for medical assistance.  Sounds absolutely terrible to have to do in practice (presumably due to conditions of war, but possibly some other emergency).\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-12-18T15:13:06Z","Content":"\n\u003Cp\u003E\nTriage is entirely rational. There are finite providers at any given facility (even a big hospital), and they need to prioritize who gets treated first. It\u0027s just common sense.\n\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2018-12-18T21:08:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223506760\u0022 data-ipsquote-contentid=\u0022180666\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221545117397\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRemoving a nethers (orchiectomy) is standard of care for testicular cancer, if that\u0027s the particular cancer involved (seems likely, penile cancer is incredibly rare), it\u0027s usually not bilateral. I know that here docs are trained to do the surgery the same day if possible, any delay increases mortality, and if treated \u003Cem\u003Epromptly\u003C/em\u003E, the cure rate is very high.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s probably what it was all about!\n\u003C/p\u003E\n\u003Cp\u003E\nThe case came to the authorities, but our authorities are slow, doctors have persuaded these parents to give this experimental therapy a chance because if they were waiting for the court decision, it could have tragic consequences :-(\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThe doctors managed to save the nethers of this poor boy.\n\u003C/p\u003E\n\u003Cp\u003E\nBetter than none, but the parents respected the boy\u0027s demands \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThey succumbed and the boy seems to have recovered?\u003Cbr\u003E\nIn total, I understand the boy\u0027s rebellion, , To have the nethers  or not have the netherss  that is the question ːsteammockingː, it\u0027s a great thing for a teenage boy ( and for an adult man also)\n\u003C/p\u003E\n\u003Cp\u003E\nI myself would rather die than lose my balls , or have a broken brain and its cognitive function as a result of surgery, so much so that I would become an idiot. \n\u003C/p\u003E\n\u003Cp\u003E\nNot that I would like to die, I can not imagine myself living as a eunuch or intelligently reduced so much that I can not do basic activities, but if there was any chance of survival without damage, then I would go for ir \u003Cspan\u003E:-)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-18T21:10:05Z\u0022 title=\u002212/18/2018 09:10  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 18, 2018\u003C/time\u003E by Pawelk198604\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-12-18T21:20:20Z","Content":"\n\u003Cp\u003E\nThe kid is an idiot, and should not have been allowed to make medical decisions, his brain isn\u0027t even fully formed. Orchiectomy is standard of care for a reason, and the cancer that it treats is VERY curable when properly treated. Any \u0022experimental\u0022 therapy probably hurt him in the long run.\n\u003C/p\u003E\n\u003Cp\u003E\nAn orchietomy doesn\u0027t make you a eunuch, as I said, like most cancers it is atypical for it to be bilateral. Even if it was, he could simply take hormones (testosterone) to correct for the lack of both, had they been removed. This entire thing smacks of anti-scientific nonsense. If it was testicular cancer, a nethers-sparing procedure is a cancer-sparing procedure. truly stupid (there\u0027s a \u003Cem\u003Ereason\u003C/em\u003E minors should not be allowed to make life-altering decisions like this).\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-12-19T07:18:18Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n He will listen with pleasure all your success stories.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229b7ae1f7ee1562d3e2592f6f39296919.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.pinimg.com/originals/9b/7a/e1/9b7ae1f7ee1562d3e2592f6f39296919.jpg\u0022 width=\u0022511\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}