{"TopicId":18091,"ForumId":32,"TopicTitle":"Orbit Question","CreatedByName":"Brad","CreatedById":27606,"CreatedDateTime":"2012-08-29T04:11:17Z","PageNum":1,"Articles":[{"CreatedByName":"Brad","CreatedById":27606,"CreatedDateTime":"2012-08-29T04:11:17Z","Content":"\n\u003Cp\u003EFrom what I can gather, the reason the spacecraft is unaffected by multiple bodies\u0027 gravity is due to a limit of the game engine. I\u0027m just curious why an orbit can\u0027t just be simulated by the programmer (if within x distance of body, make the spacecraft turn in y direction, etc (I think there are formulas to calculate this)) rather than recognized as a body by the engine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-29T04:15:04Z\u0022 title=\u002208/29/2012 04:15  AM\u0022 data-short=\u002211 yr\u0022\u003EAugust 29, 2012\u003C/time\u003E by Brad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2012-08-29T04:22:02Z","Content":"\n\u003Cp\u003EI\u0027m not sure what you think the difference is.\u003C/p\u003E\u003Cp\u003EIf you\u0027re within a body\u0027s SOI, you\u0027ll accelerate toward its center according to specific formulae. The SOI is how it determines that you\u0027re \u0022within x distance of body\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Brad","CreatedById":27606,"CreatedDateTime":"2012-08-29T04:36:11Z","Content":"\n\u003Cp\u003EWhy don\u0027t they just make it so other bodies just counter the acceleration with another formula?\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-08-29T04:44:53Z","Content":"\n\u003Cp\u003EIt was a considered and intentional decision to use Patched Conics instead of implementing N-Body calculations. Although the latter is possible, the calculations are much more processing intensive. Considering the hundreds of debris in many persistent worlds, I doubt our regular computers are up to the task.\u003C/p\u003E\u003Cp\u003EAlso note that proper orbit modelling would make the game play more complicated and unpredictable. If applied to planets, I would also expect compounding precision errors of the floating point calcs to cause all sorts of mahem.\u003C/p\u003E\u003Cp\u003EIMO I think it was a good decision.\u003C/p\u003E\n"},{"CreatedByName":"Pyre","CreatedById":20921,"CreatedDateTime":"2012-08-29T04:46:45Z","Content":"\n\u003Cp\u003EBecause it gets very complex very quickly. Right now, we have 4 significant bodies. You would have to calculate the total forces from each, then figure out where to move the ship based on that, and you would have to do that each physics step. Most computers simply can\u0027t handle that much work without the simulation grinding to a halt. And we are getting nearly a dozen new bodies in the next update. Besides, patched conics does almost as good a job, and is far easier to solve for.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETL;DR:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhat we have now works, computers can handle the load, and changing to an n-body system wouldn\u0027t make things noticeably more accurate.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-08-29T04:54:57Z","Content":"\n\u003Cp\u003EWhat we have now does indeed work. Free Return Trajectories are possible, regardless of the lack of Kerbin\u0027s affect on the craft when it is in the Mun\u0027s SOI. Anything more would put too much a load on the game, not to mention create needless development time.\u003C/p\u003E\u003Cp\u003EIn the end, there is never going to be a perfect simulation, shy of dedicating a few servers to the job of handling every miniscule effect on the craft. KSP isn\u0027t meant to be such, but with what it has, it does it well.\u003C/p\u003E\n"},{"CreatedByName":"Brad","CreatedById":27606,"CreatedDateTime":"2012-08-29T05:08:52Z","Content":"\n\u003Cp\u003EWow; thank you for all the responses. Never really thought about the endless errors that would likely occur in such a system.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-08-29T05:35:40Z","Content":"\n\u003Cp\u003EFrom the Krakensbane dev blog: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn KSP, ships aren\u0027t simulated as a single physical point, with forces and torques acting on it. They\u0027re simulated as multiple linked rigidbodies, each with its own velocity. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs gravity also calculated separately for each piece of a ship? It would have to be, wouldn\u0027t it? Momentum, velocity, all that, would have to be, or bad designs wouldn\u0027t realistically rip apart on takeoff like they do, and that sort of thing. If so, then a single ship is already an N body problem.\u003C/p\u003E\n"},{"CreatedByName":"TheKerbinator","CreatedById":29261,"CreatedDateTime":"2012-08-29T10:36:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EIf so, then a single ship is already an N body problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat? You\u0027re comparing appels and pears my friend.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-08-29T11:32:22Z","Content":"\n\u003Cp\u003EGravity hasn\u0027t been calculated separately for each part of a ship since v.0.11 Kind of a shame, really, because I didn\u0027t get the idea to try to pull of gravity gradient stabilization until v.0.12.\u003C/p\u003E\u003Cp\u003EAs it is now, every piece of your spacecraft feels the exact same gravitational accelleration in the exact same direction.\u003C/p\u003E\n"}]}