{"TopicId":181135,"ForumId":16,"TopicTitle":"Delta-V woes","CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-01-05T02:19:56Z","PageNum":1,"Articles":[{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-01-05T02:19:56Z","Content":"\n\u003Cp\u003E\nSo. I have a Mun rocket I\u0027ve already successfully ran several missions with - but when I fired up KSP today, I ended up spending \u003Ci\u003Esix\u003C/i\u003E\u003Cem\u003E hours\u003C/em\u003E without a single mission actually reaching Kerbin orbit because it just doesn\u0027t seem to want to work the way I used it before. Maybe I\u0027m messing up the ascent, but I\u0027m not sure. Anyway, the rocket in question (couldn\u0027t make screenshots because KSP ran like excrement after six hours and took \u003Cem\u003Efifteen minutes to exit\u003C/em\u003E):\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBooster stage\n\u003Cul\u003E\u003Cli\u003E\nThree Reliants on a tricoupler with four FL-T400 tanks each, plus three Thumpers and three winglets. Struts applied where necessary.\n\u003C/li\u003E\n\u003Cli\u003E\nOriginally the Thumpers were mounted on the side of the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks, similar to how an S-shaped asparagus staging is set up, but I dropped that design because I wasn\u0027t sure the drag/flex wouldn\u0027t cause rotational torque. So instead I hung a number of girders off the tricoupler\u0027s exact center (offset tool until \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid showed zero engine torque), onto which I attached three extended radial decouplers that clip through the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks to the outside.\n\u003C/li\u003E\n\u003Cli\u003E\nThis stage is capable of outputting a max-throttle \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 1.7 up until 81.88 tons. My payload is lighter (60-something, below 70), so I throttled back all engines in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E for 1.7 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E at both takeoff and \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E separation. In this configuration, the stage has just short of 3000 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nTransfer stage\n\u003Cul\u003E\u003Cli\u003E\nSingle Terrier with fuel equivalent to two FL-T400 and one FL-T200 tanks.\n\u003C/li\u003E\n\u003Cli\u003E\nOriginally made up of a single FL-T400 and three radially-mounted FL-T200s, with nosecones on both ends of the radial tanks, to shorten the rocket\u0027s height for less flexing. Changed to two FL-T400s and a single FL-T200, all centrally mounted, to test if this configuration is more drag-friendly, but noted no difference aside from gaining over 100 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E from losing the nosecones\u0027 weight.\n\u003C/li\u003E\n\u003Cli\u003E\nPacks just over 1900 m/s.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nLander stage\n\u003Cul\u003E\u003Cli\u003E\nSingle Terrier throttled back to 60%, with an FL-T400 and an FL-T100, plus four landing legs and four searchlights.\n\u003C/li\u003E\n\u003Cli\u003E\nPacks over 2100 m/s to have enough spare fuel for a non-equatorial landing (about 20° away from the equator max before cutting it dangerously close, even if I zero out my horizontal speed a few dozen kilometers above the target area and land with a suicide burn).\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nPayload stage\n\u003Cul\u003E\u003Cli\u003E\nCommand pod with three Communotrons (the extendible, not the radial) and three solar panels on top.\n\u003C/li\u003E\n\u003Cli\u003E\nOne materials bay.\n\u003C/li\u003E\n\u003Cli\u003E\nTwo service bays. One with a science payload (1 exp. storage, one thermometer, one barometer, one goo canister), one with a guidance payload (OKTO and 200 power).\n\u003C/li\u003E\n\u003Cli\u003E\nHeat shield with 80 ablator.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo then. My problems with this are twofold. First, if I deviate more than about 3-4° away from prograde, the rocket starts rolling. Not flipping due to lack of stability, rolling around its lengthwise axis in a clockwise direction, turning the pitch into yaw, which introduces an inclination change, which causes \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to start yawing in the opposite direction, which makes the roll even worse until it eventually stabilizes. If I turn off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, it keeps rolling for about ten more seconds before stabilizing. I\u0027ve noticed this on other rockets before, but they all started rolling at far bigger \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E, never this soon. Because of this, I\u0027m having a hard time doing a proper gravity turn, only managing to turn 20° before hitting the target apoapse. I\u0027ve spent \u003Cem\u003Ehours\u003C/em\u003E trying to figure out why this is so. The rocket \u003Cem\u003Eis\u003C/em\u003E stable (barely) with the winglets it has and adding more winglets doesn\u0027t help. Launching without the SRBs doesn\u0027t help either. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid indicated a ~5-6 kN torque which I fixed by nudging around the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks on the booster (they weren\u0027t centered properly, for some reason). Now I still have a torque of 0.6 in the science payload, but that\u0027s not it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich leads me to my second issue. Even once I dropped the transfer stage\u0027s radial tanks to reduce drag, I\u0027m still losing so much \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E during takeoff that it costs me about 4000 m/s to circularize at my usual parking orbit of 120 km. While the transfer stage still has more than enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E left for a munar encounter, it doesn\u0027t have enough left afterwards for me to deorbit it into the Mun like I\u0027ve done with my previous launches of this design. Yet when I tried reducing my apoapse to 80 km as per the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E map, I hit apoapse so quickly that I ended up 30 seconds late at starting the circularization burn. I\u0027m losing a \u003Cem\u003Ecolossal amount\u003C/em\u003E of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E somewhere, I just don\u0027t know where.\n\u003C/p\u003E\n\u003Cp\u003E\nSo then, what are my options? The booster stage still has a few tons of weight capacity left, should I use that to give the booster stage more fuel? That solves the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E budget issue, but what about the rolling?\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and ever since I switched the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E mounting from a regular decoupler to an extended one, the SRBs are pitching inwards after separation and hit the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks if the rocket isn\u0027t aiming perfectly prograde, despite me having mounted them literally at the bottom of the decoupler to center the decoupler force on the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E. I even offset the SRBs one notch lower, no difference. When I was using the regular decoupler, mounting the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E on the very bottom caused it to separate without pitching, why isn\u0027t this the case with the extended decoupler?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-01-05T02:40:05Z","Content":"\n\u003Cp\u003E\nFor the rolling, the KSP control algorithms are kinda bad when it comes to 3-way symmetry. If you go to a quad-adapter and do everything 4-way, I bet your rolling problem goes away. Additionally, it sounds like you should be using tailfins instead of winglets. Maybe one of those \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks on top of the thumpers at high priority, so it will empty and be discarded early.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t want the decoupler pushing at the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E of the spent \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E. You want it pushing \u003Cem\u003Eabove\u003C/em\u003E the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, so that the noses of the SRBs splay out on decoupling. Putting the tailfins at the bottom of the SRBs will help accomplish this by adding a torque.\n\u003C/p\u003E\n\u003Cp\u003E\nedit: I built a stock version of your ship (with some small modifications) and I\u0027m not having any trouble at all getting it to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with 1600 m/s remaining in the transfer stage.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-05T04:16:00Z\u0022 title=\u002201/05/2019 04:16  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 5, 2019\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2019-01-05T03:38:30Z","Content":"\n\u003Cp\u003E\nA screenshot of the craft would help diagnose.  But a couple thoughts:\n\u003C/p\u003E\n\u003Cp\u003E\n-In terms of high delta-v to reach orbit, it could be an issue with your ascent profile.  Are you going more or less straight up for while, and then making a sharp term towards horizontal?  That\u0027s going to be less efficient than a true gravity turn that gets you building horizontal speed as quickly as possible.  You mention having to go a ways off prograde.  Ideally, after your initial pitchover maneuver, you leave \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E locked on prograde and let the gravity turn work itself out.  Some adjustments are usually necessary since it\u0027s hard to do an exact pitchover by hand, but the closer to prograde you can stay, the better.  \n\u003C/p\u003E\n\u003Cp\u003E\n-Judging by the description of your core stage, it sounds like this rocket might have a lot of drag (again, a screenshot would be helpful here). That might be contributing to the high delta-v requirement.  \n\u003C/p\u003E\n\u003Cp\u003E\n-If \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid is showing an actual torque figure, that suggests maybe something isn\u0027t truly symmetrical.  Maybe try to rebuild the booster from scratch and see if it does the same thing?  Or take it apart one part at a time to see if there\u0027s a particular point at which the torque shows up / leaves?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-01-05T17:22:57Z","Content":"\n\u003Cp\u003E\nI go vertical until 100 m/s, then start turning. I never turn at the same rate between two takeoffs because I\u0027m not quite that good at paying attention to three things at once, so I just shrug and eyeball it as best as I can.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E locking is what I usually go with, yes, but not with this particular rocket (the OKTO can\u0027t do prograde, the command stage has only one seat and I\u0027m sending a scientist).\n\u003C/p\u003E\n\u003Cp\u003E\nI went through the booster tinkering with each part. If I just attach parts on the tricoupler\u0027s triplet attachment nodes, there\u0027s torque, but if I select them with an offset tool and click on any of the arrows (not drag, just click), the torque in this stage goes to zero. So KSP isn\u0027t placing them properly. The booster stage and the transfer stage are torque-free: rotating them with the rotation tool changes neither the strength nor the direction of the torque. If I rotate the service bay with the science payload, however, it rotates the torque\u0027s direction too. Rotating anything underneath that service bay doesn\u0027t change anything. So the torque is definitely at that bay. The interior of the bay has a thermometer on one wall (placed on the outside, then rotated and offset to be inside), a barometer on the opposite wall, an exp. storage bay in the center and a goo canister hanging off the side of the storage bay, towards one of the doors. That last one might point at the goo canister as the reason for the torque... except not only \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid\u0027s torque indicator points in the barometer\u0027s direction, if I take off the goo canister, the torque is still there and it\u0027s still pointing at the barometer, even though it has the exact same weight as the thermometer and is in the exact same position, so the weight distribution should be symmetrical.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and the torque direction \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid shows is linear, not rotational.\n\u003C/p\u003E\n\u003Cp\u003E\nOne more thing. I\u0027ve read somewhere yesterday that clipping parts into each other causes phantom forces. I have a reaction wheel clipped between the top of the booster stage\u0027s tricoupler and the decoupler connecting the booster stage to the transfer stage, as the command stage\u0027s reaction wheels don\u0027t have enough torque to meaningfully steer the booster stage in the upper atmosphere. Could that be causing rotational torque?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-05T18:20:31Z\u0022 title=\u002201/05/2019 06:20  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 5, 2019\u003C/time\u003E by Fraktal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2019-01-05T18:25:15Z","Content":"\n\u003Cp\u003E\nThe lack of balance in your bay is probably because the barometer is a \u0022physicsless\u0022 part (mass is just added to the parent part) whereas the goo container is not.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Physicsless_part\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://wiki.kerbalspaceprogram.com/wiki/Physicsless_part\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if you\u0027re getting asymmetric drag on this stuff.   Aero shrouding can be wacky.  A couple ways to test: you can cheat the ship into orbit with the alt-f12 menu and see if the same problem happens in vacuum.   Or you can use the alt-f12 \u0026gt; physics \u0026gt;aero menu to enable drag info when you right click a part, and see what\u0027s generating drag. \n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-01-06T01:27:34Z","Content":"\n\u003Cp\u003E\nI moved the thermometer and barometer to the sides of the exp. storage bay and offset the goo canister as far into the exp. storage bay as I could. Torque is now minimal, though still non-zero.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I decided to disregard the rolling and go aggressive with the gravity turn, flying nearly horizontally by the time my apoapse is beyond the atmosphere. That did the trick, so the problem was definitely with the ascent profile. Still, I decided to go back to the side-tank configuration for the transfer stage but with four FL-T200s instead of three. This nets me nearly 300 m/s surplus \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in the transfer stage by the time circularization at the Mun is complete at 50 km altitude.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I just need to figure out why in the world is the Mk1 lander can so damn draggy. According to the UI, it\u0027s got nearly 11 drag while the Mk1 command pod directly in front of it has less than 1 and during reentry from a munar flyby, the lander can heated to 79% despite being behind a heatshield with ablator. Do I need to use a 2.5m heatshield here, or is the heatshield dumping heat into the lander can due to the heatshield being attached directly to the lander can with no parts between?\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2019-01-06T01:40:38Z","Content":"\n\u003Cp\u003E\nThe lander can is intentionally designed to be draggy and bad at reentry - it\u0027s intended for vacuum.   That\u0027s the tradeoff for lightness.  To minimize drag on launch, best to put it inside a fairing.   \n\u003C/p\u003E\n\u003Cp\u003E\nOn reentry heat. I\u0027d argue if it didn\u0027t blow up, you\u0027re doing ok.  79% is actually not that bad.   The heat you\u0027re seeing is probably from the incomplete coverage of the shield.  You could use a larger heat shield,  but those are heavy and draggy.  A second command pod might end up being easier.   \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-01-06T03:18:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223517156\u0022 data-ipsquote-contentid=\u0022181135\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546738054\u0022 data-ipsquote-userid=\u0022184990\u0022 data-ipsquote-username=\u0022Fraktal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Fraktal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nor is the heatshield dumping heat into the lander can due to the heatshield being attached directly to the lander can with no parts between?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m going to disagree slightly with Aegolius. I think ^this is the correct reason, thermal conduction.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2019-01-06T05:16:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223517209\u0022 data-ipsquote-contentid=\u0022181135\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546744719\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m going to disagree slightly with Aegolius. I think ^this is the correct reason, thermal conduction.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did a quick test, dropping what I think this ship looks like from Munar altitude.  Here\u0027s a screenshot of reentry around point of max heating.  Skin temperature of heat shield is about 2000K, but internal temp is under 300K.  Lander can shows heat  coming in via convection, but conduction is net cooling (of course, this includes heat conducting to the command pod behind the lander).  So I do think most of the heat is getting to the can around the edges, rather than straight through the heat shield.  \n\u003C/p\u003E\n\u003Cp\u003E\nBut in any event, if the skin temp of the heat shield plateaus at 2000K (increased ablation seems to keep it from going any higher), conduction alone should not get the lander can to explodey-time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221ddyNfa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1ddyNfa.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n[EDIT - just for kicks, I tried the same thing but without the lander can, so that the command pod is fully occluded by the heat shield.  The skin temp of the command pod topped out at only 400 and some degrees, showed zero convection flux and very small positive conduction flux.  Suggests the protruding shape of the lander can is the major difference.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-06T05:26:29Z\u0022 title=\u002201/06/2019 05:26  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 6, 2019\u003C/time\u003E by Aegolius13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2019-01-06T16:49:28Z","Content":"\n\u003Cp\u003E\nIs the tri-coupler still oddly non-symmetrical, or did that get fixed in the update?\n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-01-06T17:00:51Z","Content":"\n\u003Cp\u003E\nNot fixed. I took a tricoupler and put a trio of Ants onto the triple nodes. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid showed non-zero torque. Then I grabbed one of the Ants with the offset tool and clicked one of the arrows. Not dragged anywhere, just clicked. Torque instantly became zero. So yes, the default part placement is NOT symmetrical.\n\u003C/p\u003E\n"}]}