{"TopicId":181475,"ForumId":32,"TopicTitle":"A small study of technology performance: ion/nuclear/chemical","CreatedByName":"bitzoid","CreatedById":194151,"CreatedDateTime":"2019-01-17T21:04:56Z","PageNum":1,"Articles":[{"CreatedByName":"bitzoid","CreatedById":194151,"CreatedDateTime":"2019-01-17T21:04:56Z","Content":"\n\u003Cp\u003E\nI was thinking about what scaling factors where necessary to make drop-in replacements between ion and nuclear drives. For completeness I also compared this to chemical engines (represented by the Terrier).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the question is at what requirements, what tech should be used. As a baseline, I picked 60kN of thrust and added the correct fuel until all contestants reach the same mass. This means that they also will have the same acceleration (when completely full). The result is therefore only \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E, with everything else being equal. For the purpose of this comparison we neglect the dry mass of the tank.\n\u003C/p\u003E\n\u003Cp\u003E\nThe following graph shows a comparison of five configurations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nion: 30 Self-sufficient Dawn engines, with enough RTGs (330) to run at full thrust independently from the sun.\n\u003C/li\u003E\n\u003Cli\u003E\nion no EC: The same Dawn engines, but relying on the payload providing the EC.\n\u003C/li\u003E\n\u003Cli\u003E\nion fc: The same Dawn engines, but being supplied by 15 Fuel-Cell Arrays. This configuration needs a combination of Xenon, Liquid Fuel and Oxidiser.\n\u003C/li\u003E\n\u003Cli\u003E\nnuclear: A single Nerv engine with fuel to match the mass of the ion baseline.\n\u003C/li\u003E\n\u003Cli\u003E\nchemical: A single Terrier engine with fuel to match the mass of the ion baseline. \u003Cem\u003EDisclaimer\u003C/em\u003E: I do not use the Wolfhound because I need all configurations to have the same thrust. Raising the others to the Wolfhound\u0027s thrust would make the comparison less useful.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThen we add more fuel proportionally, such that the mass of all four configurations remains the same. To read this graph, the scale for \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E is on the \u003Cstrong\u003Eright\u003C/strong\u003E side. In the top part of the graph, the exact formula for all five configurations is shown.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tech_study.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://gitlab.com/bitzoid/krp/raw/master/.example-images/tech_study.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere are some interesting things do note here, but first, only the \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E/Ion engine intersects noteworthy with others (we can pretty much ignore the intersection at x=36).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMass and Performance\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe mass at these intersections are:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Ex = 311\u003C/span\u003E: 49.5t (1.2 m/s\u003Csup\u003E2\u003C/sup\u003E)\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Ex = 416\u003C/span\u003E: 54.7t (1.1 m/s\u003Csup\u003E2\u003C/sup\u003E)\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Ex = 523\u003C/span\u003E: 60.1t (1.0 m/s\u003Csup\u003E2\u003C/sup\u003E)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThat means, whenever you have a configuration that needs more fuel than 56.5t per Nerv, you should \u003Cstrong\u003Ealways\u003C/strong\u003E use Dawns\u002BRTGs (in vacuum). This is only limited by Career-funds.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDawn configuration\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe turquoise configuration with magic EC blows every other engine out of the \u003Cs\u003Ewater\u003C/s\u003E errr... \u003Cem\u003Espace\u003C/em\u003E. Obviously. Using Fuel Cell-Arrays with the Dawn engine isn\u0027t necessarily a bad idea, but the Nerv is consistently better. For higher \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E requirements, the magic power coming from the \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E gains over the weight of the fuel you would need to power the FCA.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENet Acceleration\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is difficult to see, but the background indicates the acceleration you get from the bottom, which is the wet acceleration and the same for all engines, up to the top, which is the dry acceleration. As is to be expected the chemical engine wins flat out wrt to dry acceleration (with a whopping 120m/s\u003Csup\u003E2\u003C/sup\u003E), as it burns the most fuel-mass. That\u0027s why the background is primarily purple. On the lower bit we see a strip of orange (nuclear), with a dry acceleration of 20m/s\u003Csup\u003E2\u003C/sup\u003E and further down a dark patch where the ion drives live (ranging from 1.78m/s\u003Csup\u003E2\u003C/sup\u003E to 8m/s\u003Csup\u003E2\u003C/sup\u003E). This is to be expected.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EConclusion\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I take from this is that only past 20km/s every non-atmospheric ship should use Ion engines (if money is not an issue). With enough RTGs there is no need to awkwardly wait for the gigantor to fill a huge battery.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003E                                      \u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe graph and computations were made with \u003Ca href=\u0022https://gitlab.com/bitzoid/krp\u0022 rel=\u0022external nofollow\u0022\u003EKRP\u003C/a\u003E. See also the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/180760-tool-krp-kerbal-rapid-prototyping/\u0022 rel=\u0022\u0022\u003Eforum thread\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-18T21:20:31Z\u0022 title=\u002201/18/2019 09:20  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 18, 2019\u003C/time\u003E by bitzoid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}