{"TopicId":18150,"ForumId":16,"TopicTitle":"Can you attach a part to two other parts","CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2012-08-29T21:45:00Z","PageNum":1,"Articles":[{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2012-08-29T21:45:00Z","Content":"\n\u003Cp\u003EBasically, some mods have parts that have more than two attachment points. A cube with 6 points for instance (the DSM pack). However, there doesn\u0027t seem to be a way to create a square and have a part attach to the connection point on both sides. Or is there something I\u0027m missing? \u003C/p\u003E\u003Cp\u003EI\u0027ve seen some stock space stations that seem to have circular or square designs and attach all the way around though.\u003C/p\u003E\u003Cp\u003EIf it isn\u0027t possible I\u0027d like to suggest the feature.\u003C/p\u003E\n"},{"CreatedByName":"2008dragon","CreatedById":13712,"CreatedDateTime":"2012-08-29T21:47:34Z","Content":"\n\u003Cp\u003EDo you mean you want to make a part like this?\u003C/p\u003E\u003Cp\u003EIf you mean just attach a part to the \u0027cube\u0027, you can rotate it with wasdqe at 90 degree intervals, or hold shift to do it slower.\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2012-08-29T21:56:14Z","Content":"\n\u003Cp\u003EHmm, I wish I could show a picture of what I mean. Maybe I can use symbols to make it make more sense.\u003C/p\u003E\u003Cp\u003EOkay so lets say that the below three characters are three different parts. \u003C/p\u003E\u003Cp\u003E|-|\u003C/p\u003E\u003Cp\u003EThe middle one is a standard piece which has connection points on either end. The other two have connection points in the middle as well. So I can connect the middle piece to either side, but as far as I can tell I can\u0027t connect it to both at the same time. So if the left part and the right part are existing already, can I connect the middle to both? Currently I just attach it to one and use struts, but it isn\u0027t ideal.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2012-08-30T00:17:55Z","Content":"\n\u003Cp\u003EI think the way the game currently works is that each \u0027parent\u0027 part can have multiple \u0027child\u0027 parts but each \u0027child\u0027 part can only have one \u0027parent\u0027 part. So I think you\u0027ll just have to use struts/fuel lines. Assuming you\u0027re talking about what I think you\u0027re talking about. (Placing some part so that it\u0027s connected to multiple other parts)\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-08-30T02:21:35Z","Content":"\n\u003Cp\u003EI think what is happening is ogject clipping. What is happening is that either you need to rotate the part, or there is a collision conflict saying you cannot put part here. Usually with the multimount points, it is a matter of manually rotating into the correct position. And sometimes, the part just conflicts with another one. Without being able to see the exact parts or test, is tough to confirm for truth or not.\u003C/p\u003E\n"}]}