{"TopicId":181767,"ForumId":100,"TopicTitle":"Mise à jour PS4/XBOX 1x","CreatedByName":"konishuha","CreatedById":195093,"CreatedDateTime":"2019-01-28T12:12:17Z","PageNum":1,"Articles":[{"CreatedByName":"konishuha","CreatedById":195093,"CreatedDateTime":"2019-01-28T12:12:17Z","Content":"\n\u003Cp\u003E\nBonjour à tous,\n\u003C/p\u003E\n\u003Cp\u003E\nSavez-vous si une mise à jour est prévue sur console pour avoir KSP en version 1.4 ?\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-02-03T13:30:02Z","Content":"\n\u003Cp\u003E\nHello ! \n\u003C/p\u003E\n\u003Cp\u003E\nOui \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E rumeurs parlent d\u0027une grosse mise à jour depuis un moment moment grosse inconnus c\u0027est \u0022quand !?\u0022 Je supose que ca ne devrais plus trop tarder squad en vaguement parler dans son Devdiary de \u0022Vee or not to Vee\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nJ\u0027ai écris à squad via Facebook et voici leurs réponse ( bien que je comprenne je ne traduit pas car se serais sûrement faux, je préfère laisser faire \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E pros ^^ )\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHi John,\n\u003C/p\u003E\n\u003Cp\u003E\nSorry for not answering you before. We received many massages and yours might flown under our radar. Apologies for that.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding the console versions, we can assure you that it is not true what you heard about us not updating these versions any longer. Actually, we are currently working on a substantial update that will address various issues and bring new content to KSP on consoles.\n\u003C/p\u003E\n\u003Cp\u003E\nWe cannot say more for the time being, but you can follow our DevDiary to learn more  as we unravel more information about the actual content coming. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for your support and fly safe \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEntre temps d\u0027autre on aussi poser des questions et reçus des réponses similaires. Sur Facebook il y\u0027a un groupe \u0022Kerbal space program henanced édition\u0022 regroupant évidement \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E joueur consoles, si une news venais à sortir pour qu\u0027elle y sera reléguée \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKerbol donne nous la force et la patience que necessite cette attente ! \n\u003C/p\u003E\n"}]}