{"TopicId":181861,"ForumId":51,"TopicTitle":"For those who fell in pursuit of science (Tellumo on Kerbalism)","CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-01-31T16:08:43Z","PageNum":1,"Articles":[{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-01-31T16:08:43Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cspan style=\u0022color:#16a085;\u0022\u003E\u003Cstrong\u003EFor those who fell in pursuit of science (Tellumo on Kerbalism)\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA picture heavy story of the voyage to Tellumo on Kerbalism. Lest we not forget those who have fallen in the name of science.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 1: What came before\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 2: The Jebediah\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 3: Sights and sighs\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 4: And so it begins\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 5: Breaks and mistakes\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 6: Arrivals\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 7: Redecorating\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 8: Exploring \u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 9: Local fireworks\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 10: The flight of the Eagle\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 11: The Jade Diver\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 12: Radiation\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 13: Going home\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli style=\u0022color:#000000;\u0022\u003E\n\u003Cspan\u003EChapter 14: Riding the storm\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-01T15:05:28Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 1: What came before\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBill sighed when he ran the numbers again. He would have a busy schedule when arriving at Tellumo. \u0022At the rate the components are failing we wont have a base to live in\u0022 he muttered. Pressed for budget the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had opted for standard quality parts for their Tellumo base, and with an average lifespan of about a year, components started failing at an alarming rate. Still the redundancy that was build in the design was holding out, for now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot168.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/YpsHHxJ/screenshot168.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill leaned back and thought about the first mission that had arrived at Tellumo, almost 3 years ago now and the awe it had inspired back at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E when the first images came back. Back in the day the SSC-06 was part of Scientific Scan and Communication program. Having flung the first set of probes off to the near moons, but with the increased capacity of the Thanos-02X lifter, and a contract for deep space exploration, \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had sent of number 6 to the deep reaches of space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot118.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/q0NqLnh/screenshot118.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe revolutionary antenna design resulted in a stable uplink to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and it also carried a small comm-relay sat that as ejected in a highly elliptical orbit in preparation of follow up missions. Over time the data had painted a nice picture of Tellumo and peaked the interest of the Kerbals. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot270.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/2F5XRnz/screenshot270.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlthough the majority of the focus (and funding) had gone in the funding of SpaceLab-2 after the death of 3 Kerbals on SpaceLab-1 and the ongoing missions in preparation for the manned landings on Iota and Ceti, a follow-up mission based on recycled hardware from the Ceti lander program was initiated. The atmospheric readings were a phenomenal success and overshadowed the ongoing landings on the moons. Finally Tellumo had the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0027s full attention.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022screenshot62.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/q1zqHRw/screenshot62.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFollowup missions SSC-14 and SSC-17 brought multiple landers and small rovers that were dropped on various continents. Extended biome mapping led to the discovery of ideal landing sites and the inhospitable character of Tellumo\u0027s atmosphere. Several probes crashed due to ripped parachutes. Eventually, \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E mapped out a potential base site and discovered a relative flat area in the mountains at 11km altitude. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot265.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/KWYvqfY/screenshot265.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith Iota base Tranquality running at near permanent crew and completion of the Ceti base Eagle completed, finally hardware was sent to Tellumo to build a settlement on Tellumo that could support a crew of three indefinitely. Now that hardware was failing piece by piece.\n\u003C/p\u003E\n\u003Cp\u003E\nBill woke from his day dream and headed out to Mission control to give his status update and check the pre-flight data for the next major step.\n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-01T15:28:12Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 2: The Jebediah\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYear 5 Day 201, Bill and Tradien went over the latest data of the pre-flight checks. There was still a lot of work to be done. \u0022Time to go boys and girls.\u0022 Valentina flipped her sunglasses up and smiled. She was ready to ferry the two engineers from the desert launch facilities to the main \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E site.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot277.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/rd7N25L/screenshot277.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022All flight checks complete!, C7 152R EagleEye is ready for takeoff.\u0022 She announced. Eager to test the new aircraft that was licensed from Raptor9.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot278.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/JvFT0f2/screenshot278.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDesigned as recon and survey vehicle the craft was mainly used as a luxurious taxi. Providing great workspace while moving Kerbals between the various basis. Valentina was however to determine the limits of the plane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot279.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/KqdNsKW/screenshot279.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTrying to break the sound barrier\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot280.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/t2hG4ZV/screenshot280.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDetermining altitude ceiling\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot282.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/FsvXfwS/screenshot282.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd before they knew it they were at the main \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E facility, disembarking to meet up with the rest of the launch crew for a historic day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot286.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/x7PC6wn/screenshot286.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDespite the fact that all checklist turned out ok, the launch would be delayed for another two days due to coronal mass ejections, then finally on the historic launchpad 2 it was time to test the latest in rocket technology. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot288.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/DLKMRsL/screenshot288.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn year 5 day 213 the Aquarius-B02 ignited the engines of the Taurus-6A 5 meter lifter. The total launch cost racked well over the 700k funds, measuring 655,000 tons it started to move.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot289.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/xMkYmJ1/screenshot289.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ehm, its not moving\u0022 said Gene. Desipite the 6,5MN of thrust, the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E turned out to be 1.03. \u0022It will\u0022 said Bill. \u0022Trust me.\u0022 And indeed, like in slow motion the craft lifted itself and gracefully took to the skies. At 23km the first stage cut off and the second ignited and effortless took the payload to a 99x99km orbit at 8,6 inc.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot290.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/j4KJVBx/screenshot290.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot291.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/bb95DXR/screenshot291.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot292.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/G0BZ5B3/screenshot292.png\u0022 width=\u00221024\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIt then flipped around and deorbitted itself. Leaving almost 80 tons of fuel in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. Ready for a spacecraft to dock with it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot293.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/GnMVLRL/screenshot293.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot294.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/qB7MNGj/screenshot294.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Its all risk management,\u0022 Explained Gene. \u0022Had the rocket blown up, we would have a second chance with the more expensive ship. And even without the boosters we can make a slingshot around Tellumo.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot298.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/y4MrBp6/screenshot298.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot300.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/c6YQmdz/screenshot300.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n32 days later a second Thanos-6A stood proudly erected at Launchpad-1 this time. Weighting 653,081 Tons, slightly less.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot302.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/bL9MzDh/screenshot302.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot305.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/hLbYyKx/screenshot305.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took off and went for a direct direct rendez vous, which went off without a hitch. Then began the tedious double port docking procedure. Fortunately the Aquarius was filled with enough monopropellant to align perfectly with both tanks and after a full orbit of fiddling the craft was complete. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot308.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/K65yQRt/screenshot308.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot309.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/pWxJ67z/screenshot309.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot310.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/g4MqGVL/screenshot310.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext the science teams began to deploy the instruments, engineering fired up the cooling and power systems and slowly the giant ship sprang to life. It was designed to house 3 Kerbals for 3 years, triple nuclear reactors additional solar arrays, any kind of recycler and a fully functional 3D printer lab. The first of its kind. Whilst  the navigation teams were laying in the manoeuvre node 65 days from now that would take Kerbals beyond their \u003Cabbr title=\u0022Sphere of Influence\u0022\u003Esoi\u003C/abbr\u003E for the first time in history.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022screenshot314.png\u0022 class=\u0022ipsImage\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/THqSTvm/screenshot314.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile Valentina prepared of her meeting with the overseeing council. \u0022What is wrong with the name Aquarius?\u0022 The board seemed puzzled with Vals request. \u0022Nothing sir, and the Aquarius class is a fine line of spacecraft, but.\u0022, she replied, before she was interrupted by the old Kerbal that now shifted his glasses while he peered at her. \u0022Then why does this memo requests a renaming? Aquarius-0B-02 seems fine to me.\u0022 Valentina realised the director had not read any further than the title. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot314-2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022480\u0022 src=\u0022https://i.ibb.co/MfpkD6m/screenshot314-2.png\u0022 width=\u0022480\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022The Jebediah, sir, we would like to rename the ship to the Jebediah, in honour of those who went before us.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd so it began, that very night in the tracking station, the Aquarius was renamed the Jebediah-1 and back in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E the decent vehicle was renamed to . Reminiscent of two heros of the early space program that had died on SpaceLab-2D.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-01T16:43:39Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 3: Sights and sighs\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot326.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/zFZYg8L/screenshot326.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA couple of days later the Jebediah-1 passed over the Desert launch facilities and in the evening sun a shining silhouette of the Hermes-0B-01. It would be the second launch of the craft after its successful test fight several months ago. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot328.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/JkGjbC9/screenshot328.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBoth the booster and the spacecraft had been recovered, which implied lower cost, but small changes and refurbishing had taken their time nonetheless. On board of maintenance flight J-01-1 were pilot Harvin and engineer Tradien. Stuck in the cargo bay were two tourists that were paying for the flight. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E finance department was looking forward to this flight!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot330.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/cyfpDHt/screenshot330.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot332.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/QPMwp1s/screenshot332.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Uhm, \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, we are running low on \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u0022, going for fast dock. The launch had been painful and the craft had used most of its monopropellant fuel to counter the wind forces and align it on a rendez-vous trajectory. As a result, it was now running on fumes. Nevertheless the alignment was good, and with bingo fuel, the craft docked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot333.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/LtTnwzs/screenshot333.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hmm, no \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to fill our jetpacks\u0022 Tradien noticed. Can\u0027t EVA over to the broken reaction wheel. \u0022Hang on, I have an idea\u0022 Harbin replied. He undocked, backed off the station, then  aimed for the booster and managed to stop within less than a meter of the craft. Tradien exited the Hermes and held on the rails. The reaction wheel proved to be out of his reach. After two more attempts, the team broke off the mission and headed home. \u0022Well at least the tourists enjoyed themselves\u0022 \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E said.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot334.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/bN2dQ5B/screenshot334.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot335.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/V3Hdjzf/screenshot335.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot336.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/tCMwhKk/screenshot336.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDuring landing, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters exploded, control surfaces failed to get a grip, fuel ran out and they missed the landing site by 28km, Harbin was not a happy camper. \u0022Alright crew, brace for impact, we are going for a water landing.\u0022 In the back the tourists got more than they bargained for. With a hard splash in the night, the Hermes landed. All crew survived and the majority of the craft. Despite \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E recovery, it would take some serious redesign before it would fly again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot338.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/tJDB17w/screenshot338.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nY5D274 Launch of -0A-01 on a Thanos-4A. The reliable launcher that had taken the Apollo missions to the moons of Gael was more than capable of lifting the descent vehicle in orbit. Named after  Kerman because of the onboard lab, sensors and security features. Its exact configuration was classified until it would reach Tellumo.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot339.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/mS9DYZ0/screenshot339.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe 230,000T vehicle provided 4.2MN of thrust and parked the  in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with 6000 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E. Waiting for its departure window. All was prepped.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-04T09:57:03Z\u0022 title=\u002202/04/2019 09:57  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 4, 2019\u003C/time\u003E by MacLuky\u003C/strong\u003E\n\u003Cbr\u003Epictures\n\u003C/span\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-04T15:15:05Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 4: And so it begins\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot317.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Wsz6MYj/screenshot317.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs was the custom of large undertakings at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, a large group of Kerbals joined at the flagpole. To commorade those who had died in the name of science. \u0022We remember: Jebediah, , Marllian, Sigma, Adrod and Jade.\u0022 Indeed, Space with Kerbalism had proven to be a dangerous endeavour. Engineers were still confused about the death of Sigma, Adrod and Jade on Tranquality Base. They should have had enough power, but due to the mystery of timeworping, their reserves were suddenly depleted and they died a horrible death. The base had not been occupied ever since.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot320.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Qkq3y4z/screenshot320.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut they also looked ahead at the boldest mission ever undertaken. The first step to becoming a bi-planetarian species. Headed by Mission Commander Valantina, the first to reach orbit, first to set foot on Iota and with more flight hours than any other Kerbal. Robert Kerman was the Mission Scientist. With long duration studies on Ceti and Iota he was more than qualified. Bill Kerman was the Mission Engineer. He had led the Aquarius project that that resulted in the Jebediah-1 and had designed most of the base modules for their home at Tellumo.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot342.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/pWVk12Q/screenshot342.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot343.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/gPpDRQV/screenshot343.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot344.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/7WvHgbV/screenshot344.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was the 304th day of the fifth year when the Astra-0A-10 launched from the main site.\u003Cbr\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was taking no risks. Overpowered and battle proven this was the 10th launch of this exact configuration. The Astra was the workhorse of \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E activities and regularly ferried passengers to SpaceLab-2E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot345.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/M1GpG75/screenshot345.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot346.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/P6zr46f/screenshot346.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot347.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/PMNMq4R/screenshot347.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn uneventful launch, but they missed the initial rendezvous. Val dropped the orbit so they would catch up and after 3 orbits they could transfer to the Jebediah and dock to its main service port. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot349.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/R3hs8PN/screenshot349.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill checked the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters, engines and fixed the broken reaction wheel before the departure node would come up, 5 days later. The Astra was sent on an automated trajectory to SpaceLab-2E were it would serve as a lifeboat for future missions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot350.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/cCQzv3R/screenshot350.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot353.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/yFsPMzg/screenshot353.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot355.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/NrCz9VT/screenshot355.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a max thrust 2.2MN the 177 ton Jebediah-1 had a comfortable \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 1.29. \u0022This is a party!\u0022 Said Valentina when ejecting the craft on its 282 day transfer. The -0A-01 would depart 5 days later, but arrive 10 days earlier. Bill powered up the reactor and radiation shield, Bobbert ran a solar particle experiment and so it began.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-05T10:07:00Z\u0022 title=\u002202/05/2019 10:07  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 5, 2019\u003C/time\u003E by MacLuky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-04T15:39:10Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 5: Breaks and mistakes\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot358.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/yyXThzV/screenshot358.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal was puzzling the orbit chart of Tellumo. They had brought two small relay sats, similar to those on all base modules before. There were at least 8 small relay sats orbiting Tellumo and 3 large dishes that could reach Gael. The mesh looked pretty tight, but Val was searching for blind spots, or weak ones that could use the redundancy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot357.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/J2JC6WD/screenshot357.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot359.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/ysVz96R/screenshot359.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot361.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/wcnJmMv/screenshot361.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe flight went as expected. The crew did experiments, broadcasted on Kerbal television and Bill had his hands full on midway repairs. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters, an engine bell and the external life support units proved the most error prone. He actually reprinted a new unit at one occasion. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot360.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/fDYmXw5/screenshot360.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bill here, I\u0027m detaching the ECSL module from the lab.\u0022 he said when he started unscrewing the device. \u0022Yo, Bill go ahead\u0022 Bobbert came in. \u0022Data is looking good, there\u0027s a switch here that has a blinking light btw.\u0022 \u0022Please repeat, I\u0027ve just unhooked the power cables. Please wait\u0022 crackled the intercom. \u0022Re-paint? Indeed that is what the switch said.\u0022 Bobbert replied while he flipped it. \u0022Whoa\u0022 Bill exclaimed when 1500 units of material kits zipped by him. \u0022Whoops\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nWith no material kits left, Bill began dismantling the booster nodes and recycled components that were no longer needed. He just hoped it would be enough.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-05T10:06:24Z\u0022 title=\u002202/05/2019 10:06  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 5, 2019\u003C/time\u003E by MacLuky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-04T16:23:40Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 6: Arrivals\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot363.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/ZdRJ4Rr/screenshot363.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe descent vehicle had arrived without problems at Tellumo. Mission control ran addition tests, deployed the airlock and retracted it. All systems seemed nominal and in fact, the science components on the rover returned some interesting new data as well. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot372.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/0DY1SM2/screenshot372.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot375.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/9gFDB2j/screenshot375.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn the cargo bay a small satellite with scansat sensors was decoupled and pushed into a high inclination burn. It would map the remaining biomes. Not needed for the landing, but perhaps there were some interesting biomes at the poles that could be used for an expedition.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot364.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3mjbVn2/screenshot364.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSeveral days later the Jebediah-1 entered the sphere of influence of Tellumo. \u0022All systems powered up!\u0022 Said Bill, \u0022we are ready for retro and capture burn\u0022. The craft had been dormant for almost 200 days and many things could go wrong when the 6 engines jumped to full throttle. Pressed in their seats the three kerbals realised how long they had been without gravity, but then their thoughts drifted to a red alert light and the sound of a tin can being crushed, just before the burn was completed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot365.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/gRt9hF4/screenshot365.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Damage control, talk to me Bill\u0022 Val\u0027s voice was calm yet direct. It would be another 30 minutes before \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E got the telemetry and they were not waiting for the Kerbals back home to figure this out. \u0022Seems like the entire structure is offset\u0022 said Bill. \u0022Oddly I see no leaks, it seems to hold together\u0022. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot367.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3d5TqZW/screenshot367.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVery carefully the craft was manouvred in the target orbit. The external drop tanks were now depleted and discarded. Bill salvaged as many components as he could for the recycler and managed to restock some material kits that way. They also deployed a small communication relay before circularising. It was not a perfect mesh communication network, but since there were now more than 10 of these little relays in orbit and 2 main relay dishes in polar orbit, the chances of a connection back home were pretty good.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot371.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/L1jf0Fv/screenshot371.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn year 6 day 126 5:44 \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E time the crew of Val, Bill and Bobbert shutdown the main systems of the Jebediah, put her in sleep mode and detached the descent craft for the first manned descent to the surface of Tellumo. \u0022Orbital velocity 2930 m/s, altitude 706077, parachutes 1 to 7 ok, number 8 is refusing to deploy.\u0022 Bobert was on comm duty whereas Valentina used the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E system to adjust the target range.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot378.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/TLbjKyP/screenshot378.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot379.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/CWR26QW/screenshot379.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot380.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/M156rhB/screenshot380.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ablation of the heatshield stayed well within acceptable parameters and even with a parachute short the descent went without a hitch and 10 minutes after detachment the -01 roving lab was touching down at Tellumo\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot383.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/fpCQJY4/screenshot383.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot384.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/vL3kv03/screenshot384.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot385.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/1RQJcj2/screenshot385.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew struggled with the gravity, despite earlier reports it proved comparable to Gael, (as if someone changed the settings) but their long stay in space had made the legs wobbly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot386.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3sq8rWd/screenshot386.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot389.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/VpQz7bx/screenshot389.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the formalities bert started with the atmospheric science and tried to figure out if it would be safe to take of your helmet. Valentina plotted the course. \u002220 km to Marillian base guys! Lets roll.\u0022\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-05T10:06:47Z\u0022 title=\u002202/05/2019 10:06  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 5, 2019\u003C/time\u003E by MacLuky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-05T10:05:44Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 7: Redecorating\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot388.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Ch2Vkcn/screenshot388.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot390.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/9qTxpDs/screenshot390.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen they rolled over the last hill the universe seemed to slow down when Marillian base came into the full view. 6 successful components had made it to the location beacon and successfully docked to form the final base, 2 units had been lost, all were showing signs of wear and tear. Age and wind had taken their toll and Bill quickly started with the removal of broken parts and fixing of many others.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot387.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/ZLg3M40/screenshot387.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe core module contained a large habitat combined with a small laboratory, it also housed a comm tower that could be erected to provide high gain communications with Kerbin. There was a small reactor and many supplies at the back, that allowed for operation throughout the Tellumo night.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot392.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/PC8JTTB/screenshot392.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second module was the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E and rover module. It provided a sturdy small rover, nicknamed Nemo, because the first rover was lost over the ocean. The drills and pumps should be able to provide the base with a continuous supply of water and ore. A second reactor served as backup.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot393.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/wYZgDrg/screenshot393.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThree greenhouses were designed to replenish the food stores and would need to be reactivated. The fourth greenhouse had crashed during re-entry as well as a supply and science module, leaving our Kerbals with a potential food shortage. \u0022Hmm the drills didn\u0027t touch the water, therefor the greenhouses didn\u0027t produce food\u0022 Bobbert concluded. \u0022Easy to fix\u0022 said Bill, but hard to make up for the lost time. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot391.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/0BxsNWM/screenshot391.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe final module was a 3D printing lab. It was the last to arrive and also carried a large relay antenna. It seemed to work fine and Bill had already started producing several parts as he unfolded his grand plan: \u0022The current base just has too many parts. Well over 600, we need to reduce this drastically!\u0022 He explained. \u0022So what is your suggestion?\u0022 Said Valentina. \u0022Lets rebuild the entire base using only the components we need! By my calculations that should be less than 90\u0022 not just for the lag, but the base was slipping down the slope and several landing legs had already exploded under the stress.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot394.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Snv1Nwr/screenshot394.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot396.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/hXcnxKT/screenshot396.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUpon completion the brakes on the Marillian base frames was released and more than 300 ton of equipment rolled down the hill and was parked more than 3 km from the new \u0022Jade\u0022 base. Bill marked the location in his log since he had the feeling he would need to visit this junkyard for spare parts in the near future.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-05T14:34:59Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 8: Exploring \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot405.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3R0FN8k/screenshot405.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot406.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/YPj6xx9/screenshot406.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Stress levels at 6%, nominal radiation. Team is in exceptional health\u0022 Bobbert was happy to report back to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E that the crew was more than fit to start the core part of their mission: science. For the next two months they would track across the surface, visit many biomes and learn as much as they could of this mysterious sister of Gael.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot407.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/FsfK5LN/screenshot407.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot409.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/w6dY6Df/screenshot409.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot410.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/2M4yR7V/screenshot410.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the midlands and the lowlands the team reached the highlands and finally the mountains came into view. \u0022I hope the rover will stand up to these slopes\u0022 Bill said, but Valentina was very confident. \u0022If not, we are so screwed\u0022 said Bobbert. Indeed the team would be unfortunate if the rover could not reach the return vehicles that were landed on a mountain top, roughly 30 km from the current location but at least 8 km more than their current altitude.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot411.png\u0022 class=\u0022ipsImage\u0022 height=\u0022608\u0022 src=\u0022https://i.ibb.co/Hnkfh0r/screenshot411.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot413.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/tqRqbgW/screenshot413.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo day later the team reached the Venus-1 and Venus-2 ascent vehicles. As with all components of the mission, the ascent vehicle had come with full redundancy. Landed as a rover, it could drive to a suitable location. Eg. The current altitude was 11 km! Then, using the small engines in the front, the craft would be put in vertical position. Upon launch the rover would be detached and left behind. Serving both as a launch platform and comm relay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot416.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/qWZv2CC/screenshot416.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot417.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/NnJLPD6/screenshot417.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile Valentina was planting fulfilling flag planting duty, inspected Bill the Venus-1. \u0022Minor damage, nothing crucial, nothing that can\u0027t be fixed.\u0022 He muttered. \u0022Except for the fact that it is one seat short, and the ladder is in the wrong place.\u0022 Indeed the Venus class was designed for 2 kerbals and the last minute eh year change of plans to include Bill on the mission meant that tinkering would be needed to get all on the same rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot414.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/wy1YFJn/screenshot414.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot415.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/23gqFNq/screenshot415.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Venus-2 has a problem guys!\u0022 Bill sounded not very optimistic. \u0022We can fix it, but we need new parts and ramp up fuel production back at the base\u0022 Apparently the hard landing had torn off several of the Venus-2 fuel tanks. It probably could make orbit, but it would be a very tight margin. Fortunately the Venus-1 was in good enough shape, if they could find a way to board it!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot418.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/6PPt3vY/screenshot418.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot419.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/KNxvDkv/screenshot419.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot420.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3Fx0zMW/screenshot420.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDeciding there was little they could do about it now, the team ventured onwards and cruised to the secondary base location. This site had been marked by the scout team as possible location but was passed over in favour of Marillian base. Mainly due to the low inclination and the fact that it was embedded between highlands. But the soil analysis would turn out very favourable.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot421.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/rFRvnTx/screenshot421.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot422.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/DDHBjNx/screenshot422.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot423.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Gph4wJV/screenshot423.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile Bobbert was working on collecting soil and water samples, Bill decided he was going for a swim. \u0022Crazy old Kerbal\u0022 Valentina smiled, secretly jealous that she didn\u0027t bring a swim suit herself. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot427.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/12dGGKQ/screenshot427.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter having marked the beach location on the map as a good location for the next outpost Bill would adapt the roving lab by adding several propellers. \u0022This is how I go swimming!\u0022 Exclaimed Valentia, when she drove the vehicle in the inland sea. What followed was a boring long sail trip back to base, with a treasure trove of science. \n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-06T16:30:42Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 9: Local fireworks\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot437.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/L5NcbXW/screenshot437.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally back home, Bobbert couldn\u0027t wait to get back to the lab to work on the science, Valentina was plotting the next expedition and Bill was bored. But after two days playing  with the mystery goo container and building domino sets from structural panels he had an interesting idea. \u0022But I will need parts... lots of parts\u0022 he said to himself.\u003Cbr\u003E\u003Cimg alt=\u0022screenshot397.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/tY6dhTF/screenshot397.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot399.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/59pN060/screenshot399.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot401.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/qpWFG2q/screenshot401.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot402.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/BsGWw46/screenshot402.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat followed was a short trip to Marillian Base that greeted him and the little Nemo rover with cheerful explosions of wheels and landing legs. Clearly the design had severe mistakes and the discussion to construct Jade Base from its components had been a wise one. Fortunately there was enough material to bring back to base.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot439.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/bBxDS4S/screenshot439.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot438.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/SKXmt5L/screenshot438.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took several days and quite a bit of help from Valentina and in the 3D printing lab, but Bill\u0027s creation started to take shape. \u0022See, we passed a small moon on arrival\u0022 he said. \u0022So small that it is hard to lock on to, but why don\u0027t we research it from Tellumo\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022screenshot441.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/JkQ2rvY/screenshot441.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot442.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/0fFyPXN/screenshot442.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot443.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Sw5ytL5/screenshot443.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot444.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/PZ79HpG/screenshot444.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot445.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/nn2ZXwh/screenshot445.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot446.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/KmRdVHL/screenshot446.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch was a fully solid rocket engine system, very similar to the very first rockets used on Gael. Now it would suffice to reach a much lower altitude, and since the payload was extremely light, it packed huge amounts of delta-v for course corrections. Once it would get out of the atmosphere that is.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot447.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/nBLd5Cv/screenshot447.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot448.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/7n6Z4fc/screenshot448.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot449.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/1ZqKgKp/screenshot449.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe small probe ended up with a close encounter with Lillth. After 2 orbits the alignment was well within parameters and without much problems it entered a polar orbit and started mapping the tiny rock. Which led to great rejoicing of the Tellumo team and the opening of the last bottle of skotch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot450.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/gdWR9Bz/screenshot450.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot451.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/dp54rwv/screenshot451.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot452.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/1z33sLx/screenshot452.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022That\u0027s odd\u0022 said Bobbert when studying the telemetry from the probe. \u0022It appears that there is an anomaly in that crater. I wish we had made a lander.\u0022 Indeed, the probe was designed as light as possible and landing legs were not the top of the backlog. \u0022Perhaps we should not let that stop us\u0022 Valentina said, while plotting a descent course that would take the probe to the exact location. Sometimes a home-brew solution outperforms the highest degree of engineering and delivers science beyond all expectations.\n\u003C/p\u003E\n"},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2019-02-07T01:58:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223532901\u0022 data-ipsquote-contentid=\u0022181861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549034892\u0022 data-ipsquote-userid=\u0022138597\u0022 data-ipsquote-username=\u0022MacLuky\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/1/2019 at 11:28 AM, MacLuky said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 2: The Jebediah\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-snip-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.ibb.co/g4MqGVL/screenshot310.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022screenshot310.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022624\u0022 src=\u0022https://i.ibb.co/g4MqGVL/screenshot310.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat mod contains the thingies with blue glow? O_O\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m rather liking this thread. I\u0027ve never seen Tellumo at sea level like you\u0027ve shown. It\u0027s quite encouraging. \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2019-02-07T02:05:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223535271\u0022 data-ipsquote-contentid=\u0022181861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549377299\u0022 data-ipsquote-userid=\u0022138597\u0022 data-ipsquote-username=\u0022MacLuky\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/5/2019 at 8:34 AM, MacLuky said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Ca href=\u0022https://i.ibb.co/Gph4wJV/screenshot423.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022screenshot423.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Gph4wJV/screenshot423.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m surprised these guys aren\u0027t struggling for breath with 10\u002B atmospheres of pressure and density. Hearty bunch, these Gaelans are.\n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-07T13:05:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223536331\u0022 data-ipsquote-contentid=\u0022181861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549504690\u0022 data-ipsquote-userid=\u0022167617\u0022 data-ipsquote-username=\u0022JadeOfMaar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, JadeOfMaar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat mod contains the thingies with blue glow? O_O\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m rather liking this thread. I\u0027ve never seen Tellumo at sea level like you\u0027ve shown. It\u0027s quite encouraging. \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts the WorkShop for the mod with the same name\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 10: The flight of the Eagle\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot457.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/4JjtV7m/screenshot457.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot459.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/0fPFQNn/screenshot459.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot462.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/86ngdd4/screenshot462.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\n  \u003Cbr\u003E\nThe eagle had been a marketing stunt by C7 Aerospace Division. They had claimed that their product was \u0022out of this world\u0022 and had sponsored the 120k to send it to Tellumo. Over the last few days it had been refilled, configured with the science package of the -01 and after some final checks it was time to fire up the engines and take Bobbert and Valentina on a long duration flight to check out some of the biomes that had been left out of the scouting tour.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot466.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/3vM44xj/screenshot466.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot469.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/sjhhTqK/screenshot469.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot471.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/kmJMHXn/screenshot471.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn particular the polar region proved to be very accessible, thought the collected science would not reveal any new insights. Several sites, like the glacier were examined for possible base locations, but none were selected. It was time to head home, before the night would fall, since the craft would run out of power really fast.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot472.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/FbkqsxC/screenshot472.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot473.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/JjKGrG5/screenshot473.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn their absence, Bill had turned his mind to the ladder problem of the Venus craft. Not only would they need to get on-board, but the capsule would need some rework in order to fit a third seat. This meant lifting equipment and supplies and a stable working platform. With the help of rotatable docking ports, the 3D lab and parts salvaged from Marillian base, he managed to build a small crane. Some more excitement came during the night when one of the radiators broke apart due to \u0022wobbling\u0022 or Tellumoquakes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot474.png\u0022 class=\u0022ipsImage\u0022 height=\u0022626\u0022 src=\u0022https://i.ibb.co/yRp16QW/screenshot474.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot475.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/bP0c48v/screenshot475.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot479.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/DGpNppF/screenshot479.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-11T12:17:30Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 11: The Jade Diver\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nValentina brought the team together at the kitchen table, what had become the center of the small base. \u0022We won\u0027t make it on these rations\u0022 she started. The greenhouses had done their best, but they were eating faster than the greenhouses could produce. \u0022The Jebediah has enough resources, so we could cut the mission short, but I don\u0027t want to do that.\u0022 Bobbert was the first to reply: \u0022We need to find the LEM-4C. I have a signal, I just can\u0027t triangulate it.\u0022 The supply module had crashed into the ocean and shortly after that communication had been lost. No-one knew if it was floating or on the bottom of the ocean.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot482.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/CtwQTdD/screenshot482.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot483.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/thWBb7r/screenshot483.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot484.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/wJJKtLF/screenshot484.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill spent the next few days designing and developing a small probe that could seek out the missing supply module and with a very minimalistic design it took off and started searching.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot488.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/ZfSPsWw/screenshot488.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot491.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/TmLZCSm/screenshot491.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot492.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/k69GdWL/screenshot492.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022The signal appears to come from below, it could be a reflection though\u0022 Bobbert was going over the signal scope. \u0022FFT shows a range of 90 meters below the surface.\u0022 Valentina landed the little diver on the surface and began diving. Once it reached the bottom of the sea, it gathered reflection data and was capable of making an accurate location fix. It locked on to the signal and began ascending to the source.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot493.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/vxpvCbH/screenshot493.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot494.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/f0r8pSk/screenshot494.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce it had breached the surface, the remains of the supply tankers were found. One had lost its payload upon impact, but the second one seemed intact. The high cliffs would make it hard to tow it out of there, they would need to make it airborne somehow.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot497.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/G3F8RPv/screenshot497.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot499.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/56sYdP5/screenshot499.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot500.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/7V3LJ9n/screenshot500.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill had come up with a nifty new solution and printed 4 rotor parts. In theory they should be able to lift the supply tanker and fly it back to base. But getting them there would be an issue. Also, landing a plane on water typically has disastrous effects on the landing gear. Using the spare parts Bill created a hydrofoil that should be able to lift and land the Eagle safely on the surface of the water.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot502.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/q0C8Bsr/screenshot502.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot503.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/cDTYqnL/screenshot503.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot504.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/CmqygDy/screenshot504.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t took them long to locate the Jade Diver, but it would take some time to mount it in the cargo hold as Bill insisted on taking it back with them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot505.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/r0BCJ42/screenshot505.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot506.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/S6kDR9J/screenshot506.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt would take Bill hours, together with Valentina to mount the rotors more or less aligned on the craft, upgrade the guidance system and move some solar panels so that it actually powered up. With the falling night and limited supply of electricity it became a race against the clock to get the system operational.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot507.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/4dnjJSx/screenshot507.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot508.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/QnjR8rM/screenshot508.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot510.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/M6jt44h/screenshot510.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFlying a \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E is not for the faint of heart, and it proved to be very difficult to stabilise the craft and lift it over the cliff hill. Ultimately the LEM-4C landed with a big bump less than 200 meters from Jade Base, where it would be dismantled and its supplies added to the rapid diminished supplies. Finally they could get proper rations.\n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-12T11:52:29Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 12: Radiation\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022screenshot323.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/dBZCw1F/screenshot323.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBack at Gael a junior scientist woke up behind his monitor after he dozed off dreaming of Minmus ice cream. A sharp alert sound from the console was caused by a message that had originated from sentinel 4, the deep space solar observatory. Whilst looking for astroids that passed in front of the sun, it doubled as a solar observatory. The young scientist ran outside and nearly bumped in into his superior just outside the tracking station: \u0022Solar radiation, heading for Tellumo, lots of it!\u0022 He screamed while trying to catch his breath.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot536.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/x7Y2jBb/screenshot536.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFortunately it would take 5 hours to reach Tellumo, and by then Jade base would be on the dark side of the planet. Giving the team 17 hours to come up with a solution. \u0022Either we fly to the dark side, or we hide under water\u0022 Bobbert explained. Valentina didn\u0027t like the flying solution, the Eagle had flown admirably, but the water landings had taken its toll. \u0022Can you whip us up a submarine Bill?\u0022 She asked while wondering how they would get that thing to ocean.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot537.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/ftvMnLd/screenshot537.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot538.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/Z1TJtBf/screenshot538.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot539.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/09Rf7sC/screenshot539.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe team work ferocious throughout the long night and quickly constructed what would be known as the tin can. By now all spare parts of Bills stockpile were used and the last two boosters made sure that the craft blasted off lowlands, sharply bent off the cliffs and then slowed down using parachutes for a soft landing followed by a deep sink.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot540.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/gP3sS41/screenshot540.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot541.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/P9dVZkr/screenshot541.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wish I could say dive, but due to the lack of reaction wheels and uneven mounted engines we are just guessing\u0022 Bill said while the craft continued to sink. They would never quite hit the ocean floor. By the time they reached 3km depth, the majority of the storm had passed over them and Bill jettisoned the ore tanks to start start their journey to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot542.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/VmYS1Rh/screenshot542.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBack at the lab, they would find their radiation levels had crept up to 20%, still not a bad number, but they were almost a year away from home and in a year a lot could happen.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot546.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/StHprBp/screenshot546.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot547.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/dMy2sL0/screenshot547.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLater that week Bill added the science package back to the Eagle and Bobbert and Val went on a final trip to the poles to gather core samples and figure out if an underground base would shield future kerbals to the harshness of space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot549.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/B2qNL1S/screenshot549.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot550.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/WV5RMf6/screenshot550.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe samples would take some time to process, but even at the poles radiation was a thing and colonisation of Tellumo would prove hard.\n\u003C/p\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-19T11:06:32Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 13: Going home\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot553.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/9NChfTM/screenshot553.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot554.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/K0bJyh1/screenshot554.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot555.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/n0gfrfj/screenshot555.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith great sadness Bill completed his final round of repairs. He chucked at the idea that originally there was engineer foreseen on this mission. He had made daily inspection rounds over the last year and every week some part had needed adjustment or duct tape. He fixed the last oxygen harvester and open the comms: \u0022I\u0027m ready let\u0027s go\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe team gathered for their last photo before they put the base on automated mode, shutting down a reactor, one of the water drills and an ore drill for future use. The rest would keep running, keeping the lights on, growing food and pressurising Jade base for the next visitors.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot556.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/VtG9XfD/screenshot556.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot557.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/hBPbYQn/screenshot557.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot558.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/1GznNb9/screenshot558.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter two weeks of driving they passed SSC-17 Scout. The little rover had given up its struggle against the inclination of the mountain range, but its drill contained some interesting experiments that were worthwhile to recover.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot560.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/dkSqhrd/screenshot560.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot561.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/pJNghWf/screenshot561.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot562.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/S0cc7yP/screenshot562.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA day later they found some debris that made Bill worry about the state of the ascent craft, but fortunately they would prove to be more in less in the same state as last time. In need of repair but fuelled and mostly upright.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot563.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/rf9MsHg/screenshot563.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot565.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/K9tfQP2/screenshot565.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd so the repairs started. Using the rotatable docking ports Bill had created a small crane that could lift him within working distance (sometimes referred to as \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E range) of the craft, allowing him to make repairs and ultimately to board the spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot566.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/txN556g/screenshot566.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot568.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/jZ5Km7g/screenshot568.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot567.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/bzTWDpq/screenshot567.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Fuel, go!\u0022, \u0022Nav, go!\u0022, \u0022Guidance, go!\u0022, \u0022Power, go!\u0022, \u0022Life-support, go!\u0022, \u0022Ignition!\u0022 With a loud bang the decouplers detached the rocket and with a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E 1.2 the craft slided from its cradle and into the sky, quickly picking up speed and re-establishing the comm relay link the the remains of the Venus launcher, which now functioned as a repeater.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot569.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/sqYvS8v/screenshot569.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot570.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/kDF9v2w/screenshot570.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot572.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/MM6z5bb/screenshot572.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Altitude is looking good, we are slightly too low for the speed we are picking up\u0022, Val was doing her best with the sluggish controles, but it was a delegate manoeuvre. Where in the Iota / Ceti landings they could do a couple of orbits before rendezvous, they would not have that luxury today. It would need to be a direct rendezvous or they would run out of power, (unless they would be on a very low orbit).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot573.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/z4JNphr/screenshot573.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot574.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/x6Bpfdh/screenshot574.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot576.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/7SZwqcp/screenshot576.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Dammit Val, my feet are not tucked in behind that nosecone\u0022 Bobbert shouted over the crappy comms, that were completely blacked out due to the plasma sheering around the craft. The last part of the atmosphere proved to be thicker than expected. Valentina pushed on but it meant the rendezvous time shifted to the dark side of the planet. They powered down the reaction wheel, guidance computer and even the pressure regulators, co2 scrubbers and relied on their suits for the next 20 minutes coast to the spacecraft. One hard burn emptied the tanks and the next problem arrived.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot575.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/Jzy78Nz/screenshot575.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot577.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/MM8JJw0/screenshot577.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot578.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/NZXTNTC/screenshot578.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Look at the amount of thrusters that are down!\u0022 Bill squeaked over the comms, \u0022There is no way automated docking is going to work, we need to EVA over\u0022. After hopping over they at least had power and oxygen, once they had past through the dark side, they would hop back to gather science and surplus materials before abandoning the Venus. \n\u003C/p\u003E\n"},{"CreatedByName":"Pretorian28715","CreatedById":175947,"CreatedDateTime":"2019-02-20T16:54:10Z","Content":"\n\u003Cp\u003E\nOk, I like, awaiting MOAR\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2019-02-20T17:38:56Z","Content":"\n\u003Cp\u003E\nA few things I have considered for interplanetary missions with Kerbalism may be of interest to you in future, to mitigate the issue of parts breaking down on the interplanetary transport vessel.\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nMaking a small surface base on a moon of the target celestial body, both for exploration purposes and so that the interplanetary transport can be parked in orbit around the moon. With this method, I would leave a maintenance crew and a simple reusable shuttle on the moon so that they can easily access the interplanetary transport and repair it if needed, rather than the crew on the planet having to use up what is probably their only ascent vehicle for an early return to fix maintenance issues.\n\u003C/li\u003E\n\u003Cli\u003E\nFor planets which lack a moon that is convenient for this purpose, simply making the interplanetary transport function as a fully-equipped space station, thus allowing a maintenance crew to stay on it directly for the duration of the surface crew\u0027s excursion on the planetary surface. This method lacks the secondary scientific goals that a moon base would accomplish, but would be able to be used even when there is no small moon available.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-20T17:39:22Z\u0022 title=\u002202/20/2019 05:39  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 20, 2019\u003C/time\u003E by septemberWaves\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MacLuky","CreatedById":138597,"CreatedDateTime":"2019-02-25T07:55:11Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EChapter 14: Riding the storm\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022T-10 seconds, alignment looks good.\u0022 The Jebediah had sprung back to life after a dormant period of almost a year. Reactors powered up, all broken down parts had been replaced or repaired, nav computers had been spun up and a course to Gael had been plotted. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot580.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/9b8Szbc/screenshot580.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot581.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.ibb.co/5hzh1z6/screenshot581.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew were knocked into their chairs as the spaceship blasted off. They had lost two engines, one had broken down, the other was now out of alignment. But the thrust was more than enough to kick them out of orbit in a single burst.\n\u003C/p\u003E\n\u003Cp\u003E\nAs they left the rings of Tellumo behind them they snapped the last pictures, made some final measurements and prepared for the long journey home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot582.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/njcMpWt/screenshot582.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nClose to the end of the journey an alarm light popped up and a siren squeaked through the audio system. \u0022I should have fixed those speakers\u0022 Bill thought to himself while he floated from his bunk to the control panel. \u0022Now what?\u0022 Asked Bobbert. Data spat off the monitors, a radiation storm was heading directly for them. \u0022Looks like a big one, can\u0027t go around it anymore.\u0022 Said Valentina. The team spent the next 5 hours and 57 minutes in the radiation shelter, but even with the shields at maximum output and the lead walls of the hitchhiker container their levels of radiation rose considerably.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot583.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/GHTRJqf/screenshot583.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat was worse is when they entered the Gael solar system the dreaded alarm went off again. The team look at each other in fear. \u0022We won\u0027t survive another storm\u0022 said Bobbert. Valentina jumped behind the controls. \u0022If we speed up now, we will be inside Gaels magnetic field before the storm hits us.\u0022 She yelled. \u0022If we speed up now, we won\u0027t have fuel to break.\u0022 Bill said.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot584.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/998j649/screenshot584.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot585.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/18PN5Z8/screenshot585.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe choice between radiation death or finding alternative ways to break, was an easy one to make. Dipping the atmosphere at 45 km with more than 3 km/s meant lots of parts exploded on re-entry. They lost solar panels, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters, some structural components and the contents of Bills stomach.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot586.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/vVGHQ4C/screenshot586.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot588.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/rs6WYLd/screenshot588.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the remainder of the fuel, the Jebediah circularised its orbit at year 8 d94, 1:42h and with mission time 2y 275d 3h it had reached a safe parking orbit after traveling distance 26 Mm. Most of the storm passed while they resided on the dark side and the magnetic field of Gael, combined with the Jebdiah\u0027s counter measures were just enough to keep the team alive, albeit very sick.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot590.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/xCXnSvP/screenshot590.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot591.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/qy32P8z/screenshot591.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot592.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/w7Tz1w3/screenshot592.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEven before dawn was reached a new Dragon crew spacecraft was launched on top of the Thanos-2X. Marking the 30st launch of the lifter and actually the first crewed Dragon. On board were medic Shelgas and pilot Galileo on a direct rendezvous trajectory. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot593.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/JzYCC7R/screenshot593.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot594.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/3WQGZMm/screenshot594.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot596.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/zfSBKVF/screenshot596.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Cruising altitude reached. Detaching booster\u0022 With a loud crash the solar panels got torn off the service module and joined the core stage in its inevitable fall back to the planet. \u0022Activating backup fuel cells and starting rendezvous burn\u0022 said Galileo as if the loss of primary power supply was something that happend all the time. \u0022Don\u0027t worry, we can even make this on battery only.\u0022 He smiled.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot598.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/9wgmmw8/screenshot598.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot600.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/YX894nV/screenshot600.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot601.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/MS7q8G4/screenshot601.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDocking went smoothly and the crew were happy to finally see a different face. \u0022This is not good\u0022 said Shelgas looking at the medical data. \u0022We need to get you on the ground as fast as possible.\u0022 The kernels grabbed over 10000 points worth of science and stepped into the new capsule for a fast and precise re-entry that would put them almost on the helipad of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot602.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/XXQF1xm/screenshot602.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot603.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/ZcDjDvf/screenshot603.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022screenshot606.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/bJDwMqk/screenshot606.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Parachute deploying, I\u0027m not relying on the landing engine\u0022 Galileo was not taking changes and parked the craft safely on the green. \u0022Finally home\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot607.png\u0022 class=\u0022ipsImage\u0022 height=\u0022612\u0022 src=\u0022https://i.ibb.co/wYLLHDw/screenshot607.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe team posed for the mandatory photo, \u0022Tellumo is a beautiful world, worthy of the risks, a second home for the Kerbal people\u0022 Speeched Valentina, \u0022but a harsh mistress for Kerbal equipment\u0022 Bill added. \u0022We will be back, to do what Kerbals were meant to do\u0022 said bert. \u0022Science in the face of danger\u0022.\n\u003C/p\u003E\n"}]}