{"TopicId":182596,"ForumId":81,"TopicTitle":"Fine or stepped controls for sliders","CreatedByName":"Xepherys","CreatedById":184924,"CreatedDateTime":"2019-03-03T16:40:41Z","PageNum":1,"Articles":[{"CreatedByName":"Xepherys","CreatedById":184924,"CreatedDateTime":"2019-03-03T16:40:41Z","Content":"\n\u003Cp\u003E\nI’m not sure how this is handled on PC, but on PS4 (and presumably Xbox), trying to control slider values is difficult, at best.\n\u003C/p\u003E\n\u003Cp\u003E\nThe most obvious concern is precisely adding/removing fuel from tanks. Not only matching liquid fuel and oxidizer, but precisely controlling them as needed. I’ve got in the habit of just fiddling until it “close enough”, but that isn’t really ideal. \n\u003C/p\u003E\n\u003Cp\u003E\nToday it’s an issue of fairing sides. I don’t want “5.15” sides (why is this not whole values anyway?). But in all of these sliders, you can’t even reliably force a max or min value. Clicking at the very ends don’t necessarily push the slider there, and dragging doesn’t guarantee it either (maybe positional polling on sliders is really, really slow?).\n\u003C/p\u003E\n\u003Cp\u003E\nYou can hold L1 to gain finer control, but it really just slows down movement. I’ve cranked my cursor speed down to 20, and while the cursor itself moves more slowly, the accuracy of the value is no different.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would be nice if L1/R1 and maybe even L2/R2 were modifiers for values. While holding X on the slider, holding L1 and moving slows it down like it does today. Holding R1 and moving changes the value in whole number steps. L2 and move changes in 0.1 steps. R2 and move changes in 0.01 steps. Or something along those lines anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, tracking across the screen would be nice. Once you leave the confines of the slide area, even while holding X, control tracking ceases. For consoles, or controllers in general, this is poor UX. Once X is being held on the slider itself, horizontal tracking should continue across the screen.\n\u003C/p\u003E\n"}]}