{"TopicId":182862,"ForumId":69,"TopicTitle":"Complete System crashes during gameplay","CreatedByName":"CooperJ-","CreatedById":196136,"CreatedDateTime":"2019-03-14T13:44:55Z","PageNum":1,"Articles":[{"CreatedByName":"CooperJ-","CreatedById":196136,"CreatedDateTime":"2019-03-14T13:44:55Z","Content":"\n\u003Cp\u003E\nHowdy,\n\u003C/p\u003E\n\u003Cp\u003E\nI love this game and have been playing for many years now, without problem. Now, as of this last up date (1.6) I have started to have my entire system crash, where the (don\u0027t judge) case RGB\u0027s are still on, and the fans stop and then turn on again. As I have seen in other forum threads, ya\u0027ll need the specks, so my machine is: ryzen 5 2400g, with the internal graphics off, a Sapphire brand radeon Rx 590, a 650 watt psu, and a Asus motherboard. I have done some basic testing, and I have figured its not the Psu, as I have been able to load vastly more needy games on my machine without fail. These crashes are in the actual flights, ranging from liftoff to encounter, but do have a tendency to rear up during docking.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you,\n\u003C/p\u003E\n\u003Cp\u003E\n-C \n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-03-14T18:32:45Z","Content":"\n\u003Cp\u003E\nSystem suddenly going dark with even the fans shutting down? Might be CPU overheat, as KSP is \u003Cem\u003Every\u003C/em\u003E CPU-heavy. I had such overheats on my previous laptop with similar symptoms, albeit not with KSP and the laptop in question refused to turn back on for a few more minutes until it cooled a bit. Getting a cooling pad solved that issue.\n\u003C/p\u003E\n"},{"CreatedByName":"Chel","CreatedById":176173,"CreatedDateTime":"2019-03-14T22:28:32Z","Content":"\n\u003Cp\u003E\nYeah, KSP and CPU don\u0027t go well. My laptop heats up like an oven when I start playing, and takes like 20 minutes to cool down. Getting a cooler should fix this issue \n\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2019-03-14T23:11:54Z","Content":"\n\u003Cp\u003E\nI would still say it sounds more like the PSU. But we can test both hypotheses in one go if you would reenable the internal graphics and remove the RX 590.\n\u003C/p\u003E\n"}]}