{"TopicId":183734,"ForumId":36,"TopicTitle":"[WIP][1.7.x] Kerbal Status Effects - say no to touristification! [ v0.1.0 @ 2019-04-13 ]","CreatedByName":"cakepie","CreatedById":69278,"CreatedDateTime":"2019-04-14T10:24:57Z","PageNum":1,"Articles":[{"CreatedByName":"cakepie","CreatedById":69278,"CreatedDateTime":"2019-04-14T10:24:57Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:50px;font-weight:bold;font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;text-decoration:underline;\u0022\u003EKerbal Status Effects\u003C/span\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:20px;font-weight:bold;\u0022\u003Ev0.1.0 @ 2019-04-13\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Status Effects is an addon that provides a framework for applying status effects that temporarily modify the skills (\u003Ccode\u003EExperienceEffect\u003C/code\u003Es) of affected Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nThis mod is currently \u003Cspan style=\u0022color:#FF0000;font-weight:bold;\u0022\u003EWIP\u003C/span\u003E and is \u003Cspan style=\u0022color:#FF0000;font-weight:bold;\u0022\u003Enot feature complete\u003C/span\u003E. See roadmap below for development plans.\u003Cbr\u003E\nThe current release is a dev build, intended to enable other modders to review, test, and serve as a starting point for using/integrating it in their own mods.\u003Cbr\u003E\nNothing for end-user consumption yet. (That means you, players. Come back later!)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nRationale\n\u003C/p\u003E\n\u003Cp\u003E\nA number of mods currently exist that change a kerbal\u0027s class to Tourist in order to render them \u0022useless\u0022 or \u0022unable to work\u0022.\u003Cbr\u003E\nThis is the most convenient way to achieve that goal, since the KSP API just doesn\u0027t provide any straightforward means of doing so.\u003Cbr\u003E\nHowever, this is less than optimal, for several reasons:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cb\u003EMod incompatibilities\u003C/b\u003E\n\u003Cp\u003E\nIf more than one mod is installed that utilizes \u0022touristification\u0022, they may step on each others\u0027 toes and leave things in an incorrect or invalid state.\u003Cbr\u003E\nThis generally means that such mods are mutually incompatible with one another, so players cannot use them together.\n\u003C/p\u003E\n\u003Cp\u003E\nThis was less of a problem when the only mods that performed \u0022touristification\u0022 were life-support mods: such mods are typically intended to be mutually exclusive, and (despite being a less punishing alternative to outright death) \u0022touristification\u0022 is an undesirable outcome that players are supposed to avoid, so it shouldn\u0027t occur very frequently.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, there are also mods such as \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/183140-x/\u0022 rel=\u0022\u0022\u003EDuty Roster\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155313-x/\u0022 rel=\u0022\u0022\u003EKerbal Health\u003C/a\u003E that do not fit into this category of \u0022life-support mods\u0022, so it is desirable to move toward an approach that will allow different mods to play well with one another, e.g. see \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/105202-x/\u0026amp;do=findComment\u0026amp;comment=3545021\u0022 rel=\u0022\u0022\u003Ethis user request\u003C/a\u003E.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EBrittle, potentially save-breaking\u003C/b\u003E\n\u003Cp\u003E\nThe process of \u0022touristification\u0022 involves saving a copy of the kerbal\u0027s original specialization, then changing it to \u0022tourist\u0022. This is error-prone (e.g. \u003Ca href=\u0022https://github.com/UmbraSpaceIndustries/USI-LS/issues/259\u0022 rel=\u0022external nofollow\u0022\u003Esaving the wrong data\u003C/a\u003E) and can lead to saves being left in an invalid state if the mod is uninstalled (e.g. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/149604-x/\u0026amp;do=findComment\u0026amp;comment=2798083\u0022 rel=\u0022\u0022\u003Econcerns voiced here\u003C/a\u003E by the maintainer of Snacks!)\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003ELoss of information / contradictory information from player POV\u003C/b\u003E\n\u003Cp\u003E\nPlayers may be interested in what the original specialization of a \u0022touristified\u0022 Kerbal was, but only the mod responsible for the \u0022touristification\u0022 knows this information. Furthermore, it might not even provide that information to the player via UI anywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nFor all intents and purposes, the Kerbal will be shown as a tourist by stock KSP UI (e.g. astronaut complex, tracking station, map view) and other mods (e.g. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/108704-x/\u0022 rel=\u0022\u0022\u003EPortrait Stats\u003C/a\u003E) and treated as such for logic purposes. If the \u0022touristification\u0022 mod shows the original specialization in its UI, this will conflict with all other information available elsewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nOne might argue that the fact that a crewmember became a tourist is intended to provide feedback to the player (e.g. that life support requirements were not met, etc). However this is not obvious and isn\u0027t sufficiently informative, as evidenced by players asking via forums or other social media why their kerbal became a tourist. There is also no way to distinguish between a \u0022touristified\u0022 crewmember vs an actual tourist. We all know that Jeb is obviously a pilot and not supposed to be a tourist, but other randomly-generated kerbals are not likely to be as memorable.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EUnintended effects and consequences\u003C/b\u003E\n\u003Cp\u003E\nTurning crewmembers into tourists is a sledgehammer-style approach, in that it does not just remove their specialization-related skills. It will also:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nDowngrade \u003Ccode\u003EGeeForceTolerance\u003C/code\u003E to \u003Ccode\u003E0.75\u003C/code\u003E\u003Cbr\u003E\nThis may make some sense in some situations, e.g. weakened by lack of food or other life support. But it is not always applicable.\n\u003C/li\u003E\n\u003Cli\u003E\nRemove \u003Ccode\u003EEVAChuteSkill\u003C/code\u003E\u003Cbr\u003E\nMay preclude life-saving use of parachute in dire circumstances.\n\u003C/li\u003E\n\u003Cli\u003E\nPrevent EVA\u003Cbr\u003E\nCould be a massive unintentional inconvenience, e.g. kerbals who ran out of life support in a vessel without docking ports will not be able to EVA to board a rescue ship.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nKerbal Status Effects remedies all of the above, providing assurances of:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cb\u003EMod interoperability\u003C/b\u003E\n\u003Cp\u003E\nKerbal Status Effects serves as a common clearinghouse for all changes to kerbal skills, and will maintain consistency even when multiple mods apply status effects that touch the same skill.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003ERobust, will not break saves\u003C/b\u003E\n\u003Cp\u003E\nKerbal Status Effects does not touch any of the stock KSP crew roster data, and will not lead to broken saves under any circumstances.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a downstream mod is uninstalled, Kerbal Status Effects will notice that it is gone, and remove its associated status effects from all affected kerbals.\u003Cbr\u003E\nIf Kerbal Status Effects itself is uninstalled, no status effects will be applied and all kerbals effectively revert to their stock behavior.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EClear and informative\u003C/b\u003E\n\u003Cp\u003E\nInformation about kerbals and the status effects they are affected by will be clearly provided in UI. (Not implemented yet.)\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EPrecise impacts\u003C/b\u003E\n\u003Cp\u003E\nKerbal Status Effects permits precise changes to the skills of individual kerbals, with no unintended consequences.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nFor Players\n\u003C/p\u003E\n\u003Cp\u003E\nThere is nothing here for you yet. Come back later!\u003Cbr\u003E\nThis mod is currently not feature complete, please don\u0027t bother me with questions or feature requests.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nFor Modders\n\u003C/p\u003E\n\u003Cp\u003E\nThe mod is not fully feature complete yet, but it is in a functional enough state to be released for review and testing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou should be able to start work on integration into your mod, but please treat as a feature branch for now. You may release test builds, but please include clear warnings re: backing up saves, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Status Effects can currently parse definitions of status effects from config files, and the API for other mods to request for a status effect to be applied to/removed from kerbals is in place. Only skill deletions are possible at the moment, but this should suffice for any mod that currently turns crewmembers into tourists for the purpose of rendering them \u0022useless\u0022 or \u0022unable to do any work\u0022. Skill additions and modifications will come later; they\u0027re trickier to get right because of the need to enforce some kind of consistency when multiple mods apply status effects that touch the same skill.\n\u003C/p\u003E\n\u003Cp\u003E\nIntegration: only available as a hard dependency for now. This shouldn\u0027t be a massive deal-breaker, most use cases should not treat the dependency as optional.\u003Cbr\u003E\nNonetheless, wrapper code will be made available later™.\n\u003C/p\u003E\n\u003Cp\u003E\nA fully-fledged inspection and debugging tool is available by typing \u003Ccode\u003E/kse\u003C/code\u003E in the Ctrl-Alt-F12 console.\u003Cbr\u003E\u003Csmall\u003ECaveat: this command may be limited to debug builds only in the future. It might be a bit too dangerous in the hands of end-users.\u003C/small\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSee roadmap below for development plans.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nRoadmap\n\u003C/p\u003E\n\u003Cp\u003E\nThings that are in the pipeline:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cb\u003EAdding skills; modifying existing skills\u003C/b\u003E\u003Cbr\u003E\nThese are trickier to get right because of the need to enforce some kind of consistency when multiple mods apply status effects that touch the same skill.\u003Cbr\u003E\nBut I do have some ideas for how it can be done.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EUI\u003C/b\u003E\u003Cbr\u003E\nProvide better information to the player.\u003Cbr\u003E\nNote: Not a substitute for downstream mods having their own UI.\n\u003Cul\u003E\u003Cli\u003E\nStatus pane (per kerbal) to display all status effects they are affected by\n\u003C/li\u003E\n\u003Cli\u003E\nListing of kerbals affected by status effects, with sort/filter by:\n\u003Cul\u003E\u003Cli\u003E\nKerbal name\n\u003C/li\u003E\n\u003Cli\u003E\nKerbal specialization / class (\u003Ccode\u003ETrait\u003C/code\u003E)\n\u003C/li\u003E\n\u003Cli\u003E\nShow current vessel or EVA only\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ccode\u003ERosterStatus\u003C/code\u003E (\u003Ccode\u003EAssigned\u003C/code\u003E, \u003Ccode\u003EAvailable\u003C/code\u003E)\n\u003C/li\u003E\n\u003Cli\u003E\nStatus effect (also by source mod if it has multiple effects)\n\u003C/li\u003E\n\u003Cli\u003E\nNet impact on kerbal ( buff / debuff / incapacitated )\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nNotification when kerbal gains a status effect\n\u003Cul\u003E\u003Cli\u003E\nAllow suppression for routine (e.g. shift change) or pseudo-permanent (e.g. trained skill) statuses\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nToolbar integration (stock \u002B blizzy)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EWrapper code\u003C/b\u003E\u003Cbr\u003E\nTo avoid requiring a hard dependency.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EBetter / consolidated documentation for modders\u003C/b\u003E\u003Cbr\u003E\nThe source code is already heavily commented but it\u0027d probably be more convenient to consolidate all guidance into once place.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nLicense\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbal Status Effects plugin is released under the \u003Ca href=\u0022http://opensource.org/licenses/MIT\u0022 rel=\u0022external nofollow\u0022\u003EMIT License\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n~ ~ ~ ~ ~\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:20px;font-weight:bold;\u0022\u003E\nDownload\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://github.com/cake-pie/KerbalStatusEffects/releases/tag/v0.1.0\u0022 rel=\u0022external nofollow\u0022 style=\u0022font-size:18px;font-weight:bold;\u0022\u003EKerbal Status Effects v0.1.0\u003C/a\u003E for KSP 1.7.x\u003Cbr\u003E\u003Cspan style=\u0022color:#FF0000;font-weight:bold;\u0022\u003EWARNING: dev build for testing and integration purposes. Not intended for end-users.\u003C/span\u003E\u003Cbr\u003E\nThis has not been tested for backward compatibility with older versions of KSP.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E:\u003C/b\u003E Not supported. Do not ask, and do not add.\u003Cbr\u003E\nThis is not in a state that is suitable for general release to the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E masses.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cu\u003EInstallation:\u003C/u\u003E\u003C/b\u003E\u003Cbr\u003E\nDelete older version, if any.\u003Cbr\u003E\nPlace contents of GameData into your installation\u0027s GameData folder.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cu\u003ESource:\u003C/u\u003E\u003C/b\u003E \u003Ca href=\u0022https://github.com/cake-pie/KerbalStatusEffects\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cu\u003EChangelog:\u003C/u\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\nv0.1.0 ~ 2019-04-13 ~ KSP 1.7.0\nInitial Dev Build\n- skeletal functionality, no UI\n- supports only deletion of skills, no addition/modification\n- has not been tested for backward compatibility with older versions of KSP\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-16T00:48:55Z\u0022 title=\u002204/16/2019 12:48  AM\u0022 data-short=\u00225 yr\u0022\u003EApril 16, 2019\u003C/time\u003E by cakepie\u003C/strong\u003E\n\u003Cbr\u003Efix typos\n\u003C/span\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2019-04-14T18:20:56Z","Content":"\n\u003Cp\u003E\nI wondered if such a thing was possible, nice to see that it is and that you\u0027ve taken up the torch to make it happen! A mod like this would be a great companion for Snacks and offer additional challenges to players. Kudos to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69278-cakepie/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269278\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69278-cakepie/\u0022 rel=\u0022\u0022\u003E@cakepie\u003C/a\u003E for making this possible! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"theonegalen","CreatedById":71012,"CreatedDateTime":"2019-04-14T21:54:09Z","Content":"\n\u003Cp\u003E\nFantastic!\n\u003C/p\u003E\n\u003Cp\u003E\n/10thDoctor\n\u003C/p\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2019-04-14T23:00:44Z","Content":"\n\u003Cp\u003E\nInteresting. I\u0027d like to try and implement this approach in Kerbal Health. Is there any manual for integrating it in mods?\n\u003C/p\u003E\n"},{"CreatedByName":"cakepie","CreatedById":69278,"CreatedDateTime":"2019-04-15T00:46:24Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141813-garwel/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022141813\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141813-garwel/\u0022 rel=\u0022\u0022\u003E@garwel\u003C/a\u003E Besides stuff already mentioned in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E above there is also some additional guidance that I offered to wile1411 for Duty Roster over at \u003Ca href=\u0022https://github.com/wile1411/DutyRoster/pull/1\u0022 rel=\u0022external nofollow\u0022\u003Ethis PR\u003C/a\u003E.\u003Cbr\u003E\nIt should be sufficient to bootstrap any implementation of a touristification alternative.\n\u003C/p\u003E\n\u003Cp\u003E\nOther than that I haven\u0027t gotten around to any documentation beyond comments in my source code. Look in \u003Ca href=\u0022https://github.com/cake-pie/KerbalStatusEffects/tree/dev/Source\u0022 rel=\u0022external nofollow\u0022\u003EKSE\u0027s dev branch\u003C/a\u003E.\u003Cbr\u003E\nIf you care about what you can put in your status effect definition and how it will get parsed, check \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EStatusEffect.cs\u003C/span\u003E.\u003Cbr\u003E\nPublic-Facing API is in a clearly marked region in \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EKSEAddon.cs\u003C/span\u003E, though it\u0027s most likely more convenient to use extension methods provided in \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EKSExtensions.cs\u003C/span\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, I strongly recommend doing any implementation in a feature branch -- not even dev branch -- so as not to contaminate your existing workflow for an existing released mod.\u003Cbr\u003E\nIt may take a while for Kerbal Status Effects to get properly fleshed out, in its current state I\u0027d consider it more like a tech demo, not even a beta build.\n\u003C/p\u003E\n"},{"CreatedByName":"cyberKerb","CreatedById":28891,"CreatedDateTime":"2019-04-15T20:52:14Z","Content":"\n\u003Cp\u003E\nAwesome!. This should be interesting to implement. I finally have some time to code and will do some testing  with Duty Roster tonight.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso adding obligatory \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E ping to see if this is something they could support in the future stock API somehow to increase available modding support.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-15T20:57:58Z\u0022 title=\u002204/15/2019 08:57  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 15, 2019\u003C/time\u003E by wile1411\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Beetlecat","CreatedById":92207,"CreatedDateTime":"2019-04-15T21:42:51Z","Content":"\n\u003Cp\u003E\nFantastic idea and presentation. Looking forward to watching this develop/deploy \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}