{"TopicId":183975,"ForumId":70,"TopicTitle":"New Kerbinaut - Mod Question","CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2019-04-23T14:21:46Z","PageNum":1,"Articles":[{"CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2019-04-23T14:21:46Z","Content":"\n\u003Cp\u003E\nSorry if I missed something dumb here but I just installed my first mod - the small solar system and it\u0027s textures - I\u0027m sure I unpacked the files in the right folder so - how do I get them to show up in my game?  I relaunched it and still see the old vanilla names and planet terrain.  \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for any insight...\n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2019-04-23T17:54:20Z","Content":"\n\u003Cp\u003E\nCould you be more specific about the exact name of the mod? There’s more than one result when googling. Or you can link to the source you got it from.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of the solar system modification mods depend on the Kopernicus mod and possibly the Sigma Dimensions mod to do the “under the hood” work to make them function. Do you have those installed as well?\n\u003C/p\u003E\n\u003Cp\u003E\nAs a test case, you may want to try installing a standalone mod like Kerbal Engineer Redux to make sure you’re installing mods correctly. (I picked this one because just about everybody has it, and its extra useful. You can always uninstall later.)\n\u003C/p\u003E\n"},{"CreatedByName":"Heirloom","CreatedById":188594,"CreatedDateTime":"2019-04-25T06:42:05Z","Content":"\n\u003Cp\u003E\nDid you place the mod in the GameData folder? And if you did, did you place the .zip or the folder? Because if I recall KSP won\u0027t accept mods in a .zip file. Additionally do you have Kopernicus and the other requirements for that mod? Small solar system is a bit vague but I assume you meant Stock Size Real Solar System. That I believe is not updated for KSP 1.7 yet I believe. But since it\u0027s just a planet pack, it\u0027s likely it will work with 1.7.\n\u003C/p\u003E\n"},{"CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2019-04-27T15:51:13Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022Capture.JPG\u0022 class=\u0022ipsImage\u0022 height=\u0022330\u0022 src=\u0022http://peteyboy.net/PICS/Capture.JPG\u0022 width=\u0022613\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere is a shot of my Gamedata files.  Right now my KSP launches and runs but when I start a new game under sandbox and head over to the tracking station I still see Kerbin and Mun etc...  Can you spot anything I did wrong?\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2019-04-27T16:05:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223590262\u0022 data-ipsquote-contentid=\u0022183975\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556380273\u0022 data-ipsquote-userid=\u002292717\u0022 data-ipsquote-username=\u0022GungaDin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, GungaDin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere is a shot of my Gamedata files.  Right now my KSP launches and runs but when I start a new game under sandbox and head over to the tracking station I still see Kerbin and Mun etc...  Can you spot anything I did wrong?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, the \u0022-master\u0022 part is a GitHub thing that generally means you downloaded the wrong file for that mod (source instead of releases).\n\u003C/p\u003E\n\u003Cp\u003E\nOther than that, you\u0027ve only got ModuleManager, Kopernicus, and some textures. You\u0027re missing a mod that would contain new data for planets and orbits. Looks like you tried to install something like QuarterRSS?\n\u003C/p\u003E\n"}]}