{"TopicId":184010,"ForumId":16,"TopicTitle":"Large Spaceplane Wings","CreatedByName":"Chris Hopkins","CreatedById":196733,"CreatedDateTime":"2019-04-25T12:18:03Z","PageNum":1,"Articles":[{"CreatedByName":"Chris Hopkins","CreatedById":196733,"CreatedDateTime":"2019-04-25T12:18:03Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m having trouble with my larger spaceplanes getting wings that are big enough using stock parts. Checking out the designs on KerbalX i see a lot of people crack this by variations on the theme of using two delta wings to form a square. Several of these form a large flat expanse, then it\u0027s more delta wings to make one huge wing. Alternatively the wing connectors can be used to similar effect. So far so good.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever the problem I hit with this technique is the classic \u0022a part can only have two connections\u0022*. Therefore my wings have near zero rigidity and I end up using struts to shore the whole thing up. It works, but it\u0027s messy. Is there a trick I\u0027m missing? I look at other\u0027s designs and they don\u0027t have this mess of struts but when I try and copy their designs I get the parts phasing through each other (Yes I know collision detection doesn\u0027t function between parts on the same craft so there is no rigidity gained from overlapping the parts). Is there some cunning way to bond parts together other than using a strut?\n\u003C/p\u003E\n\u003Cp\u003E\n*actually I hit several other issues including the part placer doing anything other that putting it where I want, and attaching in any rotation but the one that makes sense, but that\u0027s what the move/rotate tools are for :-) \n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-04-25T14:19:15Z","Content":"\n\u003Cp\u003E\nSounds like you haven\u0027t heard about autostruts? You need to turn on Advanced Tweakables in the settings.\n\u003C/p\u003E\n"},{"CreatedByName":"Chris Hopkins","CreatedById":196733,"CreatedDateTime":"2019-04-25T14:43:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223589359\u0022 data-ipsquote-contentid=\u0022184010\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556201955\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSounds like you haven\u0027t heard about autostruts? You need to turn on Advanced Tweakables in the settings.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah I keep hearing about them, but without context I\u0027ve no idea what they are. I\u0027d searched \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://wiki.kerbalspaceprogram.com\u003C/a\u003E but nothing really enlightening on there.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll see if I can find them next chance I get to play.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-04-25T16:59:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223589369\u0022 data-ipsquote-contentid=\u0022184010\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556203389\u0022 data-ipsquote-userid=\u0022196733\u0022 data-ipsquote-username=\u0022Chris Hopkins\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Chris Hopkins said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah I keep hearing about them, but without context I\u0027ve no idea what they are. I\u0027d searched \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://wiki.kerbalspaceprogram.com\u003C/a\u003E but nothing really enlightening on there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, the wiki seems... curiously mum on the subject of autostruts.  Really oughta have an article there.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s the idea behind autostruts:\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re familiar with the \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/EAS-4_Strut_Connector\u0022 rel=\u0022external nofollow\u0022\u003EEAS-4 Strut Connector\u003C/a\u003E, yes?  It\u0027s that part that you can place where you attach the two ends wherever you want, and it holds them rigid.  Useful for making a ship stronger / stiffer... but it comes at the cost of weight and drag (struts are heavy and draggy), and also the fact that it\u0027s a physical part and has to be a straight line places some constraints on where you can put them.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, an \u0022autostrut\u0022 is \u003Cem\u003E\u003Cu\u003Efunctionally\u003C/u\u003E\u003C/em\u003E similar to a physical strut-- in that it connects two different parts, and holds them fairly rigidly in the same position with respect to each other.  However, it\u0027s not a physical part, and has no mass or drag.  It\u0027s just part of the hidden internal physics model that the game uses when putting stresses on a craft.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostruts are always available in sandbox games.  In career mode, they\u0027re only available after you\u0027ve unlocked the necessary tech node, which (I think) is General Construction.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be able to \u003Cem\u003E\u003Cu\u003Ework\u003C/u\u003E\u003C/em\u003E with them, though, you need to have Advanced Tweakables turned on in the game settings, as bewing mentions above.\n\u003C/p\u003E\n\u003Cp\u003E\nIf they\u0027re available to you (because you\u0027re in a sandbox game, or a career game after getting General Construction), and if you have Advanced Tweakables turned on, then you can see them on a part\u0027s right-click menu, either in the vehicle editor or in flight.  For example:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DoVBbPU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022325\u0022 src=\u0022https://i.imgur.com/DoVBbPU.png\u0022 width=\u0022493\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nClicking the button allows toggling among the various autostrut modes.  The choices are:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EDisabled.\u003C/strong\u003E  (This is the default.)  No autostruts are applied to the part.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EHeaviest part.\u003C/strong\u003E  Generates an auto-strut to the heaviest part in the ship (or set of parts, if it\u0027s a symmetry group).  Note that this is dynamic:  if \u0022which part is heaviest\u0022 \u003Cu\u003E\u003Cem\u003Echanges\u003C/em\u003E\u003C/u\u003E (e.g. with docking/undocking, or a fuel tank emptying), then it\u0027ll switch to the new heaviest part.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERoot part.\u003C/strong\u003E  Generates an auto-strut to the root part of the ship.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGrandparent part.\u003C/strong\u003E  Generates an auto-strut to the parent part of this part\u0027s parent.  This is chiefly useful for things like radial boosters:  i.e. you attach a decoupler to the central core, then you attach a fuel tank or whatever to the decoupler.  You can set that fuel tank to \u0022autostrut grandparent part\u0022 and it\u0027ll be locked to the central component, which is typically what you want.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAdvantages of autostruts:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nNo mass\n\u003C/li\u003E\n\u003Cli\u003E\nNo drag\n\u003C/li\u003E\n\u003Cli\u003E\nThey\u0027re free (no part cost)\n\u003C/li\u003E\n\u003Cli\u003E\nThey\u0027re not \u003Cem\u003E\u003Cu\u003Ephysical\u003C/u\u003E\u003C/em\u003E pieces, so there\u0027s no constraint about their maximum length, or whether there are any other pieces in between the two parts that are autostrutted together.\n\u003C/li\u003E\n\u003Cli\u003E\nYou can edit them \u003Cem\u003E\u003Cu\u003Ewhile in flight\u003C/u\u003E\u003C/em\u003E, not just in the editor.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDisadvantages of autostruts:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nJudicious use in just the right strategic spots is fine, but don\u0027t go nuts and \u003Cem\u003E\u003Cu\u003Espam\u003C/u\u003E\u003C/em\u003E them everywhere.  They complicate the physics model and (if abused) can slow down your frame rate and/or can attract the kraken.\n\u003C/li\u003E\n\u003Cli\u003E\nSome might call them \u0022cheaty\u0022, if you\u0027re the kind of person who cares about that (I\u0027m not, myself) \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/li\u003E\n\u003Cli\u003E\nSince you can\u0027t see them, it\u0027s easy to forget that they\u0027re there, which means it can sometimes be non-obvious why a ship is behaving as it does.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nPersonally, I use them, but sparingly.  I will commonly use the \u0022autostrut grandparent part\u0022 for radial boosters-- but usually it\u0027s \u003Cem\u003E\u003Cu\u003Eonly\u003C/u\u003E\u003C/em\u003E there.\n\u003C/p\u003E\n"},{"CreatedByName":"Aeroboi","CreatedById":186653,"CreatedDateTime":"2019-04-25T18:24:08Z","Content":"\n\u003Cp\u003E\nI would start to recommend autostrut use. If you have *one stack (*one serial stage without boosters that is) it is best to only use grandparent on that length between the parts and every exterior part to root including the rear end which are engines presumably. That stiffens the vessel over it\u0027s length.\u003Cbr\u003E\nWhen using a parallel stage on top of the serial (a pair of boosters) it is best to use grandparent to the tank directly attached to the tank, or decoupler (also set to grandparent)\u003Cbr\u003E\nThe other tanks or parts should be welded to heaviest with the fwt and aft parts set to root. When adding a parallel booster make sure you place the first fuel tank in or close to the middle of the center stack so the grandparent connection of the pair is connected through the center.\u003Cbr\u003E\nDon\u0027t use rigid attachment when used under stress like flight and high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E rockets. Rigid attachment is best used for very loose constructional pieces that tend to flex like on a rover or base.\n\u003C/p\u003E\n\u003Cp\u003E\nI consider myself a expert at wing design especially using larger space planes. I have a space plane that takes close to 1.5 Kiloton to orbit using massive wide Big-S wings.\u003Cbr\u003E\u003Ca href=\u0022https://kerbalx.com/Aeroboi/Hearts-Chevron-96-Cargo-Lifter-2375MC\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Aeroboi/Hearts-Chevron-96-Cargo-Lifter-2375MC\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\nAlways strut wing pieces to the heaviest part. Make sure that the wing pieces are moved (move:tool) as much away from one another as possible without leaving a gap. If you attach a Big-S wing straight on you will always be able to move one away from the other before the gap occurs. There\u0027s also a slight uneven alignment so use rotate to mirror the other. If wings are close to each other during stress they tend to fall off. If the wing construction isn\u0027t wide then the stress is within limits, in that case seperating wing pieces away from each other shouldn\u0027t be necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that there\u0027s a secret but annoying workaround to large wing design. That is placing each wing piece seperately from the other. Let\u0027s say the whole wing would want to be attached to a center fuel tank then the first piece is placed. Instead of placing the 2nd piece on the first piece you place it directly to the tank and then use move and rotate to place it as you want, expectedly as it would if you connected it directly. Continue until the wing is made. Remember you can hold Shift while dragging a part to offset it to unlimited range. If the wing is placed to much forward you need to move each wing piece one by one until the center of lift is in the proper direction. This may seem tedious but I\u0027ve got a hand in it, as you will with practice.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-25T18:24:53Z\u0022 title=\u002204/25/2019 06:24  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 25, 2019\u003C/time\u003E by Aeroboi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Serenity","CreatedById":179192,"CreatedDateTime":"2019-04-26T01:46:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223589418\u0022 data-ipsquote-contentid=\u0022184010\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556211560\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EHeaviest part.\u003C/strong\u003E  Generates an auto-strut to the heaviest part in the ship (or set of parts, if it\u0027s a symmetry group).  Note that this is dynamic:  if \u0022which part is heaviest\u0022 \u003Cu\u003E\u003Cem\u003Echanges\u003C/em\u003E\u003C/u\u003E (e.g. with docking/undocking, or a fuel tank emptying), then it\u0027ll switch to the new heaviest part.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf i may i add that you should be VERY carefull when to use it.When the heaviest part changes it might cause kraken to attack.So try to avoid it especially if you plan to dock with something that has a part that is heavier than any of the parts of your current vessel.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-26T02:45:10Z\u0022 title=\u002204/26/2019 02:45  AM\u0022 data-short=\u00225 yr\u0022\u003EApril 26, 2019\u003C/time\u003E by Boyster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chris Hopkins","CreatedById":196733,"CreatedDateTime":"2019-04-26T07:47:29Z","Content":"\n\u003Cp\u003E\nThanks everyone for this amazing help. Lots for me to digest and experiment with here so I\u0027ll look forwards to having a play next chance I get.\n\u003C/p\u003E\n\u003Cp\u003E\nReally blown away, thank you.\n\u003C/p\u003E\n"},{"CreatedByName":"Chris Hopkins","CreatedById":196733,"CreatedDateTime":"2019-05-07T08:39:51Z","Content":"\n\u003Cp\u003E\nThanks everyone, I had a chance to experiment with this over the weekend. Success!\n\u003C/p\u003E\n\u003Cp\u003E\nExcept now the plane re-enters the atmosphere backwards because I got carried away with engine placement and my \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E when the fuel tanks are almost empty is now behind the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E. It\u0027s okay I *think* I know how to fix this. \u003Cspan\u003E:-)\u003C/span\u003E\n\u003C/p\u003E\n"}]}