{"TopicId":18431,"ForumId":16,"TopicTitle":"Need advice on the final approach in an orbital rendezvous","CreatedByName":"lowey2002","CreatedById":43818,"CreatedDateTime":"2012-09-02T07:11:05Z","PageNum":1,"Articles":[{"CreatedByName":"lowey2002","CreatedById":43818,"CreatedDateTime":"2012-09-02T07:11:05Z","Content":"\n\u003Cp\u003EI\u0027ve made a couple of serious attempts at an orbital rendezvous using stock parts and I am having problems when the two vehicles are in the 300m -\u0026gt; 800m range. Here is what I am doing - I send the first vehicle into a perfectly circular 250km orbit. I launch the second vehicle when the first is about 25 degrees from the launch pad so they are a near match when I get the second into orbit. I correct any variations in the inclination when the orbits cross and push the apoapsis of the leading vehicle out a little and time warp through a couple of orbits until they catch up to each other and finally return both vehicles to a matching orbit.\u003C/p\u003E\u003Cp\u003EAt this stage I have two vehicles in a matching orbit, about 1km from one another each with three full RCS tanks. I\u0027ve tried burning hard with the RCS towards one another but this pushes the orbit out of phase and they fall away from one other before I get close enough to attach to one another using the landing struts. I\u0027ve tried burning in slowly, swapping between vehicles while keeping an eye of the orbits but then I tend to burn through all six RCS tanks before I get closer than say 300m. \u003C/p\u003E\u003Cp\u003EObviously these kind of maneuvers take a long time and I\u0027ve spent about 6 hours now trying to perform a rendezvous. I\u0027m about ready to give up but I was wondering if anyone has some advice or tricks to make that final approach.\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-09-02T08:06:24Z","Content":"\n\u003Cp\u003EYou should only use RCS for the final approach (300m is good), because their lack of thrust means you will run out of fuel before you can do anything. Be sure to kill sideways velocity along both axes, then throttle a bit (or use RCS) and let your ship drift closer. Correct your course every now and then, and when you\u0027re getting very close, RCS should be enough to dock.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/j9awNdXKHto?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E may help you.\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-09-02T08:21:40Z","Content":"\n\u003Cp\u003EBy swithing between craft youre exagerating your maneuvers by two. Dont switch. There are heaps of tutes to help with the rest. Post back when you make it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lowey2002","CreatedById":43818,"CreatedDateTime":"2012-09-02T10:37:42Z","Content":"\n\u003Cp\u003EGreat success! Thanks for your help togfox and Cykyrios - I managed to pull off a successful rendezvous. I wasn\u0027t able to grapple the two vehicles together but came to the conclusion that I didn\u0027t mount the landing gears correctly and was nudging the other craft away despite being perfectly aligned. Despite this I count it as a huge success. \u003C/p\u003E\u003Cp\u003EThe \u0027ohh!\u0027 moment came when I was watching Scott Manleys tutorial and he stressed the importance of keeping your orientation static. My mistake was that I was yawing and pitching around which made RCS translations a lot harder than it already is. I also re-designed my vehicles to the small one man capsule which balanced out the RCS thrust. It was actually pretty easy when I could confidently translate in the correct direction.\u003C/p\u003E\n"}]}