{"TopicId":184479,"ForumId":55,"TopicTitle":"What is the point?","CreatedByName":"jagfour","CreatedById":32331,"CreatedDateTime":"2019-05-14T09:58:25Z","PageNum":1,"Articles":[{"CreatedByName":"jagfour","CreatedById":32331,"CreatedDateTime":"2019-05-14T09:58:25Z","Content":"\n\u003Cp\u003E\nI love this game. I watched Neil, live, when he took that first step. I was 7. At about aged 50, KSP arrived. Thanks Squad.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a few years now I have found that once I get all the science needed to get ALL the toys, I feel that I have achieved enough and lose all incentive to carry on. The next upgrade gets released, and the cycle is restarted. I got all the toys. Job done.\n\u003C/p\u003E\n\u003Cp\u003E\nRecently I bought, what I hope will be, a fantastic car production game that is in Alpha. The developer is full hands on, getting and considering all feedback from we, the testers/owners of his game. But, like KSP, once you have built a fully updated car production line, the interest seems to fizzle out. Limited goals are there to achieve in the game, but there is no or very little pressure. No opponent to beat.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, lets look back to how and why Neil was able to make that first step.\n\u003C/p\u003E\n\u003Cp\u003E\nIn late 1945, the greatest world conflict finally came to an end. But, what an end. The first use of a nuclear weapon. The most fearsome instrument of war that may never be beaten. But across the Atlantic was another new power that had at its disposal, the biggest military might that had just thrust aside the biggest monster to sweep through Europe. But this military might was missing one thing. The nuclear weapon!\n\u003C/p\u003E\n\u003Cp\u003E\nWar, does one thing to technology. It turbo charges it. Technological advancement is fastest in times of war because if you stand still, the enemy will beat you. With the second world war producing 2 new superpowers, superpowers that were politically and culturally at opposite ends to each other, a new war was started. The cold war.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were many a twist and turn in the following decades with East and West vying for both technological advancement and political kudos.\n\u003C/p\u003E\n\u003Cp\u003E\nSo steps forward a man with a vision to \u0027go to the moon. Not because it was easy, but because it was hard!\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen he said that, there weren\u0027t even the materials in existence needed to achieve it. And, there was another little fact that may have been difficult to beat. Time.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do all these constraints produce? Pressure!\n\u003C/p\u003E\n\u003Cp\u003E\nPressure in life creates stress. Stress and the need to have stress in life creates incentive. The incentive to keep going, find answers to tough questions. Discover new things, new ideas, new processes. Testing. Improving. MONEY!\n\u003C/p\u003E\n\u003Cp\u003E\nHow could this be achieved in KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nCreate a government or power that states goals to achieve. Time constraints. Financial constraints. Resource constraints. Personnel and training requirements. Goal post\u0027s moving. Goal post\u0027s changing. etc. etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThis in itself would need to be worked on by Squad, maybe even hiring new personnel with different skill sets to create this kind of DLC that I would rip their arm off to have in this great game.\n\u003C/p\u003E\n\u003Cp\u003E\nDiscuss.\n\u003C/p\u003E\n\u003Cp\u003E\nPS\n\u003C/p\u003E\n\u003Cp\u003E\nFor the youngsters out there, the 50th anniversary of Neil taking that step is this Summer. Do not ignore it\u0027s celebration. It will be on a TV somewhere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-14T10:02:48Z\u0022 title=\u002205/14/2019 10:02  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 14, 2019\u003C/time\u003E by jagfour\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AVaughan","CreatedById":152784,"CreatedDateTime":"2019-05-14T10:43:28Z","Content":"\n\u003Cp\u003E\nMy suggestion is to set yourself a new challenge.  Eg, play with \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E \u002B RP-1 and land people/kerbals on Mars.  (Or even just add a planet pack, and  aim to land on every planet/moon.  For more challenge add a life support mod and a x2.5 or x3.2 rescale).\n\u003C/p\u003E\n"},{"CreatedByName":"kirmie44","CreatedById":73929,"CreatedDateTime":"2019-05-18T21:07:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProblems with science:\n\u003C/p\u003E\n\u003Cp\u003E\n     In real life, there isn\u0027t the direct correlation seen in ksp between science as we see it in the game and the advancements made in technology. The relationship in real life is 90% of the time closer to finding new problems we have to solve. This is never a problem in ksp because we are given all the information about all the star, all the planets and everything in between. what is the point of bringing a barometer to a planet where you already know everything about its atmosphere? In the real world, we had tests to see if space was a vacuum, we had to run many tests to see if we could pressurize a capsule, and we had little idea about any of the stuff we know until we sent something there to test it (Think about our recent visit of Pluto).\n\u003C/p\u003E\n\u003Cp\u003E\nProblems with technological advancements:\n\u003C/p\u003E\n\u003Cp\u003E\n    The other problem with how career mode/science mode was made was almost systemic. I feel like what was implemented wasn\u0027t there original gameplan. I\u0027ve come to this conclusion because of how little their parts actually fit into the tec tree idea they have implemented. The tec in the game was not designed to go into a tec tree. For the most part, the \u0022tec level\u0022 is based on the size of a part and not actually how much knowledge was needed to build it. What I want to see is the implementation of iterative designs.\n\u003C/p\u003E\n\u003Cp\u003E\nMy solution:\n\u003C/p\u003E\n\u003Cp\u003E\n   Basically, you start out with a lot of junk parts. These parts look bad, don\u0027t work well, probably fail in environments outside of Kerbin sea level, and for good measure, have a base fail chance. Along with taking missions to study your solar system (of which you know nothing about), you would also take missions from your science team to help them improve your parts. unlike the test missions given off now. These missions would give you credits towards upgrading our parts. Along with these missions to give you credits. there would be general things like allowing engines to work in a vacuum, water, restart, throttle, etc. (All things we had to learn, and are still learning, in the field). This science would be collected by doing things like the barometric test and temperature tests we see in KSP today.\n\u003C/p\u003E\n\u003Cp\u003E\nA good way to think of this is the first capsule ou send to space should always be empty. It needs to be tested first. Without things like this, this game is missing out on some of the best parts of our job in exploring the world and beyond!\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2019-05-19T10:24:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601371\u0022 data-ipsquote-contentid=\u0022184479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558213651\u0022 data-ipsquote-userid=\u002273929\u0022 data-ipsquote-username=\u0022kirmie44\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, kirmie44 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA good way to think of this is the first capsule ou send to space should always be empty. It needs to be tested first. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut there is no consequence if you send someone on the first flight - unless some in-game script won\u0027t allow you to put a crew member inside, you do what you want. The capsule won\u0027t explode on its own if you fly it perfectly. And you can\u0027t just - again - make the first test fail every time you start new career, it\u0027s a bad idea for gameplay.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only solution here is some kind of penalty from a contract\n\u003C/p\u003E\n"},{"CreatedByName":"jagfour","CreatedById":32331,"CreatedDateTime":"2019-05-19T16:59:48Z","Content":"\n\u003Cp\u003E\nWe are missing the kerbal government. How about hiring the staff at a cost. I mean, we could need 400k engineers to get to Mun. Thats a lot of money that can only come from a government. You then have the time versus cost aspect. Are you going to make it on time with what you have. What about the Kerbal population. Do they want us to go to Mun or Tylo. Do they complain about cost or want more spent? What about a change in government. Will they be for or against space travel. Testing stations, LUT\u0027s. Where are my LUT building blocks? Where are the controlled gas escape on charged tanks, or the tons of ice that fall off the ship when the engines are lit?\n\u003C/p\u003E\n\u003Cp\u003E\nSo much more can be added to this game. My wallet is ready to pay for the DLC\u0027s that will and may be coming.\n\u003C/p\u003E\n"},{"CreatedByName":"kirmie44","CreatedById":73929,"CreatedDateTime":"2019-05-20T04:07:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601558\u0022 data-ipsquote-contentid=\u0022184479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558261453\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut there is no consequence if you send someone on the first flight - unless some in-game script won\u0027t allow you to put a crew member inside, you do what you want. The capsule won\u0027t explode on its own if you fly it perfectly. And you can\u0027t just - again - make the first test fail every time you start new career, it\u0027s a bad idea for gameplay.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only solution here is some kind of penalty from a contract\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Found 1 error in text\u0022\u003E\n1\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot that you couldn\u0027t, but you shouldn\u0027t. Like it\u0027s very easy to get ahead of yourself (Think Apollo 1). This would be implemented through the failure factors listed in the previous part. By testing something in the feild, the part is less likely to fail.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601682\u0022 data-ipsquote-contentid=\u0022184479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558285188\u0022 data-ipsquote-userid=\u002232331\u0022 data-ipsquote-username=\u0022jagfour\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, jagfour said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe are missing the kerbal government. How about hiring the staff at a cost. I mean, we could need 400k engineers to get to Mun. Thats a lot of money that can only come from a government. You then have the time versus cost aspect. Are you going to make it on time with what you have. What about the Kerbal population. Do they want us to go to Mun or Tylo. Do they complain about cost or want more spent? What about a change in government. Will they be for or against space travel. Testing stations, LUT\u0027s. Where are my LUT building blocks? Where are the controlled gas escape on charged tanks, or the tons of ice that fall off the ship when the engines are lit?\n\u003C/p\u003E\n\u003Cp\u003E\nSo much more can be added to this game. My wallet is ready to pay for the DLC\u0027s that will and may be coming.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with you to an extent. Only the government is a bit harsh. I do agree that they should go into that sort of thing though. They should take a play from X-Coms book. I loved how they included the monthly operating cost each month and how it went so far as to include the cost of the Skyrangers upkeep. \n\u003C/p\u003E\n\u003Cp\u003E\nIt would be cool if they could have you choose if you wanted to be privately funded (having less funding but more free will) or government-run (vise-versa / everything you listed)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, TEST STATIONS WOULD BE THE BEST! but that could be getting to realistic for some. In my perfect game, they would be in it, probably along with construction time. \n\u003C/p\u003E\n\u003Cp\u003E\nSomething else that would be nice would be true reusability. Like building a launch vehicle that can be reloaded instead of these mods that just refund you for the parts.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-20T04:18:43Z\u0022 title=\u002205/20/2019 04:18  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 20, 2019\u003C/time\u003E by kirmie44\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"k00b","CreatedById":196331,"CreatedDateTime":"2019-05-21T15:46:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223598598\u0022 data-ipsquote-contentid=\u0022184479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221557827905\u0022 data-ipsquote-userid=\u002232331\u0022 data-ipsquote-username=\u0022jagfour\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/14/2019 at 10:58 AM, jagfour said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI love this game.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a few years now [snip], I feel that I have achieved enough and lose all incentive to carry on.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyour percieved \u0022loss of incentive\u0022 is taking a fair while to catch up to the speculation...\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2019-05-23T06:13:48Z","Content":"\n\u003Cp\u003E\nYour problem is what you find to be the solution. The goal of KSP is to learn the math and the science behind space travel and then to put it into practice. They dont teach the math of course \u003Cimg alt=\u0022-_-\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 title=\u0022-_-\u0022\u003E but that\u0027s what happens when you try to service a larger player base. Point in case, the goal isnt \u0022obtaining all the toys\u0022, it\u0027s actually \u0022doing all the things\u0022 with those toys. Again I reiterate, it\u0027s difficult to do that as a newbie with no mathematical idea of how to do anything. But once you learn the equations and start really practicing with them. A jump from the Kerbin system into Interplanetary space isnt so difficult anymore. After that it\u0027s just.. more math. If that\u0027s not what you\u0027re into, no biggie. The game wont punish you for that. The devs just want you to have fun. \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-05-23T06:57:17Z","Content":"\n\u003Cp\u003E\nInstall KRND... endless part upgrades.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep researching until you have a reusable Eve \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E, then start a Jool Limbo... how low can you go?\n\u003C/p\u003E\n\u003Cp\u003E\nThen install Kopernicus and sigma dimensions, try a 2x solar system... then 3x, then 4x... (at this point, you\u0027ll really want KRND upgrades).\n\u003C/p\u003E\n\u003Cp\u003E\nIts a sandbox game.... the point is only ever what you make it... participate in forum challenges (I guess they wanted to incorporate this into the game somehow in the form of user made missions, but I think the overall consensus on that was ... \u0022meh\u0022)\n\u003C/p\u003E\n"}]}