{"TopicId":18496,"ForumId":18,"TopicTitle":"Next to the moon?","CreatedByName":"McWane","CreatedById":25992,"CreatedDateTime":"2012-09-03T02:58:56Z","PageNum":1,"Articles":[{"CreatedByName":"McWane","CreatedById":25992,"CreatedDateTime":"2012-09-03T02:58:56Z","Content":"\n\u003Cp\u003EAny thoughts on who\u0027s going to the moon next? I had a thought of the chinese landing next to one of the US\u0027s landing spots and tearing down the flag and wrecking all the stuff we left behind \u0026gt;.\u0026lt; I personally hope they don\u0027t do that(Plus why would they do that XD) I personally think the EU will be the next to live their footprints.\u003C/p\u003E\n"},{"CreatedByName":"Tupin","CreatedById":27762,"CreatedDateTime":"2012-09-03T03:28:21Z","Content":"\n\u003Cp\u003EThat won\u0027t happen, but I could see the EU or China landing on the moon next. They obviously would avoid former landing spots. There was a controversy about the Lunar X Prize landing near it, and NASA suggested they didn\u0027t land within a certain area.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2012-09-03T09:42:07Z","Content":"\n\u003Cp\u003EI wonder why would they ask others to avoid those sites. It would certainly put an end to all those conspiracy theories. One way or the other.\u003C/p\u003E\u003Cp\u003EI wasn\u0027t aware that ESA had a plan to land a human on the moon in near future.\u003C/p\u003E\u003Cp\u003EChina or North Korea (NK with its Kerbalesque approach) would be my guess.\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-09-03T10:05:05Z","Content":"\n\u003Cp\u003EOkay, I\u0027ll weigh in here.\u003C/p\u003E\u003Cp\u003EWhilst I\u0027m a science teacher, I am also trained in History[1]. We have a unique opportunity with the Apollo landing sites - namely, those sites will be preserved in pristine condition forever unless they are hit by a meteoroid (which is highly unlikely) or disturbed by human activities. \u003C/p\u003E\u003Cp\u003EFor that reason, I believe that it is imperative that those sites remain as undisturbed as possible. Remember that even the slightest error could compromise the integrity of the sites. Therefore before any program (national or corporate) tries to visit one of the landing sites, I\u0027d say it is critical that they formulate a plan of how to do so without any potential of disturbing the site. And one thing to remember is that even the footprints (at least at the Apollo 11 site) have historical significance.\u003C/p\u003E\u003Cp\u003E[1] As far as I am aware, I am the only person to have ever graduated from my university with a Bachelor of Arts in History, minoring in Chemistry and with a diploma of Education. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2012-09-03T10:53:49Z","Content":"\n\u003Cp\u003ESure it\u0027s important to preserve Appolo 11 site. But there are others where that significance diminishes.\u003C/p\u003E\u003Cp\u003EIf you designate every spot a one time landing site, you\u0027ll run out landing zones.\u003C/p\u003E\u003Cp\u003EPreserve one or two, let the others be visitable.\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-09-03T11:51:41Z","Content":"\n\u003Cp\u003EThat\u0027s fairly similar to NASA\u0027s proposed approach. They want serious exclusion zones around the Apollo 11 and 17 sites. They are a little more relaxed about visits to other Apollo landing sites, but ask people to remember that they have some experiments that are still operational, and also request that people \u0022look but don\u0027t touch\u0022.\u003C/p\u003E\u003Cp\u003EOn the other hand, they\u0027ve presented a list of objects that could be examined as part of a serious research program into Apollo 15, and have demonstrated that you could achieve a lot of worthwhile observations with a rover that was equipped only with an HD camera.\u003C/p\u003E\u003Cp\u003EDetails of their proposal:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/pdf/617743main_NASA-USG_LUNAR_HISTORIC_SITES_RevA-508.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/pdf/617743main_NASA-USG_LUNAR_HISTORIC_SITES_RevA-508.pdf\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2012-09-03T12:26:53Z","Content":"\n\u003Cp\u003EIf anyone goes back to the moon it\u0027ll undoubtedly be the Chinese, largely for flag-waving purposes. They\u0027re the only folks with a serious moon programme, and with the political will and resources to make it happen.\u003C/p\u003E\n"},{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-09-03T13:24:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003EThat\u0027s fairly similar to NASA\u0027s proposed approach. They want serious exclusion zones around the Apollo 11 and 17 sites. They are a little more relaxed about visits to other Apollo landing sites, but ask people to remember that they have some experiments that are still operational, and also request that people \u0022look but don\u0027t touch\u0022.\u003Cp\u003EOn the other hand, they\u0027ve presented a list of objects that could be examined as part of a serious research program into Apollo 15, and have demonstrated that you could achieve a lot of worthwhile observations with a rover that was equipped only with an HD camera.\u003C/p\u003E\u003Cp\u003EDetails of their proposal:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/pdf/617743main_NASA-USG_LUNAR_HISTORIC_SITES_RevA-508.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/pdf/617743main_NASA-USG_LUNAR_HISTORIC_SITES_RevA-508.pdf\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere basically turning the landing sites into lunar museums, which is completely reasonable. Next to the moon is most likely going to be china.\u003C/p\u003E\n"},{"CreatedByName":"GOOMH","CreatedById":8729,"CreatedDateTime":"2012-09-03T20:29:46Z","Content":"\n\u003Cp\u003EI really hope the US is next simply because I\u0027m American and have pride but the chances of that are getting slimmer everyday. Anyway my hope would be the next mission would a NASA mission with a multicultural crew like they did for some shuttle missions. Truthfully though I think the next people to go is going to be a private sector sending up some space tourists to orbit the Moon.\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-09-03T20:37:11Z","Content":"\n\u003Cp\u003EIf the US goes back to the moon, it is going to be for an economic or military purpose. They have no other reason to go back. China, on the other hand, still needs to put their flag up there. So I predict it will be China that goes to the Moon next.\u003C/p\u003E\n"},{"CreatedByName":"GoodGuy","CreatedById":17980,"CreatedDateTime":"2012-09-03T21:42:17Z","Content":"\n\u003Cp\u003ENow if Neil Armstrong or any of the Apollo astronauts that landed said something about seeing an oil field up there, we\u0027ll be on the moon within a week.\u003C/p\u003E\n"},{"CreatedByName":"kodemunkey","CreatedById":41146,"CreatedDateTime":"2012-09-03T22:30:53Z","Content":"\n\u003Cp\u003EI also think China will be next, ESA could potentially go, at least in probe form via Arianne.\u003C/p\u003E\n"},{"CreatedByName":"kodemunkey","CreatedById":41146,"CreatedDateTime":"2012-09-03T22:31:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoodGuy\u0022 data-cite=\u0022GoodGuy\u0022\u003E\u003Cdiv\u003ENow if Neil Armstrong or any of the Apollo astronauts that landed said something about seeing an oil field up there, we\u0027ll be on the moon within a week.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunny you should mention that, there\u0027s large titanium deposits up there.\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-09-04T11:54:11Z","Content":"\n\u003Cp\u003EGetting the Titanium back to Earth would require some serious infrastructure; we\u0027re really not short on any metal enough to justify the expense of getting it from any orbital source.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-09-04T12:30:40Z","Content":"\n\u003Cp\u003EI can see China getting there next. No one else can be bothered.\u003C/p\u003E\n"},{"CreatedByName":"Resender","CreatedById":18274,"CreatedDateTime":"2012-09-04T13:27:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedDwarfIV\u0022 data-cite=\u0022RedDwarfIV\u0022\u003E\u003Cdiv\u003EI can see China getting there next. No one else can be bothered.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Indians (people from India, not native Americans) say they will have manned mission to Mars next year, which off course is impossible since the window to Mars has closed and the next one isn\u0027t until 2016\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2012-09-04T15:36:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003EGetting the Titanium back to Earth would require some serious infrastructure; we\u0027re really not short on any metal enough to justify the expense of getting it from any orbital source.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat troubles me more is the method of deorbiting any significant amount or ore without causing serious disturbance down here.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-09-04T15:48:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shpaget\u0022 data-cite=\u0022Shpaget\u0022\u003E\u003Cdiv\u003EWhat troubles me more is the method of deorbiting any significant amount or ore without causing serious disturbance down here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpace cargo plane?\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2012-09-04T16:17:22Z","Content":"\n\u003Cp\u003EFor industrial scale shipping?\u003C/p\u003E\n"},{"CreatedByName":"szpw","CreatedById":25964,"CreatedDateTime":"2012-09-05T00:13:47Z","Content":"\n\u003Cp\u003EDefinitly China for me. They just got the money to do that kind of thing, whereas the US Government cancelled the constellation program.\u003C/p\u003E\n"},{"CreatedByName":"MaxMurder","CreatedById":11958,"CreatedDateTime":"2012-09-05T17:15:23Z","Content":"\n\u003Cp\u003EChina plan to put men on the moon by 2020. As the SLS probably wont be even doing test flights until that time they will likely be next. Although there is the possibility of a private company doing it first, however private spaceflight has just now begun to operate in LEO and do not have any significant manned operations. Unless the industry picks up considerable steam in the next eight years then China will be the next on the moon.\u003C/p\u003E\n"}]}