{"TopicId":185069,"ForumId":55,"TopicTitle":"stabilize the physical shock during a mooring","CreatedByName":"jojo5144","CreatedById":176773,"CreatedDateTime":"2019-06-03T01:56:17Z","PageNum":1,"Articles":[{"CreatedByName":"jojo5144","CreatedById":176773,"CreatedDateTime":"2019-06-03T01:56:17Z","Content":"\n\u003Cp\u003E\nif during a mooring. the two ships remained separated.\n\u003C/p\u003E\n\u003Cp\u003E\nlike two different ships, just stuck. able to exchange resources.\n\u003C/p\u003E\n\u003Cp\u003E\nand put an option on the docking port to choose to merge the ships (in case of space station or other).\n\u003C/p\u003E\n\u003Cp\u003E\n/edit: why not an engineer present (maybe even in eva) for the merger (Bill will come to connect all his)/\n\u003C/p\u003E\n\u003Cp\u003E\nit may be possible to make moorings brief less violent (for the robotics part but also the rest).\n\u003C/p\u003E\n\u003Cp\u003E\nI do not know if it\u0027s a good idea.\n\u003C/p\u003E\n\u003Cp\u003E\nit will be so much cool for fuel exchange on the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nthank you for all your hard work \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E and all the team\n\u003C/p\u003E\n\u003Cp\u003E\nyour game is more and more amazing \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-03T02:06:28Z\u0022 title=\u002206/03/2019 02:06  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 3, 2019\u003C/time\u003E by jojo5144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brownhair2","CreatedById":128730,"CreatedDateTime":"2019-06-03T16:12:42Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure what exactly merging ships would do that you can\u0027t already do. Docked ships can already drain resources from/provide resources for each other automatically, all controls (throttle, maneuvering, action groups, etc.) trigger for both ships, they\u0027re even labeled as a single craft.\u003Cbr\u003E\u003Cbr\u003E\nThe magnetism can be a little violent sometimes when you\u0027re docking, but it also makes things easier. Maybe docking ports could have a slider for magnet strength so that people can decide whether or not they need it.\n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2019-06-03T16:51:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223611252\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559578362\u0022 data-ipsquote-userid=\u0022128730\u0022 data-ipsquote-username=\u0022Brownhair2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n38 minutes ago, Brownhair2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe magnetism can be a little violent sometimes when you\u0027re docking, but it also makes things easier. Maybe docking ports could have a slider for magnet strength so that people can decide whether or not they need it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s a mod for that! (I apologise \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003Cspan\u003E)\u003C/span\u003E\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed9584864497\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/154841-151-tweakable-everything-continued-replacement/\u0026amp;do=embed\u0022 style=\u0022height:225px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nBut yes, a docking port magnetic strength slider would be grand in stock.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-03T16:51:27Z\u0022 title=\u002206/03/2019 04:51  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 3, 2019\u003C/time\u003E by RealKerbal3x\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-03T17:52:03Z","Content":"\n\u003Cp\u003E\nYou do unintentionally raise a point here that for KSP there\u0027s no difference between docking (a loose connection for visiting spacecraft etc) and berthing (strongly connecting two docking ports together in a semi-permanent configuration, like ISS modules). Berthing is effectively what we already have in KSP as \u0022docking\u0022, the two berthed vessels become one vessel and share everything until they are separated.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy would this be at all important? Well it\u0027s not, but I\u0027d still like it as a quality of life thing.\n\u003C/p\u003E\n\u003Cp\u003E\nOne major advantage I see of having both \u0022dock\u0022 and \u0022berth\u0022 options (maybe configurable on a per-port basis) is not having your action groups and staging all messed up and merged if you dock a ship to a station and each have overlapping functions. If a ship is only docked to a station then it should retain its own control point (switchable with the square brackets as if they were still separate craft) while allowing resource and crew transfer as if they were one craft the way it is now. Only berthed modules would actually become part of the station and respond to commands as the same vessel. This would mean if I\u0027m controlling my space station with a ship docked to it, I no longer have to worry about manually shutting down the ship\u0027s engines in case I accidentally hit Z and send my whole station into a spin. It would also eliminate not knowing exactly what side you\u0027re controlling from when you click \u0022undock\u0022 on a port. Small things, but it\u0027s the small things that cause big, if infrequent, headaches.\n\u003C/p\u003E\n\u003Cp\u003E\nIs this worth its own suggestion thread?\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2019-06-03T21:28:30Z","Content":"\n\u003Cp\u003E\nI like the idea a lot, but my guess is that it is not quite as easy to do well, from a coding perspective, as it may seem.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully I am wrong though.\n\u003C/p\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-03T23:52:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223611509\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559597310\u0022 data-ipsquote-userid=\u0022130621\u0022 data-ipsquote-username=\u0022pandaman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, pandaman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like the idea a lot, but my guess is that it is not quite as easy to do well, from a coding perspective, as it may seem.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully I am wrong though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is said for every suggestion but I\u0027m honestly struggling to think how it\u0027d be the first thought this time, not claiming to be a developer but just based on what we know of existing KSP mechanics and using them in minimally-disruptive ways to achieve the desired effect.\n\u003C/p\u003E\n\u003Cp\u003E\nAdd a second button to docking ports (or a new part with 2 modes like an ISS universal adaptor: docking and berthing). \u0022Berthing\u0022 mode behaves the same way all docking ports do now. Vessels are merged and all functions and resources are collapsed under a single command point. Advanced ports or universal adaptors can be switched between berth and dock mode, and if both sides of a connection are set to berthing configuration, they will join as modules of a larger construct like normal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Docking\u0022 mode (perhaps the only option on early-tech ports to mark and encourage a distinction between monolithic and modular spacecraft/stations) will be a new addition based on the same functions as existing docking ports, the only difference being while the magnetism stays on, the vessel merging never takes place. Docked vessels will be held in place with the same force as berthed modules for simplicity, but will remain as separate vessels as far as the display is concerned and can only be controlled by shifting to their perspective with the vessel switcher. Crossfeed can be enabled according to user preference and/or type of docking port and connection. You could simulate requiring fuel and power lines having to be run through open hatches, which is generally only done for berthed vessels or propellant-only docking ports, but I\u0027ll understand if that\u0027s not bothered with for gameplay\u0027s sake. For convenience sake an extra field could be added for the vessel mass (or other) display indicating the individual vessel and the total mass of all docked spacecraft, which would be handy even without these functions.\n\u003C/p\u003E\n\u003Cp\u003E\nPros:\n\u003C/p\u003E\n\u003Cp\u003E\n-Eliminates the HUD clutter that\u0027s a hallmark of large space stations with many vessels docked, which makes the staging readout and action groups useless, eventually requiring every action to be done via hunting for part menus to click on constructs that can have many hundreds of tiny parts.\n\u003C/p\u003E\n\u003Cp\u003E\n-Lets us quickly see and switch between every vessel docked to the same station, and be ready to launch using the ship\u0027s own action groups immediately.\n\u003C/p\u003E\n\u003Cp\u003E\n-No more worries about accidentally activating a docked vessel\u0027s engines while trying to control your station, or getting into the paranoia-induced habit of disabling all visiting crafts\u0027 main engines after docking.\n\u003C/p\u003E\n\u003Cp\u003E\n-Simplifies station and modular spacecraft construction with an easy way to delineate temporary or host vessels from the permanent construct, and stops resources being drained from payloads due to absent-mindedness.\n\u003C/p\u003E\n\u003Cp\u003E\nCons:\n\u003C/p\u003E\n\u003Cp\u003E\n-Requires time from a programmer to modify the docking code appropriately, and possibly an artist/art technician to design and rig a new part for it.\n\u003C/p\u003E\n\u003Cp\u003E\n-May cause conflicts with mods performing a similar function, necessitating they update or be replaced.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s basically it far as I know. I\u0027d file it under a QoL grab-bag feature they should get around to whenever it\u0027s one of those updates.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2019-06-04T06:24:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223611612\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559605955\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n^snip^\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not a programner either, but my thoughts about it being difficult were not so much about the gameplay/user interface aspect, which you addressed very well, but more about the under the hood coding to get it to work as intended.  It struck me as one of those \u0027It\u0027s easy, all they need to do is...\u0027 ideas that is actually much harder than it may seem.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently resources etc. transfer within a single vessel, two (or more) docked vessels become one vessel whilst docked, which enables easy transfers between them.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe game does not currently allow transfers between different vessels, and I don\u0027 know whether it is a design decision or a coding limitation.  I suspect the latter, hence my concern that the \u0027difficulty\u0027 would be in the coding itself to reliably enable transfers between multiple different vessels. \n\u003C/p\u003E\n\u003Cp\u003E\nI could easily be wrong, but the fact that the vessels would need to be in contact (docked) I see more of a \u0027gameplay\u0027 design decision rather than a coding problem.  If the transfer between independent vessels issue could be solved then it opens the door to \u0027umbilical\u0027 transfers of fuel and electricity between nearby vessels too, so if it was that easy i suspect it would be done by now.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully I am proved wrong and it is in the next update \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gotmachine","CreatedById":163039,"CreatedDateTime":"2019-06-04T10:08:04Z","Content":"\n\u003Cp\u003E\nI like the idea, the forced merging of docked vessel is quite annoying.\n\u003C/p\u003E\n\u003Cp\u003E\nBut from a coding perspective it\u0027s really not easy to do because you can\u0027t have connected parts on different vessels, that\u0027s just impossible.\u003Cbr\u003E\nThis basic fact takes away every stock behavior that is normally available for connected parts.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223611612\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559605955\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhile the magnetism stays on, the vessel merging never takes place. Docked vessels will be held in place with the same force as berthed modules for simplicity\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKeeping the vessels somehow attached together is much more complicated than it looks, and would require doing very hacky things.\u003Cbr\u003E\nWhen loaded, maybe this can be done using standard unity joints, but there are many potential kraken-level issues in doing that because KSP actively expect vessels to be independent entities.\u003Cbr\u003E\nAnd anyway those joint only exists when the vessel is loaded / not timewarping.\u003Cbr\u003E\nThis mean a lot of position handling/correction when switching from/to loaded/packed/unloaded vessel because they will drift away from one another due to floating point precision issues and reference frame switching.\u003Cbr\u003E\nThis would also make it incompatible with any mod that manipulate vessel coordinates/orientation\u003Cbr\u003E\nThis will also mess up with the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, because the attached mass will be unaccounted for (I\u0027m quite curious to see the outcome of 2 \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E fighting each other)\n\u003C/p\u003E\n\u003Cp\u003E\nResource transfer is less unknown territory (\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E and EVA transfer by Dmagic are doing it), but the UI side of it is quite a bit of work.\u003Cbr\u003E\nCrew transfer is probably the easiest feature to do.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit : actually, I think \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E is pretty much doing most the above but I don\u0027t think it is capable of rigid docking, and I\u0027m not sure how well it behave for non-landed vessel.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-04T11:01:34Z\u0022 title=\u002206/04/2019 11:01  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 4, 2019\u003C/time\u003E by Gotmachine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-04T21:51:30Z","Content":"\n\u003Cp\u003E\nI mean all I\u0027m hearing there is \u0022it would be really hard to do if you did it the hardest possible way\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nLike just set up a condition to handle a second type of \u0022docking\u0022 that catalogues and preserves the separation of resources and command orderings in a way that can be retrieved when updating UI, performing actions or undocking. You don\u0027t \u003Cem\u003Eactually\u003C/em\u003E have to make them two separate vessels held by a new type of joint.\n\u003C/p\u003E\n\u003Cp\u003E\nI understand the thinking guys, but it\u0027s usually people with no experience of development whatsoever that are the first to say \u0022that\u0027s probably impossible\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nOf course it\u0027s not impossible, few things are, it\u0027s only ever a question of whether the labour time outweighs the end value, and an assessment of that is something only one of the devs can give us. So thank you for trying but you really haven\u0027t added anything. Frankly calling something (especially something so trivial) \u0022impossible\u0022 should come with a greater burden of proof than calling it possible or even easy, since it\u0027s by far the least likely outcome.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-04T21:55:40Z\u0022 title=\u002206/04/2019 09:55  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 4, 2019\u003C/time\u003E by Loskene\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2019-06-04T22:09:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223612326\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559685090\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndocking\u003Cspan\u003E﻿\u003C/span\u003E\u0022 that catalogues and preserves the separation of resources\u003Cspan\u003E﻿\u003C/span\u003E and command orderings in a way that can be retrieved when updating UI, performing actions or undocking. You don\u0027t \u003Cem\u003Eactually\u003C/em\u003E have to make them two separate vessels held by a \u003Cspan\u003E﻿\u003C/span\u003Enew type of\u003Cspan\u003E﻿\u003C/span\u003E joint.\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSpeaking as a developer, modder, etc., I can tell you that it\u0027s not that simple.  You are talking about changing one of the fundamental characteristics  of the game.  At this point, it is probably not doable for a reasonable amount of effort.\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2019-06-04T22:22:57Z","Content":"\n\u003Cp\u003E\nYou do raise one point that I believe is fixable, and that is being able to preserve the action groups on vessels when they docked together. My thought is tht action groups can be associated with command pods, and when the command pod is the controlling pod, then the action groups associated with it would be active.\n\u003C/p\u003E\n\u003Cp\u003E\n Just some random thoughts while I\u0027m out walking my dog, it may be easier it may be harder to do, but somebody might do it soon\n\u003C/p\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-04T22:40:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223612345\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559686977\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou do raise one point that I believe is fixable, and that is being able to preserve the action groups on vessels when they docked together. My thought is tht action groups can be associated with command pods, and when the command pod is the controlling pod, then the action groups associated with it would be active.\n\u003C/p\u003E\n\u003Cp\u003E\n Just some random thoughts while I\u0027m out walking my dog, it may be easier it may be harder to do, but somebody might do it soon\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee? halfway there already. Look I\u0027m not one of those people trying to say \u0022it\u0027s just code, it\u0027s basically magic, do whatever\u0022, but I do have somewhat higher expectations when a game is this moddable and most of these functions have already been done or approached by mods in the past. Without knowing what the underlying source code that enables all these surface features looks like though, makes it genuinely impossible to say what we can do here. I mean they got docking ports to work with robotic parts, which were always the \u0022Big No No, Here Be Dragons\u0022 of infernal robotics. I\u0027d cut squad some slack here.\n\u003C/p\u003E\n"},{"CreatedByName":"jojo5144","CreatedById":176773,"CreatedDateTime":"2019-06-04T22:42:04Z","Content":"\n\u003Cp\u003E\nsorry for this idea. but I am enjoy that his launches the debate. I launched this idea because ksp is a game of \u0022simulation\u0022 where physics is very important. and the big physical shock at a dock does not really exist. I am aware that if this shock is there, it probably means that it will stay at this stage of the game. Otherwise it will probably be repaired. this shake is responsible for 80% of my worries in ksp. I just give an idea. Can be stupid. I would like to make my fuel exchange to the ground less explosive especially since BG.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-04T22:52:48Z\u0022 title=\u002206/04/2019 10:52  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 4, 2019\u003C/time\u003E by jojo5144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2019-06-04T23:08:52Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223611332\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559584323\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/3/2019 at 6:52 PM, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne\u003Cspan\u003E﻿\u003C/span\u003E major\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E advantage I see of having both \u0022dock\u0022 and \u0022berth\u0022 options (maybe configurable on a per-por\u003Cspan\u003E﻿\u003C/span\u003Et basis) is not havin\u003Cspan\u003E﻿\u003C/span\u003Eg your action groups and staging all messe\u003Cspan\u003E﻿\u003C/span\u003Ed up an\u003Cspan\u003E﻿\u003C/span\u003Ed merged if you dock a ship t\u003Cspan\u003E﻿\u003C/span\u003Eo a station and each\u003Cspan\u003E﻿\u003C/span\u003E have overlapping functio\u003Cspan\u003E﻿\u003C/span\u003En\u003Cspan\u003E﻿\u003C/span\u003Es.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;font-size:16px;\u0022\u003EMy instinctive thought is that this falls into the \u0022technically possible, but probably not worth it\u0022 category.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;font-size:16px;\u0022\u003EFrom what you\u0027ve described, \u0027docking\u0027 would effectively b\u003C/span\u003E\u003Cspan style=\u0022background-color:#ffffff;font-size:16px;\u0022\u003Ee the same as \u0027berthing\u0027... but with objectively less functionality. It doesn\u0027t seem worth the potentially large development time to what mind seems like realism for the sake of realism, without really adding anything.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs mentioned, there are other simpler ways to solve the issues with current system, which has already been shown to be feasible by vessel names being tied to command pods. In terms of progression, it seems simpler to model the limitations of docking vs. berthing than anything else - e.g. having fuel crossfeed disabled on early docking ports.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn regards to the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, I suspect a lot of the reason the current system works like it does is to do with simplicity and flexibility. It\u0027s easy to forget once you\u0027ve mastered it, but rendezvous/docking is *hard*. Hard enough without having to worry about whether you\u0027ve got the right kind of connection or whatever - even now I occasionally flub up and use the wrong size port, and that\u0027s just three options.\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2019-06-04T23:22:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223612361\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559688006\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSee? halfway there already. Look I\u0027m not one of those people trying to say \u0022it\u0027s just code, it\u0027s basically magic, do whatever\u0022, but I do have somewhat higher expectations when a game is this moddable and most of these functions have already been done or approached by mods in the past. Without knowing what the underlying source code that enables all these surface features looks like though, makes it genuinely impossible to say what we can do here. I mean they got docking ports to work with robotic parts, which were always the \u0022Big No No, Here Be Dragons\u0022 of infernal robotics. I\u0027d cut squad some slack here.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo.  These are two entirely different problems.  The Action Groups are already being saved, it\u0027s just a matter of saving multiple.  This is totally different and several orders of magnitude from changing the way that physics works\n\u003C/p\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-05T00:17:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223612385\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559690522\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is totally different and several orders of magnitude from changing the way that physics works\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat?\n\u003C/p\u003E\n\u003Cp\u003E\n[snip] At no point did I ask for any changes to how physics work, even stressing to keep things as unchanged as possible by suggesting the path of least disruption for adding a decently minor feature that would\u0027ve saved some UI/operational headaches.\n\u003C/p\u003E\n\u003Cp\u003E\nYou know what, nevermind, this isn\u0027t remotely as important for how much time it\u0027s already wasted. Sorry to derail your thread op, didn\u0027t think there\u0027d be this much nonsense about it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-05T03:25:00Z\u0022 title=\u002206/05/2019 03:25  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 5, 2019\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003Cbr\u003EPortions Redacted by Moderator\n\u003C/span\u003E\n"},{"CreatedByName":"jojo5144","CreatedById":176773,"CreatedDateTime":"2019-06-05T00:32:16Z","Content":"\n\u003Cp\u003E\nit\u0027s not just to create two modes including a mode with less functionality, but to be able to perform a fuel exchange bypassing the physical shock that the dock causes.\n\u003C/p\u003E\n\u003Cp\u003E\nedit: because I thought it was just becoming one who caused the shock\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-05T00:41:51Z\u0022 title=\u002206/05/2019 12:41  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 5, 2019\u003C/time\u003E by jojo5144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2019-06-05T00:48:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223612407\u0022 data-ipsquote-contentid=\u0022185069\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221559693868\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat?\n\u003C/p\u003E\n\u003Cp\u003E\n[snip] At no point did I ask for any changes to how physics work, even stressing to keep things as unchanged as possible by suggesting the path of least disruption for adding a decently minor feature that would\u0027ve saved some UI/operational headaches.\n\u003C/p\u003E\n\u003Cp\u003E\nYou know what, nevermind, this isn\u0027t remotely as important for how much time it\u0027s already wasted. Sorry to derail your thread op, didn\u0027t think there\u0027d be this much nonsense about it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUmmm, while I don\u0027t work for Squad, I think that I know a fair bit about how the game works.  If you don\u0027t know who I am, then I suggest you see why I have such a high rep.\n\u003C/p\u003E\n\u003Cp\u003E\nAsking for two ships to be loosely linked but not a single vessel is a fundamental change in the way the base engine will work.  It doesn\u0027t change physics per se, but in order to have two ships loosely linked which will stay together during timewarp, rails, etc, will require significant changes in the way that the physics will need to be calculated for the two ships.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-05T03:25:42Z\u0022 title=\u002206/05/2019 03:25  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 5, 2019\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003Cbr\u003EPortions of Quote Redacted by Moderator\n\u003C/span\u003E\n"},{"CreatedByName":"jojo5144","CreatedById":176773,"CreatedDateTime":"2019-06-05T02:55:57Z","Content":"\n\u003Cp\u003E\nsomeone saw me? what this ? a moderator can delete my topic ?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-05T02:58:21Z\u0022 title=\u002206/05/2019 02:58  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 5, 2019\u003C/time\u003E by jojo5144\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-06-05T03:27:46Z","Content":"\n\u003Cp\u003E\nSome posts have been edited or removed.  Remember, the discussion is about the idea, not the people. \n\u003C/p\u003E\n\u003Cp\u003E\nThread has been locked by \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E request.\n\u003C/p\u003E\n"}]}