{"TopicId":185097,"ForumId":107,"TopicTitle":"Multiple objects having identical profile in KAL-1000","CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2019-06-03T20:45:11Z","PageNum":1,"Articles":[{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2019-06-03T20:45:11Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to set up a loop in the KAL-1000, but it\u0027s becoming frustrating that there doesn\u0027t seem to be any way to apply a single profile to more than one part.\n\u003C/p\u003E\n\u003Cp\u003E\nI have 4 sections on the craft, all with 8 robotic parts.  Each section needs to do the exact same thing, so I really only need to set up 8 different profiles.  But I do not see any way to duplicate!  I tried just setting everything up with one, then duplicating the whole shebang in the editor, but it didn\u0027t work. \n\u003C/p\u003E\n\u003Cp\u003E\nEverything followed the duplicate, and left the original part uncontrolled?\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an example.  First 4 rows will be identical, then the next 4, and so on.  If there is some way to copy these, or apply a single profile to multiple parts, I am missing it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf there isn\u0027t a way to do this, then consider this a feature request.  In this example, it\u0027s pretty basic, but if it was a complicated mechanism, this would be a real pain.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c0dscreenshot1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022609\u0022 src=\u0022http://u.cubeupload.com/Geonovast/c0dscreenshot1.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would also like to be able to toggle between sharp and smooth for the default tangent setting.  I don\u0027t like it defaulting to smooth.\n\u003C/p\u003E\n"},{"CreatedByName":"Jebs_SY","CreatedById":169510,"CreatedDateTime":"2019-06-16T20:17:27Z","Content":"\n\u003Cp\u003E\nHello,\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to put a similar feature request here:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI would love to see an offset-mode, so that multiple KAL-Controllers inputs can steer the same motor.\u003C/strong\u003E Imagine a Quad-Copter where 3 axis steer the RPM of 4 motors... There one needs multiple KAL-Controllers steer the same motor. One for yaw, one for pitch, one for roll. But for that we would need a possibility do accumulate input requests of multiple KAL-Controller into one target.\n\u003C/p\u003E\n\u003Cp\u003E\nIf there would be an \u0022offset-mode\u0022, where the editor line in the middle does nothing, on bottom line it multiples the current value by 0.0 and on the top line it would multiply it by 2. So 0% bottom, 100% middle, 200% top.\n\u003C/p\u003E\n\u003Cp\u003E\nThen one could dial in the rotor main RPM for example at 150rpm and the input of \u0022multiple KAL-Controllers in offset mode\u0022 will be multiplied with that main value.\u003Cbr\u003E\nThen one could do a real quad-copter, where all axis are only done by different RPM on the 4 motors.\n\u003C/p\u003E\n\u003Cp\u003E\nThe toggle-switch for direct vs offset could be perfectly added in the Action Groups where we already have the normal/inverse and incremental/absolut toggle switch.\u003Cbr\u003E\nI could imagine that\u0027s easy implemented. One new toggle and if it\u0027s activate just multiply that editor-value with other occurring input values instead of using it as absolute input.\n\u003C/p\u003E\n\u003Cp\u003E\nPS: Can it be, that TRIM input on an axis is ignored by the KAL-1000? If yes, is that intentional?\n\u003C/p\u003E\n\u003Cp\u003E\nBR\u003Cbr\u003E\nJebs_SY\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-16T20:34:17Z\u0022 title=\u002206/16/2019 08:34  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 16, 2019\u003C/time\u003E by Jebs_SY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FiveOneEcho","CreatedById":198233,"CreatedDateTime":"2019-06-16T20:25:00Z","Content":"\n\u003Cp\u003E\nI would also really like to be able to trigger events with a keyframe.  For example: have an arm lower a rover and have a decoupler activate at the end of the animation or just sequence action groups.  You would bind a component action to a track and then add a keyframe to toggle/activate/deactivate the option you bound.  Maybe a value of 0 would be toggle, 1 would be activate, and -1 would be deactivate.  I have a lot of cool ideas that could totally work if only this were a mechanic.\n\u003C/p\u003E\n"}]}