{"TopicId":185642,"ForumId":36,"TopicTitle":"Is KRPC Getting Updated For 1.7?","CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2019-06-19T19:45:33Z","PageNum":1,"Articles":[{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2019-06-19T19:45:33Z","Content":"\n\u003Cp\u003E\nIt\u0027s kind of essential if I want my Navball project to keep on progressing you see. I\u0027ve just been busy working on the new design and build of the hardware and then get the data pulled of the game and passed to the Navball CPU  when I have it working properly... but I don\u0027t really want to end up with an paperweight that just looks good.\n\u003C/p\u003E\n\u003Cp\u003E\nThe good news is my last prototype worked... It just wasn\u0027t fast enough for me and could lag out if I got into a spin. I\u0027m actually going ahead and building my own custom servos this year and want to see if that fixes the speed and overheating issues (oh yeah, forgot to mention the overheating).\n\u003C/p\u003E\n\u003Cp\u003E\nThis project IS doable... It\u0027s just that the goalposts keep moving lol. I can\u0027t believe I started this in 2013... but I did take a year off in 2018...\n\u003C/p\u003E\n"},{"CreatedByName":"namesnonames","CreatedById":178495,"CreatedDateTime":"2019-06-20T00:17:48Z","Content":"\n\u003Cp\u003E\nKRPC works with 1.7, I\u0027ve been using it with the new robotic parts. Is there anything in particular that isn\u0027t working?\n\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2019-06-20T09:20:35Z","Content":"\n\u003Cp\u003E\nI was just checking to see if it was working as the version I was testing on was KSP 1.3.1  hehe.... it\u0027s just a stripped down KSP just used to test hardware/software communication... I went to upgrade to the latest version of KRPC and was worried when I didn\u0027t see an update since 1.4 and panicked a bit. I do want to have the thing working after all the money, research and time I\u0027ve spent on the project.\n\u003C/p\u003E\n"}]}