{"TopicId":185783,"ForumId":44,"TopicTitle":"Wings, Propellers, and Lift","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-24T06:53:02Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-24T06:53:02Z","Content":"\n\u003Cp\u003E\nIn another thread, a dispute came up about the nature of wings, propellers, and lift.\n\u003C/p\u003E\n\u003Cp\u003E\nI think its best to discuss it here. So I will try to present the argument without naming names, and let others weigh in before arguing my position.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, someone was arguing that wings and propellers do not work the same way, and that the lift force cannot be explained in terms of Newton\u0027s 3rd law/ that the wing deflects air downward, such that the air is effectively \u0022reaction mass\u0022.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt seems to me that rotor-based props don\u0027t actually make \u0022thrust\u0022 by shoving a fluid atmosphere backwards like real props do.  Instead, because they\u0027re made of wing panels or control surfaces, they function the same way wings normally do in KSP.  That is, if they move forward through the atmosphere with a positive \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E, a lift force magically appears on their upper surface and pulls them in that direction.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n... here a distinction is made between wing lift, and prop thrust (which is said to behave in terms of using air as reaction mass, made explicit more below)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIRL, props do function like wings. And wings do push air down as they go by, so this isn\u0027t saying all that much\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSomewhat, but it\u0027s not their main thing.  Props (and jets and rockets) function in real life by shoving fluids to the rear so Newton\u0027s 3rd Law moves the vehicle forward.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe two are one and the same.\n\u003C/p\u003E\n\u003Cp\u003E\nWings produce lift by Newton\u0027s 3rd law as well. The primary difference between the concepts you seem to have, is that one moves a large masd of air at low velocity (thus low total KE), and one moves a smaller mass of air at higher velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nThe aerodynamic principles are exactly the same.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nno, that\u0027s incorrect.  There are 2 totally separate things goin\u003Cspan\u003E﻿\u003C/span\u003Eg on with REAL props.  Yes, t\u003Cspan\u003E﻿\u003C/span\u003Ehere\u0027s a little bit of lift, but the main t\u003Cspan\u003E﻿\u003C/span\u003Ehing is \u0022paddling\u003Cspan\u003E﻿\u003C/span\u003E\u0022. \u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLift intentionally has very little to do with the 3rd Law because it does not rely on reaction mass.  That is, wings do not shov\u003Cspan\u003E﻿\u003C/span\u003Ee air down to react\u003Cspan\u003E﻿\u003C/span\u003E the plane \u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003Eup.  If that was how lift worked, you\u0027d be flattened by the weight of a plane passing low overhead. I\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003En\u003Cspan\u003E﻿\u003C/span\u003Es\u003Cspan\u003E﻿\u003C/span\u003Etead, the object of wing design is \u003Cspan\u003E﻿\u003C/span\u003Eto mo\u003Cspan\u003E﻿\u003C/span\u003Eve a\u003Cspan\u003E﻿\u003C/span\u003Es little a\u003Cspan\u003E﻿\u003C/span\u003Eir as possible because imparting movement to the air sucks energy away from moving the plane (aka drag).   As a wing moves forward, its shape and \u003Cspan\u003E﻿\u003C/span\u003Eangle of attack creates a pressure diffe\u003Cspan\u003E﻿\u003C/span\u003Erential in the surrounding fluid\u003Cspan\u003E﻿\u003C/span\u003E, higher on the\u003Cspan\u003E﻿\u003C/span\u003E b\u003Cspan\u003E﻿\u003C/span\u003Eottom and lower at the top.  Thus, the partial vacuum on the top sucks the wing upwards (or, the higher pressure on the bottom tries to expand into the partial vacuum, pushing th\u003Cspan\u003E﻿\u003C/span\u003Ee \u003Cspan\u003E﻿\u003C/span\u003Ewing ahead of it).  That\u003Cspan\u003E﻿\u003C/span\u003E is lif\u003Cspan\u003E﻿\u003C/span\u003Et.\n\u003C/p\u003E\n\u003Cp\u003E\nProps (and turbofan blades), however, create propulsive force by using reaction mass, so are all about the 3rd Law.  \u003Cspan\u003E﻿\u003C/span\u003EThe blade physically shoves a wad of air backwards and the 3rd Law pushes the plane forward.  It\u0027s exactly the same thing as rowing a boat or how a paddlewhe\u003Cspan\u003E﻿\u003C/span\u003Eel ship works.  The oars/paddles sho\u003Cspan\u003E﻿\u003C/span\u003Ev\u003Cspan\u003E﻿\u003C/span\u003Ee water backwards and the reaction force moves the boat forward.  Thus, REAL props have more in common with rocket engines than wings. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgain...1 and the same, not 2 separate things.\n\u003C/p\u003E\n\u003Cp\u003E\nThat pressure differential causes air to move down. Lift can be entirely explained by action and reaction. There would be a serious problem if it couldn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t get flattened when a plane flies over you because the force is very widely distributed.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, it takes energy. Contrary to what you say, its designed to move as much air as possible, as slowly as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nThe energy lost is 1/2mv^2, while the force made is proportional to mv.\n\u003C/p\u003E\n\u003Cp\u003E\nThus you minimize energy losses by moving more air, but slower \u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\nYes, a plane moving through the air necessarily causes the air to move somewhat.  The plane and the air can\u0027t occupy the same space so the plane pushes the fluid air out of the way.  But only to the least extent possible, because moving the air wastes energy,  ...\n\u003C/p\u003E\n\u003Cp\u003E\nHOWEVER, this minimal movement of the air can be put to use to create lift.  Lift comes from fluid dynamics, specifically Bernoulli\u0027s Principle, which can be derived from Newton\u0027s SECOND Law, not the 3rd.  It\u0027s a conservation of energy thing.  The air atop the wing moves a bit faster than that below, causing it to have lower pressure and creating a partial vacuum.  The higher pressure below attempts to re-establish equilibrium and carries the wing with it.  That is how aerodynamic lift is made.\n\u003C/p\u003E\n\u003Cp\u003E\nIf lift worked via Newton\u0027s 3rd Law as you mistakenly believe, then there\u0027d be no difference between airplanes and helicopters.  But they\u0027re demonstrably different, as I shall now demonstrate....\n\u003C/p\u003E\n\u003Cp\u003E\nI believe we can agree that helicopters are all about the 3rd Law, \u0022paddling\u0022 to use air as reaction mass, right?   Helicopters hover and maintain altitude by countering gravity head-on with the 3rd Law reaction force, same as a jet or rocket \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E.  And I\u0027m sure you\u0027re familiar with the strong, often dangerous winds under a low-flying helicopter.  That wind is the reaction mass, accelerated by the rotor, and the volume of air and the speed it\u0027s moving are all necessary to counter the gravitational pull on the mass of the helicopter as a whole.  It\u0027s exactly like being in the exhaust stream of a rocket or jet with the diameter of the helicopter\u0027s rotor disk.  Agreed?\n\u003C/p\u003E\n\u003Cp\u003E\nOK, then if wings worked the same way as helicopter rotors (using the 3rd Law), then to lift a plane of the same mass as the helicopter, the wings would have to shove down just as much air just as fast.  But an airplane\u0027s wing area is only a small fraction of the rotor disk area of a helicopter of the same mass (rather than a larger area as you posited above).  Therefore, to generate the same gravity-countering reaction force from a much smaller area, the airplane\u0027s wing would have to accelerate the air to a much higher downwards velocity than the helicopter\u0027s rotor to get the same mass-flow rate as the helicopter.  Therefore, the wind felt under a low-flying plane would be even more intense than that under a helicopter of the same mass.\n\u003C/p\u003E\n\u003Cp\u003E\nBut this is not the case.  In fact, there is no perceptible downdraft under a low-flying plane, because wings DO NOT use the 3rd law to generate lift.  They use fluid dynamics.  Totally different animal.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, would anyone care to weigh in on this discussion before I invite the other party (rather than continuing the off topic discussion in another thread), and continue the argument?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2019-06-24T13:58:50Z","Content":"\n\u003Cp\u003E\nThis is silly.\n\u003C/p\u003E\n\u003Cp\u003E\nPropellers are small, rotating wings. This is both obvious and factual.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are methods of analyzing propellers that ignore the physical nature of propellers (disk actuator theory), but these are convenient approximations. Blade element theory is also valid, and it treats the propeller as individual blades.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the whole \u0022how do wings create lift\u0022 thing, it\u0027s been argued so often that it\u0027s total cliche. Most people who argue about it have no clue how wings actually work.\n\u003C/p\u003E\n\u003Cp\u003E\nThe argument is stupid because if you consider the pressures on the wing, the total sum of all the pressure normal to the skin of the wing times the surface area of that skin will add up to equal the lift. AND the total momentum change of the air that is flowing past the wing will add up to equal the lift. Both ways of looking at the the problem are physically valid, so both ways must always add up to equal each other.\n\u003C/p\u003E\n\u003Cp\u003E\nps. The quoted argument that claims wings don\u0027t deflect a significant amount of air down is simply physically wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nSome flow vis. Notice how the streaklines bend down and all have some downward velocity after passing by the wing. (The whole flowfield is affected by the wing, not just the part closest to it, because this is subsonic flow.)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/UqBmdZ-BNig?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-24T14:09:40Z\u0022 title=\u002206/24/2019 02:09  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 24, 2019\u003C/time\u003E by mikegarrison\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-24T14:55:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624404\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561384730\u0022 data-ipsquote-userid=\u0022137807\u0022 data-ipsquote-username=\u0022mikegarrison\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, mikegarrison said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is silly.\n\u003C/p\u003E\n\u003Cp\u003E\nPropellers are small, rotating wings. This is both obvious and factual.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are methods of analyzing propellers that ignore the physical nature of propellers (disk actuator theory), but these are convenient approximations. Blade element theory is also valid, and it treats the propeller as individual blades.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the whole \u0022how do wings create lift\u0022 thing, it\u0027s been argued so often that it\u0027s total cliche. Most people who argue about it have no clue how wings actually work.\n\u003C/p\u003E\n\u003Cp\u003E\nThe argument is stupid because if you consider the pressures on the wing, the total sum of all the pressure normal to the skin of the wing times the surface area of that skin will add up to equal the lift. AND the total momentum change of the air that is flowing past the wing will add up to equal the lift. Both ways of looking at the the problem are physically valid, so both ways must always add up to equal each other.\n\u003C/p\u003E\n\u003Cp\u003E\nps. The quoted argument that claims wings don\u0027t deflect a significant amount of air down is simply physically wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, since no one else has yet chimed in, I\u0027ll cease a pretense of not trying to bias the responders.\n\u003C/p\u003E\n\u003Cp\u003E\nI am in complete agreement with you:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Propellers are small, rotating wings\u0022 - from the very start, this was the issue, even though it seems obvious to me. He drew a distinction between helicopters and planes, and somehow thinks \u0022rotary wing\u0022 for a helicopter is just an imprecise name.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Both ways of looking at the the problem are physically valid, so both ways must always add up to equal each other.\u0022 Yup, as  I said \u0022Again...1 and the same, not 2 separate things.\n\u003C/p\u003E\n\u003Cp\u003E\nThat pressure differential causes air to move down\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as I said to someone else who weighed in by private message: \u0022for every physical system, newtons 3 laws must be obeyed (ignoring relativistic and quantum effects).\n\u003C/p\u003E\n\u003Cp\u003E\nBernoulli\u0027s principle is one way of explaining the force acting on the wing. Often the same effect can be explained multiple ways/there are multiple ways to derive a formula from different starting points.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the air generates the lift force on the wing, the wing must be generating an equal force on the air. This means that it will be accelerating air downward. \n\u003C/p\u003E\n\u003Cp\u003E\nYou can\u0027t just throw out \u0027Bernoulli\u0027s principle\u0027, and get to ignore laws of physics.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI like that picture. I pointed them towards this site, but I\u0027m not sure they read it:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.aeroman.org/html/newton_s_laws_and_lift_rev.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.aeroman.org/html/newton_s_laws_and_lift_rev.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2019-06-24T14:59:44Z","Content":"\n\u003Cp\u003E\nA picture is worth 1000 words, as they say.\n\u003C/p\u003E\n\u003Cp\u003E\nProp cross-section:\u003Cbr\u003E\u003Ca href=\u0022https://images.app.goo.gl/zP5DWJqjExyDzmGdA\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://images.app.goo.gl/zP5DWJqjExyDzmGdA\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWing cross section:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://images.app.goo.gl/uTZeLTXgxxRX81AC8\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://images.app.goo.gl/uTZeLTXgxxRX81AC8\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs an aside, one of the reasons the Wright Brothers were so successful is because they were the first to realize that you can get flight-viable thrust to weight ratios out of the turn-of-the-century internal combustion engines if they used small wings as the propellers, as opposed to flat paddles.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdited to add: Perhaps this discussion would benefit from refraining from using the word \u0022lift\u0022. All airfoils, when moved in a certain way through a fluid such as air produce \u0022thrust\u0022 (which can be further broken down into mass*acceleration). We call this thrust \u0022lift\u0022 if it is acting to oppose gravity, but it acts the exact same way, with the same force, no matter which direction it is acting.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-24T15:08:06Z\u0022 title=\u002206/24/2019 03:08  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 24, 2019\u003C/time\u003E by Meecrob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2019-06-24T15:20:51Z","Content":"\n\u003Cp\u003E\nThis is a good place to apply my favorite approach to conceprual thinking. Just go to extremes.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine a huge propeller, infinitely big. At some point the blade of the propeller is traveling in pretty much a straight line - just as a wing does.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-24T15:21:13Z\u0022 title=\u002206/24/2019 03:21  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 24, 2019\u003C/time\u003E by Shpaget\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRB","CreatedById":197002,"CreatedDateTime":"2019-06-25T02:37:33Z","Content":"\n\u003Cp\u003E\nAFAIK, KSP just calculates the generated lift using its lift formula, not caring how the lift is made or what direction it goes-lift from a wing/rotor or thrust from a propeller.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2019-06-25T03:45:22Z","Content":"\n\u003Cp\u003E\n(I feel like we\u0027ve been here before...)\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been said that even a flat board would have some lift. \n\u003C/p\u003E\n\u003Cp\u003E\nSo the question is what causes it?\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a whole string of theories about it but generally some kind of momentum exchange is the accepted cause. \n\u003C/p\u003E\n\u003Cp\u003E\nOf course propellers aren\u0027t strictly identical to wings - they have different geometries. I also suspect that using a simple wing shape for a prop would lead to inefficiencies. However the prop geometry can be optimized for thrust - both are airfoils but they are in different environments. Since it\u0027s an object moving in a fluid it likely derives force from similar sources as wings. Newton\u0027s 3rd is likely at play at here since force is a product of momentum changing, but just saying that\u0027s the case doesn\u0027t strictly describe the mechanism by which thrust is produced. For example there are multiple theories about how Newton\u0027s 3rd law provides lift.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T03:56:15Z\u0022 title=\u002206/25/2019 03:56  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by Bill Phil\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2019-06-25T04:47:51Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624268\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561359182\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESome unknown person who is not \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91917-kerikbalm/\u0026amp;do=hovercard\u0022 data-mentionid=\u002291917\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91917-kerikbalm/\u0022 rel=\u0022\u0022\u003E@KerikBalm\u003C/a\u003E said:\u003C/strong\u003E “There are 2 totally separate things goin\u003Cspan\u003E﻿\u003C/span\u003Eg on with REAL props.  Yes, t\u003Cspan\u003E﻿\u003C/span\u003Ehere\u0027s a little bit of lift, but the main t\u003Cspan\u003E﻿\u003C/span\u003Ehing is \u0022paddling\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E\u0022. \u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003Cspan\u003E﻿“\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd I’m off to KSP to build a turbo-paddlewheeler airplane.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T06:50:27Z\u0022 title=\u002206/25/2019 06:50  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by Nightside\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2019-06-25T05:21:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624774\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561434322\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf course propellers aren\u0027t strictly identical to wings - they have different geometries. I also suspect that using a simple wing shape for a prop would lead to inefficiencies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf course props have variable geometry. At the root the propeller the cord ratio is much higher than at the tip, and the entire aerofoil is twisted. That is to compensate for differences in airspeed near root and near tip of the blade. Using a simple wing geometry for prop would lead to inefficiency because wing is designed for one single airspeed - cruising. Each \u0022slice\u0022 of propeller crossection is designed for different airspeed because at the designed standard angular speed of the propeller different parts of the blades travel at different speeds. But there is not fundamental or conceptual difference.\n\u003C/p\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2019-06-25T05:54:23Z","Content":"\n\u003Cp\u003E\nA significant fraction of people, even of those active in aviation, say adamantly that lift happens \u0027because\u0027 of Bernoulli\u0027s theorem rather than \u0027because \u0027 Newton\u0027s third law. \u003Cbr\u003E\nI have tried, but never really understood the distinction they had in their minds (maybe due to indoctrination to the conventional thinking via a Physics PhD).  My mind is used to the idea that physical laws \u003Cem\u003Edescribe, \u003C/em\u003Enot \u003Cem\u003Ecause, \u003C/em\u003Ethe behavior of things.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to avoid semantics, I have had success with \u0022whether the cause of lift or not, Newton\u0027s third law still holds true, for times when that is the simpler way to understand some aspect of flight.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGravity pulls a 1-tonne aircraft down with about 10kN of force, so either the aircraft will start accelerating down (falling) 10 m/s², or 5000 kg/s of air will get thrown down at 2 m/s, or some such product to balance 10 kN = 10\u0027000 kg m/s².    An airplane spreads that thrown-down air in a long wake, with a cross section near one wingspan in diameter near the craft, spreading out with time.  A 10-meter wingspan at 50m/s might catch 5000 m³/s of 1kg/m³ air  and throw it down 2m/s.  You certainly feel the wake if you are following a heavy slow airplane too closely, or if you circle tightly in a glider to fly through your own before it spreads too wide.\n\u003C/p\u003E\n\u003Cp\u003E\nA hovering helicopter doesn\u0027t spread the wake out at all, just throws it straight down.  A 1-tonne helicopter might only grab 500 kg/s of air (a 25m² disk throwing 1kg/m³ air at 20m/s) down at 20m/s all on the same spot, to make the required product.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-25T06:37:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624800\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561438071\u0022 data-ipsquote-userid=\u0022150244\u0022 data-ipsquote-username=\u0022Nightside\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Nightside said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd I’m off to KSP to build a turbo-paddlewheeler airplane.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPlease modify your post, you quote me quoting someone else, but present it as if the source was me. If it wasn\u0027t clear, I was not the one arguing that position.\n\u003C/p\u003E\n\u003Cp\u003E\nI posted a link to this thread in the other thread, I thought the guy would have shown up by now... he was quite adamant that he was right. I was omitting the more stubborn sounding parts like:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Nope, nope, nope, nope, nope.  You are completely wrong here, I\u0027m afraid.  If you can\u0027t see that, then you should go do some more research \u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022 (heavy sigh).  You\u0027ve been building rockets too long, my friend.  You can\u0027t see the differences between being in vacuum and being immersed in a fluid medium,.  There are more ways to generate useful forces than simply hurling reaction mass astern.  I\u0027m sure you\u0027ve heard of electromagnetism?  OK, if you believe in that, then you should be open to the possibility that maybe, just maybe, creating a pressure differential in a fluid can also create a force without reaction mass.  You know, kinda how suction cups work?  Lift and suction cups both rely on normal atmospheric pressure trying to restore equilibrium, all without reaction mass.  Open your mind \u0022\n\u003C/p\u003E\n\u003Cp\u003E\nbut maybe I shouldn\u0027t have expected him to show up, when I suggested moving the discussion about lift mechanism here, he replied:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I see\u003Cspan\u003E﻿\u003C/span\u003E no point in t\u003Cspan\u003E﻿\u003C/span\u003Ehat.  You can\u0027t\u003Cspan\u003E﻿\u003C/span\u003E think i\u003Cspan\u003E﻿\u003C/span\u003En any t\u003Cspan\u003E﻿\u003C/span\u003Eerm\u003Cspan\u003E﻿\u003C/span\u003Es but the 3r\u003Cspan\u003E﻿\u003C/span\u003Ed Law, e\u003Cspan\u003E﻿\u003C/span\u003Even \u003Cspan\u003E﻿\u003C/span\u003Ewhen s\u003Cspan\u003E﻿\u003C/span\u003Ehown that\u0027s n\u003Cspan\u003E﻿\u003C/span\u003Eot even\u003Cspan\u003E﻿\u003C/span\u003E what\u0027s ha\u003Cspan\u003E﻿\u003C/span\u003Eppen\u003Cspan\u003E﻿\u003C/span\u003Eing \u003Cspan\u003E﻿\u003C/span\u003Eh\u003Cspan\u003E﻿\u003C/span\u003Ee\u003Cspan\u003E﻿\u003C/span\u003Ere\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E.\u0022\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624823\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561442063\u0022 data-ipsquote-userid=\u0022162784\u0022 data-ipsquote-username=\u0022OHara\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, OHara said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA significant fraction of people, even of those active in aviation, say adamantly that lift happens \u0027because\u0027 of Bernoulli\u0027s theorem rather than \u0027because \u0027 Newton\u0027s third law. \u003Cbr\u003E\nI have tried, but never really understood the distinction they had in their minds (maybe due to indoctrination to the conventional thinking via a Physics PhD).  My mind is used to the idea that physical laws \u003Cem\u003Edescribe, \u003C/em\u003Enot \u003Cem\u003Ecause, \u003C/em\u003Ethe behavior of things.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to avoid semantics, I have had success with \u0022whether the cause of lift or not, Newton\u0027s third law still holds true, for times when that is the simpler way to understand some aspect of flight.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed, as I said earlier \u0022When the air generates the lift force on the wing, the wing must be generating an equal force on the air. This means that it will be accelerating air downward. \n\u003C/p\u003E\n\u003Cp\u003E\nYou can\u0027t just throw out \u0027Bernoulli\u0027s principle\u0027, and get to ignore laws of physics.\u0022 and as the 2nd page of a link I posted says: \u0022\u003Cspan style=\u0022font-size:11px;\u0022\u003E \u003Cfont face=\u0022Verdana, Tahoma, Arial, Helvetica, Sans-serif, sans-serif\u0022\u003E In brief, the air bends around the wing producing downwash. Newton’s first law says that the bending of the air requires a force on the air, and Newton’s third law says that there is an equal and opposite force on the wing. That is a description of lift. The\u003Cstrong\u003E pressure difference across the wing is the mechanism in which lift is transferred to the wing due to the bending of the air\u003C/strong\u003E.\u003C/font\u003E\u003C/span\u003E \u0022 Now that pressure difference related to Bernoulli\u0027s principle, but these are just different ways of describing the same physical thing that is happening. In other words, \u0022They are one and the same\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2019-06-25T07:07:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624843\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561444658\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbut maybe I shouldn\u0027t have expected him to show up, when I suggested moving the discussion about lift mechanism here, he replied:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I see\u003Cspan\u003E﻿\u003C/span\u003E no point in t\u003Cspan\u003E﻿\u003C/span\u003Ehat.  You can\u0027t\u003Cspan\u003E﻿\u003C/span\u003E think i\u003Cspan\u003E﻿\u003C/span\u003En any t\u003Cspan\u003E﻿\u003C/span\u003Eerm\u003Cspan\u003E﻿\u003C/span\u003Es but the 3r\u003Cspan\u003E﻿\u003C/span\u003Ed Law, e\u003Cspan\u003E﻿\u003C/span\u003Even \u003Cspan\u003E﻿\u003C/span\u003Ewhen s\u003Cspan\u003E﻿\u003C/span\u003Ehown that\u0027s n\u003Cspan\u003E﻿\u003C/span\u003Eot even\u003Cspan\u003E﻿\u003C/span\u003E what\u0027s ha\u003Cspan\u003E﻿\u003C/span\u003Eppen\u003Cspan\u003E﻿\u003C/span\u003Eing \u003Cspan\u003E﻿\u003C/span\u003Eh\u003Cspan\u003E﻿\u003C/span\u003Ee\u003Cspan\u003E﻿\u003C/span\u003Ere\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229222d1442b4eddf2174afd550827957a.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002270.00\u0022 height=\u0022294\u0022 width=\u0022420\u0022 src=\u0022https://i.pinimg.com/originals/92/22/d1/9222d1442b4eddf2174afd550827957a.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2019-06-25T10:52:43Z","Content":"\n\u003Cp\u003E\nA couple of observations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthis debate has been going on (heatedly) in aviation/aeronautic circles for decades which ought to be a clear signal to the alert that this is not a black-or-white proposition.\n\u003C/li\u003E\n\u003Cli\u003E\ntherefore being \u0022correct\u0022 does not mean the other guy is entirely incorrect -- unless all you care about is \u0022being correct\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nNewton\u0027s Third Law predates powered flight by quite some time.  It is certainly true that momentum will be conserved, but perhaps that was not enough knowledge for Man to fly?\n\u003C/li\u003E\n\u003Cli\u003E\nWilbur Wright uttered the \u003Cstrong\u003Emetaphor,\u003C/strong\u003E \u0022a propeller is nothing but a twisted wing\u0022, which was a novel idea then to be communicated but it may be more helpful these days to think that both are just airfoils -- similar as airfoils but different in other ways.\n\u003C/li\u003E\n\u003Cli\u003E\nI personally guess that it is probable that you cannot deflect air efficiently (without undue turbulence) without understanding less obvious effects such as Bernoulli\u0027s and I wouldn\u0027t be at all surprised if a modern aeronautics 4-year program starts with 3 days to verify a student is sufficiently familiar with Newton\u0027s Laws and their implications and \u003Cu\u003Ethen spends the rest of the time on fluid dynamics\u003C/u\u003E and more.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nWhen the definition of a wing includes rubber-band powered balsa wings you can see that deflection of air is the purpose but when you look at the particular shape of a modern wing (an airfoil) and you ask \u0022well, what makes this an airfoil and not a plank?\u0022, you get the first glimmer that what is going on on the way to producing the final result (including displacement of air) is quite a bit more subtle.  (If you don\u0027t think this is important in modern aeronautics then consider that some of the first prototype parachutes were made of balsa wood -- and they did not work...)\n\u003C/p\u003E\n\u003Cp\u003E\nBeing \u0022correct\u0022 is fine but not so much fun when you have to accept that you are also being simplistic -- and dating yourself back in a pre-flight era.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if you don\u0027t think there isn\u0027t something a bit more surprising going on than simply sticking your hand out of a car\u0027s open window, then think about a sailing dinghy tacking upwind.  You might be certain that the sail is somehow deflecting air but you will have little hope of explaining how it does it unless you know[*] a lot more than Newton\u0027s Third.  This is where \u0022a propeller is nothing but a twisted wing\u0022 (in the 21st) equals a closed mind.\n\u003C/p\u003E\n\u003Cp\u003E\n* Thought experiment: predict what happens if you place spoiling devices on the windward side of the sail and then on the leeward and measure the respective differences in performance of the yacht??\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T11:35:36Z\u0022 title=\u002206/25/2019 11:35  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-25T11:41:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624947\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561459963\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthis debate has been going on (heatedly) in aviation/aeronautic circles for decades which ought to be...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s a lot of incorrect information circulating around on a lot of topics. Being able to fly a plane doesn\u0027t mean you understand the mechanism by which if flies. It means you understand what you need to do, not why you need to.\n\u003C/p\u003E\n\u003Cp\u003E\nYou yourself posted a link (in the other thread) that used an often repeated, and quite wrong demonstration of Bernoulli\u0027s principle:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bernoulli%27s_principle#Misapplications_of_Bernoulli%27s_principle_in_common_classroom_demonstrations\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Bernoulli\u0027s_principle#Misapplications_of_Bernoulli\u0027s_principle_in_common_classroom_demonstrations\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbeing \u0022correct\u0022 does not mean the other guy is entirely incorrect\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMost of what he was saying was fine, but on the specific point of the debate, there is a clear right or wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nThe aerodynamic principles of a propellor, a wing, and a rotary wing, are the same. To claim otherwise is just wrong, clear-cut.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt is certainly true that momentum will be conserved, but perhaps that was not enough knowledge for Man to fly?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNobody was claiming that it was.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyou cannot deflect air efficiently ... without ... less obvious effects such as Bernoulli\u0027s\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNobody was claiming otherwise. As I\u0027ve said repeatedly, Bernoulli\u0027s is just describing a mechanism by which air is deflected.\n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2019-06-25T12:07:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624967\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561462880\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBernoulli\u0027s is just describing a mechanism by which air is deflected.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd this is what I think causes the endless debate about either Bernoulli or Newton as the cause for flight; that, \u003Cu\u003Ein some flight regimes\u003C/u\u003E, there are a chain of \u0022causes\u0022 and any can be cited even though none can be dispensed with.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-25T13:35:42Z","Content":"\n\u003Cp\u003E\nIn every regime, Newton\u0027s 3rd law holds. Air is being deflected down. To say that is not the case is to be wrong. Whether or not air is being deflected down because of Bernoulli\u0027s principle is irrelevant to the earlier statement.\n\u003C/p\u003E\n"},{"CreatedByName":"wizzlebippi","CreatedById":85324,"CreatedDateTime":"2019-06-25T14:23:08Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Kutta%E2%80%93Joukowski_theorem\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.m.wikipedia.org/wiki/Kutta–Joukowski_theorem\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2019-06-25T14:30:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624947\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561459963\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA couple of observations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthis debate has been going on (heatedly) in aviation/aeronautic circles for decades which ought to be a clear signal to the alert that this is not a black-or-white proposition.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are still people who say the Earth is flat. The fact that they still debate this does not make it a clear signal that they may have a valid point.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625019\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561472588\u0022 data-ipsquote-userid=\u002285324\u0022 data-ipsquote-username=\u0022wizzlebippi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, wizzlebippi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Kutta%E2%80%93Joukowski_theorem\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.m.wikipedia.org/wiki/Kutta–Joukowski_theorem\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, a mathematically equivalent and convenient way of calculating the lift, but it doesn\u0027t change the physics. It\u0027s usually harder for people to understand \u0022circulation\u0022 than to understand other, more intuitive, ways of describing the situation.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, circulation does make it easier to understand why there are vortices that trail behind an airplane in flight.\n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2019-06-25T14:43:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/85324-wizzlebippi/\u0026amp;do=hovercard\u0022 data-mentionid=\u002285324\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/85324-wizzlebippi/\u0022 rel=\u0022\u0022\u003E@wizzlebippi\u003C/a\u003E Thanks for the citation.\n\u003C/p\u003E\n\u003Cp\u003E\nOf note for me, is this:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKutta and Joukowski showed that for computing the pressure and lift of a thin airfoil for flow at large \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Reynolds_number\u0022 rel=\u0022external nofollow\u0022 title=\u0022Reynolds number\u0022\u003EReynolds number\u003C/a\u003E and small angle of attack, the flow can be assumed inviscid in the entire region outside the airfoil provided the Kutta condition is imposed. This is known as the \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Potential_flow\u0022 rel=\u0022external nofollow\u0022 title=\u0022Potential flow\u0022\u003Epotential flow\u003C/a\u003E theory and works remarkably well in practice.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nand also the distinction about camber vs angle of attack. \n\u003C/p\u003E\n\u003Cp\u003E\nI actually don\u0027t know which side this comes down on (and you can annotate that for me), but it does give me the opportunity to elucidate my \u0022in some flight regimes\u0022 qualification.  Passengers today spend the great majority of their time airborne at cruise altitude/speed in a regime optimized for very low angle of attack.  At that speed, lots of lift can be produced but little (comparatively) is needed.  (The article I cited in the other thread was criticized for being wrong in one point but it made the point quite well that a small pressure differential over a large wing area can easily generate the required lift for \u003Cu\u003Elevel flight at high speed.\u003C/u\u003E)  At the same time, drag at high speed is a killer and the design effort needs to absolutely minimize it, which means eliminate turbulence and minimize any net deflection of the air.  In this regime, if Bernoulli\u0027s effect actually exists at all, it may be that it is completely sufficient in and of itself to provide the required lift.\n\u003C/p\u003E\n\u003Cp\u003E\n(The reason this is particularly interesting to me can be given by example: I build a twin Panther machine that cannot break the sound barrier and @swjr-swis reworks the machine and it does Mach 2.5.  He\u0027s done this enough times now that I fly the result and see that he has made small changes and the machine flies with some discernible inefficiencies in certain regimes, but by the time it has reached its top speed, the angle of attack is Zero and the drag penalty is as low as it can go.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T15:10:25Z\u0022 title=\u002206/25/2019 03:10  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Phreakish","CreatedById":186673,"CreatedDateTime":"2019-06-25T15:44:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624947\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561459963\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA couple of observations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthis debate has been going on (heatedly) in aviation/aeronautic circles for decades which ought to be a clear signal to the alert that this is not a black-or-white proposition.\n\u003C/li\u003E\n\u003Cli\u003E\ntherefore being \u0022correct\u0022 does not mean the other guy is entirely incorrect -- unless all you care about is \u0022being correct\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nNewton\u0027s Third Law predates powered flight by quite some time.  It is certainly true that momentum will be conserved, but perhaps that was not enough knowledge for Man to fly?\n\u003C/li\u003E\n\u003Cli\u003E\nWilbur Wright uttered the \u003Cstrong\u003Emetaphor,\u003C/strong\u003E \u0022a propeller is nothing but a twisted wing\u0022, which was a novel idea then to be communicated but it may be more helpful these days to think that both are just airfoils -- similar as airfoils but different in other ways.\n\u003C/li\u003E\n\u003Cli\u003E\nI personally guess that it is probable that you cannot deflect air efficiently (without undue turbulence) without understanding less obvious effects such as Bernoulli\u0027s and I wouldn\u0027t be at all surprised if a modern aeronautics 4-year program starts with 3 days to verify a student is sufficiently familiar with Newton\u0027s Laws and their implications and \u003Cu\u003Ethen spends the rest of the time on fluid dynamics\u003C/u\u003E and more.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nWhen the definition of a wing includes rubber-band powered balsa wings you can see that deflection of air is the purpose but when you look at the particular shape of a modern wing (an airfoil) and you ask \u0022well, what makes this an airfoil and not a plank?\u0022, you get the first glimmer that what is going on on the way to producing the final result (including displacement of air) is quite a bit more subtle.  (If you don\u0027t think this is important in modern aeronautics then consider that some of the first prototype parachutes were made of balsa wood -- and they did not work...)\n\u003C/p\u003E\n\u003Cp\u003E\nBeing \u0022correct\u0022 is fine but not so much fun when you have to accept that you are also being simplistic -- and dating yourself back in a pre-flight era.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if you don\u0027t think there isn\u0027t something a bit more surprising going on than simply sticking your hand out of a car\u0027s open window, then think about a sailing dinghy tacking upwind.  You might be certain that the sail is somehow deflecting air but you will have little hope of explaining how it does it unless you know[*] a lot more than Newton\u0027s Third.  This is where \u0022a propeller is nothing but a twisted wing\u0022 (in the 21st) equals a closed mind.\n\u003C/p\u003E\n\u003Cp\u003E\n* Thought experiment: predict what happens if you place spoiling devices on the windward side of the sail and then on the leeward and measure the respective differences in performance of the yacht??\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe debate \u0027between\u0027 bernoulli and newton with respect to aviation is not a debate. It\u0027s a conflict between people of varying degree of knowledge and scientific credentials. \n\u003C/p\u003E\n\u003Cp\u003E\nWings, propellers, rotors, or anything which moves through a fluid can have it\u0027s behavior and performance predicted by physics. The term \u0022bernoulli\u0022 gets thrown around, but all Bernoulli taught is that pressure drops linearly with an increase in velocity. That knowledge can be combined with the unwaveringly true 3rd law, which states that momentum must be conserved. \n\u003C/p\u003E\n\u003Cp\u003E\nA flat plate makes lift the same way an airfoil does - when you tilt a flat plate, the stagnation point changes which acts on the fluid (usually air) in such a way as to cause a pressure drop above the surface. This pressure drop is responsible for the creation of the lifting force. It is also responsible for an increase in drag - usually called induced drag.\u003Cbr\u003E\nAn airfoil is far more complex a shape, but for good cause - the geometry of an airfoil is intended to streamline the wing area upon which the reduced pressure in the fluid is acting. With the reduced pressure comes an increase in the speed of the fluid flow over the top of the wing. Pressure and Velocity are linked linearly, but momentum goes up with the square of velocity. As a result, the mass moving over the top of the wing has greater momentum.\u003Cbr\u003E\nSince a wing must have a trailing edge, the fluid cleaved by the wing will eventually rejoin - when it does, the fluid which has been acted upon over the top of the wing will have a greater momentum (coming from the work done which is propelling the wing through the fluid). The fluid flow will have a velocity vector with a downward component. If one were to integrate along the length of the wing and determine the magnitude of the momentum exchange, it would agree with the results of \u0022bernoulli\u0027s principle\u0022. \n\u003C/p\u003E\n\u003Cp\u003E\nBernoulli just helped develop a way to calculate it without having to take direct measurements of the fluid flow at all points along the chord of an airfoil. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T15:46:59Z\u0022 title=\u002206/25/2019 03:46  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by Phreakish\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Phreakish","CreatedById":186673,"CreatedDateTime":"2019-06-25T16:19:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625025\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561473831\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/85324-wizzlebippi/\u0026amp;do=hovercard\u0022 data-mentionid=\u002285324\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/85324-wizzlebippi/\u0022 rel=\u0022\u0022\u003E@wizzlebippi\u003C/a\u003E Thanks for the citation.\n\u003C/p\u003E\n\u003Cp\u003E\nOf note for me, is this:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003EKutta and Joukowski showed that for computing the pressure and lift of a thin airfoil for flow at large\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Reynolds_number\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#fbfbfb;color:#3d6594;font-size:14px;\u0022 title=\u0022Reynolds number\u0022\u003EReynolds number\u003C/a\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Eand small angle of attack, the flow can be assumed inviscid\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E﻿\u003C/span\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003Ein the entire region outside the airfoil provided the Kutta condition is imposed. This is known as the\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Potential_flow\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#fbfbfb;color:#3d6594;font-size:14px;\u0022 title=\u0022Potential flow\u0022\u003Epotential flow\u003C/a\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Etheory and works remarkably well in practice.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nand also the distinction about camber vs angle of attack. \n\u003C/p\u003E\n\u003Cp\u003E\nI actually don\u0027t know which side this comes down on (and you can annotate that for me), but it does give me the opportunity to elucidate my \u0022in some flight regimes\u0022 qualification.  Passengers today spend the great majority of their time airborne at cruise altitude/speed in a regime optimized for very low angle of attack.  At that speed, lots of lift can be produced but little (comparatively) is needed.  (The article I cited in the other thread was criticized for being wrong in one point but it made the point\u003Cspan\u003E﻿\u003C/span\u003E quite well that a small pressure differential over a large wing area can easily generate the required lift fo\u003Cspan\u003E﻿\u003C/span\u003Er \u003Cu\u003Elevel flight at high speed.\u003C/u\u003E)  At the same time, drag at high speed is a killer and the design effort needs to absolutely minimize it, which means eliminate turbulence and minimize any net deflection of the air.  In this regime, if Bernoulli\u0027s effect actually exists at all, it may be that it is completely sufficient in and of itself to provide the required lift.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReynolds number relates to the viscosity of a fluid flow, and increases with scale and speed (high Re means low viscosity). Kutta/Joukowski is good for approximating things  at very high speeds and of very large size (think airliners instead of paper airplanes). Boundary layers are thicker where fluid flow is slower, and thinner where it is faster - Kutta allows a simpler means of determine a \u0027true\u0027 performance analysis of an airfoil by helping approximate an effective shape of a given foil (assuming the analysis parameters hold to all of Kutta\u0027s constraints) such that it can be analyzed using inviscid principles. \n\u003C/p\u003E\n\u003Cp\u003E\nIn a nutshell, Kutta/Joukowski is typically used for very niche applications such as cruise regimes of large craft. It is based, however, on the very root principles of the physics of flight which can help illustrate the concepts of aerodynamic lift. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(The reason this is particularly interesting to me can be given by example: I build a twin Panther machine that cannot break the sound barrier and @swjr-swis reworks the machine and it does Mach 2.5.  He\u0027s done this enough times now that I fly the result and see that he has made small changes and the machine flies with some discernible inefficiencies in certain regimes, but by the time it has reached its top speed, the angle of attack is Zero and the drag penalty is as low as it can go.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne consequence of lift is drag. Induced drag is the component of drag which increases linearly with lift, and the square of velocity. Lift can be determined using Coefficient of lift and velocity, using the lift equation: L=A*Cl*q, where A is the wing area, Cl is the coefficient of lift, and q is dynamic pressure (1/2 *density*velocity-squared). Induced drag can be calculated using the equation: Cdi = (Cl^2) / (pi * AR * e) where Cl is coefficient of lift, pi is... pi (3.1415926....), AR is the aspect ratio and e is an efficiency factor. Now, I\u0027m pretty sure KSP doesn\u0027t calculate AR or e, but maybe it has an assumed e and does calculate AR? AR is a ratio of span versus area - longer spans have a higher AR and better efficiency too. This is why airliners and gliders have very long wings.\n\u003C/p\u003E\n\u003Cp\u003E\nAt any rate, from these equations we can see that an increase in wing area will increase lift without increasing the drag except by the amount of inherent parasitic drag the wing member creates. Parasitic drag is usually orders of magnitude lower than induced drag. The more wing area a craft has, the less angle of attack it needs, and as a result the Cl can remain low. A low Cl means low induced drag.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I\u0027ve observed, KSP doesn\u0027t technically calculate induced drag, but drag definitely increases with angle-of attack. What I\u0027ve found with craft in KSP that have a hard time reaching high speed is that they either: A) lack enough wing wing area to remain aloft in the subsonic range without a significant angle-of-attack and thus create more drag that prevents more speed, B) have a high parts with lots of drag cubes that keeps total drag too high to achieve supersonic performance. Remember that any angle of attack, positive or negative, means the entire fuselage is also exposed to the relative wind (airflow around the craft) which means that the various fuselage parts being to make their own drag. By keeping the angle of attack, of both the wings and fuselage, as low as possible - drag is minimized. As a result, short fuselages with minimal wing tend to do best. Think F22 instead of SR71. Long fuselages can contribute lots of drag unless the wing area and incidence angle (rotation of wing relative the body) are tweaked just-so. \n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2019-06-25T17:04:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624809\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561440107\u0022 data-ipsquote-userid=\u002245577\u0022 data-ipsquote-username=\u0022Shpaget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Shpaget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf course props have variable geometry. At the root the propeller the cord ratio is much higher than at the tip, and the entire aerofoil is twisted. That is to compensate for differences in airspeed near root and near tip of the blade. Using a simple wing geometry for prop would lead to inefficiency because wing is designed for one single airspeed - cruising. Each \u0022slice\u0022 of propeller crossection is designed for different airspeed because at the designed standard angular speed of the propeller different parts of the blades travel at different speeds. But there is not fundamental or conceptual difference.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBoth are airfoils optimized for different environments. I believe I mentioned this in my post. \n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2019-06-25T18:57:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625025\u0022 data-ipsquote-contentid=\u0022185783\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561473831\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI actually don\u0027t know which side this comes down on (and you can annotate that for me), but it does give me the opportunity to elucidate my \u0022in some flight regimes\u0022 qualification.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen it says \u0022in some flight regimes\u0022, think airplanes versus bumblebees. Generally speaking, with regard to the concept of boundary layers and potential flow, all subsonic airplanes are in the same \u0022flight regime\u0022. (If you go slow enough, staying below about Mach 0.3, you can simplify your calculations a lot by ignoring the effects of compressibility, but it\u0027s still potential flow as long as you isolate the effects of viscosity to a small boundary layer near the object.)\n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2019-06-25T21:45:43Z","Content":"\n\u003Cp\u003E\nYeah, propellors and wings are both aerofoils. They both create thrust by deflecting quantities of air by Newton\u0027s third law. An understanding of Bernoulli just allows you to design shapes that do so efficiently.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no special distinction for propellors or turbine blades. They just have twist and chord variation to compensate for the varying effective velocity vector of the incident airflow over the aerofoil due to the circumferential speed of the blade varying from the root to the tip. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T21:54:44Z\u0022 title=\u002206/25/2019 09:54  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by RCgothic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2019-06-26T00:06:40Z","Content":"\n\u003Cp\u003E\nWell, on reflection overnight, I\u0027ll yield on Bernoulli due to the following in the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Bernoulli%27s_principle\u0022 rel=\u0022external nofollow\u0022\u003EWikipedia article\u003C/a\u003E itself on Bernoulli:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n Modern writings agree that both Bernoulli\u0027s principle and Newton\u0027s laws are relevant and \u003Cu\u003Eeither can be used\u003C/u\u003E to correctly describe lift.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bernoulli\u0027s_principle#cite_note-Chanson2004-15\u0022 rel=\u0022external nofollow\u0022\u003E[12]\u003C/a\u003E\u003C/sup\u003E\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bernoulli\u0027s_principle#cite_note-31\u0022 rel=\u0022external nofollow\u0022\u003E[27]\u003C/a\u003E\u003C/sup\u003E\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bernoulli\u0027s_principle#cite_note-Ison2006-32\u0022 rel=\u0022external nofollow\u0022\u003E[28]\u003C/a\u003E\u003C/sup\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt is not the Bernoulli principle itself that is questioned because this principle is well established (the airflow above the wing \u003Ci\u003Eis\u003C/i\u003E faster, the question is \u003Ci\u003Ewhy\u003C/i\u003E it is faster).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAn impediment to understanding is that Bernoulli\u0027s principle is said to be based on Newton\u0027s Second Law whereas action/reaction is the Third Law -- one might think they are independent and separate.  In fluid dynamics with numerous molecules in action, a treatment with the Second Law might be much more tractable, but the Third Law still applies overall.  And thus Bernoulli and Newton III can be interchangeably employed; \u003Cstrong\u003Ethe implication of which is that air is deflected\u003C/strong\u003E as a reaction to the action of the wing.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm, one other thing, I think, was an impediment.  The conservation of momentum may have been mentioned along the way.  At first glance, thinking particularly of an airplane in level, un-accelerated flight, its momentum is constant.  However, it is harnessing lift to counteract gravity.  So for this force (under the circumstances which it is generated), some (less visible) reaction ought to be incurred.\n\u003C/p\u003E\n\u003Cp\u003E\nIn 2003, I started a new job and a new colleague opined that science did not have a full explanation for modern flight and, in particular, Bernoulli wasn\u0027t particularly any explanation.  I thought he was nuts, actually, because we know \u003Cstrong\u003Ehow \u003C/strong\u003Eto fly.  The open question above is whether we do now understand the \u0022why [it works]\u0022 well enough to have a complete consensus.  But in any case, Bernoulli seems very restricted.  And maybe that colleague was not nuts, either?\n\u003C/p\u003E\n\u003Cp\u003E\n(Thanks to those above who offered reasoned explanations.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-26T00:23:43Z\u0022 title=\u002206/26/2019 12:23  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 26, 2019\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"}]}