{"TopicId":185908,"ForumId":51,"TopicTitle":"Story: Breaking Ground on Laythe","CreatedByName":"jarmonik","CreatedById":152150,"CreatedDateTime":"2019-06-28T19:46:06Z","PageNum":1,"Articles":[{"CreatedByName":"jarmonik","CreatedById":152150,"CreatedDateTime":"2019-06-28T19:46:07Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am not sure how many are interested but I thought it might be good idea to share (atleast) one of my expeditions in KSP. If measured in time spend by playing the game then the KSP qualifies as the most successful game ever built in my books. Since it has almost twice as many hours in a record than the second most successful XCOM.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EKerbals breaking ground on Laythe.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EFirst Expedition\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nValentina Kerman is in a command of bringing a Laythe-Orbital station and LX-5 lander on it\u0027s \u0022backpack\u0022 to low orbit of Laythe during the first expedition. A group of scientist, engineers and pilots are also on approach trajectory to Laythe with a Kerbin return vehicle (KRV) and a Laythe Science Laboratory Mk3 (LSL-3). It wasn\u0027t practical due to stability reasons to pack all 3 vehicles with the station into a one big stack.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina was in a controls of LX-5 during the descent to the surface and Haysted Kerman is in a lead of a science team to setup a group of science equipment on the ground. Right now she\u0027s checking the ground and it appears to be pretty solid. After taking some atmospheric readings, Haysted can\u0027t resist temptation to remove his helmet and surprisingly she\u0027s still alive.   \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-2.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Story-2b.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-2b.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDaphtop and Jeb Kermans has landed a Laythe Science Laboratory Mk3 near the crater bay at Laythe. Scientific readins are being taken from a grey pink boulder.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-3.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s the crater bay, isn\u0027t it beautiful. While enjoying the view, Daphtop and Jeb are arguing about taking the LSL-3 to the Crater Island. It could hold real treasures for the science team and goals, So, it\u0027s worth the risks. Jeb and Dap will be allright but it\u0027s one way trip for the LSL due to limited range.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-4.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-4.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJeb hits the throttles to lift the LSL-3 up in the air. Daphtop is a bit startled due sudden shaking but Jeb got it under control, there\u0027s nothing to worry about and Jeb gives a nice grin back.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Crater Island was a bust, nothing there. Jeb had to call an LX-5 from the Orbital station to pick them up from the Crater Island and they have safely returned back to the Statiom. Daphtop is beating her head to an airlock in a dissapointment but Jeb is having a party with a fellow Kerbals since the expedition was a success after-all and it\u0027s time to rotate back home for a change.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Story-7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESecond Expedition\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA contract was signed with the Kerbal Space Program to build a surface base on Laythe. The base is pretty big but it\u0027s not that heavy. Weights only 24 tonnes. The monoprop tanks are empty and can be filled after arrival. Full tanks would add 7 additional tonnes more weight. The contreact contained a 1500 units of monoprop and 5000 units of ore and plenty of living space for Kerbals. Bill Kerman suggested to assemple the station on Laythe rather then sending it as a whole due to stability reasons.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-8.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nValentina and Jebediah Kermans are taking off with a space plane specially designed to deliver cargo to Laythe. Base frame is sent to Laythe along with a KRV and a new Laythe Science Laboratory. So, total of four vessels are in transit to Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-11.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-11.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EYears goes by...\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the base frame has finally arrived at Laythe. Enton Kerman has pulled the framework to it\u0027s intented deployment position next to the science camp that was set during the first expedition. Mac Kerman is at the science camp operating the equipment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s time for Leny Kerman to attach the ore containers in place.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-10.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-10.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJebediah is on a final approach to the base camp...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-12.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-12.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTouchdown, and it\u0027s time to Leny to unload Jeb\u0027s cargo and attach the Resource converter to the base so that the filling process may start to complete the contract goals.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-13.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-13.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Story-14.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-14.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJebediah is heading inside to have a glass of Kokakola, Jeb\u0027s fafourite drink. Maybe saying greetings for Valentina wouldn\u0027t be bad idea either.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-15.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-15.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMisey Kerman has undocked her brand new LSL-4 from the KRV and is heading towards the base camp. There is still plenty of science to be done. The LSL comes with a \u003Cem\u003E\u0022panic\u0022 \u003C/em\u003Eparachute but the LSL\u0027s hover thrust can stop the free fall with ease.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-15b.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-15b.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKerbals have gathered outside waiting for a pickup and return to the Laythe-Orbital\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-16.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-16.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLizgar is on a pilots seat of an LX-5 at final approach to the base camp. Anticipation in tense on board since everybody want\u0027s to see the white shores and fresh waters of Laythe. Can\u0027t wait the get down there. Fortunately, nobody has told them about the air and the slight issue waiting for them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-17.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-17.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMac Kerman is one of the lucky ones to get a ride back home after spending 10 years on a surface operating the instruments, Mac came with the first expedition. Others will stay behind to do the science during the coming years.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-18.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-18.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhile the LX-5 is still at the base camp it\u0027s time to re-assemple the orbital station to handle more traffic. Laythe is a popular destination for space tourists and it works as a central hub for every mission in Jool system.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-19.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-19.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nZelbree Kerman is overseeing the final preparations of the station and enjoying a breath taking sunrise, no better place for that than an EVA. It\u0027s time for the expedition members to rotate back to Kerbin.  Mission was success and all goals completed as planned.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-19b.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-19b.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EThird Expedition\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA contract is accepted to expand the base camp at Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-21.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-21.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nVeteran kerbals Jebediah, Dephtop and Bobory are on a special mission to land on a polar ice cap on Laythe. They are taking a brand new LX-5 to Low Kerbin Orbit (\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E) where they will dock with a booster rocket that will give them the boos they need to get them to Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-20.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-20.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLeny and Maggan are taking off with a space plane carying the expansion modules required by the contract. A booster rocket is also waiting for them too in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-22.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-22.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EYears goes by...\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah Kerman is the first one to arrive to Laythe with his team and has established a polar orbit. It\u0027s time to make a deorbit burn and start an approach to the polar cap.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-23.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-23.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJeb is making a tight left curve to lose some speed while eyeballing a suitable landing location. It looks smooth and flat, so, no problems expected with the landing. If Jeb messes this up, help is three years away from here. So, no quick rescue near by.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-24.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-24.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLanding was nice and smooth. Daphtop has deployed a set of science instruments and seems to be happy and excited. Jeb on the other hand looks like a frankenstein, totally zombified. Mayby the years spend in space watching the glowing ball in the instrument panels has taken it\u0027s toll on Jeb. He\u0027ll be happy when getting back to the cockpit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-25.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-25.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe sun barely shines here...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-26.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-26.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere is no way of reaching the Orbital Station from this location. There\u0027s not enough fuel for 45 degree plane change in LX-5. So, the only option for Jeb is to make a sub-orbital flight to the base camp and refuel there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-27.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-27.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina is maneuvering the fuel-hose to give Jeb the juice he needs... this is also a good opportunity for Valentina to get a ride to orbital station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-28.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-28.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOh crap, The fuel-hose doesn\u0027t fit, it\u0027s too thick. We ain\u0027t gonna fail a mission becuse of a quater of an inch. All hands on deck, this is an emergency. Little Kerbalishm saved the day and the fuel is flowing now. This certainly didn\u0027t go as planned. Obvious design flaw was found and it\u0027s time for Bill Kerman to get back to sketching board for LX-6 design. Maybe this should have been beta tested on Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-29.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-29.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s time to takeoff and dock with the Laythe-Orbital, Jeb is pushing the ramjets to their limits...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-30.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-30.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLeny and Maggan have reach the Jool system and are making a Tylo sling-shot. Only a few kerbals have ever been on Orbit of Tylo. Even fewer has set their fool on it. But everybody has flown by it and seen it. It\u0027s a standard method to reach almost any destination in Jool system. 400 - 500m/s boost isn\u0027t much but it\u0027s still something.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-31.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-31.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Story-32.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-32.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s time to decouple the booster and execute a deorbit burn. The booster is remotely maneuvered and docked with Laythe-Orbital to deliver the remaining fuel for the station before it gets de-orbited.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-33.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-33.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLeny and Maggan have landed and the unloading and base assemply is in progress.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-34.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-34.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLeny and Maggan have completed their part of the expedition succesfully just in time before the sunset and the contract is completed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-35.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-35.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s time to rotate back home and arrive with style.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Story-36.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-36.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Story-37.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022http://users.kymp.net/~p501474a/KSP/Story-37.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-28T19:55:26Z\u0022 title=\u002206/28/2019 07:55  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 28, 2019\u003C/time\u003E by jarmonik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JERONIMO","CreatedById":188491,"CreatedDateTime":"2019-06-28T21:06:19Z","Content":"\n\u003Cp\u003E\n Not bad... Not bad at all...\n\u003C/p\u003E\n"},{"CreatedByName":"demon_313","CreatedById":198403,"CreatedDateTime":"2019-07-04T12:03:16Z","Content":"\n\u003Cp\u003E\nI love the whole arrive home with style thing. That picture is awesome.\n\u003C/p\u003E\n"}]}