{"TopicId":185902,"ForumId":20,"TopicTitle":"Transpirational Cooling Anyone?","CreatedByName":"fifthfloyd","CreatedById":182196,"CreatedDateTime":"2019-06-28T18:30:18Z","PageNum":1,"Articles":[{"CreatedByName":"fifthfloyd","CreatedById":182196,"CreatedDateTime":"2019-06-28T18:30:18Z","Content":"\n\u003Cp\u003E\nSo I\u0027m a little new at posting things here but have been reading the forums and playing for a couple of years. I love playing with mods ( using a cool 115 of em right now) and I generally poke around just a little with the things I can do with modulemanager when I said to my self \u0022Self, do you care about transpirational cooling?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo, everybody knows \u003Cs\u003Ethe BFR\u003C/s\u003E Starship is going to do this and it makes a lot of sense why, so I started to think would I use that in my game? I generally send either a well winged spaceplane with a landing engine (pointed down) to Duna or a landable rocket that has a separate command pod \u002B heat shield for kerbin returns. I think, I don\u0027t have to let my rocket go when I get home just to reenter kerbin if I have this available. Now, there\u0027s plenty of ways to keep the heat down and do a bunch of aerobraking and \u003Cem\u003Eprobably \u003C/em\u003Enot blow up my rocket without doing anything new or different... I\u0027ve seen me do it.\n\u003C/p\u003E\n\u003Cp\u003E\nBut this is the add on board, right?\n\u003C/p\u003E\n\u003Cp\u003E\nSo I wonder why can\u0027t I just change an ablator to use liquidmethane, and then put it on things. Nothing seems to mind having ablatability (is that a word?) otherwise... it\u0027s just an available module and you can just get silly with it. Changing the resource to LqdMethane (I use KSPI, IFS and community*, but not realfuels I\u0027m not that deep) and I can get any part I\u0027ve bothered to try to consume methane on reentry. I think this is pretty cool. I started by adding the lqdmethane also to a part, but realized it can flow from a tank without trouble.\n\u003C/p\u003E\n\u003Cp\u003E\nI also love the aspect of landing the craft on Duna, making ldqmethane and lqdoxygen and using the lqdmethane for reentry on kerbin just like I always dreamed of doing (since the 2018 bfr is starship and stainless steel instead speech.)\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t have the physics brain things to do proper maths, so I\u0027ve just changed the pyrolysisLossFactor of the ablator module to 1/4 from that of a normal ablator so it uses more lqMethane and I feel better about my use of this. That\u0027s as sciency as I\u0027ve gotten on the maths.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there anyone in the kerbalverse that has better maths and physicsing for tweaking this? The only idea I think I have for a mod is to apply this ablator universally to parts of some category or whatever, but not really sure. Mostly I messed with the dragon tank and heat shield from kerbalreusability, some of nerteas parts from nearfuturelaunchvehicles like all the NCR bits for making a starship-like thing I cannot land to save Jebs life.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I just added this to my folder of cfg\u0027s that tweak things... \u0022The Way I Think things Should Be\u0022 mod, and will continue playing around with it. Just thought I might say hi and share the thoughts.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what I did to the dragon heat shield... as long as there is lqdmethane somewhere on board, it works.\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-c prettyprinted\u0022\u003E\n\u003Cspan class=\u0022lit\u0022\u003E@PART\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E[\u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003EHeatshield\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EM\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E]:\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EAFTER\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E[\u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003EKerbalReusabilityExpansion\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E]\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E!\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EMODULE\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E[\u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003EModuleAblator\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E]\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{}\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E!\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003ERESOURCE\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E[\u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003EAblator\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E]\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{}\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\n\tMODULE\n\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tname \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003EModuleAblator\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tablativeResource \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003ELqdMethane\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tlossExp \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022lit\u0022\u003E7500\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tlossConst \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022lit\u0022\u003E0.1\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tpyrolysisLossFactor \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022lit\u0022\u003E200\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//it was 6000\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\treentryConductivity \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022lit\u0022\u003E0.001\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tablationTempThresh \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022lit\u0022\u003E500\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\t\n\t\tuseChar \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022typ\u0022\u003ETrue\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\tcharModuleName \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E shieldChar\n\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E}\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\n\n\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E}\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2019-07-05T21:29:09Z","Content":"\n\u003Cp\u003E\npyrolysisLossFactor is close. lossExp and lossConst are almost certainly wrong but those are secondary in importance to pyrolysisLossFactor. ablationTempThresh is also wrong but IMO you can get away with it. You can even raise it if you want and say it\u0027s the temperature at which the pumps start to actually pump the cryogenic methane in. \n\u003C/p\u003E\n\u003Cp\u003E\nI did the math previously. The ones I said were wrong; I just left them alone too. If you want I could kick it around some more and come up with appropriate values but like I said I consider the other one more important. See below. I also configured it to convert the LqdMethane into Methane gas so it could be recovered with adequate storage although at that point I\u0027m not sure it counts as transpirational cooling...? \n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003EMODULE\n{\n\tname = ModuleAblator\n\tablativeResource = LqdMethane\n\toutputResource = Methane\n\tlossExp = -7500\n\tlossConst = 0.1\n\tpyrolysisLossFactor = 147.878\n\treentryConductivity = 0.01\n\tablationTempThresh = 500\n\toutputMult = 593.5983263598326 // round it if you want\n}\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}