{"TopicId":185984,"ForumId":70,"TopicTitle":"Minmus Biome Glitch?","CreatedByName":"PinheadLarry123","CreatedById":198575,"CreatedDateTime":"2019-07-01T18:36:04Z","PageNum":1,"Articles":[{"CreatedByName":"PinheadLarry123","CreatedById":198575,"CreatedDateTime":"2019-07-01T18:36:04Z","Content":"\n\u003Cp\u003E\nSo when I go to minmus and explore the planet, the biomes that should be there, are not there. So, Flats gets mixed up with Lesser Flats. Slopes with lowlands, same with midlands. I\u0027ve double checked the biome map online and my game and I know I\u0027m in a spot where there should be a certain biome, but a different biome is present. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI do have quite a few mods, but I removed all of them and did an uninstall/reinstall and I still have the same problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIs it something gameplay specific? Something I\u0027m not recognizing? A glitch?\n\u003C/p\u003E\n\u003Cp\u003E\nHow do I fix it?\n\u003C/p\u003E\n\u003Cp\u003E\nMy kerbal doing the research is a scientist on a rover.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMods:\n\u003C/p\u003E\n\u003Cp\u003E\nFilter Extensions, BoulderCo, Community Kit/Pack/TechTree, Distant Object, \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, GEAFlags and Terrain, Grounded, Interstellar Mods/fuel switch/hybrid rocketry, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, Kerbal Engineer, Joint Reinforcement, \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E, MechJeb2, Modular FlightIntegrator, Patch Manager, PlanetaryBaseInc, RealPlume, Scatterer, SmokeScreen, TextureReplacer, TweakScale, WarpPlugin\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know if you need more details \n\u003C/p\u003E\n"},{"CreatedByName":"PinheadLarry123","CreatedById":198575,"CreatedDateTime":"2019-07-02T16:29:55Z","Content":"\n\u003Cp\u003E\nI realized my problem, I was using an old biome map. There was a new biome map added in 1.3 that changed the biome layout. Was comparing different data. Thanks!\n\u003C/p\u003E\n"}]}