{"TopicId":186085,"ForumId":69,"TopicTitle":"Missing Squad folder","CreatedByName":"The Dressian Exploder","CreatedById":191542,"CreatedDateTime":"2019-07-05T12:30:32Z","PageNum":1,"Articles":[{"CreatedByName":"The Dressian Exploder","CreatedById":191542,"CreatedDateTime":"2019-07-05T12:30:32Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve installed a load of mods for my game, and when I fired the game up the loading screen got stuck loading the stock circular intake. I went into my GameData folder a clicked on the Squad folder to try and see what was wrong with it, but when I clicked on the folder a message appeared on my computer saying I couldn\u0027t access the folder and after closing that message the Squad folder simply vanished. disappeared. without a trace. I thought this may be that my computer was hiding the Squad folder so I didn\u0027t access it, but when I tried loading KSP I was greeted by a completely black screen and nothing else. Pls help people my Kerbals need you! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\numm just realised this is a MODDED install and I put it on the UNMODDED intalls support area (mods please move it)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-05T12:32:43Z\u0022 title=\u002207/05/2019 12:32  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 5, 2019\u003C/time\u003E by Spacenerd Kerman\u003C/strong\u003E\n\u003Cbr\u003Ein the wrong place rn...\n\u003C/span\u003E\n"},{"CreatedByName":"Serenity","CreatedById":179192,"CreatedDateTime":"2019-07-05T13:51:34Z","Content":"\n\u003Cp\u003E\nAre you on Steam?\n\u003C/p\u003E\n\u003Cp\u003E\nAre you looking on the correct install location?Maybe its in a different folder?\n\u003C/p\u003E\n\u003Cp\u003E\nCheck your recycling bin just in case...\n\u003C/p\u003E\n\u003Cp\u003E\nUhmm this sounds like a user permission problem, admin rights etc.\n\u003C/p\u003E\n\u003Cp\u003E\nTry to view the hidden files:Click View at the top of the folder window then Hidden items.\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2019-07-05T13:54:13Z","Content":"\n\u003Cp\u003E\nI wouldn\u0027t bother with triage at this point.  Move your mods and saves to safe place.   Uninstall the game.  Re-install the game.  See if it fires up stock.  If it does, put your mods and saves back.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it doesn\u0027t, or it breaks after re-installing the mods, then look into it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlthough a health check on your storage drive would certainly be a good idea.\n\u003C/p\u003E\n"}]}