{"TopicId":186246,"ForumId":16,"TopicTitle":"Relay to connect kerbin with ike","CreatedByName":"Space Nerd","CreatedById":198691,"CreatedDateTime":"2019-07-11T03:49:20Z","PageNum":1,"Articles":[{"CreatedByName":"Space Nerd","CreatedById":198691,"CreatedDateTime":"2019-07-11T03:49:20Z","Content":"\n\u003Cp\u003E\nI\u0027m playing in sandbox and want to send Bob to ike,is 3 synchronous orbit relays and 1 in sol orbit enough to always get signal? (I will use the biggest antenna)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-11T07:04:03Z\u0022 title=\u002207/11/2019 07:04  AM\u0022 data-short=\u00224 yr\u0022\u003EJuly 11, 2019\u003C/time\u003E by Space Nerd\u003C/strong\u003E\n\u003Cbr\u003EAdded more content\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2019-07-11T11:48:34Z","Content":"\n\u003Cp\u003E\nIt\u0027s enough but possibly in the wrong place.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the relays are in the plane of the solar system then there will inevitably be times when they are blocked from any other planet - by Mun, for instance.  Give yourself a different perspective by putting them in polar orbits and think of looking \u0027over\u0027 and \u0027under\u0027 the intervening bodies rather than trying to see through or around the clutter.\n\u003C/p\u003E\n\u003Cp\u003E\nYou may also like to consider a highly-eccentric polar orbit, with apoapsis near the limit of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and periapsis as low as avoiding collisions permits.  In such an orbit your relays will spend the vast majority of the time far above, or below, the system plane and have a view only possibly blocked by the sun.  You already know how to get around the sun :-)\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-07-11T12:05:59Z","Content":"\n\u003Cp\u003E\nYou don’t need the one in Sol orbit. A level 3 tracking station will see the biggest relay antenna well past Eeloo. \n\u003C/p\u003E\n\u003Cp\u003E\nI usually put a constellation with one 15G antenna and two or three 2G ones in a polar orbit around Duna beyond Ike’s orbit/\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E. There will be one above Ike’s horizon almost all the time anywhere on the body.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2019-07-11T13:36:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223632805\u0022 data-ipsquote-contentid=\u0022186246\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221562816960\u0022 data-ipsquote-userid=\u0022198691\u0022 data-ipsquote-username=\u0022Space Nerd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Space Nerd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m playing in sandbox and want to send Bob to ike,is 3 synchronous orbit relays and 1 in sol orbit enough to always get signal? (I will use the biggest antenna)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHowdy and welcome to the forum.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my signature is a link to an old-but-still-valid introduction to KSP\u0027s comm system.  That will explain all reasons why you don\u0027t need to get overly complicated with your network but \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/96332-pecan/\u0026amp;do=hovercard\u0022 data-mentionid=\u002296332\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/96332-pecan/\u0022 rel=\u0022\u0022\u003E@Pecan\u003C/a\u003E has pretty well summarized it already :).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re sending a lone scientist, then I\u0027m assuming you\u0027ll be returning the bulk of the data instead of transmitting, so you\u0027re primary concern is having a link so the probe core on the ship can handle \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E for the burns along the way.  Is that about right?  If so, then the 1st thing to understand is that you only need a link at all when you\u0027ll be doing those burns.  You can always wait a little while to transmit science until you get a link.\n\u003C/p\u003E\n\u003Cp\u003E\nThe best way to get this is to put a pair of the biggest relays you\u0027ve got in highly eccentric polar orbits at both Kerbin and Duna, one going up and the other down.  This will always give you a link as far as the Duna system (unless the sun is between Kerbin and Duna) , over or under every planet/moon that could get in the way.  And this will also cover the bulk of the Duna system as well, plus all the interplanetary space in between.  The only blind spot would then be the back side of Ike near the equator when that\u0027s facing away from a direct line to Kerbin.  To fill this gap, put 1 (or 2 at most) small relays in medium-altitude equatorial orbits at Ike.  Then the link can come from one of Duna\u0027s polar relays to an Ike equatorial relay, and thence to the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no such thing as a network that provides 100% coverage 100% of the time.  But with a fairly simple set-up like this, you can provide coverage everywhere and usually right when you need it.  You might have to wait a short time on the back side of Ike once in a while for the equatorial satellite to come over the local horizon, but this won\u0027t be very long and is easy enough to plan your burns (and any transmissions) around.\n\u003C/p\u003E\n\u003Cp\u003E\nAs mentioned, no matter how you set up your system, the sun will always come between Kerbin and whatever planet you\u0027re at somewhere along the way.  So when planning your flight, try to get to Duna before this happens, so you can grab your science and be ready to leave.  By the time the return transfer window comes around, you should have a clear shot home.\n\u003C/p\u003E\n\u003Cp\u003E\nTo avoid this worry, it\u0027s a good idea to put polar relays at every planet except Moho.  That way, you can almost always have a link around the sun.  This is especially important when you go to Jool because the size of that system means it takes months to explore, so the sun WILL definitely block the line from Kerbin at some point.  So any time you go to a planet for the 1st time, be sure to include a pair of polar relays in the plan.  Equatorial relays can wait until you actually want to land there.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Space Nerd","CreatedById":198691,"CreatedDateTime":"2019-07-11T13:58:07Z","Content":"\n\u003Cp\u003E\nI\u0027m not returning any science, just want to take Bob on a ride.\n\u003C/p\u003E\n\u003Cp\u003E\nI know the biggest antenna have a range well past eeloo, the solar orbit one is just for when kerbin is blocked by the sun.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for all the help, I guess I will try to add more to my current relays(3 in a almost equatorial synchronous orbit and one stuck in keosynchronous transfer orbit, all has 100G antenna.)\n\u003C/p\u003E\n\u003Cp\u003E\nI will deorbit Bob and send Jeb instead.\n\u003C/p\u003E\n\u003Cp\u003E\nThe relay will be done when I have time.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-11T14:31:58Z\u0022 title=\u002207/11/2019 02:31  PM\u0022 data-short=\u00224 yr\u0022\u003EJuly 11, 2019\u003C/time\u003E by Space Nerd\u003C/strong\u003E\n\u003Cbr\u003EChanged my mind\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2019-07-11T15:15:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223633003\u0022 data-ipsquote-contentid=\u0022186246\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221562853487\u0022 data-ipsquote-userid=\u0022198691\u0022 data-ipsquote-username=\u0022Space Nerd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, Space Nerd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know the biggest antenna have a range well past eeloo, the solar orbit one is just for when kerbin is blocked by the sun.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRelays in solar orbit are essentially the same as having polar relays at the various planets.  They give you more possible paths around the sun when other planets are inconveniently aligned.  Nice to have but not really necessary.  If you launch a Sentinel mission, you might as well stick a relay antenna on it as well but I don\u0027t I don\u0027t go out of my way to populate solar orbit with relays.\n\u003C/p\u003E\n\u003Cp\u003E\nA problem with putting things in synchronous orbits (as if at the Trojan points) is that they don\u0027t stay there.  You can\u0027t ever get the periods exactly right and even if you come close, floating point errors accumulate over time.  Thus, eventually the satellites will drift into the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E of the planet they\u0027re sharing the orbit with and then get ejected higher and yon.  The time required for this depends on the orbital period:  possibly years in Kerbin\u0027s orbit, just a few weeks or months in Mun\u0027s orbit.  So it\u0027s generally better to put solar-orbiting relays in between the planet orbits to avoid this problem.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, of more day-to-day concern is that relays in solar orbit are in the ecliptic plane so are vulnerable to being blocked by intervening planets and moons.  Thus, it\u0027s best to put them in somewhat inclined orbits so most of the time they\u0027re not QUITE on the ecliptic.  However, significant plane changes in solar orbit are rather expensive on \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Space Nerd","CreatedById":198691,"CreatedDateTime":"2019-07-12T03:41:48Z","Content":"\n\u003Cp\u003E\nYeah the solar orbit relay would be between kerbin and duna but I will use polar relays instead.\n\u003C/p\u003E\n"}]}