{"TopicId":186972,"ForumId":25,"TopicTitle":"Multiplanetary: The long walk to Duna","CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2019-08-05T11:04:20Z","PageNum":1,"Articles":[{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2019-08-05T11:04:20Z","Content":"\n\u003Cp\u003E\nIn this challenge we can explore the fine details of setting up a colony on Duna. It\u0027ll go into more depth than a Duna Speedrun or an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E to Duna challenge, but hopefully will be less intensive than the Duna Outpost Mission Architecture epic. If you are doing a DOMA challenge, that may count for this challenge also. This challenge is open-ended; you can technically send a scouting party to Duna, come back and then ignore Duna and colonize somewhere else and still get full points. Rather than bothering with NPM and near-Kerbin shuttles and pizza delivery \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u0027s, your limit for each phase is a budget in normal credits. Since I\u0027m giving everyone tons of money I\u0027ll also limit the total number of colonists available. If people also record their tonnage that might be interesting to put on a leaderboard.\n\u003C/p\u003E\n\u003Cp\u003E\nIn summary, the challenge includes three mission profiles;\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInvestigation - Budget: 1 million kerbucks and 2 years.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn the investigation phase of the colony, you need to figure out what this murky red dot on your telescopes is. This phase is complete no sooner than when you first \n\u003C/p\u003E\n\u003Cp\u003E\n* Send at least two equatorial satellites, a polar satellite and an unmanned lander to Duna. \u003Cstrong\u003E\u002B50 points. -10 points for every craft destroyed or permanently out of communication with \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E after completing objective (having an uplink only sometimes is OK).\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) The lander may be manned. In this case it must meet the Exploration objectives and uses the Exploration budget instead.\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Send a satellite past Ike before it enters its final orbit. \u003Cstrong\u003E\u002B5 points \u003C/strong\u003EOR put an additional satellite in permanent orbit over Ike \u003Cb\u003E\u002B10 points\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Return a lander with Duna ground data to Kerbin \u003Cstrong\u003E\u002B20 points\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Return a lander with Ike ground data to Kerbin \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional): Leave an unmanned science lab \u003Cstrong\u003E(\u002B5 points)\u003C/strong\u003E, 2.5 meter \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E and mining rig \u003Cstrong\u003E(\u002B5 points)\u003C/strong\u003E, and return vehicle for 4 Kerbals \u003Cstrong\u003E(\u002B5 points)\u003C/strong\u003E on the surface for the Exploration crew.\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Silver Age of Rockets: Use only tech costing 300 science points or less to unlock.\u003Cstrong\u003E \u002B10 points.\u003C/strong\u003E OR use only tech costing 160 science or less to unlock\u003Cstrong\u003E \u002B25 points\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E(\u003C/b\u003EOptional) All stock (for this stage): \u003Cstrong\u003E\u002B5 points\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n* Staying on budget. \u002B5 points per 100k kerbucks UNDER budget up to \u002B25, -5 points per 100k OVER budget up to -25. If your craft costs 750k credits, you get \u002B10 points. If it costs 5 million, -25 points. Rescue craft and unplanned refueling trips count!\n\u003C/p\u003E\n\u003Cp\u003E\n* Because SCIENCE: Per 100 science brought home \u002B2 points (for all phases).\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Career mode with schedule starting on Y1 D1 with 5,000,000 starting cash and 1000 starting science \u003Cstrong\u003E\u002B50 points \u003C/strong\u003EOR start with 10 million funding and 5000 science \u003Cstrong\u003E\u002B25 points. \u003C/strong\u003EBuilding upgrades don\u0027t come out of mission budget, but still count against your career total funds. Any launch that leaves \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E (250km altitude over Kerbin) counts against your total mission budget, even if it nets funds in total because of contracts or discoveries. Launches to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E count against total mission budget if they score points (for example, if they score science points that are counted towards Because SCIENCE).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExploration - Budget: 2 million kerbucks and 3 years. Budget and schedule are tracked separately from Investigation phase.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDuring the exploration phase, you establish the feasibility of keeping Kerbals alive on a mission to the Red Planet and figure out whether or not you can ever get them home.\n\u003C/p\u003E\n\u003Cp\u003E\n* Plant a flag and bring a surface sample home from Duna \u003Cstrong\u003E\u002B50 points. \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E* \u003C/strong\u003ESend two Kerbals to the surface of Duna and return them safely home\u003Cstrong\u003E \u002B50 points. -25 points for every kerbal who dies in this phase, including optional objectives.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E(\u003C/b\u003EOptional) Send up to 8 extra Kerbals to the surface of Duna and return them safely home \u002B5 points each, up to \u002B40 points, and they are bonus colonists.\n\u003C/p\u003E\n\u003Cp\u003E\n* Kerbals Need Food Badly: Use a life support mod OR bring 0.04 units of ore per kerbal per day for them to eat. Ore that\u0027s been eaten already can be dumped prior to maneuvers. Kerbals starve and die after 30 days. \n\u003C/p\u003E\n\u003Cp\u003E\n* EVA suits have 6 hours of life support. Kerbals that spend too long on EVA die. Kerbals in a command chair have no life support limit but still need food.\n\u003C/p\u003E\n\u003Cp\u003E\n* Staying on budget: \u002B5 points per 200,000 kerbucks under budget up to \u002B25 at 1 million cost. -5 points per 200k over budget up to -25 at 3\u002B million cost.\n\u003C/p\u003E\n\u003Cp\u003E\n* Slept through the apocalypse: \u002B2 points per 3 months ahead of schedule. -2 points per 3 months behind schedule.\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Plant a flag and bring a surface sample home from Ike \u003Cstrong\u003E\u002B10 points.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Per other planet and moon explored  (flag and sample returned home and recovered)\u003Cstrong\u003E \u002B5 points.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E(\u003C/strong\u003EOptional) Golden Age of Space Exploration: Use only tech costing 550 points or less to unlock.\u003Cstrong\u003E \u002B10 points \u003C/strong\u003EOR use only tech costing 300 points or less to unlock\u003Cstrong\u003E \u002B25 points\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Not using Near Future mods and equivalent \u003Cstrong\u003E\u002B10 points \u003C/strong\u003EOR stock \u003Cstrong\u003E\u002B25\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EColonization  - Budget: 3 million kerbucks and 5 years. Budget and schedule are tracked separately from Investigation and Exploration phase.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n* Bring colonists to Duna. Keep them there and alive for at least 3 years. Per colonist-year on Duna \u002B5 points (25 habitation points per colonist possible).\n\u003C/p\u003E\n\u003Cp\u003E\n* Once the technology has proven itself, the people will flock to space like rats fleeing a sinking ship, but until the 5-year trial period is up only 80 colonists are brave or foolhardy enough to risk their lives chasing the dream of living in a tiny box for 5 years eating freeze-dried food and drinking recycled urine. Your recovered explorers are also willing to tag along, meaning you potentially have as many as 90 vic--er, volunteers. \n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Be fruitful and multiply. Per colonist-year in space, Mun, Minmus or Ike \u002B1 points. Per colonist-year on other moons, \u002B2 points. Per colonist-year on other planets, \u002B5 points. Colonies must exist for at least 3 years to be worth any points. Done right, an interplanetary transport ship can count as a colony in its own right, but passengers who spend less than 3 years aboard are worth zero points.\n\u003C/p\u003E\n\u003Cp\u003E\n* A colony ceases to become viable and stops generating points if it has no kerbals inhabiting it. However, colonists that previously scored points there still keep their points.\n\u003C/p\u003E\n\u003Cp\u003E\n* Colonists need food. Either use a life support mod, like Snacks!, or assume each colonist will need 0.04 units of ore per person per day. Ore that\u0027s already been eaten can be flushed. Colonists with no food for 30 days starve and die.\n\u003C/p\u003E\n\u003Cp\u003E\n* Unlike the brave, bold explorers, colonists need space. Each colonist needs either a full Mk1 passenger cabin, half a HitchHiker, or 1/6th of a mk3 passenger module to themselves. Colonists without sufficient space become krazy kolonists after 30 days and are worth zero habitation points, but are still worth recovering. Command modules and science labs do not prevent colonists from becoming krazy, but science labs still score Because SCIENCE! points for research done. Explorers still ignore this requirement. If your life support module uses a habitation/homesickness system, use that instead.\n\u003C/p\u003E\n\u003Cp\u003E\n* Colonists are worth zero points before the Explorers land safely home, even if they\u0027ve been somewhere for a while. You cannot complete Colonization before you complete Exploration.\n\u003C/p\u003E\n\u003Cp\u003E\n* Colonists that die are worth zero points and incur a penalty of\u003Cstrong\u003E -10 points per dead colonist. \u003C/strong\u003EYour explorers are still heroes and their deaths are still national tragedies. \u003Cstrong\u003E-25 points per dead Explorer who dies in this phase.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E* \u003C/strong\u003EColonists that spend more than three consecutive days in a command chair, staring unprotected into the yawning abyss of space, become Krazy Kolonists. Explorers do not face this limit as they are already a bit krazy.\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Bring them home. \u002B10 points per planetary colonist safely recovered to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. \u002B5 points per colonist recovered from other moons. Colonists must have inhabited a colony for at least 3 years, but even krazy kolonists score points for being recovered. Perhaps someday, with proper treatment and living with their loved ones, they might recover from their traumatic experience.\n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Colonists who are given an entire Mk2 cabin to themselves or a personal, one-seat rover, flyer, or orbit-capable escape pod consider this the height of luxury and generate 6 habitation points, instead of 5, per colonist-year on a planet, or 3 habitation points instead of 2 on distant moons.\n\u003C/p\u003E\n\u003Cp\u003E\n* Staying on budget: \u002B5 points per 200,000 kerbucks under budget up to \u002B25 at 2 million cost. -5 points per 200k over budget up to -25 at 4\u002B million cost.\n\u003C/p\u003E\n\u003Cp\u003E\n* Staying on schedule: Time starts when the Explorers are recovered. Recovering colonists does not count against the schedule. \n\u003C/p\u003E\n\u003Cp\u003E\n(Optional) Not using Near Future mods\u003Cstrong\u003E \u002B10\u003C/strong\u003E OR stock \u003Cstrong\u003E\u002B25\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMods:\u003C/strong\u003E\u003Cbr\u003E\n-All craft and kerbals must originate from Kerbin, although secondary launch sites are acceptable on that planet.\n\u003C/p\u003E\n\u003Cp\u003E\n-Alcubierre drive and other space warps are prohibited. This contest follows the universal speed limit. Most really fancy drives are also really expensive and high-tech; if you find an exception that you want to use please ask. Examples I used: Lithium Plasma Ion drives from Near Future, \n\u003C/p\u003E\n\u003Cp\u003E\n- In general for mod parts, each kerbal needs at least 2 seats to stay sane. Especially light parts, like command seats and airlocks, don\u0027t count; and especially heavy parts might count as \u0022luxurious\u0022 and generate extra points. When in doubt, plan to bring the Kerbin home since even krazy kolonists are worth points if you return them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003EEntries and top scores\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n* My entry will be the DOMA Arigato mission log, up to the start of Year 9 and will include Aries, Artemis and Leviathan. My Investigation phase is completed at the conclusion of the Duna Insight challenge, and the Exploratory phase will end with the return of Artemis and the exploration crew around the start of Year 4, at which point the 5-year scoring countdown for Colonization will begin. The crew I leave on Duna prior to year 4 don\u0027t count for this challenge, although they will handily be in place or almost in place when Colonization scoring starts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETips and tricks\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExample scores:\n\u003C/p\u003E\n\u003Cp\u003E\n- Colonist who spent 5 years on Duna with a personal rover, who was later recovered to Kerbin: 40 points each: 6 habitation points per kerbal-year times 5 years, plus 10 points for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n- Colonist who spent 5 years on Ike with a personal orbit-capable escape pod and a Mk1 passenger cabin, who was later recovered: 20 points each: 3 points per kerbal-year times five years, plus 5 points for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n- Colonist who spent 5 years in a command chair on Ike and was brought home in a straightjacket: 5 points each: Zero points for a krazy kolonist, plus 5 points for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n- Colonist who spent 10 years in interplanetary space in a research lab, but then starved to death:  -10 points for killing a colonist, plus many points for all the doomsday weapons they invented (2 points per 100 science). Budget is still spent from the Colonization budget and the Mad Scientist still counts against your total colonists available.\n\u003C/p\u003E\n\u003Cp\u003E\n- Colonist who spent 8 years on Duna in a research lab with an attached Hitchhiker cabin, who is abandoned on Duna: 25 points for the sane scientist (5 per year up to 5 years), plus many points for all the doomsday devices.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002212239\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed9132383328\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/180225-doma-arigato-duna/page/2/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-18T18:10:27Z\u0022 title=\u002208/18/2019 06:10  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 18, 2019\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2019-08-05T18:29:37Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgbb.com/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022Long-walk-to-Duna-patch.png\u0022 src=\u0022https://i.ibb.co/tq6ZsRP/Long-walk-to-Duna-patch.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFirst pass on a patch. Not that good, but I think the trefoil Hohmann transfer and the \u0022It\u0027s a long walk to Duna\u0022 slogan are the right general theme for it. Might need to use some other editor than paint, tho, that can make curved text.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-05T18:34:59Z\u0022 title=\u002208/05/2019 06:34  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 5, 2019\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ResonantWaves","CreatedById":197394,"CreatedDateTime":"2019-08-14T09:05:03Z","Content":"\n\u003Cp\u003E\nThis is a genius idea for a challenge! I love it and will be entering when I get back to my PC in September. Looking forward to it, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/12239-dire/\u0026amp;do=hovercard\u0022 data-mentionid=\u002212239\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/12239-dire/\u0022 rel=\u0022\u0022\u003E@dire\u003C/a\u003E!\n\u003C/p\u003E\n"}]}