{"TopicId":187241,"ForumId":16,"TopicTitle":"Help with recovering a Kerbal from a Habitation Module","CreatedByName":"TheThugler","CreatedById":199445,"CreatedDateTime":"2019-08-16T22:40:02Z","PageNum":1,"Articles":[{"CreatedByName":"TheThugler","CreatedById":199445,"CreatedDateTime":"2019-08-16T22:40:02Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve done a couple recovery missions already and have the approach and intercept nailed down but I ran into a roadblock on this one. My target is inside a Habitation Module with no option to EVA, or any type of docking port that I can tell. How do I go about getting him out?\n\u003C/p\u003E\n\u003Cp\u003E\nMy best guess is to go up with some other station part and connect them to transfer crew but I don\u0027t even know if that is thing. It\u0027s my first play through so any advice would be greatly appreciated.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Thank you everyone for the advice! I grabbed the Module with THE KLAW and did the crew transfer. MISSION SUCCESS! I\u0027m really impressed with this community, as a first post I half expected to be ignored or trolled but you all gave solid and sound advice. I look forward to learning more with all of you. Thanks again!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-18T17:29:30Z\u0022 title=\u002208/18/2019 05:29  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 18, 2019\u003C/time\u003E by TheThugler\u003C/strong\u003E\n\u003Cbr\u003EMISSION SUCCESS\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2019-08-17T02:02:03Z","Content":"\n\u003Cp\u003E\nYou use square bracket to shift to his capsule and don\u0027t get the EVA button on portrait at lower right? \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-08-17T02:24:30Z","Content":"\n\u003Cp\u003E\nDoes this habitation module (from a mod, I assume?) have any doors on it at all? If it has no doors, then you are mostly SOL. Your only option then is to use a klaw to actually dock with it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it does have a door, then when you use [ or ] to focus the module, you can probably double click on the door and you will get an EVA option that way.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-17T02:25:18Z\u0022 title=\u002208/17/2019 02:25  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 17, 2019\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheThugler","CreatedById":199445,"CreatedDateTime":"2019-08-17T02:25:05Z","Content":"\n\u003Cp\u003E\nI get the EVA button no problem when my rescue vessel is between 5-10m of the vessel and I switch control to the thing I want to rescue. The problem is that I can\u0027t get the Kerbal out of it. Is there a coupling part I can use later in the Tech Tree? I\u0027m completely lost on how to approach this problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2019-08-17T02:25:18Z","Content":"\n\u003Cp\u003E\nHi, and welcome aboard!\n\u003C/p\u003E\n\u003Cp\u003E\nDo you mean the Hitchhiker module?  It should have usable hatches.  If you aren\u0027t close enough to the target (2km I think), you\u0027re not even able to focus on the craft, but it sounds like you\u0027re past that point.  You could try both clicking on the portrait, and left-clicking on a hatch, and see if one works for an EVA.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t think of any part on a Kerbal rescue contract that isn\u0027t supposed to let you EVA the Kerbal.  Sometimes on missions where you have to recover the craft as well, you need to use the Klaw to grab the other ship.  You shouldn\u0027t need that here, but I suppose you could try it as a workaround.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"vossiewulf","CreatedById":179033,"CreatedDateTime":"2019-08-17T02:25:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223651681\u0022 data-ipsquote-contentid=\u0022187241\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221565995202\u0022 data-ipsquote-userid=\u0022199445\u0022 data-ipsquote-username=\u0022TheThugler\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, TheThugler said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy best guess is to go up with some other station part and connect them to transfer crew but I don\u0027t even know if that is thing. It\u0027s my first play through so any advice would be greatly appreciated.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought there was some validation of the modules used in rescue missions now, but I used to get those all the time. If you grab the module with one of the Grabber modules, it\u0027s like docking and you should be able to transfer him to your capsule module if you have unlimited transfers enabled, which is somewhere in the difficulty settings.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, unless it proved totally impossible, I would figure out how to recover the module with the guy still in it. If you grab a module almost exactly along its longitudinal axis and use a heat shield of sufficient diameter to mask both, AND you remember to put on enough parachutes to handle the mass of your ship plus the second module, you can land them and then just recover the ship as normal and at that point the rescue crews finally cut him out.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2019-08-17T02:38:50Z","Content":"\n\u003Cp\u003E\nIt might help if you have a picture of the hab module, or if you can give us the exact name. (In the past, some of the habs didn\u0027t have a portrait or hatch, so you had to grab on with a claw before you could get the kerbal out. I don\u0027t know if that\u0027s still the case in the current version.)\n\u003C/p\u003E\n"},{"CreatedByName":"HansAcker","CreatedById":195534,"CreatedDateTime":"2019-08-17T16:24:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223651754\u0022 data-ipsquote-contentid=\u0022187241\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566008737\u0022 data-ipsquote-userid=\u0022179033\u0022 data-ipsquote-username=\u0022vossiewulf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, vossiewulf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI thought there was some validation of the modules used in rescue missions now\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI guess the rescue contract expects command modules to have a hatch. That\u0027s not true for some modded parts, e.g. the surface-attachable cupola from SSPXr is such a command module without an exit.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I encounter one of those on a rescue contract, I just edit reality and change the part name to \u0022cupola\u0022 in the save file, then reload.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Now that I thought about it again, I seem to be wrong. Rescue contracts don\u0027t always pick command modules, do they?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-17T16:29:15Z\u0022 title=\u002208/17/2019 04:29  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 17, 2019\u003C/time\u003E by HansAcker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"catonthekbd","CreatedById":189435,"CreatedDateTime":"2019-08-17T16:53:09Z","Content":"\n\u003Cp\u003E\ngrab with Klaw, then just transfer the Kerbal to the the rescue craft? - no need for the EVA\n\u003C/p\u003E\n\u003Cp\u003E\n(just suspend disbelief \u003Cspan\u003E\u003Cspan\u003E! )\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}