{"TopicId":187338,"ForumId":109,"TopicTitle":"KSP2 Hype Train Thread","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2019-08-19T20:46:45Z","PageNum":90,"Articles":[{"CreatedByName":"Rutabaga22","CreatedById":221143,"CreatedDateTime":"2022-10-24T23:54:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190326\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666655483\u0022 data-ipsquote-userid=\u0022221533\u0022 data-ipsquote-username=\u0022Superluminal Gremlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Superluminal Gremlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EHow many more stock parts do you reckon we will have on the very first early access release?\u003C/span\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan\u003E The same? more? less?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think we will have some of the new near future stuff, like the MSEVs we\u0027ve seen and the new engines, pods, etc.\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2022-10-25T01:50:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190326\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666655483\u0022 data-ipsquote-userid=\u0022221533\u0022 data-ipsquote-username=\u0022Superluminal Gremlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Superluminal Gremlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E2. How many more stock parts do you reckon we will have on the very first early access release?\u003C/span\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan\u003E The same? more? less?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLess. Procedural wings eliminate a lot, as does not having any science parts in the first release. The smart interstage fairings also likely eliminates a few parts as well.\n\u003C/p\u003E\n"},{"CreatedByName":"t_v","CreatedById":213541,"CreatedDateTime":"2022-10-25T02:02:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190359\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666662657\u0022 data-ipsquote-userid=\u0022184845\u0022 data-ipsquote-username=\u0022MechBFP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, MechBFP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe smart interstage fairings also likely eliminates a few parts as well.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWait, are these just fairings or do they have fuel in them?\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-10-25T02:22:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190361\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666663349\u0022 data-ipsquote-userid=\u0022213541\u0022 data-ipsquote-username=\u0022t_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, t_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWait, are these just fairings or do they have fuel in them?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBy smart interstage I assume no, KSP 2  probably have tapering fuel tanks but smart interstage sound a lot of how we use fairings as interstage now, combined with how engine plates works. \u003Cbr\u003E\nSo no need for linking upper and lower stage by an central engine or part. \n\u003C/p\u003E\n"},{"CreatedByName":"Strawberry","CreatedById":222150,"CreatedDateTime":"2022-10-25T02:36:35Z","Content":"\n\u003Cp\u003E\nI think the early access will contain a lot of the newer engines? Maybe not the late game stuff like torchships, however stuff like plasma engines and non saltwater nuclear engines seem like fair game for day one. These will definitely up the part count, but considering that I think they will simplify the structural units a lot as well (I remember hearing that procedural truss\u0027s were a thing), it will probably be less. \n\u003C/p\u003E\n"},{"CreatedByName":"Superluminal Gremlin","CreatedById":221533,"CreatedDateTime":"2022-10-25T04:10:05Z","Content":"\n\u003Cp\u003E\nIf you follow the link the KSP 2 banner has on the main page of the forums, one of the photos showing a rocket in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E shows 2 new command pods...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso the parachute in that photo on the rocket?\n\u003C/p\u003E\n\u003Cp\u003E\nugghhhh ima need restock for that...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, we can see new fuel parts, new engines, radiators and other unknown objects.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(This photo was taken from \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E interface components by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219348-vl3d/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022219348\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219348-vl3d/\u0022 rel=\u0022\u0022\u003E@Vl3d\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022New-VAB-elements.jpg\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/zNGpzPD/New-VAB-elements.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-25T04:45:44Z\u0022 title=\u002210/25/2022 04:45  AM\u0022 data-short=\u00221 yr\u0022\u003EOctober 25, 2022\u003C/time\u003E by Superluminal Gremlin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-10-25T08:51:43Z","Content":"\n\u003Cp\u003E\nIs it just me? Or does Faith of the Heart fit KSP 2\u0027s situation very well?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/TLs4MGTTXRU?feature=oembed\u0022 title=\u0022Russel Watson-  Faith of the Heart(Enterprise Theme)\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2022-10-25T09:33:46Z","Content":"\n\u003Cp\u003E\nI believe that a lot of not-colony-resourcy-interstellary-offworldly tech we\u0027ve seen in the last video is making its way to the game on day 1. Including crazy command pods, engines etc. Full experience without niche specific parts.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-10-25T16:58:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190013\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666600028\u0022 data-ipsquote-userid=\u0022221428\u0022 data-ipsquote-username=\u0022PopinFRESH\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/24/2022 at 4:27 AM, PopinFRESH said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003EAnd as others have said, I\u0027m not \u0022upset\u0022 that it will now be an early access release. I\u0027m significantly disappointed at the poor communication and the very limited scale of what has been said to be coming at the release of EA considering their prior communications. This announcement does not inspire any confidence that we will see a feature complete version of the game anytime in 2023.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo what if they\u0027re incomplete games? 3 of the 4 games I have been playing for the past year are feature incomplete.\u003Cbr\u003E\nRight now, I\u0027ve spent the past year playing Satisfactory, Dyson Sphere Program, KSP, and Factorio for the most part.\n\u003C/p\u003E\n\u003Cp\u003E\nFactorio is so amazingly optimized that it\u0027s coming to the Nintendo Switch despite being originally developed for PC.\u003Cbr\u003E\nAnd when I say \u0022developed for PC\u0022, I guess I don\u0027t mean \u0022gaming PC\u0022, or at least that\u0027s what my experience has been.\u003Cbr\u003E\nI\u0027m shocked at my own experience, but as a joke I installed Factorio on a 10 year old laptop that was originally like $300 (so not a gaming laptop) and this thing is these days basically only good for being a gorified web browser, but despite that I was able to import the save of a huge and complex factory (not the biggest I\u0027ve ever built, but plenty big), and the game STILL ran perfectly fine at 60FPS after turning down some of the more demanding graphics options to account for the fact that I\u0027m working with a GPU that\u0027s integrated into the CPU, and not a dedicated GPU that has its own VRAM.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other 3 of those games are feature incomplete (KSP, Satisfactory, and DSP).\u003Cbr\u003E\nOf those, 2 of them are very open and transparent about the fact that they\u0027re still very much in early access, in fact you can\u0027t play them (without mods) without having a little part of the GUI in the corner of the screen put a label on there saying \u0022Early Access build: blahblahlbah\u0022 or something like that.\n\u003C/p\u003E\n\u003Cp\u003E\nSpoiler: Factorio on the Nintendo Switch is a pretty big deal, in actuality!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIn case someone in here has forgotten what a Nintendo Switch is, it\u0027s Nintendo\u0027s current \u0022game console\u0022, but it\u0027s more a hybrid between a game console and a handheld gaming device.\u003Cbr\u003E\nIt uses a CPU/GPU combination that has MUCH more in common with smartphone/tablet processors than it does with what the PS5 and Xbox X|S are using (which is more or less \u0022current or last-gen\u0022 PC hardware in both CPU and GPU), but that\u0027s what you get when you make a device small enough to fit in a (large) pocket that still has all the things you need to play a game on-the-go.\u003Cbr\u003E\nSo the Nintendo Switch is not that powerful of a game console, that\u0027s a fair thing to say. In fact, you\u0027d be perfectly accurate to say that it\u0027s the least powerful commercially available, widely produced, and well known gaming console that is still being produced right now, and that\u0027s true no matter which version of the Nintendo Switch you are comparing against.\u003Cbr\u003E\nHowever it\u0027s also a fair thing to say that the hardware of the Nintendo Switch is far and away much more capable than that 10 year old \u0022non-gaming\u0022 $300 laptop I mentioned was delivering a good Factorio experience.\u003Cbr\u003E\n\u003Cbr\u003E\nSo, I have high hopes that at least Factorio will run fantastically on both the Steam Deck and the Nintendo Switch (since the Steam Deck is a device that\u0027s more powerful than the Nintendo Switch, and probably also out-computes the PS4 or Xbox 1, at least with respect to the base model of those consoles).\n\u003C/p\u003E\n\u003Cp\u003E\nWho knows, if KSP 2\u0027s graphics options can be turned down enough, it might be possible to eventually cram that onto the Steam Deck, however I think putting it on the Nintendo Switch is indeed a bridge too far.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2022-10-25T18:24:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190632\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666717125\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo what if they\u0027re incomplete games? 3 of the 4 games I have been playing for the past year are feature incomplete.\u003Cbr\u003E\nRight now, I\u0027ve spent the past year playing Satisfactory, Dyson Sphere Program, KSP, and Factorio for the most part.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNone of which have existing prequels, which obviously is the massive difference there. \n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-10-25T18:42:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190326\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666655483\u0022 data-ipsquote-userid=\u0022221533\u0022 data-ipsquote-username=\u0022Superluminal Gremlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Superluminal Gremlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E2. How many more stock parts do you reckon we will have on the very first early access release?\u003C/span\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan\u003E The same? more? less?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMore parts AND less parts, at the same time. Allow me to explain, because that probably sounded like \u0022a lawyer that is trying to have their cake and eat it too by giving a non-answer to a legitimate question\u0022, but I promise that\u0027s not what was intended. It really IS \u0022both\u0022 more parts and (maybe) less parts at the same time.\n\u003C/p\u003E\n\u003Cp\u003E\nHow is this possible? Procedural parts in both the \u0022more parts\u0022 and \u0022less parts\u0022 answers. It depends on how you look at it.\n\u003C/p\u003E\n\u003Cp\u003E\nI know this might not be how it works in ACTUAL KSP 2, but let\u0027s just say for example that it works like in KSP 1, with each part having one config file.\u003Cbr\u003E\nFrom that, you can easily figure out \u0022how many parts are in the game\u0022 by counting the number of config files that are parts that are included with the game.\u003Cbr\u003E\nAnd because procedural parts are adjustable parts but you only need one config file to represent them, you \u003Cem\u003Emight\u003C/em\u003E end up with a game that has enough parts to allow the same amount of creativity in designing your creations, but uses LESS config files (and therefore \u0022less parts\u0022) to do so.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, from another angle each procedural part can be said to contain many parts \u0022inside\u0022 it because it\u0027s adjustable.\u003Cbr\u003E\nThis definition is still entirely valid, but I find it less useful than the first definition because if you can just type in \u0022nearly any number\u0022 into each of the various adjustable parameters for the part, you end up with a functionally infinite (aka \u0022big enough that just saying infinite doesn\u0027t change the answer enough to make a difference\u0022) number of parts even if you have just a single procedural part in the game.\u003Cbr\u003E\nOf course, they\u0027ll probably put limits on just how big of a number you can put in those boxes, and might also put limits on just how small of a change you can make to each value, just so that they don\u0027t have to use 64 bit signed floating point numbers to represent the shape of a procedural part because really the difference between 0.001mm and 0.1mm being the smallest change you can make to a part won\u0027t make or break the design of any large craft, and if you really need a wing that is 100m long you can probably make it out of several 10m long sections without angering the physics engine that much. And within those limits, you can make pretty much any shape or size part you desire or have need of, suited (or not) entirely to the task at hand.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut if you want my opinion on if there are going to be more or less parts in the game, going by the \u00221 part = 1 config file defining a part, even if it\u0027s a procedural part\u0022 definition, well here it is:\u003Cbr\u003E\nShort answer:\u003Cbr\u003E\nI have no idea! \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003Cbr\u003E\nLonger answer:\u003Cbr\u003E\nThere\u0027s a lot of changes coming to KSP 2, some of them add parts, some of them take away parts, but I think that overall we\u0027ll have a \u0022more complete\u0022 list of parts, even if the overall number of different parts is smaller.\n\u003C/p\u003E\n\u003Cp\u003E\nDetails:\u003Cbr\u003E\nI think we\u0027ll lose a lot of parts that we currently have in KSP 1:\u003Cbr\u003E\nWe\u0027ve seen in the latest trailer that we\u0027re probably only going to have a limited number of different wing panel and aerodynamic control surface parts to choose from, but they\u0027ll be procedural (effectively more parts, but less \u0022config files for parts\u0022).\u003Cbr\u003E\nWe also know that we\u0027re getting procedural radiators, but I haven\u0027t seen any data that shows if the KSP 1 non-procedural, sun-tracking (orients to edge-on to the sun), deployable radiators will still be in the game, or if those too will indeed become procedural.\u003Cbr\u003E\nI\u0027m pretty certain that we\u0027ll also be getting procedural fixed solar panels, because well that\u0027s just low-hanging fruit if you already have a framework for making procedural flat parts like wings and radiators, but again we might also be getting solar panel parts that are procedural in more ways, like being able to choose if they can be deployed, retracted, track the sun, or have a cover to shield them from aerodynamic forces while retracted (likely only a few different kinds of solar panels in any case, with procedural options filling out the areas \u0022in-between\u0022 the default options).\u003Cbr\u003E\nWe do also know that we\u0027re going to be getting fuel tanks that are 7.5m or larger, which would be new parts even if they\u0027re procedural in length.\u003Cbr\u003E\nIIRC (but I forget where I saw it), we\u0027re going to be losing some parts that are dedicated to having only a single resource in them, because now we\u0027ll be able to choose the contents of fuel tanks when in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (and maybe after, but that\u0027s something a mod will take care of if it\u0027s not in the vanilla game on day 1 or \u0022eventually\u0022). So the \u0022liquid fuel\u0022 and \u0022Rocket fuel\u0022 fuselages for 1.25m, mk2, and mk3 form factors will be unified into one line of \u0022generic fuel tanks\u0022 that will have options to set what\u0027s actually in them. This might also get rid of many of the monopropellant tanks, tho I\u0027m not sure of that.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I also think we\u0027ll GAIN a lot of parts.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve seen at least a few \u0022new-looking\u0022 crew capsule parts in the various feature videos that have been released for KSP 2, so that\u0027s more new parts.\n\u003C/p\u003E\n\u003Cp\u003E\nI also think that they will be filling at least some of the gaps in KSP 1\u0027s parts offerings.\u003Cbr\u003E\nThose gaps in KSP 1\u0027s parts list include:\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no good \u0022booster\u0022 type engine that fits a 0.625m diameter fuel tank (the Spark is more a \u0022mid-stage\u0022 engine, as it has \u0022okay\u0022 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E at both sea level and vacuum, and middling thrust, I want a BOOSTER engine that\u0027s heavier (maybe 0.375t), has higher thrust (maybe 40-50kN), as well as higher ASL \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E but lower Vacuum \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E. Such an engine might also make a good option when clustered on a 1.25m diameter low-mass booster stage that you\u0027d otherwise have to put a full Swivel engine on.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s only the one length of 0.625m \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E fuel tank (the Oscar-B), there should be a whole range of lengths that preserves the Oscar-B\u0027s excellent ratio of fuel amount to physical size (lengths should range from 1x Oscar-B to 8x or 16x Oscar-B, making the 0.625m diameter finally usable for tiny launch vehicles without turning into a wobbly noodle rocket).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d really like more \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thruster options that use \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E instead of monopropellant, my large upper stages that dock things and then de-orbit themselves really could do with having lower part count instead of having over 12 Vernors just to get full 3-axis control in both translation and rotation.\n\u003C/p\u003E\n\u003Cp\u003E\nI think that the idea of an engine that responds to the main throttle that uses Monopropellant should be expanded on, the Puff is plenty good but I\u0027d love a version I can put on a 0.625m stack, as well as versions that have good ASL \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, as well as lower thrust versions intended for probes (IRL plenty of satellites use \u0022monoprop\u0022 aka Hydrazine for both \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and main propulsion).\n\u003C/p\u003E\n\u003Cp\u003E\nThere is only the one Ion engine, and there is only the one NTR engine (I know that KSP 2 is adding at least one more NTR engine, thankfully).\n\u003C/p\u003E\n\u003Cp\u003E\nThere should be a higher efficiency option for \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters available, likely this means some form of quick-responding Electric propulsion thruster miniaturized into a series of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E parts (both linear ports and many configurations of multi-port blocks).\n\u003C/p\u003E\n\u003Cp\u003E\nBuilding on the 3 points above this one, I think there should be an entry-level electric propulsion option (as in you unlock it BEFORE the xenon ion engine).\u003Cbr\u003E\nThis would be a Resistojet or Arcjet.\u003Cbr\u003E\nInitially, such a thruster would pass Monopropellant thru either a heating element or an electric arc in order to generate a jet of hot gas to be ejected out an exhaust nozzle.\u003Cbr\u003E\nIf it wasn\u0027t already obvious, the laws of physics that dictate how rocket engines means that resistojet thrusters must have a lower vacuum \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E than Arcjet thrusters, because the propellant that is passed thru a Resistojet does not reach as high of a temperature as that passed thru an Arcjet.\u003Cbr\u003E\nOne of the higher efficiency \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thruster options I was thinking of in the point above this one is Resistojet or Arcjet \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E parts, the advantage that these would have over say a small Xenon Ion engine re-purposed as an \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E port or block would be that Arcjets and Resistojets are very versatile when it comes to what propellant they are willing to work with, so with these arcjet/resistojet \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E parts (and the associated engines which respond to the main throttle), you should eventually be able to unlock the ability to use them with other propellants instead of Monopropellant, such as Methane (aka KSP 1\u0027s Liquid Fuel), Hydrogen (good for vessels using NTR engines), Xenon (in a pinch, and this might be the way that the Kerbals discover that Xenon makes a good ion engine fuel), and even Atmospheric gases (assuming the presence of a related intake device more usually used for air-breathing engines, this last option would make it possible to build jet powered \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E craft that don\u0027t have to carry around Monopropellant unless they also visit the vacuum of space).\u003Cbr\u003E\nIdeally (because Arcjets and Resistojets are SO versatile), you\u0027d be able to choose which propellant to use in-flight without needing an Engineer to go EVA and actually change the plumbing, because it should be as simple as having more than one propellant supplied to the appropriate thruster or engine. Now that I\u0027m thinking of it, provided a steady supply of electricity such \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters and engines would also make ideal propulsion for a craft that relies on \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, because there\u0027s gotta be SOMETHING in those rocks that you can refine and push out a rocket nozzle, right?\n\u003C/p\u003E\n\u003Cp\u003E\nSpeaking of \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, you know what a good way to push around an asteroid is? Sorry, this isn\u0027t a DART reference, instead I\u0027m advocating for a Mass Driver part, that would take any mined resource and eject it at great speed in a very specific direction, in order to create thrust. This doesn\u0027t have to create a lot of thrust, or be particularly high specific impulse, but either or both of those things would be very welcome. It would however probably have to take a lot of power. And this would be a great way to do two things. I\u0027ve already mentioned the use of a mass driver for propulsion, but there\u0027s more things you can do with this. You can throw rocks into high suborbital trajectories. If you put tiny rockets on those rocks, you can get them all the way into a stable orbit, for later collection by vessels that service an orbital station. From there, that station can make use of those raw materials, which means you can put the refinery in orbit instead of on the surface.\u003Cbr\u003E\nJust like using a mass driver for propulsion, it would take a lot of power, so it\u0027s probably best suited to use in a Colonization and Resource Gathering context, so maybe it isn\u0027t in KSP 2 on day 1. But I\u0027d love to see it in the game.\n\u003C/p\u003E\n\u003Cp\u003E\nBack to parts that KSP 1 doesn\u0027t have that I think should be in the list of parts that KSP 2 has:\n\u003C/p\u003E\n\u003Cp\u003E\nThere are literally zero \u0022single-part\u0022 solutions for engines that fit a fuel tank diameter of 5m or larger, and we know we\u0027re getting at least 7.5m diameter fuel tanks (and probably larger) so that\u0027s a gap that needs filling.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no \u0022low profile landing engine\u0022 similar to the Poodle but built for a main body diameter of 3.75m (or 5m and above but that stems from the above point).\n\u003C/p\u003E\n\u003Cp\u003E\nThere are no SRBs that have thrust vectoring that are of a diameter smaller than 2.5m (the Kickback should have it at least).\u003Cbr\u003E\nSpeaking of SRBs, there are no SRBs larger than 2.5m, and there are no SRBs that are optimized for use in a vacuum by the presence of a larger exhaust nozzle to improve vacuum \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nNow on to the tiniest of the SRBs that are in KSP 1, the Sepratron.\u003Cbr\u003E\nWe need more options for separating spent stages from our main launch stage:\u003Cbr\u003E\nA nose-cone that incorporates a Sepratron-like \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E (available in many diameters as well as perhaps Mk2 and Mk3 fuselage nose cone form factors).\u003Cbr\u003E\nA Sepratron-like \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E that mounts in-line but fires out the side to help push away the bottom of spent liquid-fueled booster stages (or creative people could use them as the final braking rockets for a lander that has parachutes for landing something on its side but doesn\u0027t quite have enough parachutes to slow down to a safe landing velocity, sort of like how the Soyuz capsule works IRL).\u003Cbr\u003E\nI\u0027d love to see Radial and In-line decouplers that have built in sepratron-type separation SRBs, because that saves even more parts.\n\u003C/p\u003E\n\u003Cp\u003E\nMost of the reason that I barely ever put the separation and ullage thrusters on my KSP launch vehicles is for one reason, and one reason only: I want to minimize the number of parts I use on the launcher, because that means I can use more parts on the payload (or just have a less laggy rocket overall).\u003Cbr\u003E\nIt doesn\u0027t matter how much optimization they do, more parts will always and forever mean more lag and a lower framerate, and vice versa less parts will always and forever mean less lag and a higher framerate, assuming you have the same computer parts for both sides of that test.\n\u003C/p\u003E\n\u003Cp\u003E\nA procedural airbrake would be a nice part to have, I guess it would replace the existing airbrake (or there could be more shapes of airbrake available).\n\u003C/p\u003E\n\u003Cp\u003E\nIt would also be nice to have Grid Fins available as a type of toggleable control surface (as in they would fold out from the craft like on the Falcon 9 and Falcon Heavy, or alternately be able to be fixed in place (and largely ignored by the aerodynamics simulation) as they will be doing on Starship\u0027s SuperHeavy booster stage).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso would be nice to have Starship type control surfaces available, that way we could make craft that do a similar \u0022belly flop and flip\u0022 type EDL sequence.\n\u003C/p\u003E\n\u003Cp\u003E\nOh yeah and if I can ask for the moon and have a chance of getting it, a type of \u0022landing gear\u0022 that I\u0027d love to see is Airbags (complete with the bouncy-castle in a breeze like \u0022bounding over the surface of the planet or moon\u0022 type final part of the EDL sequence, like what happened with Spirit and Opportunity, and Sojourner before that).\n\u003C/p\u003E\n"},{"CreatedByName":"MrFancyPL","CreatedById":94843,"CreatedDateTime":"2022-10-25T19:59:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224189971\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666586294\u0022 data-ipsquote-userid=\u0022179192\u0022 data-ipsquote-username=\u0022Serenity\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/24/2022 at 6:38 AM, Serenity said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEverytime they add a major feature there will have to be a cycle of optimizing it and then breaking it again until the completion of the next feature.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEhh, where I know it form? (I played Escape From Tarkov)\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2022-10-25T20:31:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190395\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666671005\u0022 data-ipsquote-userid=\u0022221533\u0022 data-ipsquote-username=\u0022Superluminal Gremlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Superluminal Gremlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.ibb.co/zNGpzPD/New-VAB-elements.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022New-VAB-elements.jpg\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/zNGpzPD/New-VAB-elements.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n:ugh: that picture really doesn\u0027t bode well for procedural fuel tanks. Having to resort to mods to build a quality R-7-alike gives me a sadness.\n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2022-10-28T13:50:16Z","Content":"\n\u003Cp\u003E\nOne thing that I’m hoping to see is more crewed parts.  I’m one of those guys who likes to give his Kerbals living space on missions beyond Minmus or longer term missions like stations and bases. I like to have at least two seats per Kerbal, and the lack of command modules and Hitchhiker cans in the larger part sizes makes me sad.  The shuttle parts are just too… spaceplane-specific.\n\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2022-10-28T14:10:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224190206\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666638538\u0022 data-ipsquote-userid=\u002270033\u0022 data-ipsquote-username=\u0022TheSaint\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/24/2022 at 2:08 PM, TheSaint said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey probably would have been better off not announcing the sequel at all until release day. At least from a mental health perspective.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThen the speculation of what KSP2 would have in it (and the KSP franchise is dead) would be even worse!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192159\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666965016\u0022 data-ipsquote-userid=\u0022223516\u0022 data-ipsquote-username=\u0022Wheehaw Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, Wheehaw Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne thing that I’m hoping to see is more crewed parts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree - berthing quarters, mess halls, hangar decks, the like. If we are going to have near future propulsion systems (which also border on science fiction on some levels), then I\u0027d like some parts to create near future craft that have more capabilities.\n\u003C/p\u003E\n"},{"CreatedByName":"KSPLuster","CreatedById":221218,"CreatedDateTime":"2022-10-28T14:31:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192159\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666965016\u0022 data-ipsquote-userid=\u0022223516\u0022 data-ipsquote-username=\u0022Wheehaw Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, Wheehaw Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne thing that I’m hoping to see is more crewed parts.  I’m one of those guys who likes to give his Kerbals living space on missions beyond Minmus or longer term missions like stations and bases. I like to have at least two seats per Kerbal, and the lack of command modules and Hitchhiker cans in the larger part sizes makes me sad.  The shuttle parts are just too… spaceplane-specific.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Command-Modules.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/qmb4rmS/Command-Modules.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-10-28T14:39:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192179\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666967517\u0022 data-ipsquote-userid=\u0022221218\u0022 data-ipsquote-username=\u0022KSPLuster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, KSPLuster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.ibb.co/qmb4rmS/Command-Modules.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Command-Modules.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/qmb4rmS/Command-Modules.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, looks like it will be time to learn how to mod parts I guess.  \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SSTO Crasher","CreatedById":215483,"CreatedDateTime":"2022-10-28T14:54:17Z","Content":"\n\u003Cp\u003E\nRemember the hitchhiker module was in utility, so it makes sense that we haven’t seen it\n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2022-10-28T15:08:16Z","Content":"\n\u003Cp\u003E\nThe options for 3.75m command modules look pretty fun, it\u0027ll be good to have those for larger ships. Since we haven\u0027t seen the utility section yet, I\u0027d guess that we\u0027re probably also getting a 3.75m equivalent to the hitchhiker, which I\u0027m very excited to see.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, love the new look of the spaceplane cockpits!\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-10-28T15:26:43Z","Content":"\n\u003Cp\u003E\nNot hype... But a question: I think it was confirmed, but, do we know whether parts can be connected to more than 2 others?  Or are we still doing lots of struts? \n\u003C/p\u003E\n"},{"CreatedByName":"Zozaf Kerman","CreatedById":219910,"CreatedDateTime":"2022-10-28T15:47:12Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022221218\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0022 rel=\u0022\u0022\u003E@KSPLuster\u003C/a\u003E, that photo makes it way easier to see the modules! Could you possibly make one or two for the other categories (engines, wings, etc.)?\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2022-10-28T16:04:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192195\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666970803\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot hype... But a question: I think it was confirmed, but, do we know whether parts can be connected to more than 2 others?  Or are we still doing lots of struts? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo idea. This might be one of those “foundational” things the devs want feedback on during Early Access. \u003Cbr\u003E\nI personally think wobbly rockets make some sense during early game, as the space program is just starting out and perhaps their construction abilities are less than perfect lol but there should be a tech tree upgrade that can be obtained that removes the wobble, as it simply becomes an annoyance once the novelty wanes and you start building large vehicles. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-28T16:09:06Z\u0022 title=\u002210/28/2022 04:09  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 28, 2022\u003C/time\u003E by MechBFP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSPLuster","CreatedById":221218,"CreatedDateTime":"2022-10-28T16:21:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192202\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666972032\u0022 data-ipsquote-userid=\u0022219910\u0022 data-ipsquote-username=\u0022Zozaf Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Zozaf Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022221218\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0022 rel=\u0022\u0022\u003E@KSPLuster\u003C/a\u003E, that photo makes it way easier to see the modules! Could you possibly make one or two for the other categories (engines, wings, etc.)?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219910-zozaf-kerman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022219910\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219910-zozaf-kerman/\u0022 rel=\u0022\u0022\u003E@Zozaf Kerman\u003C/a\u003EUnfortuantly the rest of the images that I have aren\u0027t really enough for the rest of the categories.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot-20221028-171524.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/3RKYnMR/Screenshot-20221028-171524.png\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-28T19:09:08Z\u0022 title=\u002210/28/2022 07:09  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 28, 2022\u003C/time\u003E by KSPLuster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"t_v","CreatedById":213541,"CreatedDateTime":"2022-10-28T16:23:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192179\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666967517\u0022 data-ipsquote-userid=\u0022221218\u0022 data-ipsquote-username=\u0022KSPLuster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSPLuster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.ibb.co/qmb4rmS/Command-Modules.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Command-Modules.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/qmb4rmS/Command-Modules.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOn top of these, we saw two new command modules in the latest feature video. \n\u003C/p\u003E\n"},{"CreatedByName":"Zozaf Kerman","CreatedById":219910,"CreatedDateTime":"2022-10-28T16:37:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192216\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666974065\u0022 data-ipsquote-userid=\u0022221218\u0022 data-ipsquote-username=\u0022KSPLuster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, KSPLuster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192202\u0022 data-ipsquote-contentid=\u0022187338\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666972032\u0022 data-ipsquote-userid=\u0022219910\u0022 data-ipsquote-username=\u0022Zozaf Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n49 minutes ago, Zozaf Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022221218\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221218-kspluster/\u0022 rel=\u0022\u0022\u003E@KSPLuster\u003C/a\u003E, that photo makes it way easier to see the modules! Could you possibly make one or two for the other categories (engines, wings, etc.)?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219910-zozaf-kerman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022219910\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219910-zozaf-kerman/\u0022 rel=\u0022\u0022\u003E@Zozaf Kerman\u003C/a\u003EUNfortuantly the rest of the images that I have aren\u0027t really enough for the rest of the categories.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk, that’s fine.\n\u003C/p\u003E\n"}]}