{"TopicId":187315,"ForumId":148,"TopicTitle":"Kerbal Space Program 2: Master Post","CreatedByName":"sh1pman","CreatedById":147869,"CreatedDateTime":"2019-08-19T23:28:00Z","PageNum":34,"Articles":[{"CreatedByName":"SilverlightPony","CreatedById":79637,"CreatedDateTime":"2019-08-22T03:05:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656340\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566442622\u0022 data-ipsquote-userid=\u0022184102\u0022 data-ipsquote-username=\u0022hello there\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, hello there said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncheck next time\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs optimistic as I am, that statement doesn\u0027t explicitly say they won\u0027t ever charge \u003Cem\u003Ereal\u003C/em\u003E money for anything.  It only says no \u003Cem\u003Ein-game\u003C/em\u003E currency, and no lootboxes; those are not the only types of microtransactions.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, my gut feeling is that their avoidance of saying flat-out \u0022no microtransactions of any kind\u0022 is due to an overabundance of caution in not wanting to get legally bitten in the butt if and when they announce paid expansions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDear Star.Theory/Private Division:  Paid expansion packs that add significant amounts of content are NOT microtransactions; you can say \u0022we\u0027ll never have microtransactions in this game\u0022 and still have paid expansions.\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"hello there","CreatedById":184102,"CreatedDateTime":"2019-08-22T03:14:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656344\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566443157\u0022 data-ipsquote-userid=\u002279637\u0022 data-ipsquote-username=\u0022SilverlightPony\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, SilverlightPony said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs optimistic as I am, that statement doesn\u0027t explicitly say they won\u0027t ever charge \u003Cem\u003Ereal\u003C/em\u003E money for anything.  It only says no \u003Cem\u003Ein-game\u003C/em\u003E currency, and no lootboxes; those are not the only types of microtransactions.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, my gut feeling is that their avoidance of saying flat-out \u0022no microtransactions of any kind\u0022 is due to an overabundance of caution in not wanting to get legally bitten in the butt if and when they announce paid expansions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDear Star.Theory/Private Division:  Paid expansion packs that add significant amounts of content are NOT microtransactions; you can say \u0022we\u0027ll never have microtransactions in this game\u0022 and still have paid expansions.\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ngood point i hope that there is \u003Cu\u003Eno \u003C/u\u003Edlc to be honest at least the game will not have dlc a while after it is launched hopefully\n\u003C/p\u003E\n\u003Cp\u003E\nalso when looking at sceen shots of ksp2 i think they are not building up a whole new game at least not for these screenshots\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-22T03:18:57Z\u0022 title=\u002208/22/2019 03:18  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 22, 2019\u003C/time\u003E by hello there\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chel","CreatedById":176173,"CreatedDateTime":"2019-08-22T03:30:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656351\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566443652\u0022 data-ipsquote-userid=\u0022184102\u0022 data-ipsquote-username=\u0022hello there\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, hello there said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ngood point i hope that there is \u003Cu\u003Eno \u003C/u\u003Edlc to be honest\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJudging by what happened with this game over the last year, I\u0027d say that your hopes of no DLC will be one in a million, unfortunately. I\u0027m okay with DLC if it adds some minor changes and features, not when it locks off many fan requested features (extra launch sites and stock propellors, from MH and BG respectively)\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-08-22T03:33:35Z","Content":"\n\u003Cp\u003E\nHere is an official quote from KSP twitter. It is getting tiring to keep hearing if there will be micro-transactions\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002250.00\u0022 width=\u00221024\u0022 alt=\u0022ECf7xKnXYAEC-jv.jpg\u0022 src=\u0022https://pbs.twimg.com/media/ECf7xKnXYAEC-jv.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"hello there","CreatedById":184102,"CreatedDateTime":"2019-08-22T03:34:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656358\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566444630\u0022 data-ipsquote-userid=\u0022176173\u0022 data-ipsquote-username=\u0022The_Cat_In_Space\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, The_Cat_In_Space said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m okay with DLC if it adds some minor changes and features, not when it locks off many fan requested features\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthe kind of dlc i like is when the fans decided,thats why mod support will be SO cool \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-22T03:39:36Z\u0022 title=\u002208/22/2019 03:39  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 22, 2019\u003C/time\u003E by hello there\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chel","CreatedById":176173,"CreatedDateTime":"2019-08-22T03:40:18Z","Content":"\n\u003Cp\u003E\nYeah, I\u0027d be fine with like an EVA suit expansion pack where you get several different styles, maybe create your own, for like 5 or 10 bucks, or different science messages, stuff like that. Expansions could add new parts, but not in the way where if you want to make a certain type of vessel you need the DLC to make it (such as with the stock props from BG)\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2019-08-22T03:52:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656351\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566443652\u0022 data-ipsquote-userid=\u0022184102\u0022 data-ipsquote-username=\u0022hello there\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, hello there said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nalso when looking at sceen shots of ksp2 i think they are not building up a whole new game at least not for these screenshots\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts probably star theory is being careful on what get shown at this point. They don\u0027t want to show their whole hand just yet, they are going to tease us. They likely want to build as much hype as they can before launch. \n\u003C/p\u003E\n\u003Cp\u003E\nSo far they have shown parts and locations that we should recognize from KSP1; and new parts and locations we should look forward to. I\u0027m sure they have a lot more to show us before the release, but I can guaranty that star theory won\u0027t show us everything before the release.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-08-22T04:09:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656319\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566441282\u0022 data-ipsquote-userid=\u0022199608\u0022 data-ipsquote-username=\u0022bx2m2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can point to dozens of single-player only games which are always online, and KSP2 doesn\u0027t even have that argument anymore, allegedly. Games are no longer individual experiences, they are \u0022services\u0022 now.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd I can point to dozens of games that have multiplayer which never need to be online.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPlenty of games with mod support have DRM.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo opinion here. I have nothing against non-intrusive DRM and don\u0027t care if KSP2 has it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI could easily counter saying that the only reason to believe it will stay on steam is hope and optimism. Despite what advertisements for lawyers tell you, past results are a good indicator of the future, its sort of what the scientific method is founded on.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo the past result of KSP1 being on Steam, plus being told multiple times by a source that is both reliable and knowledgeable, should lead you to trust that KSP2 will be on Steam.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEasy. Extra skins, extra parts, extra planets. You know all those upgrades for the buildings in career mode? Easy micro-transaction targets. Want to revert to launch for the 11th time that day? Sorry, you\u0027ve run out of revert tokens, wait 24 hours, or pay the low, low price of 500 kurbles (i couldn\u0027t think of a better pun for a currency then with \u0022ruble\u0022, sue me). Why would they do any of this? Because it would make them money, and people would pay for it. The people who make these kind of decisions don\u0027t care about you, they don\u0027t care about the game, and they certainly don\u0027t care about how you see them, because they know you\u0027re still going to buy it (Not \u0022you\u0022, specifically, I don\u0027t mean this to be a personal attack).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo they put time and effort into making a planetary system and want to sell it for $5. Sounds fair.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to the 11th revert... that\u0027s ridiculous. If you actually fear them doing that for real we can\u0027t have a rational conversation. You may as well fear they\u0027ll charge per pixel lighting up on your monitor.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs I stated, the team appears to be quite respectful of the original, and from the developer story trailer, I have no concerns on their judgement or ability to deliver. But the point you seemed to gloss over is this: They don\u0027t matter in this discussion. They don\u0027t get to make those decisions. They get a mandate from corporate, and they comply, or they get to spend some time polishing their resume, and given the job market in the industry right now, I think the choice is obvious. Until we have direct, explicit confirmation otherwise, and not through some wishy-washy \u0022community manager\u0022 replies on a forum (I get you\u0027re just try doing your job with the information you have), I see no reason to assume anything but the worst.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay then. I guess we can\u0027t have a rational conversation about it. As much as you don\u0027t believe the information you\u0027ve been given, I also don\u0027t believe you\u0027d accept that information from anyone. I\u0027d actually not be surprised that when it comes out on Steam you\u0027re still skeptical that it\u0027s really there.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bx2m2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can appreciate your optimism, but optimism and leeway is how we got into this situation in the first place. There\u0027s a great piece of advice when looking at trailers, ask yourself \u0022what aren\u0027t they showing you?\u0022, because that\u0027s what they don\u0027t want you to see. Then ask yourself, \u0022Why don\u0027t they want me to see this?\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat situation are we in? Our favorite game getting a sequel? What aren\u0027t they showing us? Are we supposed to be skeptical that they\u0027re not showing the CEO of Take Two kicking puppies because that must mean he\u0027s doing it?\n\u003C/p\u003E\n\u003Cp\u003E\nHealthy skepticism is fine. I\u0027m skeptical about the sequel even being necessary, and am willing to just up and not buy it in many cases. I think a lot of others are as well. But assuming not just the worst, but worse than the worst ever has been, isn\u0027t healthy and it\u0027s not skepticism. It\u0027s tinfoil-hat country.\n\u003C/p\u003E\n"},{"CreatedByName":"PunkRockZoologist","CreatedById":58435,"CreatedDateTime":"2019-08-22T04:51:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656129\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566424952\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExactly! Anyone who gets their panties in a bunch over Take Two being on a mission to “destroy the game” seems to think that KSP is the jewel in T2’s portfolio. And while it is for \u003Cb\u003Eus\u003C/b\u003E, it’s not for Take Two.\n\u003C/p\u003E\n\u003Cp\u003E\nWhatever the motivation was for T2 to get into indie games, it’s most certainly not the bottom line, as it’s a rounding error in the books, at best. There are plenty of \u003Ci\u003Estrategic\u003C/i\u003E reasons to have a game like KSP under its umbrella, and none  of those   require, for instance, the hated micro-transactions (and as they negatively affect the game, make it unlikely for  MT to appear):\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthe indie studios can act as a breeding ground for talent. Promoting that great coder to lead engineer? Maybe a bit risky for Counter Strike, but why don’t you lead a team in Private Division first? Less risk for Take Two, and with less pressure on the new lead also a better chance of success.\n\u003C/li\u003E\n\u003Cli\u003E\nthere’s value in having non-violent, yes \u003Ci\u003Eeducational \u003C/i\u003Egames in your portfolio. If public opinion turns against companies that produce mass shooter games (regardless of what the science says about games inducing violence; public opinion doesn’t work like that), then you don’t want to be that company that \u003Ci\u003Eonly\u003C/i\u003E sells violent games\n\u003C/li\u003E\n\u003Cli\u003E\nlong term franchise development. KSP might not be a game for the masses, but the Kerbals most certainly can be. While there’s a certain hostility on this forum towards the LOLZ factor, it’s also a selling point, and you kinda expect them to be clumsy, stumbling, but endearing characters. If there’s a \u003Ci\u003EMinions\u003C/i\u003E movie, why not a Kerbal movie? T2 might see potential in developing a Kerbal culture that will spin off mobile games, Netflix movies, etc.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThose are just a couple of the things I can come up with. For none of these, T2 will require the game to be a commercial blockbuster. Obviously they don’t want to hemorrhage money from it either, but I doubt it’s about maximizing profits. In fact, I suspect T2 \u003Ci\u003Ewants\u003C/i\u003E the game to be a gaming success, much more than a financial success. And that would mean an exciting future,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis (and the bit you quoted) is the most intelligent and well thought out post on this entire forum so far. Thank you for bringing some more reason and level-headedness to this. I get that people are terrified that Take Two will introduce microtransactions or whatever, but as you so brilliantly pointed out, they would have absolutely no reason to. Thank you.\n\u003C/p\u003E\n"},{"CreatedByName":"DigDirt","CreatedById":199651,"CreatedDateTime":"2019-08-22T05:24:52Z","Content":"\n\u003Cp\u003E\nWill there be a Switch version in the future?\n\u003C/p\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2019-08-22T05:50:49Z","Content":"\n\u003Cp\u003E\nWouldn\u0027t it be great if a slightly modified version of the cinematic trailer is used as a (skippable) intro at every boot?\u003Cbr\u003E\nModern games can\u0027t seem to get enough of that, and honestly I\u0027d gladly watch that cinematic at every game start!\n\u003C/p\u003E\n"},{"CreatedByName":"SilverlightPony","CreatedById":79637,"CreatedDateTime":"2019-08-22T05:59:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656437\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566451492\u0022 data-ipsquote-userid=\u0022199651\u0022 data-ipsquote-username=\u0022DigDirt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, DigDirt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWill there be a Switch version in the future?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUnknown at this time, but it\u0027s possible.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-22T05:59:25Z\u0022 title=\u002208/22/2019 05:59  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 22, 2019\u003C/time\u003E by SilverlightPony\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZodaXebaZ","CreatedById":199513,"CreatedDateTime":"2019-08-22T06:26:31Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.pcgamer.com/kerbal-space-program-2-interview/?fbclid=IwAR2tR--4O2qBU4yQSbOgyVvbhBronyuh1DHkWdWy-XTyabY2WxNzBB4oYgE\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.pcgamer.com/kerbal-space-program-2-interview/?fbclid=IwAR2tR--4O2qBU4yQSbOgyVvbhBronyuh1DHkWdWy-XTyabY2WxNzBB4oYgE\u003C/a\u003E\u003Cbr\u003E\nSounds good!\u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"hello there","CreatedById":184102,"CreatedDateTime":"2019-08-22T06:36:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656457\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566453556\u0022 data-ipsquote-userid=\u002279637\u0022 data-ipsquote-username=\u0022SilverlightPony\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, SilverlightPony said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWill there be a Switch version in the future?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nimpossible \n\u003C/p\u003E\n"},{"CreatedByName":"Quoniam Kerman","CreatedById":181893,"CreatedDateTime":"2019-08-22T06:44:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656252\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566435937\u0022 data-ipsquote-userid=\u0022136892\u0022 data-ipsquote-username=\u0022nsgallup\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, nsgallup said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wish they would implement Outer Planets Mod into KSP2\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey said yesterday in the interview that Kerbol system would be the same, ut enhanced with some  new assets in the Kerbolar system, apart from the the new solar systems they add, so we might expect some new bodies spinning their way around Kerbol.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656418\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566449508\u0022 data-ipsquote-userid=\u002258435\u0022 data-ipsquote-username=\u0022PunkRockZoologist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, PunkRockZoologist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis (and the bit you quoted) is the most intelligent and well thought out post on this entire forum so far. Thank you for bringing some more reason and level-headedness to this. I get that people are terrified that Take Two will introduce microtransactions or whatever, but as you so brilliantly pointed out, they would have absolutely no reason to. Thank you.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKSP has already become a cultural phenomenon far beyond the core game itself, I guess due to the New Space race and Elon Musk shenanigans. \u0022How not to land an orbital rocket booster\u0022 video is shown alongside Kerbal videos in Youtube suggestions because it is a very Kerbal style video about rocket science, failure and optimism.\n\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2019-08-22T06:57:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223653021\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566239259\u0022 data-ipsquote-userid=\u0022198420\u0022 data-ipsquote-username=\u0022PulsarPixie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/20/2019 at 3:27 AM, PulsarPixie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EQ: Will it be made available on Mac and/or Linux?\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EA: We have no announcements for these platforms at this time, but we are always looking at ways to bring KSP to as many players as we can!\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooks fantastic, but no Linux support no purchase from me.\u003Cbr\u003E\u003Cbr\u003E\nVery VERY disappointed that consoles are at a higher priority; KSP is not really a game for consoles. Interface is just too complex. Kudos for actually making it work, but far more enjoyable using a PC.  Given these priorities it\u0027s obvious that Epic is just following the money.\n\u003C/p\u003E\n\u003Cp\u003E\nGutted. At least \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E are still maintaining and building on KSP1.  Have bought all the DLC, not particularly because I wanted it, but because they are one of the few companies to support gaming on Linux. On top of that no DRM.  So in my books they deserve my full support.\n\u003C/p\u003E\n"},{"CreatedByName":"4472TJ","CreatedById":191771,"CreatedDateTime":"2019-08-22T07:14:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223655684\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566392658\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim!\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Majorjim! said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would love to see something offical about this. It seems folks are just guessing at this point.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCheck on the first page, there is something official \n\u003C/p\u003E\n"},{"CreatedByName":"greenrolf","CreatedById":191157,"CreatedDateTime":"2019-08-22T09:17:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656478\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566457033\u0022 data-ipsquote-userid=\u0022113840\u0022 data-ipsquote-username=\u0022micha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, micha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooks fantastic, but no Linux support no purchase from me.\u003Cbr\u003E\u003Cbr\u003E\nVery VERY disappointed that consoles are at a higher priority\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI am disappointed that there is no Mac support neither \u003Cimg alt=\u0022:unsure:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_unsure.png\u0022 title=\u0022:unsure:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2019-08-22T09:21:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656545\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566465426\u0022 data-ipsquote-userid=\u0022191157\u0022 data-ipsquote-username=\u0022greenrolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, greenrolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am disappointed that there is no Mac support neither \u003Cimg alt=\u0022:unsure:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_unsure.png\u0022 title=\u0022:unsure:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGiven it\u0027s Unity-based it should be fairly trivial to make it multi-platform.  Which is a benefit beyond slightly expanding your customer base since cross-platform development generally exposes far more issues and results in a much better code base.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-08-22T09:41:32Z","Content":"\n\u003Cp\u003E\nNobody\u0027s talking about the really big story, here.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP2 the sun will officially be named Kerbol.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s enough for me to want to not buy it right there.\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-08-22T11:05:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656549\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566465686\u0022 data-ipsquote-userid=\u0022113840\u0022 data-ipsquote-username=\u0022micha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, micha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGiven it\u0027s Unity-based it should be fairly trivial to make it multi-platform.  Which is a benefit beyond slightly expanding your customer base since cross-platform development generally exposes far more issues and results in a much better code base.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think it\u0027s exactly trivial, but it shouldn\u0027t be a big deal. More important is IMHO your second point: building it multi-platform from the start discourages \u0022quick hacks\u0022 that only work on Windooze and are a pain to fix afterwards. I honestly don\u0027t understand why so few games build for multi platform from the start.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-22T11:15:21Z\u0022 title=\u002208/22/2019 11:15  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 22, 2019\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003Cbr\u003EChanged wording to improve clarity.\n\u003C/span\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2019-08-22T11:15:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656478\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566457033\u0022 data-ipsquote-userid=\u0022113840\u0022 data-ipsquote-username=\u0022micha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, micha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooks fantastic, but no Linux support no purchase from me.\u003Cbr\u003E\u003Cbr\u003E\nVery VERY disappointed that consoles are at a higher priority.....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s cost and market share.  It costs money to develop and support a game on each platform, money that could be spent on other aspects of the game.  There are far more people playing on consoles than there are on Linux so you\u0027re going to get more sales and more people enjoying KSP if you focus on Xbox and Playstation over Linux.\u003Cbr\u003E\nThey don\u0027t have infinite budget or time so it has to be spent where it\u0027s going to make the most difference and that\u0027s unlikely to be Linux.\u003Cbr\u003E\u003Cbr\u003E\nAccording to steam over 96% of users are an a flavour of windows.  With those numbers it\u0027s very hard to convince someone to spend money on supporting OSx and Linux when they make up such a small percentage of the player base.\u003Cbr\u003E\u003Ca href=\u0022https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-22T11:15:42Z\u0022 title=\u002208/22/2019 11:15  AM\u0022 data-short=\u00224 yr\u0022\u003EAugust 22, 2019\u003C/time\u003E by Paul Kingtiger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-08-22T11:17:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656600\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566472509\u0022 data-ipsquote-userid=\u002257455\u0022 data-ipsquote-username=\u0022Paul Kingtiger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Paul Kingtiger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAccording to steam over 96% of users are an a flavour of windows.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI guess that\u0027s for the general player base. And what\u0027s the number for KSP players?\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-08-22T11:17:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656358\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566444630\u0022 data-ipsquote-userid=\u0022176173\u0022 data-ipsquote-username=\u0022The_Cat_In_Space\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, The_Cat_In_Space said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n ...not when it locks off many fan requested features (extra launch sites and stock propellors, from MH and BG respectively)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGiven the little gameplay footage in the IGN video, extra launch sites are in the base game.\n\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2019-08-22T11:22:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223656604\u0022 data-ipsquote-contentid=\u0022187315\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566472640\u0022 data-ipsquote-userid=\u0022197939\u0022 data-ipsquote-username=\u0022AHHans\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, AHHans said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI guess that\u0027s for the general player base. And what\u0027s the number for KSP players?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know.  I would assume that the percentages are roughly the same.\u003Cbr\u003E\nSquad and TakeTwo have that data though.  If they\u0027ve decided to focus on windows and consoles it\u0027s because they believe that\u0027s where the majority of the player base is.\n\u003C/p\u003E\n"}]}