{"TopicId":187677,"ForumId":36,"TopicTitle":"RealFuels Configs for 10x rescales","CreatedByName":"Citizen247","CreatedById":136793,"CreatedDateTime":"2019-08-25T21:26:17Z","PageNum":1,"Articles":[{"CreatedByName":"Citizen247","CreatedById":136793,"CreatedDateTime":"2019-08-25T21:26:17Z","Content":"\n\u003Cp\u003E\nI play almost axclusively in a 10x rescale of the stock system. The main problem is that engines, even with realfuels, are drastically underpowered. Most engines fall in the 200kn thrust range, when you really need engines in the 600kn thrust range for instance.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve played with a mismash of custom configs to alter engine performance for quite some time. So I\u0027ve finally decided to produce a mod along the lines of Stock-Realfuels configs, but aimed at making the engines ballanced for 10x rescales.\n\u003C/p\u003E\n\u003Cp\u003E\nFor mods that are obviously designed to produce replicas of real world spacecraft I\u0027ve tried to balance tank, engine and part sizes inorder to produce launch vehicles with similar performance and properties as their realworld counterparts. For instance a bluedog Saturn V or Tantares Proton should have performance similar to the real Saturn V or Proton.\n\u003C/p\u003E\n\u003Cp\u003E\nFor more general engines I\u0027ve tried to balance them so they fill a similar niche as they do in Stock, but for a 10x rescale. I\u0027m also trying to give more options for fuel use, including solid rockets (so we can use HTPB etc instead of \u0022solidfuel\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAt the moment I have full support for:\u003C/strong\u003E\u003Cbr\u003E\nBluedog\u003Cbr\u003E\nTantares\u003Cbr\u003E\nStock Expansion: Making History.\u003Cbr\u003E\nNear Future LV\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EPartial support for:\u003C/strong\u003E\u003Cbr\u003E\nStock\u003Cbr\u003E\nSXT\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EPlanned support for:\u003C/strong\u003E\u003Cbr\u003E\nNear Future Spacecraft\u003Cbr\u003E\nKerbal Atomics\u003Cbr\u003E\nRestock/Plus\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m at the point where testing is needed. I\u0027ve tested that everything works without errors, but not done much in the way of balancing.\u003Cbr\u003E\u003Cbr\u003E\nI resize engines, tanks and sundry parts (decouplers, fins, structural etc) to keep things consistent and allow the building of realistic replicas.\u003Cbr\u003E\u003Cbr\u003E\nBear in mind this is still alpha, so there\u0027s LOTS of gaps where I haven\u0027t configured things yet.\u003Cbr\u003E\u003Cbr\u003E\nAny ideas or suggestions gratefully recieved. Also, if you have a mod you\u0027d like supported let me know.\u003Cbr\u003E\u003Cbr\u003E\nCurrent Alpha:\u003Cbr\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Ca href=\u0022https://github.com/seanyoung247/RF-StockTo10x/releases/tag/v0.01-Aplha1\u0022 rel=\u0022external nofollow\u0022\u003EAlpha 1 - Download\u003C/a\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis uses some code from RealFuels-Stockalike written by: NathanKell, Sarbian, and Raptor831\n\u003C/p\u003E\n\u003Cp\u003E\nLicence: \u003Ca href=\u0022https://creativecommons.org/licenses/by-sa/4.0/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://creativecommons.org/licenses/by-sa/4.0/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-26T12:18:58Z\u0022 title=\u002208/26/2019 12:18  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 26, 2019\u003C/time\u003E by Citizen247\u003C/strong\u003E\n\u003C/span\u003E\n"}]}