{"TopicId":187612,"ForumId":109,"TopicTitle":"KSP2 alternative game mechanics discussion; the science system","CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2019-08-24T15:24:17Z","PageNum":1,"Articles":[{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2019-08-24T15:24:17Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EMandatory disclaimer on imagining new game systems for KSP2\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe game will release in a year\u0027s time. We still haven\u0027t heard of it before last week, so it is probably safe to say that none of our suggestions will be heeded for the final game. At least, not in a way where we can ask the devs to significantly change direction. That said, there are plenty of reasons to work our collective hivemind into imagining what alternative game systems would look like, to detail them, to find what the problems would be, and how useful the idea\u0027s are when implemented. The goal of this thread is to go into detail about game systems that could have been different in KSP 2. As for the plenty of reasons of why this execrise could be useful; any future development of any ksp game in any capacity could have the benefit of having the players already figured out how the game could/needs to be improved in a detailed way. It becomes easier to implement something if it has a vision,  it becomes easier to implement something that has its kinks worked out, and it becomes easier to implement something that has community support behind it. And maybe, just maybe, good ideas can move the current devs to make changes before the release..... (who knows)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe science system is one many player like to see change, mainly because it doesn\u0027t reflect actual science. How would a hypothetical \u003Cem\u003E\u0022good\u0022 \u003C/em\u003Escience system look like. That is what this thread is for.\n\u003C/p\u003E\n"},{"CreatedByName":"Kaerbanogue","CreatedById":189143,"CreatedDateTime":"2019-08-24T15:53:03Z","Content":"\n\u003Cp\u003E\nAre you mentioning the science mode which was the original career mode? \n\u003C/p\u003E\n\u003Cp\u003E\nThis system was very good to me, the most you risk yourself in hazardous missions, the more you\u0027ll get rewarded. Moreover it was kinda neat to take science measurements like what\u0027s the temperature and whatsoever... \n\u003C/p\u003E\n\u003Cp\u003E\nThe only problem was those science parts looking, it was hard to make them look ok on your crafts\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2019-08-24T15:56:05Z","Content":"\n\u003Cp\u003E\nI\u0027ll admit the science system in KSP isn\u0027t very realistic.  However, without adding a *lot* of busywork to it, I\u0027m not sure what I\u0027d replace it with - it does a pretty good job at what it\u0027s supposed to do.\n\u003C/p\u003E\n"},{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2019-08-24T15:56:10Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223658624\u0022 data-ipsquote-contentid=\u0022187612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566661983\u0022 data-ipsquote-userid=\u0022189143\u0022 data-ipsquote-username=\u0022Kaerbanogue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Kaerbanogue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre you mentioning the science mode which was the original career mode? \n\u003C/p\u003E\n\u003Cp\u003E\nThis system was very good to me, the most you risk yourself in hazardous missions, the more you\u0027ll get rewarded. Moreover it was kinda neat to take science measurements like what\u0027s the temperature and whatsoever... \n\u003C/p\u003E\n\u003Cp\u003E\nThe only problem was those science parts looking, it was hard to make them look ok on your crafts\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes I do. Most people who don\u0027t like the science system don\u0027t like it because it is a point based system. You explore the flagpole about the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to invent the nuclear engine. Real science doesn\u0027t work like that. So what I mean with this thread is how would a differnt science system look like.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-24T15:57:34Z\u0022 title=\u002208/24/2019 03:57  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 24, 2019\u003C/time\u003E by nikokespprfan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2019-08-24T16:02:43Z","Content":"\n\u003Cp\u003E\nThe tiered tech tree system would be more believable if it focused on ROCKET science R\u0026amp;D. That is materials/components, fuels, etc, and trying them in novel environments. \n\u003C/p\u003E\n\u003Cp\u003E\nThe planetary exploration stuff should be connected with the mission system as explicit goals. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2019-08-24T16:06:40Z","Content":"\n\u003Cp\u003E\nWell there’s planetary science, astronomy, astrophysics, and more to do with space science.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I would argue that these should be somewhat separated from the rocket technology, perhaps only related tangentially like new colony tech after studying a new planet.\n\u003C/p\u003E\n\u003Cp\u003E\nI don’t know how to make a system that has compelling gameplay. A realistic system would be time based (perhaps not too dissimilar to the X-\u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E series). Perhaps it needs a certain amount of resource input or something that requires gameplay (perhaps testing?) so that you can’t just timewarp until each tech is done. But it needs to be fun, and that’s the hard part.\n\u003C/p\u003E\n"},{"CreatedByName":"Kaerbanogue","CreatedById":189143,"CreatedDateTime":"2019-08-24T16:48:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223658626\u0022 data-ipsquote-contentid=\u0022187612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221566662170\u0022 data-ipsquote-userid=\u0022136115\u0022 data-ipsquote-username=\u0022nikokespprfan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, nikokespprfan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou explore the flagpole about the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to invent the nuclear engine. Real science doesn\u0027t work like that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNever done that ahah pretty smart tho... \n\u003C/p\u003E\n\u003Cp\u003E\nI think the system has a lot of issues but it were, for me at least, pretty logical: with science you unlock new technologies that you can now buy with money.\n\u003C/p\u003E\n\u003Cp\u003E\nHope the devs will still find how to enhance this, because it used to become very redundant and easy (as you said) to unlock whole tech tree when you become experienced with the game. Wait and see\n\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2019-08-24T21:13:38Z","Content":"\n\u003Cp\u003E\nI think the more realistic version would be, you sell the science. Then spend the money to research new stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the science collection side of things, I would like to see a system where you can not max out the science for a biome. Say for instance there would be a 500m radius around where the science was taken would be marked as used after 1 sample. That should give more purpose to rovers, while avoiding extreme tedium.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-08-24T22:58:09Z","Content":"\n\u003Cp\u003E\nFor the tech part it would be fantastic to have to run designed test missions to unlock specific technologies, something in between a scripted scenario and the part test contracts we have now.\n\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2019-08-24T23:18:02Z","Content":"\n\u003Cp\u003E\nOff the top of my rather sleep deprived head... Doing and using things leads to improvements.. \n\u003C/p\u003E\n\u003Cp\u003E\nUsing the first engine x number of times leads to newer, more efficient and bigger engines, which then after use leads to better one\u0027s. Using the first parachute leads to bigger better parachutes, which leads to... You know... \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo not a flagpole leading to engines, but engines leading to engines. Maybe in the case of eg. Nuclear engines you need ore and material samplings as well. \n\u003C/p\u003E\n"}]}