{"TopicId":188579,"ForumId":44,"TopicTitle":"Fission Fusion Antimatter Ion Drive","CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2019-09-30T18:03:46Z","PageNum":1,"Articles":[{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2019-09-30T18:03:46Z","Content":"\n\u003Cp\u003E\nFission fusion antimatter ion drive\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EThe \u003C/font\u003E\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EF\u003C/font\u003E\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003Euel \u003C/font\u003E\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EP\u003C/font\u003E\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003Eellet\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe conductor of the fuel pellet is superconducting Li\u003Csup\u003E6\u003C/sup\u003EH\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis forms a solenoid, a capacitor and a switch.\n\u003C/p\u003E\n\u003Cp\u003E\nDialectric filler material is decaborane. B\u003Csub\u003E10\u003C/sub\u003E\u003Csup\u003E 10 \u003C/sup\u003EH\u003Csub\u003E14 \u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel pellet is charged a few seconds before firing with as much current as possible. It assumes the shape of LR circuit where R is close to zero.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fuel pellet is discharged from the ship with a gas gun.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrent in the fuel pellet can be terminated in a variety of ways. This is accompanied by a loss of superconductivity and a total chemical explosion.\n\u003C/p\u003E\n\u003Cp\u003E\nVoltages greater than 1 million volts are created between the top and bottom of the fuel pellet by magnetic quench.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VkJZf1S.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002245.72\u0022 height=\u0022468\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/VkJZf1S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EThe Fission System\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003EOne or more fission reactors are used to generate neutron beams and generate electricity using Kr\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E78\u003C/font\u003E\u003C/sup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E as the primary heat exchanging fluid. \u003C/font\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003EThe radiators also serve as gaseous diffusion isotope separators which separate Kr\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E78\u003C/font\u003E\u003C/sup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E from Kr\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E79\u003C/font\u003E\u003C/sup\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003EThe Kr\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E79 \u003C/font\u003E\u003C/sup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003Eis fed to small feeder tanks for the ion engines which may operate either continuously or in relatively frequent pulses. Kr\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E79 \u003C/font\u003E\u003C/sup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003Ehas a half life of 1.46 days. It emits a positron and becomes Br\u003C/font\u003E\u003Csup\u003E\u003Cfont size=\u00223\u0022 style=\u0022font-size:12pt;\u0022\u003E79. \u003C/font\u003E\u003C/sup\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKr-80 and Br-79 impurities arise both in the radiator and the ion drive tanks, they may continue as coolant or propellant or be removed for some other system.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c0v97gg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002245.72\u0022 height=\u0022468\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/c0v97gg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EShip Electric Drives\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStandard ion drives for Kr 79 are arranged in a radially symmetric manner pointed inward at 1 degree. This entails 1/1000 cosine losses of momentum, but greatly increases the power achievable by converging on the fuel pellet.\n\u003C/p\u003E\n\u003Cp\u003E\nElectron guns are paired with the ion drives, also converging near the same point, perhaps leading slightly. These may afford a greater angle of radial convergence. Lasers and electrically powered neutron sources can also be used at even greater angles of radial convergence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont size=\u00224\u0022 style=\u0022font-size:16pt;\u0022\u003EThe Zone of Reactions\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe chance that Kr 79 ion will release a positron at a time and place where that positron can interact with the fuel pellet is far less than 1 in a million, perhaps far less than 1 in a trillion. But it is not unreasonable to think that trillions of ions could be made to nearly converge in a single pulse, with at least a few positrons reaching the fusion fuel pellet. This is one of possible ways to initiate magnetic quench and the destruction of the pellet. It is also possible that a neutron could initiate the quench. Or an internal switch of the pellet could initiate destruction, though this is probably unnecessary.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fusion reaction is only barely contained by the external magnetic field. Therefore it is questionable what fraction of the deuterium in the pellet will undergo fusion. What fraction of other nuclear reactions will occur? And how much useful momentum can be harnessed by the spacecraft?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mLblf2x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002245.72\u0022 height=\u0022468\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/mLblf2x.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the case where zero fusion occurs and zero positrons provide useful momentum we have an engine that is very expensive in terms of cost, but not bad in terms of weight.  Krypton ion engines are good by themselves.  Decaborane and lithium hydride in a magnetic quench will all become monatomic ions even if fusion does not occur.  \n\u003C/p\u003E\n\u003Cp\u003E\nSomewhere between 1% - 10% fusion burnup rate could justify the weight and expense of extra complicated radiators, fission power plants, and highly processed input materials.  \n\u003C/p\u003E\n\u003Cp\u003E\nIt is not necessarily wasteful of natural resources either,  because Li 7  H 1 is a good superconductor with which to make a giant solenoid hull.  And various B 11 compounds are good for shielding and chemical explosives.  \n\u003C/p\u003E\n\u003Cp\u003E\nPulse engines of necessity demand shock absorbers for the crew and payload.  If our hull is a tube and we carry gas, then our payload capsule ought to be a cylinder within a giant piston.  Protection from electromagnetic radiation involves a superconducting Faraday cage around the payload.  Protection from neutrons requires gadolinium film in critical areas, also gas and hull materials help a lot.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2019-09-30T18:18:35Z","Content":"\n\u003Cp\u003E\nThe reason the electron guns converge in the lead of the Kr79 ions, is because this another way to generate a 1 million volt difference between two relatively close points in space.\n\u003C/p\u003E\n\u003Cp\u003E\nThis difference adds to the 1 million volts caused by magnetic quench.  \n\u003C/p\u003E\n\u003Cp\u003E\nTherefore the moment when all the lithium, boron, and deuterium ions break up they are in a 2 million volt gap.  \n\u003C/p\u003E\n"}]}