{"TopicId":189523,"ForumId":16,"TopicTitle":"How cheap can I get a science lander on the Mun?","CreatedByName":"ZDPro","CreatedById":201204,"CreatedDateTime":"2019-11-02T22:45:05Z","PageNum":1,"Articles":[{"CreatedByName":"ZDPro","CreatedById":201204,"CreatedDateTime":"2019-11-02T22:45:05Z","Content":"\n\u003Cp\u003E\nHi guys, I picked this game up on the last Steam 75% sale and it\u0027s really addicting. I\u0027m having a blast. I started a career, and landed on the Mun for the first time yesterday, which was so cool. My first lander had all the science I had unlocked with it, and the full price to get it there was around 43k. This feels so expensive since my Mun orbiter for tourists is only 25k. \n\u003C/p\u003E\n\u003Cp\u003E\nHow cheap can I get a science lander to the Mun to hit the biomes? Any thoughts on my design that I can improve?\u003Cbr\u003E\u003Cbr\u003E\nThanks!\u003Cbr\u003E\u003Cbr\u003E\nHere are some images.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/uv6Ent0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/uv6Ent0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI can get to orbit with boosters, and empty the lower stage tank to get Lower orbit, then burn for Mun intercept. If a poor launch, I might be a couple hundred \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E short. If I land without mistakes, I have 300-400dv of fuel left in lander, but if I have troubles, I can easily burn through that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2019-11-02T22:48:37Z","Content":"\n\u003Cp\u003E\nMoved to Gameplay Questions.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst thing I would do is rebuild your lander so it\u0027s only using one of those engines.  Should save you a good amount of cost and weight.  You can also cut down on the number of landing legs, and, since you\u0027ll be cutting weight, you\u0027ll need to bring less fuel.\n\u003C/p\u003E\n"},{"CreatedByName":"CBase","CreatedById":189476,"CreatedDateTime":"2019-11-03T00:15:27Z","Content":"\n\u003Cp\u003E\nYou can afford it, so why make it cheaper ? If you want to launch it multiple times to get all science: Don\u0027t, instead try to build restartable biome hopper in order to visit multiple biomes with 1 Kerbin launch and transfer. Yes it will be more expansive once, but should be cheaper than x times this one.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want save money in general: Do not stage first stage before orbit and try to return vom \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E towards \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for maximum return.\n\u003C/p\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2019-11-03T01:33:21Z","Content":"\n\u003Cp\u003E\nOne of my earlier landers (stock) for one Kerbal, it does the job \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca href=\u0022https://imgur.com/a/bJ2H99v\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/bJ2H99v\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EBut if you want to go really cost efficient, follow \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/189476-cbase/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022189476\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/189476-cbase/\u0022 rel=\u0022\u0022\u003E@CBase\u003C/a\u003E suggestion:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223699080\u0022 data-ipsquote-contentid=\u0022189523\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221572740127\u0022 data-ipsquote-userid=\u0022189476\u0022 data-ipsquote-username=\u0022CBase\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, CBase said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ntry to build restartable biome hopper in order to visit multiple biomes with 1 Kerbin launch and transfer.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSuch craft will probably need an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E unit plus required utilities (harvester, cooling, power).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-11-03T01:33:41Z\u0022 title=\u002211/03/2019 01:33  AM\u0022 data-short=\u00224 yr\u0022\u003ENovember 3, 2019\u003C/time\u003E by VoidSquid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-11-03T14:25:11Z","Content":"\n\u003Cp\u003E\nThe thing about science missions is that the science parts themselves are very expensive. When you have all the instruments unlocked, a complete package for the Mun (two goo for balance, one materials bay, one of each of the four sensors) already costs 20k funds. The seismometer and gavioli detector in particularly hit the bottomline hard, and you want to make sure to return them. The Breaking Ground surface experiments and support equipment will cost you another 15k\n\u003C/p\u003E\n\u003Cp\u003E\nNext, you probably want at least two Kerbals (a pilot and a scientist), though I usually carry three in order to get them XP in a timely manner. A three-man pod costs 3.8k (or just 3k with Making History). Landing legs cost you another 1k-2k depending on your setup. So you\u0027re already at 40k total, and you don\u0027t even have fuel, decouplers, or engines yet.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what my latest midgame Mun lander looked like. It has all the equipment mentioned above, so 40k invested towards a three-Kerbal lander with all experiments onboard; and then, another 30k is used for all the rest of said lander, and the stages below it. It\u0027s actually quite healthily overprovisioned; the second stage still has fuel when I start the deorbit burn at the Mun, and the lander has more than 2025m/s too, because the four nosecones decouple during Kerbin ascent when they\u0027re no longer needed. Only the materials bay is ditched, the rest of the science experiments are returned to Kerbin. Well, the surface experiments obviously stay up there too... The variant without surface experiments (you only need them once, after all) has even more excess \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, and I\u0027ve done small hops to neighboring biomes with it. Gotta keep the hops really small though, and flown the rest of the mission well, or it\u0027ll run out of fuel on the way back to Kerbin. Hops are more expensive than you think.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are solar panels you can\u0027t see here, there\u0027s an OKTO-2 probe core in case there\u0027s no pilot in need of XP, and batteries and an antenna stashed in the service bay. Four Spark engines on the lander. I\u0027d only need two as far as thrust is concerned, but I like symmetry. The stages below are driven by a Cheetah and a Mastodon respectively.\n\u003C/p\u003E\n\u003Cp\u003E\nI could probably make it a bit cheaper if I really tried, but as said before, the only savings that can be made are in the 30k that makes up the rocket, not in the 40k that make up the science and the pod. So the potential to scrooge is somewhat limited. Probably downsizing the first stage a little would be the approach I\u0027d take. Might save 2-3k.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Wm4AGwx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Wm4AGwx.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Armisael","CreatedById":152425,"CreatedDateTime":"2019-11-03T18:40:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E I\u0027m honestly not sure how to read a post saying \u0027this rocket is just about as tight as it\u0027ll go, but it also has gobs of excess \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E\u0027. If your goal is to deliver kerbals and science gear to Mun\u0027s surface then get the kerbals back, you could easily cut 15k off the cost of that ship - more if you decide to simply always use the probe core.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-11-03T18:55:15Z\u0022 title=\u002211/03/2019 06:55  PM\u0022 data-short=\u00224 yr\u0022\u003ENovember 3, 2019\u003C/time\u003E by Armisael\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-11-03T20:12:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223699483\u0022 data-ipsquote-contentid=\u0022189523\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221572806455\u0022 data-ipsquote-userid=\u0022152425\u0022 data-ipsquote-username=\u0022Armisael\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Armisael said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m honestly not sure how to read a post saying \u0027this rocket is just about as tight as it\u0027ll go, but it also has gobs of excess \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E\u0027\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh, apologies. It was not meant to come across like that. It is indeed not intentionally cost optimized - hence the last part, where I said that thef first stage probably has the most potential or savings, even if they won\u0027t be that large. See, I aimed to give a practical example of how the majority of the spacecraft\u0027s cost is tied up in the science experiments themselves, which defines a bottom floor below which the cost may never fall, no matter how frugal you build. And even if you could shave off money of this, the difference wouldn\u0027t be that large. \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E seemed to have trouble flying consistent profiles by their own admission, so being overprovisioned is something they \u003Cem\u003Eneed\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nHow would you save 15k, though? Best I could do was half that (almost exactly 7500) by replacing the first stage with a Pollux \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E and steerable winglets (at the cost of being very unpleasant to fly), and the four Sparks by a single Terrier (at the cost of making the lander look a bit awkward). The resulting vessel had about 200m/s excess instead of the other one\u0027s ~600m/s, and that\u0027s a number I wouldn\u0027t go below in case something doesn\u0027t go according to plan. Besides, that fuel can be put to use in ensuring a landing close the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for good recovery values.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m curious to how you\u0027d do it. Remember, it must carry three Kerbals (not optional, I am bringing them along to get XP), all six non-atmospheric science instruments, and a full set of Breaking Ground non-atmospheric surface experiments and the power to run them (that\u0027ll be two power stations, since these are low-level Kerbals).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-11-03T20:15:51Z\u0022 title=\u002211/03/2019 08:15  PM\u0022 data-short=\u00224 yr\u0022\u003ENovember 3, 2019\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2019-11-03T21:16:30Z","Content":"\n\u003Cp\u003E\nMaverick supersonic, I\u0027ll be there in thirthy seconds.\n\u003C/p\u003E\n"},{"CreatedByName":"Armisael","CreatedById":152425,"CreatedDateTime":"2019-11-03T21:33:45Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E This still had 577 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E after my Munar ejection burn so there\u0027s still more cutting to do, \u003C/span\u003E\u003Ca href=\u0022https://imgur.com/a/zwhS4Fr\u0022 title=\u0022\u0022 rel=\u0022external nofollow\u0022\u003Ebut here\u0027s a quick first cut at it.\u003C/a\u003E I wasn\u0027t sure if you included the antenna as part of the ground experiments, but assumed not since the numbers lined up without it (and you\u0027d want relays for continual coverage of the site anyways).\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re absolutely right about reusing your science gear many times for actual cost-efficiency, of course.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Fierce Wolf","CreatedById":200019,"CreatedDateTime":"2019-11-04T13:53:44Z","Content":"\n\u003Cp\u003E\nMake it cheaper by reducing the amount of trips you need to do to Mun. If one trip nets you, say, science in 3 biomes, you already reduced your total mission cost.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-11-04T15:06:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223699542\u0022 data-ipsquote-contentid=\u0022189523\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221572816825\u0022 data-ipsquote-userid=\u0022152425\u0022 data-ipsquote-username=\u0022Armisael\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Armisael said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E This still had 577 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E after my Munar ejection burn so there\u0027s still more cutting to do, \u003C/span\u003E\u003Ca href=\u0022https://imgur.com/a/zwhS4Fr\u0022 rel=\u0022external nofollow\u0022 title=\u0022\u0022\u003Ebut here\u0027s a quick first cut at it.\u003C/a\u003E I wasn\u0027t sure if you included the antenna as part of the ground experiments, but assumed not since the numbers lined up without it (and you\u0027d want relays for continual coverage of the site anyways).\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re absolutely right about reusing your science gear many times for actual cost-efficiency, of course.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, on the Mun you don\u0027t need a surface antenna. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E tracking station, even at just level 2, is close enough even to Minmus to let the control station phone home just fine. Or relays work too.\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting approach, but I must ask - is that actually safe to return? Last time I tried to reenter a lander can without a heatshield, it promptly burned up, even on a relatively benign trajectory. Admittedly, that was a few versions ago, before they reworked the Mk2. I\u0027ve always just assumed that it wasn\u0027t meant to be, since even the descriptions state them to be unsuitable for reentry, IIRC.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, which part decouples after landing? The entire structure above the probe core? That would be... counterproductive, IMHO. Because the science is so expensive, the return value is a significant factor in total mission cost. I don\u0027t always get the full ~35k value of my return vehicle, but I probably get at least 25k if I use my excess fuel to control my EDL timing and vector. That would put the total mission cost of my original 70k vehicle at around 45k funds at most, which is likely less than what you\u0027d pay for a 54k vehicle that only returns two lander cans and assorted greebling.\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend paying the (very small) price in weight and cost to put a 1.25m service bay on top of the Mk1 lander can. You have the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to spare, and you can fit the probe and all the expensive sensors in there, safe for reentry and recovery. You can still ditch the surface part carrier and the materials bay, they have very little recovery value.\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2019-11-04T16:51:28Z","Content":"\n\u003Cp\u003E\nIf we\u0027re talking absolute cheapest route, I had good success with this design a while back when trying to get science back from every biome on the Mun:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nChhMb4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nChhMb4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t have a crew capsule, but that\u0027s because I needed to fit it into the T1 \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and launchpad (you\u0027ll notice it has 30 parts and weighs less than 18 tons). For me at the time, this wasn\u0027t a problem since I couldn\u0027t do EVAs or take surface samples, but I have no idea how far you\u0027ve upgraded your space center. If anyone does try and replicate it, note that the design is a bit hard to copy from a screenshot due to high levels of part clipping in the lander.\n\u003C/p\u003E\n"},{"CreatedByName":"Armisael","CreatedById":152425,"CreatedDateTime":"2019-11-04T21:30:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223699860\u0022 data-ipsquote-contentid=\u0022189523\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221572880012\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInteresting approach, but I must ask - is that actually safe to return? Last time I tried to reenter a lander can without a heatshield, it promptly burned up, even on a relatively benign trajectory. Admittedly, that was a few versions ago, before they reworked the Mk2. I\u0027ve always just assumed that it wasn\u0027t meant to be, since even the descriptions state them to be unsuitable for reentry, IIRC.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, which part decouples after landing? The entire structure above the probe core? That would be... counterproductive, IMHO. Because the science is so expensive, the return value is a significant factor in total mission cost. I don\u0027t always get the full ~35k value of my return vehicle, but I probably get at least 25k if I use my excess fuel to control my EDL timing and vector. That would put the total mission cost of my original 70k vehicle at around 45k funds at most, which is likely less than what you\u0027d pay for a 54k vehicle that only returns two lander cans and assorted greebling.\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend paying the (very small) price in weight and cost to put a 1.25m service bay on top of the Mk1 lander can. You have the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to spare, and you can fit the probe and all the expensive sensors in there, safe for reentry and recovery. You can still ditch the surface part carrier and the materials bay, they have very little recovery value.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt’s entirely safe for reentry from Mun. Heating is a joke in stock KSP. Mk1 Lander Can has always been safe for that (I don’t know about the old heavy Mk2 can - I never used it) . That’s why I didn’t use a cargo bay: it doesn’t add anything but weight.\n\u003C/p\u003E\n\u003Cp\u003E\nYou’re right about saving the science experiments. You can keep everything but the science he with negligible changes in performance, which makes up about 18k of the 20k returnable science (can’t bring back the ground experiments).\n\u003C/p\u003E\n"},{"CreatedByName":"ZDPro","CreatedById":201204,"CreatedDateTime":"2019-11-10T01:46:23Z","Content":"\n\u003Cp\u003E\nThank you for the replies, guys. I guess I was thinking too conventionally with the leg struts and not having an idea how to have the science jr survive reentry, so I left it behind. Landing on the engines itself seems interesting.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-11-10T01:48:29Z\u0022 title=\u002211/10/2019 01:48  AM\u0022 data-short=\u00224 yr\u0022\u003ENovember 10, 2019\u003C/time\u003E by ZDPro\u003C/strong\u003E\n\u003C/span\u003E\n"}]}