{"TopicId":190132,"ForumId":20,"TopicTitle":"Scaling up life support mods?","CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2019-12-02T13:18:21Z","PageNum":1,"Articles":[{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2019-12-02T13:18:21Z","Content":"\n\u003Cp\u003E\nWell since I run a few \u0022near future\u0022 systems which are aimed to have \u0022bigger parts\u0022, I\u0027m also wondering: are there any \u0022scaled\u0022 versions of \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E life support mod?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m mainly asking due to a contract I got from the contract plus mod: to create a space hotel, for 50 guests. The problem is: to make sure the supplies stay roughly \u0022alive\u0022 I need a lot of recyclers \u002B argoponics, which need a lot of power (batteries \u002B solar panels). While the solar panel is often solved the rest are not, I need around 400k charge for the location (geostationary orbit), and at least 15 argoponic \u002B recycler modules. And then storing the supplies and other parts will quickly jump me well over the 100 modules.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo are there any \u0022scalable\u0022 systems which are aimed to keep many kerbals in orbit for usi life support?\n\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2019-12-05T15:44:20Z","Content":"\n\u003Cp\u003E\nIf you need a lot of power, you can use nuclear reactors. NF Electrics, KPBS and MKS (or some of its related mods) provide powerful nuclear reactors. You may also want to use Nertea\u0027s Heat Control radiators to cool them down.\n\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2019-12-06T09:16:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223712474\u0022 data-ipsquote-contentid=\u0022190132\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221575292701\u0022 data-ipsquote-userid=\u0022120544\u0022 data-ipsquote-username=\u0022paul23\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/2/2019 at 3:18 PM, paul23 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell since I run a few \u0022near future\u0022 systems which are aimed to have \u0022bigger parts\u0022, I\u0027m also wondering: are there any \u0022scaled\u0022 versions of \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E life support mod?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m mainly asking due to a contract I got from the contract plus mod: to create a space hotel, for 50 guests. The problem is: to make sure the supplies stay roughly \u0022alive\u0022 I need a lot of recyclers \u002B argoponics, which need a lot of power (batteries \u002B solar panels). While the solar panel is often solved the rest are not, I need around 400k charge for the location (geostationary orbit), and at least 15 argoponic \u002B recycler modules. And then storing the supplies and other parts will quickly jump me well over the 100 modules.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo are there any \u0022scalable\u0022 systems which are aimed to keep many kerbals in orbit for usi life support?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1. There is no need for the contract to put the hotel in KSO.\n\u003C/p\u003E\n\u003Cp\u003E\n2. If you are using Nerteas\u0027 mods, you have large habitats available as well as nuclear power generators.\n\u003C/p\u003E\n\u003Cp\u003E\n3. You need to provide the habitation capacity for the guests. There is no need for prolonged USI_LS support for them. When you build the hotel, you will get contracts to ferry tourists, 10 to 20 at a time. The tourists don\u0027t need to stay in the station for long (you will get contracts to bring them down again as soon as you send them up actually).\n\u003C/p\u003E\n\u003Cp\u003E\n4. The mod procedural parts provides scalable life support and energy storage tanks/modules.\n\u003C/p\u003E\n\u003Cp\u003E\n5. You don\u0027t really need 15 recyclers or agroponics plants to service 50 Kerbals, if you crunch the numbers. And the idea is not to make the station completely supply independent in the first place (since that would effectively remove supply missions from the mix and water down the challenge that USI_LS presents for the player). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHope that helps, cheers..C:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-06T09:17:05Z\u0022 title=\u002212/06/2019 09:17  AM\u0022 data-short=\u00224 yr\u0022\u003EDecember 6, 2019\u003C/time\u003E by Dante80\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2019-12-06T13:31:12Z","Content":"\n\u003Cp\u003E\nWell I plan to make such a station around Jool as personal thing, so supply missions are kind of a long term idea, and I think it\u0027s better to have enough miners at the several moons.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhich mod do you think about for large habitation? The stock alike station parts expansion? So far those only give me 4 player \u0022cabins\u0022. (And a very, very efficient 1 player cupola/command pod/science provider).\n\u003C/p\u003E\n\u003Cp\u003E\nI have also a mod that provides realistic \u0022launchpad recovery\u0022 times of 1 month\u002B as it\u0027s surrealistic that you can launch multiple vehicles on the same day. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-06T13:43:38Z\u0022 title=\u002212/06/2019 01:43  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 6, 2019\u003C/time\u003E by paul23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2019-12-07T07:39:31Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/170211-18x-stockalike-station-parts-redux-nov-7th/\u0022 rel=\u0022\u0022\u003ENertea\u0027s Stockalike Station Parts Redux\u003C/a\u003E has 1.25m, 2.5m and 3.75m sized habitats, that can go up to 16 passengers each or so. Some of them come pre-packaged for launch and need engineers on site for orbit assembly. Keep that science coming!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/189732-18x-vens-stock-revamp-resurrected-v1142-model-does-not-exist-16-nov-02019/\u0022 rel=\u0022\u0022\u003EVen\u0027s stock Revamp\u003C/a\u003E also adds a couple of habitation modules, one of which is a can capable of holding 10 Kerbals. If you are using something like Restock and don\u0027t want to play with the whole mod, just choose to install the new parts.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth mods have USI_LS support.\n\u003C/p\u003E\n\u003Cp\u003E\nNow..for supplies. 50 Kerbals consume around 540 supplies per day. You can use personal RT-500 recyclers in the station to bring that down to 216 supplies per day, for a mere 25ec/s. An 18t 3.75m supply tank can support that population for 70 days. Adding 5 PPD-F412M agroponics modules will cost you 21t and another 16.5ec/s, but will get your net consumption down to 38 supplies per day for the station, stretching your supply tank out to 394 days. To get this you will need a total of 6382 fertilizer. Assuming then that you launch your agroponics modules full of fertilizer, you will need to bring a 2.5m fertilizer tank with you (and some change) for an addition of around 5.5t.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, with this architecture, your support infrastructure will weigh around 50t total and need a constant 42ec/s to function.\n\u003C/p\u003E\n\u003Cp\u003E\nTotal part count for it is 57-58 parts. 50x RT-500 Recyclers, 5x PPD-F412M greenhouses, 1x 3.75m supply tank, 1x 2.5m fertilizer tank, 1x 1.25m fertilizer tank (optional).\n\u003C/p\u003E\n\u003Cp\u003E\nFor maintenance, you will have to do one re-supply mission per year or so, carrying 15k supplies and 6,400 fertilizer. Mulch is free.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is possible to exchange ec/s and weight for part count total, by substituting the 50 RT-500s for 10 RT-5000s. This will make your colony \u003Cstrong\u003Ecompletely stable\u003C/strong\u003E, since your net consumption will be 156 s/d and your supply production will be 178 s/d.\n\u003C/p\u003E\n\u003Cp\u003E\nIn that case, your support infrastructure will weigh around 77t total and need a constant 204ec/s to function (much more difficult to do on Jool with a solar grid, but still tame for nuclear generation).\n\u003C/p\u003E\n\u003Cp\u003E\nTotal part count for it is 16 parts. 10x RT-5000 Recyclers, 5x PPD-F412M greenhouses, 1x 3.75m fertilizer tank. That is enough to last you for 925 days or about two Kerbal years.\n\u003C/p\u003E\n\u003Cp\u003E\nFor maintenance, you will have to do one re-supply mission every two years or so after that, carrying 15,000 fertilizer.\n\u003C/p\u003E\n\u003Cp\u003E\nHope that helps, cheers.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-07T07:48:06Z\u0022 title=\u002212/07/2019 07:48  AM\u0022 data-short=\u00224 yr\u0022\u003EDecember 7, 2019\u003C/time\u003E by Dante80\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2019-12-07T15:27:00Z","Content":"\n\u003Cp\u003E\nI guess indeed nuclear fuel is the solution for the energy. With solar power a 42 ec/s at minmus means -to survive the long cold night fof 4405 seconds- to take 180k charge storage. I\u0027ve looked at near future electrics: nut that would still mean many charges.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOrbitting jool even gives more time in the shadow.\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2019-12-07T19:25:17Z","Content":"\n\u003Cp\u003E\nThere is an exploit you can take advantage of for EC storage:\n\u003C/p\u003E\n\u003Cp\u003E\nEC is only consumed when the ship is in the current physics bubble.   If your station is not in the physics bubble at night (not in focus), it won\u0027t run out of EC, as long as next time it is in the physics bubble is during the day.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, if you never visit your station at night, it only needs solar generation to match what it currently needs.\n\u003C/p\u003E\n"}]}