{"TopicId":19035,"ForumId":25,"TopicTitle":"Run Silent, Run Derp: The Glider Challenge","CreatedByName":"Reverie Planetarian","CreatedById":48567,"CreatedDateTime":"2012-09-11T02:27:47Z","PageNum":1,"Articles":[{"CreatedByName":"Reverie Planetarian","CreatedById":48567,"CreatedDateTime":"2012-09-11T02:27:47Z","Content":"\n\u003Cp\u003EGliders.\u003C/p\u003E\u003Cp\u003EThere may be bugs and there may be glitches that make flying them and anything else with wings in Kerbal Space Program easier, but that doesn\u0027t erase the fact that making gliders in KSP is fun. At least, it\u0027s fun for me.\u003C/p\u003E\u003Cp\u003EI\u0027ve made a few designs that started as gliders for practicing proper spaceplane landings that I eventually realized made really good fliers in most respects, and could, thanks to the physics models for flight in KSP, do some pretty preposterous things-like breaking 400 m/s without a single engine or climbing over 10 klicks above the surface of Kerbin.\u003C/p\u003E\u003Cp\u003EThat\u0027s me, though, but I don\u0027t know about my fellow players here on this forum. So, I present something I hope nobody\u0027s done before, the Glider Challenge.\u003C/p\u003E\u003Cp\u003EThe rules are simple: make a spaceplane glider which must be capable of sustained flight without thrusters of some sort, and must take off horizontally. All engine parts must be jettisoned during the takeoff procedures and the craft must be able to do level flight for at least two minutes for it to count.\u003C/p\u003E\u003Cp\u003EYou must, some way or another, get the highest altitude and airspeed that you can before bringing the aircraft to a safe, preferrably non-parachute-assisted landing, all without an engine. Sticking with stock parts is encouraged, but not required: I\u0027ve never downloaded any mods and I\u0027m curious as to what others could do with them. Of course, that said, all parts must be used as-is: no editing their values.\u003C/p\u003E\u003Cp\u003EExtra points for seeing how little you can tack on; I\u0027m aware of how the flight modeling engine makes it really easy to just put wings atop wings and glitch your way into the air.\u003C/p\u003E\u003Cp\u003EBe sure to take photos of your craft in flight, landing, doing whatever-show off what you can do without needing thrust to do it.\u003C/p\u003E\n"},{"CreatedByName":"SasquatchM","CreatedById":11888,"CreatedDateTime":"2012-09-11T03:05:06Z","Content":"\n\u003Cp\u003EI made this the other day while experimenting with gliders. It is capable of glitching as high as you want it, but because of it\u0027s fairly minimalistic build it takes a while to do it. As this video wasn\u0027t really meant for a challenge it doesn\u0027t show maximum altitude or speed. due to the design high speeds, although possible, are pretty dangerous to the Kerbal pilot.\u003C/p\u003E\u003Cp\u003E\u0026lt;iframe width=\u0022853\u0022 height=\u0022480\u0022 src=\u0022http://www.youtube.com/embed/qkf1eRiCRf0\u0022 frameborder=\u00220\u0022 allowfullscreen\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"iplop","CreatedById":41102,"CreatedDateTime":"2012-09-11T03:07:53Z","Content":"\n\u003Cp\u003EHere\u0027s a two of my favorite \u0027gliders\u0027:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/78WRU.jpg\u0022 alt=\u002278WRU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rvHGa.png\u0022 alt=\u0022rvHGa.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E I went to the north pole with this one ;D\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eAbTx.jpg\u0022 alt=\u0022eAbTx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eus2q.png\u0022 alt=\u0022eus2q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eLKQM.png\u0022 alt=\u0022eLKQM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vfKMB.png\u0022 alt=\u0022vfKMB.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth of those are rather old. I haven\u0027t messed with canard powered flight in quite some time.\u003C/p\u003E\u003Cp\u003ETip: \u003C/p\u003E\u003Cp\u003EASAS = autoflap \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit_1:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s one I just made(Finally broke my speed record!):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThe trick to taking off without blowing up is: climb to ~10k m altitude before ramping up the speed too much. \u003C/p\u003E\u003Cp\u003EFrom there, gradually lower your altitude until you\u0027re up to speed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OFbJ9.jpg\u0022 alt=\u0022OFbJ9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jGl9b.jpg\u0022 alt=\u0022jGl9b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sMTva.jpg\u0022 alt=\u0022sMTva.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Pqu3G.jpg\u0022 alt=\u0022Pqu3G.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vOc2y.jpg\u0022 alt=\u0022vOc2y.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/90mAX.jpg\u0022 alt=\u002290mAX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/n4ujG.jpg\u0022 alt=\u0022n4ujG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately I accidentally retracted the landing gear while landing and crashed. :/\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H3QMl.png\u0022 alt=\u0022H3QMl.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EFile if anyone wants it(it\u0027s rather simple): [ATTACH]32788[/ATTACH]\u003C/p\u003E\u003Cp\u003EAnd none of my gliders count since they\u0027re either old screencaps without the correct screenshots or derped landings. ;D\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-12T06:34:45Z\u0022 title=\u002209/12/2012 06:34  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 12, 2012\u003C/time\u003E by iplop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reverie Planetarian","CreatedById":48567,"CreatedDateTime":"2012-09-12T00:58:22Z","Content":"\n\u003Cp\u003EStill though, pics and the like are always welcome.\u003C/p\u003E\u003Cp\u003EMe, I\u0027m still super-traditional: use launch stage, jettison launch stage, glide, no flapping.\u003C/p\u003E\u003Cp\u003E...soaring and going around in circles to gain momentum to fly fast, sure, but no flapping.\u003C/p\u003E\n"}]}