{"TopicId":190457,"ForumId":16,"TopicTitle":"Rocket Flipping mk2","CreatedByName":"Fenceingmadman","CreatedById":201226,"CreatedDateTime":"2019-12-18T17:28:08Z","PageNum":1,"Articles":[{"CreatedByName":"Fenceingmadman","CreatedById":201226,"CreatedDateTime":"2019-12-18T17:28:08Z","Content":"\n\u003Cp\u003E\nHello im relatively new to ksp and have just recently been able to land on the moon but no other planets. I was launching a probe that would flyby duna so i could plan a landing. As i built the rocket and launched it i had several problems but was able to fix most of them. But one still bothers me. Its 1st stage is a 2.5 meter orange tank with a mainsail engine. Then it has 6 boosters they have 2 of the extened out to the sides decouplers. They consist of to fl-800 tanks with a nose cone and vector engines. Once i get to about 5000 meters the rocket begins to flip uncontrollably. But once it get back under 4000 it stops and if i can recover it i can still make it to orbit but not to duna. Why does this only happen at 5000 meters when im going a certain speed. Is this i bugh or is this supposed to happen? Any help appreciated. \n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-12-18T18:29:43Z","Content":"\n\u003Cp\u003E\nThere is nothing special about 5000 m. There is somewhat sudden change when you get to (and then through) the speed of sound, at that speed the drag increases quite a bit.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is quite a range of possibilities why a rocket flips out of control. My guess is the following: I understand that you have 6 Vector engines on that craft, together they are four times as strong as a single mainsail. They also have a large gimbal range, so there is a lot of torque when they are steering. That can easily lead to \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E (or your hand-steering) overcorrecting any deviation, in particular if your rocket is tall and \u0022wobbly\u0022 and your control point is at the top - far away from the engines. If this goes out of hand your rocket will likely flip. You can try reducing the gimbal range of the vector engines to see if that helps.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-18T18:31:20Z\u0022 title=\u002212/18/2019 06:31  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 18, 2019\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-12-18T20:28:38Z","Content":"\n\u003Cp\u003E\nPictures and specs of the rocket always help for giving advice.  With that many Vectors, I suspect your rocket is seriously over powered (unless its huge) and getting too much speed at too low an altitude where the atmosphere is thick \u0026amp; creates lots of drag.   What is your thrust to weight ratio (\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E) at launch?\n\u003C/p\u003E\n"},{"CreatedByName":"Fierce Wolf","CreatedById":200019,"CreatedDateTime":"2019-12-19T12:44:09Z","Content":"\n\u003Cp\u003E\nSurely Vectors are the problem, they have too much gimbal power, and after cutting throttle the rocket will spin. Try\n\u003C/p\u003E\n\u003Cp\u003E\n1) reducing Vector gimbal\n\u003C/p\u003E\n\u003Cp\u003E\n2) not cutting fuel suddenly,  turn them off slowly\n\u003C/p\u003E\n\u003Cp\u003E\n3) having a s***load of torque with reaction wheels and/or monoprop\n\u003C/p\u003E\n"}]}