{"TopicId":190490,"ForumId":16,"TopicTitle":"Docking","CreatedByName":"~SYSTEM~","CreatedById":201873,"CreatedDateTime":"2019-12-19T22:23:19Z","PageNum":1,"Articles":[{"CreatedByName":"~SYSTEM~","CreatedById":201873,"CreatedDateTime":"2019-12-19T22:23:19Z","Content":"\n\u003Cp\u003E\nI’m having a very hard time doing the in game docking tutorial. I just can’t seem to get my craft near the other. I’ve gotten it to 1.5 km before but It flew by. How do I slow down with out changing my orbit or how respective to the derelict craft?  I orbit fine. I match inclination fine. I can even get my Intercept nodes to like within 2-4 Km from the ship. I’m new to \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E so I don’t know how to maneuver when close enough to him, towards him. Very frustrating as I have a rescue kerbal mission in orbit in my career mode and have failed to do it many times. The tutorials I. The game are just as hard as the learning curve itself. I’m on Xbox one too so dealing with that   Any fine tuning help would be fine. Thank you guys so much. I can’t stop playing this game. Best game I’ve ever played. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-19T22:27:14Z\u0022 title=\u002212/19/2019 10:27  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 19, 2019\u003C/time\u003E by ~SYSTEM~\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2019-12-19T22:26:22Z","Content":"\n\u003Cp\u003E\nMoved to Gameplay Questions.\n\u003C/p\u003E\n\u003Cp\u003E\nWelcome to the forum, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201873-~system~/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201873\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201873-~system~/\u0022 rel=\u0022\u0022\u003E@~SYSTEM~\u003C/a\u003E.  I never found much use for the in-game tutorials.  They seem to be really good for telling you how to not do things.\n\u003C/p\u003E\n\u003Cp\u003E\nSomeone should be along shortly to provide more detailed help!  Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"~SYSTEM~","CreatedById":201873,"CreatedDateTime":"2019-12-19T22:28:03Z","Content":"\n\u003Cp\u003E\nThank you\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-19T22:28:15Z\u0022 title=\u002212/19/2019 10:28  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 19, 2019\u003C/time\u003E by ~SYSTEM~\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2019-12-19T23:07:46Z","Content":"\n\u003Cp\u003E\nHi \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201873-~system~/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201873\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201873-~system~/\u0022 rel=\u0022\u0022\u003E@~SYSTEM~\u003C/a\u003E and welcome to KSP!\n\u003C/p\u003E\n\u003Cp\u003E\nDocking is one of those things that doesn\u0027t seem to make any sense until you\u0027ve practiced it many times. The good news is that if you are consistently getting rendezvous in the 1.5 - 4km range then you are already pretty good at one of the trickiest parts.\n\u003C/p\u003E\n\u003Cp\u003E\nIdeally, you want to get those rendezvous approaches down to about 0.2 to 1km for final approach. The best way to do that is to make a maneuver node 1/4 or 1/2 orbit before closest approach and experiment with very fine adjustment of prograde/retrograde and radial in/out maneuver inputs to really narrow those approach markers. Even so, you can dock from as far as 4km, it just takes a little longer.\n\u003C/p\u003E\n\u003Cp\u003E\nTo start, when you are near your closest approach, switch your display on the navball to \u0022Target Mode\u0022 if it hasn\u0027t switched already. This is the window at the top of the navball that normally shows your speed, but you want it to show you your RELATIVE speed and distance to your target. On the PC this can be done by just clicking on the navball window, it may be the same on X-box, I\u0027m not sure.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you are in target mode your prograde \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E, retrograde \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E, and other markers on the navball now show you your relative motion towards or away from your target. The easiest thing to do at this point is to aim your ship retrograde \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E and do a short burn to zero out your velocity. This puts you in station keeping so that your relative motion to your target is zero.\n\u003C/p\u003E\n\u003Cp\u003E\nNext, look for the prograde to target maker, it looks like this \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E. This shows you the direction that you should be going to meet your target. What you want to do is to make small burns to bring your ship\u0027s prograde marker in-line with the target prograde marker. Put this \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E directly on top of this \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E. Now your ship is heading directly towards your target.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are further out, like a few kilometers, then I would try to go about 200 to 300 m/s at first until you close the distance. Then at about 200 or 300 meters from your target reduce your speed to no more than about 10 m/s. You can reduce your speed by either turning the ship around to retrograde \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E and using your main engines at low thrust  - or - use your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E controls to thrust backwards. I\u0027m sorry I don\u0027t know what control setup you have for the assigned keybindings for \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on X-box.\n\u003C/p\u003E\n\u003Cp\u003E\nYou will find that as time passes the target marker and prograde marker will wander away from each other. This is because as you orbit the planet your angle between the ships is gradually changing since their paths actually follow a curve. You can correct for this with practice by adding some up/down/left/right thrust with your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E in small bursts.\n\u003C/p\u003E\n\u003Cp\u003E\nYou will find it most helpful to toggle your camera view to LOCKED mode and rotate the view so that you are looking from directly behind the craft as you make your final docking approach. This way you can easily see what direction your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E controls are sending you. Look at where your prograde \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E marker moves on the navball when you thrust. It\u0027s like a mini-game; practice keeping the \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E on the \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E as you get closer and closer.\n\u003C/p\u003E\n\u003Cp\u003E\nBy about 50 to 100 meters away you should be seriously paying attention to the direction your docking ports are facing. It does you no good to be 1 meter away from a docking port if you are at right angles to it. It can be tricky, but when it\u0027s convenient you should start turning your ship with yaw and pitch controls so that the docking ports are facing each other flat, even if you are not lined up yet.\n\u003C/p\u003E\n\u003Cp\u003E\nYou should also by now select as a target the exact docking port you are aiming for by double-clicking on the target port with your cursor. This means that instead of aiming for the center of the target ship, your controls are aiming you at the targeted port itself. Also, if you haven\u0027t done it yet, chose \u0022Control from here\u0022 on the docking port you are using on your own ship.\n\u003C/p\u003E\n\u003Cp\u003E\nIt will probably help to zero out your relative velocity again at about 20 meters out so that you can face parallel with the face of the target docking port and then use RCD up/down/left/right to translate into line with it. Once you have done that (easy for me to say, I know) then slowly nudge your ship forward with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E at no more than about 1 - 5 km/s. It\u0027s a good idea to disable \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E at the last second before connection so that the reaction wheels don\u0027t hold you at any weird angles which would prevent the magnets from engaging.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a number of good docking \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/50-tutorials/\u0022 rel=\u0022\u0022\u003Etutorials\u003C/a\u003E at the top of this forum. I can especially recommend \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/189763-illustrated-guide-to-docking/\u0022 rel=\u0022\u0022\u003EThis One\u003C/a\u003E by Snark. It was made with PC computers in mind, but the basics translate over (haha) to the X-box version ok.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-19T23:18:01Z\u0022 title=\u002212/19/2019 11:18  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 19, 2019\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2019-12-20T05:11:59Z","Content":"\n\u003Cp\u003E\nHere is an excellent guide for docking:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022125662\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8436106236\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/189763-illustrated-guide-to-docking/\u0026amp;do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"~SYSTEM~","CreatedById":201873,"CreatedDateTime":"2019-12-20T19:11:44Z","Content":"\n\u003Cp\u003E\nThank you so much. It’s driving me bananas. Truly that was so in depth and I’m utilizing what u said at this moment. I’ll let ya know if I’m successful. Really the kerbal community is great. I e always been into science and rocketry as a hobby but this is so close to the real thing I just love it. Thank you for the in depth answer. U helped a fellow kerbalnaught and I will try to do the same on here. I love the game. I’ve learned so much. Thank you again for taking the time.  So appreciative this is exactly what I needed. \n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2019-12-20T20:24:21Z","Content":"\n\u003Cp\u003E\nYou\u0027re very welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease let us know how it\u0027s going. I\u0027d love to hear an update on how your first successful docking went.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"},{"CreatedByName":"~SYSTEM~","CreatedById":201873,"CreatedDateTime":"2019-12-21T02:12:13Z","Content":"\n\u003Cp\u003E\nI’m getting closer but those darn separation nodes kind of seperate when I burn. I gotta mess with the “fine tuning” part more. I find it difficult on the controller. I do use the keyboard as it’s functional with kerbal on Xbox. Thank you guys and I’ll take a picture of my dock as it’ll be awesome. Every time I hit a milestone it feels great. Even the first time I put a satelite into orbit and the game recognized my design as a satelite and ya e me an achievement. I absolutely love this game.  I hope two will be as technical but a little more polished. Anyway I’ll keep ya posted I’m still not quite docking yet.  Yet....  lol thanks guys. I’d also like to see if anyone plays this near my location as I would love to meet up With someone to work with someone on this. First time I’ve dumped a months worth of hours into a game and have barely scratched the surface  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-21T02:14:30Z\u0022 title=\u002212/21/2019 02:14  AM\u0022 data-short=\u00224 yr\u0022\u003EDecember 21, 2019\u003C/time\u003E by ~SYSTEM~\u003C/strong\u003E\n\u003C/span\u003E\n"}]}