{"TopicId":190869,"ForumId":16,"TopicTitle":"Manuever nodes and Orbital Info locked for seemingly no reason?","CreatedByName":"Pacca","CreatedById":194084,"CreatedDateTime":"2020-01-06T05:30:13Z","PageNum":1,"Articles":[{"CreatedByName":"Pacca","CreatedById":194084,"CreatedDateTime":"2020-01-06T05:30:13Z","Content":"\n\u003Cp\u003E\nI imagine a lot of you might be rolling your eyes right now. Believe me, if I was in your shoes, I\u0027d be right there with you. A lot of people seem to get the communications and piloting mechanics of the game mixed up. I\u0027ve been playing the game for a while though, and this doesn\u0027t appear to be the problem unfortunately. It only seems to happen with probes, that have full power, are not hibernating, and have a stable connection to the KSP, usually through a relay network. Here\u0027s \u003Ca href=\u0022https://steamcommunity.com/sharedfiles/filedetails/?id=1961375687\u0022 rel=\u0022external nofollow\u0022\u003Ean example screenshot\u003C/a\u003E for reference.\n\u003C/p\u003E\n\u003Cp\u003E\nOddly enough, it doesn\u0027t act like you\u0027d expect a typical control locked craft to act; I still have full throttle and orientation control, only maneuver nodes and the Maneuver mode display in the lower left corner seem to be affected. I can even transmit science data back to Kerbin! I\u0027ve tried going in and out of contact with Kerbin, by having contact interrupted by a planet/moon, hibernating and waking up the probe core, and closing and redeploying the antenna, nothing changes. It has full power, and in fact should never run out of power given the RTGs and the solar panels, at least while the ion engine is off (which it is).\n\u003C/p\u003E\n\u003Cp\u003E\nAm I just being stupid? Did I miss something? Or is this a bug? I\u0027d really hate to have to deorbit this thing and launch another ion probe all the way to Jool again...\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-01-06T10:03:19Z","Content":"\n\u003Cp\u003E\nTo me the screenshot looks like you don\u0027t have maneuver nodes and orbital information unlocked (yet?). Do you get patched conics displayed in the map view?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-01-06T13:31:02Z","Content":"\n\u003Cp\u003E\nAs AHH asked, have you upgraded the Tracking Station to unlock that feature yet?\n\u003C/p\u003E\n\u003Cp\u003E\nWhich would be odd considering the tech you have available to you.\n\u003C/p\u003E\n"},{"CreatedByName":"Pacca","CreatedById":194084,"CreatedDateTime":"2020-01-06T18:05:35Z","Content":"\n\u003Cp\u003E\nI\u0027m in science mode, everything related to building upgrades should be unlocked. I\u0027ve even used maneuver nodes, not just on other probes and ships, but on this exact same probe just to get out to Jool in the first place! And on the map screen I do get to see my path, both around the current planet/moon and beyond it (I think that\u0027s you mean by patched conics?), encounters, periapsis, even my time to periapsis and encounters on the map screen, despite the fact that those exact same numbers are locked out in the corner!\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Double checked, all buildings in the KSP are level 3 (besides the flag pole :Y), and none of them are destroyed. I was hoping saving and reloading a few times would work, but the issue seems to saved to the file now :\u0026lt; Would sharing that help?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-06T18:11:15Z\u0022 title=\u002201/06/2020 06:11  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 6, 2020\u003C/time\u003E by Pacca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-01-06T18:18:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223725186\u0022 data-ipsquote-contentid=\u0022190869\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221578333935\u0022 data-ipsquote-userid=\u0022194084\u0022 data-ipsquote-username=\u0022Pacca\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Pacca said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m in science mode, everything related to building upgrades should be unlocked.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKind of what I thought. Is the craft designated as debris or an asteroid (in the craft naming dialog)? (I don\u0027t really think so, because IIRC that means that you don\u0027t have control of the craft at all when you get back to a craft that is designated like that.) So my best guess is that there is something wrong with your KSP installation. Either some problem with one or more of the mods that you are using, or your installation of KSP itself is corrupted. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHmmm... does the probe use parts from mods or is it stock? If it is stock, then can you put the savefile somewhere where I could have a look at it?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: O.K. our postings overlapped. Yes, sharing the savefile might help.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-06T18:20:53Z\u0022 title=\u002201/06/2020 06:20  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 6, 2020\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pacca","CreatedById":194084,"CreatedDateTime":"2020-01-06T18:31:30Z","Content":"\n\u003Cp\u003E\nOn further inspection, it seems like every single one of my in flight craft are affected by this! Which would really suck considering how far I am ;w;\n\u003C/p\u003E\n\u003Cp\u003E\nNone of them are labelled as debris or asteroids and most of them have functional connected probe cores (except for a few with no connection, which have limited probe control as expected). And all my craft use stock parts.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter checking my mods though, I did notice I had one mod I that I\u0027m not sure how I got in the first place, \u0022Custom Barn Kit\u0022. Removing that seems to fixed it!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-06T18:31:49Z\u0022 title=\u002201/06/2020 06:31  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 6, 2020\u003C/time\u003E by Pacca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-01-06T18:45:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223725195\u0022 data-ipsquote-contentid=\u0022190869\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221578335490\u0022 data-ipsquote-userid=\u0022194084\u0022 data-ipsquote-username=\u0022Pacca\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Pacca said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAfter checking my mods though, I did notice I had one mod I that I\u0027m not sure how I got in the first place, \u0022Custom Barn Kit\u0022. Removing that seems to fixed it!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nO.K. Good to know that it works now.\n\u003C/p\u003E\n"}]}