{"TopicId":191035,"ForumId":70,"TopicTitle":"Game freezes everytime I enter the SOI of any celestial body","CreatedByName":"HyperDraco","CreatedById":188993,"CreatedDateTime":"2020-01-15T19:21:50Z","PageNum":1,"Articles":[{"CreatedByName":"HyperDraco","CreatedById":188993,"CreatedDateTime":"2020-01-15T19:21:51Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003E\u003Cstrong\u003EHello, once again \u003C/strong\u003E\u003C/em\u003E(this is getting too frequent)\u003Cem\u003E\u003Cstrong\u003E,\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI really cannot figure this one out with my used-up brainpower (College takes its toll, especially with the ungodly amount of snowfall today in Vancouver.)\n\u003C/p\u003E\n\u003Cp\u003E\nMy game has quite splendidly decided to kick the bucket everytime I enter the Sphere of Influence of any Celestial body besides Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd when I say my game has frozen, It freezes the computer too. Windows stops working, the computer becomes unresponsive, starts to sound like a jet engine and worst of all, there are no .log files made, and no matter how long I wait, the game doesn\u0027t respond. \n\u003C/p\u003E\n\u003Cp\u003E\nMy game is version 1.6.1 and is modded, extremely modded including (here we go): Airplane Plus, Grounded, Near Future (Solar, Propulsion, Electronics, Aeronautics and Others), Kerbal Engines, Ferrum Aerospace Research, DPAI, Oh Scrap!, \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, NAS, BDAc, KJR, Feline Utility Rovers, Firespitter, OPT, TAC Life Support, Kerbal Atomics, Dock Rotate, Aviator Arsenal, Hangar Extender, HullCamera VDS, JSI, Kerbal Engineer Redux, Kerbal Changelog, Kerbal Launch Failure, Kerbtrotter Ltd, Modular Flight Integrator, Persistent Rotation, Physics Range Extender, Planetary Base Inc, Reentry Particle Effect, REPO Soft Tech, Restock and Restock Plus, Smokescreen, Space-Y (Expanded and Lifters), Tweakscale, Vessel Mover, Deployable Engines, B9 Procedural Wings, B9 Part Switch, ASET, Persistent Rotation and Chatterer.\n\u003C/p\u003E\n\u003Cp\u003E\nI use Module Manager 4.1.0 and KSPModFileLocalizer.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, that is my mod list, and no, I\u0027m not joking. (some mod dependencies are not listed here, but they are all there, I guarantee.)\n\u003C/p\u003E\n\u003Cp\u003E\nI think this is an issue caused by a mod being incompatible with other mods or just messing up the game for me.\n\u003C/p\u003E\n\u003Cp\u003E\nIt might be one of the Near Future Mods (Nertea, sorry if I misspelled that but, I\u0027m a huge fan of your mods.) but, i\u0027m not so sure. It may also be one of the others.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease help, I built a rover and sent it to Duna, no quicksaves (challenge) and the game promptly crashed after I left Kerbin, there was much raging today.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you, any and all help is greatly appreciated.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-15T19:22:10Z\u0022 title=\u002201/15/2020 07:22  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 15, 2020\u003C/time\u003E by HyperDraco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HyperDraco","CreatedById":188993,"CreatedDateTime":"2020-01-16T12:16:03Z","Content":"\n\u003Cp\u003E\nI finally got it to crash while providing the log file.\n\u003C/p\u003E\n\u003Cp\u003E\nI will upload this shortly.\n\u003C/p\u003E\n"},{"CreatedByName":"monkeaproachingmonke","CreatedById":232929,"CreatedDateTime":"2024-03-09T14:34:01Z","Content":"\n\u003Cp\u003E\nany updates?\n\u003C/p\u003E\n"}]}