{"TopicId":191120,"ForumId":106,"TopicTitle":"Help required","CreatedByName":"JayWhizz","CreatedById":202417,"CreatedDateTime":"2020-01-21T20:16:42Z","PageNum":1,"Articles":[{"CreatedByName":"JayWhizz","CreatedById":202417,"CreatedDateTime":"2020-01-21T20:16:42Z","Content":"\n\u003Cp\u003E\nHi all, does anyone know how to revert to an earlier game version? \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m on PS4\n\u003C/p\u003E\n\u003Cp\u003E\nThis game was awesome... Until I purchased breaking ground. I have since lost all my game saves due to the files getting corrupted by the CONSTANT game crashes and blue screens. Twice in fact, I put the first one down to the age of my saves and how many updates they\u0027ve been through, however, having rebuilt from the ground up, the crashes continue and the kraken has taken that save as well. \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t want to abandon the game, before breaking ground... Or broken game as I like to call it.... The game was looking polished and most of the annoying bugs had been ironed out. \n\u003C/p\u003E\n\u003Cp\u003E\nEssentially I\u0027m looking for a way to uninstall BG and it\u0027s associated updates? \n\u003C/p\u003E\n\u003Cp\u003E\nAny help would be appreciated\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-01-22T08:34:17Z","Content":"\n\u003Cp\u003E\nHi, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/202417-jaywhizz/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022202417\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/202417-jaywhizz/\u0022 rel=\u0022\u0022\u003E@JayWhizz\u003C/a\u003E Welcome to the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sorry, that you have problems with your KSP installation. But loading \u0022old\u0022 savefiles should not (and does not on my Linux installation) cause actual problems. The only intentional issue is that old savefiles don\u0027t have the BG surface features enabled.\n\u003C/p\u003E\n\u003Cp\u003E\nBlue screens on a PS4 sound to me more like a problem with the hardware or due to corrupted files (either from the PS4 \u0022OS\u0022 or from KSP itself). But I believe you are more likely to get real help in the\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/81-technical-support-playstation-4-xbox-one/\u0022 rel=\u0022\u0022\u003E Technical Support (PlayStation 4, XBox One)  \u003C/a\u003Esubforum.\n\u003C/p\u003E\n\u003Cp\u003E\nP.S. Or you could e-mail the tech support.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-22T08:37:56Z\u0022 title=\u002201/22/2020 08:37  AM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 22, 2020\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003C/span\u003E\n"}]}