{"TopicId":19144,"ForumId":16,"TopicTitle":"On joysticks","CreatedByName":"hjalfi","CreatedById":40378,"CreatedDateTime":"2012-09-12T17:08:36Z","PageNum":1,"Articles":[{"CreatedByName":"hjalfi","CreatedById":40378,"CreatedDateTime":"2012-09-12T17:08:36Z","Content":"\n\u003Cp\u003ESo I dug up my old flight stick. Works very nicely, and makes flying aircraft \u003Cem\u003Eso\u003C/em\u003E much easier (like, feasible). I can land aircraft now! It\u0027s a shame that KSP only recognises the X and Y axes, so I don\u0027t get the rudder or throttle, but I can live with that. (I gather this is a Unity bug.)\u003C/p\u003E\u003Cp\u003EUnfortunately when the stick is set to pitch and roll, which is what you want for aircraft flying, it\u0027s now pretty much useless for orbital manoeuvring. For that, I want pitch and yaw. I also want bigger dead zones, because as there\u0027s no self-righting impulse in space, if the stick is offset slightly my spacecraft start to spin. But in flight, I need them to be as small as possible. And while it\u0027s technically possible to fly a plane with rudder and elevators I don\u0027t actually know how.\u003C/p\u003E\u003Cp\u003EAnd then there\u0027s rendezvous, EVA and mÃƒÂ¼nwalking, all of which require \u003Cem\u003Edifferent\u003C/em\u003E joystick maps.\u003C/p\u003E\u003Cp\u003EI know it\u0027s possible to change the joystick mapping by quicksaving, quitting, reloading the game, fiddling with the settings, and then quickloading again; but that\u0027s an incredible PITA. Is there any way to change the joystick map on-the-fly? Ideally I like to have several set up and switch between them --- hey, I have buttons on the flight stick to do that! --- but I\u0027ll live with what I can get.\u003C/p\u003E\n"},{"CreatedByName":"ash73","CreatedById":15228,"CreatedDateTime":"2012-09-12T17:49:14Z","Content":"\n\u003Cp\u003EYes, you can do all that using a virtual joystick with PPJoy and GlovePie - see example \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/10978-Joystick-controls-are-screwy?p=248215#post248215\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. You can just alt-tab to GlovePie and switch scripts to change axis mappings on the fly.\u003C/p\u003E\n"},{"CreatedByName":"Tigrou","CreatedById":48635,"CreatedDateTime":"2012-09-12T19:30:26Z","Content":"\n\u003Cp\u003EOr use a rudder to control the yaw. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"khaine","CreatedById":37446,"CreatedDateTime":"2012-09-16T05:56:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hjalfi\u0022 data-cite=\u0022hjalfi\u0022\u003E\u003Cdiv\u003ESo I dug up my old flight stick. Works very nicely, and makes flying aircraft \u003Cem\u003Eso\u003C/em\u003E much easier (like, feasible). I can land aircraft now! It\u0027s a shame that KSP only recognises the X and Y axes, so I don\u0027t get the rudder or throttle, but I can live with that. (I gather this is a Unity bug.).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E This may be a joystick problem. Is it old tech? Im using a cheap thrustmaster hotas, and it automatically recognized and set pitch, yaw, roll, and throttle appropriately, and all four are operating flawlessly. Its amazing how much more effective it makes flying space planes.\u003C/p\u003E\n"},{"CreatedByName":"Alex6511","CreatedById":35304,"CreatedDateTime":"2012-09-16T06:18:58Z","Content":"\n\u003Cp\u003EI\u0027ve had no problem binding all the axis of my flight stick, and the throttle. Make sure its not a problem with the joystick.\u003C/p\u003E\n"}]}