{"TopicId":191999,"ForumId":70,"TopicTitle":"AGU issues","CreatedByName":"Michel Bartolone","CreatedById":181707,"CreatedDateTime":"2020-02-28T21:14:56Z","PageNum":1,"Articles":[{"CreatedByName":"Michel Bartolone","CreatedById":181707,"CreatedDateTime":"2020-02-28T21:14:56Z","Content":"\n\u003Cp\u003E\nWondering if anyone else has seen the following issues when using the advanced grabbing unit. First some background, I\u0027m running KSP1.8.1 with Breaking Ground in this instance.\n\u003C/p\u003E\n\u003Cp\u003E\nI went to grab an asteroid, and when the grabber made contact, the next decoupler in the staging stack fired. I thought perhaps I\u0027d hit the space bar, so I reverted the flight and did it again, making sure I wasn\u0027t touching _anything_ when the grabber made contact...and again, the next decoupler in the staging stack fired\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, I had some items stored in a service module attached to the command pod, with the AGU at the nose of the same command pod. Once I had grabbed the asteroid, I was no longer able to open the service bay. The button was there, but the doors wouldn\u0027t open. Thinking perhaps I had some other parts in the way, I again reverted the flight (this time to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E) moved the parts that I thought _might_ be in the way, ran the flight again. This time, a couple of hundred meters from the target, I verified the service bay would open. I proceeded to grab the asteroid, (still had the decoupling issue) and again the service bay would not open. I decided to just continue on, to further characterize the issue, so when I was done with the asteroid mission, I released the AGU, backed off from the asteroid, and checked the service bay, and now, the bay would open, so it appears that if you are coupled to an asteroid, you can\u0027t open the service bay. I then tried leaving the service bay doors open, and grabbing the asteroid...and no joy...with the service bay doors open, the agu wouldn\u0027t grab the asteroid. I backed off, closed the doors, and tried grabbing the asteroid again, and low and behold...the grabber worked!\n\u003C/p\u003E\n\u003Cp\u003E\nThird,  when I grabbed the asteroid, I decided to unlock the pivot...and my ship then slowly rotated around the AGU, right _through_ the asteroid! I selected \u0027radial in\u0027 at that point and then locked the pivot...very disconcerting to see your ship slowly wink into an asteroid and wonder if it was going to explode at some point, but it didn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nHas anyone else seen these issues?  Note I decided to put this in the PC modded installs, because I am running quite a few mods...but I think, this ship was only using stock parts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}