{"TopicId":192044,"ForumId":107,"TopicTitle":"Go-ob ED lost connection with control station after collecting all science","CreatedByName":"a2soup","CreatedById":68260,"CreatedDateTime":"2020-03-01T06:01:16Z","PageNum":1,"Articles":[{"CreatedByName":"a2soup","CreatedById":68260,"CreatedDateTime":"2020-03-01T06:01:16Z","Content":"\n\u003Cp\u003E\nSo I deployed a small experiment station on the Mun in my first breaking ground career mode to fulfill a contract. Was working pretty great for a while. I checked in on it after a while, however, and found that it had apparently gotten disconnected from the control station, but only after collecting 100% science. The problem is that only 10% of this science ended up getting transmitted for some reason. What\u0027s up with that?!\n\u003C/p\u003E\n\u003Cp\u003E\nNone of the modules seem to have moved around at all, and it is definitely still in range of the control station, which is still receiving power from the solar panel. Screenshot with context menus is at the link, it won\u0027t let me insert the image for some reason.\n\u003C/p\u003E\n\u003Cp\u003E\nHow can I fix this, and how can I stop it from happening again?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/Nr1joPS\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/Nr1joPS\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: On second look, maybe the connection with the control station isn\u0027t lost, but it\u0027s not receiving power for some reason? I don\u0027t know, man.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-01T06:37:43Z\u0022 title=\u002203/01/2020 06:37  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 1, 2020\u003C/time\u003E by a2soup\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-03-01T08:38:59Z","Content":"\n\u003Cp\u003E\nWell, the Go-ob ED didn\u0027t loose connection as such, but it shut itself down after it thought that it did its job. The deployed science works in the way, that while they are working every now and then (every 10% of science gained?) they try to connect to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and transmit their science. If they cannot transmit at that moment - either because there is no commnet connection (at that moment!) or no power (e.g. because the solar panels are in darkness) - then they keep the data and continue on. If they have a connection at a later try then they transmit all data that has been accumulated up to then. But once they reach 100% researched science they do another try to transmit data and then shut themselves down, even if they couldn\u0027t transmit their data. So if you have a setup with spotty commnet connectivity or are just unlucky then it can happen that whenever the experiments try to transmit their data this fails for some reason or another. And when they reach 100% researched science they give it a final try, fail again, and then stop trying altogether.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only way to \u0022fix\u0022 this that I know of is to go there with a Kerbal - preferably a scientist - pick up the experiment, and place it again. This resets the experiment and it can try from scratch.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, this sucks. Welcome to the club. \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-13T16:51:32Z\u0022 title=\u002205/13/2020 04:51  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 13, 2020\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003Cbr\u003Efixed typo\n\u003C/span\u003E\n"},{"CreatedByName":"a2soup","CreatedById":68260,"CreatedDateTime":"2020-03-01T12:47:54Z","Content":"\n\u003Cp\u003E\nWow, is there a bug report on that? Seems like an unintended behavior, given that spotty power and signal work up until it reaches 100%. At the least there should be a button in the context menu to attempt transmission or something.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, looks like I have some commnet work to do before I reset it to try again. Thanks so much for your help!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-01T12:48:07Z\u0022 title=\u002203/01/2020 12:48  PM\u0022 data-short=\u00224 yr\u0022\u003EMarch 1, 2020\u003C/time\u003E by a2soup\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"a2soup","CreatedById":68260,"CreatedDateTime":"2020-03-03T06:39:50Z","Content":"\n\u003Cp\u003E\nTo anyone who may find this in the future: The fix described above worked great, but it was actually unnecessary to set the experiment back up since it turns out that when a Kerbal picks up an experiment with 100% complete but untransmitted science, they hold that science just like any other science result and can take it back to Kerbin with them. They may even be able to transmit it after putting it in a commnet-connected craft, but I didn\u0027t test that unfortunately.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope this helps someone out there, since I was unable to find any documentation of these mechanics anywhere online.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-03T06:41:04Z\u0022 title=\u002203/03/2020 06:41  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 3, 2020\u003C/time\u003E by a2soup\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2020-06-17T23:14:50Z","Content":"\n\u003Cp\u003E\nI just ran into this bug, since I guess my relay wasn\u0027t in the right position above Eeloo when the Goo tried to transmit. I was able pick up and put away the goobered monitor, then board the minerefinery and transmit the data home, which completed the contract.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would be nice to be able to force transmission though, whenever someone feels inclined to add it to the bugtracker.... Maybe it\u0027s fixed for 1.10?\n\u003C/p\u003E\n"}]}