{"TopicId":192155,"ForumId":36,"TopicTitle":"GitHub merge pull request.. loses commits from PR author?","CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2020-03-05T09:17:12Z","PageNum":1,"Articles":[{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2020-03-05T09:17:12Z","Content":"\n\u003Cp\u003E\nSo I just merged in a pull request from someone into a GitHub repo, and at first it all showed up as expected - the commits from the other author, and the merge commit.  Keeping a nice history in the git repository.\u003Cbr\u003E\u003Cbr\u003E\nBut now the commits from the other author have disappeared and my repo is only showing the final merge commit.  I\u0027m very unhappy about this as it removes the contribution from the other author from the commit log.  It seems that this is standard practise for GitHub as my own pull requests into other repos have similarly lost \u0022my\u0022 commits (I wasn\u0027t sure whether the other authors did something on purpose to do that or not).\u003Cbr\u003E\u003Cbr\u003E\nDoes anyone know if there is any way to force GitHub to keep the individual commits from the other authors in the git history?  I\u0027ve tried searching online but haven\u0027t found anything relevant.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-----\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nhmm, so looking through the web history, the commits are showing up. And using \u0022git log\u0022 they also show up.\n\u003C/p\u003E\n\u003Cp\u003E\nBut they\u0027re not showing up in \u0022Git Extensions\u0022 anymore, and I can\u0027t find a setting to show them again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo looks like it\u0027s an oddity in Git Extensions rather than GitHub... Move along, nothing to see here after all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n----\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT2:\n\u003C/p\u003E\n\u003Cp\u003E\nGit Extensions now has a \u0022Show First Parents\u0022 option in the View menu, with a hot-key combination. Looks like I might have accidentally triggered that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-05T09:32:19Z\u0022 title=\u002203/05/2020 09:32  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 5, 2020\u003C/time\u003E by micha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Benjamin Kerman","CreatedById":172792,"CreatedDateTime":"2020-03-05T15:40:33Z","Content":"\n\u003Cp\u003E\nWhile there is a way to achieve that with git (called \u0027squash merge\u0027, I believe), typically you have to enable that specifically for the merge request, and I think there\u0027s warnings also.\n\u003C/p\u003E\n"}]}