{"TopicId":192561,"ForumId":109,"TopicTitle":"The new player experience, what can be done to get beginners into the game more easily this time?","CreatedByName":"Rejected Spawn","CreatedById":172225,"CreatedDateTime":"2020-03-22T01:06:42Z","PageNum":1,"Articles":[{"CreatedByName":"Rejected Spawn","CreatedById":172225,"CreatedDateTime":"2020-03-22T01:06:42Z","Content":"\n\u003Cp\u003E\nSomething that turned a lot of players off about KSP1 was just how hard it\u0027s always been to overcome the initial learning curve before being able to \u003Cem\u003Ereally\u003C/em\u003E go somewhere and do anything memorable - it\u0027s like making it to Mun is the turning point at which a player sees the light and becomes a long time player while those who fail to get that far in the first few days drop the game forever. Those of us who did overcome may not feel that the hurdle was that bad but I do know some who never managed to climb that mountain far enough to see the view from the top and it\u0027s a real shame. So without further stalling, what can we think of that would help smooth out the giant cliff into a gentler hill this time? We\u0027re told there will be better tutorials but that remains to be seen and may not cover enough \u003Cem\u003Eand\u003C/em\u003E may not appeal to impatient players who just want to get to the fun stuff quickly - humans are not perfect learning machines and not always willing to sit in a virtual school just to \u003Cem\u003Estart\u003C/em\u003E playing a game.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKey bindings: Ensure they are accessible through an options menu while in flight, KSP1 is terribad in this regard as the player must leave the entire playing experience and go back out to the main menu just to see which button did \u0022that one thing\u0022 they needed. Even if the keys can\u0027t be edited while in flight they should at minimum be possible to view.\n\u003C/li\u003E\n\u003Cli\u003E\nPop up tips on a new playthrough: Should be possible to set to multiple levels of \u0022helpfulness\u0022. Pretty sure most of us recall how to use the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E to build a rocket so we don\u0027t need to be told this on each new playthrough - however there may be some more advanced tips not all of us are familiar with even after we get a couple of interplanetary voyages under our belt. Having a helpful kerbal linger in the corner of the screen blurting out a little speech bubble at times when you seem lost (\u0022Having trouble with staging?\u0022 if you leave a parachute and an engine on the same stage in the editor for more than 15 seconds) so you can click it to get more info \u003Cu\u003Eif you choose to\u003C/u\u003E might be one way to go about this, of course you should at any time be able to just say \u0022Nah I got this.\u0022 to make the kerbal go away completely but there should also be an option to reactivate from the menu - maybe together with switches to turn on/off subsets of tips depending on our individual knowledge profiles.\n\u003C/li\u003E\n\u003Cli\u003E\nIn game knowledge base: Having at least a collection of helpful information in game is pretty standard stuff, what many games don\u0027t do however is get the player to the right page quickly. If you open the menu while in flight and click the knowledge base it would be very helpful for it to display shortcuts to everything that might be relevant to what you were doing 2 seconds ago, such as steering a rocket and orbits and docking and stuff. Of course it should always have shortcut #1 be to the complete list of topics.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAny suggestions are welcome, I\u0027ll add yours to the list if it seems like a good idea. (moderators please feel free to edit the list as well if I\u0027m absent, my health is very unpredictable)\n\u003C/p\u003E\n\u003Cp\u003E\nWould like to add that one of the reasons I object to KSP2 having any early access phase is that it has a multitude of pitfalls that are very dangerous for games that are in any way advanced. Most notably it eases the players into new features as they are added and turns them into all-knowing super beings that don\u0027t crave tutorials or further information, then when the average joe buys the game on 1.0 day he sits there completely confounded by how any human could have transcended mortality and climbed the intergalactic learning curve right in front of him. I may have exaggerated marginally for effect but you probably get it.\n\u003C/p\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2020-03-22T02:41:48Z","Content":"\n\u003Cp\u003E\nInclude Scott Manley and Danny2462 videos.\n\u003C/p\u003E\n\u003Cp\u003E\nThe former to learn how to play the game properly, the latter to learn that explosions are a fun part of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2020-03-22T06:19:42Z","Content":"\n\u003Cp\u003E\nHow about a godsdamn farkin\u0027 manual that explains things, and the expectation that players have the ability and inclination to read it?\n\u003C/p\u003E\n\u003Cp\u003E\nOr is that just too much to expect these days?\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2020-03-22T07:42:55Z","Content":"\n\u003Cp\u003E\nA tutorial section that has separate video demonstrations of different maneuvers being performed with simple breakdowns of why the maneuvers are performed as they are. For instance, showing players how an inclination change in orbit is performed, maybe sowing the current and objective orbits, then demonstrating why one would burn normal/anti-normal to achieve that change and where the burn is done.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAll voiced by scott manley, obviously.\n\u003C/p\u003E\n"},{"CreatedByName":"RoninFrog","CreatedById":203049,"CreatedDateTime":"2020-03-22T18:06:47Z","Content":"\n\u003Cp\u003E\nMy first couple launches followed \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Walkthrough_for_Ye_Compleat_Beginner\u0022 rel=\u0022external nofollow\u0022\u003Ethis tutorial\u003C/a\u003E.  My third launch was a 3-kerbal (slightly overpowered) Mun rocket flown with the aid of \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Tutorial:Mun_For_Dummies\u0022 rel=\u0022external nofollow\u0022\u003Ethis other tutorial\u003C/a\u003E.  And it I landed it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003E...and I came back.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E..and I didn\u0027t watch a single Scott Manley video.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThings I don\u0027t advise are: starting by downloading MechJeb, copying the tutorials\u0027 rocket designs exactly (or even worse, downloading them off KerbalX), and not venturing outside Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.  They hinder learning and exploring. \n\u003C/p\u003E\n\u003Cp\u003E\nI would suggest just using the \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Main_Page\u0022 rel=\u0022external nofollow\u0022\u003EKSP wiki\u003C/a\u003E.  Do the tutorials, learn about the NavBall and maneuver nodes, learn the key bindings, learn about delta-V and Isp and \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, and learn about all the planets and moons.  And don\u0027t be afraid to try doing things when you don\u0027t know what will happen (just make sure you have a quicksave).  To get beginners into the game, they need to learn about the game quickly.  Confusion and a lack of knowledge will cause people to walk away from KSP.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-22T18:11:19Z\u0022 title=\u002203/22/2020 06:11  PM\u0022 data-short=\u00224 yr\u0022\u003EMarch 22, 2020\u003C/time\u003E by RoninFrog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klapaucius","CreatedById":181256,"CreatedDateTime":"2020-03-23T09:45:38Z","Content":"\n\u003Cp\u003E\nIt really comes down to accessible tutorials. I love Scott Manley, BUT...when I was learning, most of his beginner videos were very out of date. And the rest of his newer videos were too advanced for me.  I probably would have given up had it not been for this amazing and criminally underrated tutor called Nerdy Spaceman:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/videoseries?list=PLPPY_K3b_uqZL6X6dZBeWjfXWRk9EOCwK\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScott Manley, Matt Lowne, Marcus House, Shadowzone etc are all amazing, but they are all geared to those who already have a good grasp of the base game. There is a real dearth of quality tutorials for beginners.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-23T09:46:11Z\u0022 title=\u002203/23/2020 09:46  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 23, 2020\u003C/time\u003E by Klapaucius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2020-03-23T18:04:56Z","Content":"\n\u003Cp\u003E\nThinking back to when I started playing, the biggest thing I was missing (and in some cases, still need) was inflight, on screen guides. An example of what I\u0027m think of would be the navball guidance that \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E uses for gravity turns. Or for some games, use rings or whatever to show the typical flight path you should be using.\n\u003C/p\u003E\n\u003Cp\u003E\nAn easy flight mode for planes. Basically it auto levels the wings after turning or banking. When turning, the plane automatically banks, and adjusts to hold (as best as possible) the pitch you have.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, make the in flight stuff easy for beginners. \n\u003C/p\u003E\n\u003Cp\u003E\nThe rest, the typical tutorials work. Just make easy to find for the situation the what\u0027s info for. Like building in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, have a permanent button that say something like \u0022for more info\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2020-03-23T23:45:17Z","Content":"\n\u003Cp\u003E\nI want to take a moment to defend MechJeb or a similar system here: I learned much of how to fly in KSP by watching MechJeb try - and sometimes *fail* - to fly my ships.  By seeing what it was attempting to do, I could get a feel for how the flight needed to work - something a description can\u0027t do near as well, and even a video is less-than-perfect at, as it\u0027s not interactive.\n\u003C/p\u003E\n\u003Cp\u003E\nIt also allows you to focus on learning *part* of KSP at a time - let MechJeb work on your transfers while you work on your launches and landings, for instance.  This allows a new player to expand further - and therefore get more into the game - without having to climb the entire learning curve hill all at once.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not necessarily saying it\u0027s the best system to teach players how to fly, but it can be a *good* system, potentially better than tutorials or similar.  Yes it can be used as a crutch, but it can also be used as the on-screen guide who can take over any part of a flight and show you a good way to do it - though often not the *best* way.\n\u003C/p\u003E\n"},{"CreatedByName":"dnbattley","CreatedById":176526,"CreatedDateTime":"2020-03-27T05:26:43Z","Content":"\n\u003Cp\u003E\nWhat could bring inexperienced players into this game? \u0022A commercial flight option\u0022: in a career game let the player build a \u0022cubesat\u0022-type payload, a craft constrained heavily by both weight and dimensions, and then they pay for it to be put into a specific type of orbit, for a price. The pricing mechanism could deliberately be near-parity to building your own at first, but deviate significantly over time to encourage a player not to rely on it. The computer then uses a stock ship for the payload weight, and runs on (an optional) auto pilot to demonstrate putting the payload into space, up to and including inter planetary manoeuvres/docking with existing infrastructure etc., but the player can take/relinquish control at any time.\n\u003C/p\u003E\n"},{"CreatedByName":"dnbattley","CreatedById":176526,"CreatedDateTime":"2020-03-27T05:38:36Z","Content":"\n\u003Cp\u003E\nOh, and for those missions have the auto save use intelligent nomenclature: \u0022pre-flight\u0022, \u0022in orbit\u0022, \u0022on trajectory to the Mun\u0022, \u0022On approach to target object\u0022, \u0022Proximal to target\u0022 etc. to make replaying sections easy (and even recommended, E.g.\u0022would you like to try that last manoeuvre?\u0022)\n\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2020-03-27T06:03:36Z","Content":"\n\u003Cp\u003E\nBring  back proper visual destivtinves between parts, so it\u0027s more clear which engine, and which tank is what\n\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2020-03-27T12:05:39Z","Content":"\n\u003Cp\u003E\nA properly set-up career mode that\u0027s balanced enough to gently guide players through the early game, but to still progressively get more challenging.\n\u003C/p\u003E\n"},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2020-03-28T04:32:02Z","Content":"\n\u003Cp\u003E\nI think the solution for this is a combination of a solid, story driven campaign mode (something like a series of scenarios that cover all common mission profiles) that acts as a disguised tutorial and is heavily featured on the main menu as the \u0022correct\u0022 way to start a new game for beginners, and also a series of more explicit training scenarios (i.e. tutorials) that are easy to find and include text explaining how things work.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth these modes need to be backed up with a MechJeb like system. This is how real rockets are flown, they aren\u0027t flown by hand. I very nearly burned out on KSP\u0027s learning wall before I discovered MechJeb, and it\u0027s what actually made the game fun and enjoyable for me.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-28T04:32:50Z\u0022 title=\u002203/28/2020 04:32  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 28, 2020\u003C/time\u003E by Lord Aurelius\u003C/strong\u003E\n\u003C/span\u003E\n"}]}