{"TopicId":193186,"ForumId":16,"TopicTitle":"Glowing Asteroid Rarity","CreatedByName":"Vezbot","CreatedById":203995,"CreatedDateTime":"2020-04-16T22:22:33Z","PageNum":1,"Articles":[{"CreatedByName":"Vezbot","CreatedById":203995,"CreatedDateTime":"2020-04-16T22:22:33Z","Content":"\n\u003Cp\u003E\nSo how often do glowing asteroids occur when you plan a capture for one? I have a few in orbit around kerbin for the PC version but for PS4 I\u0027m trying to get one in orbit. Is there a certain algorithm for how they generate? \n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-04-16T22:28:42Z","Content":"\n\u003Cp\u003E\nMoved to Gameplay Questions.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-04-17T19:51:38Z","Content":"\n\u003Cp\u003E\nThey are rare. I don\u0027t know if Squad has ever shared the probability or how they are generated. I myself have only ever seen one, and that was actually a different version several years ago. \n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-04-17T20:22:27Z","Content":"\n\u003Cp\u003E\nSomeone around here tested that some time ago and posted a number, but I don\u0027t remember what it was anymore. Something like one in 15, or 20, or 40, or so will be a magic asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do remember is that the asteroid is only really generated when you get it into physics range for the first time, i.e. when you get to within 2.2 km of it during your first encounter. Before that only its class is fixed, the exact mass (with the range for the class), shape, ore concentration, and magic-ness is determined at that encounter. So one way to get a magic one is to quicksave just before you get into physics range (e.g. at 3 km or so), and then quickload and close the distance until you have an asteroid that you like.\n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2020-04-17T20:31:13Z","Content":"\n\u003Cp\u003E\nAsteroids properly come into existence once you get into physics range (2500m by default). So, save the game while still a bit further out, and try until you get lucky.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve done such saveloading once. I didn\u0027t keep track of numbers, and probably didn\u0027t do enough tries for a proper statistic in any event, but from my experience and for what it\u0027s worth, 1 in 20 seems about right.\n\u003C/p\u003E\n"}]}