{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":94,"Articles":[{"CreatedByName":"localSol","CreatedById":61326,"CreatedDateTime":"2013-12-11T09:14:15Z","Content":"\n\u003Cp\u003EI didn\u0027t know about that maneuver, that\u0027s good. But I wonder about some kind of helper mod, that could boost engine efficiency only during atmospheric landings until the landing is over. Maybe Kerbal ISP Difficulty Scaler could do this if it changes engines that are already in-flight? If not I guess it would be possible though a plugin otherwise.\u003C/p\u003E\u003Cp\u003EEdit : DaMichel : I like to see stuff made for FAR! I used interstellar\u0027s nuclear thermal turbojets too, they work fine with FAR as far as I can tell.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T09:46:16Z\u0022 title=\u002212/11/2013 09:46  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by localSol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-12-11T15:04:27Z","Content":"\n\u003Cp\u003ERequest that \u0027aeroshell\u0027 be added to list of fairing-type names to look for, the next time the plugin is updated.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2013-12-11T20:33:57Z","Content":"\n\u003Cp\u003ElocalSol: Yeah. There seem to be some glitches with the atmospheric intakes, but the engines definitely work. I should read up on super sonic aircraft design though, since most of my planes become terribly unstable at high speeds and altitudes whereas they fly just fine in the lower atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-11T22:43:43Z","Content":"\n\u003Cp\u003EHi Ferram, I\u0027ve only been playing KSP since soon after .22 was released and so far love it. I also love the FAR mod. I love the more realistic aerodynamics and the challenge of building a plane that flies realistically. Although I have had my frustrations, pitching too high and flipping etc, etc. \u003C/p\u003E\u003Cp\u003EBut anyway, that\u0027s not why I\u0027m here. I\u0027m sure you may of heard of and seen the TiberDyne Shuttle craft/parts \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/4116-0-22-TiberDyne-Aerospace-R-D-Division-Shuttle-System-3-5-Alpha-All-New-Parts!?highlight=tiberdyne\u0022 rel=\u0022external nofollow\u0022\u003E(TiberDyne Shuttle)\u003C/a\u003E. I don\u0027t know if you are aware that they are unflyable with FAR, essentially, they fly backwards! I had a search through this thread and the forum and could not see any relationship between the two other than a few other complaining about it in the Tiberdyne Thread.\u003C/p\u003E\u003Cp\u003ESo now to the guts of it. Can you help?\u003C/p\u003E\u003Cp\u003EI took it upon my self to look into the part config files that make up the shuttles last night. I used the B9 Aerospace and Squad parts as a reference and tried to match things like drag and lift for similar sized equivalent parts, it is a little more stable but still in the end they just fly backwards. One thing I did add to the wings was angular drag.\u003C/p\u003E\u003Cp\u003EI tried a crazy thing and built one of the shuttles myself keeping an eye on CoM, CoL, etc and slotting in parts from B9 etc to try to see if it was one particular part that was causing the issue. From what I could see was that most of the parts are good until... the cargo fuselage... When the cargo fuselage is mounted onto the back of the cockpit (no wings), the CoL is not vertical, but points forward at a roughly 45 degree angle centered over where Tiberion has the docking port node. Once you add the wings and engine, the CoL comes drastically rearward and rear of the CoM, but still has a slight lean forward.\u003C/p\u003E\u003Cp\u003EI then flipped the Cargo fuselage back to front, whacked the wings on it etc (all tiberdyne parts) and IT FLEW Straight forward! It was controllable, got into orbit and returned (although with the SAS on after reentry it shuddered the control surfaces and the tail plane ripped off... but I still able to land it). \u003C/p\u003E\u003Cp\u003EBack in the SPH, I looked at the CoL with the reversed cargo and no wings and the CoL was now at the rear but pointing down. Weird I thought, so played around with the CoM offset and a few things, but was never able to adjust that. I also noted that the Part was an RCS tank module \u0022welded\u0022 to it at the normally rear position of the cargo.\u003C/p\u003E\u003Cp\u003ESo my Questions;\u003C/p\u003E\u003Cp\u003E1. How much does FAR use the Models to calculate things. I\u0027m not a 3d modeller so unable to see that actual models except in KSP.\u003C/p\u003E\u003Cp\u003E2. What does FAR/KSP use to calculate lift of a non-lifting surface (no lift defined in the part cfg)\u003C/p\u003E\u003Cp\u003E3. What aspects of the part.cfg does FAR use. Which values should I look at changing?\u003C/p\u003E\u003Cp\u003EThe Parts are all in the Tiberdyne Shuttle Mod in the Link at the beginning, as well as some crafts. I will put a post in the Tiberdyne thread as well so that he is aware of this.\u003C/p\u003E\u003Cp\u003EI would really like to get the Tiberdyne Shuttle Mod working with FAR, as I love FAR and the Tiberdyne shuttles are just really good looking just not flyable with FAR. I\u0027d love to keep both.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EAzza\u003C/p\u003E\u003Cp\u003Ep.s. I actually joined the forum to write this... Cheers for your help.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2013-12-12T18:29:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ferram4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m working on a plane, and am having some weird asymmetric control issues. I am adding some standard control surfaces as spoilers, using surface attachment to stick them on the top of of some wings. When I add pair 1, which attach to some wing connectors, everything is fine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://toad.homelinux.net/KSP/Test%20Plane%20I.craft\u0022 rel=\u0022external nofollow\u0022\u003EOne pair of spoilers\u003C/a\u003E, works just fine.\u003C/p\u003E\u003Cp\u003EBut, when I add the second pair, out a bit farther and attached to some delta wings, I get very significant asymmetric control. Pitching induces some roll, and braking induces very significant roll.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://toad.homelinux.net/KSP/Test%20Plane%20II.craft\u0022 rel=\u0022external nofollow\u0022\u003ETwo pairs of spoilers\u003C/a\u003E, rolls like a crazy rolling thing. For example:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gHQtAJNwDGs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E.\u003Cp\u003ERemoving all of the non-airbrake control surfaces from the brakes action group lessens the effect slightly, but it doesn\u0027t go away.\u003C/p\u003E\u003Cp\u003EAny ideas?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T18:51:05Z\u0022 title=\u002212/12/2013 06:51  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by toadicus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2013-12-12T21:28:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022azza276\u0022 data-cite=\u0022azza276\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo my Questions;\u003C/p\u003E\u003Cp\u003E1. How much does FAR use the Models to calculate things. I\u0027m not a 3d modeller so unable to see that actual models except in KSP.\u003C/p\u003E\u003Cp\u003E2. What does FAR/KSP use to calculate lift of a non-lifting surface (no lift defined in the part cfg)\u003C/p\u003E\u003Cp\u003E3. What aspects of the part.cfg does FAR use. Which values should I look at changing?\u003C/p\u003E\u003Cp\u003EThe Parts are all in the Tiberdyne Shuttle Mod in the Link at the beginning, as well as some crafts. I will put a post in the Tiberdyne thread as well so that he is aware of this.\u003C/p\u003E\u003Cp\u003EI would really like to get the Tiberdyne Shuttle Mod working with FAR, as I love FAR and the Tiberdyne shuttles are just really good looking just not flyable with FAR. I\u0027d love to keep both.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EAzza\u003C/p\u003E\u003Cp\u003Ep.s. I actually joined the forum to write this... Cheers for your help.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1.FAR assumes all fuselage are cylindrical and calculate its drag and lift. Any part from any mod can be recognized and nothing needs to be specified.\u003C/p\u003E\u003Cp\u003E2. All wing parts need their span/taper ratio/swept etc. specified in the cfg. B9 and a few other mods have these parameters, apparently tiberdyne does not. If you really want you can try to write it\u003C/p\u003E\u003Cp\u003E3. Seems to me the best way to build a space shuttle with FAR is to use B9 wings/fuselage. Then you need some kind of large-gimble-range engine like \u0022space shuttle engine pack\u0022 and find some proper mod for the SRB and external tank. Shuttle wings have complex geometries that are hard to configure with a single part.\u003C/p\u003E\n"},{"CreatedByName":"Goozeman","CreatedById":68303,"CreatedDateTime":"2013-12-12T21:55:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@ferram4\u003C/strong\u003E\u003Cp\u003EI\u0027m working on a plane, and am having some weird asymmetric control issues. I am adding some standard control surfaces as spoilers, using surface attachment to stick them on the top of of some wings. When I add pair 1, which attach to some wing connectors, everything is fine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://toad.homelinux.net/KSP/Test%20Plane%20I.craft\u0022 rel=\u0022external nofollow\u0022\u003EOne pair of spoilers\u003C/a\u003E, works just fine.\u003C/p\u003E\u003Cp\u003EBut, when I add the second pair, out a bit farther and attached to some delta wings, I get very significant asymmetric control. Pitching induces some roll, and braking induces very significant roll.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://toad.homelinux.net/KSP/Test%20Plane%20II.craft\u0022 rel=\u0022external nofollow\u0022\u003ETwo pairs of spoilers\u003C/a\u003E, rolls like a crazy rolling thing. For example:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gHQtAJNwDGs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E.\u003Cp\u003ERemoving all of the non-airbrake control surfaces from the brakes action group lessens the effect slightly, but it doesn\u0027t go away.\u003C/p\u003E\u003Cp\u003EAny ideas?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepending on how accurate FAR is, it looks like you\u0027re getting a \u0022tip stall\u0022 condition. If you\u0027re going to use spoilers/speed brakes, you want them inboard. If you stall the tip of the wing first, usually one tip will stall first, causing the condition you see. Notice the \u0022minor stalling detected\u0022 indicator.\u003C/p\u003E\u003Cp\u003EIt could be an issue with FAR, but spoilers near the tip is bad aircraft design.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-12T22:24:04Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003ECamlost got a lot of the basics down, but the main problem is that the Tiberdyne Shuttles aren\u0027t set up to work with FAR. Depending on where the part origin for the wings is placed it may not be possible to make them work. FAR\u0027s wing code is designed to function well with wings designed like the stock wing parts; reversible, surface attached, symmetric. Anything outside of those parameters may not be capable of being set up to work.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@toadicus: \u003C/strong\u003EI\u0027ll check out the craft in my dev build; I\u0027ve changed how some of the wing code works, so I may have already fixed the issue. I think removing the non-airbrakes from the action group is just a result of the placebo effect.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2013-12-13T00:35:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Goozeman\u0022 data-cite=\u0022Goozeman\u0022\u003E\u003Cdiv\u003EDepending on how accurate FAR is, it looks like you\u0027re getting a \u0022tip stall\u0022 condition. If you\u0027re going to use spoilers/speed brakes, you want them inboard. If you stall the tip of the wing first, usually one tip will stall first, causing the condition you see. Notice the \u0022minor stalling detected\u0022 indicator.\u003Cp\u003EIt could be an issue with FAR, but spoilers near the tip is bad aircraft design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I didn\u0027t know that, and will revise, whether FAR models that or not. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003ECamlost got a lot of the basics down, but the main problem is that the Tiberdyne Shuttles aren\u0027t set up to work with FAR. Depending on where the part origin for the wings is placed it may not be possible to make them work. FAR\u0027s wing code is designed to function well with wings designed like the stock wing parts; reversible, surface attached, symmetric. Anything outside of those parameters may not be capable of being set up to work.\u003Cp\u003E\u003Cstrong\u003E@toadicus: \u003C/strong\u003EI\u0027ll check out the craft in my dev build; I\u0027ve changed how some of the wing code works, so I may have already fixed the issue. I think removing the non-airbrakes from the action group is just a result of the placebo effect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it helps any, this seems to happen to previously-placed airbrakes (or something) after placing any additional parts in the editor. As I continued to revise the design, I wound up needing to re-place the first two air brakes as the last two parts on the plane after I added any other parts. As long as the only two airbrake parts are the very last parts on the plane, it works. If they\u0027re not, it doesn\u0027t seem to.\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-13T01:34:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003ECamlost got a lot of the basics down, but the main problem is that the Tiberdyne Shuttles aren\u0027t set up to work with FAR. Depending on where the part origin for the wings is placed it may not be possible to make them work. FAR\u0027s wing code is designed to function well with wings designed like the stock wing parts; reversible, surface attached, symmetric. Anything outside of those parameters may not be capable of being set up to work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Ferram,\u003C/p\u003E\u003Cp\u003EYeah, that could be it, Tiberion\u0027s wings attach to the cargo bay with nodes (stacked) and are not able to be symmetried (obviously not a word but you know what I mean). The Left and right wings are separate parts, although I did try deleting the nodes and allowing surf attachment and was able to build it, but still unflyable. \u003C/p\u003E\u003Cp\u003ETiberion thought that nodes and their sizes also had an affect and from some testing I did, it does have and affect on the CoL, for example he has a robotic arm attachment point on the front right corner of the cargo bay which seems to pull the CoL to the right, also it was suggested to change the node size from small at the front to large at the rear. \u003C/p\u003E\u003Cp\u003EI also tried Bobcats Buran last night and it seemed to have large nodes all over (including the left and right wings) but still flew straight (until I botched the reentry and just flat spun). I did note that he had 2 arm nodes, one on each side (balanced).\u003C/p\u003E\u003Cp\u003EI will have a look at the cfg for the wing \u0022attributes\u0022 mentioned in camlost\u0027s second point (I did note it before but I thought I read somewhere that FAR would use default values if none are specified), as well as the nodes again (I stopped last night as it was starting to bug out my save file and I wanted to try bobcats buran.) I\u0027ll also see if I can determine the origin. What specifically about the origin is important. Does it need to be central to the part (x0,y0,z0 physically)? Or does it need to be at a wing root, theoretical wing CoM, etc? I\u0027m assuming the origin is defined in the model.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EAzza\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-13T01:56:16Z","Content":"\n\u003Cp\u003EThe offset robotic arm attach node probably causes some issues for the cargo bay; attach something to it and that should clean things up.\u003C/p\u003E\u003Cp\u003EThe nodes on the wings wouldn\u0027t matter if the wings were set up to use the FAR wing code, but since they aren\u0027t the standard FARBasicDragModel module would be applied to them instead, which would cause the nodes to be used in calculations and the wing to be treated like a fuel tank or engine or something like that. It\u0027s okay if the regular attach nodes stay there, so long as the FARWingAerodynamicModel is applied in the config.\u003C/p\u003E\u003Cp\u003EThe wing\u0027s part origin needs to be at the midchord point on the wing root for the CoL to be placed properly. Further, the wing needs to have some type of surface attach node specified so that it can be surface attached correctly; this is how FAR figures out which direction to offset the CoL in so that it is halfway down the wing span. Take a look at the differences between the stock tailfin and deltaWing parts and you will see how they are actually flipped, but with flipped surface attach data as well to counteract that.\u003C/p\u003E\u003Cp\u003EThe part origin can be offset by using a MODEL{} block. I can\u0027t think of any examples offhand, but if you toy with PartWelder the resulting models are offset using the same type of logic.\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-13T02:46:23Z","Content":"\n\u003Cp\u003EThanks Ferram, \u003C/p\u003E\u003Cp\u003EThat it gold. I\u0027m not 100% on what you are talking about with the tail fin nodes (don\u0027t worry not asking for more explanation), but I will have a look at a few examples and figure it out.\u003C/p\u003E\u003Cp\u003ESo what you are saying about the nodes is if one if left \u0022unattached\u0022 it can affect the dynamics, but if it is used/attached, it is no longer taken into account for calcs? Also does it matter if they are stack or attach nodes? I can\u0027t really find any definition on the nodes except ones for vertical (stack) and ones for Horizontal (attach) but again that was old data, 0.15 to 0.20. Are attach nodes for defining the pivot point when surface attaching?\u003C/p\u003E\u003Cp\u003ESorry for all the questions, but as I get my head around one aspect, more questions become apparent.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EAzza\u003C/p\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-12-13T03:09:46Z","Content":"\n\u003Cp\u003EAnyone got tips on how to place landing flaps for best drag and lift? Should I put them on my main wings aligned with the center of mass? What angle should I deflect them to?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-13T03:24:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003EIn the configs you\u0027ll see each stack attach node specified, as well as a surface attach node (node_attach). That\u0027s what I meant about the tail fin and delta wing nodes.\u003C/p\u003E\u003Cp\u003EUnconnected stack attach nodes are used by FAR to detect large, relatively flat surfaces in the airflow; this is how it handles a fuel tank without a nosecone, for example, or the drag of a relatively flat command pod bottom. The \u0022new\u0022 attach node system hasn\u0027t been added yet, and currently they still use the \u0022old\u0022 data that you found.\u003C/p\u003E\u003Cp\u003EDon\u0027t worry about questions. No worries. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@SnappingTurtle: \u003C/strong\u003EThey\u0027ll make more lift if they\u0027re placed on larger wings, but ideally you want them near the plane\u0027s center of mass for pitch-control purposes. Deflect them as much as you want, so long as they don\u0027t stall; you can probably get away with ~20 degrees and you\u0027ll be fine.\u003C/p\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-12-13T03:36:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDeflect them as much as you want, so long as they don\u0027t stall; you can probably get away with ~20 degrees and you\u0027ll be fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the control surface assignment FAR tells me that my flaps have a stall angle of over 800 degrees. Is this because they\u0027re so close to the center of mass?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-13T03:41:59Z","Content":"\n\u003Cp\u003ENo, that would be because you don\u0027t have the CoL on. Without having the game run aerodynamic calculations it can\u0027t estimate the stall angle.\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-13T03:47:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003EIn the configs you\u0027ll see each stack attach node specified, as well as a surface attach node (node_attach). That\u0027s what I meant about the tail fin and delta wing nodes.\u003Cp\u003EUnconnected stack attach nodes are used by FAR to detect large, relatively flat surfaces in the airflow; this is how it handles a fuel tank without a nosecone, for example, or the drag of a relatively flat command pod bottom. The \u0022new\u0022 attach node system hasn\u0027t been added yet, and currently they still use the \u0022old\u0022 data that you found.\u003C/p\u003E\u003Cp\u003EDon\u0027t worry about questions. No worries. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell Bugger me that is brilliant, and makes so much sense now... So that tails, node and stack nodes are in the same position, just one is oriented 180 (so one node is say angy\u002B1 and the other angy-1). \u003C/p\u003E\u003Cp\u003ESo would this also apply to the top and bottom stacks? I note in the Wiki for the cfg that it says\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSP Wiki\u0022 data-cite=\u0022KSP Wiki\u0022\u003E\u003Cdiv\u003EGenerally, most parts will have angx, angy, and angz values of either (0.0, -1.0, 0.0) for a node_stack_bottom and (0.0, 1.0, 0.0) for a node_stack_top.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the Tibers stacking sections (nose, cockpit, cargobay etc) are all angy 1.0 (form memory). Would changing these to \u002B/- top/bottom (front/rear) cancel out the fuselage lift characteristics? \u003C/p\u003E\u003Cp\u003EHow would I apply this to the wing nodes. fuselage angy\u002B1 and wing angy-1, or both angy\u002B1. Would the Ferram properties added to the wings negate this effect?\u003C/p\u003E\u003Cp\u003EDammit, I\u0027m so keen to knock of work now to try all these ideas... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-12-13T03:55:20Z","Content":"\n\u003Cp\u003EDeflecting flaps past their stall angle seems to work, this should cause extra high drag because of the separation of the boundary layer, right? Is this a good or bad idea for landing? Are FAR flaps from standard control surfaces more realistic than B9\u0027s airbrakes which seem to have extremely high drag?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T04:19:59Z\u0022 title=\u002212/13/2013 04:19  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by SnappingTurtle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-13T04:20:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003EThe angle values aren\u0027t used anymore for anything but the surface attach (I believe) on any parts, so FAR doesn\u0027t do anything with them. That said, the node values (other than the surface ones) do nothing for wings. Fuselage and wing parts use completely different aerodynamic models; the former makes use of attach nodes for drag characteristics, the latter only uses the surface node to figure out how the model is oriented.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@SnappingTurtle: \u003C/strong\u003EYeah, it\u0027ll make quite a bit more drag, but you\u0027d be surprised how much lift you can make while still stalling something; it\u0027s just a lot draggier. It\u0027s probably good for landing.\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-13T04:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@azza276: \u003C/strong\u003EThe angle values aren\u0027t used anymore for anything but the surface attach (I believe) on any parts, so FAR doesn\u0027t do anything with them. That said, the node values (other than the surface ones) do nothing for wings. Fuselage and wing parts use completely different aerodynamic models; the former makes use of \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eattach nodes for drag characteristics\u003C/span\u003E, the latter only uses the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Esurface node\u003C/span\u003E to figure out how the model is oriented.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I think I got a little confused... But don\u0027t you mean aerodynamics model for the fuselage uses the Stack nodes for drag, and for the wings use the attach nodes for orientation (e.g. calculating AoA?)\u003C/p\u003E\u003Cp\u003EI think I still need further explanation of the use of nodes. So does a fuselage have attach nodes? or does it just allow surfattach? Are attach nodes used on non-stacking parts to specify the point at which that part connects to the surface (of a fuselage) and rotates around that node (when ghosted to that surface) when in the VAB/SPH?\u003C/p\u003E\u003Cp\u003EOnly reason I think I am getting confused is because I did try to change some of the stacked nodes to attach nodes (making sure to name the attach node properly) but they didn\u0027t show the green ball in the SPH, and could snap them to each other, they were in the same position as the stack node just defined them as attach. So my questions above are based on what I saw, and just want to confirm this is normal behavior or have I right royally stuffed up the cfg?\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-13T05:31:15Z","Content":"\n\u003Cp\u003EYeah, that\u0027s what I said, except wings only use the surface attach nodes to calculate the offset of the CoL from the wing root. After that, wings don\u0027t do anything more with it.\u003C/p\u003E\u003Cp\u003EEvery part has attach nodes. That is how the ability to attach parts to each other are defined. The stack nodes are a subset of attach nodes, used to connect a specific section of one part to a specific section of another (top of tank to bottom of another). Surface attach nodes are another subset of attach nodes used to define radial attachment of parts (fuel tank slapped on the side of another fuel tank), used on all parts, stacking and non-stacking.\u003C/p\u003E\u003Cp\u003EI dunno what you managed to do with the config, but I guess that works. I haven\u0027t played with attach nodes too much.\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-12-13T06:29:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEvery part has attach nodes. That is how the ability to attach parts to each other are defined. The stack nodes are a subset of attach nodes, used to connect a specific section of one part to a specific section of another (top of tank to bottom of another). Surface attach nodes are another subset of attach nodes used to define radial attachment of parts (fuel tank slapped on the side of another fuel tank), used on all parts, stacking and non-stacking.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore specifically, every part can have at most one surface attach node, and any number of stack ones. Also, the \u0027angle\u0027 name is misleading, because unless I\u0027m very much mistaken that is just a unit vector defining the orientation of the node. When attaching it is aligned to match the surface normal for surface attach, and the similar orientation vector of the other node for stack. FAR actually uses the stack and surface attach orientation in a heuristic to resolve some difficult cases of radial part main axis orientation.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-12-13T09:55:19Z","Content":"\n\u003Cp\u003Eferram, can you take a look at the FASA Mercury? Especially the strap/decoupler for the retro pack. It seems to add a TON of drag, to the point where a built Atlas has a crazy-high CoP.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/4ahLiKO.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4ahLiKOl.png\u0022 alt=\u00224ahLiKOl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m using this config, by me and Dragon01 (WIP): \u003Ca href=\u0022https://www.dropbox.com/s/89h5824hby2xsei/FASA.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/89h5824hby2xsei/FASA.cfg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut it\u0027ll probably still exist for the unrescaled part too.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-13T12:05:25Z","Content":"\n\u003Cp\u003EAh, I was just about to PM you about that. The whole thing is unstable and tries to flip out after 100m/s because for that. And here I was buffing the verniers trying to combat this (still good, though, I\u0027ve found that the new value is more realistic)... Anyway, I\u0027d really like to know what\u0027s going on, Atlas is near-unflyable because of that (near, because the buffed vernier can hold it on course somewhat). \u003C/p\u003E\u003Cp\u003EOh, and BTW, I\u0027ve found a neat datasheet for various Atlas vernier configurations. The only problem is that all thrust are SL, and I\u0027m estimating vacuum ones. NA-13 is what we use, NA-15 a the later one.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://heroicrelics.org/info/lr-101/lr-101.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://heroicrelics.org/info/lr-101/lr-101.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"azza276","CreatedById":96352,"CreatedDateTime":"2013-12-13T14:27:05Z","Content":"\n\u003Cp\u003EOk, been playing around a bit and still no luck... I think I am close though. The issue now seems that the FARWingAerodynamicModel applied to the right wing is causing issues.\u003C/p\u003E\u003Cp\u003EWhat I see is I have the model (cockpit and cargo) and everything centreline. I add the right wing and the CoL moves backwards but stays on the centreline. Add the left wing and the CoL moves to the left. Remove the right wing and the CoL sits on the left wing. So the FAR aero model module works on the left wing but when the same settings are applied to the right wing, it moves the CoL to the left of the wing. \u003C/p\u003E\u003Cp\u003EIs there anyway of mirroring the module for the right wing? I tried some of the values with a - sign, no change. I even changed the nodes orientations and that had no affect. Ran without the stack nodes and surfaced attached, no change, commented out the FAR module (to apply the default) shuttle still flips out, even though the CoL sits just behind the CoM.\u003C/p\u003E\u003Cp\u003EI know you said it is designed for symmetrical wings etc, just wondering if it is mirrorable for the right wing? (Or left if that is the actual issue...)\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EAzza\u003C/p\u003E\n"}]}