{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":339,"Articles":[{"CreatedByName":"percyPrune","CreatedById":130676,"CreatedDateTime":"2015-04-28T11:22:02Z","Content":"\n\u003Cp\u003EFerram, Thanks very much for continuing this (and making it better!)\u003C/p\u003E\u003Cp\u003E\u0022Area ruling...\u0022 *starts drooling*\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2015-04-28T11:43:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Autochton\u0022 data-cite=\u0022Autochton\u0022\u003E\u003Cdiv\u003EYes - but changing how? Can I squeeze it into a rounded-corner rectangle? A triangular shape like the one on the SR-71? Can I do \u003Ca href=\u0022http://www.mikejamesmedia.com/media/f_22_project/000_research_and_setup/revell_lmco_compare/revell_f22_scans_01.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E? Last I looked I only had circular cross-sections available.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/107919-0-90-Procedural-Parts-Extended-1-0-77-Industries\u0022 rel=\u0022external nofollow\u0022\u003EAzimech\u003C/a\u003E has been working on other procedural shapes using the pParts base code. Now that shapes actually matter, we may be able to convince him to do some practical shapes.\u003C/p\u003E\n"},{"CreatedByName":"thaflya","CreatedById":58345,"CreatedDateTime":"2015-04-28T11:51:08Z","Content":"\n\u003Cp\u003EJust a quick commend to ferram4:\u003C/p\u003E\u003Cp\u003EThank you that you keep working on this mod, FAR always was the most important mod in KSP. Looking forward to your new version.\u003C/p\u003E\u003Cp\u003EKeep on doing that amazing job \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"arob","CreatedById":89569,"CreatedDateTime":"2015-04-28T12:10:42Z","Content":"\n\u003Cp\u003Eyour mod is going to make me learn more than my engineering teachers\u003C/p\u003E\n"},{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2015-04-28T13:32:22Z","Content":"\n\u003Cp\u003EIs anyone interested in variable sweep wings. I know I know you can do it with Infernal robotics but i prefer my planes to not be jelly so can we please get it as a single part?\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-04-28T13:36:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LORDPrometheus\u0022 data-cite=\u0022LORDPrometheus\u0022\u003E\u003Cdiv\u003EIs anyone interested in variable sweep wings. I know I know you can do it with Infernal robotics but i prefer my planes to not be jelly so can we please get it as a single part?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought you were offering yourself to make a mod for them, haha.\u003C/p\u003E\u003Cp\u003EThe current release would not handle it, and AFAIK nuFAR still uses old wing code, so I believe you would need to use IR\u0027s method to move them.\u003C/p\u003E\u003Cp\u003EStill, having a wing part dedicated for that would be interesting, as you said, using the joints is not optimal.\u003C/p\u003E\n"},{"CreatedByName":"Sage","CreatedById":103634,"CreatedDateTime":"2015-04-28T13:42:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI will say that nuFAR is awesome and should be out in a day or two. Currently I\u0027m waiting on a stripped-down parachute module from stupid_chris (who was gracious enough to offer one) to replace stock behavior. For obvious reasons, I can\u0027t release a FAR version that results in pods impacting the ground at 180 m/s. Also, I\u0027m too sleepy to make a good judgment call about its release state.\u003Cp\u003EFor those wondering exactly what nuFAR / voxelFAR / vesselCenteredFAR does compared to previous versions, it basically does away with the part-centered operation of the previous FAR versions (the same behavior that powers NEAR and newStock) in favor of a vessel-centered approach. Instead of the part-centered complications of determining the interactions between parts (which are never done exactly right) it\u0027ll create a voxel model of the vehicle to work with, like these guys:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/th6Jd6z.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/th6Jd6z.png\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/fkxx9ON.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/fkxx9ON.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFrom this, I can get a lot of data about how the vessel will behave in flight. Most importantly, I can implement a long-awaited feature: area-ruling. Basically, it\u0027s a requirement for transonic and supersonic flight that states that for minimum drag, a vehicle\u0027s cross-section must vary smoothly. And very small changes in cross-section can have a surprisingly large effect on transonic and supersonic drag. So for ease of use, you\u0027ll get a nice graph of cross-sectional area over the vehicle so you can see where to mess with things:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/L3ZcDkV.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/L3ZcDkV.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe yellow line is the 2nd derivative of cross-sectional area, which actually goes into the math behind drag. Green is obviously cross-sectional area. Transonic area ruling consists of fiddling with the cross-section curves until you smooth out the curve to get minimum drag. For obvious reasons, some people will find this unfun given the limited design choices we have for shaping things, so there are difficulty options that include various multipliers to the total drag and smoothing functions for the area to deal with the noisiness of the voxel model itself. But to give you an idea of how this makes things go, getting supersonic is an exercise in flying through a brick wall that may tear you to shreds. I\u0027ve actually had to throttle down near Max Q to prevent a very nasty, very large rocket from coming apart and destroying itself.\u003C/p\u003E\u003Cp\u003EBesides that fun, the voxel approach also allows better resolution of body lift, which can give bodies their proper forces, rather than a simpler approximation from parts. Another benefit of the voxel approach is that cargo bays and payload fairings are emergent from the system. Rather than being defined top-down like in FAR, NEAR, or newStock, \u003Cem\u003Eany\u003C/em\u003E collection of parts in a hollow arrangement will be tried as shielded from the airflow. Although the current wing model is the legacy oldFAR wing model, I also expect that the voxel approach can be used to calculate wing shapes and provide a much more accurate model of the wings as well as the fuselage.\u003C/p\u003E\u003Cp\u003ESo, yeah. Enjoy newStock for now or stay on 0.90 and keep oldFAR. nuFAR will be out soon, when I will battle the demons of what version to give it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is incredible :Q_\u003C/p\u003E\u003Cp\u003EEagerly awaiting nuFAR\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-04-28T13:47:46Z","Content":"\n\u003Cp\u003EI\u0027m flabbergasted by the changes. FAR is turning more and more into a real-time aerodynamic simulation. With the new changes involving trans-sonic drag, do we have any word yet on modeling phenomena like wingtip drag or compression lift?\u003C/p\u003E\n"},{"CreatedByName":"fatcargo","CreatedById":93302,"CreatedDateTime":"2015-04-28T14:15:40Z","Content":"\n\u003Cp\u003EWHOA ! I admit i\u0027m not nearly an expert on aero calculations but pictures blew me away. People will FINALLY be able to make (more or less structurally sound) payload shielding by \u0022stitching\u0022 together various parts (and using IR to make some cool designs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). Last pic with overlay visualization left me almost speechless, i just have one thing to say about it : now that reworked IR supports in-editor animation of parts, think how will that curve change as you move parts. You will then be able to directly observe how IR-driven changes in shape affect aerodynamic forces. Robotics and aerodynamics heaven ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-28T15:13:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022yafeshan\u0022 data-cite=\u0022yafeshan\u0022\u003E\u003Cdiv\u003EThe new stock model is good but not adequate. It is still far too easy to reach space than orbit. I played very rarely without FAR and I do not want to start game without it again. I am reading very good stuff about this new nuFAR. I have read Ferrams explanation on new features and my mind blown out\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGetting to space in FAR was always far easier than stock, as long as you built your rockets like actual rockets. The new 1.0 with it\u0027s rebalacing is also distinctly more challenging than FAR was.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-04-28T16:43:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EGetting to space in FAR was always far easier than stock, as long as you built your rockets like actual rockets. The new 1.0 with it\u0027s rebalacing is also distinctly more challenging than FAR was.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConversely, I strongly suspect getting into orbit now with FAR will actually take more delta-V than without, since nuFAR correctly models trans-sonic drag and high-altitude skin drag.\u003C/p\u003E\n"},{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-04-28T16:54:08Z","Content":"\n\u003Cp\u003EIt\u0027s awesome how your mod was so far ahead and so much more advanced than stock aero that it got effectively canonized for 1.0 (save high-G disentegration), and now, instead of resting on your laurels, you\u0027re developing the next NEXT generation of aerodynamics simulations for KSP. Well done, good sir. Well done.\u003C/p\u003E\u003Cp\u003EOne request, though: please, please make the wing models voxel-based as well.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-04-28T17:09:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clythoris\u0022 data-cite=\u0022Clythoris\u0022\u003E\u003Cdiv\u003EUm, does this mean realchutes will become obsolete if I have nuFAR installed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a good question.\u003C/p\u003E\u003Cp\u003EFarrem4, you know I didnt think I could think this, but are you Santa Claus? Because you only bring joy into our lives!\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-28T17:14:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jovus\u0022 data-cite=\u0022Jovus\u0022\u003E\u003Cdiv\u003EConversely, I strongly suspect getting into orbit now with FAR will actually take more delta-V than without, since nuFAR correctly models trans-sonic drag and high-altitude skin drag.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027m really curious what this is going to change. That drag will also act on the much weaker 1.0 rockets. Then again, maybe a good rocket will actually be more efficient than before?\u003C/p\u003E\n"},{"CreatedByName":"etheoma","CreatedById":69258,"CreatedDateTime":"2015-04-28T17:18:53Z","Content":"\n\u003Cp\u003EIs nuFAR Ferrems way of say OH YEAH!!! to squads new aero dynamics? XD\u003C/p\u003E\u003Cp\u003EIts like Squad almost caught up to him then he just turned on the afterburners and was like... errrr BYE!!! Really I don\u0027t know why they haven\u0027t employed Farrem at this point... They probably have tried I suppose.\u003C/p\u003E\u003Cp\u003EAlthough all the noobies would be scared away from the game if farrem were allowed free rain over the stock game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlthough building a perfectly balanced craft with KSPI reactors is going to be much harder now as I was just sticking them to the side and encaing them in fairings with the decoupler\u0027s disabled which is kind of a hack but it wont work now because it would increase the area there for it would increase the drag.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T17:30:33Z\u0022 title=\u002204/28/2015 05:30  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by etheoma\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-04-28T17:20:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EAdding to the choir: I just had a play with the new stock aero, and while it is a large improvement for stock, FAR is in no danger of becoming obsolete. I\u0027ll probably be leaving KSP largely unplayed until FAR updates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is my problem. I made a plane with no tail and it flew fine in stock. NO TAIL!?! It was terrible I subsiquently rashed it into the ground to destroy such an abomination. I am awaiting nuFAR much much more than 1.0!\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-04-28T17:45:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Svm420\u0022 data-cite=\u0022Svm420\u0022\u003E\u003Cdiv\u003EThis is my problem. I made a plane with no tail and it flew fine in stock. NO TAIL!?! It was terrible I subsiquently rashed it into the ground to destroy such an abomination. I am awaiting nuFAR much much more than 1.0!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy experience was worse, methinks. I wanted to check out how forgiving the new My first rocket had no fins (!... okay, many rockets don\u0027t, but they use vectored thrust and \u003Cem\u003Every\u003C/em\u003E careful trajectories). I heeled over 5 degrees at 100m/s with a TWR ~1.7 and turned off SAS.\u003C/p\u003E\u003Cp\u003EMy rocket stayed on that heading all the way to space. Not on the prograde vector - 5-10 degrees from vertical.\u003C/p\u003E\n"},{"CreatedByName":"Col_Jessep","CreatedById":4071,"CreatedDateTime":"2015-04-28T18:22:26Z","Content":"\n\u003Cp\u003EFerram, it makes me so happy to see that you already have a new, improved idea and are taking FAR to the next level! =D\u003C/p\u003E\n"},{"CreatedByName":"mariohm1311","CreatedById":114131,"CreatedDateTime":"2015-04-28T18:27:20Z","Content":"\n\u003Cp\u003EHow do you install nuFAR from Github?\u003C/p\u003E\n"},{"CreatedByName":"CDRW","CreatedById":124541,"CreatedDateTime":"2015-04-28T18:29:18Z","Content":"\n\u003Cp\u003EI don\u0027t believe nuFAR is out yet. Today or tomorrow though.\u003C/p\u003E\n"},{"CreatedByName":"mariohm1311","CreatedById":114131,"CreatedDateTime":"2015-04-28T18:31:05Z","Content":"\n\u003Cp\u003EIt\u0027s on Github, isn\u0027t it?\u003C/p\u003E\n"},{"CreatedByName":"CDRW","CreatedById":124541,"CreatedDateTime":"2015-04-28T18:42:22Z","Content":"\n\u003Cp\u003EIf it is, this is the first I\u0027ve heard of it. The latest version is the one that supports 0.9\u003C/p\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-04-28T18:42:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mariohm1311\u0022 data-cite=\u0022mariohm1311\u0022\u003E\u003Cdiv\u003EIt\u0027s on Github, isn\u0027t it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust download a zip of the repo if you want. Ferram isn\u0027t responsible if it isn\u0027t at release state as you are doing this at your own risk. I am sure we will have nuFAR today or tomorrow and after you wont even remember waiting for it, so why rush. I also saw in the deadly re entry thread ferram and starwaster are collaborating to make the 2 compatible with their respective new updates so it may take a little longer. You waited all the way for 1.0 what is 1 more day of errordynamics?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-04-28T18:47:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI will say that nuFAR is awesome and should be out in a day or two. Currently I\u0027m waiting on a stripped-down parachute module from stupid_chris (who was gracious enough to offer one) to replace stock behavior. For obvious reasons, I can\u0027t release a FAR version that results in pods impacting the ground at 180 m/s. Also, I\u0027m too sleepy to make a good judgment call about its release state.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ESo, yeah. Enjoy newStock for now or stay on 0.90 and keep oldFAR. nuFAR will be out soon, when I will battle the demons of what version to give it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwww man that\u0027s looking \u003Cstrong\u003Eepic\u003C/strong\u003E! the new simplified scan of the skin surface approach seems like a great idea.\u003C/p\u003E\u003Cp\u003EJust one question, Will NuFar differentiate a wing part from a random part? Or is it completely shape based?\u003C/p\u003E\u003Cp\u003E ie; Could I make wings out of .. oxstat solar panels for example? (And have exact same drag/lift value if they have the exact same voxel shape than a stock delta wing let\u0027s say?)\u003C/p\u003E\u003Cp\u003EÃ‚Â¨\u003C/p\u003E\u003Cp\u003EI\u0027m so glad to soon be able to model stuff with clipping and make custom aero active shapes\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T18:51:45Z\u0022 title=\u002204/28/2015 06:51  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by RevanCorana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mariohm1311","CreatedById":114131,"CreatedDateTime":"2015-04-28T19:01:12Z","Content":"\n\u003Cp\u003ESupermaneuverability they say.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4anwVL4.png\u0022 alt=\u00224anwVL4.png\u0022\u003E\u003C/p\u003E\n"}]}