{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":395,"Articles":[{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-05-26T09:55:00Z","Content":"\n\u003Cp\u003EAny chance of a thumbnail tutorial from someone on how to use the aero sims? I really haven\u0027t the faintest idea where to start with those.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-05-26T10:31:08Z","Content":"\n\u003Cp\u003E1) Calc derivs for the case you want to check.\u003C/p\u003E\u003Cp\u003E2) Go to sim and select lateral or longitudinal.\u003C/p\u003E\u003Cp\u003E3) Enter initial perturbations from nominal, and see if it converges and damps out or diverges.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EList of terms:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELongitudinal:\u003C/p\u003E\u003Cp\u003Eu = forward vel perturbation\u003C/p\u003E\u003Cp\u003Ew = downward vel perturbation\u003C/p\u003E\u003Cp\u003Etheta = pitch angle perturbation\u003C/p\u003E\u003Cp\u003Eq = pitch rate\u003C/p\u003E\u003Cp\u003ELateral:\u003C/p\u003E\u003Cp\u003Ebeta = sideslip angle\u003C/p\u003E\u003Cp\u003Ephi = roll angle\u003C/p\u003E\u003Cp\u003Er = yaw rate\u003C/p\u003E\u003Cp\u003Ep = roll rate\u003C/p\u003E\n"},{"CreatedByName":"Recon777","CreatedById":144849,"CreatedDateTime":"2015-05-26T10:38:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Garek\u0022 data-cite=\u0022Garek\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAlso, most of the time, you just need to copy the mod directory to KSP/GameData and maybe delete the old one if you\u0027re updating, which is not that hard.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s true - however, keeping them up to date is another story. Even with 50-60 mods and CKAN, every couple days I find out that one or more mods have updated, and it\u0027s time to hit the checkbox and apply the updates. It\u0027s just a few seconds to do this, whereas keeping track of updates manually I can see being more trouble than it\u0027s worth. I suppose from a cost/benefit perspective, the real question is whether NOT using CKAN gives enough of a benefit to outweigh the inconvenience. I\u0027m no stranger to the cumulative-mod scene. I\u0027ve been a modded Minecraft player for several years. I prefer the Resonant Rise modpack which has 200\u002B mods in it. Tweaking it how I like it is a WHOLE lot of work, which usually means once I have it how I like it, I freeze the modpack and don\u0027t accept any updates for a good six months at least. With KSP, I\u0027ve only really started playing it since 1.0 was released, and I\u0027m still getting my feet wet in the mod scene. It\u0027s very similar to the Minecraft situation. Mods are made to improve the game experience and add stuff the vanilla game doesn\u0027t have, and they are typically focused on one specific improvement and coexist with other mods. \u003C/p\u003E\u003Cp\u003ESeeing CKAN, I have to say it\u0027s quite impressive to get that many modders to even think about working together and making their mods available in a general repository like this. The fact that it exists at all is amazing. I can understand though, why some might not want to use it. Also, similar to Minecraft, KSP was created in a really crappy engine (because Reasons) that has frustrating limitations. With KSP it seems to be that Unity is 32 bit making gamers have to pick and choose which mods to add even though so many of us have high end gaming machines with more than enough memory and horsepower to handle whatever the game has to offer - and yet, the game up and crashes if you install too much content. I\u0027d love to be able to use the EVE cloud / astronomer\u0027s visual pack, and it does look wonderful, but it seems to be either that or a bunch of other more useful mods. So, I\u0027ll have to sacrifice looks for function I guess. That\u0027s what KSP is all about anyway. If I wanted I beautiful space game, I\u0027d play Elite: Dangerous or Star Citizen. So far, KSP has me more hooked than I expected, I\u0027ll say that much!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T10:43:01Z\u0022 title=\u002205/26/2015 10:43  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Recon777\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2015-05-26T10:42:57Z","Content":"\n\u003Cp\u003EFerram is it possible for a modded wing to magically reduce voxel drag by several percent or so, or to directly manipulate the aerodynamic parameters without messing up with the wing geometry? Because there are techs in real life like \u003Ca href=\u0022https://en.wikipedia.org/wiki/Circulation_control_wing\u0022 rel=\u0022external nofollow\u0022\u003ECirculation control wing\u003C/a\u003E that increases lift without increasing drag by using blown air, or more scifi stuff like \u003Ca href=\u0022http://www.newscientist.com/blogs/nstv/2013/03/psychedelic-plasma-wings.html\u0022 rel=\u0022external nofollow\u0022\u003Eplasma drag reducer\u003C/a\u003E that reduces drag by using plasma.\u003C/p\u003E\n"},{"CreatedByName":"Demuder","CreatedById":144165,"CreatedDateTime":"2015-05-26T12:06:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022duguamik\u0022 data-cite=\u0022duguamik\u0022\u003E\u003Cdiv\u003EI\u0027m experiencing an issue I haven\u0027t seen yet in this thread, apologies if I\u0027ve missed it. After a craft reaches an altitude above approximately 140km, it will experience no drag upon reentry. I have included a screenshot with the FAR panel open to show drag stats. \u003Cp\u003EThe same issue seems to happen even with only FAR (and its dependancies) installed. \u003Ca href=\u0022http://i.imgur.com/gyncSru.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/gyncSru.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you read a few pages back, me and another player had a similar problem. We didn\u0027t do a proper bug hunt (you know, uninstalling all mods except FAR, reproduce the problem, etc) but we both used CKAN for FAR, and after people saying here that FAR doesn\u0027t play nice with CKAN, I just uninstalled FAR and installed it manually - aka copy FAR\u0027s folders to the game dir. Never had an issue again with reentry since - or any other issues that is. I am not saying it\u0027s CKAN\u0027s problem, but it could be worth a try.\u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong, I am not saying don\u0027t use CKAN - hell, if I had to give it up I would rather just play vanilla KSP, but since ferram himself says that it might have a problem with FAR, just install FAR manually and leave the rest of your mods on it. I hope that this fixes FAR for you, because honestly it\u0027s become one of my favorite mods.\u003C/p\u003E\n"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-05-26T12:10:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ferram\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBac9 found the probable cause of the issue with B9 Pwings. The mirroring axis used for the parts is (0,0,-1) so the objects get scaled negatively after rotation making it look like the triangles are inverted. Using the default mirroring axis the voxels are correctly placed (just the mirrored part is upside down)\u003C/p\u003E\n"},{"CreatedByName":"Tonnz","CreatedById":133260,"CreatedDateTime":"2015-05-26T12:11:59Z","Content":"\n\u003Cp\u003EIs the current version of FAR supposed to be updating the voxelization constantly? I\u0027m also getting MissingFieldExceptions in the Debug Menu. I noticed it after the game started lagging horribly, reverting the flight fixed the lagging, but not the debug-menu spam. Below you can find the output-log and a screenshot:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/9kq0IpB.png\u0022 alt=\u00229kq0IpB.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe output-log is more than 25 megabytes large with over 0.7 million lines. I don\u0027t know if that\u0027s normal, i\u0027m having trouble pasting it. You can download the compressed file (\u0026lt;1mb) here:\u003Ca href=\u0022https://www.dropbox.com/s/ebs7r2fi72mr7d2/output_log.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ebs7r2fi72mr7d2/output_log.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT: The game is modded, if needed i can post a complete list of all mods. I guess the most relevant mods are FAR (obviously), RSS (as part of the KSPRC visual pack) and Tweakscale.\u003C/p\u003E\u003Cp\u003EEDIT2: I\u0027m using the most recent version of FAR.\u003C/p\u003E\u003Cp\u003EI also have a little question that is not related to the the problem. How does the new version of FAR deal with flexing of parts, especially wings?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T12:22:12Z\u0022 title=\u002205/26/2015 12:22  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Tonnz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2015-05-26T12:26:55Z","Content":"\n\u003Cp\u003EThose missing field exceptions are coming from Distant Object Enhancement, a mod I also had to disable due to bug spam. Also I think we came across tweakables causing constant voxel update requests, earlier in the thread. In that case I think it was tweakableeverything, though. Try disabling tweakscale and test? Otherwise the full modlist would probably be necessary.\u003C/p\u003E\n"},{"CreatedByName":"Tonnz","CreatedById":133260,"CreatedDateTime":"2015-05-26T12:37:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Volt\u0022 data-cite=\u0022Volt\u0022\u003E\u003Cdiv\u003EThose missing field exceptions are coming from Distant Object Enhancement, a mod I also had to disable due to bug spam. Also I think we came across tweakables causing constant voxel update requests, earlier in the thread. In that case I think it was tweakableeverything, though. Try disabling tweakscale and test? Otherwise the full modlist would probably be necessary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh yes, i do have DistantObjectEnhancement installed, but not tweakableeverything. I\u0027ll try what you suggested right now.\u003C/p\u003E\u003Cp\u003E\u002BEDIT: This seems to have fixed it! Thank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E !\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T12:46:39Z\u0022 title=\u002205/26/2015 12:46  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Tonnz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-05-26T14:21:01Z","Content":"\n\u003Cp\u003E@Recon777 You don\u0027t have to stop using CKAN, just don\u0027t use it to manage FAR for the moment. As I understand it, CKAN respects if you install a mod manually, so it should play nice if you install this one mod manually for now.\u003C/p\u003E\u003Cp\u003EPersonally, I believe that the first step of debugging a mod installed via CKAN should be installing the mod manually, to make sure it\u0027s not a CKAN installation issue.\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2015-05-26T16:56:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tonnz\u0022 data-cite=\u0022Tonnz\u0022\u003E\u003Cdiv\u003EOh yes, i do have DistantObjectEnhancement installed, but not tweakableeverything. I\u0027ll try what you suggested right now.\u003Cp\u003E\u002BEDIT: This seems to have fixed it! Thank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E !\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHappy to help!\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T18:12:48Z","Content":"\n\u003Cp\u003EAm I the only person, that thinks, that new FAR is a bit broken?\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-05-26T18:32:58Z","Content":"\n\u003Cp\u003EYour the only one who doesn\u0027t care to explain why.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T18:37:42Z\u0022 title=\u002205/26/2015 06:37  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T19:10:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EYour the only one who doesn\u0027t care to explain why.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t need to be that rude..\u003C/p\u003E\u003Cp\u003EPlanes fall apart too easily, a long time before reaching the sound barrier. Cross section curve, shows ridiculous dents, even when wings are angled by 45*. My aircraft starts to spin a second after pitching up, when all of my sability derivatives are green.\u003C/p\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-05-26T19:21:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EYou don\u0027t need to be that rude..\u003Cp\u003EPlanes fall apart too easily, a long time before reaching the sound barrier. Cross section curve, shows ridiculous dents, even when wings are angled by 45*. My aircraft starts to spin a second after pitching up, when all of my sability derivatives are green.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sounds more like poor piloting combined with bad designs.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-05-26T19:24:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EYou don\u0027t need to be that rude..\u003Cp\u003EPlanes fall apart too easily, a long time before reaching the sound barrier. Cross section curve, shows ridiculous dents, even when wings are angled by 45*. My aircraft starts to spin a second after pitching up, when all of my sability derivatives are green.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1-Check your G force and wing strength, as well as wing placement, you probably did it all wrong.\u003C/p\u003E\u003Cp\u003E2-Yep, just like it should when you are using lego parts.\u003C/p\u003E\u003Cp\u003E3-What about the steady-state graphs? If you checked them too you are probably just stalling.\u003C/p\u003E\u003Cp\u003ESorry but complaining like that does not help anyone.\u003C/p\u003E\u003Cp\u003EFAR is not made to be \u0022fun\u0022, it was made to be realistic, there are a few things that are changed on purpose to make it playable, like cross-section smoothing, but don\u0027t expect area ruling to be simple.\u003C/p\u003E\u003Cp\u003EProvide actual data of what should be happening and show the discrepancies and ferram4 will happily do his best to fix it.\u003C/p\u003E\u003Cp\u003EThe mod just suffered a massive overhaul, the new mechanics are very fresh, and the results comparing to actual data are better than you imagine.\u003C/p\u003E\u003Cp\u003EThere has been a lot of bad bug reports here recently, together with a few rants and people having issues simply because they have too many mods.\u003C/p\u003E\u003Cp\u003ESo, if you want to have the issues fixed, the best thing to do is nail them down and figure out exactly what is going on, making a complete report.\u003C/p\u003E\u003Cp\u003EOr just do nothing and wait for someone else to do it for you, both of these options are better than just saying that the mod is broken.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-05-26T19:37:51Z","Content":"\n\u003Cp\u003EI do apologize for that rudeness, but you must understand it is called for at this point. Because if not me then it\u0027ll be somebody else who\u0027s even more rude. Your original post was asking for it. All people ask for on these forums when it comes to complaints is information. It\u0027s as simple as that. Detailed information and as much of it as possible. It\u0027s just as rude to make short posts like that. \u003C/p\u003E\u003Cp\u003EAs for your issues... FAR is tough. It is. But trust me when I say it\u0027s not broken. If that was the case it\u0027d be obvious. Nine times out of ten it\u0027s user error. Or in this case builder/pilot error. \u003C/p\u003E\u003Cp\u003EPost a picture of the craft with that cross section curve next chance you get. Chances are someone will tell you what\u0027s wrong. \u003C/p\u003E\u003Cp\u003ENow I\u0027m not the most experienced plane builder myself. I\u0027m just learning most of the technicalities that come with FAR, but I\u0027m pretty confident in saying that cross section curve is dictated by a lot more then just the angle of your wings. For instance last night I had intakes making my cross section curve go haywire, but after messing around with the placement I was able to find nice smooth spot. \u003C/p\u003E\u003Cp\u003EYou say your planes are falling apart. That could be anything without having more information. Could be too much control input over stressing the craft or it could be as you said. A rough cross section curve ripping the plane appart at mach. \u003C/p\u003E\u003Cp\u003EYour pitching problems sound a lot like you have your center of lift ahead of your center of mass. I\u0027d like to think those FAR readouts will show you that, but just in case always fall back on that cardinal rule. Center of lift just behind the center of mass.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T19:40:39Z\u0022 title=\u002205/26/2015 07:40  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T19:55:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003E1-Check your G force and wing strength, as well as wing placement, you probably did it all wrong.\u003Cp\u003E2-Yep, just like it should when you are using lego parts.\u003C/p\u003E\u003Cp\u003E3-What about the steady-state graphs? If you checked them too you are probably just stalling.\u003C/p\u003E\u003Cp\u003ESorry but complaining like that does not help anyone.\u003C/p\u003E\u003Cp\u003EFAR is not made to be \u0022fun\u0022, it was made to be realistic, there are a few things that are changed on purpose to make it playable, like cross-section smoothing, but doesn\u0027t expect area ruling to be simple.\u003C/p\u003E\u003Cp\u003EProvide actual data of what should be happening and show the discrepancies and ferram4 will happily do his best to fix it.\u003C/p\u003E\u003Cp\u003EThe mod just suffered a massive overhaul, the new mechanics are very fresh, and the results comparing to actual data are better than you imagine.\u003C/p\u003E\u003Cp\u003EThere has been a lot of bad bug reports here recently, together with a few rants and people having issues simply because they have too many mods.\u003C/p\u003E\u003Cp\u003ESo, if you want to have the issues fixed, the best thing to do is nail them down and figure out exactly what is going on, making a complete report.\u003C/p\u003E\u003Cp\u003EOr just do nothing and wait for someone else to do it for you, both of these options are better than just saying that the mod is broken.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe some of it is just me, but no matter how hard i try to replicate a real world design, It doesn\u0027t fly half as good as it does in real life or don\u0027t work at all. Also straight wing aircraft are unstable or can\u0027t even turn. I tried to make A-10 (very, VERY maneuverable aircraft) few times looking excatly like the original and it was crap. My beautifully looking F-16 replica was a crap, my F-15 was a crap, my F-22 was a crap. FAR aerodynamics only work as they should for bulk, arrow shaped design. Center of lift is often found few meters behind the wings.\u003C/p\u003E\u003Cp\u003EEDIT: and what do you mean by \u0022lego parts\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T19:58:13Z\u0022 title=\u002205/26/2015 07:58  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by bartekkru99\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-05-26T20:28:33Z","Content":"\n\u003Cp\u003EIf you want examples how to build craft with FAR mod, better check official FAR craft exchange thread, link is in OP and in my signature.\u003C/p\u003E\u003Cp\u003EThere is a lot of things that could influence why your craft does not behave as you expect, there is not simple answer to your question because FAR is not simple mod. You need to understand it first, know how to use properly tools provided (graphs) and then you will start to enjoy it.\u003C/p\u003E\u003Cp\u003ENow, make some screenshots of your aircraft in SPH editor with graph files. Each of them. Then someone could help you with it. But post it in FAR exchange thread, not here, to help out ferram easier tracking of possible issues of mod.\u003C/p\u003E\u003Cp\u003EFor CKAN users, here is example \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106130-1-0-2-SETI-CommunityTechTree-Contracts-Greenhouse-BalanceMod?p=1973491\u0026amp;viewfull=1#post1973491\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ewhat kind of things could go wrong with CKAN\u003C/strong\u003E\u003C/a\u003E. Also example how to help yourself to iron out possible conflicts between various mods.\u003C/p\u003E\u003Cp\u003EIt is \u0022normal\u0022 that some mods are in conflict with each other, but it is not up to developer of any mod to find out which one can\u0027t be used with other.\u003C/p\u003E\u003Cp\u003EIt is up to user to find out conflict with few mods as possible to find out reason for some bug. In that way you could expect sooner that developers could find out possible reasons behind it and solve it.\u003C/p\u003E\u003Cp\u003EEven if they were not able to fix it, you can warn others to be aware what mod does not work well with other. But put some effort from your side into it, don\u0027t expect that everything could be solved just like that, soon as you noticed something and reported it.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T20:41:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kcs123\u0022 data-cite=\u0022kcs123\u0022\u003E\u003Cdiv\u003EIf you want examples how to build craft with FAR mod, better check official FAR craft exchange thread, link is in OP and in my signature.\u003Cp\u003EThere is a lot of things that could influence why your craft does not behave as you expect, there is not simple answer to your question because FAR is not simple mod. You need to understand it first, know how to use properly tools provided (graphs) and then you will start to enjoy it.\u003C/p\u003E\u003Cp\u003ENow, make some screenshots of your aircraft in SPH editor with graph files. Each of them. Then someone could help you with it. But post it in FAR exchange thread, not here, to help out ferram easier tracking of possible issues of mod.\u003C/p\u003E\u003Cp\u003EFor CKAN users, here is example \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106130-1-0-2-SETI-CommunityTechTree-Contracts-Greenhouse-BalanceMod?p=1973491\u0026amp;viewfull=1#post1973491\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ewhat kind of things could go wrong with CKAN\u003C/strong\u003E\u003C/a\u003E. Also example how to help yourself to iron out possible conflicts between various mods.\u003C/p\u003E\u003Cp\u003EIt is \u0022normal\u0022 that some mods are in conflict with each other, but it is not up to developer of any mod to find out which one can\u0027t be used with other.\u003C/p\u003E\u003Cp\u003EIt is up to user to find out conflict with few mods as possible to find out reason for some bug. In that way you could expect sooner that developers could find out possible reasons behind it and solve it.\u003C/p\u003E\u003Cp\u003EEven if they were not able to fix it, you can warn others to be aware what mod does not work well with other. But put some effort from your side into it, don\u0027t expect that everything could be solved just like that, soon as you noticed something and reported it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m using FAR for about a year... I\u0027m a veteran, I have made a lot of great planes and now they aren\u0027t half as good as they were, some don\u0027t even fly. And copying SSTO wing shape, won\u0027t help me design a fighter jet...\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-05-26T20:45:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EMaybe some of it is just me, but no matter how hard i try to replicate a real world design, It doesn\u0027t fly half as good as it does in real life or don\u0027t work at all. Also straight wing aircraft are unstable or can\u0027t even turn. I tried to make A-10 (very, VERY maneuverable aircraft) few times looking excatly like the original and it was crap. My beautifully looking F-16 replica was a crap, my F-15 was a crap, my F-22 was a crap. FAR aerodynamics only work as they should for bulk, arrow shaped design. Center of lift is often found few meters behind the wings.\u003Cp\u003EEDIT: and what do you mean by \u0022lego parts\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHold on a second, please.\u003C/p\u003E\u003Cp\u003EFirst of all, looking similar has very little to do with having the same flight characteristics.\u003C/p\u003E\u003Cp\u003EFor instance, take a look at the \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/f/f1/YF-22.jpg\u0022 rel=\u0022external nofollow\u0022\u003EYF-22\u003C/a\u003E and the \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/1/1e/F-22_Raptor_edit1_(cropped).jpg\u0022 rel=\u0022external nofollow\u0022\u003EF-22\u003C/a\u003E, even though they look alike, their flight characteristics are very different.\u003C/p\u003E\u003Cp\u003ENow don\u0027t tell me that if you make something that resembles a real life airplane on KSP it would actually behave like the real life counterpart, the precision goes much further than that.\u003C/p\u003E\u003Cp\u003EIn fact, something like moving the wings 10cm forward can kill a good design, but if you balance it properly you will have great results.\u003C/p\u003E\u003Cp\u003EIf you doubt me, check NathanKell\u0027s replicas, they are built and balanced to be as close to their real life counterparts as possible, and guess what, there is nothing wrong with their flight characteristics at all.\u003C/p\u003E\u003Cp\u003EFAR forces you to build arrowplanes, then how can you explain the airplanes that come bundled with it?\u003C/p\u003E\u003Cp\u003EMaking flyable airplanes on FAR is very easy, making good airplanes on FAR is quite a challenge.\u003C/p\u003E\u003Cp\u003ESo, from now on, instead of building it how you think it should be built, start doing it in a way that the information given about it says that it\u0027s right.\u003C/p\u003E\u003Cp\u003EKSP building is modular, \u0022lego parts\u0022 stand for premade parts that you use to assembly your vehicle, without any flexibility to their shapes.\u003C/p\u003E\u003Cp\u003EThese parts do not resemble sections of real life aircraft nor were made to have good aerodynamic proprieties.\u003C/p\u003E\u003Cp\u003ESo yes, building a replica is going to be a pain with stock parts.\u003C/p\u003E\u003Cp\u003ENow I recommend you to do one thing:\u003C/p\u003E\u003Cp\u003EFly one of the stock crafts I have made for the mod, FAR Blitzableiter, at Mach 0.7 (engine at 30%).\u003C/p\u003E\u003Cp\u003EThen, simply move/remove the Oscar-B bumps and try it again.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T20:45:46Z","Content":"\n\u003Cp\u003EOh and I\u0027ve found a bug, where, no aerodynamics are aplied to loaded craft and nothing in FAR window loads, when I want to toggle cross section curve or reload static analysis graph nothing shows up, I use CKAN by the way.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-05-26T20:51:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EOh and I\u0027ve found a bug, where, no aerodynamics are aplied to loaded craft and nothing in FAR window loads, when I want to toggle cross section curve or reload static analysis graph nothing shows up, I use CKAN by the way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen you should not be reporting it here, you should be reporting it at the CKAN thread.\u003C/p\u003E\u003Cp\u003EPick a fresh install and install the mod manually, without any other mods, if the bug persists explain exactly what you did and provide an output_log.\u003C/p\u003E\u003Cp\u003EOtherwise the report is of no use.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-05-26T21:08:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EHold on a second, please.\u003Cp\u003EFirst of all, looking similar has very little to do with having the same flight characteristics.\u003C/p\u003E\u003Cp\u003EFor instance, take a look at the \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/f/f1/YF-22.jpg\u0022 rel=\u0022external nofollow\u0022\u003EYF-22\u003C/a\u003E and the \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/1/1e/F-22_Raptor_edit1_(cropped).jpg\u0022 rel=\u0022external nofollow\u0022\u003EF-22\u003C/a\u003E, even though they look alike, their flight characteristics are very different.\u003C/p\u003E\u003Cp\u003ENow don\u0027t tell me that if you make something that resembles a real life airplane on KSP it would actually behave like the real life counterpart, the precision goes much further than that.\u003C/p\u003E\u003Cp\u003EIn fact, something like moving the wings 10cm forward can kill a good design, but if you balance it properly you will have great results.\u003C/p\u003E\u003Cp\u003EIf you doubt me, check NathanKell\u0027s replicas, they are built and balanced to be as close to their real life counterparts as possible, and guess what, there is nothing wrong with their flight characteristics at all.\u003C/p\u003E\u003Cp\u003EFAR forces you to build arrowplanes, then how can you explain the airplanes that come bundled with it?\u003C/p\u003E\u003Cp\u003EMaking flyable airplanes on FAR is very easy, making good airplanes on FAR is quite a challenge.\u003C/p\u003E\u003Cp\u003ESo, from now on, instead of building it how you think it should be built, start doing it in a way that the information given about it says that it\u0027s right.\u003C/p\u003E\u003Cp\u003EKSP building is modular, \u0022lego parts\u0022 stand for premade parts that you use to assembly your vehicle, without any flexibility to their shapes.\u003C/p\u003E\u003Cp\u003EThese parts do not resemble sections of real life aircraft nor were made to have good aerodynamic proprieties.\u003C/p\u003E\u003Cp\u003ESo yes, building a replica is going to be a pain with stock parts.\u003C/p\u003E\u003Cp\u003ENow I recommend you to do one thing:\u003C/p\u003E\u003Cp\u003EFly one of the stock crafts I have made for the mod, FAR Blitzableiter, at Mach 0.7 (engine at 30%).\u003C/p\u003E\u003Cp\u003EThen, simply move/remove the Oscar-B bumps and try it again.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf by lego parts you meant what you have just said, then I need to tell you, that I use a lot of different \u0022custom\u0022 parts I often use tail pieces as bi-couplers, I\u0027ve made my cockpit in very simlar manner to your Blitzableiter. I use a lot of offset and rotate tools to shape it\u0027s shapes (yeah I know it sound silly), so I would call it \u0022lego\u0022 by any means. I will upload my new design on craft exchange thread...\u003C/p\u003E\u003Cp\u003EEDIT: It\u0027s not that bad, has no serious issues, but I would call it a good plane...\u003C/p\u003E\u003Cp\u003EAnd oh F-22 and it\u0027s precursor, YF-22 can be distinguished really easily, F-15/F-15E or F/A-18/F/A-18F would be better examples.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-26T21:18:50Z\u0022 title=\u002205/26/2015 09:18  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by bartekkru99\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2015-05-26T21:55:17Z","Content":"\n\u003Cp\u003EThe no drag bug discussed here does not seem to depend on the method of installation. I am using the manual official installation procedure and it does happen to me sometimes anyway.\u003C/p\u003E\u003Cp\u003EIn fact it is beyond just the absence of drag. The plane behaves like a ballistic artillery shell like if there is no aerodynamics at all all the aerodynamic numbers in all menus show zero and the analysis interface stops operating. Like the whole mod just instantly stops operating completely.\u003C/p\u003E\u003Cp\u003EAlso it does happen without any other mods present.\u003C/p\u003E\u003Cp\u003EThe particular reproduction steps still seem undiscovered.\u003C/p\u003E\u003Cp\u003EJust play the game normally for some time causing voxelisation events changing the scenes and switching vessels. After some time spent in game without restarting it happens.\u003C/p\u003E\u003Cp\u003EDoes not seem to depend on what exactly you are doing. Same behavior as a classic memory issue. But instead of a game crash we get a mod crash.\u003C/p\u003E\n"}]}