{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":418,"Articles":[{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-01T13:00:05Z","Content":"\n\u003Cp\u003Eheres the Steps to reproduce far gimbal bug, so far 100% occurance rate.\u003C/p\u003E\u003Cp\u003EDelete local content from steam\u003C/p\u003E\u003Cp\u003EDelete folder from steamapps/common to ensure no possible leftovers\u003C/p\u003E\u003Cp\u003EReinstall Kerbal 1.0.4 from steam\u003C/p\u003E\u003Cp\u003EDownload fresh new up to date FAR zip\u003C/p\u003E\u003Cp\u003ECopy FerramAerospaceResearch and ModularFlightIntegrator folders from FAR zip along with the included Module manager 2.6.5 into Gamedata folder\u003C/p\u003E\u003Cp\u003EStart Kerbal Space Program from KSP.exe in root folder\u003C/p\u003E\u003Cp\u003EJust continue for the squad info sender... For consistency.\u003C/p\u003E\u003Cp\u003Edon\u0027t change any settings just for consistency.\u003C/p\u003E\u003Cp\u003ENew Game, just default sandbox\u003C/p\u003E\u003Cp\u003EGo to VAB Start with Mk1-2 pod stick a clampotron docking port on top\u003C/p\u003E\u003Cp\u003Ethen a 2.5 meter heatshield underneath.\u003C/p\u003E\u003Cp\u003Ethen decoupler\u003C/p\u003E\u003Cp\u003Ethen 2.5m inline battery\u003C/p\u003E\u003Cp\u003Ethen FL-R1 2.5m RCS tank\u003C/p\u003E\u003Cp\u003Ethen Rockomax x200-32 fuel tank. then poodle engine on the bottom\u003C/p\u003E\u003Cp\u003Ethen launch\u003C/p\u003E\u003Cp\u003EHack gravity and infinite fuel ect, 4x timewarp for main burn... to speed up test and get to a circular orbit of 150km\u003C/p\u003E\u003Cp\u003Ewhen stable 150km orbit reached with gravity unhacked, F5 quick save and turn infinite fuel off again. Turn retrograde, via SAS retrograde hold.\u003C/p\u003E\u003Cp\u003EThen start burning Retrograde. 4x timewarp with ALT \u002B . for physics timewarp out of atmosphere, just to speed up the test, bug happens whether timewarping or not.\u003C/p\u003E\u003Cp\u003EUnder 750ms orbit is where the bug happens, but it sometimes won\u0027t happen the first time, once accelerated retrograde to under 20ms, and bug has not happened. Load Quicksave F9 \u003C/p\u003E\u003Cp\u003Eand repeat the process and bug will usually happen. Once the bug happens it will always happen from then on.\u003C/p\u003E\u003Cp\u003ELoad quicksave, then space center and exit game.\u003C/p\u003E\u003Cp\u003ERestart game, load default save. Tracking station. Fly the gimbal/Far bug test ship again. Face and burn retrograde and repeat the experiment, at around 750ms the bug occurs again, No need for the quickload.\u003C/p\u003E\u003Cp\u003EIts almost like the act of quicksaving and quickloading changes something either in Far, the save or the game itself that gets the bug going, as it does not usually happen on the first launch.\u003C/p\u003E\u003Cp\u003EQuickload and return to space center and quit the game so the ship is back in testing position for next game restart\u003C/p\u003E\u003Cp\u003EQuit Kerbal space program\u003C/p\u003E\u003Cp\u003ENow remove The FerramAerospaceResearch and ModularFlightIntegrator folders from GAMEDATA. Leaving Module manager and it\u0027s files intact.\u003C/p\u003E\u003Cp\u003ENow start the game again. Load default save, Tracking station, fly Test ship. And repeat experiment.\u003C/p\u003E\u003Cp\u003ENow after Removal of the FAR folders the bug will never happen again.\u003C/p\u003E\u003Cp\u003ENow I\u0027m continuing to test to see if deleting the save and starting new makes the bug not happen like the first time before quickload, See if I can figure out where the change is that then makes that install of KSP have gimbals that are allergic to FAR.....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T13:24:28Z\u0022 title=\u002207/01/2015 01:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ExEvolution","CreatedById":93868,"CreatedDateTime":"2015-07-01T13:14:44Z","Content":"\n\u003Cp\u003EYou know, I had a ship act weird with gimbaling too, it started happening after I switched the direction of my orbit\u003C/p\u003E\u003Cp\u003EBy switching the direction, I mean I went up to apoapsis, then fired retrograde until I came back along my orbit in the direction I had just come from. I had to lock gimbaling on the engine to prevent the ship from spinning out of control after that. The engine was firing in a different direction than the ship\u0027s heading\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-01T14:48:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ExEvolution\u0022 data-cite=\u0022ExEvolution\u0022\u003E\u003Cdiv\u003EYou know, I had a ship act weird with gimbaling too, it started happening after I switched the direction of my orbit\u003Cp\u003EBy switching the direction, I mean I went up to apoapsis, then fired retrograde until I came back along my orbit in the direction I had just come from. I had to lock gimbaling on the engine to prevent the ship from spinning out of control after that. The engine was firing in a different direction than the ship\u0027s heading\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMight be related. The bug seems to happen in the orbital speed range between Over 200ms and under 750ms atleast when doing the test in kerbin orbit at 150K\u003C/p\u003E\u003Cp\u003EIf you reversed your orbit, You would have slowed yourself down into the speed range where the bug happens for your particular orbit at the time.\u003C/p\u003E\u003Cp\u003ETake it you are using KSP 1.0.4 and Newest FAR?\u003C/p\u003E\n"},{"CreatedByName":"ExEvolution","CreatedById":93868,"CreatedDateTime":"2015-07-01T15:05:49Z","Content":"\n\u003Cp\u003ECorrect\u003C/p\u003E\u003Cp\u003EAlthough the version number is correct, and even after multiple reinstalls it is correct, it still says 0.15.3.1 \u0022Froude\u0022 instead of 0.15.3.1 \u0022Garabedian\u0022 in the subtitle of the FAR window.\u003C/p\u003E\u003Cp\u003EI hope that\u0027s just an oversight in the current version, because I\u0027ve manually redownloaded the archive and completely deleted the FAR directory, and ModularFlightIntegrator 4 times just to make sure\u003C/p\u003E\u003Cp\u003EAlso, not sure if this is a FAR issue, but my small stack separator is not working. When I try to launch something using the small stack separator, one of the parts attached to the separator is instantly overheating on the launch pad and exploding\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T15:18:29Z\u0022 title=\u002207/01/2015 03:18  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by ExEvolution\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-07-01T15:25:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ExEvolution\u0022 data-cite=\u0022ExEvolution\u0022\u003E\u003Cdiv\u003EAlthough the version number is correct, and even after multiple reinstalls it is correct, it still says 0.15.3.1 \u0022Froude\u0022 instead of 0.15.3.1 \u0022Garabedian\u0022 in the subtitle of the FAR window.\u003Cp\u003EI hope that\u0027s just an oversight in the current version, because I\u0027ve manually redownloaded the archive and completely deleted the FAR directory, and ModularFlightIntegrator 4 times just to make sure\u003C/p\u003E\u003Cp\u003EAlso, not sure if this is a FAR issue, but my small stack separator is not working. When I try to launch something using the small stack separator, one of the parts attached to the separator is instantly overheating on the launch pad and exploding\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. I noticed that issue - it\u0027s fixed in the dev build\u003C/p\u003E\u003Cp\u003E2. not a FAR issue, small parts overheat quickly (stock bug).\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-01T17:31:10Z","Content":"\n\u003Cp\u003EOk I\u0027ve spent a couple of hours testing this issue, more information and test results. \u003C/p\u003E\u003Cp\u003ETurns out that the change, whatever it is, is affecting the save. And not the whole save, just on a per ship basis. \u003C/p\u003E\u003Cp\u003EAnd the ships engine gimbal works fine in the presence of FAR during the certain velocity range where it would usually have the issue until the change to the ship actually happens. When the change happens, that then makes that ships engine gimbal react badly to far but the \u0022change\u0022 only seems to occur upon leaving and returning to the ship in any way, including returning to space center then comming back to it via the tracking station as well as quick-save/load, they both do the same thing.\u003C/p\u003E\u003Cp\u003EAlso, Removing only the FerramAerospaceResearch folder alone does not stop the \u0022changed\u0022 ship wigging out after restarting the game, returning to it and re-running the Standard test outlined earlier.\u003C/p\u003E\u003Cp\u003EBut removing only the ModularFlightIntegrator folder and leaving the FerramAerospaceResearch folder in place DOES stop the gimbal bug happening, so the issue may have a connection to the ModularFlightIntegrator folders contained functions.\u003C/p\u003E\u003Cp\u003EHeres the notes I jotted down detailing each step and wave of testing and test results up to these conclusions in case theres anything that might give a clue to the cause of the problem to more knowledgable minds than my own.\u003C/p\u003E\u003Cp\u003ENew save and new FAR, Test Result: bug doesn\u0027t happen 1st time again but after quickload it happens every time\u003C/p\u003E\u003Cp\u003ESame save, but new far, Test Result: bug happens 1st time\u003C/p\u003E\u003Cp\u003ENew save and same Far, Test Result: Bug does not happen 1st time but happens after quickload\u003C/p\u003E\u003Cp\u003ETaking away ModularFlightIntegrator folder, Result: stops bug, far breaks\u003C/p\u003E\u003Cp\u003E{{{Taking away FerramAerospaceResearch folder, Interesting Result! only breaks FAR, or atleast it\u0027s Icon is not showing up. But the bug remains in testing, So it\u0027s something to do with ModularFlightIntegrator folder perhaps? }}}\u003C/p\u003E\u003Cp\u003E{{{ Download fresh new KSP without installing FAR or Dependencies, Run game and make save, launch test ship into 150k Orbit, QuickSave and Load then exit game THEN Add far And then restart game, switch to test ship from tracking station and run experiment again.. Test result: Bug happens first time! }}}\u003C/p\u003E\u003Cp\u003EConclusion: Far is not making the Change, the change, whatever it is, that causes the gimbal bug every time in the presence of far even occurs when FAR is not present, Perhaps quicksaving or quick loading causes the change and the change then gives gimbals their FAR allergy... Which then only flares up when FAR is present.\u003C/p\u003E\u003Cp\u003ESee what happens if Quicksave is deleted, Result: Bug still happens\u003C/p\u003E\u003Cp\u003EWhat if another test ship is launched after the first has been quicksaved, loaded and bugged out? does it also bug out first time? Test Result: It does not bug out First time! Its per ship rather than per save!\u003C/p\u003E\u003Cp\u003EOk now if after first test of new craft and no bug out, what if return to space center to in order to discard changes and restore to starting position WITHOUT using quick-load, and then returned to via tracking station does it bug out ala as if it had been quickloaded? Test result: Yes it still wigs out, it had been quicksaved, but not quickloaded....\u003C/p\u003E\u003Cp\u003EConclusion: Quickload is not directly causing the change to the in flight craft that breaks it\u0027s gimbal at certain speeds in the presence of FAR\u003C/p\u003E\u003Cp\u003EWhat if again but no quick-load OR quicksave? Test result: Gimbal works just fine from launch to test ending in one take without leaving craft and returning via quick load or tracking station , but once left to space center without saving and reloaded and test run again it wigs out under 750ms, Confirmed 2x\u003C/p\u003E\u003Cp\u003EConclusion: Quicksave and quickload are not alone in causing the change. Leaving the craft and reloading at all causes the change... Do not know if it is the leaving or the returning that causes the change that then causes gimbal\u0027s issue with far. But cannot test if leaving is the sole cause because would have to load back in to test theory so both conditions would be met on any test. Perhaps examining The ship in save file previous to leaving, then comparing again after leaving ship in game and looking for changes... \u003C/p\u003E\u003Cp\u003EGranted, the apparent frequency at which we\u0027d find ourselves dumpster-diving was a big part of why. Anyhow, as you\u0027ve probably figured out at this point, we now need your help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T21:29:23Z\u0022 title=\u002207/01/2015 09:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-01T23:00:24Z","Content":"\n\u003Cp\u003EAlright, so here\u0027s the tests you\u0027re gonna do. You\u0027re gonna test:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWhether this also affects control surfaces. Make sure you check against the normal deflection angle to be sure.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhether the control input indicators in the bottom left move as they should.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf it doesn\u0027t affect the control input indicators then the error is somewhere in the stock gimbal code, which means that there is nothing I can do to fix it.\u003C/p\u003E\u003Cp\u003EYou\u0027re also going to post your logs the \u003Cem\u003Ecomplete\u003C/em\u003E logs, nothing stripped out at all, as well as a complete and exhaustive modlist with versions. No CKAN, if that\u0027s involved at all, you\u0027re on your own.\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-01T23:25:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAlright, so here\u0027s the tests you\u0027re gonna do. You\u0027re gonna test:\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWhether this also affects control surfaces. Make sure you check against the normal deflection angle to be sure.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhether the control input indicators in the bottom left move as they should.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf it doesn\u0027t affect the control input indicators then the error is somewhere in the stock gimbal code, which means that there is nothing I can do to fix it.\u003C/p\u003E\u003Cp\u003EYou\u0027re also going to post your logs the \u003Cem\u003Ecomplete\u003C/em\u003E logs, nothing stripped out at all, as well as a complete and exhaustive modlist with versions. No CKAN, if that\u0027s involved at all, you\u0027re on your own.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill do. Also the bug happens on fresh newly downloaded 32 bit 1.0.4 KSP with fresh new sandbox save and with only \u0022FAR 0.15.3.1 Garabedian\u0022 installed and does not happen without FAR installed.\u003C/p\u003E\u003Cp\u003ENo CkAN, would not touch with barge pole, Much prefer manual install of Mods, making a new folder of KSP with each addition/change build 1, build 2 ect...\u003C/p\u003E\n"},{"CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-07-01T23:48:54Z","Content":"\n\u003Cp\u003EJust to confirm I\u0027m having the same problem as GorillaZilla on my builds.\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-02T00:10:40Z","Content":"\n\u003Cp\u003EAlrighty then!\u003C/p\u003E\u003Cp\u003EResults are in...\u003C/p\u003E\u003Cp\u003E1. Is not affecting control surfaces, Came down backwards into the atmosphere so the control surfaces would activate. Control surfaces were deflecting in the right direction as expected, Gimbal was always dead wrong opposite to the control surfaces (yes I know about the control surfaces are also going to be trying to push ships heading wrong due to going backwards but their deflection is as expected wheres the gimbal is opposite of expected) and if engine was turned on would flip the rocket out of control. Gimbal was as usual only becomming reversed when facing prograde with the back of the ship facing into the current vector. About 20 degrees from facing directly prograde is when the Gimbal becomes reversed.\u003C/p\u003E\u003Cp\u003EAnd the gimbal always flips back to normal function when you turn far enough away from retrograde wheres the control surfaces remain consistant at all times.\u003C/p\u003E\u003Cp\u003E2. Seems not, the control indicators always align with my input or the SAS trying to turn the correct way to face retrograde. The gimbal is reversing on it\u0027s own accord separate from the reaction wheels in the pod.\u003C/p\u003E\u003Cp\u003EHeres the log. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/85344120/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/85344120/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWas as usual a fresh install of KSP 1.0.4 from steam. With only FAR\u0027s 2 folders and Module manager 2.6.5 in the gamedata folder alongside the Squad folder. Contents of the log are from First game start, New save. VAB, build test rocket. Launch rocket, Infinite fuel on then hack gravity on launchpad, throttle up engine start. achieve 150k circular orbit then disable hack gravity and infinite fuel and a couple quick saves. Then First retrograde burn to under 750ms for the first time for that ship, where the bug never happens. Then quickload and repeat the retrograde burn down to the 750ms mark where the bug now starts and always happens from that point test after test. Then impact with the Sea.\u003C/p\u003E\u003Cp\u003EAs Ferram says, this may be an issue we have discovered with the current stock gimbal code that breaks the stock gimbals when FAR is present.\u003C/p\u003E\u003Cp\u003EAye, wierd bug isn\u0027t it Jeef? How are you being effected by it in your game?\u003C/p\u003E\u003Cp\u003EAlso don\u0027t let anything like this get you Down Ferram, Your work on this Aerodynamics model replacement in Kerbal Space Program is amazing, and I see you everywhere in the forum generally kicking butt and making the \u0022leaky bucket\u0022 that is KSP better a Bit at a time. I\u0027m not very good at saying things like this, always a bit awkward. But I just want to let you know how much what you do is appreciated, And don\u0027t let anyone who makes light of your hard work, or feels a false sense of entitlement as if they have paid you to make this mod for them ect get you down either aye \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis goes for all the Talented dedicated modders who work on KSP and other games also :-)\u003C/p\u003E\u003Cp\u003EMakes sense to support those who fight to make your world better aye?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T00:36:58Z\u0022 title=\u002207/02/2015 12:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-02T00:39:57Z","Content":"\n\u003Cp\u003EAlright! So that points to something related to how the stock gimbal code works. No exceptions in the log, so nothing\u0027s terminating early to cause the issue.\u003C/p\u003E\u003Cp\u003ETry this: Build a rocket with some engines in a conventional pusher arrangement, and some engines in a tractor arrangement (make sure it\u0027s well in front of the CoM), both to push the vehicle prograde. Also add a set of pusher and tractor engines for retrograde. See what happens, just for completeness; this will help exclude any CoM-related issues.\u003C/p\u003E\u003Cp\u003ESo part of me wonders if this is due to something being shifted to Flight Integrator that Modular Flight Integrator doesn\u0027t include. I\u0027ll investigate the code, but I have no idea at this moment.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-07-02T01:09:16Z","Content":"\n\u003Cp\u003Eferram4, just a heads-up that Jeef\u0027s a KSPwin64 user.\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-02T01:22:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAlright! So that points to something related to how the stock gimbal code works. No exceptions in the log, so nothing\u0027s terminating early to cause the issue.\u003Cp\u003ETry this: Build a rocket with some engines in a conventional pusher arrangement, and some engines in a tractor arrangement (make sure it\u0027s well in front of the CoM), both to push the vehicle prograde. Also add a set of pusher and tractor engines for retrograde. See what happens, just for completeness; this will help exclude any CoM-related issues.\u003C/p\u003E\u003Cp\u003ESo part of me wonders if this is due to something being shifted to Flight Integrator that Modular Flight Integrator doesn\u0027t include. I\u0027ll investigate the code, but I have no idea at this moment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk interesting results for the first test, Slapped on a set of Tractors on the Standard test ship\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot0_zpsgjlsbbtv.png\u0022 alt=\u0022screenshot0_zpsgjlsbbtv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen under 750 ms orbit after the ship has \u0022changed\u0022\u003C/p\u003E\u003Cp\u003EIf pointing retrograde, The Poodle on the bottom reverses and tries to turn the ship out of control away from retrograde, But the 2 MK55s remain functioning normally have almost the same thrust but higher gimbal range, and I\u0027ve put their nozzles an equal distance from the center of mass as the poodle. So they overpower the misbehaving Poodle and keep the ship pointing retrograde.\u003C/p\u003E\u003Cp\u003ENow heres the interesting bit, if you try to turn to prograde, now the Mk55s misbehave and reverse when your nose nears pointing prograde. and its the poodle that behaves and functions normally but is overpowered by the stronger thrust vectoring on the MK55s... And the ship\u0027s nose is repelled from pointing Prograde.\u003C/p\u003E\u003Cp\u003EAs for the \u0022 Also add a set of pusher and tractor engines for retrograde. See what happens, just for completeness; this will help exclude any CoM-related issues.\u0022 bit does that mean you also want a ship like this tested?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot1_zpsoxmafcfh.png\u0022 alt=\u0022screenshot1_zpsoxmafcfh.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T01:37:46Z\u0022 title=\u002207/02/2015 01:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-02T01:27:56Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@sumghai: \u003C/strong\u003EI\u0027m aware; I was involved in the latest win64 thread in General Discussions. Thanks for the heads up anyway.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@GorillaZilla: \u003C/strong\u003EUmm.... what?! Okay, wait, the actual orientation of the vehicle matters? Oh, that\u0027s bad. That\u0027s real bad. It\u0027s measuring something from a bad CoM, I think. If you\u0027re shooting it straight up to test, you should be able to get the results to reverse after going around the planet 180 degrees. Or nearly. Depends on where the coordinate system origin is located, I think.\u003C/p\u003E\u003Cp\u003EYes, please test that rocket as well.\u003C/p\u003E\n"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-07-02T01:45:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeeF\u0022 data-cite=\u0022JeeF\u0022\u003E\u003Cdiv\u003EJust to confirm I\u0027m having the same problem as GorillaZilla on my builds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe too\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-02T01:45:27Z","Content":"\n\u003Cp\u003EI\u0027m starting the test at a 150K eastwards orbit and just burning retrograde till I hit 750ms and the gimbal bug kicks in.\u003C/p\u003E\u003Cp\u003ERightio this is the last test for tonight, need to get up in the morning \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe puller \u002B pusher \u002B puller \u002B pusher Mostly cancels out all the forces as the gimbals all seem to counter each other and you almost end up crabbing a little. This view is down looking down on the Upper side of the Mk1-2 capsule, The tanks are empty and I\u0027m using infinite fuel so I have an unchanging COM\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot4_zpsljmvmoyh.png\u0022 alt=\u0022screenshot4_zpsljmvmoyh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPoor gusfred isnt happy with this gimbal problem either, Can\u0027t blame him either as the thing is shaking like it\u0027s doing the truffle Shuffle.....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://media.giphy.com/media/Q56SF4czEtSZG/giphy.gif\u0022 alt=\u0022giphy.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T02:16:32Z\u0022 title=\u002207/02/2015 02:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-02T02:33:24Z","Content":"\n\u003Cp\u003EAlright, thanks; still no idea, but we\u0027ll see. When you get a chance, can you summarize all of it in a bulletpoint format for causing it and how things react? If I manage to find a fix I wanna have all the possible variations to test simply.\u003C/p\u003E\n"},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-07-02T03:07:18Z","Content":"\n\u003Cp\u003EHey ferram4,\u003C/p\u003E\u003Cp\u003EI am also having the gimbal bug. My thread is here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127386-v1-0-4-Gamebreaking-Gimbal-Bug-with-Video\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/127386-v1-0-4-Gamebreaking-Gimbal-Bug-with-Video\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI included logs and a video. I won\u0027t clutter your thread further but I wanted to say if you need any help from me resolving this bug then I\u0027d be happy to help.\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\n"},{"CreatedByName":"ExEvolution","CreatedById":93868,"CreatedDateTime":"2015-07-02T03:20:13Z","Content":"\n\u003Cp\u003EI\u0027m not though and I\u0027ve experienced the same gimballing issue\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-07-02T05:35:42Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cstrong\u003EMod Note: Just a note that any issues CKAN users encounter should be posted in the \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127492-FAR-via-CKAN-Support-Thread\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cstrong\u003EFAR via CKAN Thread\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/a\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cstrong\u003E not here, and that mods will be moving any such posts made here.\u003C/strong\u003E\u003C/span\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mjn33","CreatedById":143470,"CreatedDateTime":"2015-07-02T08:41:03Z","Content":"\n\u003Cp\u003EI just want to add, doing a quick test on a fresh install, I was able to reproduce this issue using the following mods at the time:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EModuleManager\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EModularFlightIntegrator\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHyperEdit\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt required reloading a quicksave made before the retrograde burn. To me this suggests an issue with ModularFlightIntegrator since I never used FAR for that install at all, and removing ModularFlightIntegrator allowed me to load the save without the issue occurring. Can anyone also verify this?\u003C/p\u003E\u003Cp\u003EOne other thing, the fact that this issue happens at about 750m/s makes me think Krakensbane might be related in some way.\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-02T11:39:54Z","Content":"\n\u003Cp\u003EI can confirm that mjn33, removing the ModularFlightIntegrator stops the bug happening....\u003C/p\u003E\u003Cp\u003EAlso I don\u0027t think module manager is involved, The bug happens with just the ModularFlightIntegrator folder and the squad folder without module manager or files in GameData.\u003C/p\u003E\n"},{"CreatedByName":"abowl","CreatedById":110827,"CreatedDateTime":"2015-07-02T12:08:37Z","Content":"\n\u003Cp\u003ESomeone (Squad) should find the time and/or means to give this guy some money/award. The mod is several years old. And its always super maintained it seems. If squad went out of their way to do this, or set up a small program/event/award for similar modders it will be a world first. And i think it will reflect positively on sales etc. Hows that Maxmaps? Instead of conjuring deals with the devil (curse, sony etc.) for mo money flows why not do something that really affects the community and would give positive PR? Thanks\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-07-02T12:32:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022abowl\u0022 data-cite=\u0022abowl\u0022\u003E\u003Cdiv\u003ESomeone (Squad) should find the time and/or means to give this guy some money\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever rely on a corporation to do something that you can do for yourself: \u003Ca href=\u0022https://www.paypal.com/us/cgi-bin/webscr?cmd=_flow\u0026amp;SESSION=lPmsxS51MVW9-J63DiEy065rWDARfuSYTSKrLCFZ3UJDBSMvVTmQVZgn3mS\u0026amp;dispatch=5885d80a13c0db1f8e263663d3faee8de6030e9239419d79c3f52f70a3ed57ec\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.paypal.com/us/cgi-bin/webscr?cmd=_flow\u0026amp;SESSION=lPmsxS51MVW9-J63DiEy065rWDARfuSYTSKrLCFZ3UJDBSMvVTmQVZgn3mS\u0026amp;dispatch=5885d80a13c0db1f8e263663d3faee8de6030e9239419d79c3f52f70a3ed57ec\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-02T13:17:54Z","Content":"\n\u003Cp\u003E\u002B1 Aye, Most mods have a donate button on their opening post. \u003C/p\u003E\u003Cp\u003EIts a great way of saying,\u003C/p\u003E\u003Cp\u003E\u0022Yes I like this, Make it better and keep it updated and working when kerbal updates break it!\u0022 \u003C/p\u003E\u003Cp\u003Emakes so much sense to voluntarily support those who work hard just to make the world better for you :-)\u003C/p\u003E\u003Cp\u003ECut out the exploitative middle men and get the money straight to the people actually WORKING hard and creating tangible wealth for our civilization....\u003C/p\u003E\u003Cp\u003EReminds me of this, Just for other things than music too...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://potholesinmyblog.com/the-state-of-the-music-industry-in-comic-form/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://potholesinmyblog.com/the-state-of-the-music-industry-in-comic-form/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOk heres an interesting thing, If you make a Symetrical ship like this, with the center of thrust and center of mass line up perfectly....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot1_zpsyrmlvqex.png\u0022 alt=\u0022screenshot1_zpsyrmlvqex.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen the bug happens the thrust vectoring Gimbals at one end counter perfectly the thrust vectoring at the other end... Equalling no net rotation force, Just disable the reaction wheel in the command pod...\u003C/p\u003E\u003Cp\u003EWhen your under 750ms and over 200ms, whenever your nose aproaches either retrograde or prograde you loose all turning power and your rotation just drifts gently across the area near pro/retro grade untill it gets to the other side and you regain rotation force control as the gimbals begin to function normally again\u003C/p\u003E\u003Cp\u003EIt seems that when in the bug speed range, if you face retrograde then the gimbals behind the center of mass misbehave and reverse vectroring direction but the gimbals ahead of the COM continue to function normally, so top gimbals try to turn you left, and bottom gimbals try to turn you right and cancel each other out.\u003C/p\u003E\u003Cp\u003ESame thing for pointing prograde, then the gimbals AHEAD of the center of mass misbehave and its now the gimbals behind the center of mass that function normally. again canceling each other out.\u003C/p\u003E\u003Cp\u003EFor a bug, this thing is really elegant and precise X-)\u003C/p\u003E\u003Cp\u003EThis isn\u0027t just any bug..... This is an M\u0026amp;S bug\u003C/p\u003E\u003Cp\u003EAlso, you can start this bug soon after launch. Just launch. Quicksave then load. Now when you Get over about 100ms the bug kicks in.\u003C/p\u003E\u003Cp\u003EKicking myself for not thinking of it as soon as I knew it was Loading the ship either from quicksave or tracking station that enabled the bug, and could do that on the launchpad even before taking off.... \u003C/p\u003E\u003Cp\u003EI noticed it only needs a min speed of 100ms for the bug to kick in while low in the atmo, like just after launch\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T18:35:03Z\u0022 title=\u002207/02/2015 06:35  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"}]}