{"TopicId":193571,"ForumId":32,"TopicTitle":"Little assistance with Transfer Window Planner","CreatedByName":"Zatie12","CreatedById":57823,"CreatedDateTime":"2020-05-03T10:22:18Z","PageNum":1,"Articles":[{"CreatedByName":"Zatie12","CreatedById":57823,"CreatedDateTime":"2020-05-03T10:22:18Z","Content":"\n\u003Cp\u003E\nHi Community\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m attempting to perform a transfer from Kerbin (4000km circular orbit) to Duna using Transfer Window Planner. I\u0027ve followed the instructions, but the computed mode doesn\u0027t seem to get anywhere close. Screenshot attached. Just wondering if anyone knows what I\u0027m doing wrong!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Of9ECcU.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Of9ECcU.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThanks :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"purpleivan","CreatedById":120081,"CreatedDateTime":"2020-05-03T12:23:35Z","Content":"\n\u003Cp\u003E\nThe first thing that comes to mind is do you have your manouver node at the point in your orbit to give the right ejection angle. In the Transfer Window Planner GUI, the button to display it (Show Ejection Angles) isn\u0027t turned on. If you\u0027ve not used that info, turn it on and look for the ejection angle display in the map view.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-05-03T13:21:13Z","Content":"\n\u003Cp\u003E\nThis should probably be in the \u0027tech support- modded installs\u0027 section of the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nYour node is probably in the wrong place, to travel out from the Sun you need to have the maneuver node positioned so that you burn \u0027forwards\u0027 relative to the Sun and exit the planet\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E ahead of it; to travel towards the Sun the opposite is true and you need to position the node to burn \u0027backwards\u0027 relative to the Sun. Going somewhere that\u0027s orbiting the Sun higher than where you are almost always requires the node to be on the night side of the planet, so watch out for that if you\u0027re using ion thrusters as your solar panels won\u0027t help you!\n\u003C/p\u003E\n"},{"CreatedByName":"RoninFrog","CreatedById":203049,"CreatedDateTime":"2020-05-05T00:37:27Z","Content":"\n\u003Cp\u003E\nYou seem to be in a pretty high orbit, so you\u0027re gonna want to burn on the night side of Kerbin (assuming you are orbiting in a normal direction).\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  Actually, that might not work too well.  Just scoot that node further along your orbit until your Kerbol (Sun) Periapsis is near Kerbin.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-05T00:40:56Z\u0022 title=\u002205/05/2020 12:40  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 5, 2020\u003C/time\u003E by RoninFrog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-05-05T00:57:05Z","Content":"\n\u003Cp\u003E\nSpecifically, the time in Transfer Window Planner is the *ideal* time to burn, *assuming* that your ship is in the right place at that time. What you want to do is drag your maneuver node forward or back in your orbit around Kerbin so that it\u0027s closest to that *ideal* time, while being correctly placed in relation to Kerbin and Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nTransfer Windows are just that - windows. They don\u0027t have to be performed exactly at the center to be effective. You have wiggle room with time, but not so much with your ship\u0027s placement around Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2020-05-05T01:13:38Z","Content":"\n\u003Cp\u003E\nIf you want one-click transfers and are willing to try other mods, you might like Astrogator (left banner in my forum signature, also on \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E). It handles the \u0022where is your ship in its orbit\u0022 factor.\n\u003C/p\u003E\n"}]}