{"TopicId":193561,"ForumId":44,"TopicTitle":"Detatchable fuel lines using pressure driven oval gear flow meters","CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-02T18:42:34Z","PageNum":1,"Articles":[{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-02T18:42:34Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 width=\u0022459\u0022 data-embed-src=\u0022https://www.youtube.com/embed/ERXYcVjVHrA?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/mOpNVsVV4_w?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIn order to achieve asparagus staging.\n\u003C/p\u003E\n\u003Cp\u003E\nMy idea is to create a vertical spline driving a series of stacked oval gear flow meters arranged in a stack.  The ovals in one layer must rotate in a fixed ratio to those in a layer below.  \n\u003C/p\u003E\n\u003Cp\u003E\nThis creates a governor regulating fuel flow through all the stages of the rocket.  \n\u003C/p\u003E\n\u003Cp\u003E\nBy itself each rocket must be able to pressurize and deliver all its fuel to its engine (if we want reusability).\n\u003C/p\u003E\n\u003Cp\u003E\nThere is also a gear train for each inner stage governing that fuel allowed to flow in is exactly the same as fuel flowing out.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn a 7 stem rocket (6 side boosters and a central stage).  The outer ones also have a gear where the fuel flowing to other stages is exactly equal to  5/2 the fuel flowing to their engine, and the fuel leaving their tank is 7/2.  (for the next stages  5/2 from tank, 3/2 to fuel lines and then  3/2 from tank, 1/2 to fuel lines.\n\u003C/p\u003E\n\u003Cp\u003E\nHow massive is such a system?  I don\u0027t know but the increased \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E from asparagus staging is so enormous that a very heavy governor on side boosters that land and are reused can be justified.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2020-05-03T14:41:38Z","Content":"\n\u003Cp\u003E\nIt isn\u0027t all that clear how useful asparagus staging would be in real life.  In an ideal case, asparagus staging gives you the thrust of your second (or higher) stage for free.  No more.\n\u003C/p\u003E\n\u003Cp\u003E\nIn practice, this is ideal for booster/sustainer designs where the sustainer stage can fire \u0022for free\u0022 and not carry any excess \u0022empty propellant mass\u0022 until it stages.  This really isn\u0027t a major factor in going to space (although any extra thrust while your boosters are firing is almost always helpful).  It also means making sure your sustainer nozzle can operate down to sea level (or launch altitude).\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I understand, a major force in the booster/sustainer model was avoiding in-flight ignition.  Don\u0027t expect such a rocket to launch until all boosters are ignited (the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E isn\u0027t high enough).\n\u003C/p\u003E\n\u003Cp\u003E\nAsparagus staging got a huge boost from KSP players as KSP has artificially heavy fuel tanks (to compensate for the tiny planet, which in turn reduces the time required to get to orbit).  It also helped that for pre-release versions of KSP, the aerodynamic model favored \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E=2.0 the whole way up.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, the Dynetics lander has drop tanks, a technology essentially similar to asparagus staging except it doesn\u0027t waste the engines.  This can be used in a manner similar to \u0022bamboo staging\u0022 (except that traditional \u0022bamboo staging\u0022 is unstable: you have to stop, turn, and eject fuel tanks from the top and not the bottom if you want to make a stable rocket) that allows multiple \u0022stages\u0022 to use the same engine (saving both mass and cost on your engines.  Just don\u0027t expect much in the way of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E).\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-05T18:14:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223779963\u0022 data-ipsquote-contentid=\u0022193561\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221588516898\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/3/2020 at 9:41 AM, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt isn\u0027t all that clear how useful asparagus staging would be in real life.  In an ideal case, asparagus staging gives you the thrust of your second (or higher) stage for free.  No more.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorta... but some other details matter.  For example, we can effectively throttle down before Max-Q by separating stages rather than cutting engine power.  Reducing drag at the same time by the way.  In real life we may be chasing a gain of around 1-5% of total \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.  That is still well worth it if the engineering is trustworthy.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also wanted to mention about oval gear flow meters.  They could be powered by pressurizing the outer boosters.  The pressure on one oval gear mechanism drives the train.  While coupled by shafts we have pressure driven flow control  Upon booster separation the gear shafts can decouple and one is braked.  A braked gear is basically a closed valve. If the fuel lines simply break away from one side of the flowmeter mechanism while the shaft is locked then everything will be fine.  \n\u003C/p\u003E\n\u003Cp\u003E\nHow much does it weigh?  It must weigh more than purely a pressure driven rocket.  But the rotating machinery may be in similar ballpark to a turbocharger pump, and less than an electrically driven pump.  \n\u003C/p\u003E\n"}]}