{"TopicId":194046,"ForumId":16,"TopicTitle":"What\u0026#039;s wrong with this plane?","CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2020-05-21T21:18:22Z","PageNum":1,"Articles":[{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2020-05-21T21:18:22Z","Content":"\n\u003Cp\u003E\nHi, I recently started playing KSP again 2-3 years. To change things a little I decided to use the unkerballed start mod, among a bunch of others, so I can sorta focus on planes before attempting going to space. I never was an expert in planes, or the game in general, but my planes flew ok. However I now seem to be able to build a plane. I had this kinda basic design and have added some stuff in hopes of lifting off, but no luck. I have the issue where the plane after reaching certain speed violently turns to one side, lose control of it and crash. If I try to correct shortly before this then the plane turns violently to the other side and same result.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are the pics and a short video of my general experience \u003Ca href=\u0022https://imgur.com/a/lgdY8J8\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/lgdY8J8\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAppreciate any help you can give me.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Forgot to mention that I tried the solutions on the FAQ, granted I could still have done it wrong.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-21T21:42:05Z\u0022 title=\u002205/21/2020 09:42  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 21, 2020\u003C/time\u003E by Jofe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2020-05-21T22:00:47Z","Content":"\n\u003Cp\u003E\nHello \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/101640-jofe/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022101640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/101640-jofe/\u0022 rel=\u0022\u0022\u003E@Jofe\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPlanes are kind of hard in general, and with the simplified aerodynamics and wheel physics in this game it\u0027s not particularly easy to tell why things go wrong. But here are a few tips for difficulties such as yours.\n\u003C/p\u003E\n\u003Cp\u003E\nYour wheels may be bouncing due to the roughness of the Level 1 runway. If you can\u0027t upgrade the runway, it will probably be easier to just roll over to the grass next to it which is actually much smoother than the runway at this level.\n\u003C/p\u003E\n\u003Cp\u003E\nAny time there is a small variation in sideways momentum (perhaps by over correction) it begins to induce a rolling motion. That\u0027s because the mass of the plane is always higher than the wheels and it will tip to the side a bit. Once this starts happening then one wing goes lower than the other and the air pushes down on that lower wing more which only increases the roll to one side. It will be very difficult to recover from that and you want to prevent it, for sure. It\u0027s even possible that the reaction wheel inside that cockpit is turning the plane too aggressively, causing inertia to roll the plane over onto its side. Try going into the game settings menu and put the wheel steering axis on a different set of keys from the yaw axis. Or maybe just right click the cockpit and disable the reaction wheel on it until you can get off the ground. Whatever you do, don\u0027t mash the \u0022A\u0022 or \u0022D\u0022 keys - just tap them very slightly, preferably with the CAPS-lock on which will give you finer control.\n\u003C/p\u003E\n\u003Cp\u003E\nThere probably isn\u0027t enough friction on the back wheel to keep the tail from skidding around. You can right-click the back wheel and find the option for wheel friction. Turn that value up to about 3 and maybe even turn down the friction on your front wheels. This option might not show up if you don\u0027t have \u0022Advanced Tweakables\u0022 turned on from the game settings. I ALWAYS do this with my planes and rovers. Just assume that you have to turn the friction up for ALL rear wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nThe design of your plane is very unconventional since there is no horizontal stabilizer in the rear. I think you are going to have to experiment with different angles on your wings and canard to really fine tune the aerodynamic performance of the plane. It\u0027s possible that since your main wings are placed very far back that the rear wheel is lifting off the ground thereby robbing you of any wheel steering control (those front wheels don\u0027t have steering.) This leaves you with the vertical rudder doing all your steering which may be greatly overcompensating.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd lastly, I would encourage you to explore a technique for adding what\u0027s called a positive angle of incidence to your wings. This means that you very slightly rotate your wings so that the leading edge is just a tiny degree higher than the trailing edge (as seen from the side.) What this does is gives you a little extra lift even when the plane is aiming perfectly level. It makes it much easier to perform short take off and landings, but it will change the center-of-lift so needs to be balanced carefully.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully, a few of these suggestions will help.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-21T22:35:58Z\u0022 title=\u002205/21/2020 10:35  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 21, 2020\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2020-05-21T22:19:03Z","Content":"\n\u003Cp\u003E\nI\u0027ll try the the suggestions you made to see if I make it. Would really like to approach the order of events in a more similar to what happened in real life kinda way. Thank you\n\u003C/p\u003E\n"},{"CreatedByName":"Caradhtinu","CreatedById":204660,"CreatedDateTime":"2020-05-21T22:40:38Z","Content":"\n\u003Cp\u003E\nJust to make sure, do you have \u0022invert steering\u0022 set on that wheel? Sometimes that can wreck havoc as \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E tries to correct only making things worse.\n\u003C/p\u003E\n\u003Cp\u003E\nYou may already know this, but for some reason the landing strip is bumpier than the surrounding grassland. When I have a twitchy plane I turn around and taxi away so I can takeoff from even ground.\n\u003C/p\u003E\n"},{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2020-05-21T23:17:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223789049\u0022 data-ipsquote-contentid=\u0022194046\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590100838\u0022 data-ipsquote-userid=\u0022204660\u0022 data-ipsquote-username=\u0022Caradhtinu\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Caradhtinu said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust to make sure, do you have \u0022invert steering\u0022 set on that wheel? Sometimes that can wreck havoc as \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E tries to correct only making things worse.\n\u003C/p\u003E\n\u003Cp\u003E\nYou may already know this, but for some reason the landing strip is bumpier than the surrounding grassland. When I have a twitchy plane I turn around and taxi away so I can takeoff from even ground.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, that part at least was fine. \n\u003C/p\u003E\n\u003Cp\u003E\nI got partial success now. Moved some parts, changed the friction of the tail wheel, added a stabilizer on the rear and the plane at least doesn\u0027t lose control in that way anymore. Now I\u0027m having issues to lift off, I can get air if I reach the end of the runway or a bump in the road but can\u0027t lift off in a, errmmmm, \u0022normal\u0022 way. The plane controls okish, but it tries to nose dive into the ground. Still a lot better than going to one side and exploding. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Klapaucius","CreatedById":181256,"CreatedDateTime":"2020-05-22T01:15:11Z","Content":"\n\u003Cp\u003E\nThat small landing gear is really difficult to work with.  It is very unforgiving. In addition, tail draggers are a challenge anyway in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nIn your case, what I think is happening is that as the plane wants to nose up, it hangs up on the single rear steerable wheel, which is causing you to shoot sideways.  Your rear wheel is far back from your centre of mass (which is how taildraggers are) but you are not getting the tail off the ground before nosing up.  So you also need to counter-intuitively nose down first to get the rear wheel off the ground, and then gently ease up so that it does not touch again.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to have to disagree with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146104-hvp/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022146104\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146104-hvp/\u0022 rel=\u0022\u0022\u003E@HvP\u003C/a\u003E (sorry --nothing personal \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E)  I think your wings are fine--having a broad delta wing and a set of canards is not uncommon--though to be fair, the canards might be a bit of overkill in this case. As for your wing angle, it is fine. Your centre of lift is aiming straight up--you can\u0027t get better than that.\n\u003C/p\u003E\n\u003Cp\u003E\nFour recommendations: \n\u003C/p\u003E\n\u003Cp\u003E\n1. Try a standard tricycle setup. In other words, put the single wheel in front and put the rear wheels just a smidgen behind your centre of mass.\n\u003C/p\u003E\n\u003Cp\u003E\n2. One of the more recent updates now lets you adjust the spring strength and damper (if you were not already aware--coming back to it from a few years ago).  You will probably want to fiddle around with that as well.  That little gear is horrible for bouncing you all over the place.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Get some practice in sandbox mode first so you have access to some of the other landing gear. I\u0027ve built heaps of planes and I still really struggle with that small gear.  \n\u003C/p\u003E\n\u003Cp\u003E\n4. If you want to stick with the tail dragger setup, make sure the rear sits far lower than the front of the plane. It should be quite nose up while parked. Goggle an image of a taildragger and you will see just how much of an angle they sit at.  Then at takeoff, make sure you get the tail up and then get airborne at a very shallow angle. Don\u0027t start to really climb until well clear of the ground.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-22T01:27:58Z\u0022 title=\u002205/22/2020 01:27  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 22, 2020\u003C/time\u003E by Klapaucius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2020-05-22T03:57:49Z","Content":"\n\u003Cp\u003E\nWell, things are getting better, while far from perfect perfect, even good, the planes are improving. Thank you all for the advice\n\u003C/p\u003E\n"}]}