{"TopicId":194011,"ForumId":70,"TopicTitle":"BG motors shifted position over time?","CreatedByName":"aspacecephalopod","CreatedById":204612,"CreatedDateTime":"2020-05-20T05:57:45Z","PageNum":1,"Articles":[{"CreatedByName":"aspacecephalopod","CreatedById":204612,"CreatedDateTime":"2020-05-20T05:57:45Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nJust curious if anyone has run into this bug before-I have two of these planes landed on Laythe. I dropped them in and then completely ignored them after landing (my crew arrived 200d later to fly them). In that time they sat on the planet, the motors shifted position. On both planes the rear facing motors moved up slightly (symmetrically left-right) and front motors moved down slightly (symmetrical too). Curious if the fact that they are not on level ground could have an impact? Funny thing is I\u0027ve left a similar version of the same plane (modified with float pods for water landings) on Kerbin floating in the bay for longer and this didn\u0027t happen there.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s probably worth noting that the motors are not mounted with 2X symmetry-it uses four unique motors/props for CW/CCW prop rotation. Photo below shows what\u0027s up pretty clearly-the planes still fly perfectly but want to make sure they aren\u0027t going to move around more over time or if anyone knows of a fix.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kgpSsWG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/kgpSsWG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMods are fairly standard, and worth noting there are zero part mods on the plane (besides BG):\n\u003C/p\u003E\n\u003Cp\u003E\nGameplay: Mechjeb, Trajectories, Parts: \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E bases within 2.3km of the planes for what it\u0027s worth, was attempting to move a base with ground pylons and winches, no such luck. But that \u003Cem\u003Eshouldn\u0027t\u003C/em\u003E have an impact on these decidedly non-\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E planes to my knowledge...\n\u003C/p\u003E\n\u003Cp\u003E\nMany thanks in advance and happy landings!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-20T06:00:59Z\u0022 title=\u002205/20/2020 06:00  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 20, 2020\u003C/time\u003E by aspacecephalopod\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"archiebald","CreatedById":195579,"CreatedDateTime":"2020-05-22T03:04:27Z","Content":"\n\u003Cp\u003E\nI had a slightly similar case.  I had a plain circular tank on a Kerbin - Minmus shuttle that flies from station to station.  It has 2 x retractable solar panels (1x 6 long shape).  In my case these WERE fitted with symmetry, and yet they are now clearly pointing in slightly different directions wen I view the ship from behind.  The ship is about 1 year old in game time.\n\u003C/p\u003E\n"}]}