{"TopicId":194199,"ForumId":44,"TopicTitle":"Is there such a thing as a scintillator powered laser?","CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-27T00:36:31Z","PageNum":1,"Articles":[{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-27T00:36:31Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI was thinking about how to harness the radiation of Planetary magnetic fields to power lasers.  A lot of pages on the web use the buzzwords I was searching for but none answered my questions.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the Jovian magnetic field it is possible to swing through very intense belts of high energy proton and alpha particles.  I metallic sail passing through the belt will have a shower of gamma and x-rays coming out the other side.  A scintillator crystal catches many of these high energy photons and emits violet photons instead.  I am not sure if the peak wavelengths of any scintillator crystal match exactly that of any known lasing gas.  If it is possible to adjust those wavelengths by 30 nm or so, using some extra material then a perfect match could be achieved.  \n\u003C/p\u003E\n\u003Cp\u003E\nMy understanding of lasers needs checked.  I have in mind a tube coated with scintillator crystal.  Gamma rays enter constantly from all sides.  The walls of the tube give off violet light.  Is it the case that incoherent violet light in a tube will, through interaction with lasing gas and two mirrors on the ends of the tube, create coherent violet laser light?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-05-27T01:06:56Z","Content":"\n\u003Cp\u003E\nYou mean as a pump? Sure. You still need lasing medium, which is separate. Lasing medium needs to have an unstable state above a metastable one. The pump needs to take ground state electrons into the unstable state that almost immediately decays. As long as healthy fraction of it decays to that intermediate metastable state, you\u0027re good. The other requirement is that the pump doesn\u0027t interact with the metastable state. That is, there isn\u0027t a good state to raise these metastable electrons to. If you keep the pump running, you eventually get population inversion between ground state and the metastable state, and that\u0027s a medium ready to lase.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you use for the pump is entirely irrelevant. Soviet space laser gun prototype used flash powder, similar to what was used in old flash bulbs for photography. IR lasers use thermal excitations. And yeah, if you match scintillator to the lasing medium to act as the pump, it should work. Note that we\u0027re not talking about scintillator matching the actual laser wavelength. The pump wavelength is always shorter, and there\u0027s often an entire spectrum of energies that will work, so I\u0027m sure there\u0027s a viable combination.\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-27T12:44:55Z","Content":"\n\u003Cp\u003E\nWhat limits will there be to the scale of such a device?  I\u0027m not aware of any important limits on the size of the tube, volume of lasing medium, etc.  \n\u003C/p\u003E\n\u003Cp\u003E\nOne of the limits is damage to the transparent aperture, which could be greater in this environment due to all the extra radiation.  But it seems to me the scintillator pumping mechanism could scale to high energies better than a pump based on electrical currents. Both require active cooling at high energies. In the scintillator example all that power is evenly distributed over a large surface.  \n\u003C/p\u003E\n\u003Cp\u003E\nA stellaser using the solar corona for a gain medium could potentially use an empty hole for an aperture and thus scale to higher energies than any type of laser that tries to contain gas with a transparent window.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2020-05-27T13:35:18Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190194-farmerben/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190194\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190194-farmerben/\u0022 rel=\u0022\u0022\u003E@farmerben\u003C/a\u003E, I can tell you they exist.\n\u003C/p\u003E\n\u003Cp\u003E\nFadeev V V “Ultraviolet Lasers Using Organic Scintillators” \u003Cem\u003ESoviet Physics Uspekhi\u003C/em\u003E 13 409–410 (\u003Cstrong\u003E1970\u003C/strong\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\nThey get a very brief, uninformative mention by our nukes and lasers brain trust from Sarov \u003Ca href=\u0022http://book.sarov.ru/wp-content/uploads/2018/05/Works-RFNC-VNIIEF-v21-1-23.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. The 2008 monography they reference as background reading is not available online.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, a passing observation is that all these systems tend to be pumped by neutrons, fission fragments, or thermal radiation - not gammas.\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-05-27T21:29:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223791765\u0022 data-ipsquote-contentid=\u0022194199\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590583495\u0022 data-ipsquote-userid=\u0022190194\u0022 data-ipsquote-username=\u0022farmerben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, farmerben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat limits will there be to the scale of such a device?  I\u0027m not aware of any important limits on the size of the tube, volume of lasing medium, etc.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot at all an expert on lasers, but two things come to mind. First, in order to get good coherence, you do need the light to bounce a considerable number of times in lasing cavity. That means, as you increase the length of the gain medium, clarity might become a factor. Depending on your gain medium, this might start getting to be a problem after a few dozen meters or after many kilometers. Increasing the length will also increase lasing threshold, requiring more pump power, and might reduce the overall Q factor. Second is pump power itself. There are a whole bunch of factors determining lasing threshold, primarily concerning properties of the gain medium and geometry of lasing cavity. Some of these might be adjustable, like dimensions and purity of gain medium, while others aren\u0027t. Metastable state of any gain medium has a finite and actually quite brief lifetime, which even at 100% efficiency on everything else puts an absolute minimum on energy density provided by the pump before lasing just can\u0027t happen.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, I don\u0027t know even remotely where the limits would be. I have a tiny amount of lab experience with helium-neon lasers, but that\u0027s about it. Given that you need to fit a gain medium to scintillator, you need something tunable, so the only thing that comes to mind is organic lasers. And about all I know about them is that they cover a huge range of operating wavelengths from thermal IR to near UV, but it\u0027s also a huge topic with a lot of complexity.\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-28T03:04:49Z","Content":"\n\u003Cp\u003E\nScintillators are more complex than I had realized as well.  I was under the impression that they worked off X-rays and gamma rays, but that is probably because the detectors I am familiar with are shielded to reduce noise.  They seem to be directly stimulated by high energy electrons and protons as well.  In the case of neutrons and heavy ions I\u0027m not so sure how they work.  Some of them are using liquid or gas scintillators to slow down neutrons until they decay, others use neutron absorbers like lithium and boron to bring other elements in the crystal into an excited state.  \n\u003C/p\u003E\n\u003Cp\u003E\nI did find an interesting article about how the LHC must calibrate and maintain their scintillators because the high energy hadrons cause spallation and fission events in their detection crystals degrading them over time.  They are using rare earth elements in their crystals though.  There are plenty of lighter salts not as prone to this sort of damage.  \n\u003C/p\u003E\n\u003Cp\u003E\nNoble gasses and ionic salts can stand up to radiation pummeling in Jovian belts.  I doubt if organic materials could survive very long.  A metallic sail could tank some of the damage, I had envisioned it\u0027s main role as a collector.  \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-05-28T03:57:43Z","Content":"\n\u003Cp\u003E\nWell, sure. You ram a high enough energy particle into medium, you\u0027re going to get photons. So a scintillator will light up for basically anything. Get enough high energy neutrinos flowing through, and that will do it too. You\u0027ll just need a really high neutrino flux or A LOT of scintillating material.\n\u003C/p\u003E\n"}]}