{"TopicId":194258,"ForumId":109,"TopicTitle":"Large Info Dump","CreatedByName":"prestja","CreatedById":200888,"CreatedDateTime":"2020-05-28T19:45:16Z","PageNum":1,"Articles":[{"CreatedByName":"prestja","CreatedById":200888,"CreatedDateTime":"2020-05-28T19:45:16Z","Content":"\n\u003Cp\u003E\nA large info dump regarding Kerbal Space Program 2 has been posted to Imgur \u003Ca href=\u0022https://imgur.com/a/7sv1Kcc\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. As a site note: we\u0027re getting nurseries!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETLDR\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nLife support is seemingly confirmed with greenhouses mentioned.\n\u003C/li\u003E\n\u003Cli\u003E\nNurseries will permit Kerbal reproduction once milestones are achieved\n\u003C/li\u003E\n\u003Cli\u003E\nCareer mode has been replaced with a new mode internally called \u0022adventure mode\u0022 which does away with funding and instead focuses on giving the player objectives they may optionally complete in addition to letting them discover the galaxy at their own pace. World firsts are emphasized, and science points make a return.\n\u003C/li\u003E\n\u003Cli\u003E\nColonies are integral staging grounds for interstellar progression.\n\u003C/li\u003E\n\u003Cli\u003E\nThere is finally a proper pause button.\n\u003C/li\u003E\n\u003Cli\u003E\nPost-flight reports will point out areas the player\u0027s rockets can be improved upon.\n\u003C/li\u003E\n\u003Cli\u003E\nG-forces are now listed for each individual Kerbal.\n\u003C/li\u003E\n\u003Cli\u003E\nRocket subassemblies are robust enough to produce one incredibly complex component in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and simply attach it to an even larger rocket through symmetry rules.\n\u003C/li\u003E\n\u003Cli\u003E\nParts are arranged into size tiers within categories (finally!)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETranscript (work in progress)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe Big Boom\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExt: Space. The camera pans across a desert landscape, the faint flow of starlight refracting through a layer of atmosphere at the horizon. Stirring synth chords and a bass drum aren\u0027t quite repoducing Also sprach Zarathustra, but the tone is the same. Mysterious. Ominous? The vibe is unmistakably 2001. \n\u003C/p\u003E\n\u003Cp\u003E\nThen, peeking out over the edge of a cliff, we see it - a colony on the dusty orange surface, futuristic apartment buildings on a lattice of steel support beams flanked by rows of solar panels and greenhouses. A long runway for space planes suggests how fresh supplies and colonists will reach this output on the Planet Duna, while the ramp at the end of the runway immediately makes me want to ruin the ambiance by strapping a rocket to a rover and seeing how far it could jump. The Kerbals, I think, would certainly understand.\n\u003C/p\u003E\n\u003Cp\u003E\nFlying to the Mun adn beyond is just the beginning of your progression through the solar system and, eventually, the galaxy. To reach those far-flung stars, you\u0027ll now be able to establish orbital and planetary colonies, staging grounds for the next leg of your cosmic journye.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022[Colonies are] capable of producing colonists through a method that we will not describe, for everyone\u0027s sake, after something that the player initiates called a \u0027boom even\u0027\u0022, says lead designer Shana Markham. Throughout \u003Cem\u003EKerbal\u0027s\u003C/em\u003E new career mode, which the developers have nicknamed \u0027adventure mode\u0027, making discoveries and unlocking new technologies will trigger these boom events, which kick off various effects across your civilization. In a colony\u0027s nursery module, for example, that means making new colonists. \u0022You know, discoveries make kerbals happy,\u0022 Markham says.\n\u003C/p\u003E\n\u003Cp\u003E\nThe goal of adventure mode is to provide a far more ambitious campaign for players to embark on, building ships powerful enough to leave the solar system. The structure will include specific missions, but creative director Nate Simpson says these will feel more \u0022compelling\u0022 than some of the first game\u0027s missions, which would direct you to fly to a specific latitude/longitude and trigger a part on your ship. \u0022Those felt grindy. We\u0027re going out of our way to make the mission goals for adventure mode feel meaningful: real firsts that feel unique relative to every other goal in the game.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSimpson says adventure mode has a lot in common with the first game\u0027s science mode, which gave you unlimited funds but made you earn science points to advance the tech tree. In \u003Cem\u003EKSP2\u003C/em\u003E, the missions will be there for players who want them, but you can also set your own goals. \u0022You\u0027ll begin to collect science and trigger boom events as you explore what\u0027s out there,\u0022 Simpson says.The campaign is \u0022explicitly designed to be non-punitive\u0022 so you\u0027ll never reach a fail state where you\u0027ve\u0022 [article cuts off here]\n\u003C/p\u003E\n\u003Cp\u003E\n[article resumes] unstable, explosive rockets. Simpson says that with each addition \u003Cem\u003EKSP2\u003C/em\u003E\u0027s developers have tried to distinguish between \u0022constructive failure\u0022 and \u0022frustrating failure\u0022. The new tools are meant to ensure failures allow you to learn something (or at the least laugh at Jebediah Kerman\u0027s horrified face as your rocket corkscrews back to the ground at a thousand miles per hour).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We don\u0027t want you to make the same mistake twice,\u0022 Simpson says. \u0022We want you to make lots of different mistakes.\u0022 And now when you make those mistakes, \u003Cem\u003EKSP 2 \u003C/em\u003Ewill have a lot more help to offer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EClass in session\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTruly getting into \u003Cem\u003EKerbal Space Program \u003C/em\u003Einevitably means spending hours delving into YouTube videos on rocket science and the game itself. Even if you have a physics degree, there\u0027s still a steep learning curve to understanding how the hell to work \u003Cem\u003EKerbal\u003C/em\u003E\u0027s interface. \u003Cem\u003EKSP2 \u003C/em\u003Efixes some obvious oversights and make the user interface a whole more elegant.\n\u003C/p\u003E\n\u003Cp\u003E\nFlight tools are now clustered together in more logical ways, with navigation on the left and time controls in the centre, a place of prominence that reflects how important fast forwarding will be as you start launching long interstellar journeys. There\u0027s now a pause button, which I fervently hope gets a tool-tip that says \u0027DONT\u0027T PANIC\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nPausing will be one of the main ways players access \u003Cem\u003EKSP2\u003C/em\u003E\u0027s greatly expanded tutorials, which include a mixture of interactive tutorials to guide you through using interface elements, and animations that give you a crash course in rocketry. The example I saw adeptly explained high thrust and low thrust rocket engines with a pair of kerbals biking up a steep hill (see left).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We\u0027re trying to create a system where the player comes to the tutorial with the desire to gain a specific category of information,\u0022 says Simpson. The tutorials will be context-aware, so if you pause after leaving the atmosphere, for example, you\u0027ll be able to easily pull up a tutorial on how to execute a gravity turn to escape Kerbin\u0027s orbit. You\u0027ll perform that maneuver in \u0027VR space\u0027, then go back to your real rocket and put what you learned to good use. Hopefully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Teh big thing for me is that these are actually bite-sized, so you have a whole tutorial section about going to the Mun, but it\u0027s broken up into a large number of subsections, so you can learn and practice a specific piece,\u0022 says Markham. And the game will make suggestions, too. When a launch inevitably goes awry, the post-flight report can highlight a tutorial based on what went wrong, so you\u0027ll learn as you go.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven how much of the joy of \u003Cem\u003EKerbal Space Program\u003C/em\u003E lies in discovery and personal achievement, there is a risk in over-explaining. The dev team is well aware of that pitfall because they\u0027ve already stumbled over it. In early tutorial iterations they leaned too far into telling players how to play - the most straightforward tutorial, after all, is to tell someone exactly what rocket parts they need to reach their goal - but realized that the gratification comes from figuring it out yourself. \u0022The important thing is to provide people with puzzle pieces and informational context, but don\u0027t tell them how to make the rocket. Concepts, not prescriptions,\u0022 Simpson says.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EKerbal Space Program 2 \u003C/em\u003Eis clearly going to be a far easier game to start playing, but the changes to the UI and a proper campaign mode should excite its loyal kerbonauts, too. What I\u0027m really dying to know - and unfortunately saw precious little of - is what awaits outside the Kerbol System, and what it\u0027s going to be like exploring it with friends in multiplayer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESpace walk with me\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI learned precious littel about just how big \u003Cem\u003EKerbal Space Program 2 \u003C/em\u003Etruly is, but I did come away from two days of interview with some clues. The dev team is around 30 people and still growing, and that\u0027s not including support from publisher Private Division\u0027s QA team, who the developers praised as being seasoned \u003Cem\u003EKerbal \u003C/em\u003Efans and very helpful. It\u0027s easily the biggest team \u003Cem\u003EKerbal \u003C/em\u003Ehas ever had behind it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g2MrJXW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/g2MrJXW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ilioXfg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/ilioXfg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k73KVKe.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/k73KVKe.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FKj649w.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002296.25\u0022 height=\u0022768\u0022 width=\u0022798\u0022 src=\u0022https://i.imgur.com/FKj649w.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KpaKzQ0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022128.80\u0022 height=\u0022768\u0022 width=\u0022596\u0022 src=\u0022https://i.imgur.com/KpaKzQ0.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jFXOHb7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.44\u0022 height=\u0022577\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jFXOHb7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-28T20:41:37Z\u0022 title=\u002205/28/2020 08:41  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 28, 2020\u003C/time\u003E by prestja\u003C/strong\u003E\n\u003Cbr\u003Etranscribed \u0026quot;class in session\u0026quot; and \u0026quot;space walk with me\u0026quot; sections\n\u003C/span\u003E\n"},{"CreatedByName":"Misguided Kerbal","CreatedById":203209,"CreatedDateTime":"2020-05-28T20:08:15Z","Content":"\n\u003Cp\u003E\nA few things I noticed:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Time Warp is now called \u0022Time Zoom\u0022. Not sure I like that.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Parts are now rearranged by size\n\u003C/p\u003E\n\u003Cp\u003E\n3. The UI now has a \u0022flat\u0022 \u0026amp; \u0022digital\u0027 look, and is rearranged a lot. Again, not sure I like that.\n\u003C/p\u003E\n\u003Cp\u003E\n4. A new mode called \u0022Adventure Mode\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOverall, not sure I\u0027m exactly sold on KSP2 yet.\n\u003C/p\u003E\n"},{"CreatedByName":"TheNeutralCat","CreatedById":202551,"CreatedDateTime":"2020-05-28T20:19:10Z","Content":"\n\u003Cp\u003E\nThe UI elements of KSP 2 remind me of Subnautica, almost\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T20:33:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792698\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590696495\u0022 data-ipsquote-userid=\u0022203209\u0022 data-ipsquote-username=\u0022Misguided_Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA few things I noticed:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Time Warp is now called \u0022Time Zoom\u0022. Not sure I like that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree, I prefer Time Warp over Time Zoom.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2. Parts are now rearranged by size\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFinally!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n3. The UI now has a \u0022flat\u0022 \u0026amp; \u0022digital\u0027 look, and is rearranged a lot. Again, not sure I like that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWould have to study that more.  That navball definitely needs more lines on it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n4. A new mode called \u0022Adventure Mode\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs long as it\u0027s an addition and doesn\u0027t exclude a more details Career mode.  Which needs a *lot* of attention.  Preferably by looking at mods like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/181013-ksp-181-probes-before-crew-pbc-version-28/\u0022 rel=\u0022\u0022\u003EProbes Before Crew\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/181932-18x-unkerballed-start-v110-updated-oct-27-2019/\u0022 rel=\u0022\u0022\u003EUnkerballed Start\u003C/a\u003E, as well as the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/90530-19x-community-tech-tree-february-20-2020/\u0022 rel=\u0022\u0022\u003ECommunity Tech Tree\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOverall, not sure I\u0027m exactly sold on KSP2 yet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m happy that the trend appears to be release it right rather than rush it out.  There\u0027s a lot to glean from how people mod and play KSP to guide KSP 2.\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2020-05-28T20:41:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792690\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590695116\u0022 data-ipsquote-userid=\u0022200888\u0022 data-ipsquote-username=\u0022prestja\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n54 minutes ago, prestja said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLife support is seemingly confirmed with greenhouses mentioned.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI still think this is more likely something similar to the Civilian Population mod than what we normally think of when we say life support.  Yes, there are greenhouses and yes they are necessary to progress - but maybe not to keep your Kerbals alive.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2020-05-28T21:31:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792719\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590698483\u0022 data-ipsquote-userid=\u0022155685\u0022 data-ipsquote-username=\u0022DStaal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, DStaal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI still think this is more likely something similar to the Civilian Population mod than what we normally think of when we say life support.  Yes, there are greenhouses and yes they are necessary to progress - but maybe not to keep your Kerbals alive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI really hope that is the case.\n\u003C/p\u003E\n\u003Cp\u003E\nI do like the UI, but I hope it\u0027s has some ability to rearrange the different elements.\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T21:35:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792704\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590697150\u0022 data-ipsquote-userid=\u0022202551\u0022 data-ipsquote-username=\u0022TheNeutralCat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, TheNeutralCat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe UI elements of KSP 2 remind me of Subnautica, almost\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDon\u0027t give the devs ideas!  I had to steel meself to get through Subnautica\u0027s deepest zones to finish the game.  You want a KSP 2 with an actual Kraken?  And worse? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReally should get on to trying out the latest updated Subnautica: Below Zero.\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2020-05-28T21:50:24Z","Content":"\n\u003Cp\u003E\nActual [snip] INFO, LET THE KERBALS REJOICE!!!!!!!!!!!!!!!!!!!!!!\n\u003C/p\u003E\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2020-05-28T21:53:04Z","Content":"\n\u003Cp\u003E\nI quite like funds - but it does distract from gameplay a little I guess, managing getting to the new place.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut what is the point of reusable rockets and \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E space planes if there are no cost?.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI reckon the first DLC for KSP 2 (as Take2\u0027s model for games is new release, two DLCs and then a new release) will be returning the Career Mode with funding.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2020-05-28T21:56:36Z","Content":"\n\u003Cp\u003E\nthe ui looks like a bunch of wierd sci fi alien bubbles not high tech, kinda childish\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2020-05-28T22:03:06Z","Content":"\n\u003Cp\u003E\nLovely, so they are taking away the mode I spend 90\u002B% of my time and replacing it with something called adventure mode that sounds to me like a big step backwards - random optional contracts for no reason other than what, Steam achievements?  Or will they lock more advanced parts behind these optional contracts?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792698\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590696495\u0022 data-ipsquote-userid=\u0022203209\u0022 data-ipsquote-username=\u0022Misguided_Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1. Time Warp is now called \u0022Time Zoom\u0022. Not sure I like that\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSame here, just sounds bad to me.  Actually, it makes me think they are trying to make it appeal to middle-school age children\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792698\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590696495\u0022 data-ipsquote-userid=\u0022203209\u0022 data-ipsquote-username=\u0022Misguided_Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Misguided_Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n3. The UI now has a \u0022flat\u0022 \u0026amp; \u0022digital\u0027 look, and is rearranged a lot. Again, not sure I like that\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792756\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590702996\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe ui looks like a bunch of wierd sci fi alien bubbles not high tech, kinda childish\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI also agree here, it doesn\u0027t appeal to me that much and seems to match what I said above - aimed at children\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis info update actually pushed me more to the category of not gonna buy it.  I\u0027m not making up my mind yet, but I don\u0027t like the direction this seems to be going\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2020-05-28T22:05:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792757\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590703386\u0022 data-ipsquote-userid=\u0022181783\u0022 data-ipsquote-username=\u0022Cavscout74\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Cavscout74 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLovely, so they are taking away the mode I spend 90\u002B% of my time and replacing it with something called adventure mode that sounds to me like a big step backwards - random optional contracts for no reason other than what, Steam achievements?  Or will they lock more advanced parts behind these optional contracts?\n\u003C/p\u003E\n\u003Cp\u003E\nSame here, just sounds bad to me.  Actually, it makes me think they are trying to make it appeal to middle-school age children\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also agree here, it doesn\u0027t appeal to me that much and seems to match what I said above - aimed at children\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis info update actually pushed me more to the category of not gonna buy it.  I\u0027m not making up my mind yet, but I don\u0027t like the direction this seems to be going\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nlooks like this\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Dallas Movie Screenings: Escape From Planet Earth\u0022 data-ratio=\u002269.45\u0022 style=\u0022width:874px;height:auto;\u0022 width=\u00221150\u0022 src=\u0022https://1.bp.blogspot.com/-K1MJuBuP8-0/UR5H4nFOdvI/AAAAAAAAB7A/3CRj0bBDwbU/s1600/escape-from-planet-earth.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792690\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590695116\u0022 data-ipsquote-userid=\u0022200888\u0022 data-ipsquote-username=\u0022prestja\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, prestja said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA large info dump regarding Kerbal Space Program 2 has been posted to Imgur \u003Ca href=\u0022https://imgur.com/a/7sv1Kcc\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. As a site note: we\u0027re getting nurseries!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETLDR\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nLife support is seemingly confirmed with greenhouses mentioned.\n\u003C/li\u003E\n\u003Cli\u003E\nNurseries will permit Kerbal reproduction once milestones are achieved\n\u003C/li\u003E\n\u003Cli\u003E\nCareer mode has been replaced with a new mode internally called \u0022adventure mode\u0022 which does away with funding and instead focuses on giving the player objectives they may optionally complete in addition to letting them discover the galaxy at their own pace. World firsts are emphasized, and science points make a return.\n\u003C/li\u003E\n\u003Cli\u003E\nColonies are integral staging grounds for interstellar progression.\n\u003C/li\u003E\n\u003Cli\u003E\nThere is finally a proper pause button.\n\u003C/li\u003E\n\u003Cli\u003E\nPost-flight reports will point out areas the player\u0027s rockets can be improved upon.\n\u003C/li\u003E\n\u003Cli\u003E\nG-forces are now listed for each individual Kerbal.\n\u003C/li\u003E\n\u003Cli\u003E\nRocket subassemblies are robust enough to produce one incredibly complex component in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and simply attach it to an even larger rocket through symmetry rules.\n\u003C/li\u003E\n\u003Cli\u003E\nParts are arranged into size tiers within categories (finally!)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETranscript (work in progress)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe Big Boom\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExt: Space. The camera pans across a desert landscape, the faint flow of starlight refracting through a layer of atmosphere at the horizon. Stirring synth chords and a bass drum aren\u0027t quite repoducing Also sprach Zarathustra, but the tone is the same. Mysterious. Ominous? The vibe is unmistakably 2001. \n\u003C/p\u003E\n\u003Cp\u003E\nThen, peeking out over the edge of a cliff, we see it - a colony on the dusty orange surface, futuristic apartment buildings on a lattice of steel support beams flanked by rows of solar panels and greenhouses. A long runway for space planes suggests how fresh supplies and colonists will reach this output on the Planet Duna, while the ramp at the end of the runway immediately makes me want to ruin the ambiance by strapping a rocket to a rover and seeing how far it could jump. The Kerbals, I think, would certainly understand.\n\u003C/p\u003E\n\u003Cp\u003E\nFlying to the Mun adn beyond is just the beginning of your progression through the solar system and, eventually, the galaxy. To reach those far-flung stars, you\u0027ll now be able to establish orbital and planetary colonies, staging grounds for the next leg of your cosmic journye.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022[Colonies are] capable of producing colonists through a method that we will not describe, for everyone\u0027s sake, after something that the player initiates called a \u0027boom even\u0027\u0022, says lead designer Shana Markham. Throughout \u003Cem\u003EKerbal\u0027s\u003C/em\u003E new career mode, which the developers have nicknamed \u0027adventure mode\u0027, making discoveries and unlocking new technologies will trigger these boom events, which kick off various effects across your civilization. In a colony\u0027s nursery module, for example, that means making new colonists. \u0022You know, discoveries make kerbals happy,\u0022 Markham says.\n\u003C/p\u003E\n\u003Cp\u003E\nThe goal of adventure mode is to provide a far more ambitious campaign for players to embark on, building ships powerful enough to leave the solar system. The structure will include specific missions, but creative director Nate Simpson says these will feel more \u0022compelling\u0022 than some of the first game\u0027s missions, which would direct you to fly to a specific latitude/longitude and trigger a part on your ship. \u0022Those felt grindy. We\u0027re going out of our way to make the mission goals for adventure mode feel meaningful: real firsts that feel unique relative to every other goal in the game.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSimpson says adventure mode has a lot in common with the first game\u0027s science mode, which gave you unlimited funds but made you earn science points to advance the tech tree. In \u003Cem\u003EKSP2\u003C/em\u003E, the missions will be there for players who want them, but you can also set your own goals. \u0022You\u0027ll begin to collect science and trigger boom events as you explore what\u0027s out there,\u0022 Simpson says.The campaign is \u0022explicitly designed to be non-punitive\u0022 so you\u0027ll never reach a fail state where you\u0027ve\u0022 [article cuts off here]\n\u003C/p\u003E\n\u003Cp\u003E\n[article resumes] unstable, explosive rockets. Simpson says that with each addition \u003Cem\u003EKSP2\u003C/em\u003E\u0027s developers have tried to distinguish between \u0022constructive failure\u0022 and \u0022frustrating failure\u0022. The new tools are meant to ensure failures allow you to learn something (or at the least laugh at Jebediah Kerman\u0027s horrified face as your rocket corkscrews back to the ground at a thousand miles per hour).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We don\u0027t want you to make the same mistake twice,\u0022 Simpson says. \u0022We want you to make lots of different mistakes.\u0022 And now when you make those mistakes, \u003Cem\u003EKSP 2 \u003C/em\u003Ewill have a lot more help to offer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EClass in session\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTruly getting into \u003Cem\u003EKerbal Space Program \u003C/em\u003Einevitably means spending hours delving into YouTube videos on rocket science and the game itself. Even if you have a physics degree, there\u0027s still a steep learning curve to understanding how the hell to work \u003Cem\u003EKerbal\u003C/em\u003E\u0027s interface. \u003Cem\u003EKSP2 \u003C/em\u003Efixes some obvious oversights and make the user interface a whole more elegant.\n\u003C/p\u003E\n\u003Cp\u003E\nFlight tools are now clustered together in more logical ways, with navigation on the left and time controls in the centre, a place of prominence that reflects how important fast forwarding will be as you start launching long interstellar journeys. There\u0027s now a pause button, which I fervently hope gets a tool-tip that says \u0027DONT\u0027T PANIC\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nPausing will be one of the main ways players access \u003Cem\u003EKSP2\u003C/em\u003E\u0027s greatly expanded tutorials, which include a mixture of interactive tutorials to guide you through using interface elements, and animations that give you a crash course in rocketry. The example I saw adeptly explained high thrust and low thrust rocket engines with a pair of kerbals biking up a steep hill (see left).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We\u0027re trying to create a system where the player comes to the tutorial with the desire to gain a specific category of information,\u0022 says Simpson. The tutorials will be context-aware, so if you pause after leaving the atmosphere, for example, you\u0027ll be able to easily pull up a tutorial on how to execute a gravity turn to escape Kerbin\u0027s orbit. You\u0027ll perform that maneuver in \u0027VR space\u0027, then go back to your real rocket and put what you learned to good use. Hopefully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Teh big thing for me is that these are actually bite-sized, so you have a whole tutorial section about going to the Mun, but it\u0027s broken up into a large number of subsections, so you can learn and practice a specific piece,\u0022 says Markham. And the game will make suggestions, too. When a launch inevitably goes awry, the post-flight report can highlight a tutorial based on what went wrong, so you\u0027ll learn as you go.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven how much of the joy of \u003Cem\u003EKerbal Space Program\u003C/em\u003E lies in discovery and personal achievement, there is a risk in over-explaining. The dev team is well aware of that pitfall because they\u0027ve already stumbled over it. In early tutorial iterations they leaned too far into telling players how to play - the most straightforward tutorial, after all, is to tell someone exactly what rocket parts they need to reach their goal - but realized that the gratification comes from figuring it out yourself. \u0022The important thing is to provide people with puzzle pieces and informational context, but don\u0027t tell them how to make the rocket. Concepts, not prescriptions,\u0022 Simpson says.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EKerbal Space Program 2 \u003C/em\u003Eis clearly going to be a far easier game to start playing, but the changes to the UI and a proper campaign mode should excite its loyal kerbonauts, too. What I\u0027m really dying to know - and unfortunately saw precious little of - is what awaits outside the Kerbol System, and what it\u0027s going to be like exploring it with friends in multiplayer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESpace walk with me\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI learned precious littel about just how big \u003Cem\u003EKerbal Space Program 2 \u003C/em\u003Etruly is, but I did come away from two days of interview with some clues. The dev team is around 30 people and still growing, and that\u0027s not including support from publisher Private Division\u0027s QA team, who the developers praised as being seasoned \u003Cem\u003EKerbal \u003C/em\u003Efans and very helpful. It\u0027s easily the biggest team \u003Cem\u003EKerbal \u003C/em\u003Ehas ever had behind it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/g2MrJXW.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022g2MrJXW.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/g2MrJXW.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/ilioXfg.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022ilioXfg.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/ilioXfg.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/k73KVKe.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022k73KVKe.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022216.53\u0022 height=\u0022768\u0022 width=\u0022354\u0022 src=\u0022https://i.imgur.com/k73KVKe.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/FKj649w.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022FKj649w.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002296.25\u0022 height=\u0022768\u0022 width=\u0022798\u0022 src=\u0022https://i.imgur.com/FKj649w.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/KpaKzQ0.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022KpaKzQ0.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022128.80\u0022 height=\u0022768\u0022 width=\u0022596\u0022 src=\u0022https://i.imgur.com/KpaKzQ0.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/jFXOHb7.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022jFXOHb7.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.44\u0022 height=\u0022577\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jFXOHb7.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ncould you show us some of the pictures of the game, those were clipped off.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2020-05-28T22:16:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792758\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590703529\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncould you show us some of the pictures of the game, those were clipped off.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt looks to be from next month\u0027s PCGamer magazine. It may end up on their site soon enough.\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2020-05-28T22:23:22Z","Content":"\n\u003Cp\u003E\nI can see it now.  Kerbals from KSP 1 meet Kerbals from KSP2, each runs screaming from each other\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T22:41:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792772\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590704602\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can see it now.  Kerbals from KSP 1 meet Kerbals from KSP2, each runs screaming from each other\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...leading to the smash cross-over event, Crisis on Infinite Kerbins.\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2020-05-28T22:46:18Z","Content":"\n\u003Cp\u003E\nAll depends on which the run. What if they were so panicked that they each ran to the other\u0027s homeworld \n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T22:47:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792780\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590705978\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll depends on which the run. What if they were so panicked that they each ran to the other\u0027s homeworld \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrust the Kerbals to turn a cross-over event into a literal cross-over event. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2020-05-28T22:51:56Z","Content":"\n\u003Cp\u003E\nAt least it isn\u0027t  a LaCrossover event\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T22:57:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792786\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590706316\u0022 data-ipsquote-userid=\u0022129964\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, linuxgurugamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAt least it isn\u0027t  a LaCrossover event\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut it could become a lacrosse event.  Which could lead to an ice hockey event.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich could turn the Kerbals into Little Green Canadians.  All nice and friendly until the ball or puck is dropped, then watch out!\n\u003C/p\u003E\n"},{"CreatedByName":"Lewie","CreatedById":203745,"CreatedDateTime":"2020-05-28T23:17:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792787\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590706671\u0022 data-ipsquote-userid=\u0022103694\u0022 data-ipsquote-username=\u0022Jacke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Jacke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhich could turn the Kerbals into Little Green Canadians.  All nice and friendly until the ball or puck is dropped, then watch out!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut you really have to watch out if you don’t feed ‘em enough maple syrup snacks...\n\u003C/p\u003E\n\u003Cp\u003E\nCHANGE THE UI!! Please. It just don’t look good flat. It’s gotta be that ball...if they don’t change it you pc gamers probably will get a mod for it, but what about us console users? Lets start a petition or something to change it to be more like Ksp’s ui...and oh gawd, don’t try to sell it to lil children. It’s just pathetic if they’re going to do that. Make it suitable for us older guys! (I say ‘older’ yet I’m in high school. Well, there are pretty well aged players of the game...)\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2020-05-28T23:22:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792792\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590707843\u0022 data-ipsquote-userid=\u0022203745\u0022 data-ipsquote-username=\u0022Lewie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Lewie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut you really have to watch out if you don’t feed ‘em enough maple syrup snacks...\n\u003C/p\u003E\n\u003Cp\u003E\nCHANGE THE UI!! Please. It just don’t look good flat. It’s gotta be that ball...if they don’t change it you pc gamers probably will get a mod for it, but what about us console users? Lets start a petition or something to change it to be more like Ksp’s ui...and oh gawd, don’t try to sell it to lil children. It’s just pathetic if they’re going to do that. Make it suitable for us older guys! (I say ‘older’ yet I’m in high school. Well, there are pretty well aged players of the game...)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ndone, made a petition\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://chng.it/2DRkHzpf25\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://chng.it/2DRkHzpf25\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-28T23:22:47Z\u0022 title=\u002205/28/2020 11:22  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 28, 2020\u003C/time\u003E by SpaceFace545\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-28T23:29:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792792\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590707843\u0022 data-ipsquote-userid=\u0022203745\u0022 data-ipsquote-username=\u0022Lewie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Lewie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut you really have to watch out if you don’t feed ‘em enough maple syrup snacks...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust provide a good beer.  And woe unto you if it\u0027s a crappy beer....  It\u0027s like not providing booze to your Dwarves in Dwarf Fortress.  It\u0027s going to end badly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Lewie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCHANGE THE UI!! Please. It just don’t look good flat. It’s gotta be that ball...if they don’t change it you pc gamers probably will get a mod for it, but what about us console users?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a excellent point about the base game needing to be as right as possible.  That\u0027s one place that KSP is currently lacking.  I find several mods to be required for me to enjoy play.  KSP 2 should be better.\n\u003C/p\u003E\n\u003Cp\u003E\nLooking at the image included, I really don\u0027t like that mostly monochrome UI.  The current KSP one is better with contrasting colours.  And as I stated above, that navball is worse than the stock KSP one, which I always replace with a more detailed one.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think a petition is going to move the KSP 2 devs any more than commenting on this post.  We should be seeing more information on the form of KSP 2 while that can still be changed by reasonable pushback.\n\u003C/p\u003E\n"},{"CreatedByName":"Lewie","CreatedById":203745,"CreatedDateTime":"2020-05-28T23:46:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792800\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590708595\u0022 data-ipsquote-userid=\u0022103694\u0022 data-ipsquote-username=\u0022Jacke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Jacke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust provide a good beer.  And woe unto you if it\u0027s a crappy beer....  It\u0027s like not providing booze to your Dwarves in Dwarf Fortress.  It\u0027s going to end badly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s a excellent point about the base game needing to be as right as possible.  That\u0027s one place that KSP is currently lacking.  I find several mods to be required for me to enjoy play.  KSP 2 should be better.\n\u003C/p\u003E\n\u003Cp\u003E\nLooking at the image included, I really don\u0027t like that mostly monochrome UI.  The current KSP one is better with contrasting colours.  And as I stated above, that navball is worse than the stock KSP one, which I always replace with a more detailed one.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think a petition is going to move the KSP 2 devs any more than commenting on this post.  We should be seeing more information on the form of KSP 2 while that can still be changed by reasonable pushback.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell said my dude. Well said. \n\u003C/p\u003E\n\u003Cp\u003E\nThe new ui is just flat out bad. THERE! Someone said it! \n\u003C/p\u003E\n\u003Cp\u003E\nSorry star theory, but ksp 2 is gonna suck if the ui is like that. The navball of ksp makes flying stuff much easier, cus you can actually visualize the movement of the craft via the navball, if you understand. I can’t put it into words that well.\n\u003C/p\u003E\n\u003Cp\u003E\nalso, time zoom? Are you ####### kidding me? What the h-e double hockey sticks is this, Roblox? Damn it, it’ll always be time warp for me, and probably for the rest of you guys. So star theory, if you see this, you better change that crap otherwise you’ll probably lose hundreds if not thousands of buyers. Why? Ksp2 won’t hold a candle to ksp if this is what it’s going to look like. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd please pardon my french\n\u003C/p\u003E\n\u003Cp\u003E\nthank you for listening to my angry ramble\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2020-05-29T00:00:10Z","Content":"\n\u003Cp\u003E\nAll out of likes for the day.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223792808\u0022 data-ipsquote-contentid=\u0022194258\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221590709562\u0022 data-ipsquote-userid=\u0022203745\u0022 data-ipsquote-username=\u0022Lewie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Lewie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo star theory, if you see this, you better change that crap otherwise you’ll probably lose hundreds if not thousands of buyers. Why? Ksp2 won’t hold a candle to ksp if this is what it’s going to look like.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe UI is a critical part of a game.  I\u0027ve heard so much about Star Wars Knights of the Old Republic being a fantastic game.  The one time I tried to play it, I did not like the UI being so bad.  I knew better UIs were being made at the same time.  SWKOTOR succeeded despite the UI because of the story and the Star Wars connection.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP 2 shouldn\u0027t be banking on players getting over a poor UI.  It\u0027s not just the sale of the game at stake.  It\u0027s DLCs and later Expansions.  If they get the base game and don\u0027t enjoy it, they\u0027re not going to keep playing and buying.  And that applies no matter the age of the player.\n\u003C/p\u003E\n\u003Cp\u003E\nI also don\u0027t think that putting the crew info on the top centre of the UI is a good idea.  The bottom right is working well now.  If there\u0027s other elements going there, pick another corner.  It\u0027s bad to take up so much vertical space in the centre of the screen, as this is going to be played on screens that are wider than high.  Even better, make the UI elements moveable, like the current navball.  That was an excellent incorporation of a mod into the base KSP game.  Continue that trend.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-29T00:02:25Z\u0022 title=\u002205/29/2020 12:02  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 29, 2020\u003C/time\u003E by Jacke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lewie","CreatedById":203745,"CreatedDateTime":"2020-05-29T00:24:34Z","Content":"\n\u003Cp\u003E\nThe ui, truly is the base of the game. Without it, we can’t do squat. If it’s poorly designed, it’ll lead to loss of dlc and expansion purchases, as you said \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022103694\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\u0022 rel=\u0022\u0022\u003E@Jacke\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nso star theory, listen to us. We’re the future of your success. you guys must have quite a bit riding on the success of the game. So listen to us, we know this crap. As they say, the customer is always right.\n\u003C/p\u003E\n"}]}