{"TopicId":194582,"ForumId":56,"TopicTitle":"Grupos de acción","CreatedByName":"Luchometal","CreatedById":205282,"CreatedDateTime":"2020-06-09T02:28:32Z","PageNum":1,"Articles":[{"CreatedByName":"Luchometal","CreatedById":205282,"CreatedDateTime":"2020-06-09T02:28:32Z","Content":"\n\u003Cp\u003E\nHola que tal , estuve experimentando con un proyecto de helicóptero pero no se activan todos los rotores al mismo tiempo , así que intente asignarle una tecla , pero no se como hacerlo ¿alguien sabe como asignar una tecla a una acción?.\n\u003C/p\u003E\n"},{"CreatedByName":"sandroxil","CreatedById":149348,"CreatedDateTime":"2020-06-20T18:43:42Z","Content":"\n\u003Cp\u003E\nEn el \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E o en el hangar...\u003Cbr\u003E\n1. Pulsas el icono de los grupos de acción (el que tiene un martillo y una llave inglesa; está en la parte superior).\n\u003C/p\u003E\n\u003Cp\u003E\n2. Selecciona la parte sobre la que quieres activar un grupo de acción (en tu caso será el rotor)\n\u003C/p\u003E\n\u003Cp\u003E\n3. Se te abre una serie de opciones, en columnas. En la primera columna están los grupos de acción. Selecciona un número del 1 al 10 (el 10 equivale a la tecla 0 del teclado)\u003Cbr\u003E\n4. Selecciona la acción que quieres que se produzca al pulsar la tecla (toggle motor, activar motor...)\n\u003C/p\u003E\n\u003Cp\u003E\nPuedes asignar varias acciones a un mismo grupo de acción; por ejemplo, para activar varios rotores. Selecciona cada uno de ellos y luego añades la acción. Se te irán añadiendo todas las acciones activas para ese grupo de acción-\n\u003C/p\u003E\n\u003Cp\u003E\n5. Para utilizarlo en el juego, pulsa la tecla del grupo correspondiente (1 - 9, y 0) del teclado principal. Los números del keypad no funcionan.\n\u003C/p\u003E\n\u003Cp\u003E\nSi no te ha quedado claro del todo, puedes buscar en google o youtube; encontrarás imágenes, vídeos y tutoriales sobre cómo hacerlo.\u003Cbr\u003E\nY si tienes alguna otra duda, aquí estamos para ayudar en lo que podamos.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNos vemos en el espacio.\n\u003C/p\u003E\n"}]}