{"TopicId":194612,"ForumId":44,"TopicTitle":"Can We Reliably Calculate Speed/trajectory of Stars in Real-time?","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-10T04:45:29Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-10T04:45:29Z","Content":"\n\u003Cp\u003E\nSo it is well known that a 1g or higher constant acceleration drive spaceship is basically a flying weapon of mass destruction.\n\u003C/p\u003E\n\u003Cp\u003E\nMix that with the space opera trope of FTL travel or jump drives and you have a serious problem from a writer\u0027s POV.\n\u003C/p\u003E\n\u003Cp\u003E\nYet I think I found a solution that can justify such WMD ships being owned by civilians.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHow? By messing with FTL.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nConsider that if you had an FTL jump drive, what if you HAD to match the speed and trajectory of the mass you wanted to jump near before jumping?\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise you waste some of the ship\u0027s energy reserves and do not jump, also somewhat decreasing your jump range as well  Let\u0027s say you had a 1000 LY jump drive, so a failed attempt at jumping to Proxima Centauri would lose about 4 LY of your jump bank for nothing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can jump however close or far you want... so long you do it in space only.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nSo the consequences are: Now you have to somehow calculate... or let\u0027s be real, let your computer calculate the ACTUAL speed and trajectory of stars lightyears away whose light is several years out of date.\n\u003C/p\u003E\n\u003Cp\u003E\nI think we CAN do that even now. The calcuations, but obviously daisy chaining small jumps is the best way to navigate, as the farther out a star is the harder it becomes for a computer to calculate it\u0027s realtime speed and trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fictional constant acceleration 1g or higher drive shows it\u0027s real worth here, since now you need it to adjust for speeds and trajectories or else you will never be able to FTL jump.\n\u003C/p\u003E\n\u003Cp\u003E\nConveniently, this a least partially solves the WMD problem.\n\u003C/p\u003E\n\u003Cp\u003E\nSince an FTL warp drive with constant 1g acceleration means you can spend a year reaching 99% lightspeed and then FTL warp to Earth, drop out of warp on a collision course with Earth and boom! Devastation.\n\u003C/p\u003E\n\u003Cp\u003E\nMy jump drive solution as presented means matching speed and trajectory real-time, so even if you jumped into low planetary orbit you would only fall straight down... hardly relativistic WMD.\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose if one wanted to be nasty they could jump a LY away, and spend about a year accelerating toward Earth for a colision course.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so, that provides preparation time for the defending planet if tech levels are equalized.\n\u003C/p\u003E\n\u003Cp\u003E\nFurthermore it only takes a few vessels, maybe even one to jump along the madly accelerating ships course and chuck out debris in it\u0027s path.\n\u003C/p\u003E\n\u003Cp\u003E\nDefending vessel\u0027s will likely jump using the home solar system\u0027s star as a point of trajectory and speed reference.\n\u003C/p\u003E\n\u003Cp\u003E\nAt those incredible collision speeds, the attacking ship is very likely to die from literally flying at relativistic speeds into debris that is stationary relative to itself (much as the sun is compared to it\u0027s orbiting \u0027children\u0027).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nQuestion: How hard is it to calculate the real-time trajectory and speed of a star in real life that is lightyears away? Can it be done with high accuracy, likely diminishing the farther out one tries to calculate?\n\u003C/p\u003E\n\u003Cp\u003E\nLike Proxima Centauri is quite doable, but trying to calculate a star\u0027s real-time speed/trajectory a hundred LY out?\n\u003C/p\u003E\n\u003Cp\u003E\nProbably harder... maybe not impossible though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWhat do you know of this subject?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T04:50:17Z\u0022 title=\u002206/10/2020 04:50  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-06-10T06:02:22Z","Content":"\n\u003Cp\u003E\nThe velocity of star moving towards or away from you is easy. We can watch the lines in spectrum of a star caused by various atoms in the star\u0027s atmosphere and measure its relative velocity to within a few centimeters per second in some cases based on red/blue shift. We do that to find planets, so that\u0027s a solved problem. Measuring transverse velocity... Well, that\u0027s a whole another problem. Essentially, without visiting the star, you just watch it for a very long time and see how it moves in the sky. Precision on that is bad and gets worse with distance. Speaking of distance, we have the exact opposite problem. We can measure direction to the star extremely precisely, but outside of nearby stars where we can get pretty close with parallax, measuring distances to stars involves a lot of very rough estimates. Often, best we can do is watch an entire cluster of stars, assume they move at orbital speed on average, and use that to estimate distance from galactic center, then extrapolate the rest. So if you just pick a star from catalog that\u0027s a few hundred light years away, you can aim at it well enough to pass within its planetary system, so long as you don\u0027t take more than a few years getting there, but if you have to know the distance in advance, you\u0027ll drop out of FTL nowhere near it. In fact, you\u0027re more likely to be closer to some other star than the one you were going to when you drop out of FTL - that\u0027s how bad some of our distance measurements are. And if you can detect the approach and time jumping out, you still won\u0027t be able to correct for velocity difference reliably, and can have as much as a few kilometers per second of unaccounted difference.\n\u003C/p\u003E\n\u003Cp\u003E\nThe situation improves drastically for stars you can visit. Pulsar navigation we\u0027ve been able to test lets you measure your position in the entire galaxy to within a few kilometers of absolute error. Drop a satellite in orbit of a remote star, compare its readings to the one on Earth, and you\u0027ll know the relative velocity of the system\u0027s barycenter with as much precision as you likely to ever need. If you kept track of the reference pulsars all the way to the star, you will know the location to within a few kilometers as well. Once you have local neighborhood mapped, keeping the positions and velocities up to date, and even accounting for gravitational interaction is not that hard. That gives you enough precision to FTL directly into low orbit of a charted planet anywhere in Milky Way if you cared to. And again, the navigation bit is existing technology that we\u0027re not using only because GPS-like approach is even more precise within our immediate neighborhood, and that\u0027s all we get to play with. So for charted stars, this is a solved problem. Except for FTL itself, of course.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, if you\u0027re trying to come up with fiction reasons why you can\u0027t go to ramming speed, then FTL into a populated planet, effectively nuking it from safe distance and without warning, this works, so long as you have a workaround for exploration. Perhaps, requiring multiple iterative measurements and jumps to get to a star you\u0027ve never been too before, dialing in correct position and velocity as you get more information. Nobody said getting to a star has to be easy the first time you\u0027re going there, so long as it\u0027s still possible to get there within some reasonable time and you can establish convenient routes once it\u0027s been properly explored, which this limitations seems to fit well with.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know where to even begin coming up with a physics explanation for why FTL might work this way, but meh. Unless you\u0027re getting into a lot of specifics of how said FTL works in the first place, that doesn\u0027t seem relevant.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: You know? Maybe this isn\u0027t total nonsense even from perspective of physics. Something like Alcubierre Drive gets capricious when moving near a massive body. Math on this is a little beyond me, but the short version is that conservation laws still exist, and for Alcubierre Drive to move along arbitrary trajectory, it has to radiate gravitational waves, meaning you\u0027ll either be losing an absurd amount of energy or will be forced to drop out, unless, of course, you travel along a trajectory that still conserves relevant orbital elements. The caveat is that it\u0027s nothing as simple as \u0022you need to match target\u0027s velocity\u0022, because what you\u0027re really doing is matching orbits, and I\u0027m pretty sure orbital strike via Alcubierre would still be quite possible. In fact, it might be easier than hitting parking orbit. But at least that\u0027s some sort of real physics motivation for why it\u0027s not complete malarkey. Maybe.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T06:14:20Z\u0022 title=\u002206/10/2020 06:14  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2020-06-10T06:24:06Z","Content":"\n\u003Cp\u003E\nNote that your civilian, FTL-capable spaceship would not attempt to measure things like relative motion and distance of a target star every time it wants to make a jump. Rather, it would simply look these up in a publicly available star catalog. You are at X, you want to go to Y, so the navigation computer will pull out all relevant numbers from its database in a split second. The work for measuring these was done by someone else - someone who can do these kinds of measurements far more precisely than your ship ever could.\n\u003C/p\u003E\n\u003Cp\u003E\nThis kind of activity is called \u003Cem\u003Eastrometry\u003C/em\u003E. Compared to \u003Cem\u003Eastronomy\u003C/em\u003E, which studies the objects it looks at, astrometry missions are much rarer. But every once in a while, we launch one, or we repurpose an older telescope for an all-sky survey in order to re-check or improve our measurements. Astrometry datasets are the foundation of almost all astronomy work, as they let scientists accurately plan and put into context their specific object obervations. Currently, we have one dedicated astrometry mission out there: the European Space Agency\u0027s Gaia mission. I heartily recommend you look that one up - how it works, what its goals are, what it has achieved so far, and the absurd computational effort that stands behind the data it transmits. You would never expect that something that measures the relative motion of distant objects could be this cool. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T06:25:27Z\u0022 title=\u002206/10/2020 06:25  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-10T07:07:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800327\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591768942\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe velocity of star moving towards or away from you is easy. We can watch the lines in spectrum of a star caused by various atoms in the star\u0027s atmosphere and measure its relative velocity to within a few centimeters per second in some cases based on red/blue shift. We do that to find planets, so that\u0027s a solved problem. Measuring transverse velocity... Well, that\u0027s a whole another problem. Essentially, without visiting the star, you just watch it for a very long time and see how it moves in the sky. Precision on that is bad and gets worse with distance. Speaking of distance, we have the exact opposite problem. We can measure direction to the star extremely precisely, but outside of nearby stars where we can get pretty close with parallax, measuring distances to stars involves a lot of very rough estimates. Often, best we can do is watch an entire cluster of stars, assume they move at orbital speed on average, and use that to estimate distance from galactic center, then extrapolate the rest. So if you just pick a star from catalog that\u0027s a few hundred light years away, you can aim at it well enough to pass within its planetary system, so long as you don\u0027t take more than a few years getting there, but if you have to know the distance in advance, you\u0027ll drop out of FTL nowhere near it. In fact, you\u0027re more likely to be closer to some other star than the one you were going to when you drop out of FTL - that\u0027s how bad some of our distance measurements are. And if you can detect the approach and time jumping out, you still won\u0027t be able to correct for velocity difference reliably, and can have as much as a few kilometers per second of unaccounted difference.\n\u003C/p\u003E\n\u003Cp\u003E\nThe situation improves drastically for stars you can visit. Pulsar navigation we\u0027ve been able to test lets you measure your position in the entire galaxy to within a few kilometers of absolute error. Drop a satellite in orbit of a remote star, compare its readings to the one on Earth, and you\u0027ll know the relative velocity of the system\u0027s barycenter with as much precision as you likely to ever need. If you kept track of the reference pulsars all the way to the star, you will know the location to within a few kilometers as well. Once you have local neighborhood mapped, keeping the positions and velocities up to date, and even accounting for gravitational interaction is not that hard. That gives you enough precision to FTL directly into low orbit of a charted planet anywhere in Milky Way if you cared to. And again, the navigation bit is existing technology that we\u0027re not using only because GPS-like approach is even more precise within our immediate neighborhood, and that\u0027s all we get to play with. So for charted stars, this is a solved problem. Except for FTL itself, of course.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, if you\u0027re trying to come up with fiction reasons why you can\u0027t go to ramming speed, then FTL into a populated planet, effectively nuking it from safe distance and without warning, this works, so long as you have a workaround for exploration. Perhaps, requiring multiple iterative measurements and jumps to get to a star you\u0027ve never been too before, dialing in correct position and velocity as you get more information. Nobody said getting to a star has to be easy the first time you\u0027re going there, so long as it\u0027s still possible to get there within some reasonable time and you can establish convenient routes once it\u0027s been properly explored, which this limitations seems to fit well with.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know where to even begin coming up with a physics explanation for why FTL might work this way, but meh. Unless you\u0027re getting into a lot of specifics of how said FTL works in the first place, that doesn\u0027t seem relevant.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: You know? Maybe this isn\u0027t total nonsense even from perspective of physics. Something like Alcubierre Drive gets capricious when moving near a massive body. Math on this is a little beyond me, but the short version is that conservation laws still exist, and for Alcubierre Drive to move along arbitrary trajectory, it has to radiate gravitational waves, meaning you\u0027ll either be losing an absurd amount of energy or will be forced to drop out, unless, of course, you travel along a trajectory that still conserves relevant orbital elements. The caveat is that it\u0027s nothing as simple as \u0022you need to match target\u0027s velocity\u0022, because what you\u0027re really doing is matching orbits, and I\u0027m pretty sure orbital strike via Alcubierre would still be quite possible. In fact, it might be easier than hitting parking orbit. But at least that\u0027s some sort of real physics motivation for why it\u0027s not complete malarkey. Maybe.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell... besides my fear of warp drive abuse in fiction, I simply have a hard time comprehending the shenanigans of what would happen if you warp into a planet\u0027s atmosphere... or really any solid object.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWarp is all about moving space past you while not actively changing the vessel\u0027s speed.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so, I have a hard time thinking a ship won\u0027t die if it goes warp at lightspeed and skims a planet\u0027s atmosphere in the process... at least if using common depicted scifi ships that literally warp in open free space.\n\u003C/p\u003E\n\u003Cp\u003E\nNevermind the issues inherent when one does FTL warp inside a solar system... some will start debating they got there before light arrived so it must be time travel. t\u0027s just a whole can of worms that is really good at making plot holes I can drive a truck through.\n\u003C/p\u003E\n\u003Cp\u003E\nJump drives have less plot holes, easier to write. Instant is easy to comphrehend.\n\u003C/p\u003E\n\u003Cp\u003E\nAlcubierre is much weirder... an outside observer cannot even see the ship, at least that\u0027s what an artist depicted. Just some distortion.\n\u003C/p\u003E\n\u003Cp\u003E\nMass is trapped in the bubble, so I suppose if you warped into Earth\u0027s ground the bubble would fill with rock crushing the ship itself which is insulated in this weird warp bubble pocket of spacetime. Once the warp drive itself is crushed all mass would be released explosively from the bubble.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically a big... big explosion.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWarp ramming would be awful with alcubierre.\n\u003C/p\u003E\n\u003Cp\u003E\nEven when alcubierre drops out of warp in space it spews out whatever trapped particled and radiation it has from the bubble releasing it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T07:10:35Z\u0022 title=\u002206/10/2020 07:10  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-06-10T07:43:19Z","Content":"\n\u003Cp\u003E\nYeah, a ship under Alcubierre warp passing even through atmosphere is bad mojo. The matter that impacts the bubble gets trapped in the walls of the bubble, though, not the interior. So the ship either punches a hole in whatever it passes through, dumping all that matter at destination, or, more realistically, the field gets destabilized, collapses, and all the energy gets released, which, yeah, big explosion.\n\u003C/p\u003E\n\u003Cp\u003E\nI certainly don\u0027t insist a sci-fi FTL drive has to follow these rules. They\u0027re just convenient markers in the realm of plausible. We have three good means of plausible FTL that are entirely consistent with the laws of physics as we know them, if we throw away practicality. Warp, wormholes, and hyperspace. That last one, of course, assumes that such space exists, and that we can create localized wormholes to enter and exit it. Nonetheless, once you make such an assumptions, the rest is purely mathematical. So if we have a question along the lines of, \u0022What happens if...\u0022 it can be unambiguously answered within such a system.\n\u003C/p\u003E\n\u003Cp\u003E\nThe further you stray from one of these, the more hand-wavy your explanation has to be, and the more likely you are to introduce a logical inconsistency. Nothing says you can\u0027t come up with an FTL system that\u0027s entirely self consistent in the story without it having any resemblance to how real world physics works, but it\u0027s harder. The math for Alcubierre drive works, which means it is inherently not self contradicting, which just means anything that works in a similar way is that much easier to fit into a fictional world without realizing later on that you have a huge inconsistency leading to a plot hole.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-06-10T11:37:38Z","Content":"\n\u003Cp\u003E\nWith FTL the captain should just have a look where and when did he match that star in the future.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-06-10T11:44:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800344\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591772854\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell... besides my fear of warp drive abuse in fiction, I simply have a hard time comprehending the shenanigans of what would happen if you warp into a planet\u0027s atmosphere... or really any solid object.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWarp is all about moving space past you while not actively changing the vessel\u0027s speed.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so, I have a hard time thinking a ship won\u0027t die if it goes warp at lightspeed and skims a planet\u0027s atmosphere in the process... at least if using common depicted scifi ships that literally warp in open free space.\n\u003C/p\u003E\n\u003Cp\u003E\nNevermind the issues inherent when one does FTL warp inside a solar system... some will start debating they got there before light arrived so it must be time travel. t\u0027s just a whole can of worms that is really good at making plot holes I can drive a truck through.\n\u003C/p\u003E\n\u003Cp\u003E\nJump drives have less plot holes, easier to write. Instant is easy to comphrehend.\n\u003C/p\u003E\n\u003Cp\u003E\nAlcubierre is much weirder... an outside observer cannot even see the ship, at least that\u0027s what an artist depicted. Just some distortion.\n\u003C/p\u003E\n\u003Cp\u003E\nMass is trapped in the bubble, so I suppose if you warped into Earth\u0027s ground the bubble would fill with rock crushing the ship itself which is insulated in this weird warp bubble pocket of spacetime. Once the warp drive itself is crushed all mass would be released explosively from the bubble.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically a big... big explosion.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWarp ramming would be awful with alcubierre.\n\u003C/p\u003E\n\u003Cp\u003E\nEven when alcubierre drops out of warp in space it spews out whatever trapped particled and radiation it has from the bubble releasing it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs I understand an realistic alcubierre drive would be extremely heavy or energetic, was talk of Jupiter mass level. \u003Cbr\u003E\u003Cbr\u003E\nAs for warp ramming you should not get more energy out of the ramming than you put in. Lets not break even more laws of nature \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cbr\u003E\nIn that way the Star Wasrs hyperspace ramming was pretty good, it was not that energetic, it was just extremely penetrating cutting trough shields and then cutting an killometer long ship in two and damaging ships behind it. However if you had hit that flagship from top or bottom you would just punch an hole in it.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-10T15:16:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800350\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591774999\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, a ship under Alcubierre warp passing even through atmosphere is bad mojo. The matter that impacts the bubble gets trapped in the walls of the bubble, though, not the interior. So the ship either punches a hole in whatever it passes through, dumping all that matter at destination, or, more realistically, the field gets destabilized, collapses, and all the energy gets released, which, yeah, big explosion.\n\u003C/p\u003E\n\u003Cp\u003E\nI certainly don\u0027t insist a sci-fi FTL drive has to follow these rules. They\u0027re just convenient markers in the realm of plausible. We have three good means of plausible FTL that are entirely consistent with the laws of physics as we know them, if we throw away practicality. Warp, wormholes, and hyperspace. That last one, of course, assumes that such space exists, and that we can create localized wormholes to enter and exit it. Nonetheless, once you make such an assumptions, the rest is purely mathematical. So if we have a question along the lines of, \u0022What happens if...\u0022 it can be unambiguously answered within such a system.\n\u003C/p\u003E\n\u003Cp\u003E\nThe further you stray from one of these, the more hand-wavy your explanation has to be, and the more likely you are to introduce a logical inconsistency. Nothing says you can\u0027t come up with an FTL system that\u0027s entirely self consistent in the story without it having any resemblance to how real world physics works, but it\u0027s harder. The math for Alcubierre drive works, which means it is inherently not self contradicting, which just means anything that works in a similar way is that much easier to fit into a fictional world without realizing later on that you have a huge inconsistency leading to a plot hole.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nReal science has it\u0027s limits in known quantities, whereas science fiction often deals with the unknown.\n\u003C/p\u003E\n\u003Cp\u003E\nMy jump drive as it is won\u0027t allow a spaceship to jump at all until it accurately adjusts it\u0027s speed and orbital trajectory to match the intended mass it wants to jump near.\n\u003C/p\u003E\n\u003Cp\u003E\nSo several LY will be lost from the jump bank trying to calculate, but it should not be too hard.\n\u003C/p\u003E\n\u003Cp\u003E\nYou already know where the star was years ago and calculating it\u0027s speed is easy, so figuring out where it probably should be now cannot be impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nA few false starts and the crew will get it right, and once logged into a computer\u0027s inertial guidance they ALWAYS will.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800410\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591789484\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs I understand an realistic alcubierre drive would be extremely heavy or energetic, was talk of Jupiter mass level. \u003Cbr\u003E\u003Cbr\u003E\nAs for warp ramming you should not get more energy out of the ramming than you put in. Lets not break even more laws of nature \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cbr\u003E\nIn that way the Star Wasrs hyperspace ramming was pretty good, it was not that energetic, it was just extremely penetrating cutting trough shields and then cutting an killometer long ship in two and damaging ships behind it. However if you had hit that flagship from top or bottom you would just punch an hole in it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThey updated the energy level to only a voyaget probe (about 2 tons converted into enetgy).\n\u003C/p\u003E\n\u003Cp\u003E\nThat is still incredibly powerful and dangerous.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a comparison, the hiroshima bomb I read released the same amount of energy as a paperclip converted into energy.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine how big a boom a whole two tons of mass will do!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T15:17:20Z\u0022 title=\u002206/10/2020 03:17  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-06-10T16:17:53Z","Content":"\n\u003Cp\u003E\nError!  \n\u003C/p\u003E\n\u003Cp\u003E\nI see a thread with an interesting scientific question, then first post immediately shifts to a fictional FTL thing.\n\u003C/p\u003E\n\u003Cp\u003E\nSpacescifi, I like you and I like your contributions.  But this style of thread creation is slightly offensive.  \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-10T17:14:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800528\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591805873\u0022 data-ipsquote-userid=\u0022190194\u0022 data-ipsquote-username=\u0022farmerben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n52 minutes ago, farmerben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nError!  \n\u003C/p\u003E\n\u003Cp\u003E\nI see a thread with an interesting scientific question, then first post immediately shifts to a fictional FTL thing.\n\u003C/p\u003E\n\u003Cp\u003E\nSpacescifi, I like you and I like your contributions.  But this style of thread creation is slightly offensive.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHaha... some science is more less good mostly for scifi.\n\u003C/p\u003E\n\u003Cp\u003E\nSince knowing a star\u0027s trajectory and speed in realtime helps you how in real life otherwise?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRealistically we would get there at STL, so we would see it realtime when we finally arrive decades or centuries later.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYet that does not spoil the real science of the question.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can investigate how to calculate as much as you wish.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-06-10T17:26:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800564\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591809299\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nknowing a star\u0027s trajectory and speed in realtime helps you how in real life otherwise?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNavigation of space objects and SLBM.\n\u003C/p\u003E\n\u003Cp\u003E\nBinding of the photographed astronomical and orbital objects to the stars with known photometric coordinates.\n\u003C/p\u003E\n\u003Cp\u003E\nBinding of radiation sources to the known stars and their clusters.\n\u003C/p\u003E\n\u003Cp\u003E\nDoppler measurements of the astronomical objects.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-10T17:30:56Z\u0022 title=\u002206/10/2020 05:30  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 10, 2020\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2020-06-10T17:56:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800327\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591768942\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t know where to even begin coming up with a physics explanation for why FTL might work this way, but meh. Unless you\u0027re getting into a lot of specifics of how said FTL works in the first place, that doesn\u0027t seem relevant.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: You know? Maybe this isn\u0027t total nonsense even from perspective of physics. Something like Alcubierre Drive gets capricious when moving near a massive body. Math on this is a little beyond me, but the short version is that conservation laws still exist, and for Alcubierre Drive to move along arbitrary trajectory, it has to radiate gravitational waves, meaning you\u0027ll either be losing an absurd amount of energy or will be forced to drop out, unless, of course, you travel along a trajectory that still conserves relevant orbital elements. The caveat is that it\u0027s nothing as simple as \u0022you need to match target\u0027s velocity\u0022, because what you\u0027re really doing is matching orbits, and I\u0027m pretty sure orbital strike via Alcubierre would still be quite possible. In fact, it might be easier than hitting parking orbit. But at least that\u0027s some sort of real physics motivation for why it\u0027s not complete malarkey. Maybe.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI love these kinds of questions.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s an idea.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you jump from one point to another, you are not just changing position. You\u0027re also changing a lot of other things. You\u0027re going from one gravitational potential to another and from one gravitational gradient to another. Remember that every massive objects exists inside a gravitational potential well with a particular depth (potential) and a particular slope (gradient). Together, they give you the vis-visa equation, which tells you how much specific mechanical energy the object has.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s also the underlying velocity of the gravitational potential well, since the object you\u0027re orbiting is itself moving through space. This isn\u0027t an issue if you are jumping from one orbit to another around the same object, but if you are jumping between objects (say, from Earth to Jupiter), then you have to model the whole thing as the superposition of the two planetary gravitational fields WITHIN the solar gravitational field.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to jump from one star system to another, then you have to model it as the superposition of the two stellar gravitational fields within the galactic gravitational field.\n\u003C/p\u003E\n\u003Cp\u003E\nTo use this in the story to limit FTL -- you can say that the hyperdrive/jumpdrive/etc. can only execute a jump that crosses two spheres of influence. So you can jump from one planet to another, but not from a moon of one planet directly to another planet. You can jump from one star system to another, but not from one planet directly to another star system.  You can jump from Ganymede to Europa but you cannot jump from a random Jovian orbit to Europa. You can also say that the energy requirements for any jump depend on the difference in the vis-visa energies of the two orbits, \u003Cem\u003Etaking into account\u003C/em\u003E all involved gravitational fields. \n\u003C/p\u003E\n\u003Cp\u003E\nFor example: if you want to jump from a low lunar orbit to an orbit around Titan, you\u0027d first have to use regular chemical propulsion to burn out of lunar orbit until you were free. Then you\u0027d need to calculate the vis-visa energy of your Earth orbit PLUS the vis-visa energy of Earth\u0027s orbit around the sun, and compare it to the vis-visa energy of a Titan-crossing Saturn orbit PLUS the vis-visa energy of Saturn\u0027s orbit around the sun. The jump energy would be the difference in the vector subtraction of all those energies. Then you\u0027d need to burn to enter orbit around Titan.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800528\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591805873\u0022 data-ipsquote-userid=\u0022190194\u0022 data-ipsquote-username=\u0022farmerben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, farmerben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI see a thread with an interesting scientific question, then first post immediately shifts to a fictional FTL thing.\n\u003C/p\u003E\n\u003Cp\u003E\nSpacescifi, I like you and I like your contributions.  But this style of thread creation is slightly offensive.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI, too, wish he\u0027d just use one thread for all of these. But it\u0027s fun to answer regardless.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2020-06-11T03:10:26Z","Content":"\n\u003Cp\u003E\ni think dune (and also star wars) hit the nail on the head. if you are going ftl it is impossible to observe whats in front of you before you hit it. the starwars solution was to compute everything such that it had a perfect model of the course on file. in dune, they just took large quantities of spice so they could see a few fractions of a second into the future. star trek just puts a warp drive on everything (sensors, communications, computers). \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-11T03:21:29Z\u0022 title=\u002206/11/2020 03:21  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 11, 2020\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-11T04:48:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800858\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591845026\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni think dune (and also star wars) hit the nail on the head. if you are going ftl it is impossible to observe whats in front of you before you hit it. the starwars solution was to compute everything such that it had a perfect model of the course on file. in dune, they just took large quantities of spice so they could see a few fractions of a second into the future. star trek just puts a warp drive on everything (sensors, communications, computers). \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhich is one of several reasons why I find my latest drive so appealing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt seems I come up with better ideas when I post sparingly rather than a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nMy drive allows for newtonian slugfests or docking close up, since if a ship is idly dritftng in a solar system, all another vessel with the jump drive has to do is sense it, match speed and trajectory and jump however close or far they want to it.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting away would be hard to say the least, since either the escaping ship would have to do new course corrections while evading pirate ship weaoponry/missiles at the same time... or it can jump already since it\u0027s course/speed is already matched to a local planet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-11T04:49:23Z\u0022 title=\u002206/11/2020 04:49  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 11, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-06-11T05:42:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800528\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591805873\u0022 data-ipsquote-userid=\u0022190194\u0022 data-ipsquote-username=\u0022farmerben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, farmerben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nError!  \n\u003C/p\u003E\n\u003Cp\u003E\nI see a thread with an interesting scientific question, then first post immediately shifts to a fictional FTL thing.\n\u003C/p\u003E\n\u003Cp\u003E\nSpacescifi, I like you and I like your contributions.  But this style of thread creation is slightly offensive.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you have an FTL drive you don\u0027t have to worry about the movement of stars more than the movement of the planets in the star system, only relevant if you aim for an planetary orbit or you FTL drive is slow say 2x speed of light. \u003Cbr\u003E\nStill we know movement and position well for close stars, as you explore outward you get better data including trigonometry with light year baseline. \u003Cbr\u003E\nThink they have used new horizon for trigonometry in its down time as the baseline is much more than 2 AU who is that we get on earth.\n\u003C/p\u003E\n"},{"CreatedByName":"natsirt721","CreatedById":117557,"CreatedDateTime":"2020-06-12T21:30:28Z","Content":"\n\u003Cp\u003E\nThis reminds of the Alderson drive from Pournelle\u0027s CoDominium universe. That was also a jump drive, but it used a fifth fundamental force called the Alderson force.  Basically, nuclear fusion affects Alderson force similar to how mass affects gravity, in that there is vector field in the universe, with points of high Alderson potential and low Alderson potential. The drive lets you jump from points of equal potential instantly, but the points themselves are very small, and if you\u0027re not in the right place you burn a bunch of energy and go nowhere. The points are only formed between \u0027adjacent\u0027 stars, and are usually (always, I think) very far from the star itself, well away from any planetary system. The irony is that you can travel tens of lightyears in literally no time, but it takes of days even using their multi-gee photon drives to get to any points of interest in the inner system or to the next jump point. \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-06-13T01:23:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223801917\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591997428\u0022 data-ipsquote-userid=\u0022117557\u0022 data-ipsquote-username=\u0022natsirt721\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, natsirt721 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis reminds of the Alderson drive from Pournelle\u0027s CoDominium universe. That was also a jump drive, but it used a fifth fundamental force called the Alderson force.  Basically, nuclear fusion affects Alderson force similar to how mass affects gravity, in that there is vector field in the universe, with points of high Alderson potential and low Alderson potential. The drive lets you jump from points of equal potential instantly, but the points themselves are very small, and if you\u0027re not in the right place you burn a bunch of energy and go nowhere. The points are only formed between \u0027adjacent\u0027 stars, and are usually (always, I think) very far from the star itself, well away from any planetary system. The irony is that you can travel tens of lightyears in literally no time, but it takes of days even using their multi-gee photon drives to get to any points of interest in the inner system or to the next jump point. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps... I purposely designed mine soley to avoid FTL enhanced relatvistic ramming of worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so... a lot can be done with the drive and it can be very precise. So long you adjust to the right speed and heading to match your intended planet or mass AND you either guess or know ir\u0027s speed and heading to do so.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCivillian vessels would surely use preloaded destinations, leading some systems to be well traveled and known, and uncharted space the region of explorers and also refugees and exiles... plus bad guys.\n\u003C/p\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2020-06-13T04:42:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223801917\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591997428\u0022 data-ipsquote-userid=\u0022117557\u0022 data-ipsquote-username=\u0022natsirt721\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, natsirt721 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe points are only formed between \u0027adjacent\u0027 stars, and are usually (always, I think) very far from the star itself, well away from any planetary system.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept for one that happens to be within the red giant Murchisen’s Eye...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-13T04:42:51Z\u0022 title=\u002206/13/2020 04:42  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 13, 2020\u003C/time\u003E by Nightside\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-06-13T10:00:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223802072\u0022 data-ipsquote-contentid=\u0022194612\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221592023350\u0022 data-ipsquote-userid=\u0022150244\u0022 data-ipsquote-username=\u0022Nightside\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Nightside said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcept for one that happens to be within the red giant Murchisen’s Eye...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, that was kind of an exception, assume it was that the star was so bright an huge while the other was pretty close. \u003Cbr\u003E\nAnd the \u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EAlderson drive\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003Eis pretty nice in an scifi setting as you still need good spaceships to use them effectively. \u003Cbr\u003E\u003Cbr\u003E\nIts also an obvious choke point like Gibraltar, its an position who is easy to defend, remember that the guard ship will be in orbit but the jump point is not. \u003Cbr\u003E\nSay a jump point is around Pluto orbit, you orbital velocity will be 4.7 km/s who you need to fight all the time. \n\u003C/p\u003E\n"}]}