{"TopicId":194782,"ForumId":51,"TopicTitle":"Landing on Laythe","CreatedByName":"Little Kerbonaut!","CreatedById":204942,"CreatedDateTime":"2020-06-16T03:39:22Z","PageNum":1,"Articles":[{"CreatedByName":"Little Kerbonaut!","CreatedById":204942,"CreatedDateTime":"2020-06-16T03:39:22Z","Content":"\n\u003Cp\u003E\nStatus: Success\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCrew: probe core\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStory: So I was heading to the Jool system to land on Laythe with a probe. The mission actually went pretty well I didn’t the Jool encounter time. And I didn’t land in the water on Laythe. So I reached the Jool system after 3 in game years. I got into a orbit around Jool stayed there for a few minutes then went to Laythe. During landing though the heat shield started spinning but it wasn’t enough to flip the probe upside down. Once that was done I jettisoned the heat shield and deployed the parachutes. I ended up reaching the surface but ended up landing on the hill and flipping over. I had no things to flip me back up so I loaded my last quicksave. During reentry I forgot to retract my antenna and it broke. I loaded the quicksave again the heat shield did the sane thing. But I landed upright and immediately realized I should send Jebediah here. And it was two hours later when I realized I got no pictures.\u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clamp-o-Tron","CreatedById":201818,"CreatedDateTime":"2020-06-16T07:37:17Z","Content":"\n\u003Cp\u003E\nCongratulations! You\u0027ve gotten noticably better in your mission reports since you joined the forum. Soon, you\u0027ll be doing Jool Vs with ease. (And then you\u0027ll mod it until it crashes \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E)\n\u003C/p\u003E\n"},{"CreatedByName":"Little Kerbonaut!","CreatedById":204942,"CreatedDateTime":"2020-06-17T23:32:47Z","Content":"\n\u003Cp\u003E\nThanks. \u003Cimg alt=\u0022:kiss:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 title=\u0022:kiss:\u0022\u003E\u003C/p\u003E\n"}]}