{"TopicId":194894,"ForumId":16,"TopicTitle":"Question about the Klaw\u0026#039;s resource transfer abilities in career","CreatedByName":"Yellowburn10","CreatedById":107558,"CreatedDateTime":"2020-06-20T01:53:27Z","PageNum":1,"Articles":[{"CreatedByName":"Yellowburn10","CreatedById":107558,"CreatedDateTime":"2020-06-20T01:53:27Z","Content":"\n\u003Cp\u003E\nSo, in my career I have the level 2 R\u0026amp;D, which should give me access to resource transfer, and it does for most things, but for some reason I\u0027m unable to do resource transfer with the Grabbing Unit. I\u0027ve checked on my sandbox save and I\u0027m able to transfer with the Klaw there, so it\u0027s probably not a bug. Do I need to further upgrade my buildings in order for this to happen, or is there something else wrong?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-06-20T02:36:22Z","Content":"\n\u003Cp\u003E\nMoved to Gameplay Questions. \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-06-20T05:21:16Z","Content":"\n\u003Cp\u003E\nTo make resource transfer work with klaws you need to unclick the button in the Difficulty options that says \u0022resource transfer obeys crossfeed rules\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2020-06-20T06:30:47Z","Content":"\n\u003Cp\u003E\nTo expand a bit on \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E\u0027s explanation: the Klaw and some other parts (e.g. all the heatshields) do not allow crossfeed or resource transfer through them, they also have a note in the parts description that tells you that. One way to go around it is to change the corresponding difficulty option. Another way - which is more useful for heatshields, but not so much for the Klaw - is to place two fuel ducts that bypass the \u0022offending\u0022 part, one duct for each direction. That will then also allow resource transfers. And finally: freshly created fuel from an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E unit will be deposited in any applicable fuel tank, regardless of any non-crossfeed parts in between. I use that latter feature for my \u0022universal refueling rover\u0022.\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"}]}