{"TopicId":195044,"ForumId":69,"TopicTitle":"Game won\u0026#039;t launch","CreatedByName":"Guille2","CreatedById":205736,"CreatedDateTime":"2020-06-25T22:57:30Z","PageNum":1,"Articles":[{"CreatedByName":"Guille2","CreatedById":205736,"CreatedDateTime":"2020-06-25T22:57:30Z","Content":"\n\u003Cp\u003E\nFirst of all, thank you in advance for your help. A couple of days ago while I was playing ksp I got a frown face blue screen on my computer, so I had to restart it. Once it had restarted I tried to launch the game and for a couple of seconds I would see this dialogue https://imgur.com/a/MfSbFJq and the game wouldn\u0027t launch. It has done the same thing since then.\u003Cbr\u003E\u003Cbr\u003E\nI have tried reinstalling the game(deleting every KSP file at the steam directory before reintalling), reinstalling steam as a whole, restarting my computer, verifing the integrity of my files and reinstalling windows without any success. I don\u0027t know what else I can try. The game runs completly fine when in windows safe mode.\u003Cbr\u003E\u003Cbr\u003E\nThank you very much for reading\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-25T22:58:56Z\u0022 title=\u002206/25/2020 10:58  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 25, 2020\u003C/time\u003E by Guille2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2020-06-26T08:44:18Z","Content":"\n\u003Cp\u003E\nWe\u0027re glad to help but a wee bit more data would be helpful.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022100668\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8508405709\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83213-stock-support-bug-reporting-guide/\u0026amp;do=embed\u0022 style=\u0022height:214px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TanTan13","CreatedById":205758,"CreatedDateTime":"2020-06-26T22:02:50Z","Content":"\n\u003Cp\u003E\nHi sorry this isn\u0027t an answer but I have run into an almost identical issue on wednesday (24th) and have had multiple bluescreens since, all whilst trying to launch kerbal. I saw this post was recent when I checked the forum so I thought I might give some info about my problem as well seeing as it seems almost identical, I hope that\u0027s OK. Just as a note I updated my driver and windows just after the issue, but I think windows might pre-prepare certain parts of updates so I\u0027m wondering whether it could be Win 10 v 2004 that\u0027s causing the issue. He\u0027re some info about the error data I\u0027m getting:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EVersion\u003C/strong\u003E Steam 64 bit Unmodded (never modded) fresh Install this month, build id = 02788 (I\u0027ve tried reinstalling since crash but I assume it is the same version)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWhat Happened \u003C/strong\u003EBluescreen in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with driver_power_state message (I think that\u0027s the graphics card), followed by crashes of ksp and then bluescreens when trying to relaunch game. same BSOD error or sometimes VIDEO_TDR_FAILURE what failed nviddmkm.sys , also obv the graphics card.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAttempted fixes \u003C/strong\u003Eupdating windows, updating gtx driver, reinstalling sed driver using direct dowload instead of GeForce Expr,  reinstalling kerbal (after deleting all files and disabling steam cloud sync), running in opengl mode, forcing ksp to used Intel UHD instead of gtx card \u003Cem\u003E(none worked)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELogs \u003C/strong\u003EKsp log doesn\u0027t seem to say much to me, but the DXdiag has some errors, not that I really know what I\u0027m looking for \u003Ca href=\u0022https://pastebin.com/SM0FjUSC\u0022 rel=\u0022external nofollow\u0022\u003EPlayer Log\u003C/a\u003E \u003Ca href=\u0022https://pastebin.com/UybkCmas\u0022 rel=\u0022external nofollow\u0022\u003EDxDiag\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThanks so much for any help! I hope this isn\u0027t hijacking the post but seeing as the issue seems so similar, and with recent updates to both Win 10 and Nvidea drivers coinciding I think it seems likely they are related issues and seeing as I know enough about computers to gather the relevent log files quickly I thought I\u0027d chip in if that\u0027s OK.\n\u003C/p\u003E\n\u003Cp\u003E\nMy first thought was this was some issue with Unity caused by recent updates and specific hardware configs, seeing as other games seem to work fine (e.g. rocket league which uses unreal), but the fact that It still crashes when using intel graphics makes me unsure (I got a strange error message when I tried that and got BSOD but I can\u0027t remeber what it was), but I expect some of you know a lot better than me.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks again and sorry if me adding my own problem is bending the rules a bit but I hope my info might help \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2020-06-27T12:24:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223810135\u0022 data-ipsquote-contentid=\u0022195044\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221593208970\u0022 data-ipsquote-userid=\u0022205758\u0022 data-ipsquote-username=\u0022TanTan13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, TanTan13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n driver_power_state\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat indicates some mismatch between your gpu drivers and your hardware.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically your OS tells your GPU to wake up, and it answers \u0027huh?\u0027\n\u003C/p\u003E\n\u003Cp\u003E\nA quick search lead me to \u003Ca href=\u0022https://forums.tomshardware.com/faq/fix-windows-10-driver-power-state-failure-error.2752242/\u0022 rel=\u0022external nofollow\u0022\u003Ethis advice from a good source\u003C/a\u003E (I\u0027ve freed myself from windows for some years now).\n\u003C/p\u003E\n"},{"CreatedByName":"TanTan13","CreatedById":205758,"CreatedDateTime":"2020-06-27T20:13:18Z","Content":"\n\u003Cp\u003E\nHi again, thanks for the suggestion Curveball. Unfortunately when I looked at the power settings suggested in the article they were already set to max performance (both plugged in and out). As I said I already updated my driver and I actually have my wireless disabled so I don\u0027t think it would be that. I have previuosly seen this driver_Power_state error when using Nvidea\u0027s raytracing render engine Iray, which I belived to be caused by the program to try to overload the VRAM when using large texture assets (as the engine loads all assets into vram unlike msot which can use system RAM), and this causing the gpu driver to get upset \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E. I think it can be range of driver related issues; according to other posts online this error is also often caused with a new driver install, and thus before I saw your post I tried someting else:\n\u003C/p\u003E\n\u003Cp\u003E\nI downloaded the previous driver for my 1050 off Nvidea\u0027s website and doing a clean install of that (uninstalling the card driver using device manager, updating devices in the manager and then installing the driver from the downloaded file selecting custom install and clean install tickbox) and this seems to have at least mitigated the problem. I haven\u0027t yet had another BSOD whilst trying to run kerbal, and after about 10-15 mins of intermittent \u0022not responding\u0022 from KSP I actually managed to get to the Main menu which I hadn\u0027t done before. I am now going to see if I can actually play the game but this seems to have at least stopped the BSOD.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know if \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E is still here but I would just wonder if he has a laptop as I do as I suspect this problem is some combination of Nvidea/Win 10 updates and specific hardware combinations (weirder ones often being found in laptops I believe) causing a problem with something Unity. I know the KSP update\u0027s coming very soon so maybe this might fix it if we\u0027re lucky, though i won\u0027t hold out hope. I think I ought to report this as a bug to Nvidea although I\u0027m not really sure whose end this problem is on (I have always suffered from slow load times which may have been caused by a Unity bug as I understand from common issues page so maybe this is related?).\n\u003C/p\u003E\n\u003Cp\u003E\nanyway sorry for wall of text but here is a list of what I am doing at the moment if it might help others:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E1) updated to windows 2004\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E2) done a clean KSP install after deleting all files manually as well a uninstall from steam, and disabling cloud sync\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E3) using\u003C/strong\u003E \u0022\u003Cstrong\u003E-force-glcore\u0022 in launch options\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E4) initially updated graphics driver BUT THEN uninstalled and then reinstalled and  older driver (446.14  notebook for my gtx 1050, dont know what \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E has)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Eonly afer (4) did my issue seem to resolve, but other steps may also be necessary\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nif \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E sees this you seem to know what you\u0027re doing so I won\u0027t link a turorial, but I can probably find the one I used to do the clean driver install using device manager if he needs it.\n\u003C/p\u003E\n\u003Cp\u003E\nWill continue testing this fix, but i hope it might help \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}