{"TopicId":195201,"ForumId":39,"TopicTitle":"Building a Refueling Space Station on an asteroid.","CreatedByName":"Jose Tortola","CreatedById":205642,"CreatedDateTime":"2020-07-01T17:33:45Z","PageNum":1,"Articles":[{"CreatedByName":"Jose Tortola","CreatedById":205642,"CreatedDateTime":"2020-07-01T17:33:45Z","Content":"\n\u003Cp\u003E\nA couple of days ago while playing fully stock career mode, I found that a E-class asteroid was already captured on a extremely big and elliptical orbit around Kerbin. Don\u0027t know how or when it happened, it just where there.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I spent a lot of time, crafts and fuel to park it on a closer and circle-ish kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot227.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/sjLSkVF/screenshot227.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOnce parked, there were still some mineral left on the asteroid, so I decided to try to build some kind of refueling space station on it. Building different parts of it and assembling them up there.\n\u003C/p\u003E\n\u003Cp\u003E\nThis was the begining of the assembly. Main core´s transport vehicle (left) approaching to dock on the mining complex of the asteroid while other ship scavenges the fuel left.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot241.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/zNmv3VT/screenshot241.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMain core and docking wing assembled\u003Cimg alt=\u0022screenshot242.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/n7SFhn1/screenshot242.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd this his how it\u0027s going so far. A fueling craft reloading after launch on his way to refuel another space station around Minmus. Refueling station with habitation module already assembled:\u003Cimg alt=\u0022screenshot247.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/R3yHVnM/screenshot247.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe build is still in progress. I have planed some more expansions.\n\u003C/p\u003E\n\u003Cp\u003E\nThe asteroid will run out of mineral in some near future, probably not as fast as I almost ran out of funds while constructing this on a career game, but I\u0027m completing some other contracts to recover the economy and I hope I can use this station to reduce wheight and costs in order to launch some interplanetary fleet to visit as much as I can of the Kerbol system.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd, to be honest, probably this won\u0027t be an economic profitable project, but I\u0027m having a lot of fun \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jose Tortola","CreatedById":205642,"CreatedDateTime":"2020-07-02T01:06:45Z","Content":"\n\u003Cp\u003E\nJust upgraded this station with a passenger terminal and some science devices.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot250.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/HHCGvfq/screenshot250.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s absolutely no available purpose to justify going on making thighs bigger. But I\u0027m just enjoying building and docking \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}