{"TopicId":195379,"ForumId":16,"TopicTitle":"i think i messed up with communication, any way to recover?","CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-07-06T12:47:34Z","PageNum":1,"Articles":[{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-07-06T12:47:34Z","Content":"\n\u003Cp\u003E\ndespite reading the wiki pages, i never understood much how communication works.\n\u003C/p\u003E\n\u003Cp\u003E\nso, i sent to minmus a probe with a HECS core. I have a level 3 tracking station. i didn\u0027t worry about communication, i don\u0027t have to relay science. and i lost control of it. now i see that probe cores, regardless of type, only reach as far as 75% the distance of minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nok, i have a space station coming to minmus orbit with a HG-5 high gain antenna. i was hoping this would help, as it has relay capacity. but the station is now two-thirds along the way, and still i can\u0027t control the probe. I also will send a new module with the strongest RA100 antenna to the space station as soon as i have it unlocked, but the probe itself has no relay antenna, at this point i\u0027m not sure it will be able to use the station as communication bridge.\n\u003C/p\u003E\n\u003Cp\u003E\ndid i lost control of my probe forever? or getting a relay antenna close to them will let me recover it?\n\u003C/p\u003E\n"},{"CreatedByName":"Entropian","CreatedById":205453,"CreatedDateTime":"2020-07-06T13:12:31Z","Content":"\n\u003Cp\u003E\nGetting a relay close should fix it.  Right click an antenna in the partlist and in the menu there\u0027s a range of ranges (pun unintended) for different level tracking stations.  If the nearest relay or groundstation is out of that range, the probe loses connection.  If you click on a probe core, one of the modules has a built in antenna, but it\u0027s really short range and definitely can\u0027t reach Kerbin from Minmus.  Even if you aren\u0027t transmitting science, you still need an antenna to control the craft.  Whenever you send any satellite, put an antenna on it.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-07-06T14:07:06Z","Content":"\n\u003Cp\u003E\nso, with a relay antenna close enough, it should recover?\n\u003C/p\u003E\n\u003Cp\u003E\ni have another probe, around mun, with a similar setup. and it loses contact when on the dark side of mun, of course. now i have a space station, also with a HG5 antenna, orbiting mun. i checked, and the positions were all good: the ship could see the station, and the station could see kerbin. but still no control.\n\u003C/p\u003E\n\u003Cp\u003E\nalso, i think there are some underlying bugs, because at some point with yet another mun orbiter, this one with an antenna and with both a probe core and a command pod with a pilot, i lost control and the game told me there was nobody in the command pod. reloading fixed this particular issue.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-07-06T14:54:08Z","Content":"\n\u003Cp\u003E\nA naked probe core has an antenna \u0022power\u0022 of 5000. An HG5 has a \u0022power\u0022 of 5 million. To calculate the maximum range for communication between a probe core and an HG5, you multiply and take the square root. Which equals 158km. So don\u0027t expect to get into communication until you are closer than that.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-07-06T15:26:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223815913\u0022 data-ipsquote-contentid=\u0022195379\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594047248\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA naked probe core has an antenna \u0022power\u0022 of 5000. An HG5 has a \u0022power\u0022 of 5 million. To calculate the maximum range for communication between a probe core and an HG5, you multiply and take the square root. Which equals 158km. So don\u0027t expect to get into communication until you are closer than that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\noh, i see. now i understand how it works. so, the station won\u0027t be close enough in orbit to support communication for now, but it will be once i upgrade it with the RA100\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-07-07T11:11:55Z","Content":"\n\u003Cp\u003E\nFor communicating with probes around Minmus you should always include an antenna: even a basic Communotron 16/16S has many times the range of the feeble built-in probe antenna and will communicate directly with ground stations, and for relays a single RA-2 is more than sufficient within Kerbin’s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. An RA-100 is massive overkill and should really be used when travelling out past Duna.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2020-07-07T13:44:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223816420\u0022 data-ipsquote-contentid=\u0022195379\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594120315\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd for relays a single RA-2 is more than sufficient within Kerbin’s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOr, if you like redundancy , just stick a HG-5 in any craft the goes beyond \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. \n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-07-07T15:34:22Z","Content":"\n\u003Cp\u003E\nRA-100 is an overkill for now, but i like to apply it to all my space station and stationary satellites anyway, so that by the time i get beyond duna, i already have a deep space network.\n\u003C/p\u003E\n\u003Cp\u003E\nanyway, turned out my second minmus probe had a RA5 (i was afraid i\u0027d lose contact with it too, i forgot i gave it an antenna), so i recovered contact once it was closer\n\u003C/p\u003E\n\u003Cp\u003E\nthanks to all who answwered\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2020-07-08T01:46:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223816509\u0022 data-ipsquote-contentid=\u0022195379\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594136062\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRA-100 is an overkill for now, but i like to apply it to all my space station and stationary satellites anyway, so that by the time i get beyond duna, i already have a deep space network.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is probably still a waste of good antennas. \n\u003C/p\u003E\n\u003Cp\u003E\nTo explain why we need to take a look at antenna ranges. We may do the math to it ourselves but someone already worked it in that nice tool we will use instead:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022128643\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5980187888\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/149099-commnet-signal-strength-calculator-antenna-selector/\u0026amp;do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nWe notice that a RA-100 is stronger that a lvl2 ground station and if we combine at least 4 it is also stronger than a lvl3 ground station. So what is the matter?\n\u003C/p\u003E\n\u003Cp\u003E\nWell, if those RA-100 are connecting to anything around Duna weaker than other RA-100 then it gives your worse connection than a lvl 2 tracking station(you should have a lvl3 by that time) connecting to a relay with a single RA-100 around Duna(which allow to reach Duna even when in ti max distance from Kerbin) make it a lvl3 tracking station and a pair of RA-100 and it give us a signal strength no lower than 92% (if you are concerned with science transmission at this point). So, they not only are overkill for Kerbin but they are also too far way from Duna to give any real advantage there. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-08T01:54:15Z\u0022 title=\u002207/08/2020 01:54  AM\u0022 data-short=\u00224 yr\u0022\u003EJuly 8, 2020\u003C/time\u003E by Spricigo\u003C/strong\u003E\n\u003C/span\u003E\n"}]}