{"TopicId":195542,"ForumId":44,"TopicTitle":"How Overpowered Scifi Space Combat Would Be","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-07-11T14:30:46Z","PageNum":4,"Articles":[{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-07-22T13:19:36Z","Content":"\n\u003Cp\u003E\nGoing back to the topic for a bit. Say that there\u0027s a cannon that fires not antimatter, but the reaction products of the antimatter\u0027s annihilation, basically something halfway between an antimatter shaped charge and an antimatter-pumped laser. Realistically how powerful would it be?\n\u003C/p\u003E\n\u003Cp\u003E\nGiant frak-off cone of death?\n\u003C/p\u003E\n\u003Cp\u003E\nBig radiation flash with a little sunburn on the side?\n\u003C/p\u003E\n\u003Cp\u003E\nTo avoid the magazine detonation issue, the weapon is not pre-loaded with antimatter but rather, the weapon contains a compact particle accelerator that synthesizes the antimatter in situ prior to firing. This, of course, means that it takes the weapon several minutes to build up reaction mass and once it\u0027s fully charged, it \u003Cem\u003Emust\u003C/em\u003E be fired or else it\u0027ll detonate with nuclear force.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-22T13:19:49Z\u0022 title=\u002207/22/2020 01:19  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 22, 2020\u003C/time\u003E by Fraktal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-22T13:34:39Z","Content":"\n\u003Cp\u003E\nThe only long-lasting products of the antimatter annihilation are photons, and they are flying in opposite directions, so can\u0027t be focused without hitting the shooter.\n\u003C/p\u003E\u003Cp\u003E\nIf you can produce the antimatter onboard, your ship has enough delta-V to ram into their planet and finish the war.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-22T14:09:37Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EInteresting fact.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDo you know that you can defeat another civilization with just one properly equipped and trained space trooper?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIf properly take the aim and accelerate him to relativistic speed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2020-07-22T14:53:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824411\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595423976\u0022 data-ipsquote-userid=\u0022184990\u0022 data-ipsquote-username=\u0022Fraktal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Fraktal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGoing back to the topic for a bit. Say that there\u0027s a cannon that fires not antimatter, but the reaction products of the antimatter\u0027s annihilation, basically something halfway between an antimatter shaped charge and an antimatter-pumped laser. Realistically how powerful would it be?\n\u003C/p\u003E\n\u003Cp\u003E\nGiant frak-off cone of death?\n\u003C/p\u003E\n\u003Cp\u003E\nBig radiation flash with a little sunburn on the side?\n\u003C/p\u003E\n\u003Cp\u003E\nTo avoid the magazine detonation issue, the weapon is not pre-loaded with antimatter but rather, the weapon contains a compact particle accelerator that synthesizes the antimatter in situ prior to firing. This, of course, means that it takes the weapon several minutes to build up reaction mass and once it\u0027s fully charged, it \u003Cem\u003Emust\u003C/em\u003E be fired or else it\u0027ll detonate with nuclear force.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou’d get a burst of gamma rays and a fairly underwhelming pulse of short-lived particles. As in half lives measured in microseconds.\n\u003C/p\u003E\n\u003Cp\u003E\nThe gamma rays would do more harm to you than the enemy in much the same way that an exploding pistol barrel is going to hurt the shooter more than their target.\n\u003C/p\u003E\n\u003Cp\u003E\nThe charged particles could be used as a weapon but only a severely underwhelming one. Pure antimatter rockets (where the rocket exhaust is made of the particles produced by the matter-antimatter reaction) have been studied and basically you get ludicrous \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E (because your exhaust velocity is close to light speed) but pitiful thrust (because you don’t actually have that much exhaust). In KSP terms imagine using the Dawn ion engine as a weapon.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be honest you’d be better off using that compact particle accelerator as your weapon and skipping the antimatter production.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-22T14:59:24Z\u0022 title=\u002207/22/2020 02:59  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 22, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2020-07-22T15:25:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, rough estimation for a carrier-sized spaceship is ~1000\u002B km.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nAs there is no sense in one bomb per heavy cruiser, an AM-armed ship will destroy allied forces in tens of thousands of kilometers radius, causing a chain reaction of their explosions.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if place ships too close, they can\u0027t assist each other and are not a fleet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEven 10000 km or 100000 km are short distances in interplanetary space. You can also change numbers to whatever you want. It is not obvious that antimatter driven space destroyer from year 5350 is even on the same order of magnitude in size that largest current marine warcrafts. It is also impossible to say much about combat tactics of such fleet. It depends also on defenses. In my opinion it is not good fiction to assume antimatter stuff but think that such missiles are impossible to detect. If it will be possible to build such missiles, which can close to destroy range without noticed, large ships and command centers may be obsolete. There can be large number of missiles hiding in Kuiper and asteroid belt and waiting command to hit somewhere. At least fleets with small distances will be obsolete.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-22T17:24:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824462\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595431533\u0022 data-ipsquote-userid=\u0022154334\u0022 data-ipsquote-username=\u0022Hannu2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Hannu2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt is not obvious that antimatter driven space destroyer from year 5350 is even on the same order of magnitude in size that largest current marine warcrafts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf they still need destroyers, I\u0027m sure they are of reaonable nowadays size, from tens to hundreds of meters.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause otherwise they should be fortresses exchanging with long distance strikes and non-maneuverable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf they are maneuverable, then they can just evade even from laser hits. Photon needs a second to pass 300 000 km, so you should just trace the enemy emitter position and predict the shot moment due to his gun preparation (recharging, pre-shot warming, etc).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824462\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595431533\u0022 data-ipsquote-userid=\u0022154334\u0022 data-ipsquote-username=\u0022Hannu2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Hannu2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn my opinion it is not good fiction to assume antimatter stuff but think that such missiles are impossible to detect.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey can be detected: as any another warm body; as a hole in vacuum filled with matter; by the permanent emission of 0.511 MeV photons, etc.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824462\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595431533\u0022 data-ipsquote-userid=\u0022154334\u0022 data-ipsquote-username=\u0022Hannu2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Hannu2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAt least fleets with small distances will be obsolete.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAny fleet will be obsolete. Compare the ratio of the fleet maneuvers along and across the battle \u003Cs\u003Efield\u003C/s\u003E \u003Cs\u003Epool\u003C/s\u003E \u003Cs\u003Elake\u003C/s\u003E sea. They are 2d. Space battles can be only 1d, like a knight tournament of late medieval.\u003Cbr\u003E\nYou build one-battle fleets of expendable crewless carriers of single-shot self-propelled emitters (gamma-lasers or particle beamers) and throw them massively into the opponent\u0027s fleet approaching to you.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, somebody destroys the opponent\u0027s shipyard and the war finishes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-22T17:27:41Z\u0022 title=\u002207/22/2020 05:27  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 22, 2020\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-07-22T17:45:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824451\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595429587\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo be honest you’d be better off using that compact particle accelerator as your weapon and skipping the antimatter production.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey\u0027re already doing that with particle accelerators that spit out \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tau_(particle)\u0022 rel=\u0022external nofollow\u0022\u003Etau particles\u003C/a\u003E flying at high c-fractional speeds (to make the particle last long enough to actually hit the target before decaying). The idea behind those is that they deal damage via kinetic force, making them extremely accurate (high kinetic energy means they don\u0027t get pulled off-course by electromagnetic fields enough for it to matter) and highly armor-penetrating, to the point where a couple rapid-fire guns applied at broadside could turn even the most heavily armored battleship into swiss cheese.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the weapon\u0027s penetrating power is also its main drawback: shots tend to go in one side and come out the other side with little internal damage unless they hit something vital. Thus, simply blind-firing it at the other ship\u0027s silhouette just doesn\u0027t have the same stopping power as a spinal railgun or ship-to-ship cruise missile unless you know the other ship\u0027s internal layout and can target vital systems (since I\u0027m explicitly not giving anyone in the setting magical detect-everything sensors; they have visual, infrared, radar and gravimetric, which is the relativistic gravity well equivalent of passive sonar).\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-07-22T18:04:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824462\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595431533\u0022 data-ipsquote-userid=\u0022154334\u0022 data-ipsquote-username=\u0022Hannu2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Hannu2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven 10000 km or 100000 km are short distances in interplanetary space. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDo note that there\u0027s absolutely no reason for combat to take place in interplanetary space. Also, at some point you will start to run into pointing accuracy problems. Basically, even a laser won\u0027t hit if you can\u0027t aim it at the enemy. The bigger you laser, the harder it is to turn and aim, but you can\u0027t make it too small without killing its efficiency. Those factors mean that 100000km would likely be beyond any non-guided weapon\u0027s effective range, and practical combat ranges would be much shorter.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-22T18:58:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824518\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595439948\u0022 data-ipsquote-userid=\u0022184990\u0022 data-ipsquote-username=\u0022Fraktal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Fraktal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHowever, the weapon\u0027s penetrating power is also its main drawback: shots tend to go in one side and come out the other side with little internal damage unless they hit something vital.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEverything coming out the other side is a lost power, and there is no need to pierce. You should just break the structural integrity.\n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-07-22T19:44:35Z","Content":"\n\u003Cp\u003E\nAh, but that\u0027s the thing: the only reason why those shots even reach the target is because the particles it fires have a very short half-life, so they must be fired at a muzzle velocity where relativistic time dilation is a factor. Dial down the power and the shot won\u0027t even reach one kilometer before evaporating.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway. The idea is meant to be that yes, the setting has energy weapons, but they don\u0027t replace kinetic weapons or even missiles because all of these weapon types are useful in their own use-cases. Just the other day I was also considering a ship-to-ship torpedo type that basically takes a large missile but strips out the explosive payload in favor of solid tungsten/uranium. It\u0027s lobbed off at the target with a railgun operating under reduced power compared to a normal projectile (that is, launching the torpedo with the same muzzle velocity as a normal railgun shot would tear the railgun apart), drifts under momentum until a certain pre-set distance, then fires up its engine at full blast to maximize impact velocity and provide limited terminal guidance a normal railgun shell doesn\u0027t have while simultaneously being harder to shoot down with CIWS due to being little more than a solid metal slug with an engine on one end. Again, no explosive warhead, just pure kinetic energy. Of course, if it misses the target during terminal approach, it\u0027ll be going too fast to turn back around for another pass like a normal missile could.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-07-22T20:45:18Z","Content":"\n\u003Cp\u003E\nScience fiction... it\u0027s not the starship science wants that matters but the starship that physics and plot deserves.\n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-07-23T01:03:19Z","Content":"\n\u003Cp\u003E\nYeah but if the tech doesn\u0027t stand up to the science for at least a cursory glance, you can be damn sure someone will nitpick about it.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-07-23T02:06:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824695\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595466199\u0022 data-ipsquote-userid=\u0022184990\u0022 data-ipsquote-username=\u0022Fraktal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Fraktal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah but if the tech doesn\u0027t stand up to the science for at least a cursory glance, you can be damn sure someone will nitpick about it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy concern is with the ignorant, not the nitpickers who know the latest in space technology.\n\u003C/p\u003E\n\u003Cp\u003E\nThus in the foreword I will admit freely that some of my stuff (constant acceleration engines) are pure fiction powered by the needs of plot. That said, I take pains to ensure all of the plot enabler fictional tech have something that will counter them from being overpowered. I do not favor being merely arbitrary, so wherever possible, I use things that are subject to known science that could counter constant acceleration engines as a threat.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824510\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595438651\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf they still need destroyers, I\u0027m sure they are of reaonable nowadays size, from tens to hundreds of meters.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause otherwise they should be fortresses exchanging with long distance strikes and non-maneuverable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf they are maneuverable, then they can just evade even from laser hits. Photon needs a second to pass 300 000 km, so you should just trace the enemy emitter position and predict the shot moment due to his gun preparation (recharging, pre-shot warming, etc).\n\u003C/p\u003E\n\u003Cp\u003E\nThey can be detected: as any another warm body; as a hole in vacuum filled with matter; by the permanent emission of 0.511 MeV photons, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nAny fleet will be obsolete. Compare the ratio of the fleet maneuvers along and across the battle \u003Cs\u003Efield\u003C/s\u003E \u003Cs\u003Epool\u003C/s\u003E \u003Cs\u003Elake\u003C/s\u003E sea. They are 2d. Space battles can be only 1d, like a knight tournament of late medieval.\u003Cbr\u003E\nYou build one-battle fleets of expendable crewless carriers of single-shot self-propelled emitters (gamma-lasers or particle beamers) and throw them massively into the opponent\u0027s fleet approaching to you.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, somebody destroys the opponent\u0027s shipyard and the war finishes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt would require a civilazation with either war experience fighting itself, or a peaceful one that is paranoid enough to do that.\n\u003C/p\u003E\n\u003Cp\u003E\nSince we are talking about putting an UNMANNED fleet in orbit ready to strike anywhere from a year to decades later or longer. In the meantime they do ABSOLUTELY nothing, waiting for a threat from space that may or may not come.\n\u003C/p\u003E\n\u003Cp\u003E\nLOL. Better use some propellant that won\u0027t gas leak during the long wait for action.\n\u003C/p\u003E\n\u003Cp\u003E\nEven assuming scifi aliens do exist in a universe, they may be not be keen on attacking a system with automated fleets ready to strike at explorers/instruders.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-23T02:07:37Z\u0022 title=\u002207/23/2020 02:07  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 23, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SOXBLOX","CreatedById":204106,"CreatedDateTime":"2020-07-23T03:11:44Z","Content":"\n\u003Cp\u003E\nShip to ship probably won\u0027t even occur; war would be lobbing interplanetary torch missiles and waiting.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-07-23T04:44:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824746\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595473904\u0022 data-ipsquote-userid=\u0022204106\u0022 data-ipsquote-username=\u0022SOXBLOX\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SOXBLOX said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nShip to ship probably won\u0027t even occur; war would be lobbing interplanetary torch missiles and waiting.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell... depends on how expendable the spacecraft are. And how the writer makes things go.\n\u003C/p\u003E\n\u003Cp\u003E\nUnmanned are by their very nature expendable.\n\u003C/p\u003E\n\u003Cp\u003E\nMy idea of scifi combat means a homeworld fleet generates jump points a light second from any world  with 1g or higher gravity, and each jump point will only accept the ship that generated it\u0027s own jump point. Jump points stay active for 7 hours, more than long enough to reach them at constant 1g (their fleet can do that).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nInstead of sending crew to possibly die in vessels as is common in scifi media, they send waves of unmanned vessels, which conserve their momentum and trajectory upon entering a new solar system, and the jump point closes after the vessel appears.\n\u003C/p\u003E\n\u003Cp\u003E\nTactically and strategically it means war is very much a waiting and hoping kind of affair.\n\u003C/p\u003E\n\u003Cp\u003E\nHoping that your AI controlled vessels return within a day or two via jump points with news of victory.\n\u003C/p\u003E\n\u003Cp\u003E\nIf they don\u0027t return at all... now people will panic and start preparing for a defend the homeworld system with everything they have... most of it unmanned spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRelativistic strikes via jump points are possible, but it would take months of acceleration and you only get one chance... you miss at 99% lightspeed and it will take you months to turn around and go to the light second from 1g world or higher radius where jump points can form.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-23T04:54:43Z\u0022 title=\u002207/23/2020 04:54  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 23, 2020\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2020-07-23T07:31:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824528\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595441093\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo note that there\u0027s absolutely no reason for combat to take place in interplanetary space.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think that living on planets may be obsolete if 1t antimatter bombs are military weapons. Couple of such bombs would change planet\u0027s atmosphere unusable and spread radioactivity everywhere on surface. It is probably better to distribute people to many huge stations around solar system. Stations are much more difficult to hit and easier to defend.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, at some point you will start to run into pointing accuracy problems. Basically, even a laser won\u0027t hit if you can\u0027t aim it at the enemy. The bigger you laser, the harder it is to turn and aim, but you can\u0027t make it too small without killing its efficiency. Those factors mean that 100000km would likely be beyond any non-guided weapon\u0027s effective range, and practical combat ranges would be much shorter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think also so. Beams are not credible technomagic weapons, if we do not assume completely new natural laws. Missiles may be able to imitate asteroids, but probably very sophisticated detectors can detect and destroy them before they are in damaging range. Actually I would bet that there are completely new methods for warfare. Cyber attack to enemy stations living support system or using nanobots or some new exotic technology may be more practical way to destroy enemy units than high energy or brute force. Or maybe warfare will be just too disadvantageous to all forces. Most wars are competition for limited resources but there are practically infinite resources in space.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-23T11:39:30Z","Content":"\n\u003Cp\u003E\nSo, you can just send a homing missile with a single-shot beamer onboard, to get close and make headshot.\n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2020-07-23T12:46:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824771\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595479491\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRelativistic strikes via jump points are possible, but it would take months of acceleration and you only get one chance... you miss at 99% lightspeed and it will take you months to turn around and go to the light second from 1g world or higher radius where jump points can form.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\numm, if you are at 99% of light speed, then it takes all of 1.01 seconds to travel 1 light second away from your target, so you might just get to make a second try before the observation station has a chance to send out the alert...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if you have access to a sizeable black hole(such as a galactic core), it might only take a few hours(and some very precise timing) to accelerate a vessel to relativistic speeds.  For this, larger is better as it not only gives higher acceleration further out, but also lets you get much closer(thus higher acceleration) before tidal forces rip you apart(possibly even inside the event horizon if you find one big enough).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNote: a 200 ton nickle/iron asteroid with a steel wrapper to keep it from breaking up and a remote controlled/pre-programmed jump engine is going to be far cheaper than any method of manufacturing a ton of antimatter, and when it hits something big enough(like a planet or moon), the energy released will be orders of magnitude larger.  As an added bonus, blowing up the asteroid just turns it into relativistic shrapnel and thus it will be even more devastating.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-23T13:08:24Z","Content":"\n\u003Cp\u003E\nBy having a black hole, you can get close to its horizon, and wait a little while your enemies are getting extinct.\n\u003C/p\u003E\n\u003Cp\u003E\nThen return with glory, dig out their petrified remains, and put them in museum.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-07-23T13:15:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223818899\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594477846\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/11/2020 at 3:30 PM, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow powerful is one ton of antimatter?\n\u003C/p\u003E\n\u003Cp\u003E\nAccording to one calculation that is 43000 megatons, with a incinerate to burn damage of a 500 kilometer radius!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAntimatter on its own interacts with itself like matter does, so is that mixing 500kg of antimatter and matter, or dropping one bit of matter into a mass of antimatter?\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-07-23T14:28:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824925\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595510102\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAntimatter on its own interacts with itself like matter does, so is that mixing 500kg of antimatter and matter, or dropping one bit of matter into a mass of antimatter?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1t\u002B1t\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-07-23T14:28:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824956\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595514489\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824925\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595510102\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAntimatter on its own interacts with itself like matter does, so is that mixing 500kg of antimatter and matter, or dropping one bit of matter into a mass of antimatter?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1t\u002B1t\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-07-23T15:07:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824913\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595508368\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\numm, if you are at 99% of light speed, then it takes all of 1.01 seconds to travel 1 light second away from your target, so you might just get to make a second try before the observation station has a chance to send out the alert...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat? How?\n\u003C/p\u003E\n\u003Cp\u003E\nInerta won\u0027t let a vessel reverse course at 99% lightspeed, these are constant acceleration 1g engines.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824920\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595509704\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBy having a black hole, you can get close to its horizon, and wait a little while your enemies are getting extinct.\n\u003C/p\u003E\n\u003Cp\u003E\nThen return with glory, dig out their petrified remains, and put them in museum.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLazy... but efficient.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-07-23T16:47:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223824528\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595441093\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo note that there\u0027s absolutely no reason for combat to take place in interplanetary space. Also, at some point you will start to run into pointing accuracy problems. Basically, even a laser won\u0027t hit if you can\u0027t aim it at the enemy. The bigger you laser, the harder it is to turn and aim, but you can\u0027t make it too small without killing its efficiency. Those factors mean that 100000km would likely be beyond any non-guided weapon\u0027s effective range, and practical combat ranges would be much shorter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgree on lasers, yes you could do tricks here like launching an missile with an mirror but for long range they start to get impractical. \u003Cbr\u003E\nOn the other hand lobbing missiles as an incoming fleet makes sense, more so as they probably get degraded sensors having to look trough their own rocket plume. On the other hand the enemy can just lighten their ships dropping off stuff \u003Cbr\u003E\u003Cbr\u003E\nAn missile in futuristic space combat has little to do with existing missiles. You have an first stage who bring the missile up to speed, however if you stop trusting you will continue so you only need an intercept trajectory. \u003Cbr\u003E\nNow the problem is that an ship is likely to have an better engine than an missile. \n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2020-07-23T18:01:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223825025\u0022 data-ipsquote-contentid=\u0022195542\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595522839\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow the problem is that an ship is likely to have an better engine than an missile. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDefine \u0022better\u0022. Higher acceleration? Unlikely. Higher \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E reserves? Perhaps, but are they high enough to both dodge missiles \u003Cem\u003Eand\u003C/em\u003E carry out the original mission \u003Cem\u003Eand\u003C/em\u003E get home? How high is that margin?\n\u003C/p\u003E\n"}]}