{"TopicId":196122,"ForumId":44,"TopicTitle":"Analysis of the Beirut explosion?!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T18:19:37Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T18:19:37Z","Content":"\n\u003Cp\u003E\nDoes anyone know what likely happened? From what I can tell it was the side building as a shipping area and an offloading building or something. (no idea what it really is.) It\u0027s next to a giant grain silo like cement building and caught fire then a very large explosion happened. The explosion had a very round shape(for the most part.) is this from being a shaped explosion(purposeful bomb or a normal container?) or just from the potential shear amount of material being stored? It also had distinct red/brown material in the air afterword. And the shockwave didn\u0027t move the heavier ploom clouds. Or the clouds in the sky. Is this normal for a shockwave. I would have thought it would have been stronger. Or does this help measure the explosive force. There are videos of it exploding from a large ways away outside the city and it had a weird riptide effect on the clouds like it past through them with minimal effect as far as positioning went.\n\u003C/p\u003E\n\u003Cp\u003E\nLots of angles: (At 2:13 you can see cracks in the cement. This is an above ground apartment. I\u0027m assuming the cracks occurred because of the explosion. I wonder if or how much of that can be repaired or would be require buildings to be demoed and rebuild?) At 2:30 you can see the remove hill view with the shockwave going through the clouds.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/CtuQEhTVxyw?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAt 13-14 seconds you can see the explosion rip into the large building next to it. Other shots show the effect from the other side afterwords.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore and after: (At 24 seconds there is a cruise liner right at the site. Does anyone know what ship it is. I wonder if it has passengers on it at the time. Bad place to park a cruise liner.) Pre pictures are from may 31\u0027s I think. different boats in the befores.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/jgOoeOPhDWY?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe hole is where the explosions occured. The building before is the building that was there previously.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 width=\u0022459\u0022 data-embed-src=\u0022https://www.youtube.com/embed/6jO0JeBMMjM?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBride explodes:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Qem6jwwEEKI?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI\u0027m assuming if this was a nuke it was a very small nuke. I\u0027m also assuming it was some form of massive chemical explosion. Someone was saying ammonia nitrate or something. Can anyone tell independently what it might have been? That or the bride exploded out of rage because she didn\u0027t like the dress!! \u0026gt;\u0026lt;\n\u003C/p\u003E\n\u003Cp\u003E\nYou can see the outside of the silo building turned to dust and is in piles next to itself. That or that is some collected material from the explosion hitting it and falling to the ground afterwords or similar.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd can sufficient number of these videos on youtube recoup the cost of the explosion?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/lpzL9hEw3UE?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T18:29:26Z\u0022 title=\u002208/05/2020 06:29  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Codraroll","CreatedById":163815,"CreatedDateTime":"2020-08-05T18:33:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832216\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596651577\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m assuming if this was a nuke it was a very small nuke. I\u0027m also assuming it was some form of massive chemical explosion. Someone was saying ammonia nitrate or something. Can anyone tell independently what it might have been?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, ammonium nitrate is the most likely explanation. It has been known since 2014 or so that a few thousand tons of it were stored in the warehouse that went up. Apparently it was taken from a confiscated Russian vessel and then kept on storage in the warehouse because there were no plants nearby that could receive it (and/or there were uncertainties about whose responsibility it was to pay for that). A source I saw in a Norwegian newspaper also mentioned that it fits the colour of the smoke cloud, but I don\u0027t know enough chemistry to verify that.\n\u003C/p\u003E\n\u003Cp\u003E\n2700 tons of ammonium nitrate has a blast yield roughly equivalent to 1500 tons or 1.5 kT of TNT. That\u0027s around a tenth of the Hiroshima bomb. However, thanks to the square-cube law (the blast dissipating proportionally to the cube of the distance), its blast force at any given distance from the epicenter would be around half that of the Hiroshima bomb at the same distance. Hence why it looked like a nuclear explosion; it was essentially as big as one. Of course, nuclear weapons tend to release a lot more energy in the form of thermal radiation which then superheats the air and creates a shock wave, while this was a chemical detonation, so the blasts look a lot different in practice. A nuclear blast would have included a lot more light and heat, I think (but possibly less of a shock wave? I\u0027m not sure).\n\u003C/p\u003E\n\u003Cp\u003E\nAs this was a ground blast it wouldn\u0027t affect the clouds in the sky as much as an air-detonated nuke does. The clouds in the sky are very far away, after all, and there isn\u0027t enough (thermal radiation?) energy to reach that far. The cloud would be spherical because, well, when 2700 tons of ammonium nitrate explodes, it has enough force to expand equally in all the directions it pleases. Minus down, of course, because that\u0027s where the ground is. A bit of the ground tends to move out of the way too (crater), but most of the energy goes unimpeded skywards forming a sphere.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I think most of West Beirut should be pretty grateful for that silo standing there. Its great concrete structure likely helped divert some of the energy away from the city center. The downside is, of course, that 85% of Lebanon\u0027s grain reserves were located in that silo. I don\u0027t think any of it could be salvaged now. And Lebanon is in... kind of a situation ... already, so they\u0027d really have liked to get to keep that grain. But yeah, props to the silo for taking the brunt of the blast in that direction anyway. It\u0027s likely easier to replace that grain than what would have been flattened had the silo not been there.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T18:34:18Z\u0022 title=\u002208/05/2020 06:34  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Codraroll\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T18:55:50Z","Content":"\n\u003Cp\u003E\nThere was also a fire with a grey plume first. Then the big explosion with the red dust came up. I wonder what caught on fire first to cause the explosion. You could see a lot fires all over that building. In the first 15 seconds of the first video you can see a bunch of fire shooting out and lightning or electrical stuff going off in or near the grey plume.\n\u003C/p\u003E\n\u003Cp\u003E\nI also prescribe to the theory that the bride was also possibly miffed with something about the wedding and it remotely cause the initial fire that then detonated the ammonium nitrate! 8)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T18:58:14Z\u0022 title=\u002208/05/2020 06:58  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2020-08-05T19:00:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832224\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596653750\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere was also a fire with a grey plume first\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll I saw were secondary explosions, consistent with the initial report of a fireworks storage dump.\n\u003C/p\u003E\n\u003Cp\u003E\nThen things escalated...\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-08-05T19:06:06Z","Content":"\n\u003Cp\u003E\nOr these were short circuits.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nCan\u0027t imagine how could all-Lebanon grain reserve occupy just such small building.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T19:07:54Z\u0022 title=\u002208/05/2020 07:07  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sh1pman","CreatedById":147869,"CreatedDateTime":"2020-08-05T20:14:53Z","Content":"\n\u003Cp\u003E\nSome say that red smoke is NO\u003Csub\u003E2\u003C/sub\u003E from ammonium nitrate explosion, but I don’t buy it. 1) That explosion should produce colourless N\u003Csub\u003E2 \u003C/sub\u003Einstead, 2) Other ammonium nitrate explosions didn’t produce red smoke, 3) NO\u003Csub\u003E2 \u003C/sub\u003Eis a gas, and smoke cloud looks different from a gas cloud; 4) the red cloud persisted for a long time and even reached Damascus. Gas would dissipate quickly and mix with surrounding air.\n\u003C/p\u003E\n\u003Cp\u003E\nMy guess is that the cloud is made of iron (III) oxide, maybe there were fireworks that contained iron dust in the same warehouse with ammonium nitrate.\n\u003C/p\u003E\n"},{"CreatedByName":"Entropian","CreatedById":205453,"CreatedDateTime":"2020-08-05T20:26:30Z","Content":"\n\u003Cp\u003E\nI think the more reputable sources are saying that it was ammonium nitrate that caused the explosion, and it was ignited by a welding fire.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832264\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596658493\u0022 data-ipsquote-userid=\u0022147869\u0022 data-ipsquote-username=\u0022sh1pman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, sh1pman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy guess is that the cloud is made of iron (III) oxide, maybe there were fireworks that contained iron dust in the same warehouse with ammonium nitrate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI live next to saltwater, and \u003Cem\u003E\u003Cu\u003Eliterally everything\u003C/u\u003E\u003C/em\u003E iron rusts.  Perhaps there was enough rust to color the explosion?  \u003Cspan style=\u0022font-size:10px;\u0022\u003E(I\u0027m not sure, just putting it out there) \u003C/span\u003E I used to blow up things using homemade thermite, and you can make it sparkly, slightly yellow, or even red using extra iron oxide and other materials.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: From Wikipedia:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAmmonium nitrate decomposes, not explosively, into the gases nitrous oxide and water vapor when heated\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLink: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Ammonium_nitrate#Disasters\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Ammonium_nitrate#Disasters\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe some of the ammonium nitrate didn\u0027t get burned, and got decomposed by the heat of the explosion?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T20:34:36Z\u0022 title=\u002208/05/2020 08:34  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Entropian\u003C/strong\u003E\n\u003Cbr\u003Eeenglissh\n\u003C/span\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T20:36:18Z","Content":"\n\u003Cp\u003E\nThe one thing about the shockwave was that it also didn\u0027t seem to move the preexisting grey plume right next to it. Is that normal or does that indicate something about the fire and the smoking material?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/CtuQEhTVxyw?start=120\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou can see at the 2:00 mark that the before grey plume and after the red plume forms isn\u0027t moved much.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/CtuQEhTVxyw?start=173\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNVM, at 2:56 you can see it shove the cloud a bit. I assumed it would push a lot farther and dissipate the first cloud.\n\u003C/p\u003E\n\u003Cp\u003E\nDoes the content of the grey plume have a lot of mass or do shockwaves tend to not hit other gaseous airborne things easily since it can potentially jiggle around or be pushed easily in odd directions?\n\u003C/p\u003E\n\u003Cp\u003E\nYou can see the grey and red intermixing at the bottom of the plumes. You can also see a gap in the shockwave which I\u0027m assuming is from the grain silo taking the brunt of the force. I wonder if you can use that to guestimate the energy and directional forces hitting the grain silo.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/CtuQEhTVxyw?start=221\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nYou can directly see that space form in the shock wave from the building blocking it.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/0ODP0u6ootw?start=6\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nHere is another view of the dent in the shockwave.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Eth3abSU-tE?start=35\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAre these fireworks? This is literally the roof right next to the initial fire.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T21:12:18Z\u0022 title=\u002208/05/2020 09:12  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2020-08-05T20:37:47Z","Content":"\n\u003Cp\u003E\nRed smoke is very common from ammonium nitrate.\n\u003C/p\u003E\n"},{"CreatedByName":"sh1pman","CreatedById":147869,"CreatedDateTime":"2020-08-05T20:38:18Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205453-entropian/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022205453\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205453-entropian/\u0022 rel=\u0022\u0022\u003E@Entropian\u003C/a\u003E Nitrous oxide (laughing gas) is colourless. And it only forms when ammonium nitrate decomposes slowly. But when it explodes, it forms regular nitrogen, also colourless. NO\u003Csub\u003E2 \u003C/sub\u003E(nitrogen dioxide) shouldn’t form at all in those conditions.\n\u003C/p\u003E\n"},{"CreatedByName":"Entropian","CreatedById":205453,"CreatedDateTime":"2020-08-05T20:39:48Z","Content":"\n\u003Cp\u003E\nBah!  I messed up and didn\u0027t read the names properly.  Thanks.\n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2020-08-05T20:39:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832279\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596659898\u0022 data-ipsquote-userid=\u0022147869\u0022 data-ipsquote-username=\u0022sh1pman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, sh1pman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205453-entropian/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022205453\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205453-entropian/\u0022 rel=\u0022\u0022\u003E@Entropian\u003C/a\u003E Nitrous oxide (laughing gas) is colourless. And it only forms when ammonium nitrate decomposes slowly. But when it explodes, it forms regular nitrogen, also colourless. NO\u003Csub\u003E2 \u003C/sub\u003E(nitrogen dioxide) shouldn’t form at all in those conditions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut you are wrong if you are imagining that something like this results in complete combustion.\n\u003C/p\u003E\n"},{"CreatedByName":"Entropian","CreatedById":205453,"CreatedDateTime":"2020-08-05T20:41:47Z","Content":"\n\u003Cp\u003E\nIt seems like there was some already in the air when it ignited, so it might have gotten pushed away by the shockwave before the hot gas hit it.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2020-08-05T20:56:42Z","Content":"\n\u003Cp\u003E\nWell, who knows what else was stored in or near that warehouse? Considering that almost three thousand tons of highly dangerous chemicals were gathering dust for years abandoned and almost unattended, i wouldn\u0027t be surprised if other ownerless bits and odds were stuffed in every available bit of free space..\n\u003C/p\u003E\n"},{"CreatedByName":"sh1pman","CreatedById":147869,"CreatedDateTime":"2020-08-05T20:59:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832281\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596659995\u0022 data-ipsquote-userid=\u0022137807\u0022 data-ipsquote-username=\u0022mikegarrison\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, mikegarrison said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut you are wrong if you are imagining that something like this results in complete combustion.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat’s not combustion. It’s explosive decomposition, and while I agree that there may be byproducts, the main nitrogen-containing product should still be molecular nitrogen. There are videos of ammonium nitrate explosions, and the smoke is just gray, maybe a little bit brownish. Certainly not red like in Beirut.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T21:11:22Z","Content":"\n\u003Cp\u003E\nAre these fireworks? This is literally the roof right next to the initial fire. I wonder if the person taking the video at that point survived. He ran and had some of the building possibly taking the blast.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Eth3abSU-tE?start=35\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T21:17:36Z\u0022 title=\u002208/05/2020 09:17  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-08-05T21:15:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832227\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596654047\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll I saw were secondary explosions, consistent with the initial report of a fireworks storage dump.\n\u003C/p\u003E\n\u003Cp\u003E\nThen things escalated...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes in the first video you can see secondary sharp explosions going off many time before the big explosion. I assumed it was some of these who set it off. \u003Cbr\u003E\nNow if they stored confiscated explosives there they could also be storing other stuff like mines or rocket propelled grenades. \u003Cbr\u003E\nStuff who will explode in an fire and can easy set off the \u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003Eammonium nitrate who is hard to set off might even be harder than TNT, one relative works with rock blasting and they use ammonium nitrate a lot in larger blasts. He uses half a stick of dynamite as a blasting cap is to weak. \u003C/span\u003E\u003Cbr\u003E\nSome news media say its easy to set up, now it might well be less stable after 6 years but might well be weaker too. \u003Cbr\u003E\u003Cbr\u003E\nElse @Codraroll sums it up well.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has been an good list of kiloton level explosions the last 100 years mostly with accidents but the largest ones has been tests to simulate an nuclear bomb, probably to test defenses.  \u003Cbr\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Largest_artificial_non-nuclear_explosions\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Largest_artificial_non-nuclear_explosions\u003C/a\u003E\u003Cbr\u003E\nBeirut is on the list already a bit lower but the ANFO was old, also if the depot was spread out it might explode slower reducing the damage. That is why the N1 is listed at only 1KT even if the rocket was much more energetic. \u003Cbr\u003E\u003Cbr\u003E\nNow this brings in starship, or rather superheavy. who can generate an larger explosion then N1 if it fail just after launch and fall down. \n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2020-08-05T21:26:22Z","Content":"\n\u003Cp\u003E\nThe red smoke is probably combustion of impurities. Ammonium nitrate is what Lebanon\u0027s president said was there, and there\u0027s a convincing timeline of a ship and confiscated cargo.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think conspiracy theorising helps at all. The official explanation is thousands of tons of ammonium nitrate improperly stored. There no reason to doubt that account.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T21:31:26Z\u0022 title=\u002208/05/2020 09:31  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by RCgothic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-08-05T21:28:12Z","Content":"\n\u003Cp\u003E\n2 700 t of \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E can\u0027t give 1 800 t of TNT.\n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2020-08-05T21:34:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832307\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596662892\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2 700 t of \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E can\u0027t give 1 800 t of TNT.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI haven\u0027t seen any estimates that high. Credible estimates seem to be 500-1100t TNT.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2020-08-05T21:36:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832307\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596662892\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2 700 t of \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E can\u0027t give 1 800 t of TNT.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCorrect.\n\u003C/p\u003E\n\u003Cp\u003E\nI did some pixel-tracing yesterday and came up with a yield of 0.8 to 1.5 kilotons, before there was any official discussion of how much \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E had been in the warehouse.\n\u003C/p\u003E\n\u003Cp\u003E\n2750 tonnes of \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E at 42% TNT yield comes to 1.15 kilotons. However, hydrocarbon contamination can increase the yield of \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E up to 78% (e.g. Timothy McVeigh) so that could account for higher yield. The seismic signature came to 3.3 on the Richter scale which would translate to about 1.3 kilotons.\n\u003C/p\u003E\n\u003Cp\u003E\nDefinitely not nuclear for a lot of reasons. First, the explosion is too slow. Second, the smoke is red. Third, there was no blinding flash that caused thermal radiation burns. Fourth, no nuclear-capable country would drop a nuke into a warehouse fire in a residential area.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-08-05T21:36:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832313\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596663270\u0022 data-ipsquote-userid=\u0022132560\u0022 data-ipsquote-username=\u0022RCgothic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, RCgothic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI haven\u0027t seen any estimates that high. Credible estimates seem to be 500-1100t TNT.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOfficially declared and Reddit estimations are.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2020-08-05T21:39:17Z","Content":"\n\u003Cp\u003E\nHowever I should note that this is NOT smaller than a nuclear explosion, as many people are saying. It is most likely one of the five largest non-military artificial explosions in history, right up there with the 1969 N-1 failure. Tactical fission-based battlefield nukes were well under 100 tonnes TNT equivalent, the size of large conventional munitions.\n\u003C/p\u003E\n\u003Cp\u003E\nThis explosion was comparable to medium-sized tactical nuclear weapons.\n\u003C/p\u003E\u003Cp\u003E\nFor reference, this was around 900 times more powerful than the Oklahoma City bombing.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2020-08-05T21:44:40Z","Content":"\n\u003Cp\u003E\nThis is the initial fire before the main explosion. Looking directly in the building from an adjacent rooftop. Does this give hints as to the initial fire or the substance burning or igniting?! timestamp at 35-49 seconds.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Eth3abSU-tE?start=36\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T21:46:39Z\u0022 title=\u002208/05/2020 09:46  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2020-08-05T21:45:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832216\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596651577\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe explosion had a very round shape(for the most part.) is this from being a shaped explosion(purposeful bomb or a normal container?) or just from the potential shear amount of material being stored?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s actually from the detonation velocity. Ammonium nitrate, while being less energetic per pound than ordinary black powder, has a detonation velocity of almost Mach 8, far far higher. It is at the lower end of what constitutes a high explosive (and if it is contaminated with hydrocarbons its energy can double and its detonation velocity can reach Mach 15). The spherical fireball is the result of the combustion occurring in a hypersonic mode which produces an extreme pressure wave, fully combusting the explosive.\n\u003C/p\u003E\n\u003Cp\u003E\nThe shockwave slows as it moves through the air but it is still extremely fast. The original fire heated the air around and above the warehouse, but when the shockwave reached cooler, wetter air, the rarefaction of the pressure wave caused it to form a vapor cone like a jet breaking the sound barrier. Of course it was spherical, so it was a vapor sphere rather than a vapor cone.  You can see the first pockets of cool, wet air being reached in a frame by frame:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed3228267606\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/thesejustwords/status/1290752291671281665\u0022 style=\u0022height:381px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe red smoke contains high levels of nitric acid which has been confirmed as the cause of significant secondary injury in the city.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832320\u0022 data-ipsquote-contentid=\u0022196122\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596663880\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is the initial fire before the main explosion. Looking directly in the building from an adjacent rooftop. Does this give hints as to the initial fire or the substance burning or igniting?!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe initial fire was started by a careless welder and spread into a fireworks warehouse, causing the initial explosion and all the small flashes. The initial explosion caught the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E storage warehouse on fire, and the rest was history.\n\u003C/p\u003E\n\u003Cp\u003E\nThe impact to the grain silos is immense. You can see how much of the concrete collapsed and how much was simply vaporized:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed7681284447\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/thesejustwords/status/1291081567570481154\u0022 style=\u0022height:611px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}