{"TopicId":196207,"ForumId":51,"TopicTitle":"Why Jupiter got destroyed.","CreatedByName":"GuessingEveryDay","CreatedById":203507,"CreatedDateTime":"2020-08-09T15:23:13Z","PageNum":1,"Articles":[{"CreatedByName":"GuessingEveryDay","CreatedById":203507,"CreatedDateTime":"2020-08-09T15:23:13Z","Content":"\n\u003Cp\u003E\nHey everyone! I\u0027m trying my hand at writing for a bit, if this goes well, who knows, I might get it published, but we\u0027ll see.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EWhy Jupiter Got Destroyed.\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHello, this is Geoffrey Porter. If you\u0027re reading this, then either time machines exist now, or we survived the black hole epidemic. If the latter, then Hooray! If not, this is still an interesting story. It all started in 2021, when Barnard\u0027s Star dissappeared.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11pt;\u0022\u003EAn ordinary day in 2021(check spoiler), of just checking images with the James Webb Space Telescope. Ever since one scientist predicted a black hole epidemic after a black hole popped up near Sirius, which meant it had happened 7 years ago. Leaders of the world got scared and created a new department to keep an eye on the stars, the Watchers of the Cosmos. But their nick name was the Watchers. Each Watcher had been trained on how to recognize a black hole. And one Watcher was looking at Barnard’s Star, and then he spotted a strange dot, that took a miniscule bite out of Barnard’s Star, he waited until the next day to be sure. The next day Barnard’s Star was gone. It was confirmed, there was a black hole nearly 6 light years away, and the worse part though was that it was 6 years ago, when the black hole ate Barnard’s Star. Over the next few days, more and more stars disappeared. Until the worst happened, Proxima Centauri disappeared, just like Sirius, that’s when the Watchers really panicked. It didn\u0027t help that this would cause as much panic as\u003C/span\u003E when the aliens brought Steve Jobs back to life and attacked Earth. \u003Cspan style=\u0022font-size:11pt;\u0022\u003EThey told the United World what happened, and the UW decided to keep it quiet until a decade before the black holes were scheduled to arrive, meanwhile all space programs would receive funding necessary to create an interstellar vehicle, when Elon Musk (President of the Marshall Islands and SpaceX) said, “Which planet would it hit first?” “Jupiter”, they replied. “That’s where we’ll make our stand.” Musk said. And it was decided, they would send a mission to Jupiter, with one person who had the guts. They created the ISA(International Smartness Assessment) that wouldn\u0027t just look for the smartest, but those who are the guttiest.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11pt;\u0022\u003EAnd that\u0027s where we\u0027ll stop for today. Tomorrow, we\u0027ll go back to 2020, and check out that alien invasion.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Minmus Taster","CreatedById":206159,"CreatedDateTime":"2020-08-09T15:36:23Z","Content":"\n\u003Cp\u003E\nSend Jeb some say he has no guts to lose...i need to stop here before i get to graphix\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GuessingEveryDay","CreatedById":203507,"CreatedDateTime":"2020-08-09T15:37:18Z","Content":"\n\u003Cp\u003E\nSorry, but this is strictly limited to Earth, I may add some way for Jeb to be included. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GuessingEveryDay","CreatedById":203507,"CreatedDateTime":"2020-08-11T16:12:40Z","Content":"\n\u003Cp\u003E\nHere\u0027s the next chapter.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cem\u003EChapter One\u003C/em\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJust before the very short alien invasion.\n\u003C/p\u003E\n\u003Cp\u003E\nGeoff woke up to the annoying vibrations of his new alarm, at least it worked. He rubbed his eye and got ready for the day by setting up a replicate Apollo mission with NERVAs on KSP(Kerbal Space Program) while brushing his teeth, his mom texted, back from her walk, “Geoff, it’s only 6:30! Isn’t that enough time to take a shower?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Just a minute!” Geoff replied. Muttering about how showers can be every other day, he quickly took a shower, put on a Mars shirt, with Kybertruck driving by it, Starman waving his hands through a broken window, with black shorts with white dots peppering it, and put on his glasses with the logo of every space company, but a white patch in the shape of a feather, was where the logo of Blue Origin used to be. And his Cochlear n7.\n\u003C/p\u003E\n\u003Cp\u003E\n“You’re going to be late for school!” Mom said. She made every meal, and all of them were delicious, but lately Geoff had been taking up most of the responsibilities for the food.\n\u003C/p\u003E\n\u003Cp\u003E\n“It’s only 7 AM! Don’t we need to go at 7:20?” Geoff replied. Then the news came on, with a new announcement by Elon Musk about a new Starship, called StarshipXL, that would go to Jupiter and beyond. “Heh, Elon’s gonna rule the other worlds someday.” And then news about Elon Musk’s new baby popped up. “*sigh*, it’s annoying how he copies nature though.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Geoff! A tray of German Pancakes with Nutella is waiting for you!”\n\u003C/p\u003E\n\u003Cp\u003E\n“Give me 2 for now, mom!”, Geoff said as he headed to the kitchen. Ever since Steve Jobs came back to life during the extremely short alien invasion, he created the O\u003Csub\u003E2-\u003C/sub\u003EC machine that got rid of the carbon atom in CO\u003Csub\u003E2\u003C/sub\u003E quickly, and efficiently. It was light enough to take up in the atmosphere and get rid of the extra CO\u003Csub\u003E2\u003C/sub\u003E. And the world was quite safe from the global warming threat, and then Jobs bought Sony, and created amazing products that put the iPhone to shame.\n\u003C/p\u003E\n\u003Cp\u003E\nLater in homeroom at Florida School for the Deaf and Blind, someone came up to Geoff and said, “Going to make a book about space, eh?”\n\u003C/p\u003E\n\u003Cp\u003E\n“And it’ll be so complicated, no one can read it! Hey, Gio!”\n\u003C/p\u003E\n\u003Cp\u003E\n“How’s it going?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Hear about why Blue Origin was so slow?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Because Jeff Bezos was a lizard man?”\n\u003C/p\u003E\n\u003Cp\u003E\n“ And turned out these conspirators were right?” They signed together. Then everything went black, and Geoff saw a weird future version of himself, holding a sign that said “It’s happening in 2 hours.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Did you see that?”\n\u003C/p\u003E\n\u003Cp\u003E\n“See what?”\n\u003C/p\u003E\n\u003Cp\u003E\n“ A person holding a sign with ‘It’s happening in 2 hours.’”\n\u003C/p\u003E\n\u003Cp\u003E\n“I just saw my dream game. Half-Life 3. Can’t believe it’s coming out tomorrow.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003E\u003Cspan style=\u0022font-size:14pt;\u0022\u003E2 hours later…\u003C/span\u003E\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn every screen in the world, R.E.M.’s End of the World started playing. Over and over, the words “\u003Cspan style=\u0022color:#222222;font-size:10.5pt;\u0022\u003EIt\u0027s the end of the world as we know it” played. Something was coming. And it was big.\u003C/span\u003E\n\u003C/p\u003E\n"}]}