{"TopicId":196461,"ForumId":70,"TopicTitle":"What is going on here? (Malformed craft)","CreatedByName":"archnem","CreatedById":135259,"CreatedDateTime":"2020-08-22T19:35:36Z","PageNum":1,"Articles":[{"CreatedByName":"archnem","CreatedById":135259,"CreatedDateTime":"2020-08-22T19:35:36Z","Content":"\n\u003Cp\u003E\nI\u0027ve had this problem recently that once in a while when I leave a craft in orbit, go to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and then go back to the craft, it becomes radically malformed and weird.  What is going on here?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X1MQSSv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/X1MQSSv.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2020-08-26T01:08:47Z","Content":"\n\u003Cp\u003E\nWeak joints in a very large craft are a common cause of twisted craft like that, but your ship is small. Were any of the parts clipped when you did your original \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E build? Were any parts wobbly in flight?\n\u003C/p\u003E\n\u003Cp\u003E\nStruts or autostruts can sometimes help reduce wobbling parts. If used incorrectly, though, they can sometime trigger new twisting of parts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbal Joint Reinforcement mod can be used instead of struts. It strengthens the connections between parts so they bend less.\n\u003C/p\u003E\n\u003Cp\u003E\nThose suggestions make it less likely to occur, but I don\u0027t know of any way to untwist a a mangled ship. If you catch it early and have a recent save you can reload. Otherwise launch a replacement ship.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022176740\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1776532182\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184206-kerbal-joint-reinforcement-next/\u0026amp;do=embed\u0022 style=\u0022height:212px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-08-27T10:28:28Z","Content":"\n\u003Cp\u003E\nI\u0027ve had warped craft appear when autostruts were on and then the craft was docked to something else. Try disabling all autostruts, switch to something outside of physics range/go to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E/tracking station, then return to the craft and it might be fixed. If that doesn\u0027t help, a bit of save file editing to turn off the autostruts might do the trick; don\u0027t try and adjust the angles in the save file itself, that usually ends badly...\n\u003C/p\u003E\n"}]}