{"TopicId":196558,"ForumId":20,"TopicTitle":"Possible mod ideas","CreatedByName":"Phantom-051","CreatedById":204071,"CreatedDateTime":"2020-08-27T16:49:30Z","PageNum":1,"Articles":[{"CreatedByName":"Phantom-051","CreatedById":204071,"CreatedDateTime":"2020-08-27T16:49:30Z","Content":"\n\u003Cp\u003E\nSo, I was attempting to build an F-8 Crusader in KSP today, and that got me thinking: Is there anyone out there who would be willing to make a mod for KSP that adds in the right parts to make a Vought F-8 Crusader? Then, I started thinking about what else a mod like that could include, other than the Crusader\u0027s Nose-section, engine-shroud/engine, tail fins, wings, and landing gear. One of my ideas was that with this mod adding F-8 Crusader parts, it could also add in a few other cockpits, wings/control surfaces, and engines. Among these could be different variations of the Crusader nose-section (such as a more futuristic and sleek one, a larger two-seat version, etc), and possibly entirely different plane cockpits.\u003Cbr\u003E\nWhat do y\u0027all think?\n\u003C/p\u003E\n"},{"CreatedByName":"Starhelperdude","CreatedById":204462,"CreatedDateTime":"2020-08-27T19:12:31Z","Content":"\n\u003Cp\u003E\ngood Idea! I started to build planes from IRL like F-15/16 and wanted to build f-18/e/F/f-22/F-35 too and looked at the crusader but then ksp thought:\u0027\u0027 well how would you like it if I would randomly crash at the start of the game at loading a random part?!\u0027\u0027 If ksp would work (with this \u0027\u0027modpack\u0027\u0027 that I\u0027m using, other work hopefully), I use Airplane plus and would probably  use the stock mk1 inline cockpit, then frontal of it a snub radar from BD armory (because I like to build military stuff in an space exploration game lol) and then I would place two mark0 tanks, one over another, and push the under one a littl bit more into the radar, and add a small intake to it and ad a nosecone to the upper one, but it would certainly be better if there would be like preset parts for like the noseform and body, like in airplane plus\n\u003C/p\u003E\n"}]}