{"TopicId":197004,"ForumId":16,"TopicTitle":"Force a ship to use relay instead of connecting directly?","CreatedByName":"salajander","CreatedById":72724,"CreatedDateTime":"2020-09-20T01:23:36Z","PageNum":1,"Articles":[{"CreatedByName":"salajander","CreatedById":72724,"CreatedDateTime":"2020-09-20T01:23:36Z","Content":"\n\u003Cp\u003E\nI have a rover on Duna with an antenna just barely strong enough to connect directly back to Kerbin. I have a big relay satellite in a tundra orbit around Duna. If Kerbin\u0027s not visible, the rover connects through the relay with a pretty good signal (and, I\u0027m using Kerbalism, is transmitting data back at about 200 b/s). When Kerbin comes into view, however, the rover chooses the more direct path and connects directly to a DSN station, with a much lower strength (and about 0.2 b/s throughput).\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a method I can use to force the rover to use the relay satellite all the time? Or choose the stronger signal over the more direct one, I guess?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-09-20T04:30:30Z","Content":"\n\u003Cp\u003E\nSorry, nope. This is a bug in the path-choosing algorithm, and it\u0027s been reported to the devs, but apparently it\u0027s low-priority.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-09-20T23:48:54Z","Content":"\n\u003Cp\u003E\nYou can do this with the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/158851-110-commnet-constellation-v155-8-july-2020/\u0022 rel=\u0022\u0022\u003ECommNet Constellation\u003C/a\u003E mod. If you\u0027re not familiar with it, it allows you to set different frequencies for your antennas to use. Two antennas can only talk to each other if they\u0027re using the same frequency (everything uses frequency 0 by default) and relay satellites only relay between different frequencies if they have an antenna for each frequency. DSNs can talk to any frequency, but you can disable specific frequencies so that the DSN won\u0027t talk to antennas on those frequencies directly, only through a relay.\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nCreate a new frequency for the rover\u0027s use.\n\u003C/li\u003E\n\u003Cli\u003E\nSet the rover\u0027s antenna to the frequency you created.\n\u003C/li\u003E\n\u003Cli\u003E\nSet the DSN to \u003Cstrong\u003E\u003Cem\u003Enot\u003C/em\u003E\u003C/strong\u003E talk to the rover\u0027s frequency. You\u0027ll have to do it for the entire DSN, not just the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nSet at least one antenna on the relay satellite to the rover\u0027s frequency.\n\u003C/li\u003E\n\u003Cli\u003E\nSet the rest of the relay satellite\u0027s antennas to frequency 0 (or any other frequency the DSN is talking to).\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThis way the rover won\u0027t talk to the DSN directly whatsoever, even if Kerbin is visible and in range. It will only talk to Kerbin via the relay. Keep in mind, however, that your signal strength won\u0027t be as high via the relay because multiple antennas on the same vessel only combine their power if they\u0027re on the same frequency and you\u0027ll need at least one antenna to communicate with the rover instead of the DSN.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-21T00:01:13Z\u0022 title=\u002209/21/2020 12:01  AM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 21, 2020\u003C/time\u003E by Fraktal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"salajander","CreatedById":72724,"CreatedDateTime":"2020-09-21T15:17:30Z","Content":"\n\u003Cp\u003E\nCommNet Constellation does exactly what I need, and seems to work well with all the other mods in my save to boot. (And thankfully my non-Kerbin-system relay satellites all have multiple relay dishes.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-21T15:18:56Z\u0022 title=\u002209/21/2020 03:18  PM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 21, 2020\u003C/time\u003E by salajander\u003C/strong\u003E\n\u003C/span\u003E\n"}]}