{"TopicId":197230,"ForumId":16,"TopicTitle":"southern ice shelf biome under equatorial orbit anomaly","CreatedByName":"antipro","CreatedById":173370,"CreatedDateTime":"2020-10-01T07:49:35Z","PageNum":1,"Articles":[{"CreatedByName":"antipro","CreatedById":173370,"CreatedDateTime":"2020-10-01T07:49:35Z","Content":"\n\u003Cp\u003E\nhi, orbiting Kerbin I found a southern ice shelf invisible micro biome, just close to the big crater.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022Screenshot%202020-10-01%2009.22.30.jpg?d\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://www.dropbox.com/s/x8zpmpwld2rij1r/Screenshot%202020-10-01%2009.22.30.jpg?dl=1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nVideo: \u003Ca href=\u0022https://www.dropbox.com/s/i1tifrqty63gd2j/2020-10-01%2009-18-56.mkv?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/i1tifrqty63gd2j/2020-10-01 09-18-56.mkv?dl=0\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003E\u003Cspan lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\u003Cspan title=\u0022\u0022\u003Ewhy it was put there?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-10-01T09:08:47Z","Content":"\n\u003Cp\u003E\nThe biome system was built many years ago to take advantage of a couple automatic systems in the game engine. The most important of those is the color interpolation system.\n\u003C/p\u003E\n\u003Cp\u003E\nThe way it works is that the game is given a low resolution pixel map of every planet/CB, and the colors on that low-res map are the biomes of each area. However, as you pass over the terrain, the game builds a much higher resolution map from the low-res map, and uses color interpolation between all the neighboring pixels from the low-res map to figure out what the biome is of all the pixels in the high-res map. This allowed the game to create an on-the-fly biome map that was complex, detailed, interesting, and repeatable.\n\u003C/p\u003E\n\u003Cp\u003E\nThis system worked well for many years, but it had a couple of issues.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Kerbin, the main issue was that the interpolation between the \u0022shores\u0022 biome and the \u0022grasslands\u0022 biome mapped to a color that was then mapped back to a biome that was unfortunately called \u0022Tundra\u0022. If it had been called \u0022scrubgrass\u0022 (as I tried hard to get the devs to rename it), there wouldn\u0027t have been a problem. But this \u0022tundra\u0022 existed all over the planet at any shores/grassland boundary. Even on the equator (and on the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E campus itself). Sadly, many players and devs are rather OCD and found this little bit of \u0022tundra\u0022 biome in unrealistic locations to be unbearable.\n\u003C/p\u003E\n\u003Cp\u003E\nOn CBs such as the Mun, the situation was more severe. Since all the biomes were very similar colors in the low-res map, the interpolation zone tended to have a lot of odd biomes mixed in. For example, in the boundary between the East Crater biome, the Canyons biome, and the Midlands biome -- you could find 3 or 4 tiny spots of other random biomes mixed in. Such as various polar biomes. Again, some OCD folks found this to be unbearable.\n\u003C/p\u003E\n\u003Cp\u003E\nNow me personally, I \u003Cstrong\u003E\u003Cem\u003Eloved it\u003C/em\u003E\u003C/strong\u003E. I found it easy to make up little stories about why the various biomes showed up in strange places. I spent many fun hours scouring Kerbin and each CB for little agglomerations of odd biomes where you could pick up a lot of science from a lot of biomes with one long flight and then a little bit of roving around.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then I lost my little one-man battle, and the accumulated weight of all the complaints finally ended my little biome party.\n\u003C/p\u003E\n\u003Cp\u003E\nThe biomes of all the planets were redrawn to attempt to eliminate \u0022accidental interpolation artifacts\u0022. The biomes became the boring-as-hell ones that we have now. No surprises. Nothing interesting to find. No special places to go and gather science. No reason to explore an area, once you\u0027ve landed in the biome one time to pick up your science. Many of you won\u0027t understand those last sentences, but those brothers of mine that I call \u0022biome hunters\u0022 will understand perfectly.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the interpolation scheme is still there, and some biomes have been added (especially on Kerbin). Eve was always a complete mess after the biome redrawing. (Maybe Eve\u0027s low-res biome map is backwards -- I never managed to figure it out.) \u003Cstrong\u003E\u003Cem\u003EAnd there are still interpolation artifacts on Kerbin and almost all the CBs.\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo, antipro, the answer to your question is that there are many tiny spots on Kerbin where color interpolation between various biome pixels produces strange results. The most commonly misplaced biome currently is the Southern Ice Shelf. You will find spots of it at the edges of some lakes. You will find spots of it mixed in with the Northern Ice Shelf at the North pole if you look hard enough. But these oddly placed biomes are the result of the devs trying for months to get rid of other, different, oddly-placed biomes. No good deed going unpunished, and all of that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-10-02T23:27:41Z\u0022 title=\u002210/02/2020 11:27  PM\u0022 data-short=\u00223 yr\u0022\u003EOctober 2, 2020\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"}]}