{"TopicId":197200,"ForumId":16,"TopicTitle":"Which Moon is Easier???","CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2020-09-29T20:58:36Z","PageNum":1,"Articles":[{"CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2020-09-29T20:58:37Z","Content":"\n\u003Cp\u003E\nAnswer the poll!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-29T20:59:29Z\u0022 title=\u002209/29/2020 08:59  PM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 29, 2020\u003C/time\u003E by Dr. Kerbal\u003C/strong\u003E\n\u003Cbr\u003EHelp!\n\u003C/span\u003E\n"},{"CreatedByName":"Misguided Kerbal","CreatedById":203209,"CreatedDateTime":"2020-09-29T21:00:41Z","Content":"\n\u003Cp\u003E\nThe Mun.\n\u003C/p\u003E\n"},{"CreatedByName":"Dat Kerbal Dude","CreatedById":206145,"CreatedDateTime":"2020-09-29T21:03:41Z","Content":"\n\u003Cp\u003E\nIke.\n\u003C/p\u003E\n\u003Cp\u003E\nas it\u0027s pretty visible than Gilly, bop and pol, and doesn\u0027t orbit around a big planet.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-09-29T21:57:36Z","Content":"\n\u003Cp\u003E\nIn terms of getting to them I\u0027d say- Ike, Gilly, Pol, Bop. While the Eve transfer window opens more regularly than the Duna one, Ike\u0027s orbit is both planar and geostationary plus it\u0027s the biggest of the four moons, however that can be a hindrance rather than a help if you don\u0027t actually \u003Cem\u003Ewant\u003C/em\u003E to go to Ike but it gets in the way; Gilly has an elliptical and inclined orbit and a tiny \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, but it\u0027s easier to get to Eve than to Jool; Pol is less inclined than Bop which makes up for it being the outermost Joolian moon.\n\u003C/p\u003E\n\u003Cp\u003E\nFor landing on them, probably- Gilly, Pol, Bop, Ike. Gilly is the smallest and has the lowest gravity (I think), and if I remember them correctly from the one time I\u0027ve been to Jool\u0027s moons Pol has flatter terrain than Bop which is very lumpy, making Pol the easier target; Ike is the biggest so requires more delta-V to land from orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nFor overall ease of operations when you\u0027re there- Gilly, Ike, Pol, Bop. Gilly has the advantage of being closest to the Sun and so gets a lot more power from those solar panels, plus it will hardly ever be eclipsed by Eve, however the low gravity makes it more hazardous; Ike is regularly eclipsed by Duna, but again the solar panels will still give you a reasonable dose of electricity and the gravity is high enough that you don\u0027t have to worry about floating around too much; and both Pol and Bop are too far out to get any meaningful power from solar panels (1EC/s from a Gigantor if you\u0027re lucky) so there really isn\u0027t much to choose from those two.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my current career game I\u0027ve reached the stage where I\u0027m planning the first interplanetary mission, and I\u0027m going with Gilly- much more solar power than at Duna will make it easier to gather a whole load of long-term science from it.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-09-30T05:11:48Z","Content":"\n\u003Cp\u003E\nHow is this a tutorial? \n\u003C/p\u003E\n"},{"CreatedByName":"peteletroll","CreatedById":144573,"CreatedDateTime":"2020-09-30T16:09:41Z","Content":"\n\u003Cp\u003E\nThread moved because it\u0027s not a tutorial.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2020-09-30T17:12:42Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OuqzGMIyaP0PGmCBqn0JIwf7a6SWWu9XtHVIdOEg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022540\u0022 width=\u0022960\u0022 src=\u0022https://external-preview.redd.it/OuqzGMIyaP0PGmCBqn0JIwf7a6SWWu9XtHVIdOEg0uQ.jpg?width=960\u0026amp;crop=smart\u0026amp;auto=webp\u0026amp;s=64a7695b9d5ba794d58a8d40aee1b2961a130bd4\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Laythe\u0022 rel=\u0022external nofollow\u0022\u003ELaythe\u003C/a\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIt takes a bit more deltaV to transfer to Jool than to Duna(and Eve, but the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E is quite easy to hit. The several options to capture around Jool tend to let you closer to Laythe than to Bop/Pol. The higher gravity at Laythe  saves from the tedious inching towards the surface one experiments around Gilly (and Bop/Pol). Finally, the presence of an atmosphere allows the use of parachutes and wings for the landing itself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EDeparting from \u003C/i\u003ELaythe is not as easy as from the above mentioned moons , however there is the option of using jet engines.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}