{"TopicId":197911,"ForumId":16,"TopicTitle":"about plane stability","CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-04T14:10:59Z","PageNum":1,"Articles":[{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-04T14:10:59Z","Content":"\n\u003Cp\u003E\ni noticed that sometimes, when i launch a plane and all goes well, the plane will keep the orientation with just \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E set on hold attitude. it will stay perfectly still, without any input, until i touch the controls. or until it stalls for flying too high.\n\u003C/p\u003E\n\u003Cp\u003E\nother times i need to touch the controls just a little bit. and then there is \u003Cu\u003Eno way whatsoever\u003C/u\u003E to get the same stability. hold attitude, hold prograde, all will result in the tip of the plane going down within a few seconds. hold prograde is especially bad, because the manuevers it does to try and compensate deviations are actually causing greater deviations.\n\u003C/p\u003E\n\u003Cp\u003E\nit\u0027s almost like i\u0027m flying two different planes, one perfectly stable, one not. or perhaps in one case it is like having physical facilitation on. and in the second case flying is much more annoying, as i need to check the controls every time, and also less efficient, because i can\u0027t keep pointing the right direction and will face drag.\n\u003C/p\u003E\n\u003Cp\u003E\nand i noticed this with different planes.\n\u003C/p\u003E\n\u003Cp\u003E\nanyone can explain why? and if there is a way to reproduce the stability?\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2020-11-04T14:55:33Z","Content":"\n\u003Cp\u003E\nOh, I\u0027d love ta have a explanation for that too...\n\u003C/p\u003E\n\u003Cp\u003E\nSome usual tricks are to use  trim, the deployment angle slider of control surfaces and briefly pressing F to disable \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, doing small adjustments along the way. But most of it is to design the craft and pick the ascent profile to avoid those adjustments as much as you can.\n\u003C/p\u003E\n"},{"CreatedByName":"lemon cup","CreatedById":199693,"CreatedDateTime":"2020-11-04T15:11:14Z","Content":"\n\u003Cp\u003E\nYup. If you design the craft with nearly perfect horizontal symmetry (as in it is not left or right side heavy) and if you have enough pitch authority (center of mass stays slightly forward of center of lift and you have enough control surfaces that can lift the nose with relative ease) you can get very good stability using only pitch trim.\n\u003C/p\u003E\n\u003Cp\u003E\nTo set pitch trim, turn \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off and hold Alt while you slew up and down with the S and W keys. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is not perfect, it is a catch-all algorithm that is trying to keep a huge range of rockets and planes stable, with a lot of drawbacks. One of it’s biggest is the input delay. If \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is holding a particularly nose heavy craft for instance, any input you make will completely dump all \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E controls the moment you hit the key and you’ll pitch down dramatically as a result, even if your only input was a roll command. That’s why it’s usually better to fly aircraft with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off, if possible.\n\u003C/p\u003E\n"},{"CreatedByName":"Wobbly Av8r","CreatedById":206697,"CreatedDateTime":"2020-11-04T16:52:28Z","Content":"\n\u003Cp\u003E\nI\u0027m afraid that there is likely no silver bullet for KSP aircraft. In the spirit of conveying information on \u0027how to\u0027 rather than \u0027do this\u0027, I submit the following...\n\u003C/p\u003E\n\u003Cp\u003E\nNot trying to over-simplify physics, but in the void of space, the resultant path or motion of a vehicle is a consequence of, in essence, a thrust vector and its relationship to the center of mass interacting with a single gravitational body (yes, there are localized interactions, but they are just that - localized). While in the atmosphere, however, there are numerous aerodynamic couples that complicate the forces, and thus the path of the vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nIn steady unaccelerated flight, the forces of lift = weight and thrust = drag, but if *ANY* of those forces change, it results in a cascade of related changes that in reality even super-computers have a tough time calculating, much less your humble desk-top computer or lap-top, not to mention that the fidelity of the software cannot really approach the true dynamics of the process.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that said, KSP attempts to retain a level of \u0027honesty\u0027 to their simulation and in doing so makes things rather \u0022squirrelly\u0022, so the solution falls upon the user\u0027s ability to both make a design that is not prone to over controlling (one in which small inputs result in large movements), but also has the ability to \u0022finely tune\u0022 the control inputs to establish and maintain the lift=weight, thrust=drag relationship. Those two concepts translate into designs that fly a specific profile that varies only minimally with the corresponding gradual change in mass due to fuel consumption.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the \u0027why\u0027, but in practice not the \u0027how\u0027. The \u0027how\u0027 is made more possible by following certain design philosophies like not putting in an \u0022angle of incidence\u0022 on wing/tail parts to enable a wider operating range OR building WITH various \u0022angle\u0027s of incidence\u0022 knowing you will generally fly at one particular airspeed and will be able to set thrust and trim to maintain that condition. Also keeping the thrust vector as close in line with the center of lift so changes in thrust have minimal effect on stability is another consideration. Because take-off and landing speeds relative to the design speed are significantly different, separate lift considerations will have to be made to accommodate those flight regimes.\n\u003C/p\u003E\n\u003Cp\u003E\nAnecdotally (meaning I am aware my solution is one of many) once your design has allowed for overall stability as suggested above, using the trim feature (Alt-W or S) is key to achieving the \u0027hands off\u0027 flight path you desire, and once established, having \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E \u003Cem\u003E\u003Cu\u003E\u003Cstrong\u003Ethen\u003C/strong\u003E\u003C/u\u003E\u003C/em\u003E turned on seems to provide a solution that allows x4 physics warp to speed things along without going out of control.\n\u003C/p\u003E\n\u003Cp\u003E\nHope that helps... As always, YMMV. Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2020-11-05T13:40:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223876891\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604499059\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nother times i need to touch the controls just a little bit. and then there is \u003Cu\u003Eno way whatsoever\u003C/u\u003E to get the same stability. hold attitude, hold prograde, all will result in the tip of the plane going down within a few seconds. hold prograde is especially bad, because the manuevers it does to try and compensate deviations are actually causing greater deviations.\n\u003C/p\u003E\n\u003Cp\u003E\nit\u0027s almost like i\u0027m flying two different planes, one perfectly stable, one not. or perhaps in one case it is like having physical facilitation on. and in the second case flying is much more annoying, as i need to check the controls every time, and also less efficient, because i can\u0027t keep pointing the right direction and will face drag.\n\u003C/p\u003E\n\u003Cp\u003E\nand i noticed this with different planes.\n\u003C/p\u003E\n\u003Cp\u003E\nanyone can explain why? and if there is a way to reproduce the stability?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLonger explanation below, but the excutive summary is:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E should be towards the front of the plane\n\u003C/li\u003E\n\u003Cli\u003E\nPitch and yaw controls (e.g. on the aircraft tail) should be as far behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E as possible\n\u003C/li\u003E\n\u003Cli\u003E\nVertical stabilizer on the tail shouldn\u0027t stick up high above the fuselage, and should have roll authority disabled\n\u003C/li\u003E\n\u003Cli\u003E\nShow us a screenshot and we may be able to offer advice \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan\u003EOkay, now for the wordy part:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe common reason for an unstable plane (especially on the pitch axis) is that your \u003Cstrong\u003Ecenter of mass is behind the center of dynamic pressure\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I mean by that:  Imagine you have a badminton birdie.  If you throw it with the heavy weighted end in front, then it\u0027s stable and will fly through the air in that orientation just fine.  But if you try to throw it with the feathered end in front... it just aint\u0027 gonna happen.  It\u0027ll flip around; the weighted end wants to be in front.\n\u003C/p\u003E\n\u003Cp\u003E\nIt does that because,\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthe \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E wants to be in front, and\n\u003C/li\u003E\n\u003Cli\u003E\nthe draggy part wants to be in back.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo for example, if you have a plane with a big lightweight fuselage sticking way out in front, but a lot of heavy engines at the back of the plane, you end up with a \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E that\u0027s pretty far to the rear, meaning the plane kinda wants to fly backwards.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can make up for that a \u003Cem\u003E\u003Cu\u003Elittle\u003C/u\u003E\u003C/em\u003E bit with control surfaces... but not only is that a bit dicey, but also \u003Cstrong\u003Ethe effectiveness of a control surfacve depends on its lever arm, measured to the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E\u003C/strong\u003E.  If the control surface is too close to the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E, it has very little control authority on the plane.  For example, if you build a craft whose \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is way towards the back of the plane... then that means that any pitch controls on the aircraft tail (\u0022elevators\u0022) are pretty close to the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E and won\u0027t actually do much for you, meaning they can\u0027t help stabilize the plane\u0027s pitch well.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso:  If you have a vertical stabilizer on the tail to control yaw... you should make it \u003Cem\u003E\u003Cu\u003Eas vertically close to the center axis of the plane as possible\u003C/u\u003E\u003C/em\u003E (i.e. not sticking way up high above the plane).  And be sure to \u003Cem\u003E\u003Cu\u003Edisable \u003Cstrong\u003Eroll\u003C/strong\u003E authority on it\u003C/u\u003E\u003C/em\u003E (i.e. it should be set to address only yaw, not roll).  I could explain in detail why this is, but it would be a longer explanation and I\u0027ll save it unless you\u0027re interested.  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223876891\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604499059\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nand i noticed this with different planes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep.  It really depends a \u003Cem\u003E\u003Cu\u003Elot\u003C/u\u003E\u003C/em\u003E on how the plane is arranged-- where\u0027s the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E, where are the wings, where are the control surfaces. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you could post a screenshot of a plane that\u0027s having difficulty, then we could critique it for you (\u0022oh, see, there\u0027s your problem right there-- you need to move \u003Cem\u003Ethis\u003C/em\u003E thing over \u003Cem\u003Ethere\u003C/em\u003E,\u0022 that sort of thing).  Ideally, a shot of it in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E with the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E display turned on would be best.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-05T14:34:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877401\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604583639\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLonger explanation below, but the excutive summary is:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E should be towards the front of the plane\n\u003C/li\u003E\n\u003Cli\u003E\nPitch and yaw controls (e.g. on the aircraft tail) should be as far behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E as possible\n\u003C/li\u003E\n\u003Cli\u003E\nVertical stabilizer on the tail shouldn\u0027t stick up high above the fuselage, and should have roll authority disabled\n\u003C/li\u003E\n\u003Cli\u003E\nShow us a screenshot and we may be able to offer advice \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, i know the basics. and i wouldn\u0027t say it\u0027s exactly \u0022having difficulties\u0022. it flies fairly well, it has \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E capacity, it can go cruise around on propeller power alone and can even take off from water, all on propellers.\n\u003C/p\u003E\n\u003Cp\u003E\nI just would like to understand why it has that strange behavior\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you could post a screenshot of a plane that\u0027s having difficulty, then we could critique it for you (\u0022oh, see, there\u0027s your problem right there-- you need to move \u003Cem\u003Ethis\u003C/em\u003E thing over \u003Cem\u003Ethere\u003C/em\u003E,\u0022 that sort of thing).  Ideally, a shot of it in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E with the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E display turned on would be best.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni already asked regarding this plane for a problem on the ground (which was fixed), and the pictures are there.\n\u003C/p\u003E\n\u003Cp\u003E\ni made some changes since that model; i swapped out the liquid fuel tanks with rocket fuel, and i added some extra tanks under the wings, and i added two aerospikes, because i realized going to orbit on a nerv alone was too ambitious. and since the plane was much heavier i added another couple of propellers, and a few more \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003Ertg\u003C/abbr\u003E inside the cargo bays to support it.\n\u003C/p\u003E\n\u003Cp\u003E\nbut it makes no difference. it always does the same, sometimes starting perfectly, but losing stability as soon as i try to manuever, to never recover it\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022204876\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3159026419\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/197834-this-spaceplane-is-not-going-straight/\u0026amp;do=embed\u0022 style=\u0022height:195px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2020-11-05T15:43:34Z","Content":"\n\u003Cp\u003E\nSo, this plane, then?\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LdY3opw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LdY3opw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LqXDV0l.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LqXDV0l.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIt looks to me like the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is probably too far to the back of the plane.  Could you post a \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E screenshot that has the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E display turned on?  (yellow-and-black checkered sphere).  (Especially with all the changes you mention, since that could have a major effect on the plane\u0027s stability depending on what you\u0027ve got where.)\n\u003C/p\u003E\n\u003Cp\u003E\nI have some suggestions if my hunch is correct, but I don\u0027t want to make assumptions without actually getting an accurate picture of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E placement.\u003Cbr\u003E\u003Cbr\u003E\nAlso... is there any chance the plane may be \u003Cem\u003E\u003Cu\u003Ebending\u003C/u\u003E\u003C/em\u003E?  You\u0027ve got a long narrow plane with only 1.25m stack and a whole bunch of stacked parts, meaning a lot of part joints-- that\u0027s the sort of scenario that can easily lead to bending under stress.  If the part of the plane in front of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E with the front wings is bending, that could cause bad instability at speed.  Are you using anything to stiffen the plane, such as autostrutting the engine and rear wings to the cockpit?\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-05T22:25:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877471\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604591014\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, this plane, then?\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt looks to me like the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is probably too far to the back of the plane.  Could you post a \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E screenshot that has the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E display turned on?  (yellow-and-black checkered sphere).  (Especially with all the changes you mention, since that could have a major effect on the plane\u0027s stability depending on what you\u0027ve got where.)\n\u003C/p\u003E\n\u003Cp\u003E\nI have some suggestions if my hunch is correct, but I don\u0027t want to make assumptions without actually getting an accurate picture of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E placement.\u003Cbr\u003E\u003Cbr\u003E\nAlso... is there any chance the plane may be \u003Cem\u003E\u003Cu\u003Ebending\u003C/u\u003E\u003C/em\u003E?  You\u0027ve got a long narrow plane with only 1.25m stack and a whole bunch of stacked parts, meaning a lot of part joints-- that\u0027s the sort of scenario that can easily lead to bending under stress.  If the part of the plane in front of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E with the front wings is bending, that could cause bad instability at speed.  Are you using anything to stiffen the plane, such as autostrutting the engine and rear wings to the cockpit?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JBpFYJ2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/JBpFYJ2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wkDcGOy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wkDcGOy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nhere it is. yes, the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is a bit back, which is unavoidable when the heaviest parts are the nerv engine, which must go on the back, and the wings, which must generate lift behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E and so must be put fairly backwards themselves.\n\u003C/p\u003E\n\u003Cp\u003E\nstill, I remark that this thing flies pretty well, as long as i never touch the control since leaving the runway.\n\u003C/p\u003E\n\u003Cp\u003E\nregarding autostrutting, i did indeed autostrut everything I considered also adding manual struts, especially for the lateral tanks. they would probably be a bit more stable, and they would definitely be more stable if i attached them to the central body instead of the wings. but i like the shape now, and in all my simulations it has never been a problem\n\u003C/p\u003E\n"},{"CreatedByName":"Echo__3","CreatedById":204997,"CreatedDateTime":"2020-11-06T00:11:47Z","Content":"\n\u003Cp\u003E\nThis video might interest you.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/30R6sekvmrk?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Wobbly Av8r","CreatedById":206697,"CreatedDateTime":"2020-11-06T00:21:03Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0022 rel=\u0022\u0022\u003E@king of nowhere\u003C/a\u003EDon\u0027t know if anything I posted was significant in your mind, but those really large \u0022elevons\u0022  are the kind of thing that will cause you to have a wild ride; when you state that \u0022this thing flies pretty well, as long as i never touch the control since leaving the runway\u0022 that\u0027s where I\u0027d *start* to make it more stable.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep in mind that every time you press one of the control keys (WSAD) you are giving a \u0022full deflection\u0022 instruction to those controls - if you \u0022tap\u0022 the control key, it may be less of an input only due to the fact that the key press duration was shorter than the time it takes the control to fully deflect. Furthering the problem is that as you get faster, the effect is increased.\n\u003C/p\u003E\n\u003Cp\u003E\nA couple of solutions to try: limit the total deflection of the controls, make them smaller or place them further inboard to limit their roll authority and see if that makes it a bit more manageable.\n\u003C/p\u003E\n\u003Cp\u003E\n[Edit: One additional observation, below]\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-06T03:04:19Z\u0022 title=\u002211/06/2020 03:04  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 6, 2020\u003C/time\u003E by Wobbly Av8r\u003C/strong\u003E\n\u003Cbr\u003EAdditional information\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2020-11-06T02:50:23Z","Content":"\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E is definitely not telling the whole story, so you have a lot less margin than you think. CorrectCOL is an amazing mod and will account for all the drag-producing items on the craft, as well as show the stability at various angles of attack.\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect that when it departs from perfectly forward flight, it\u0027s not stable at all. You can pick up the craft and rotate it a bit in all axes to see where the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E ends up.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I were to modify that to make it fly better, I\u0027d make the elevons flat (no \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E) to pull the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E back a little. I\u0027d also double or triple the vertical tail, because the yaw stability is currently minimal--Especially with \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E on the wings.\n\u003C/p\u003E\n"},{"CreatedByName":"Wobbly Av8r","CreatedById":206697,"CreatedDateTime":"2020-11-06T03:08:40Z","Content":"\n\u003Cp\u003E\nApologize, but after looking it over one more time I recognized also that (contributing to instability with any maneuvering) the amount of area you have in FRONT of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is considerable - while wings and vertical fins can stabilize things, when you give it enough \u0027yaw\u0027, the airplane will act just like a rocket with a huge payload on top with little or no fins on the bottom (i.e. it will want to \u0022swap ends\u0022!) What \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E mentioned \u0022I\u0027d also double or triple the vertical tail, because the yaw stability is currently minimal\u0022 (more vertical fin-nage) will help solve the issue...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-06T03:09:41Z\u0022 title=\u002211/06/2020 03:09  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 6, 2020\u003C/time\u003E by Wobbly Av8r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-06T10:27:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877851\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604622063\u0022 data-ipsquote-userid=\u0022206697\u0022 data-ipsquote-username=\u0022Wobbly Av8r\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Wobbly Av8r said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0022 rel=\u0022\u0022\u003E@king of nowhere\u003C/a\u003EDon\u0027t know if anything I posted was significant in your mind, but those really large \u0022elevons\u0022  are the kind of thing that will cause you to have a wild ride; when you state that \u0022this thing flies pretty well, as long as i never touch the control since leaving the runway\u0022 that\u0027s where I\u0027d *start* to make it more stable.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep in mind that every time you press one of the control keys (WSAD) you are giving a \u0022full deflection\u0022 instruction to those controls - if you \u0022tap\u0022 the control key, it may be less of an input only due to the fact that the key press duration was shorter than the time it takes the control to fully deflect. Furthering the problem is that as you get faster, the effect is increased.\n\u003C/p\u003E\n\u003Cp\u003E\nA couple of solutions to try: limit the total deflection of the controls, make them smaller or place them further inboard to limit their roll authority and see if that makes it a bit more manageable.\n\u003C/p\u003E\n\u003Cp\u003E\n[Edit: One additional observation, below]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni reduced the maximum angle to 20 degrees already, because i know the highest deflection level is very inefficient. i didn\u0027t want to do all the way down to 15, though, in case i needed some harsh manuever.\n\u003C/p\u003E\n\u003Cp\u003E\nyou are right that the elevons were oversized, in fact i distinctly remember swapping out those bigS for something smaller already in the past. probably i messed up with saving games and i got stuck with the old oversized elevons without realizing.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877886\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604631023\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI suspect that when it departs from perfectly forward flight, it\u0027s not stable at all.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwrong. of course if i pull all up suddenly it will capsize, but moderate deviations (say, up to 10 degrees away from prograde even in the worst aerodinamic conditions) are handled just fine.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I were to modify that to make it fly better, I\u0027d make the elevons flat (no \u003Cabbr title=\u0022Angle of Attack\u0022\u003E\u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E\u003C/abbr\u003E) to pull the \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E\u003C/abbr\u003E back a little. I\u0027d also double or triple the vertical tail, because the yaw stability is currently minimal--Especially with \u003Cabbr title=\u0022Angle of Attack\u0022\u003E\u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E\u003C/abbr\u003E on the wings.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nhuh? by making the elevons flat, it pulls the \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E\u003C/abbr\u003E forward, not back\n\u003C/p\u003E\n\u003Cp\u003E\nincreasing the vertical tail instead worked,\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877893\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604632120\u0022 data-ipsquote-userid=\u0022206697\u0022 data-ipsquote-username=\u0022Wobbly Av8r\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Wobbly Av8r said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nApologize, but after looking it over one more time I recognized also that (contributing to instability with any maneuvering) the amount of area you have in FRONT of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is considerable - while wings and vertical fins can stabilize things, when you give it enough \u0027yaw\u0027, the airplane will act just like a rocket with a huge payload on top with little or no fins on the bottom (i.e. it will want to \u0022swap ends\u0022!) What \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E mentioned \u0022I\u0027d also double or triple the vertical tail, because the yaw stability is currently minimal\u0022 (more vertical fin-nage) will help solve the issue...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nhow would I reduce the amount of area in front of the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E? All i have there is part of the wings, and I can\u0027t exactly move the wings around without messing with the \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E\u003C/abbr\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nanyway, i implemented the changes suggested: I swapped out the big elevons for smaller ones and i put them closer to the body, and i swapped out the single vertical fin for two of them. It is, indeed, somewat more stable. I am able to manuever around and then find again a trajectory that won\u0027t require constant correction. though that\u0027s not always easy, sometimes i point prograde and leave the controls and it keeps flying straight, and sometimes the nose starts going down and i have to manually correct until i find a new stability. So my original doubt \u0022why, when i stop touching the controls, sometimes it keeps flying perfectly straight and sometimes it will not?\u0022 is still without answer. i guess it would depend on complex aerodinamic parameters determined by the exact trajectory and pressure\n\u003C/p\u003E\n\u003Cp\u003E\nSince I was there, i also attached the lateral tanks to the main body.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VLrpNc6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/VLrpNc6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: what the....?\n\u003C/p\u003E\n\u003Cp\u003E\ni went back to trying some water landing, and i\u0027m finding out it doesn\u0027t fly well anymore. I didn\u0027t touch anything since saving the plane after it did fly well... and i can\u0027t find stability anymore. and suddenly i have no roll-pitch control\n\u003C/p\u003E\n\u003Cp\u003E\nit\u0027s like the game wants me to revert all the changes i made. but why was it flying correctly the first time i tried them, only to fail the second?\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT 2: I figured out why i needed the big elevons: it\u0027s to land on water. water landing requires careful manuevering at low speed; smaller elevons are more effective at high speed, but they\u0027re no good if i can\u0027t land. generally speaking, this plane\u0027s major goal is exploring laythe, and I can now recognize that some of the things I did that were a bit less effective for flying were meant to improve water landing survivability\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT 3: i am unable to land on water anymore. to check if it was the new changes, i tried with an old model, and i discovered i also can\u0027t land on water anymore. maybe i checked water landing before adding extra fuel tanks. or maybe the game is inconsistent again. anyway, while i was piloting the old plane, i found it behaved well too; i could find stable trajectories easily enough. all things considered, the only improvement is the double fin tail. anyway, i need to alter the project to land on water again. possibly without screwing up flying and going to orbit while at it\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-06T11:39:43Z\u0022 title=\u002211/06/2020 11:39  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 6, 2020\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-11-06T11:46:02Z","Content":"\n\u003Cp\u003E\nCanards might help make this design more stable and improve its controllability. Put a pair of fins (they don’t have to be the specific canard parts, other winglets or fins will do as long as they have control authority) on the nose ahead of the cockpit and they will greatly improve your pitch control at the same time as adding a noticeable amount of lift at the front (if angled correctly), pushing the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E back quite a bit and allowing the main wings to be shifted forwards which will in turn push the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E forwards too. Canards are also very useful for water takeoffs as they pull the nose up and out of the water rather than pushing the tail down and into the water like trailing edge elevators do.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I read this thread right, you want to use this plane as an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E for Laythe? Jet engines would be the best choice, a hybrid of Whiplash ramjets and a NERV would most likely be enough to get into orbit due to Laythe’s low orbital velocity and fairly thin atmosphere and would also have the big advantage of using solely liquid fuel and no oxidiser. Since that plane already has an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E in it (I think, looking at the screenshots) it would be easier to refuel it with just one fuel type- you could easily game the system by adding one small tank with oxidiser to run a fuel cell or with a drain valve to dump it, then run the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E for both \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E/Ox and \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E only to refuel faster.\n\u003C/p\u003E\n\u003Cp\u003E\nYou might want to try adding a pair of outriggers underneath the plane to make water landings easier, see the stock Osprey for one example of how to do this. They’ll add quite a bit of drag making it harder to fly into orbit, but can also hold fuel. You’ve mentioned propellers, which I’ll assume means you have Breaking Ground and which also means you could make the floats retractable for flying up to orbit and then deployable for water landings; some heavy duty hinges might be the best bet.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd back to the original point of the thread... Planes are rarely stable in flight as all the different forces acting on them change considerably depending on things like speed and altitude. You might want to consider using an autopilot mod of some kind to fly the plane for you, it makes life easier when the computer does the hard work for you.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2020-11-06T12:31:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877798\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604615118\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhere it is. yes, the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is a bit back\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, that\u0027s your problem right there.  It\u0027s \u003Cem\u003E\u003Cu\u003Ereally\u003C/u\u003E\u003C/em\u003E far back.  Unless you can figure out some way to move it forward, you\u0027re gonna have some problems.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could \u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Escootch that LV-N forward\u003C/span\u003E a bit and clip about 2/3 of its length inside that fuel tank... that would help with the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, but not sure if you\u0027re okay with the aesthetics.\n\u003C/p\u003E\n\u003Cp\u003E\nProbably the easiest way to move \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E forward would be to take those two \u0022outriggers\u0022 (the ones with the aerospikes on them) and \u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Eslide them \u003C/span\u003E\u003Cem\u003E\u003Cu\u003E\u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Eway\u003C/span\u003E\u003C/u\u003E\u003C/em\u003E\u003Cspan style=\u0022background-color:#ffff00;\u0022\u003E forwards\u003C/span\u003E, so that the aerospikes are closer to the middle of the plane rather than the rear.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother problem you have is that \u003Cem\u003E\u003Cu\u003Eyou have very little control authority\u003C/u\u003E\u003C/em\u003E.  With the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E so far in the back, those ailerons on the trailing edge of the wing have very little lever arm to work with, since they\u0027re not very far behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.  So you need to figure out some way to get pitch authority from control surfaces that are \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E close to the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.  One thing you could do would be to \u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Eadd some canards to the front of the plane\u003C/span\u003E, as far forwards as you can.  AV-R8 winglets work well for this.  Set them to reduced range of movement, and I\u0027d advise giving them pitch authority only.  Since the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is far to the rear of the plane, that means that canards up front will have a really big lever arm to work with and ought to help with stability quite a bit, as long as you don\u0027t let your \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E get too large.\n\u003C/p\u003E\n\u003Cp\u003E\nHave you made sure that your vertical stabilizer has roll authority disabled?  (It\u0027s \u003Cem\u003E\u003Cu\u003Eon\u003C/u\u003E\u003C/em\u003E by default-- you have to manually turn it off.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-11-06T15:19:46Z","Content":"\n\u003Cp\u003E\nyou know what, guys, after some more extensive testing i realize the plane is perfect as it is, for my purpose.\n\u003C/p\u003E\n\u003Cp\u003E\nit is supposed to grab science from laythe in every biome, both on the ground (well, water) and flying over it. this means making a lot of distance over the sea, while still keeping enough fuel to orbit. so my choice of propellers is the correct one.\n\u003C/p\u003E\n\u003Cp\u003E\nat this point, i must be able to land on water. that, i discovered, can be done even with the new version, it\u0027s just a matter of figuring out the technique. i was trying to hit the water as slowly as possible and absorb the impact with the wings, which have a decent impact tolerance; this worked with the lighter model, not with this. but then i discovered that if i enter water very carefully touching only with the wheels, those wheels will slow the plane enough to safely enter with the fuselage too, and i can do it at 70 m/s reliably. i\u0027ve done it 5 times in a row without crashing, and while i\u0027ll still want to save the game before landing, it\u0027s a fairly safe manuever.\n\u003C/p\u003E\n\u003Cp\u003E\ntaking off from water is not strictly necessary, but it is highly desirable.  i can use my propellers to move around on the water surface and pretend i\u0027m a boat, but i\u0027m limited to around 70 m/s top speed. I can go above 200 m/s in the air, it\u0027s gonna make things much faster. And to take off from water, a rear \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E is desirable; it helps me tilt the plane upwards for take off. i tried to move the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E forward by moving the big fuel tank in front of the command pod, and i discovered that I couldn\u0027t take off anymore; when i tried to tilt the tip up, the back of the plane would sink in the water, slowing me down. I also need the huge elevons, to help me get off the water.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried to add a third pair of wings to improve manueverability at low speed, but they didn\u0027t work as well, and they apparently created all sorts of issues. plus they pushed the center of mass way too forward.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m basically going with my first model, just with 2 tail fins and the elevons closer to the center.\n\u003C/p\u003E\n\u003Cp\u003E\nYour input was useful, though. it made me realize that while I could make this plane fly better, I could only do it by sacrificing something else. So there are no engineering mistakes in my design, only trade-offs.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877985\u0022 data-ipsquote-contentid=\u0022197911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604663162\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I read this thread right, you want to use this plane as an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E for Laythe? Jet engines would be the best choice, a hybrid of Whiplash ramjets and a NERV would most likely be enough to get into orbit due to Laythe’s low orbital velocity and fairly thin atmosphere and would also have the big advantage of using solely liquid fuel and no oxidiser. Since that plane already has an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E in it (I think, looking at the screenshots) it would be easier to refuel it with just one fuel type- you could easily game the system by adding one small tank with oxidiser to run a fuel cell or with a drain valve to dump it, then run the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E for both \u003Cabbr title=\u0022Liquid Fuel\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u003C/abbr\u003E/Ox and \u003Cabbr title=\u0022Liquid Fuel\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u003C/abbr\u003E only to refuel faster.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPropellers are better. laythe has way too little land to make \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E\u003C/abbr\u003E reliably (unless i can mine ore from water? i never tried), and anyway i realized i don\u0027t need it. i land on laythe, move around with propellers (fueled by 8 \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u003C/abbr\u003E), then i use the fuel only to go back in orbit. I will have a mother ship waiting me, and it will have \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E\u003C/abbr\u003E capacity from the smaller moons. not that i will actually need a refueling, since for the other moons i will use a rover.\n\u003C/p\u003E\n\u003Cp\u003E\nthe mission actually has another part earlier, where i dip inside jool atmosphere enough to reach the low atmosphere, do science there, and start again. for this, i coupled this plane with another, bigger thing that will brake during descent (thanks to an inflatable thermal shield used as a parachute, i already tested the concept) and will then propel me in orbit again. this plane then will be the last stage, the one reaching jool orbit. there it will couple again with the main ship to get refueled and explore laythe.  my choice of engine works for jool ascent too.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PeIiClj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/PeIiClj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthe final version i picked\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ph6p4pL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/ph6p4pL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nand the jool ascent stages. the jool ascent is a pretty poor flyer, but it does its job, and since i intend to only use it once - and it has two vectors to help stability - then it\u0027s fine\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-06T15:24:46Z\u0022 title=\u002211/06/2020 03:24  PM\u0022 data-short=\u00223 yr\u0022\u003ENovember 6, 2020\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"}]}