{"TopicId":197935,"ForumId":109,"TopicTitle":"Kerbal Space Program 2 to be released in 2022 [Discussion Thread]","CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-11-05T17:18:00Z","PageNum":5,"Articles":[{"CreatedByName":"sh1pman","CreatedById":147869,"CreatedDateTime":"2020-11-06T07:38:41Z","Content":"\n\u003Cp\u003E\nRelease date escape velocity: when for every month of real time, KSP2 release date gets pushed back for more than one month.\n\u003C/p\u003E\n"},{"CreatedByName":"ArtemisAZ","CreatedById":179669,"CreatedDateTime":"2020-11-06T07:41:23Z","Content":"\n\u003Cp\u003E\n[Removed for reasons]\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-26T20:00:34Z\u0022 title=\u002211/26/2020 08:00  PM\u0022 data-short=\u00223 yr\u0022\u003ENovember 26, 2020\u003C/time\u003E by Krulliam\u003C/strong\u003E\n\u003Cbr\u003EREASONS\n\u003C/span\u003E\n"},{"CreatedByName":"ArtemisAZ","CreatedById":179669,"CreatedDateTime":"2020-11-06T08:10:40Z","Content":"\n\u003Cp\u003E\n[Removed for reasons]\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-26T20:00:48Z\u0022 title=\u002211/26/2020 08:00  PM\u0022 data-short=\u00223 yr\u0022\u003ENovember 26, 2020\u003C/time\u003E by Krulliam\u003C/strong\u003E\n\u003Cbr\u003EMind the language, please.\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-11-06T08:25:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877948\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604650240\u0022 data-ipsquote-userid=\u0022179669\u0022 data-ipsquote-username=\u0022Krulliam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Krulliam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe fact nobody bothers to take a moment and think \u0022You know maybe there\u0027s a valid reason on why this is happening and just maybe I should just learn to suck it up and deal with waiting a little bit longer because that\u0027s just being an empathetic human being\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are two sides to that. On one hand, I agree, people need to learn to chill a bit. The vitriol that got posted addressing Cyberpunk devs is not acceptable.\n\u003C/p\u003E\n\u003Cp\u003E\nBut also, simply saying, \u0022Games will take however long they take,\u0022 isn\u0027t constructive. Even if nobody is harassing you, working on a project that keeps getting longer is excrements, trust me. It\u0027s extremely demoralizing when you were supposed to be finished with the game, but the schedule keeps getting longer and longer. And honestly, there needs to be a little bit of an external pressure from the fans to get the games released on time.\n\u003C/p\u003E\n\u003Cp\u003E\nWe should be striving to find a balance where there is no harassment, no crunch, but also isn\u0027t a \u0022take however long you need.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe best thing you, as a fan, can do is ask for updates. Not demand. Not remind PR that you haven\u0027t seen an update since whenever. But genuinely, curiously ask if there have been any cool developments. If there\u0027s anything to share. It\u0027s a way of rushing developers along without creating negativity. And even when there are delays, and even if there is some secrecy around the project, there are usually some things devs can share.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-11-06T08:25:51Z","Content":"\n\u003Cp\u003E\nKSP-2 was announced in Aug 2019. \u003Cbr\u003E\nSo, they gave time till the Jan 2024 before the news reach the habitants of Alpha Centauri and they start bombing the developers with interstellar spam.\n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2020-11-06T08:33:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877931\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604645070\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEh. It kind of makes sense. I did think they were entirely too optimistic about how much of the team and project they are salvaging when Private Division took development away from Star Theory and gave it to Intercept. Whether or not it was the right decision at the time, it is guaranteed to be extremely disruptive, and given that they were still looking for graphics and physics engineers well into when game was supposed to be approaching later stages of production on the original schedule... Pragmatic thing would have been for Intercept to treat the game as if in pre-production for the first time. And yes, nobody likes that, not the developers who already worked on the game, and not the publishers who already funded said development, but it\u0027s even worse if you keep trying to do production without resources on a schedule that makes no sense.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, better late then never, in more ways than one. Best of luck to them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni do hope they\u0027re documenting the development process, because I\u0027d love to see a breakdown of just exactly how wrong it all went.  Because while i initially even thought the first timeline was achievable; it seems either that the initial prototypes hit a major technical snag that required a complete rebuild. Or the move threw them into development hell, with so many unresolved issues having to be tracked down and indexed before they could even begin working on it due to the people who knew about them leaving.\n\u003C/p\u003E\n\u003Cp\u003E\nFeature/Scope creep might have also played a major factor, and compounded on top of whatever issues they had. Either way; I\u0027m sure there\u0027s a heck of a story somewhere.\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-11-06T08:43:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877957\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604651596\u0022 data-ipsquote-userid=\u0022197414\u0022 data-ipsquote-username=\u0022Incarnation of Chaos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Incarnation of Chaos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEither way; I\u0027m sure there\u0027s a heck of a story somewhere.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I hope there\u0027s an honest post-mortem they can share at some point.\n\u003C/p\u003E\n"},{"CreatedByName":"3EP","CreatedById":207993,"CreatedDateTime":"2020-11-06T09:25:30Z","Content":"\n\u003Cp\u003E\nWhy not get some help from modders of the original game? Like the creator of Parallax, Scatter, AVE, SVE, BH, BK. Really talented people! Why not get help from them???\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-11-06T09:47:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877957\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604651596\u0022 data-ipsquote-userid=\u0022197414\u0022 data-ipsquote-username=\u0022Incarnation of Chaos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Incarnation of Chaos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni do hope they\u0027re documenting the development process, because I\u0027d love to see a breakdown of just exactly how wrong it all went.  Because while i initially even thought the first timeline was achievable; it seems either that the initial prototypes hit a major technical snag that required a complete rebuild. Or the move threw them into development hell, with so many unresolved issues having to be tracked down and indexed before they could even begin working on it due to the people who knew about them leaving.\n\u003C/p\u003E\n\u003Cp\u003E\nFeature/Scope creep might have also played a major factor, and compounded on top of whatever issues they had. Either way; I\u0027m sure there\u0027s a heck of a story somewhere.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s entirely possible that something changed so much with the prediction about popularity and sales figures that Private Division* decided to expand the scope of the game and grant a bigger budget to Intercept and, with how these things work, bigger budget = more time.\n\u003C/p\u003E\n\u003Cp\u003E\nExcept for the longer wait this is a good news, they just granted at least 6 more months (from Fall 2021 to the start of FY 2023 in march 2022) of budget to the studio, Intercept isn\u0027t funded with our donations, kickstarter, patreon or preorders, it has a publisher, one that\u0027s investing more and more money in the development and that will see no return if the game is not a success.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csub\u003E* Yes, I know, Private Division is T2, but nobody uses T2 for GTA or Borderlands, everybody always say Rockstar and Gearbox (not even 2K) and I\u0027ll do the same for KSP.\u003C/sub\u003E\u003C/p\u003E\n"},{"CreatedByName":"Novak","CreatedById":156955,"CreatedDateTime":"2020-11-06T10:16:41Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-11-06T10:17:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877963\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604654730\u0022 data-ipsquote-userid=\u0022207993\u0022 data-ipsquote-username=\u00223EP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, 3EP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy not get some help from modders of the original game? Like the creator of Parallax, Scatter, AVE, SVE, BH, BK. Really talented people! Why not get help from them???\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaking big games isn\u0027t that simple. You can\u0027t just take a bunch of people who are good at making this kind of content and code together into a team and say, \u0022Ok, make a game.\u0022 You need all of the pieces to fit together, and that means team structure. For every 3-5 developers you need a lead or sub-lead. For every 3-5 leads you need a director. And then you need a production team to keep it all on track. If you wanted to add 10 developers to your team and you managed to hire just 20 people to achieve it, you\u0027re being rather efficient. And then all of these people need to be ramped up on tools, best practices, various details of the project... So for the first few months, these new people are mostly just learning what\u0027s there already. And this is assuming they all have some prior experience working with teams, because otherwise, there is no guarantee they\u0027ll be ramping up fast enough.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then we get into costs. The studio is in US, so even with everyone working remotely, Intercept would have to hire people who can legally work in United States. Game development in US is rather competitive. Yeah, you can take a chance on a budding developer who\u0027s making mods, but if you don\u0027t offer them a competitive salary, six months down the line, just as they\u0027re starting to contribute, they\u0027re likely to ditch you for another job. In Bay Area, an entry level games engineer costs company about $100k/year. It\u0027s a bit cheaper in Washington, but still, high 5 digits. More senior individuals cost more, and as we\u0027ve discussed, you\u0027ll need management and production. So very conservatively, the addition of the above 20 people to increase your dev team by 10 developers is costing you something like $2 million per year. And as we\u0027ve discussed, first 6 months are basically ramping up.\n\u003C/p\u003E\n\u003Cp\u003E\nPrivate Division tried to have their cake and eat it. They were unhappy with Star Theory, whether because of scheduling or some other conflict, doesn\u0027t matter. Private Division decided that if they torpedo Star Theory, they can staff Intercept with existing developers, patch some losses, and get everything on track. That very clearly didn\u0027t work. Maybe they lost more core people than they thought they would, or maybe the project outgrew the existing team. I think it was actually both. Regardless, they ended up short, and are now trying to recover. The dilemma for Private and Intercept is whether they pull everyone back, re-scope the game, and start production with a new scope; or they hire and train up new people to meet the scope they inherited from Star Theory. Either way, this results in delays and additional costs. Hiring new people costs a lot more, however, as it increases the burn rate while still having the same delivery date. And looking at current openings for Intercept, it looks like Private Division decided that this would cost too much. So if I was betting, my money would be that they are re-scoping, narrowing down some ambition, while merely restructuring some of the rest to fit the team and the budget they get to work with. And that means they will be making somewhat different game than they were trying to make this spring.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd even if the game doesn\u0027t end up quite as big in some aspects, that might be a good thing. Because the modders will still be around, and so long as Intercept delivers a solid foundation, there will be ways to expand on it. They just have to make sure the core game is worth playing.\n\u003C/p\u003E\n"},{"CreatedByName":"Grimmas","CreatedById":207818,"CreatedDateTime":"2020-11-06T12:05:55Z","Content":"\n\u003Cp\u003E\nSo long as it gets released before Star Citizen, I\u0027m fine with this. More frequent updates / dev diaries would be appreciated though. \n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2020-11-06T12:56:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877964\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604656028\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s entirely possible that something changed so much with the prediction about popularity and sales figures that Private Division* decided to expand the scope of the game and grant a bigger budget to Intercept and, with how these things work, bigger budget = more time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExcept for the longer wait this is a good news, they just granted at least 6 more months (from Fall 2021 to the start of FY 2023 in march 2022) of budget to the studio, Intercept isn\u0027t funded with our donations, kickstarter, patreon or preorders, it has a publisher, one that\u0027s investing more and more money in the development and that will see no return if the game is not a success.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csub\u003E* Yes, I know, Private Division is T2, but nobody uses T2 for GTA or Borderlands, everybody always say Rockstar and Gearbox (not even 2K) and I\u0027ll do the same for KSP.\u003C/sub\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah i said that in a previous post in this thread, bit abridged though.\n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2020-11-06T13:14:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877971\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604657820\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaking big games isn\u0027t that simple. You can\u0027t just take a bunch of people who are good at making this kind of content and code together into a team and say, \u0022Ok, make a game.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnother point is how much of KSP1 would honestly be applicable to the development of KSP2, them being familiar with unity would be a plus. But all of KSP1\u0027s API\u0027s are gone, and the Unity version is more recent. So unless Intercept already had a decent amount of API code written, or the individuals were already familiar with using C#/C\u002B\u002B then it\u0027s really not something you couldn\u0027t find somewhere else. Modeling? DX11 changes what texture layers are required, and their individual complexity in some places. Now there are mods that use these type of textures and models in KSP, so i guess you might headhunt the 5 people who develop for them (I\u0027m exaggerating for effect, but still).\n\u003C/p\u003E\n\u003Cp\u003E\nSo at the end of the day, the total cost of training you\u0027d save is basically none. Potentially it might actually cost more to train someone who\u0027s had the bulk of their experience modding KSP1 than just a normal Software Developer straight out of College, due to KSP1 modder hires potentially having to unlearn so much while also dealing with significant gaps in their own understanding.\n\u003C/p\u003E\n\u003Cp\u003E\nI can think of a few people here, who might be exceptional enough to meet that bar and not require more training (Myself not included in that set, I\u0027d fall flat on my A$$ day 1. The set would include GamesLinx for instance though). But anyone like this probably had already gotten offers and an \u003Cabbr title=\u0022Non-Disclosure Agreement\u0022\u003ENDA\u003C/abbr\u003E had prohibited them from talking, or they already have a job in the field or similar. \n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a lot of exceptionally talented people here in general, but talent in one area rarely translates to very broad areas (Like ya know, building an entire game from the ground up).\n\u003C/p\u003E\n\u003Cp\u003E\nPs. I only gave one example, it\u0027s not to be taken as literally the entire set of people. I just didn\u0027t want to write an excel sheet xD\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2020-11-06T14:16:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877794\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604614608\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP 2 is going to run better than KSP 1 as it has been optimized for newer (but not necessarily killer) hardware. If it does run only on killer hardware, that\u0027s too bad, games can\u0027t be dragged behind for users with older tech.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly. The previous gen of consoles are REALLY bad for a game like this. If it was optimized to run on them, they would have to cut things or not do the things they want to. Now that it is getting pushed a year they can ignore those consoles and make the game they actually want to. \n\u003C/p\u003E\n"},{"CreatedByName":"TheLiquor","CreatedById":200010,"CreatedDateTime":"2020-11-06T15:21:42Z","Content":"\n\u003Cp\u003E\nTake all the time you need, it will be worth the wait in the end.\n\u003C/p\u003E\n"},{"CreatedByName":"TheoBrandt","CreatedById":205583,"CreatedDateTime":"2020-11-06T15:27:06Z","Content":"\n\u003Cp\u003E\nI agree with the majority. A solid game release that works and is polished is a priority. But I think it would help a lot of peoples patience if we had even a sliver of more clarity. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205123-nate-simpson/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022205123\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205123-nate-simpson/\u0022 rel=\u0022\u0022\u003E@Nate Simpson\u003C/a\u003E I don\u0027t feel like you\u0027re being disingenuous, or rattling off an excuse, but your post boils down to \u0022game good, another year\u0022 with no tangible crumb to hold. You can go into detail about problems you\u0027re facing without specifics, the dev diary about distance calculations between solar systems was really good. More of that please.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-11-06T16:03:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223878064\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604676426\u0022 data-ipsquote-userid=\u0022205583\u0022 data-ipsquote-username=\u0022TheoBrandt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, TheoBrandt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree with the majority. A solid game release that works and is polished is a priority. But I think it would help a lot of peoples patience if we had even a sliver of more clarity. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205123-nate-simpson/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022205123\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205123-nate-simpson/\u0022 rel=\u0022\u0022\u003E@Nate Simpson\u003C/a\u003E I don\u0027t feel like you\u0027re being disingenuous, or rattling off an excuse, but your post boils down to \u0022game good, another year\u0022 with no tangible crumb to hold. You can go into detail about problems you\u0027re facing without specifics, the dev diary about distance calculations between solar systems was really good. More of that please.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, there\u0027s not enough transparency. This community isn\u0027t stupid enough to treat \u0027might be in game\u0027 posts as confirmations.\n\u003C/p\u003E\n"},{"CreatedByName":"Lewie","CreatedById":203745,"CreatedDateTime":"2020-11-06T16:19:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877919\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604639482\u0022 data-ipsquote-userid=\u0022107558\u0022 data-ipsquote-username=\u0022Yellowburn10\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Yellowburn10 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m willing to create a little wager: let\u0027s see what happens first, KSP2 is released, or Starship gets into space for the first time. Place your bets now.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy money’s on Starship reaching orbit first.\n\u003C/p\u003E\n\u003Cp\u003E\nIn all seriousness, I hope the team stays safe, and that the rest of the development goes smoothly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Stingray","CreatedById":90536,"CreatedDateTime":"2020-11-06T16:28:37Z","Content":"\n\u003Cp\u003E\nMeh, no big deal for me personaly, i rather have no crunchtime for the devs and a more polished game. I still have many hours to play with 1.10 now that i have most of my mods updated. Stay safe everyone.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-11-06T16:39:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223877963\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604654730\u0022 data-ipsquote-userid=\u0022207993\u0022 data-ipsquote-username=\u00223EP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, 3EP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy not get some help from modders of the original game? Like the creator of Parallax, Scatter, AVE, SVE, BH, BK. Really talented people! Why not get help from them???\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause \u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Mythical_Man-Month\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/The_Mythical_Man-Month\u003C/a\u003E\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223878079\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604678627\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis community isn\u0027t stupid enough to treat \u0027might be in game\u0027 posts as confirmations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have never, ever seen proof of that.\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2020-11-06T17:16:42Z","Content":"\n\u003Cp\u003E\nYep, this game won’t come out, no offense but if professional devs can’t remake an existing game then no one can.\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2020-11-06T18:17:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223878108\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604683002\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYep, this game won’t come out, no offense but if professional devs can’t remake an existing game then no one can.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat makes no logical sense. Where did the original KSP come from then? Down from the gods or something?\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-11-06T19:08:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223878108\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604683002\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYep, this game won’t come out, no offense but if professional devs can’t remake an existing game then no one can.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd you\u0027re just going to pretend these things can be done in a snap? They\u0027re doing something that no-one else except a few bothers to do. You\u0027ve seen the trailers, they have the game in a (somewhat) functional state, they\u0027ve done better than Squad have so far and all the game needs now is lots of polish, bug fixing and pandering to this self-entitled community.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-06T19:08:31Z\u0022 title=\u002211/06/2020 07:08  PM\u0022 data-short=\u00223 yr\u0022\u003ENovember 6, 2020\u003C/time\u003E by Bej Kerman\u003C/strong\u003E\n\u003Cbr\u003EGramer\n\u003C/span\u003E\n"},{"CreatedByName":"ArtemisAZ","CreatedById":179669,"CreatedDateTime":"2020-11-06T19:15:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223878149\u0022 data-ipsquote-contentid=\u0022197935\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604689691\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd you\u0027re just going to pretend these things can be done in a snap? They\u0027re doing something that no-one else except a few bothers to do. You\u0027ve seen the trailers, they have the game in a (somewhat) functional state, they\u0027ve done better than Squad have so far and all the game needs now is lots of polish, bug fixing and pandering to this self-entitled community.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTHIS ^\u003Cbr\u003E\nHOW IS IT THAT HARD FOR PEOPLE TO UNDERSTAND? \n\u003C/p\u003E\n"}]}