{"TopicId":198341,"ForumId":51,"TopicTitle":"Kerbin orbit to Jool orbit for 855 m/s","CreatedByName":"camacju","CreatedById":207172,"CreatedDateTime":"2020-11-26T07:04:43Z","PageNum":1,"Articles":[{"CreatedByName":"camacju","CreatedById":207172,"CreatedDateTime":"2020-11-26T07:04:43Z","Content":"\n\u003Cp\u003E\nI\u0027ve been playing around with some possible methods to use gravity assists off the Mun to get to other planets. One gravity assist by itself isn\u0027t enough to make a big difference. However, you can eject into a resonance with Kerbin and grab additional Mun assists to pick up energy as demonstrated by Vector. He took a craft from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E to Eve for 873 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a post where I got from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E to Eve for 841 m/s. In this run, I use 3 m/s in course corrections between Eve and Jool. So theoretically 844 m/s Kerbin to Jool is possible. I\u0027m leaving this opportunity open for someone who is a better pilot than I am.\n\u003C/p\u003E\n\u003Cp\u003E\nThe route: Kerbin-Mun-Mun-Kerbin-Mun-Kerbin-Mun-Eve-Kerbin-Kerbin-Jool\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TWGDlYG.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TWGDlYG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn low Kerbin orbit with 905 m/s of delta-v remaining. This final maneuver isn\u0027t the one I ended up using. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220wrw5DL.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0wrw5DL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMun assist kicks my orbit far above Kerbin where I use a second Mun assist to eject into a 5:4 resonance with Kerbin. I could have used a set of three Mun assists instead of just two, saving 12-13 m/s, but I didn\u0027t because my timing is lazy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022f106TcB.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/f106TcB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFive years later I encounter Kerbin, turning my prograde velocity into retrograde velocity, and also getting some more retrograde velocity from the Mun. This puts me into a 4:5 resonance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vtvqqQ1.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vtvqqQ1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFour years later I encounter Kerbin and the Mun again, dropping my orbit below Eve. Here, I neglected to time the transfer window properly so I have to wait a long time before getting the Eve assist. I think this Eve assist is actually more effective than a direct transfer would be since I have more radial velocity than a standard transfer?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CBEGstY.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CBEGstY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere, I have the Eve assist and two Kerbin assists set up. However I lose a bunch of precision due to using high time warp in the inner system and also warping across \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E boundaries. The Eve assist is set to give me a Kerbin assist two orbits later, and then another Kerbin assist one orbit (three years) later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022am52wVY.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/am52wVY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinal Kerbin assist set up - Jool wasn\u0027t in quite the right place (because again, lazy timing) so I have to raise my orbit quite a bit higher than normal with this last assist\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mevk4C4.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mevk4C4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTylo and Laythe assists to capture in orbit around Jool\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sfOdbSu.png\u0022 data-ratio=\u002264.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sfOdbSu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here we are in Jool orbit. 50 m/s remaining, 905 m/s to start, 855 m/s expended between Kerbin orbit and Jool orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nI can actually see this path as being quite useful. While it takes a lot longer, and a lot more careful planning, than a K-E-K-K-J route, it also saves nearly 20% of the delta-v needed.\n\u003C/p\u003E\n\u003Cp\u003E\nA further advantage to this path is that there is no minimum \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E required since you can just do periapsis kicks until you encounter Mun. This means that this is near ideal for low mass missions where \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is a tradeoff with delta-v.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-27T01:07:13Z\u0022 title=\u002211/27/2020 01:07  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 27, 2020\u003C/time\u003E by camacju\u003C/strong\u003E\n\u003C/span\u003E\n"}]}