{"TopicId":19884,"ForumId":16,"TopicTitle":"I cannot perform interplanetary flight.","CreatedByName":"MrAmazingfuntime","CreatedById":50936,"CreatedDateTime":"2012-09-22T18:47:01Z","PageNum":1,"Articles":[{"CreatedByName":"MrAmazingfuntime","CreatedById":50936,"CreatedDateTime":"2012-09-22T18:47:01Z","Content":"\n\u003Cp\u003EI feel terribly sorry for my Kerbals, in that I cannot seem to guide them to another planet. \u003C/p\u003E\u003Cp\u003EI can get to the Mun through that method where you get an east travelling orbit, and burst when you see the Munrise. But that isn\u0027t a mathematical way of doing it, so I can\u0027t translate that into getting to Duna or any other planet.\u003C/p\u003E\u003Cp\u003EBasically, I need someone to tell me in very, very simple terms how to get to another planet. I need to know what bits of the navball to look at, and what my heading is (and what the heading even measures itself up against), and some way to know when Kerbin\u0027s position is appropriate for the manouevre. If there is any maths involved (which I\u0027m sure there is) then I need someone to explain it to me extremely simply, because I\u0027m a foolish Kerbal who can\u0027t do numbers. For instance, I have no idea what any of the letters stand for in equations. I studied physics at GCSE, but that\u0027s it. End of knowledge.\u003C/p\u003E\u003Cp\u003EAlso, I put too much in posts. Sorry about that.\u003C/p\u003E\u003Cp\u003EAlso, is it just me being old and senile or is it literally getting harder to do anything with the old stock parts on KSP?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Yeomans","CreatedById":46569,"CreatedDateTime":"2012-09-22T20:35:18Z","Content":"\n\u003Cp\u003EUnfortunately transferring between two bodies orbiting one body is much more difficult than transferring to a body orbiting around the origin body.\u003C/p\u003E\u003Cp\u003EHowever, this calculator from Olex tells you where the planet must be in relation to your target, and where your position must be in the orbit around the planet for a successful burn. It\u0027s not the most accurate, but it\u0027s your best bet, and once you get within the planet\u0027s sphere of influence you can just retrograde burn at periapsis to put yourself in orbit.\u003C/p\u003E\u003Cp\u003EI would try Duna first, as there\u0027s no inclination change and such, and then maybe Jool because the planet is very large and has a large sphere of influence.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"MrAmazingfuntime","CreatedById":50936,"CreatedDateTime":"2012-09-22T21:07:06Z","Content":"\n\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EI\u0027ve been using that calculator thingy that\u0027s on \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E. It\u0027s quite useful, though it took me a while to get my head around what it actually meant. I\u0027ve just about managed to sort sail past Duna, but it was an encounter (a rubbish one, but an encounter none the less). I suppose it\u0027s just one of those things that you need to know how to do first to know how to do it first, which is what makes it so tricky. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"colonel0sanders","CreatedById":26580,"CreatedDateTime":"2012-09-22T21:12:48Z","Content":"\n\u003Cp\u003EOne way to eyeball your Kerbin escape burn for getting to Duna and Jool that is similar to the \u0022burn-at-munrise\u0022 method that I\u0027ve used so far is to get into a 100km circular orbit around Kerbin, and then start your escape burn as soon as the sun sets. Of course, you need Kerbin and the target planet to be in the right positions relative to each other. I made it to Jool burning when it is 90-100 degrees ahead of Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-09-22T22:10:03Z","Content":"\n\u003Cp\u003ESo, how i do it is:\u003C/p\u003E\u003Cp\u003Ego to\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.ksp.olex.biz\u0022 rel=\u0022external nofollow\u0022\u003Ewww.ksp.olex.biz\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eenter peramitars\u003C/p\u003E\u003Cp\u003Ego to ksp\u003C/p\u003E\u003Cp\u003Eopen up map\u003C/p\u003E\u003Cp\u003Etime warp untill the diagram looks like the ksp map (no need to be exact)\u003C/p\u003E\u003Cp\u003Elaunch and burn at right angle on kerbin (again, comparison)\u003C/p\u003E\u003Cp\u003EWait untill it shows a duna encounter.\u003C/p\u003E\u003Cp\u003E(NOTE: Make sure to set maxpatchedconics in settings config to 4 or more insted of 2! otherwise it wont tell you of the encounter untill you escape kerbin!)\u003C/p\u003E\n"},{"CreatedByName":"MrAmazingfuntime","CreatedById":50936,"CreatedDateTime":"2012-09-22T22:14:21Z","Content":"\n\u003Cp\u003EHmm, thanks, I\u0027ll have to root around in the settings. And that setting sun idea sounds easily workable. I\u0027ve tried reaching Duna with a paper printout protractor held against the screen for \u0027precise rocket-science measurements\u0027. It\u0027s, uh, slightly innaccurate. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-09-22T22:59:54Z","Content":"\n\u003Cp\u003EI use the method, get into orbit. Put myslf in an orbit near the target planet, and then make small adjustments and wait hundreds of days on timewarp until I line up. It works fine for me.\u003C/p\u003E\n"},{"CreatedByName":"Hiatsu2k8","CreatedById":17826,"CreatedDateTime":"2012-09-23T03:33:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003ESo, how i do it is:\u003Cp\u003Ego to\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.ksp.olex.biz\u0022 rel=\u0022external nofollow\u0022\u003Ewww.ksp.olex.biz\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eenter peramitars\u003C/p\u003E\u003Cp\u003Ego to ksp\u003C/p\u003E\u003Cp\u003Eopen up map\u003C/p\u003E\u003Cp\u003Etime warp untill the diagram looks like the ksp map (no need to be exact)\u003C/p\u003E\u003Cp\u003Elaunch and burn at right angle on kerbin (again, comparison)\u003C/p\u003E\u003Cp\u003EWait untill it shows a duna encounter.\u003C/p\u003E\u003Cp\u003E(NOTE: Make sure to set maxpatchedconics in settings config to 4 or more insted of 2! otherwise it wont tell you of the encounter untill you escape kerbin!)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI read your link and everything you said makes no sense at all to me.\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2012-09-23T13:26:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrAmazingfuntime\u0022 data-cite=\u0022MrAmazingfuntime\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027ve been using that calculator thingy that\u0027s on \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E. It\u0027s quite useful, though it took me a while to get my head around what it actually meant.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve just been on Duna and back thanks to this site \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Veeery useful ! Also, it\u0027s easy to remember the phase and ejection angles for Kerbin-\u0026gt;Duna, it\u0027s pretty much 45Ã‚Â° between Kerbin-Kerbol-Duna and one notch below 135Ã‚Â° (-45Ã‚Â° from horizontal when you keep Kerbin horizontal from Kerbol) on the local orbit for the ejection burn. One has to be veeery attentive and quick to kill throttle at the incredibly short instant during which orbits intercept at Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll just add two things: the new nuclear drive is awesome, and aerobraking into Kerbin\u0027s atmosphere from a solar orbit is scary.\u003C/p\u003E\n"},{"CreatedByName":"Companion","CreatedById":46415,"CreatedDateTime":"2012-09-23T15:16:20Z","Content":"\n\u003Cp\u003Eget mechjeb? with mechjeb you can go into orbit around the sun, then go into orbital operations, click on trans, select your planet\u003C/p\u003E\n"}]}