{"TopicId":198938,"ForumId":16,"TopicTitle":"Mission Name Ideas","CreatedByName":"Tristen Simon","CreatedById":208595,"CreatedDateTime":"2020-12-21T21:13:15Z","PageNum":1,"Articles":[{"CreatedByName":"Tristen Simon","CreatedById":208595,"CreatedDateTime":"2020-12-21T21:13:15Z","Content":"\n\u003Cp\u003E\nOk, so I just finished a mission program for a Mun landing, the \u0022Kerpollo\u0022 Program. I\u0027ve already decided on Kerbin and Jool mission names. So, I need some mission names for everything except Kerbin, the Mun, and Jool. It can be based off of a real mission program name, just make sure it\u0027s \u0022Kerbalized.\u0022 Or, create your own name!\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2020-12-22T15:31:06Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208595-tristen-simon/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022208595\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208595-tristen-simon/\u0022 rel=\u0022\u0022\u003E@Tristen Simon\u003C/a\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose that this is technically a gameplay question, though don\u0027t be surprised should you you find this moved to KSP Discussion.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I typically go in for tongue-planted-firmly-in-cheek puns, metaphors, and allusions in my mission/vessel names.  My first space station, which is normally early enough that it is actually functionally useless--but nevertheless often provides good contract opportunities--is almost always called \u003Cem\u003EBridge to Anywhere \u003C/em\u003Ein reference both to the bridge in Alaska and the quote about getting to orbit being halfway to anywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nI usually call my first Minmus lander the \u003Cem\u003EIce Cream Sampler\u003C/em\u003E; later ones are \u003Cem\u003EFrozen Disappointment\u003C/em\u003E.  Flybys are, after the \u003Cem\u003EMunshot\u003C/em\u003E series of rockets before them, called \u003Cem\u003EMinshot\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly Eve missions, of which the crewed type never involve a landing (I use life support mods and don\u0027t have effective means to supply an Eve base at the beginning) are \u003Cem\u003ELook But Don\u0027t Touch\u003C/em\u003E.  I have a set of probe landers for Eve\u0027s surface that incorporate tiny rovers in a service bay that have all of the repeatable experiments (the Goo and such stay on the lander); these are named \u003Cem\u003EWay-Discoverer, Trail-Locator\u003C/em\u003E, and similar titles, with the rovers called things such as \u003Cem\u003EHonest Wanderer\u003C/em\u003E and \u003Cem\u003EVerified Traveller\u003C/em\u003E.  They are arguably more appropriate to Duna, but, well, it\u0027s my game.  Also, the rover that crashed on Duna is called the \u003Cem\u003EDead Cat\u003C/em\u003E.  The one that landed correctly with the repair parts to rescue it is called the \u003Cem\u003ESatisfaction\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nMoho is normally called some variation of \u003Cem\u003EDedicated Masochism\u003C/em\u003E.  Assemblies in orbit, if large enough, are also contenders for this distinction.\n\u003C/p\u003E\n\u003Cp\u003E\nI also play with Outer Planets Mod, so sending crewed missions all the way out to Plock necessitates some creative design--or a cryogenic freezer.  The vessel class that carries one is called an iceliner, and the mission called the \u003Cem\u003ECorpsicle Express\u003C/em\u003E (with missions to nearer bodies as some variation of \u003Cem\u003EZombie Queen\u003C/em\u003E), which are references to a short story by Larry Niven and also to a mission report by \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E called the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127345-the-outer-planets-traveling-circus-episode-28-superheroes-the-end/\u0026amp;tab=comments#comment-2314346\u0022 rel=\u0022\u0022\u003EOuter Planets Traveling Circus\u003C/a\u003E; it\u0027s old but it\u0027s whimsical, and that suits me.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will typically send comm arrays in groups for either better coverage or to send to different bodies in the same local system (for example, one orbits Duna and another orbits Ike).  Sometimes, I will use flotillas, but comsats are small enough that I just as often send them on a single transfer rocket with decouplers.  The one that goes to Jool and its moons is called \u003Cem\u003EActually Six Smaller Ships in a Trenchcoat\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nRescue and repair missions are \u003Cem\u003EPut Back Together with Parts Left Over\u003C/em\u003E, and my large-capacity training/experience vessel for new Kerbals is called the \u003Cem\u003EMagic School Bus\u003C/em\u003E.  Asteroid capture vessels are called \u003Cem\u003ERocket with Real Rocks in It\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope that helps, and if not, I hope it was good for a chuckle or two.  Have fun!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-12-22T15:48:54Z","Content":"\n\u003Cp\u003E\nI made some Eve lander probes called Evenera (Eve \u002B Venera, the Soviet Venus landers) and there a few other real mission names that could be co-opted into KSP: P-ion-eer for an ion-powered deep space probe, some variation on Cassini-Huygens (Kassini-Whogens, maybe?) to be lobbed at Laythe (or more appropriately at OPM Sarnus’ moon Tekto), and a failed Mars lander called Bungle 2 (named after Beagle 2 which actually landed but didn’t deploy properly), for example.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-12-23T04:51:31Z","Content":"\n\u003Cp\u003E\nI generally call stuff \u0022mun lander\u0022, \u0022laythe plane\u0022, \u0022orbiter\u0022, or some other unimaginative things.\n\u003C/p\u003E\n\u003Cp\u003E\nsometimes random bouts of creativity strike me, and i give real names. they are generally caused by random though associations, they often are references to something and they generally refer to some actual traits of the ship. for example, a ship with a nuclear engine made to explore multiple planets was called Marco Polonium, joining the great explorer marco polo with nuclear power. or another whom i flooded with lights, i dubbed it flying christmas tree. but sometimes i am more serious, my latest mothership, built using the kerbalism mod in an attempt to have life support run for decades, I decided to call it Home, because that\u0027s what\u0027s supposed to be\n\u003C/p\u003E\n"},{"CreatedByName":"theleg","CreatedById":208773,"CreatedDateTime":"2020-12-23T07:25:32Z","Content":"\n\u003Cp\u003E\nUse this mod - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/138349-19x-champagne-bottle-redux/\u0022 rel=\u0022\u0022\u003EChampagne Bottle Redux\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-23T07:26:47Z\u0022 title=\u002212/23/2020 07:26  AM\u0022 data-short=\u00223 yr\u0022\u003EDecember 23, 2020\u003C/time\u003E by theleg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"STEAMED_PIGLIN","CreatedById":208832,"CreatedDateTime":"2021-01-22T15:11:08Z","Content":"\n\u003Cp\u003E\nMun Mission: KEPUTNIK!\n\u003C/p\u003E\n\u003Cp\u003E\na solar space station that orbits way too close: HELL\n\u003C/p\u003E\n\u003Cp\u003E\nsarnus mission (if you have outer planets mod): KRASH! (space probe)-KRASHER (tekto lander)-KRAP (Atmospheric thing to krash into sarnus)\n\u003C/p\u003E\n\u003Cp\u003E\nmoho lander: into_le_unknown_to_the_kerbals!\n\u003C/p\u003E\n\u003Cp\u003E\nbop mission: KRACK\u0027N!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022maxresdefault.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.ytimg.com/vi/W8tjPPNvomg/maxresdefault.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}