{"TopicId":19928,"ForumId":32,"TopicTitle":"Fuel drains too quickly?","CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-09-23T01:49:48Z","PageNum":1,"Articles":[{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-09-23T01:49:48Z","Content":"\n\u003Cp\u003ESeems in the new version, fuel drains way too quickly. I mean, I knew low throttle gave a bit too much bang for your buck in the old version, but this just seems ridiculous. My Revital-5 three-kerbal lander, previously being able to return from Minmus with like half a tank left, and having ditched two stages that could have plenty of fuel left, currently can\u0027t even fully return from the Mun.\u003C/p\u003E\u003Cp\u003EI do have a single-kerbal orbiter that seems to be capable of interplanetary missions, but if this is the new norm for fuel consumption, then this game just got much, much harder...\u003C/p\u003E\n"},{"CreatedByName":"tk5800thesecond","CreatedById":16577,"CreatedDateTime":"2012-09-23T01:52:39Z","Content":"\n\u003Cp\u003EUnless you were thrusting at %100 your rockets probably wont work in .17, but, there are other factors that I am not aware of and fuel does seem to drain slightly more quickly than usual\u003C/p\u003E\n"},{"CreatedByName":"UNSC","CreatedById":31653,"CreatedDateTime":"2012-09-23T01:53:13Z","Content":"\n\u003Cp\u003EYep, the fuel bug is gone, the engines are burning the correct amount of fuel now.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-09-23T01:54:54Z","Content":"\n\u003Cp\u003EAs I have posted before elsewhere, I think the fuel bug caused under-consumption in certain cross flow situations. It wasn\u0027t just a throttle thing.\u003C/p\u003E\u003Cp\u003EFor example I have an SSTO that used full thrust all the way to orbit (jets to 11km, then rockets to 100km). In 0.16 it had 668 units of fuel left. Now in 0.17 it has 245 units.\u003C/p\u003E\u003Cp\u003EIMO i played the game as-is with the fuel bug in 0.16 and now i\u0027m playing it as-is in 0.17. If it\u0027s an over-consumption bug now or not I don\u0027t care. I just built it bigger.\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2012-09-23T03:16:10Z","Content":"\n\u003Cp\u003Eodds are, you were exploiting more fuel than you realized. Even if there is a bug (which it probably isn\u0027t), I\u0027d MUCH rather it be that fuel drains to quickly than too slowly. \u003C/p\u003E\u003Cp\u003Esecondly, why aren\u0027t you using the nuclear engine? unless you\u0027re disgusted by how ludicrously efficient it is (which no doubt some people are), It\u0027s sort of a no-brainer. vacuum impulse of 800?!?!? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethirdly, what are you doing going to mun and min? they added entire new planets! kerbin moons are for 0.16ers!\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-09-23T04:36:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EAs I have posted before elsewhere, I think the fuel bug caused under-consumption in certain cross flow situations. It wasn\u0027t just a throttle thing.\u003Cp\u003EFor example I have an SSTO that used full thrust all the way to orbit (jets to 11km, then rockets to 100km). In 0.16 it had 668 units of fuel left. Now in 0.17 it has 245 units.\u003C/p\u003E\u003Cp\u003EIMO i played the game as-is with the fuel bug in 0.16 and now i\u0027m playing it as-is in 0.17. If it\u0027s an over-consumption bug now or not I don\u0027t care. I just built it bigger.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was a fuel bug in the way fuel crossfeed worked with fuel lines and lateral fuel tanks. So you\u0027ve been hit with that as well.\u003C/p\u003E\n"}]}