{"TopicId":199498,"ForumId":20,"TopicTitle":"Delta V \u0026quot;Green light\u0026quot; mod.","CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2021-01-11T02:35:42Z","PageNum":1,"Articles":[{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2021-01-11T02:35:42Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure how to mod, but I\u0027d like to look into making this mod, or a mod for someone else to pick up, and wondering if anyone would use it.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would be aimed more for the beginner/intermediate players, who don\u0027t quite understand Delta V yet, or do, but keep forgetting how much delta V they need to get from point A to point B. It takes the approximation of Delta V required to get from point A to point B, and checks it against your ships current Delta V. It\u0027s really that simple. It would allow for a good approximation \u0022we should be able to get there\u0022. So long as you\u0027re not doing horribly bad burns, or wasting Delta V you should be able to do it if you got a green light.\n\u003C/p\u003E\n\u003Cp\u003E\nHow it would work:\n\u003C/p\u003E\n\u003Cp\u003E\nIf you click the little \u0022Green Light\u0022 Button on the toolbar, it\u0027ll bring up a screen which has all the planets and moons, with little lights on them.\n\u003C/p\u003E\n\u003Cp\u003E\nGreen = You can get there and back to kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nYellow = You can get there, but not enough to get back to kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nRed = You cannot get there at all.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can also click \u0022Choose Destination\u0022 and it\u0027ll tell you how much delta V you have left over (and how much extra you need if you want to get back to kerbin).\n\u003C/p\u003E\n\u003Cp\u003E\nSo say you want to get to the Mun as a new player,  you built a ship and see that it has a yellow light. Clicking Mun as destination, will calculate the Delta V for you, and tell you how much short of Delta V you are, as well as give you a break down of how much Delta V is required for each stage. (Example: It takes x delta V to get from mun orbit to surface, etc.) So they can try to balance their craft correctly as well.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is of course prone to error still, but that\u0027s all about learning process. The mod would essentially take the Delta V from the Delta V charts you can look up online already, and puts them into a nice and easy to use calculator in-game, where it simply checks the Delta V to the ship.\n\u003C/p\u003E\n\u003Cp\u003E\n--------------\n\u003C/p\u003E\n\u003Cp\u003E\nThis could be used in mid flight as well. Perhaps you\u0027re playing with resource extractions, you were able to extract and collect some fuel, and see you have enough now to get to another Mun and back to Kerbin still.\n\u003C/p\u003E\n\u003Cp\u003E\nOr perhaps you play with failures, such as with kerbalism. One of your engines failed mid flight. Your new Delta V would be calculated by this calculator, letting you know if you still have enough Delta V to get back to Kerbin, or to your destination and back.\n\u003C/p\u003E\n\u003Cp\u003E\nThere would be other options as well, all of which simply remove delta V requirements.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing the failure above. Say I lost an engine and I\u0027m on the way to the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nI pull up the Green Light mod.\n\u003C/p\u003E\n\u003Cp\u003E\nClick \u0022Calculate new Delta V\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n-\u0026gt; Destination Mun, and click \u0022In Space\u0022 button. This removes the delta V from the calculations for lift off, and getting into and out of orbit of Kerbin. It knows you\u0027re already in space on the way to the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom there there would be extra choices for the Mun. Such as Pass By, Orbit, or Land. In this case I want to see what my options are, so I click \u0022Orbit\u0022 and it still shows a Yellow Light. This means I don\u0027t have enough delta V to even make orbit and get back. I choose Pass By, and see a Green light. So I know I can at least pass by it\n\u003C/p\u003E\n\u003Cp\u003E\n-------------------\n\u003C/p\u003E\n\u003Cp\u003E\nOf course this is still prone to error, and being wrong, but that\u0027s part of KSP, and I feel like it would kind of play into the role of a Kerbal Computer. It\u0027s not perfect, but it at least lets you know basically what\u0027s possible.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2021-01-11T19:35:39Z","Content":"\n\u003Cp\u003E\nThere\u0027s a big, big problem with this...\n\u003C/p\u003E\n\u003Cp\u003E\nKSPs own \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E calculations bork from time to time (the one displayed to the user). So for instance I\u0027ve had 3 stage rockets with a 2nd stage with ~2600 \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E that wasn\u0027t ever displayed or calculated until I staged, enabled the engine and throttled up.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s only one issue\n\u003C/p\u003E\n\u003Cp\u003E\nSecond is if you ever looked at a \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E chart, all of them always assume a optimal transfer. For some targets, the difference between a optimal and a suboptimal transfer is narrow.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then there\u0027s the human elements, doing your gravity turn late? You can easily waste 2K \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E right there, what if you need to rendezvous with a command module apollo style? Easily can burn another 1K with poor maneuvering there.\n\u003C/p\u003E\n\u003Cp\u003E\nSo while it\u0027s still something that is far from impossible, you would probably want a slider to allow the player to set a safety margin. \n\u003C/p\u003E\n\u003Cp\u003E\nThis is just a percentage of the total \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E it won\u0027t take into account, so at 30% it will act as if you had only 70% of your fuel for the calculations. Allowing you to adjust accordingly.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I\u0027d just say that a basic table of the \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E required for various destinations somewhere easily accessible in game is sufficient. Once you get into the habit of doing interplanetary trips, you commit the numbers to memory fairly quickly. And then you get a idea of what your individual safety margin is.\n\u003C/p\u003E\n"},{"CreatedByName":"Ravlain","CreatedById":201257,"CreatedDateTime":"2021-01-12T18:58:57Z","Content":"\n\u003Cp\u003E\nI think you\u0027re looking for this \u003Cspan\u003E:-  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/187712-18x-where-can-i-go-the-opposite-of-a-problem-21-30012020/\u0022 rel=\u0022\u0022\u003EWhere can I go\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2021-01-13T07:03:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223907772\u0022 data-ipsquote-contentid=\u0022199498\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221610477937\u0022 data-ipsquote-userid=\u0022201257\u0022 data-ipsquote-username=\u0022Ravlain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Ravlain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you\u0027re looking for this \u003Cspan\u003E:-  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/187712-18x-where-can-i-go-the-opposite-of-a-problem-21-30012020/\u0022 rel=\u0022\u0022\u003EWhere can I go\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAyy that\u0027s actually pretty nifty\n\u003C/p\u003E\n\u003Cp\u003E\nAnd it addresses most of my critiques. Have a thumbs up.\n\u003C/p\u003E\n"}]}