{"TopicId":199502,"ForumId":25,"TopicTitle":"The KSP Caveman Challenge 1.11.x - 1.12.x","CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2021-01-11T05:15:48Z","PageNum":23,"Articles":[{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-01-15T18:48:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224075235\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221641763202\u0022 data-ipsquote-userid=\u0022132901\u0022 data-ipsquote-username=\u0022JAFO\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/9/2022 at 1:20 PM, JAFO said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy apologies to everyone for my long absence. Details later. Suffice to say my free time is short these days, and has been for months.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReal life is far more important than KSP.  You do what you gotta do to be happy and right.\n\u003C/p\u003E\n\u003Cp\u003E\nWith that said, I grabbed the badge fir completing the challenge on normal.  But I would like verification to be official when you have time.\n\u003C/p\u003E\n"},{"CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2022-01-15T19:31:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224077678\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642272512\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut I would like verification to be official when you have time.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWill do! \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2022-02-08T17:05:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224077622\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642263509\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/15/2022 at 11:18 AM, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThen I\u0027m going to only run testing in the kerbin system. I\u0027m not sure what the spirit of the challenge is anymore, but I am limiting myself to tests that I can run at home, because those I could do within the career at just the cost of more time and patience. I started testing the tylo lander on kerbin (mostly to check if the modular structure made on multiple weak small docking ports could survive some shacking and the impact with the ground without tearing itself apart), and I will test the Laythe lander on Kerbin too.\n\u003C/p\u003E\n\u003Cp\u003E\nI am using the sandbox mode to test them, because they are modular with high part number and it would take a lot of launches and assembly to run the testing in caveman.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe spirit of the challange is basically, why are you running your tests in another file when you could be testing (or actually flying and reverting) in the caveman file itself? Whatever the second file offers, that\u0027s the problem.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-08T19:36:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224088875\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644339916\u0022 data-ipsquote-userid=\u0022101988\u0022 data-ipsquote-username=\u0022Rakaydos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Rakaydos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe spirit of the challange is basically, why are you running your tests in another file when you could be testing (or actually flying and reverting) in the caveman file itself?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nbecause my difficulty level does not allow save/reload, or revert flying.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd there\u0027s really nothing in my testing way that I couldn\u0027t have done in the actual career. but grinding up some  money at 10% reward, building a probe, launching it, and testing - for example - how it reenters from high speed, is a lot more time consuming than using alt-f12 to move it in place. so, testing somewhere else is basically just an excuse to be able to use cheat menu and revert flights, which is just a way to save time over having to move the crafts in testing position and paying for them every time.\n\u003C/p\u003E\n\u003Cp\u003E\nwhich is why i decided to not test stuff around jool\n\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2022-02-08T19:49:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224088933\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644349011\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E...testing somewhere else is basically just an excuse to be able to use cheat menu and revert flights, which is just a way to save time over having to move the crafts in testing position and paying for them every time.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly. This is what \u0022against the spirit\u0022 of the challange means. \n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-08T22:32:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224088940\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644349746\u0022 data-ipsquote-userid=\u0022101988\u0022 data-ipsquote-username=\u0022Rakaydos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Rakaydos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExactly. This is what \u0022against the spirit\u0022 of the challange means. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthere\u0027s still an enormous difference between \u0022i\u0027ll try this thing 10 times, keep reloading until I get it right\u0022 and \u0022I\u0027ll try this thing 10 times and see if I can manage it reliably/figure out something that works, and then I\u0027ll do it for real\u0022. Especially when you have an unmanned craft and you only risk losing some time.\n\u003C/p\u003E\n\u003Cp\u003E\nmore important, i tend to take for granted that the purpose of a challenge is to push designs and limits, and testing is a fundamental part of it. it was hard for me already to start thinking along the lines of \u0022can\u0027t make risky manuevers because i must be able to pull them off 100% the first time\u0022. Like, not doing the suicide burn at the last possible second to save every last drop of fuel? that goes against everything I\u0027ve done in the past year.  Not even running tests? I guess it\u0027s such an alien concept to me, I can\u0027t conceive the idea unless it\u0027s very clearly and explicitly written. to me, testing is fundamentally in the spirit of any challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m so used to the concept that testing is fundamental and natural that I didn\u0027t ever think that the rules could be read otherwise. I was like \u0022yeah, nothing I do in the test sandbox is affecting the career in any way, so of course it can\u0027t be against the rules - after all, nobody would ever think to forbid testing, or to consider it unfair.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI only learned that there were different opinions when reading someone else\u0027s mission report.\n\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2022-02-10T12:02:26Z","Content":"\n\u003Cp\u003E\nReloading 10 times is allowed if you choose that difficulty, but passing a \u0022reload 10 times in another file, then do it for real\u0022 as a \u0022no reload\u0022 file is false advertising. Part of being a caveman is not having simulators.\n\u003C/p\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2022-02-10T12:35:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089033\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644359543\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/9/2022 at 12:32 AM, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m so used to the concept that testing is fundamental and natural that I didn\u0027t ever think that the rules could be read otherwise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI completed my NCD run without external savegames, you can do it too! \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTrust me it really adds a lot to the gameplay when every launch starts with you nervously tapping spacebar, not knowing if the launch will go according to plan. Sure I tried testing what I can, making a capsule do an unmanned launch here and there before putting kerbals in it. I actually preferred sticking with the older less efficient designs, just because they were well tested by then.\n\u003C/p\u003E\n\u003Cp\u003E\nI had a magazine-type fuel tank system on my Mun lander. Only when i got to \u003Cs\u003Erefueling\u003C/s\u003E reloading the fuel tank, I realized it is really difficult to do docking with the setup i designed...so i learned how to do it by kerbal-hand in EVA to make it work, something I would have never spent time learning. The same goes for many other situations, things you only discover when there are no shortcuts.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-10T14:35:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089786\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644494546\u0022 data-ipsquote-userid=\u0022101988\u0022 data-ipsquote-username=\u0022Rakaydos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Rakaydos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nReloading 10 times is allowed if you choose that difficulty, but passing a \u0022reload 10 times in another file, then do it for real\u0022 as a \u0022no reload\u0022 file is false advertising. Part of being a caveman is not having simulators.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cem\u003ENo reload\u003C/em\u003E is one thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENo simulators\u003C/em\u003E is an entirely different thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENo simulators except what you could conceivably do in the game\u003C/em\u003E is yet something different.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENo reload\u003C/em\u003E means that you have to accept what happens. you made a blunder and killed your astronaut? too bad, you have to hire another. your mun lander exploded during atmospheric reentry? you have to start back from the launchpad. you can\u0027t point your ship towards minmus and ignite and hope to get there - well, you can, but you\u0027ve got to have a B plan in case you miss. you can\u0027t find the proper periapsis for aerobraking by trial and error.\n\u003C/p\u003E\n\u003Cp\u003E\nNo reload forces a different style of gaming. You can\u0027t launch contrived contraptions that explode 9 times out of 10. you can\u0027t make suicide burns at the last second to save fuel. you have to keep more safety margins. more fuel for every manuever. no daredevil ideas. Always a contingency plan, always an eye for safety. I\u0027m dealing with all that, so passing \u0022simulating\u0022 as \u0022reloading\u0022 is a false equivalence.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen there\u0027s \u0022\u003Cem\u003Eno simulators\u003C/em\u003E\u0022. I am making a Mun lander and want to see how it performs, i have to go to mun. Build the whole ship, go there. Do notice that there\u0027s no such thing as \u0022no simulation\u0022, because every time you launch a probe and it explodes, or every time you launch a manned rocket and it flips and you eject the manned module with the parachute to save the crew, that\u0027s basically a simulation. you were trying to launch, but you instead got a failure that taught you how to improve the design, which is basically what a simulation is. However, every time one of your rockets explodes, you have to pay the cost for it. And if you try a mun landing, you must send your rocket to mun every time. And if it\u0027s your first Mun landing, well, you can\u0027t really simulate it; if you simulate successfully, then you\u0027ve landed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe effect on gameplay is that it encourages the use of reliable, time-tested designs over more experimental ones.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENo simulators except what you could conceivably do in the game\u003C/em\u003E is a special subset of simulation. It starts from the fact that you can, indeed, test your stuff - as long as you are willing to let your rocket explode every time. So, you can test your Mun lander probe. You just have to launch the rocket, go to Mun, release the lander, see it explode; then you pick up a few more \u0022science from X\u0022 and \u0022survey\u0022 contracts to make easy money, you build a new rocket, you send it to Mun again, release the new improved lander, see if it works. No risk involved, only time. So running a simulation of that does not give you any unfair advantage you\u0027d have in a \u003Cem\u003Eno simulation\u003C/em\u003E challenge. It merely saves time of farming money and building a new rocket every time. By that metric, you can\u0027t do any test that would endanger a kerbal, and you can\u0027t do testing in places you\u0027ve not reached already.\n\u003C/p\u003E\n\u003Cp\u003E\nI am playing under this concept, and I\u0027m facing a lot of additional limitations. I can\u0027t test my tylo and laythe landers on their target bodies, and as a result I have no idea how my laythe rocket will perform under laythe aerodinamics. I\u0027ve been forced to make a design twice as heavy, with 4 km/s deltaV to stay safe - and I\u0027m still not 100% sure it will work. I can\u0027t test what would be the ideal altitude to start the suicide burn on tylo, and as a result I had to make - again - a heavier design to add a lot of extra deltaV. I am taking a lot of extra problems and limitations because I\u0027m only running unmanned tests around kerbin, so, again, it\u0027s a false equivalence to treat all simulations equally.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMind you,\u003Cstrong\u003E I am not saying you are wrong on the \u0022spirit of the challenge\u0022\u003C/strong\u003E. You say that part of being a caveman is not having simulators, I can accept that.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you can\u0027t say that reloading and simulating are the same thing, because they are completely different mechanisms that have very different consequences in how you approach the game. And I must point out that \u003Cstrong\u003Ethe rules of the challenge don\u0027t say \u0022no simulations\u0022\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore it is perfectly reasonable, for someone looking for a hard challenge, to read the first post, think \u0022ok, here it says I have to play with this difficulty settings, which include no reloading. But simulating is something else, and of course it would be allowed\u0022. A lot of those rules are kinda vague, and could use some clarifications. Is it so rare for others who took the caveman challenge to draw this conclusion?\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I do believe that the purpose of a challenge - any challenge - is to push the player to get creative, while forbidding simulations pushes to only use stuff you already know, it pushes against creativity, and therefore a challenge without simulations makes little sense. Though I\u0027m gradually coming to accept that eschewing weird experiments, when coupled with other constraints, is a challenge of its own.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2022-02-10T14:39:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089839\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644503724\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd I must point out that \u003Cstrong\u003Ethe rules of the challenge don\u0027t say \u0022no simulations\u0022\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore it is perfectly reasonable, for someone looking for a hard challenge, to read the first post, think \u0022ok, here it says I have to play with this difficulty settings, which include no reloading. But simulating is something else, and of course it would be allowed\u0022. A lot of those rules are kinda vague, and could use some clarifications. Is it so rare for others who took the caveman challenge to draw this conclusion?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat does Simulating actually mean? Because as you asked about, there\u0027s a specific rule against using other games with more information to inform your designs. So there IS a rule against simulations.\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-02-10T15:49:32Z","Content":"\n\u003Cp\u003E\nI think the big thing here, especially with the NCD version of this challenge, is funds in the early game.  On NCD, you have to take contracts well before you get to completing them just to get enough funds to do the first few basic science farming runs and launches.  Using a simulator or reloads or other games to test designs is a massive advantage in that you aren\u0027t wasting funds that you so desperately need for the challenge.  In this case, it isn\u0027t simply about testing if the lander works or if the trajectory is correct, but rather \u0022How can I maximize the craft and still have funds left over\u0022.  That is certainly not in the spirit of the challenge.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-10T15:56:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089844\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644503982\u0022 data-ipsquote-userid=\u0022101988\u0022 data-ipsquote-username=\u0022Rakaydos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Rakaydos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat does Simulating actually mean? Because as you asked about, there\u0027s a specific rule against using other games with more information to inform your designs. So there IS a rule against simulations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthat rule about more information specifically mentioned mods - and I was kinda puzzled about the meaning of it in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, I went and asked about it (there\u0027s some posts about it in page 22). You may also notice,\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/199502-the-ksp-caveman-challenge-111x-112x/\u0026amp;do=findComment\u0026amp;comment=4070701\u0022 rel=\u0022\u0022\u003E in this post\u003C/a\u003E, how I was extremely surprised by the notion that simulating may be against the challenge, as it\u0027s something I always consider implicitly to be the proper way to go. And the answers I got mentioned mods, which led me to think that only the use of mods was the problem.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089873\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644508172\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think the big thing here, especially with the NCD version of this challenge, is funds in the early game.  On NCD, you have to take contracts well before you get to completing them just to get enough funds to do the first few basic science farming runs and launches.  Using a simulator or reloads or other games to test designs is a massive advantage in that you aren\u0027t wasting funds that you so desperately need for the challenge.  In this case, it isn\u0027t simply about testing if the lander works or if the trajectory is correct, but rather \u0022How can I maximize the craft and still have funds left over\u0022. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI disagree. Getting funds early game was boring, but not hard. Some contracts to test parts on the launchpad, some to run surveys on the ground. As soon as I launched the first orbital rocket, world first got me enough money to last for a while, and then science from X and more ground surveys did the trick**. Nothing i ever did there required testing. The major difficulty to me was the first unmanned landing on mun, which I achieved with a probe with no attitude control. And going for that was actually unnecessary. And I posted that part on december30, before having any inkling that the rules may be interpreted different from what I thought.\n\u003C/p\u003E\n\u003Cp\u003E\nHad I lost too many probes on Mun, worst case scenario I could have fulfilled the terrier test contract, gained some more money by easy surveys, and then take another test terrier contract to launch more probes.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I\u0027d say I didn\u0027t get any undue advantage.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n** \u003Cem\u003EIn my first try, I did try to get a more difficult contract for more money, and it resulted in jeb killed. I was still one hour into the career, two at most, so I just restarted it from scratch, and I learned to avoid those kind of contracts. it\u0027s mentioned in the mission report.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat is certainly not in the spirit of the challenge.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI already said I can agree in principle; I am merely arguing that it is not unreasonable to think otherwise based solely on the rules.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-02-10T16:10:45Z\u0022 title=\u002202/10/2022 04:10  PM\u0022 data-short=\u00222 yr\u0022\u003EFebruary 10, 2022\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-02-10T16:03:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089877\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644508583\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthat rule about more information specifically mentioned mods - and I was kinda puzzled about the meaning of it in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, I went and asked about it (there\u0027s some posts about it in page 22). You may also notice,\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/199502-the-ksp-caveman-challenge-111x-112x/\u0026amp;do=findComment\u0026amp;comment=4070701\u0022 rel=\u0022\u0022\u003E in this post\u003C/a\u003E, how I was extremely surprised by the notion that simulating may be against the challenge, as it\u0027s something I always consider implicitly to be the proper way to go. And the answers I got mentioned mods, which led me to think that only the use of mods was the problem.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat is really interesting is that, if you go back and look at the history of the challenge, MechJeb was actually ALLOWED at one point.  So at one point, not only were mods not disallowed, but the biggest one of them all (ok, so \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E might be #1, let\u0027s not split hairs on that) was allowed to be used in a challege where technology was against the rules.  By disallowing MechJeb, it was implied that you shouldn\u0027t be using it to test things out in another game and then using those results in your career save for this challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that then presents the problem of things you would know anyway and apply them to the challenge.  Like, you already know how to fly a rocket, and you know what happens when you do x, or y, or 123, right?  So the question becomes \u0022How is testing any different than gaining knowledge in another game and applying it here\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-10T16:13:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089882\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644509002\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat is really interesting is that, if you go back and look at the history of the challenge, MechJeb was actually ALLOWED at one point.  So at one point, not only were mods not disallowed, but the biggest one of them all (ok, so \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u003C/abbr\u003E might be #1, let\u0027s not split hairs on that) was allowed to be used in a challege where technology was against the rules.  By disallowing MechJeb, it was implied that you shouldn\u0027t be using it to test things out in another game and then using those results in your career save for this challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that then presents the problem of things you would know anyway and apply them to the challenge.  Like, you already know how to fly a rocket, and you know what happens when you do x, or y, or 123, right?  So the question becomes \u0022How is testing any different than gaining knowledge in another game and applying it here\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, that was part of what left me confused. what\u0027s the split between knowledge gained in other games that\u0027s allowed, and knowledge gained in other games that\u0027s not allowed.\n\u003C/p\u003E\n\u003Cp\u003E\nbtw, in case you didn\u0027t notice, i answered your previous post as edit in my previous post - because i wasn\u0027t expecting a reply so soon\n\u003C/p\u003E\n"},{"CreatedByName":"Mr. Peabody","CreatedById":173591,"CreatedDateTime":"2022-02-22T22:05:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224089882\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644509002\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/10/2022 at 11:03 AM, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat is really interesting is that, if you go back and look at the history of the challenge, MechJeb was actually ALLOWED at one point.  So at one point, not only were mods not disallowed, but the biggest one of them all (ok, so \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u003C/abbr\u003E might be #1, let\u0027s not split hairs on that) was allowed to be used in a challege where technology was against the rules.  By disallowing MechJeb, it was implied that you shouldn\u0027t be using it to test things out in another game and then using those results in your career save for this challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that then presents the problem of things you would know anyway and apply them to the challenge.  Like, you already know how to fly a rocket, and you know what happens when you do x, or y, or 123, right?  So the question becomes \u0022How is testing any different than gaining knowledge in another game and applying it here\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe thing is that we now have D/V data during \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E assembly, a feature that wasn\u0027t available for early challenge participants. Therefore, since charts and other aids are allowed, it shouldn\u0027t really be necessary to test crafts in other games. Ideally, a new challenge participant should work their way up the difficulty levels from easy to hard, thereby gaining experience in a more forgiving environment about what works and what doesn\u0027t. It was never intended for new participants to attempt the hardest difficulty right off the bat, but that\u0027s what is happening in far too many new attempts. Does this behavior merit a rule change in order to make harder difficulties more doable for new participants? Thoughts anyone?\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-02-22T23:16:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224095319\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645567508\u0022 data-ipsquote-userid=\u0022173591\u0022 data-ipsquote-username=\u0022Mr. Peabody\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Mr. Peabody said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe thing is that we now have D/V data during \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E assembly, a feature that wasn\u0027t available for early challenge participants. Therefore, since charts and other aids are allowed, it shouldn\u0027t really be necessary to test crafts in other games. Ideally, a new challenge participant should work their way up the difficulty levels from easy to hard, thereby gaining experience in a more forgiving environment about what works and what doesn\u0027t. It was never intended for new participants to attempt the hardest difficulty right off the bat, but that\u0027s what is happening in far too many new attempts. Does this behavior merit a rule change in order to make harder difficulties more doable for new participants? Thoughts anyone?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s an interesting conundrum, to be sure.  As I mentioned in my original post, we get into splitting hairs about what one would know from playing the game vs. what one would know from extensive testing.  It\u0027s one thing to know that a particular craft you\u0027ve built in other career saves will be able to do x, but entirely different to build and rebuild and rebuild in several different ways to find out how to push the limit of what it can do just so you can complete a challenge and earn that coveted badge.  Where does the line get drawn?  What separates the two?  If someone knows, then they are smarter than I am.\n\u003C/p\u003E\n\u003Cp\u003E\nTo your question, I\u0027m not sure there is a real solution here, other than \u0022Don\u0027t Ask/Don\u0027t Tell\u0022.  I mean, this whole thing wouldn\u0027t have come up if the original poster hadn\u0027t explicitly come out and stated what they were doing.  Had he not said anything, nobody would have asked if he was testing outside the Caveman career he had going on for the NCD difficulty.  But, if you are looking for an honest, let\u0027s-try-this-and-see-what-happens solution...\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps make it a rule that, in order to try any difficulty harder than Normal, you must complete the easier difficulties in order?  For example, if you want to do Moderate, you have to do Normal first.  You want to do NCD, then you have to complete Apatite, Vandadium, Topaz, Corundum, and Diamond - in that order - before attempting and submitting NCD?  I don\u0027t know if it\u0027s a good idea, but it\u0027s the one I have.\n\u003C/p\u003E\n"},{"CreatedByName":"Mr. Peabody","CreatedById":173591,"CreatedDateTime":"2022-02-23T21:37:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224095356\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645571789\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPerhaps make it a rule that, in order to try any difficulty harder than Normal, you must complete the easier difficulties in order?  For example, if you want to do Moderate, you have to do Normal first.  You want to do NCD, then you have to complete Apatite, Vandadium, Topaz, Corundum, and Diamond - in that order - before attempting and submitting NCD?  I don\u0027t know if it\u0027s a good idea, but it\u0027s the one I have.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut will people prefer to avoid the challenge altogether if they need to start at normal difficulty and work their way up? When I moderated very few new participants wanted to start with normal or intermediate difficulties.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-23T21:44:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224095319\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645567508\u0022 data-ipsquote-userid=\u0022173591\u0022 data-ipsquote-username=\u0022Mr. Peabody\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, Mr. Peabody said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n Ideally, a new challenge participant should work their way up the difficulty levels from easy to hard, thereby gaining experience in a more forgiving environment about what works and what doesn\u0027t. It was never intended for new participants to attempt the hardest difficulty right off the bat, but that\u0027s what is happening in far too many new attempts. Does this behavior merit a rule change in order to make harder difficulties more doable for new participants? Thoughts anyone?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo I am not supposed to make a new career, use the cheat menu and revert launches to test stuff, and then import the stuff that works into the ncd career...\n\u003C/p\u003E\n\u003Cp\u003E\nbut I am instead supposed to make a new career with saves allowed, launch and revert and save scum as I will to test stuff, and then start the ncd career and import in it the stuff that worked...\n\u003C/p\u003E\n\u003Cp\u003E\nI fail to see how it\u0027s different in any meaningful way \u003Cimg alt=\u0022:ph34r:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ph34r.png\u0022 title=\u0022:ph34r:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJust like I fail to see how \u0022gaining experience in a more forgiving environment\u0022 differs from \u0022testing\u0022. It\u0027s just a matter of semantics.\n\u003C/p\u003E\n\u003Cp\u003E\nI still think that forbidding testing is impossible and undesirable. You yourself basically agree that people are supposed to test stuff in a separate save. At this point it just becomes an arbitrary distinction on what kind of testing environment is allowed and what is not. I am fine either way - I realize I don\u0027t have the proper mindset to judge this matter - but I do think that, if there are such rules, they should be clarified in detail and written in the front page. \u0022no mods and cheat menu in other games\u0022 is too vague and everyone can interpret it differently.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, i finished my entry:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022204876\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed9915850744\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/206163-stars-to-stones-my-nanocristalline-diamond-caveman-attempt/\u0026amp;do=embed\u0026amp;comment=4095876\u0026amp;embedComment=4095876\u0026amp;embedDo=findComment\u0022 style=\u0022height:264px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nthe planned Jool 5 became a Jool 2 and a half after the Tylo lander failed for weird reasons. Still got more than enough science back to Kerbin, though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-02-23T21:48:55Z\u0022 title=\u002202/23/2022 09:48  PM\u0022 data-short=\u00222 yr\u0022\u003EFebruary 23, 2022\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-02-23T22:37:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224095906\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645652240\u0022 data-ipsquote-userid=\u0022173591\u0022 data-ipsquote-username=\u0022Mr. Peabody\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n57 minutes ago, Mr. Peabody said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut will people prefer to avoid the challenge altogether if they need to start at normal difficulty and work their way up? When I moderated very few new participants wanted to start with normal or intermediate difficulties.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I did say that it probably wasn\u0027t a good idea.\n\u003C/p\u003E\n\u003Cp\u003E\nSee, for me, the stuff I really want to use MechJeb for...you can\u0027t in the Caveman challenge.  You can\u0027t create maneuver nodes, use docking autopilot, use ascent guidance, transfer to the Mun/Minmus/other planets...none of it is usable because you don\u0027t have any of the buildings upgraded.  The only thing \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E is useful for in the Caveman challenge is orbital information, especially time to \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E.  There is some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E information you can get in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with it, but I\u0027m not sure it\u0027s any different than what you can get out of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E without it.  I mean, I was able to complete my Normal Caveman without it, so it\u0027s not entirely needed to do it.  But until you upgrade the buildings?  You can\u0027t really use most of what it\u0027s designed to do.\n\u003C/p\u003E\n"},{"CreatedByName":"Mr. Peabody","CreatedById":173591,"CreatedDateTime":"2022-02-24T20:35:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224095907\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645652698\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo I am not supposed to make a new career, use the cheat menu and revert launches to test stuff, and then import the stuff that works into the ncd career...\n\u003C/p\u003E\n\u003Cp\u003E\nbut I am instead supposed to make a new career with saves allowed, launch and revert and save scum as I will to test stuff, and then start the ncd career and import in it the stuff that worked...\n\u003C/p\u003E\n\u003Cp\u003E\nI fail to see how it\u0027s different in any meaningful way \u003Cimg alt=\u0022:ph34r:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ph34r.png\u0022 title=\u0022:ph34r:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhoa mate! I\u0027m not taking sides. Talk to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022132901\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0022 rel=\u0022\u0022\u003E@JAFO\u003C/a\u003E if you want the rules changed.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-02-24T21:12:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224096492\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645734955\u0022 data-ipsquote-userid=\u0022173591\u0022 data-ipsquote-username=\u0022Mr. Peabody\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, Mr. Peabody said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhoa mate! I\u0027m not taking sides. Talk to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022132901\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0022 rel=\u0022\u0022\u003E@JAFO\u003C/a\u003E if you want the rules changed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nsorry, i don\u0027t mean to be oppositive. but I am arguing for what I see as logical fallacies.\n\u003C/p\u003E\n\u003Cp\u003E\nas for changing the rules, i\u0027ve already stated i don\u0027t want them necessarily changed, merely clarified.\n\u003C/p\u003E\n\u003Cp\u003E\nas for talking to jafo, by posting in this thread i believe i\u0027m doing exactly that\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2022-02-24T23:30:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224096492\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645734955\u0022 data-ipsquote-userid=\u0022173591\u0022 data-ipsquote-username=\u0022Mr. Peabody\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mr. Peabody said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhoa mate! I\u0027m not taking sides. Talk to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022132901\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/132901-jafo/\u0022 rel=\u0022\u0022\u003E@JAFO\u003C/a\u003E if you want the rules changed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHe hasn\u0027t logged on to the site in almost a month now, so talking to him may not actually happen.  Possible that someone else may need to take over the challenge?\n\u003C/p\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2022-02-26T11:40:15Z","Content":"\n\u003Cp\u003E\nJust checking in....Played KSP a bit more too, after having moved on and a bunch of other games, then remembering KSP2 might be coming soon.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally for me, and I hope my caveman status adds a little relevance:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Having to do the levels in sequence has merits but on balance isn\u0027t a great idea since it would simply be too boring. The harder levels (especially NCD) are pretty grindy as-is.\n\u003C/p\u003E\n\u003Cp\u003E\n2. It is not possible to differentiate between \u0022I just happen to have a bunch of experience from playing KSP in previous saves\u0022 and \u0022I am running a \u0022test save\u0022 alongside my Caveman attempt. If anything, its a disadvantage because it shows you\u0027re pretty green to it. IF NO DATA TRANSFER were done, eg not opening craft files of a different save, instead stuff were \u0027transferred\u0027 from your own memory or paper notes alongside playing the game, fair enough.\n\u003C/p\u003E\n\u003Cp\u003E\n3. As I recall, you need to do many flights within NCD anyway, to build up the cash. I think this means anyone would inevitably be using the Caveman save to do \u0022testing\u0022 (as in, other flights with useful info/data). Other info/data/knowledge outside of these are likely to be quirks with spaceflight, or more accurately, KSP\u0027s gameplay implementation of it. Outside testing to find these out is fair enough.\n\u003C/p\u003E\n\u003Cp\u003E\nTLDR: If there\u0027s no data/file transfers going on, then a \u0022test save\u0022 is fine in my eyes.\n\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2022-02-28T12:10:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224097048\u0022 data-ipsquote-contentid=\u0022199502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221645875615\u0022 data-ipsquote-userid=\u0022208135\u0022 data-ipsquote-username=\u0022paul_c\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/26/2022 at 6:40 AM, paul_c said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTLDR: If there\u0027s no data/file transfers going on, then a \u0022test save\u0022 is fine in my eyes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nClarification... No data or file transfer, into, or out of, the Caveman file, on any difficulty that disallows saving.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-11-25T20:19:02Z","Content":"\n\u003Cp\u003E\nis this challenge even active anymore? i completed my nanodiamond over 6 months ago, but I never got an acknowledgement\n\u003C/p\u003E\n"}]}