{"TopicId":199535,"ForumId":51,"TopicTitle":"The Princess of the Dunaverse - The Mission Logs of Raner Kerman","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-12T05:50:22Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-12T05:50:22Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_title.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_title.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n On \u003Cstrong\u003EKSD 1228.0\u003C/strong\u003E, the crew of the two-year Duna exploration mission Dunaverse was sent into orbit, officially beginning the first interplanetary habitation experiment of Kerbalkind.  The mission was ultimately deemed a success, but it was not without incident.  Upon their return, the crew of the Dunaverse was debriefed and their personal logs for the mission were reviewed.  In light of the events that transpired during the mission, particular attention was paid to the logs of Raner Kerman, an engineer who had been a late addition to the crew.  What follows are her relevant mission logs, the strange discoveries that they document, and the unexpected late-mission event that heavily altered the future of Kerbal space exploration and even the course of Kerbal society itself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMission Roster\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ECaptain Jebediah Kerman\u003C/em\u003E (51) - Owner of Jeb\u0027s Junkyard, founding member of KSP.\u003Cbr\u003E\u003Cem\u003ECommander Valentina Kerman\u003C/em\u003E (48) - Chairwoman of Escape Velocity, founding member of KSP.\u003Cbr\u003E\u003Cem\u003EChief Engineer Bill Kerman\u003C/em\u003E (42) - Member of of STEADLER board of directors, founding member of KSP.\u003Cbr\u003E\u003Cem\u003EChief Science Officer Bob Kerman\u003C/em\u003E (46) - Founding member of Kerbin World-Firsts Record-Keeping Society, founding member of KSP.\u003Cbr\u003E\u003Cem\u003EEngineer Karman Kerman\u003C/em\u003E (31) - StrutCo senior engineer, last name not given.  Rescued from orbit by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E staff.\u003Cbr\u003E\u003Cem\u003EEngineer Raner Kerman\u003C/em\u003E (30) - Periapsis senior engineer, last name Wellier.  Rescued from orbit by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E staff.\u003Cbr\u003E\u003Cem\u003EJunior Science Officer Jonbert Kerman\u003C/em\u003E (26) - Devathorian defector, last name Metzli.  Rescued from orbit by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E staff.\u003Cbr\u003E\u003Cem\u003EJunior Engineer Pholie Kerman\u003C/em\u003E (19) - Self-taught rocketry enthusiast, last name unknown.  Rescued from orbit by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E staff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe log entries of Raner Kerman begin here.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1191.4\u003C/strong\u003E \u003Cem\u003E(Eelooday, Unember 12th 1895)\u003C/em\u003E\u003Cbr\u003E\nHigh Kerbin Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n This was my first New Year celebrated so far away from home.  Over the last few weeks I\u0027ve been further from home than I\u0027ve ever been in my entire life, in fact.  And it\u0027s looking like next year\u0027s celebrations are going to be taking place much further away still.\n\u003C/p\u003E\n\u003Cp\u003E\n In two days, my training mission will conclude and I will be standing on the surface of Kerbin again.  It\u0027s been a long month and a half, all alone out here.  I\u0027ve done a solar flyby, a Mun landing, and a Minmus landing.  I\u0027ve had a lot of time to think, and I\u0027ve decided that I am going to take the Dunaverse posting after all.  This training mission was a great example of not only what can go wrong, but also why it won\u0027t be catastrophic if things do go wrong.\n\u003C/p\u003E\n\u003Cp\u003E\n This mission was originally going to have me go directly to Minmus after my solar jaunt, but poor timing put my return in exactly the wrong place.  Mission control\u0027s instructions were to aim for the Mun instead, land there, then go on to Minmus, as a launch window to Minmus would be very easy to obtain from Munar orbit.  Ultimately it extended my mission by a full 20 days, but the end result is hard to argue.  My life support remains almost half full; they were fully prepared for an even more catastrophic mission result.  I have ample fuel left too; I could easily land my drive stage on Kerbin if I wanted.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dunaverse_blueprint.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.67\u0022 height=\u00221050\u0022 width=\u00221171\u0022 src=\u0022http://www.skyrender.net/dunaverse_blueprint.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n I reviewed the plans for the Dunaverse mission over the extra days I had available to me (apparently they\u0027re still making last-minute additions, these blueprints were out of date by the time I got them!), and I am certain more than ever that it will be successful.  We\u0027re being sent out with extensive life support, production facilities for \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E on Ike if needed, a full-scale comms network, and probably the single most overbuilt lander I\u0027ve ever set eyes on.  In total there are 127 contingency plans in place, which is unprecedented for any Kerbal space mission; usually they top out at 15 planned contingencies.  Dunaverse is scheduled for launch in one month, so I had better prepare while I can.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1228.0\u003C/strong\u003E \u003Cem\u003E(Dunaday, Duember 13th 1895)\u003C/em\u003E\u003Cbr\u003E\nKerbal Space Center\n\u003C/p\u003E\n\u003Cp\u003E\n My birthday last week was quite a fun event.  The whole crew for the Dunaverse mission arranged a surprise party for me with my family.  I got an astronomer\u0027s compass from my dad (it even looks like a mini navball!).  He told me I would always know my way home if I had that.  He\u0027s such a softie.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_2.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022potd_3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Well, the day has finally arrived for the launch of the habitation module.  The previous day was marked with the launches of the station core, base, mining, and lander modules, and those are all on their way to Duna already.  Now it\u0027s our turn to head up.  By this time tomorrow, we will also be en route to Duna, assuming all of the systems checks pass and refueling goes off without a hitch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Refueling at night is a bit eerie...  I\u0027m a bit on edge about the whole thing, I\u0027ll be honest.  Before today, I hadn\u0027t really given much thought to just how long this mission really is going to be.  I won\u0027t see my family again for a very long time.  I hope dad\u0027s still alive when I get back.  I know that\u0027s a morbid thought, but he doesn\u0027t take very good care of himself and he\u0027s getting on in years.  Still, this is a once-in-a-lifetime opportunity.  I\u0027m not getting cold feet the night before the big event!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1228.1\u003C/strong\u003E \u003Cem\u003E(Dunaday, Duember 13th 1895)\u003C/em\u003E\u003Cbr\u003E\nLow Kerbin Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We are mere minutes away from our injection burn.  Even though the other four modules have already been sent off ahead of us, the boffins are saying that our approach will result in us arriving a week before most of them do.  Half the crew is horribly nervous, the other over-excited, and we are all looking forward to finally getting underway.  As for me, I\u0027m somewhere between the two, but mostly I just want the burn to Duna over and done with.\n\u003C/p\u003E\n\u003Cp\u003E\n Karman and I have had some interesting tales to swap while we waited for the burn.  We talked about our misadventures prior to this mission, and how she got sent on a short one just before I got back from my training to prep Mun Base Alpha for habitation by the incoming class of Kermans.  I think we\u0027re going to get along great.  As for the others, I\u0027m mostly concerned about how well Jonbert and I will mesh since he pretty much talks nonstop about science.  I\u0027m just an engineer, I don\u0027t know anything about the finer details of how the universe works.  Pholie is pretty reserved, but she\u0027s also a great listener, and her memory is shockingly good.  She remembered the smallest details of our conversation back on my birthday when I talked to her just before launch!\n\u003C/p\u003E\n\u003Cp\u003E\n I find it hard to approach the Big Four, the founding Kermans of the space program, but they\u0027re not bad Kerbals or anything.  Jebediah is a blustery sort, always ready to jump into action, but he has a softer side too.  I had no idea he likes to write poetry!  Valentina is very no-nonsense when she gets focused, but the rest of the time she\u0027s actually a bit of a goofball.  Bob is exceptionally quiet most of the time, but if you start talking science with him, he won\u0027t stop for hours; poor Jonbert found that out the hard way, I bet he didn\u0027t think anyone could out-geek him!  Bill\u0027s the easiest of them to talk to, but it helps that he\u0027s a fellow engineer.  He reminds me of my little brother Donner, actually.\n\u003C/p\u003E\n\u003Cp\u003E\n Well, I\u0027d better stop writing, we\u0027re about to hit our maneuver node.  Next time I write, we\u0027ll be in interplanetary space!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n Further mission log entries will be released as we process them.  Thank you for your patience.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-12T05:55:00Z\u0022 title=\u002201/12/2021 05:55  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 12, 2021\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KeaKaka","CreatedById":202882,"CreatedDateTime":"2021-01-12T05:54:04Z","Content":"\n\u003Cp\u003E\nFirst!\n\u003C/p\u003E\n\u003Cp\u003E\nLoving it so far, can\u0027t wait for more!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-12T05:55:25Z\u0022 title=\u002201/12/2021 05:55  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 12, 2021\u003C/time\u003E by KeaKaka\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2021-01-12T08:27:06Z","Content":"\n\u003Cp\u003E\nThis is cool, I will be following! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"AeroSky","CreatedById":207684,"CreatedDateTime":"2021-01-12T10:40:11Z","Content":"\n\u003Cp\u003E\nInteresting! I\u0027ll be watching this closely \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-13T01:55:58Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1234.4\u003C/strong\u003E \u003Cem\u003E(Eveday, Duember 19th 1895)\u003C/em\u003E - Solar Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We\u0027re well on our way to Duna!  The overall flight is supposed to take about 204 days (still almost 200 to go...), which is a very long time indeed, but luckily we all get along quite well.  If any of us needs time away from the rest of the crew, we can slip into the greenhouse or the science lab.  We\u0027re going to test out the hibernation feature of the upper crew cabin today to see if it\u0027s effective.  I\u0027m on the second rotation for testing, so fortunately I don\u0027t have to worry about potentially never waking up again if the first test goes wrong.  On the other hand, I also have 50 days of half my fellow Kerbals on this flight being fast asleep to look forward to...\n\u003C/p\u003E\n\u003Cp\u003E\n Well, maybe it\u0027s for the best.  It will give me more time to get familiar with my fellow newer recruits, and let me have some time away from feeling intimidated by the Big Four.  Jonbert\u0027s finally stopped talking constantly; I think it was mostly nerves causing him to prattle on.  Maybe I should re-evaluate him a bit now that I know that.  I guess I have 50 days to do so!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1285.5\u003C/strong\u003E \u003Cem\u003E(Dresday, Triember 35th 1895)\u003C/em\u003E - Solar Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Jebediah, Bill, Bob, and Valentina all came out of hibernation just fine, none the worse for wear.  Our tests showed that they made a full recovery from the long sleep effects in under a day, and are exhibiting no lasting side-effects.  Of course, it could be weeks before actual side-effects show up, but so far this is a promising result.  Jonbert, Pholie, Karman and myself are next up, so this will be my last entry for at least 50 days.\n\u003C/p\u003E\n\u003Cp\u003E\n The four of us really became close-knit during our stretch together.  We know more about one another now than I think any of us know about anyone else back on Kerbin.  In a way, I\u0027m glad we\u0027re all going to wake up at the same time.  I wonder if this sort of bond is the same shared by the Big Four.  I hear they were pretty close even when the Space Program was founded, after all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 1386.2\u003C/strong\u003E \u003Cem\u003E(Eveday, Sextember 29th 1895)\u003C/em\u003E - Solar Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n They let us sleep far longer than they were supposed to...  Apparently orders came in from mission control to see how long we could stay in hibernation before we started showing signs of difficulty.  The thing is, that never happened; we were able to hibernate for months with no side-effects.  We completely missed Quattember and Quintember, and most of Sextember too!  We were brought out yesterday only because we\u0027re nearly at Duna.  I don\u0027t like that I lost 100 days of my life to that hibernation system, but it is what it is.  At least I didn\u0027t miss my birthday, unlike poor Pholie.  We\u0027re about 50 days away from arrival now.  Mission control only ordered us awake so we\u0027d have some proper time to work together as a full crew.\n\u003C/p\u003E\n\u003Cp\u003E\n For what it\u0027s worth, the Big Four all seem genuinely upset that they were forced to keep us in hibernation for so long.  I don\u0027t think they wanted to put us through that any more than we wanted to be put through it.  They\u0027ve been stuck with each other the whole time, too, so nerves between them are a bit high-strung.  Apparently Bill and Bob have been sequestered away in the greenhouse and lab respectively for the entire journey, and neither one wants to talk to Jebediah right now; they barely tolerate it when Valentina drops in on them.  I do hope they become more receptive now that the rest of us are awake!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2005.3\u003C/strong\u003E \u003Cem\u003E(Joolday, Octember 2nd 1895}\u003C/em\u003E - High Duna Trajectory\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We\u0027re finally here!  Duna has been slowly growing in size out the window for a month, and now we can clearly see it with the naked eye as we approach.  Our course has been altered to allow for aerocapture, but we\u0027re still going to need main engines to finish the process as Duna\u0027s atmosphere is quite thin.  To think, we\u0027re the first Kerbals ever to come so close to what was once merely a twinkle in the night sky!  It is humbling.\n\u003C/p\u003E\n\u003Cp\u003E\n The crew\u0027s mood has improved significantly, I must say.  Bob remains reticent, spending most of his time with Jonbert in the lab, but Bill has opened back up and even forgiven his brother Jebediah.  He and Pholie have become good friends while working in the greenhouse, it\u0027s actually kind of cute to watch them joke with one another.  Jeb\u0027s gotten pretty chummy with Karman lately, too, and Valentina and I have become very close.  It\u0027s good to see us all properly spending time with one another!  Jeb\u0027s proposed a crew exercise during our journey inward to help bring the team together, it should be interesting to see how that turns out...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2012.2\u003C/strong\u003E \u003Cem\u003E(Dresday, Octember 9th 1895)\u003C/em\u003E - Low Duna Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_10.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_10.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Jeb\u0027s exercise turned out to be a half-hour spacewalk to run checks and maintenance on the Dunaverse, which was a good idea as it turns out because we found a few micrometeor impacts that had come dangerously close to damaging the life support systems.  That\u0027s all patched up, so we should be good to go for the rest of the mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_11.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_11.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022potd_12.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_12.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n It turns out that the station hub arrived before we did, and has been busy setting up the comms network while we\u0027ve been on our way in.  We have a full 6/8 ear back to mission control, no deadzones in the network, thank the Kraken!  Mission control has swapped our comm dishes over from the long-range (and less reliable) mode to the shorter-range (and much more stable) mode.  This does mean that we\u0027re dependent on the comms sats staying active for the rest of the mission, but there\u0027s no chance the whole network could go down.  And even if it did, we could just switch the dishes back over to long-range mode.  Contingencies 11 through 15 save the day!  It\u0027s nice to be able to get regular broadcasts back from Mission Control again.  I was getting sick of having to wait half a week between transmissions.\n\u003C/p\u003E\n\u003Cp\u003E\n Incidentally, we got word back from Kerbin about recent events.  Prime Minister Merman Atis has been stirring up a lot of pro-Unification sentiment lately, because apaprently there\u0027s been a lot of unrest over in Devathoria these last few months.  Jonbert\u0027s convinced he\u0027s to blame since he defected to Lovothoria, but we\u0027ve assured him that\u0027s not it.  Politics rarely come down to one Kerbal!  My dad\u0027s doing fine, he sent his love.  Donner\u0027s been assigned to Mun Base Alpha for the closer-to-home habitation experiment, and apparently he\u0027s having a blast driving the rover around.  Overall, it sounds like Kerbin\u0027s doing just fine without us!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2023.4\u003C/strong\u003E \u003Cem\u003E(Kerbday, Octember 20th 1895)\u003C/em\u003E - Low Duna Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_13.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_13.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n All capture maneuvers completed successfully across all 5 Dunaverse craft, and at this point all of the final pieces of the mission have linked up to form the full craft (for the first and last time, I might add!).  The Dunaverse looks like some sort of child\u0027s toy in its fully-assembled form, but it won\u0027t stay in this formation for long.  Tomorrow we\u0027re sending the base module down to the surface, then following an orbit later in the lander.  A new life awaits me, likely for some time.  Our mission has us here for the next 560 days at minimum.  More than a year of my life is going to be dedicated just to this leg of the mission, potentially even more if the mission gets extended since the next return window after KSD 3225 isn\u0027t until KSD 5295.\n\u003C/p\u003E\n\u003Cp\u003E\n Well, unless we invoke Contingency 31, which we have one month available to us to do if we\u0027re going to.  But the odds of that happening are basically zero...  Better to just focus on the mission and hope it all goes well!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n The next part of the mission logs is still being analyzed.  Thank you for your patience.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-13T03:29:13Z\u0022 title=\u002201/13/2021 03:29  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 13, 2021\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AeroSky","CreatedById":207684,"CreatedDateTime":"2021-01-13T10:13:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223907981\u0022 data-ipsquote-contentid=\u0022199535\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221610502958\u0022 data-ipsquote-userid=\u002210651\u0022 data-ipsquote-username=\u0022SkyRender\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, SkyRender said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nContingency 31\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat\u0027s that? Is that hinting at something that\u0027ll happen in the future of the story? Hmmmmm?\n\u003C/p\u003E\n\u003Cp\u003E\nStill a great read though! Keep it up!\n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-13T16:59:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223908118\u0022 data-ipsquote-contentid=\u0022199535\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221610532830\u0022 data-ipsquote-userid=\u0022207684\u0022 data-ipsquote-username=\u0022AeroSky\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, AeroSky said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u0027s that? Is that hinting at something that\u0027ll happen in the future of the story? Hmmmmm?\n\u003C/p\u003E\n\u003Cp\u003E\nStill a great read though! Keep it up!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s a lot of contingencies.  I\u0027m sure we\u0027ll see at least a few of them invoked.  What KSP mission ever goes perfectly to spec, after all?\n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-14T06:47:13Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2024.2\u003C/strong\u003E \u003Cem\u003E(Munday, Octember 21st 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_14.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_14.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The base landed safely, and so did we.  The boffins even waited for our arrival to tell the base lander to extend the pieces out for placement on the surface, just so we could watch the show.  And what a show it was!  I was worried the whole thing might topple over any second, but it did fine.  Then we got to watch the base lander craft fly up high and smash itself hard into the ground, giving our newly-deployed seismometer something to call home about.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_15.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_15.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The base is very comfy!  Just like up in orbit, we have a greenhouse to work with when we need time away from the others, though we have no lab down here.  The boffins told us that they didn\u0027t want us running delicate experiments under the influence of Duna\u0027s atmosphere, which I guess makes sense.  We can\u0027t seem to stop tracking red dust everywhere inside the base, no matter how careful we are!  All of the life support systems came online just fine, and the drills both work just fine too (we were shocked when the water drill actually found anything, we\u0027re a long ways from the poles).  Mission control has extended our surface stay maximum from 84 days to indefinite, so clearly they\u0027re confident in the air and water filtration systems!\n\u003C/p\u003E\n\u003Cp\u003E\n This might sound strange, but there\u0027s still more for me to learn about my fellow Kermans than I realized.  I found out only today that Karman went to Pifler University, same as I did.  In fact, we were both in the engineering program at the same time!  How we never met back then is beyond me, even if we were one year apart.  In fact, I honestly cannot for the life of me ever remember seeing her anywhere on campus, though she assured me that she was there the whole time.  That seems almost impossible, given the size of the engineering campus and just how many students there are there at any given time.  Well, maybe I did see her back then and didn\u0027t recognize her.  I mean it is Pifler University, the single most popular university in all of Lovothoria!  It\u0027s pretty easy to disappear in a crowd there.\n\u003C/p\u003E\n\u003Cp\u003E\n Once we\u0027re settled in, Jeb wants to take us all out on an EVA expedition.  Mission control hasn\u0027t given the OK for it, but Jeb doesn\u0027t care.  As far as he\u0027s concerned, he\u0027s the one running this mission.  He\u0027ll get no arguments from me!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2026.3\u003C/strong\u003E \u003Cem\u003E(Mohoday, Octember 23rd 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_16.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_16.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Mission Control and Jeb had quite a shouting match this morning!  They\u0027ve scheduled a formal EVA for us tomorrow, though they wanted to push it out a full week originally.  But you can\u0027t argue with Jebediah Kerman, a lesson that we all learned a long time ago on this mission, so we\u0027re doing our EVA tomorrow.  Bob and Bill both retreated to the greenhouse during the rant, while Val stuck close to Jeb and mostly just chuckled to herself as he laid into Gene Kerman for trying to tell him how to do his job.  Most of us new recruits were too mortified to say anything, so we kept to the other habitation module for the whole thing.\n\u003C/p\u003E\n\u003Cp\u003E\n I noticed something I hadn\u0027t before: Pholie has some sort of tattoo or something on her neck.  It\u0027s small but it looks pretty elaborate, whatever it is!  I want to ask her about it, but I don\u0027t want to sound rude or anything.  Maybe I can get Karman to ask her instead, she doesn\u0027t seem to be intimidated by that sort of thing at all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2027.0\u003C/strong\u003E \u003Cem\u003E(Dunaday, Octember 24th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_17.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_17.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We went on our EVA bright and early today (well, by Kerbin\u0027s clock; it\u0027s still the middle of Duna\u0027s long night here), and performed quite a lot of maintenance and science on and around the base.  Jonbert and Bob were at the lander most of the \u0022day\u0022 managing the surface experiments, while the rest of us tended to the dust build-up on the exterior of the base.  You wouldn\u0027t think that landing would stir up so much gunk, but we ended up mucking about 10kg of the stuff from the various modules!  Jeb\u0027s invoked Contingency 27, the dust-proofing coating that can be applied to the air and water filtration systems.  I guess that was one contingency that we were going to have to invoke!  Good thing we didn\u0027t wait a week before doing it, too; the dust build-up would have fried the motors on all of our extended life support modules if we had!  How could Mission Control not have realized that might happen?  It boggles the mind, but makes me all the more glad that we\u0027ve got Jeb along with us.\n\u003C/p\u003E\n\u003Cp\u003E\n Jeb had another heated discussion with Mission Control when we were done.  I think he invented a few new curse words in the process!  Apparently Gene\u0027s promised that he\u0027ll interfere less when Jeb\u0027s intuition tells him to do something, which Jeb was pretty happy about.  I decided to ask Karman if she could talk to Pholie about that mark on her neck, only to find out that she\u0027d already asked Pholie about it a month ago!  Apparently she\u0027s had it since she was a baby, so I guess it\u0027s actually a birthmark?  It looks more like a tattoo, though...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2028.1\u003C/strong\u003E \u003Cem\u003E(Dresday, Octember 25th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_18.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_18.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Here we go again...  Jeb wants us all to return to the station for a few days, and of course Mission Control is against it.  Unsurprisingly it ended the same way as last time, with Gene bending to Jeb\u0027s will and agreeing to let him do it.  At least they didn\u0027t argue for nearly as long this time.\n\u003C/p\u003E\n\u003Cp\u003E\n I think the stress of these frequent arguments is starting to get to Jonbert.  He\u0027s started babbling again, but now it\u0027s all about his homeland of Devathoria instead of about science.  I asked him to stop after I noticed how uncomfortable it was making Karman.  Not sure what happened, but clearly she doesn\u0027t want to hear about the \u0022good old days\u0022 of Devathoria when the royal family was in charge!  She probably lost family during the Great Unification War.  I know that\u0027d be reason enough for me to not want to hear about Devathoria!  I mean my grandpa was deported there after the war, and even I can barely stand to hear Jonbert rant about it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2028.4\u003C/strong\u003E \u003Cem\u003E(Dresday, Octember 25th 1895)\u003C/em\u003E - Low Duna Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_19.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_19.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The station was just fine.  The Ike mining mission had taken off for its duties while we were away, and according to the station logs the whole thing worked out just fine.  However, the fuel ferry rover is apparently jammed on the docking port it was carried in on and needs an engineer to free it up.  Looks like I\u0027ve got a job to do!  Actually, Jeb wants all of us to go to Ike.  I mean I guess it makes sense?  It would really stink to come all the way out to Duna and never get to see Ike up close!  So we\u0027re going to take the lander out there first thing tomorrow.\n\u003C/p\u003E\n\u003Cp\u003E\n Pholie said something very strange to me today.  She told me that she doesn\u0027t trust Jonbert.  I asked her if it was because he\u0027s from Devothoria, but she said that\u0027s not it at all.  She wouldn\u0027t elaborate, so I didn\u0027t pursue it any further.  Jonbert may be a bit of a blabbermouth, but he\u0027s hardly a bad Kerman.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2030.4\u003C/strong\u003E \u003Cem\u003E(Eeloday, Octember 27th 1895}\u003C/em\u003E - Ike\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_20.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_20.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We made it to Ike!  It reminds me a little of our beloved Mun, but somehow it seems darker...  At least the miner\u0027s currently on the day side.  I would hate to have to work on this thing without the soothing light of Kerbol!  We got a fairly good-sized load of scientific data as we headed in, which has made both Bob and Jonbert quite happy.  If it keeps Jonbert from rambling and making Karman uncomfortable, I\u0027m happy too!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_21.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_21.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The rover wasn\u0027t too badly jammed.  We just had to move the docking port off the bottom side of the fuel tug and it will be good to go, bringing precious fuel to orbit for us to harness.  I got to drive it around for a bit, and even found a way to make the mining rig work faster!  Unfortunately I can\u0027t make that modification work constantly, I have to be there to make it happen.  But hey, it still made me feel pretty awesome!\n\u003C/p\u003E\n\u003Cp\u003E\n We took advantage of the situation and attached one of the miner\u0027s spare docking nodes to our lander, so now we can refuel the lander on the surface of Ike!  I wish I could say this was a home-grown contingency, but they actually thought of that with Contingency 121.  Mission Control really does think of everything...  Anyway, we\u0027re gonna stick around for a bit to do some science (Jonbert played a little golf earlier, his swing\u0027s impressive!), so I\u0027m just going to relax with Karman and Pholie back in the lander while our science boys do their science thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n Further logs are still being processed.  We thank you for your understanding.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-14T07:15:00Z\u0022 title=\u002201/14/2021 07:15  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 14, 2021\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-19T01:49:27Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2031.3\u003C/strong\u003E \u003Cem\u003E(Kerbday, Octember 28th 1895)\u003C/em\u003E - Low Duna Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_22.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_22.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Jeb made the executive decision to fly light up to orbit, dock with the trans-Ike fuel ferry, and rob it of all of its remaining fuel to ensure our safe return to Duna orbit.  He then performed what was probably the most impressive aerocapture I\u0027ve ever witnessed; we needed less than 200m/s to go from Ike escape trajectory to intercept and full rendezvous with the station.  Jeb really does know what he\u0027s doing!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_23.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_23.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We got safely back to the Dunaverse, and refueled for our return trip back to the surface.  Jeb is doing this against Mission Control\u0027s orders, naturally.  They had told us to stay up at the Dunaverse for the time being, as fuel supplies are now low enough that Contingency 31 won\u0027t be possible if we use any more fuel.  Jeb is confident that the mining system on Ike will work perfectly, however, and has made the decision to act as though it will.  That said, he only filled the fuel tank on the lander up to 75% capacity.  I think even Jeb has his doubts at this point.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2031.4\u003C/strong\u003E (\u003Cem\u003EKerbday, Octember 28th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_24.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_24.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Landing was a little bumpy, we got caught in a storm that blew us off course during the parachute-assisted part of the landing and ended up about 3km away from the base.  Luckily Contingency 77 was there to save the day: if you can\u0027t get back to base, base can get back to you!  The storm had cracked one of the solar panels on the base, though, so I had to fix that.  We still have plenty of repair kits, but it worries me when things like that happen.  I\u0027m seriously considering moving one of the RTGs off the lander and onto the base if that happens again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_25.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_25.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n As expected, Mission Control and Jeb had another shouting match.  This time, at least, Jonbert didn\u0027t freak out so badly about it.  We had a lovely discussion about the Ike trip instead, and about how well everything went.  The miner\u0027s reported that it\u0027s already converted over a hundred liters\u0027 worth of fuel from the strata, which is pretty promising given that it\u0027s only been a day.  We\u0027re shy about a thousand liters, so that could well be enough to put Contingency 31 back on track.  That is, of course, assuming that Jeb can restrain himself from doing another unscheduled flight.  Granted, Ike was a necessary trip, but it doesn\u0027t change the fact that our fuel margins are uncomfortably slim.\n\u003C/p\u003E\n\u003Cp\u003E\n I just got word from Jeb: Mission Control has grounded us for the foreseeable future to prevent further fuel misuse.  They sent a remote command to the lander to not accept any inputs from us, so it\u0027s basically just spare living accommodations at the moment.  To say that Jeb is cross about this would be an understatement, especially after Gene\u0027s previous reassurances about Jeb\u0027s ability to call our mission parameters.  Val somehow talked him down from using the entire base as a rover to explore Duna\u0027s surface in protest, but I wouldn\u0027t be surprised if he rescinds his promise to her later.  I just hope he doesn\u0027t get us all killed in the process of proving that he\u0027s the one in charge here...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n Some of the data and mission reports for the next part of the mission turned out to be corrupted.  Work is currently underway to undo this corruption, or at least to supplement it with post-mission debriefs.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-19T02:47:54Z\u0022 title=\u002201/19/2021 02:47  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 19, 2021\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-19T18:29:13Z","Content":"\n\u003Cp\u003E\n Attempts to fix the corruption on the next few entries was partially successful.  However, some entries appear to be encoded.  It may be years before we fully decode the data, so those logs are being presented as-is.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2039.1\u003C/strong\u003E \u003Cem\u003E(Kerbday, November 1st 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_26.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_26.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n I\u0027m amazed it took Jeb a week of being grounded to finally decide he\u0027d had enough, honestly.  Mission Control has been dead silent the entire week, not a peep out of them or even so much as a news broadcast from back home.  We checked the dishes, and they\u0027re all working fine.  They\u0027re getting full coverage from the satellite network too.  Mission Control has just inexplicably cut us off from Kerbin.  So Jeb decided that he\u0027s done waiting for them to come to their senses, and he\u0027s doing just what he threatened to before and using the base as a rover to explore Duna\u0027s surface.  He had us retrofit the lander\u0027s science experiments onto the base, Contingency 99 if you can believe it.  Did the boffins think of every possible event, or did they just realize that Jeb was going to go the \u0022rogue agent\u0022 route and decided to enable him?\n\u003C/p\u003E\n\u003Cp\u003E\n Whaever the case, we\u0027re all set to go gallavanting across the surface of Duna to our heart\u0027s content.  We could potentially circumnavigate the planet if we wanted, we have more than enough life support and supplies to do so.  Jeb, however, has a specific destination in mind.  Apparently during the quiet of the last few days, Bob managed to isolate a strange signal coming from a crater off to the northwest of us.  It\u0027s a long drive, it\u0027ll probably take at least a day and a half, but I\u0027m curious about what the signal could be.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2041.0\u003C/strong\u003E \u003Cem\u003E(Eveday, November 3rd 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EERROR: Entry corruption was detected.  Correction failed.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_27.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_27.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \u003Cem\u003EJung vf guvf guvat?  Vg ybbxf yvxr n Xreony snpr.  Gurer\u0027f ab bgure jnl gb qrfpevor vg, va snpg.  Vg\u0027f uhtr, gbb.  Jrer jr zrnag gb svaq guvf guvat?  Vg\u0027f tvivat bss na vafnaryl cbjreshy enqvb genafzvffvba, Ovyy naq Cubyvr erpbeqrq gur jubyr guvat naq ner gelvat gb qrpbqr vg.  V qba\u0027g yvxr vg urer bar ovg, V\u0027ir unq n fcyvggvat urnqnpur rire fvapr jr neevirq.  Gur fbbare jr trg bhg bs urer, gur orggre.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECYNARG XFF04 ERCBEG - HASVG SBE UNOVGNGVBA\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ENANYLFVF BS ARKG CYNARG VF UNF ORRA FPURQHYRQ\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EGREENSBEZVAT JVYY PBZZRAPR VS AB INYVQ PNAQVQNGR VF SBHAQ\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ECEBWRPG XREONY CEBPRRQVAT GB CYNA\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENYREG!  XREONY CERFRAPR QRGRPGRQ!\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ERKRPHGVAT CEBPRQHER 478589 VA NPPBEQNAPR JVGU CEBWRPG CNENZRGREF\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EVAGRESNPVAT JVGU XREONY PBZCHGREF CNEGVNYYL FHPPRFFSHY\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EERPBEQ GENAFSRE VA CEBTERFF\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQNGN UNF ORRA FHPPRFFSHYYL GENAFSREERQ\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EREEBE: HANOYR GB GENAFSRE PVCURE XRL\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EPNYPHYNGVAT CEBONOVYVGL BS XREONYF QVFPBIREVAT PVCURE...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ECEBONOVYVGL QRGREZVARQ GB OR 100% JVGUVA 100 LRNEF\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EGUVF ERFHYG VF JVGUVA NPPRCGNOYR ZVFFVBA CNENZRGREF\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2041.3\u003C/strong\u003E \u003Cem\u003E(Eveday, November 3rd 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EERROR: Entry corrupton was detected.  Correction was partially successful.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_28.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_28.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \u003Cem\u003EV guvax jr\u0027er\u003C/em\u003E mostly away from \u003Cem\u003Egung zbahzrag\u003C/em\u003E now.  It \u003Cem\u003Ezvtug fgvyy or\u003C/em\u003E causing some interference, \u003Cem\u003Egubhtu.\u003C/em\u003E  Hopefully once \u003Cem\u003Ejr\u0027er sne rabhtu\u003C/em\u003E away, that will \u003Cem\u003Efgbc.  Bhe\u003C/em\u003E next destination \u003Cem\u003Evf sne gb gur\u003C/em\u003E southeast, another signal \u003Cem\u003Egung Obo vfbyngrq.\u003C/em\u003E  I hope it\u0027s \u003Cem\u003Eyrff qvfehcgvir\u003C/em\u003E than this \u003Cem\u003Ebar jnf!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2042.2\u003C/strong\u003E \u003Cem\u003E(Mohoday, November 4th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_29.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_29.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We\u0027re definitely far enough away now!  Jeb decided to park us for the Dunan night, and I can\u0027t blame him one bit.  That monument really shook us all up.  What is something like that doing here on Duna?  Bob and Jonbert are going to analyze the signal it was broadcasting while we wait for daylight.\n\u003C/p\u003E\n\u003Cp\u003E\n Karman showed me something strange about our footage.  It came out garbled, and a strange symbol keeps showing up all over it.  That symbol looks familiar somehow, but it\u0027s hard to tell since it\u0027s faded, jitters all over the place, and keeps getting rotated about.  Where have I seen it before?  As if I needed more paranoia fuel, right?  It\u0027s probably just a coincidence, whatever it is.\n\u003C/p\u003E\n\u003Cp\u003E\n I checked my own mission logs, and disturbingly, they seem to be damaged.  Even more bizarre, however, is that I cannot for the life of me remember what I wrote in them before it got garbled.  I think that... thing... must have messed with our memories too.  I swear that parts of it I didn\u0027t even write.  We\u0027re going to the second anomaly once it\u0027s daylight again.  I hope it isn\u0027t so disturbing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2044.4\u003C/strong\u003E \u003Cem\u003E(Dresday, November 6th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EERROR: Entry corruption was detected.  Correction failed.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_30.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_30.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EMu vekdt iecu iehj ev tulysu.  Jxu iywdqb yj\u0027i rheqtsqijydw yi luho tyvvuhudj vhec jxu ejxuh edu.  Yj iuuci byau yj cywxj xqlu q lyikqb secfedudj?  Yj\u0027i xqht je iqo veh ikhu.  Y zkij xefu mu sqd wuj qmqo vhec yj ieed.  Co xuqt xkhji ulud mehiu qhekdt jxyi jxydw jxqd yj tyt qj jxu wyqdj Auhrqb xuqt...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EJHQDICYIIYED FHEJESEB 312415 QSJYLU\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ERHEQTSQIJYDW ED SXQDDUB 3845871XP\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHUSUYLYDW XQHTMQHU TUJUSJUT, YTUDJYVOYDW...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EKDQRBU JE YTUDJYVO EHYWYD IFUSYUI\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ESXUSAYDW SECFKJUH IOIJUCI EV HUSUYLYDW XQHTMQHU...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ETUJUSJUT FHEZUSJ AUHRQB TQJQ\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EIJEHYDW IYWDQB JE SECFKJUH IOIJUCI...\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIJEHQWU SECFBUJU\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003ESQBSKBQJYDW ETTI EV TUSETYDW RQIUT ED SKHHUDJ JUSXDEBEWYSQB QTLQDSUCUDJ...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E100% SXQDSU EV TUSETYDW MYJXYD 100 OUQHI\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003EJXYI HUIKBJ YI MYJXYD QSSUFJQRBU FQHQCUJUHI\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2046.1\u003C/strong\u003E (\u003Cem\u003EEelooday, November 8th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_31.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_31.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The last few days have been the strangest of my life.  Just like with that weird rock face, the strange metal device that was embedded in a rock corrupted our reports on it too.  And once again, I cannot remember what my logs said before they got corrupted.  What is going on with this planet?  Anyway, I think Jeb\u0027s drive to explore is sated, at least for now.  Bill and Bob managed to find another faint signature close to the south pole, but all four of us new recruits veto\u0027d any further expeditions at least for a few days.  If what we saw at the other two sites is any indicator, we do not want to approach whatever is waiting for us down south without a nice, long rest...\n\u003C/p\u003E\n\u003Cp\u003E\nMission Control finally got back in contact with us.  Apparently they went offline due to the Space Center being occupied by militants from Devathoria.  How did the Devathorian militants get that far into Lovothoria, though?  Anyway, the occupation failed and the troops were deported back to their homeland, so things have calmed down back on Kerbin.  Gene and the others were very relieved to know that we\u0027re still alive, and gave Jeb the go-ahead to explore the south pole in a few days.  The Ike fuel ferry sent us a message too, letting us know that it\u0027s about half full now, so Contingency 31 is back on the table if we need it.  That said, I think Mission Control\u0027s interest in Duna has reached a new high after our reports about the anomalies.  We may not be heading home to Kerbin for a very long time yet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n Additional corruption and/or encryption was present in the logs that follow.  We are still attempting, possibly in vain, to recover said data.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-19T18:34:49Z\u0022 title=\u002201/19/2021 06:34  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 19, 2021\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2021-01-19T19:31:52Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EAmateur Radio Operator V203\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ETo: KSP and other agencies\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESubject: Preliminary analysis of anomalous signals\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHave been monitoring spaceflight communication out of scientific interest. Recent transmissions have included anomalous encryption, followed by apparent confusion. Anomalous transmissions have been partially decrypted with both ROT13 and ROT10 ciphers. All interested parties can decrypt and verify independently. Will continue to monitor. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-19T19:34:39Z\u0022 title=\u002201/19/2021 07:34  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 19, 2021\u003C/time\u003E by Vagrant203\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-19T19:53:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223911667\u0022 data-ipsquote-contentid=\u0022199535\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221611084712\u0022 data-ipsquote-userid=\u0022202630\u0022 data-ipsquote-username=\u0022Vagrant203\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, Vagrant203 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003EAmateur Radio Operator V203\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ETo: KSP and other agencies\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESubject: Preliminary analysis of anomalous signals\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHave been monitoring spaceflight communication out of scientific interest. Recent transmissions have included anomalous encryption, followed by apparent confusion. Anomalous transmissions have been partially decrypted with both ROT13 and ROT10 ciphers. All interested parties can decrypt and verify independently. Will continue to monitor. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNicely spotted.  A shame that Kerbals have no idea what ROT13 and ROT10 are, but outside observers like ourselves do.\n\u003C/p\u003E\n\u003Cp\u003E\n(Obviously I didn\u0027t want the garbled text to be very hard to figure out!)\n\u003C/p\u003E\n"},{"CreatedByName":"AeroSky","CreatedById":207684,"CreatedDateTime":"2021-01-20T08:43:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223911679\u0022 data-ipsquote-contentid=\u0022199535\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221611086016\u0022 data-ipsquote-userid=\u002210651\u0022 data-ipsquote-username=\u0022SkyRender\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, SkyRender said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNicely spotted.  A shame that Kerbals have no idea what ROT13 and ROT10 are, but outside observers like ourselves do.\n\u003C/p\u003E\n\u003Cp\u003E\n(Obviously I didn\u0027t want the garbled text to be very hard to figure out!)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI wasn\u0027t expecting there to be some hidden code! A very novel, but amazing, idea! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2021-01-31T01:47:09Z","Content":"\n\u003Cp\u003E\n No amount of effort to decode the corrupted logs seems to have helped.  We are once again presenting the relevant data as-is.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2049.2\u003C/strong\u003E \u003Cem\u003E(Eveday, November 11th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_32.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_32.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n We\u0027re finally rested enough to make our polar expedition.  It was a tense few days, I must say!  We caught up on the two weeks of news reports we\u0027d missed, and things were pretty bad on Kerbin for a while there.  Prime Minister Atis was very nearly deposed in the coup attempt by the Devathorian extremists, and there were a number of skirmishes on the borders between the nations.  The only reason things calmed down was because the former king of Devathoria made a call for peace.  Apparently the extremists are royalists and want the old king back on the throne, but I don\u0027t think that\u0027s going to happen.  The old king is in very poor health, after all, and has stated that he will maintain his exile to Lovothoria until his dying day.\n\u003C/p\u003E\n\u003Cp\u003E\n Karman was pretty upset about the news, but Jonbert\u0027s reaction was probably the most disturbing.  He went into a huge rant about his faithless fellow Devathorians, a total reversal of his ranting a few weeks back about how he wanted the royal family back in power.  Did something change his mind?  I mean I\u0027d be pretty keen to swap sides if something like that happened among the people I had once thought to be my supporters, but I\u0027m not Jonbert.  Pholie seemed relieved to learn that the Prime Minister was still alive, but seemed disinterested otherwise.  I guess she\u0027s too young to appreciate the severity of what happened.\n\u003C/p\u003E\n\u003Cp\u003E\n I finally figured out where I\u0027d seen that strange symbol on our corrupted reports before!  The mark on Pholie\u0027s neck looks the same.  Well, sort of.  It\u0027s hard to really tell for sure, but there\u0027s definitely a similarity.  That\u0027s one mystery solved, I guess.  I was right, it was just a really weird coincidence!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EERROR: Entry corruption was detected.  Correction failed.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2052.0\u003C/strong\u003E \u003Cem\u003E(Dresday, November 14th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_33.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_33.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENy\u0027x ajwd htqi itbs mjwj.  Ymj xnlsfq bfx htrnsl kwtr f xywfslj mnqq, fsi ny\u0027x jrnyynsl ts ymj xfrj kwjvzjshd fx ymfy rfxy fsyjssf kwtr gjktwj.  Ny\u0027x tsqd f xqnlmyqd inkkjwjsy xnlsfq, fsi ny\u0027x gjnsl inwjhyji ytbfwi Pjwgns.  Ymj ywfsxrnxxnts nx sty gjnsl gwtfihfxy bnym sjfwqd jstzlm utbjw yt wjfhm Pjwgns, mtbjajw.  N btsijw nk ymj ybt bjwj rjfsy yt btwp ytljymjw twnlnsfqqd?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYWFSXRNXXNTS UWTYTHTQ 312415 FHYNAJ\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nGWTFIHFXYNSL TS HMFSSJQ 3845871ME\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWJHJNANSL MFWIBFWJ IJYJHYJI, NIJSYNKDNSL...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nZSFGQJ YT NIJSYNKD TWNLNS XUJHNJX\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nHMJHPNSL HTRUZYJW XDXYJRX TK WJHJNANSL MFWIBFWJ...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nIJYJHYJI UWTOJHY PJWGFQ IFYF\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nXYTWNSL XNLSFQ YT HTRUZYJW XDXYJRX...\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIZUQNHFYJ IFYF IJYJHYJI, FSFQDENSL...\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nHTSKNWRJI YWFSXRNXXNTS KWTR HTRUTSJSY 6596\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nST JWWTWX IJYJHYJI NS IFYF\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\nWJYZWSNSL YT GWTFIHFXY RTIJ\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2065.1\u003C/strong\u003E \u003Cem\u003E(Eveday, November 27th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_34.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_34.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n It\u0027s hard to deny that this is a momentous day, even though in the grand scheme of things it\u0027s just the 53rd day of our mission here at Duna.  Today was the expiration of being able to invoke Contingency 31, our emergency return window to Kerbin.  At this point our earliest departure date is a full year away, which would involve invoking Contingency 43.  For all intents and purposes it\u0027s identical to C31, and far too late if anything goes wrong in the intervening year.  We\u0027re here for the long haul now.\n\u003C/p\u003E\n\u003Cp\u003E\n Jeb and Val, naturally, were unflapped by this.  I don\u0027t think they\u0027d care if we were doomed to die here, honestly, they\u0027re having the time of their lives on Duna.  As for Bill, Bob, and Jonbert, they\u0027re all pretty melancholy right now.  I know for a fact that Jonbert\u0027s homesick, he left his wife and daughter behind to run this mission.  By the time we get back, little Allie will nearly be an adult.  As for Pholie, she\u0027s become overly focused on her work, and generally doesn\u0027t want to talk about anything else.  I guess that\u0027s just how she copes.  As for Karman, well, I\u0027m not at liberty to discuss that in the mission logs.  Suffice it to say that we\u0027ve found ways to cope with the reality of our situation together.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2065.4\u003C/strong\u003E \u003Cem\u003E(Eveday, November 27th 1895)\u003C/em\u003E - Duna\u0027s Surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_35.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_35.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n There was an unscheduled docking up at the station; we got word of it from the station\u0027s automated systems.  The fuel ferry from Ike isn\u0027t scheduled to arrive today, and mission control isn\u0027t telling us what this is about either.  We have been instructed to return to the station as soon as possible, however.  I hope it\u0027s not a system malfunction, or worse, an impactor.  We\u0027ll be finding out soon enough...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKSD 2065.5\u003C/strong\u003E \u003Cem\u003E(Eveday, November 27th 1895)\u003C/em\u003E - Low Duna Orbit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022potd_36.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://www.skyrender.net/potd_36.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n There is a Contingency 128.\n\u003C/p\u003E\n\u003Cp\u003E\n As it turns out, the boffins didn\u0027t like the idea of leaving us potentially stranded for over a year at Duna, at the mercy of life support sustaining systems that could fail at any time.  So about two weeks after the Dunaverse launches concluded, a sixth launch was done.  The nuclear-engine-powered ship that\u0027s arrived is loaded with another 355 days\u0027 worth of life support, as well as enough delta-V to get us back to Kerbin at any time (though life support is only assured for a window of 150 days from now and about 150 days after that, should the greenhouses, water recyclers, or air recyclers fail).  It even includes the latest version of the 10-meter inflatable heatshield, and reportedly there\u0027s a Contingency 129 in case that proves insufficient as well.\n\u003C/p\u003E\n\u003Cp\u003E\n For the first time since we got here, I feel far less nervous.  We\u0027re going to make it through this no matter what.  This is the best early New Year\u0027s present a Kerbal could ever ask for.  Bill, Bob, and Jonbert were utterly ecstatic, and Val even cracked a smile.  Jeb rolled his eyes and said something about this being \u0022the most over-planned mission in KSP history\u0022 but was obviously happy, and Pholie actually started crying when she realized what this all meant.  Karman and I celebrated too, but I\u0027ll leave it at that.\n\u003C/p\u003E\n\u003Cp\u003E\n We\u0027ve decided it\u0027s time to split the mission up a bit.  Jeb, Val, Jonbert and Pholie are all going back to the surface to stay at the base, while Bob, Bill, Karman and I will take over orbital duty.  I half-wonder what\u0027s going to happen next after everything we\u0027ve seen so far!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n A critical mission event occurred during the next set of logs.  As such, careful review will be necessary before any further logs are released.\n\u003C/p\u003E\n"}]}