{"TopicId":199866,"ForumId":70,"TopicTitle":"missing comms info?","CreatedByName":"mgirdwood","CreatedById":209662,"CreatedDateTime":"2021-01-27T11:38:27Z","PageNum":1,"Articles":[{"CreatedByName":"mgirdwood","CreatedById":209662,"CreatedDateTime":"2021-01-27T11:38:27Z","Content":"\n\u003Cp\u003E\nHi,  New player here.\n\u003C/p\u003E\n\u003Cp\u003E\nI am currently trying to get a probe out to Minmus.  Please can i check if there is a way to turn on the information regarding the intercraft communications that i can see on a number of tutorial videos .  top left hand corner of the screen in map mode, located to the right of MET button, which seems to show icons for signal strength, line of sight connection etc.  ( can not see how to add an screenshot of the area)\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps it is affected by a Mod ?  i have mainly \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E and Mech installed on ver 1.11 including Breaking Ground and Making History add ons.  Tracking station and Mission Control are both at level 2\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nmany thanks\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2021-01-27T11:49:58Z","Content":"\n\u003Cp\u003E\nFor a screen shot, just uplaod it to imgur and link to the .jpg file.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure what\u0027s wrong. Is that info just flat out not there? Do you see a time display? What about time warp arrows if you are in time warp?\n\u003C/p\u003E\n"},{"CreatedByName":"mgirdwood","CreatedById":209662,"CreatedDateTime":"2021-01-27T15:00:15Z","Content":"\n\u003Cp\u003E\nHi Superflous \n\u003C/p\u003E\n\u003Cp\u003E\nTried using my dropbox but as a new member i think its not able to link to a url at the  moment until i have enough posts.\n\u003C/p\u003E\n\u003Cp\u003E\nIn answer though, in the top left of the screen  i can see the warp arrows ( and use them  ), directly below that there is the T\u002B time info box, to the right of the time is the MET button, to the right of the MET button is a Warp to Sunrise button.  Below the time is a further box with a red  N/A in it and on the right of that is an icon that looks like a calculator with a red background.\n\u003C/p\u003E\n\u003Cp\u003E\nHope that is descriptive \n\u003C/p\u003E\n"},{"CreatedByName":"mgirdwood","CreatedById":209662,"CreatedDateTime":"2021-01-27T15:33:30Z","Content":"\n\u003Cp\u003E\nHi Superfluous\n\u003C/p\u003E\n\u003Cp\u003E\nJust found a post of yours from early 2019 where the same problem occurred and it turned out to be a mod Remote Tech that might have been causing the issue.  hadnt realised i had that mod and have removed, restarted the game and the comms info is there.  So thanks again for the historical pointer  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}