{"TopicId":199950,"ForumId":69,"TopicTitle":"How do wheels work?","CreatedByName":"lBoBl","CreatedById":170038,"CreatedDateTime":"2021-01-30T18:22:08Z","PageNum":1,"Articles":[{"CreatedByName":"lBoBl","CreatedById":170038,"CreatedDateTime":"2021-01-30T18:22:08Z","Content":"\n\u003Cp\u003E\nHullo,\n\u003C/p\u003E\n\u003Cp\u003E\nI have a very simple problem here. The TR-2L ruggedized rover wheel are, in my humble opinion, quite underpowered.  The XL wheels are just stupid big and really inconvenient, but the TR-2L which are much more reasonably sized aren\u0027t powerful enough to move anything bigger than a lander can except if you use a ton of them, at which point your craft starts looking ridiculous.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I was thinking, well, easy, I\u0027ll just edit the config files to make them just slightly more powerful, maybe at the cost of more electric charge, so that they aren\u0027t completely useless. But turns out, the config file is a bit more complicated than I anticipated.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically I just want to give them more torque, but here\u0027s what the motor module in the .cfg looks like \u003Cspan\u003E: \u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nMODULE\u003Cbr\u003E\n    {\u003Cbr\u003E\n        name = ModuleWheelMotor\u003Cbr\u003E\n        baseModuleIndex = 0\u003Cbr\u003E\n        \u003Cbr\u003E\n        wheelSpeedMax = 59//37 208 kph\u003Cbr\u003E\n        driveResponse = 2\u003Cbr\u003E\n        \u003Cbr\u003E\n        torqueCurve\u003Cbr\u003E\n        {\u003Cbr\u003E\n            key = 0 2.0 0 0\u003Cbr\u003E\n            key = 10 1.4 0 0//2.5 2.0 0 0\u003Cbr\u003E\n            key = 52 0.5 0 0//36 0.5 0 0\u003Cbr\u003E\n            key = 58 0 0 0//38 0 0 0\u003Cbr\u003E\n        }\u003Cbr\u003E\n        RESOURCE\u003Cbr\u003E\n        {\u003Cbr\u003E\n            name = ElectricCharge\u003Cbr\u003E\n            rate = 3.5//7\u003Cbr\u003E\n        }        \u003Cbr\u003E\n        idleDrain = 0.0//0.1////0.5\u003Cbr\u003E\n    }    \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nMy first observation was that it looks a bit dirty. If I understand correctly everything after the // symbols are comments that just don\u0027t do anything and are probably old values that should have been cleaned up at some point?\n\u003C/p\u003E\n\u003Cp\u003E\nThen I just wondered why the torqueCurve section looks so darn complicated. I guess I was wrong but I thought electric motors in the real world were supposed to have sort of a flat-ish torque curve... \n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m just guessing here, correct me if I\u0027m wrong... If we take the second key, 10 is a speed (in m/s presumably), and 1.4 would be the motor torque at that speed, in newton-meters or something? What are the two zeroes after that, why are they always zero for every key and why are they even there?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if I increase these values in the torqueCurve, will the Electric Charge consumption increase as well or do I need to change the rate under RESOURCE? In other words, is that rate per second or per newton-meter of torque?\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, (but this is optionnal I guess I can figure that out on my own) rather than modifying the stock cfg I\u0027d like to make a ModuleManager patch, but how do I target the specific keys under torqueCurve? Would this work\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n@PART[WheelMed]:AFTER[Squad]\u003Cbr\u003E\n{\u003Cbr\u003E\n    @MODULE[ModuleWheelMotor]\u003Cbr\u003E\n    {\u003Cbr\u003E\n        @torqueCurve\u003Cbr\u003E\n        {\u003Cbr\u003E\n            @key,0 = 0 3.0 0 0\u003Cbr\u003E\n            @key,1 = 10 2.0 0 0\u003Cbr\u003E\n            @key,2 = 52 0.75 0 0\u003Cbr\u003E\n        }\u003Cbr\u003E\n    }\u003Cbr\u003E\n}\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThanks in advance for any help you can provide!\n\u003C/p\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2021-01-30T19:03:31Z","Content":"\n\u003Cp\u003E\nThe various things you supposed all sound correct to me.  \n\u003C/p\u003E\n\u003Cp\u003E\nI would not trust that variable torqueCurve is actually in Newton-meters, even though the player-maintained wiki says so.  The radius of the wheel is not defined and ultimately we need force on the ground, so those numbers could be simply the in Newtons. KSP uses an underlying package for its wheel physics, and the extra layer complicates wheels in KSP.  To the extent that you care about details, I recommend that you build test craft to measure directly.\n\u003C/p\u003E\n\u003Cp\u003E\nI \u003Cem\u003Ethink\u003C/em\u003E the \u0027RESOURCE:rate\u0027 is expended as a simple on/off, so will not change if you increase torqueCurve.\n\u003C/p\u003E\n\u003Cp\u003E\nThe third and forth numbers are slopes coming into and coming out of each point.  So if \u0027torqueCurve\u0027 does actually have units of N-m, the four entries have units of m/s, N-m, N-m per (m/s), and N-m per (m/s).  You can find details on the forum page for the mod \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/112317-18-amazing-curve-editor-13/\u0022 rel=\u0022\u0022\u003EAmazingCurveEditor\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYour Module-Manager patch looks correct.  You can check the file ModuleManger.ConfigCache to see the effective configurations after patching.  You might find it simpler to delete all the keys and then redefine them \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E@torqueCurve {\n    !key = delete\n    key = 0 3.0 0 0\n    key = 10 2.0 -0.2 -0.2\n    key = 50 0.0 -0.05  0\n}\u003C/span\u003E\u003C/pre\u003E\n"},{"CreatedByName":"lBoBl","CreatedById":170038,"CreatedDateTime":"2021-01-30T21:11:30Z","Content":"\n\u003Cp\u003E\nThanks a lot!\n\u003C/p\u003E\n\u003Cp\u003E\nI did not know about AmazingCurveEditor but it looks like something I could use from time to time...\n\u003C/p\u003E\n"}]}