{"TopicId":200037,"ForumId":16,"TopicTitle":"Been a while since I played, Got a question..","CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2021-02-03T02:47:50Z","PageNum":1,"Articles":[{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2021-02-03T02:47:50Z","Content":"\n\u003Cp\u003E\nThere seems to be almost no activity (very low, atleast) in addon discussions lately so I\u0027m posting here about my \u0022KSPI (interstellar)\u0022 question.\u003Cbr\u003E\nI just started playing again recently after a long hiatus due to an absolute horrid health issue which rendered me useless for what seemed like forever...  Well, I\u0027m finally on the mend, but mods have changed, and I\u0027ve forgotten some things. I\u0027m remembering most as I go, but If I recall, you could put a science lab in orbit around Jool or other bodies and auto generate science... Is this still a thing? IF it is, is there a certain lab I use, or specific requirements I have to meet? I\u0027d really appreciate it if someone could give me a brief rundown, I can\u0027t seem to find any tutorials.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-03T02:48:47Z\u0022 title=\u002202/03/2021 02:48  AM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 3, 2021\u003C/time\u003E by Talavar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2021-02-03T03:17:04Z","Content":"\n\u003Cp\u003E\nThe Mobile Processing Lab doesn\u0027t give free science, but it may as well \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou send it somewhere, then get some science data and put it in the lab, and \u0022process\u0022 it. you need 1 or 2 scientists in the lab and something controlling the ship (probe core or another Kerbal of any type in a command pod).\n\u003C/p\u003E\n\u003Cp\u003E\nThe details are as boring as they are full of minutiae and I frankly don\u0027t know them. Where you are determines how much \u0022actual\u0022 science you get per science point processed, but in practice if you have a lab ANYWHERE it PUKES SCIENCE like it\u0027s going out of style. You could take one to Jool, but one in orbit of Minmus is just fine for filling out the tech tree.\n\u003C/p\u003E\n"},{"CreatedByName":"InfernoSD","CreatedById":208873,"CreatedDateTime":"2021-02-03T06:34:08Z","Content":"\n\u003Cp\u003E\nThe one other thing with the Mobile Processing Lab is that it doesn\u0027t send back science automatically. You have to manually take control of the vessel and hit transmit. There\u0027s a maximum capacity for science, so it eventually stops sciencing until you hit transmit. You\u0027ll also want an appropriate antenna to transmit with and a few batteries for the massive amount of electricity that will take. Of course the lab itself also consumes electricity over time, so bring some solar panels.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2021-02-04T22:43:43Z","Content":"\n\u003Cp\u003E\nMoving to Gameplay Questions.\n\u003C/p\u003E\n"}]}