{"TopicId":200012,"ForumId":55,"TopicTitle":"Gilly Bugs/Needed fixes","CreatedByName":"Wizard Kerbal","CreatedById":209063,"CreatedDateTime":"2021-02-02T01:40:32Z","PageNum":1,"Articles":[{"CreatedByName":"Wizard Kerbal","CreatedById":209063,"CreatedDateTime":"2021-02-02T01:40:32Z","Content":"\n\u003Cp\u003E\n    1. I was landing on Gilly, so I decelerated, then time-warped until 8,000 meters above sea level. Then I had to activate Phys-Warp. I fell for about one more hour, and at full Phys-warp, it still took me 15 minutes. Even on Minmus and Mun(or Mün),  Time-warp stops at 3,000 and 5,000 meters, and their gravity is much stronger so you barely have to wait half a minute in the worst cases before a soft touchdown. So I request that Gilly’s Time-Warp stopper(or whatever fancy word I should use here) is set lower.\n\u003C/p\u003E\n\u003Cp\u003E\n     2. I was on the map view, and it showed my trajectory  cleanly passing all of Gilly’s peaks. However, upon exiting map view: Mountain! -Last word of Bob kerman, on his fatal Gilly expedition \n\u003C/p\u003E\n\u003Cp\u003E\nIf it’s not the case for PC or PS4, I play on Xbox one\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-02T03:17:44Z\u0022 title=\u002202/02/2021 03:17  AM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 2, 2021\u003C/time\u003E by The wizard of me\u003C/strong\u003E\n\u003Cbr\u003EAnother Problem\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2021-02-02T02:08:00Z","Content":"\n\u003Cp\u003E\nThis is sadly normal. However there is a simple solution.\n\u003C/p\u003E\n\u003Cp\u003E\nPretend Gilly is a huge space ship and instead of landing on it, you\u0027re docking with it. If you were 8000 meters from your target space ship, what would you do?\n\u003C/p\u003E\n\u003Cp\u003E\nYes I\u0027m telling you to burn towards Gilly. Get up to 50m/s and you\u0027ll cover those 8000 meters in about 3 minutes.\n\u003C/p\u003E\n"},{"CreatedByName":"InfernoSD","CreatedById":208873,"CreatedDateTime":"2021-02-02T06:45:27Z","Content":"\n\u003Cp\u003E\nThe time warp thing is an annoyance. The non-spherical nature of Gilly makes it a really bad fit for the time-warp stopper, as you call it. But at least you can burn through it with a little fuel\n\u003C/p\u003E\n\u003Cp\u003E\nThe map view problem is a real nuisance, though. I don\u0027t see any reason for it to be like it is. Things parked on the surface of Gilly look like they\u0027re floating in map view. Even on much larger planets, the difference between an object on the surface and the surface itself is sometimes apparent.\n\u003C/p\u003E\n"}]}