{"TopicId":200053,"ForumId":109,"TopicTitle":"Basic features. Energy, water, sanitation, waste management, hazardous/toxic/radioactive waste management, organic waste, health, food,","CreatedByName":"Lo.M","CreatedById":208979,"CreatedDateTime":"2021-02-03T14:38:56Z","PageNum":1,"Articles":[{"CreatedByName":"Lo.M","CreatedById":208979,"CreatedDateTime":"2021-02-03T14:38:56Z","Content":"\n\u003Cp\u003E\nWhat we\u0027re going to discuss here, in the colonies and in space.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nHow do we produce energy? Nuclear Reactors (Saltwater reactors among others...), Fusion reactors (Magnetic/Inercial Containment Reactors, pneumatic fusion reactors among others...), Tri Alpha Energy, Solar Panels, \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u003C/abbr\u003E generator, Combustion generators, geothermal energy, heliothermal energy, tidal energy, wave energy, marine current energy, ocean thermal conversion energy, antimatter annihilation energy (yes I know antimatter was made to transport energy plus it to be included)\n\u003C/li\u003E\n\u003Cli\u003E\nHow would we extract water? From the polar ice caps, from the treatment of water on planets with water, extracted from the subsoil, extracted from the air. How would that work?\n\u003C/li\u003E\n\u003Cli\u003E\nHow would we treat the sewer? Using algae/microorganisms, osmosis, or would we dump anywhere (bad idea)?\n\u003C/li\u003E\n\u003Cli\u003E\nHow would we handle the trash? Recycling, Incineration, Landfills?\n\u003C/li\u003E\n\u003Cli\u003E\nHow would we handle dangerous/toxic/radioactive waste, we would throw somewhere (bad idea), throw it in a bunker, turn it into useful things?\n\u003C/li\u003E\n\u003Cli\u003E\nWould we have organic waste? We could do composting?\n\u003C/li\u003E\n\u003Cli\u003E\nWould the Kerbals would be healthy? Would they be bad for eating stored things for a long time? Would they have diseases?\n\u003C/li\u003E\n\u003Cli\u003E\nHow would we produce food? Aquaponics, Greenhouses, Hydroponics, Aeroponics, Could we Grow insects (and kerbals would eat them)(nhum nhum insects), we could industrially process this food, We would have those edible pastes that astronauts eat, we could grow algae and microorganisms cultivars to produce pastes (\u0022very good\u0022) ?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIn case you think it\u0027s necessary, I\u0027ll add other things.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s good to speculate, but we still have little information about it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-03T15:01:43Z\u0022 title=\u002202/03/2021 03:01  PM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 3, 2021\u003C/time\u003E by Lo.M\u003C/strong\u003E\n\u003Cbr\u003EI added something that the user below reminded me of.\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-02-03T14:45:35Z","Content":"\n\u003Cp\u003E\nYou can go either light and abstract all of these as \u0022supplies\u0022 and electricity consumption or go as deep as you want, at the\u003Cspan\u003E end of the day it won\u0027t be the realism to be the mayor factor in what we\u0027ll find in the game, but the result of the playtesting they\u0027re likely doing.\u003C/span\u003E\u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAt the moment we have very little and sparse information about how that part of the gameplay will look like.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-02-03T16:55:26Z","Content":"\n\u003Cp\u003E\nTo expand on what Master39 has said. The only definite thing we know is there will be more resources in the game, and you will be able to manufacture them in the colonies. The rest is just broad ideas with no definite system mentioned or explained.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think it will be as complicated as like MKS or Pathfinder, but it will be more complicated than what is currently in KSP.\n\u003C/p\u003E\n"},{"CreatedByName":"Kernel Kraken","CreatedById":181383,"CreatedDateTime":"2021-02-03T21:05:20Z","Content":"\n\u003Cp\u003E\nThere\u0027s going to have to be a balance between realism and making the game actually fun to play. I doubt it\u0027d be super fun managing Kerbal\u0027s radiation exposure when ship parts already block radiation, sewage removal just sounds like a tedious thing to do once and forget about it, and handling trash sounds like a boring chore. If the automated supply missions are a thing, I see no reason why automated sewage treatment (in a special part for sewage treatment, of course) shouldn\u0027t be done automatically, same thing with trash management.\n\u003C/p\u003E\n\u003Cp\u003E\nThe others sound much more fun. Playing with radioactive waste sounds like a great source of content for those YouTubers who like to torture their videogames. Sending rovers to measure water levels to make sure the planet is habitable sounds interesting and a good reason to have probe cores. I would love a progression with the power systems, from wind to geothermal. Imagine hydroelectric turbine parts that have to be deep underwater to work! A special greenhouse dome for hydroponics or algae or just a generic \u0022snacks\u0022 resource would be a good looking part to keep on your base \n\u003C/p\u003E\n\u003Cp\u003E\nThe issue is how complicated you want to make it. I feel like there should just be a few main resources: Water, Oxygen, Snacks, and Material. All do what they sound like- water is consumed and used for irrigation, oxygen is used to breath, snacks are snacked on, and material are used for in-colony VABs because I doubt you would need to deal with Kerbin-side part contractors shipping parts to space. Greenhouses on the higher end of the tech tree could produce oxygen as well as snacks, and water recyclers would be a late-game option so you don\u0027t have to spend material on ice-mining rovers. \n\u003C/p\u003E\n\u003Cp\u003E\nOn the topic of nuclear waste: I think it should be a very late-game problem that most players won\u0027t have to deal with. Nuclear reactors last years with a small amount of fuel, and produce massive amounts of power. Advanced designs also produce very little waste. Full-blown reactors would be able to power your entire colony while producing little waste and not having any serious downsides other than having to dump waste material into a crater somewhere. They would need to be balanced, like needing a large amount of water and a backup generator to run or risk going offline, because otherwise it would take the entire challenge of energy generation out of building and managing a colony. \n\u003C/p\u003E\n\u003Cp\u003E\nOn the subject of energy generation... how do we feel about long-distance energy transfer with heating lasers and things? Imagine a tidally locked planet close to it\u0027s star. Once you\u0027ve set up solar farms there, you could fire high-powered lasers at a colony on another planet as a form of energy generation. That would also facilitate structures like Dyson swarms and other fun megaprojects. \n\u003C/p\u003E\n\u003Cp\u003E\nFor water gettin\u0027 and storage, I feel like you could use normal drills used for getting material. If you drill in an area with ice, it sends ice into your ore tanks that can be sent back to your colony and melted to be filtered.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s just my two cents, though.\n\u003C/p\u003E\n\u003Cp\u003E\nTL;DR: Keep it simple with just a few resources, and keep automation high so it doesn\u0027t become a chore simulator instead of a space exploration game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-03T21:07:25Z\u0022 title=\u002202/03/2021 09:07  PM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 3, 2021\u003C/time\u003E by Kernel Kraken\u003C/strong\u003E\n\u003Cbr\u003ESpelling errors, punctuation.\n\u003C/span\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2021-02-03T22:10:06Z","Content":"\n\u003Cp\u003E\nI\u0027m on the side of **not** wanting to manage my colonies basic needs. At a certain point it turns into more a management game and less a \u0022space program\u0022 game. Either it turns into a situation where your spending most of your time \u0022up-keeping\u0022, or its automated away so it doesn\u0027t really matter anyways.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sure mod support can come in and increase the realism, but I\u0027d rather focus on more advance space tech and missions further and deeper into space. Spending time getting \u0022snacks\u0022 to my kerbal colonies on the Mun, is less time spent pushing the limits of my only \u0022orbital drive ship\u0022 being sent to setup an outpost in the closest star system for all of Kerbal-kind in an all or nothing mission. \n\u003C/p\u003E\n\u003Cp\u003E\nThe stock game should focus on taking that first \u0022I made it to orbit!\u0022 feeling and expanding on it for larger scoped missions using more advanced tech. With the main goal being that it \u003Cstrong\u003Eis\u003C/strong\u003E inspiring to do those kinds of missions with such large stakes and risks. \n\u003C/p\u003E\n\u003Cp\u003E\nFor those that want extra realism grind, mods or maybe even expansions can serve it.\n\u003C/p\u003E\n\u003Cp\u003E\nI wont hate it if its in the game, I just don\u0027t want it to slowly turn into a grid. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Lo.M","CreatedById":208979,"CreatedDateTime":"2021-02-03T22:41:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223919672\u0022 data-ipsquote-contentid=\u0022200053\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221612390206\u0022 data-ipsquote-userid=\u002277241\u0022 data-ipsquote-username=\u0022MKI\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n30 minutes ago, MKI said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m on the side of **not** wanting to manage my colonies basic needs. At a certain point it turns into more a management game and less a \u0022space program\u0022 game. Either it turns into a situation where your spending most of your time \u0022up-keeping\u0022, or its automated away so it doesn\u0027t really matter anyways.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sure mod support can come in and increase the realism, but I\u0027d rather focus on more advance space tech and missions further and deeper into space. Spending time getting \u0022snacks\u0022 to my kerbal colonies on the Mun, is less time spent pushing the limits of my only \u0022orbital drive ship\u0022 being sent to setup an outpost in the closest star system for all of Kerbal-kind in an all or nothing mission. \n\u003C/p\u003E\n\u003Cp\u003E\nThe stock game should focus on taking that first \u0022I made it to orbit!\u0022 feeling and expanding on it for larger scoped missions using more advanced tech. With the main goal being that it \u003Cstrong\u003Eis\u003C/strong\u003E inspiring to do those kinds of missions with such large stakes and risks. \n\u003C/p\u003E\n\u003Cp\u003E\nFor those that want extra realism grind, mods or maybe even expansions can serve it.\n\u003C/p\u003E\n\u003Cp\u003E\nI wont hate it if its in the game, I just don\u0027t want it to slowly turn into a grid. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFood and oxygen I think have been confirmed if I don\u0027t know what those domes with plants at the end of the ksp2 trailer for\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-02-04T07:36:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223919681\u0022 data-ipsquote-contentid=\u0022200053\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221612392087\u0022 data-ipsquote-userid=\u0022208979\u0022 data-ipsquote-username=\u0022Lo.M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Lo.M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFood and oxygen I think have been confirmed if I don\u0027t know what those domes with plants at the end of the ksp2 trailer for\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s not confirmed, I can totally see a gameplay mechanic where habitats can sustain a certain amount of kerbals plus something if you add some greenhouses.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022\u003Cem\u003EThis hab can support 15 Kerbals plus 5 for every greenhouse you assign to it up to 50\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOr a requirement system with Kerbals in a colony having a hidden score representing how well they\u0027re living in that colony and their work  and growth being influenced by it (from not working at all up to having a bonus). \n\u003C/p\u003E\n\u003Cp\u003E\nLife support doesn\u0027t have to be a mere \u0022Kerbal fuel management minigame\u0022 like most of KSP1 mods.\n\u003C/p\u003E\n"},{"CreatedByName":"Lo.M","CreatedById":208979,"CreatedDateTime":"2021-02-04T13:25:34Z","Content":"\n\u003Cp\u003E\nMaybe a small piece you would put in your colony or spaceship, which would reciclasse the garbage that the kerbals would produce, and the machine would convert into resources, and the more kerbals the more resources it would produce, but it wouldn\u0027t be something like fuel in the game, but that would only work if your colony was functioning normally and wouldn\u0027t work with a lack of food or other things if it had.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same could be applied to sewage producing water.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-04T14:04:39Z\u0022 title=\u002202/04/2021 02:04  PM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 4, 2021\u003C/time\u003E by Lo.M\u003C/strong\u003E\n\u003Cbr\u003EI\u0026#039;m sorry for any grammar error.\n\u003C/span\u003E\n"}]}