{"TopicId":200355,"ForumId":70,"TopicTitle":"Docking Port Sr.s not docking","CreatedByName":"djshaw","CreatedById":209523,"CreatedDateTime":"2021-02-14T19:43:10Z","PageNum":1,"Articles":[{"CreatedByName":"djshaw","CreatedById":209523,"CreatedDateTime":"2021-02-14T19:43:10Z","Content":"\n\u003Cp\u003E\nHi everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nI am dissassembling and reassembing a space station using the eva construction mode. I\u0027ve removed a Docking Port Sr. to get access to some reaction wheels underneath, to put the Docking Port Sr. back on. After reattaching the Docking Port Sr., it never attaches to any other docking port. (I\u0027m using MechJeb to help--if I put the docking port on backwards, MechJeb sets up backwards, so I\u0027m certain I didn\u0027t attach the docking port backwards). I thought the issue was because I had an Engineer on a ladder and that docking wouldn\u0027t happen if there was a kerbal on a ladder. However, after stowing the kerbal in Science Lab, the issue still occurs.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth vessels that I\u0027m trying to dock have electric charge, and other resources (monopropellant, oxidizer, and fuel), and both vessels have communication links to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAny suggestions on what I could do to resolve the issue (other than sending new reaction wheels from Kerbin)?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2021-02-14T20:12:01Z","Content":"\n\u003Cp\u003E\nQuestion moved to modded support. Do you have screenshots of the ships as you are attempting to dock? \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-02-15T13:27:39Z","Content":"\n\u003Cp\u003E\nThe docking port may be stuck in a state where it thinks it’s already docked to something, it’s a fairly simple fix but requires a bit of save file editing to do so and I can’t remember exactly what needs to be changed, or what to change it to. Try a different docking port, or replace it with a new one instead?\n\u003C/p\u003E\n"}]}