{"TopicId":200340,"ForumId":16,"TopicTitle":"How to transfer (and time correctly) from the moon of a body, to another planet?","CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2021-02-14T07:52:42Z","PageNum":1,"Articles":[{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2021-02-14T07:52:42Z","Content":"\n\u003Cp\u003E\nAnd specifically, how can I calculate the direction of my ejection angle beforehand? Say, a hundred earth-days before the optimal transfer window opens, and for example my craft is orbiting Ike or Gilly and I want to return to Kerbin saving as much fuel as possible. How can I calculate and know when to exit Ike\u0027s sphere of influence and turn my orbit into a highly elliptical one. I could also for example get a low duna periapsis and, over time with minimal corrections, raise my apoapsis with continuous Ike gravity assists. Then when the transfer window opens, optimally my orbit would already be \u0022pointing the right way\u0022 with almost maximum apoapsis,  and I only need to burn (much less than from a circular \u0022parking\u0022 orbit) prograde at periapsis.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there possibly a tutorial available on youtube, are there some add-ons which provide with this functionality? To match, or visualize or inform of the ejection angle of a transfer window way ahead of time \u0022not in relation to the sun but to the orbits themselves.\u0022 I tried searching but could not find maybe due to the specific nature of my question.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the help.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-14T10:22:05Z\u0022 title=\u002202/14/2021 10:22  AM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 14, 2021\u003C/time\u003E by Kuula4\u003C/strong\u003E\n\u003Cbr\u003ETo make the title clearer and more specific\n\u003C/span\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2021-02-14T09:25:25Z","Content":"\n\u003Cp\u003E\nCheck out this nifty little tool:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://alexmoon.github.io/ksp/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2021-02-14T09:34:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\nCheck out this nifty little tool:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://alexmoon.github.io/ksp/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have used that wonderful website and it has been a great help many times! But, I can\u0027t see from toying around with the settings any way that it could answer my question: when to exit a moon\u0027s sphere of influence, reduce orbit (lower periapsis to maximise oberth effect later) to elliptic, potentially lift apoapsis a little bit, with help from the moon, AND launch into a transfer trajectory. All this without easy circular parking orbits. And how can I plan this hundreds of days in advance? I should or must calculate the position of the moons AND ship ejection angles in a specific date of the calendar.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2021-02-14T09:48:13Z","Content":"\n\u003Cp\u003E\nAh, sorry, I did misread you, thought your question was about transfer windows in general, my bad.\n\u003C/p\u003E\n\u003Cp\u003E\nI never did an interplanetary transfer from a moon, the \u0022normal\u0022 ballistic transfers from planet orbit to another planet are already not the most easy stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-02-14T11:58:15Z","Content":"\n\u003Cp\u003E\nI suppose, all you need to know is the transfer window time from Duna and ejection angle. Then you take Ike\u0027s orbit altitude, more or less. In-game mod Transfer window planner is a bit better because it actually shows ejection angle in map view. So with that you are very close to perfect transfer. Almost like you were starting from Duna orbit. Just keep in mind that your -as in, Ike\u0027s - orbit is geosynchronous so you have one chance to launch per Dunian Sol.\n\u003C/p\u003E\n\u003Cp\u003E\nI may have messed that up a bit so here are the steps:\n\u003C/p\u003E\n\u003Cp\u003E\n-put in Ike\u0027s orbit altitude and all info you know from the start into the planner Duna-Kerbin\n\u003C/p\u003E\n\u003Cp\u003E\n-read the time for the transfer, burn info, ejection angle (look up what\u0027s the angle like if you were transfering from Duna itself) and use it to create a node along your orbit around Ike. So, in that case, Ike has to be in right position for the transfer to be successful.\n\u003C/p\u003E\n\u003Cp\u003E\n-drag around and fiddle with it, make it later, anything, until you find an encounter with Kerbin. Because your path has to be in line with ejection angle.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s theory I think, I\u0027ve never done that either.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-02-14T13:05:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223926038\u0022 data-ipsquote-contentid=\u0022200340\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221613289162\u0022 data-ipsquote-userid=\u0022210071\u0022 data-ipsquote-username=\u0022Kuula4\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kuula4 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd specifically, how can I calculate the direction of my ejection angle beforehand? Say, a hundred earth-days before the optimal transfer window opens, and for example my craft is orbiting Ike or Gilly and I want to return to Kerbin saving as much fuel as possible. How can I calculate and know when to exit Ike\u0027s sphere of influence and turn my orbit into a highly elliptical one.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe hard way is to simulate. simulate getting from the moon to the planet (at the lowest possible cost) and then making a big burn at planetary periapsis, and see where you end up. try for different orbits, until you find one that sends you in the right direction.\n\u003C/p\u003E\n\u003Cp\u003E\ni found an easier way, that requires having another ship orbiting the planet. Use that ship, in low orbit of the planet, to plan the interplanetary transfer. make the manuever at the right time.\n\u003C/p\u003E\n\u003Cp\u003E\nthen take your ship orbiting the moon, and target the guide ship. you will see its planned trajectory. use that when exiting the moon, to place your planetary periapsis as close as possible to the manuever node. this will ensure your elliptic orbit will be oriented correctly.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is an example. blue ship is the guide, i used it to plan the periapsis of the other ship\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OjprYUG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OjprYUG.png\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI could also for example get a low duna periapsis and, over time with minimal corrections, raise my apoapsis with continuous Ike gravity assists. Then when the transfer window opens, optimally my orbit would already be \u0022pointing the right way\u0022 with almost maximum apoapsis,  and I only need to burn (much less than from a circular \u0022parking\u0022 orbit) prograde at periapsis.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ntha\u0027s much more complicated, because gravity assists are never neat. you will get a push in multiple directions, skewing your perfect alignment. and if you park in that orbit, you will need a lot of correction manuevers to avoid meeting the moon again.\n\u003C/p\u003E\n\u003Cp\u003E\nbut the last nail in this approach is, the moons are always pretty far from a planet. from mun to the edge of kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E is 100 m/s. from Ike to the edge of duna, even less. And close to that even for Gilly, not that gilly would be any good for gravity assists. So, raising your apoapsis with the moon can only gain you 100 m/s at most. unless you are at jool, which is an entirely different scenario with entirely different challenges.\n\u003C/p\u003E\n\u003Cp\u003E\ni tried that manuever a few times, i always ended up spending more in correction manuever than i would gain otherwise.\n\u003C/p\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2021-02-14T14:08:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223926123\u0022 data-ipsquote-contentid=\u0022200340\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221613307919\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI found an easier way, that requires having another ship orbiting the planet. Use that ship, in low orbit of the planet, to plan the interplanetary transfer. make the maneuver at the right time.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat works for me as well.   I would go further and suggest that \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210071-kuula4/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210071\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210071-kuula4/\u0022 rel=\u0022\u0022\u003E@Kuula4\u003C/a\u003E freely use the cheat menu (F12 key on PC) and its set-orbit feature to place \u0022planner\u0022 probes where they are helpful for planning.  You might need to cheat around the Comm-Net limitations if you set the option where communication is required to set maneuver nodes.  Many people have suggested making planning nodes be standard in the game (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/199111-*\u0022 rel=\u0022\u0022\u003Elink\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/70998-*\u0022 rel=\u0022\u0022\u003Elink\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/98179-*\u0022 rel=\u0022\u0022\u003Elink\u003C/a\u003E) \n\u003C/p\u003E\n\u003Cp\u003E\nLow circular orbit around Duna is a useful place for a planner-probe, even though your real craft will only touch that low orbit at periapsis.  Even with the probes, the in-game tools are awkward for setting maneuver nodes far in the future, but you might already know about mods like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/128303-*\u0022 rel=\u0022\u0022\u003EPrecise Maneuver\u003C/a\u003E that let you paste the maneuver from the planners.\n\u003C/p\u003E\n\u003Cp\u003E\nThe particular journey you are planning now, from Ike to Kerbin, benefits only a little from dropping to an elliptical orbit of Duna.  Ike already has a rather low and therefore fast orbit around Duna.  \n\u003C/p\u003E\n\u003Cp\u003E\nYou (\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210071-kuula4/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210071\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210071-kuula4/\u0022 rel=\u0022\u0022\u003E@Kuula4\u003C/a\u003E) might be interested in the way people figure whether it is worth dropping the periapsis before a transfer.    If your starting moon is in orbit lower than the so-called \u0027gate orbit\u0027 (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/33699-*\u0022 rel=\u0022\u0022\u003Elink to table of gate altitudes\u003C/a\u003E) then it costs less fuel to leave the moon directly.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-14T14:13:20Z\u0022 title=\u002202/14/2021 02:13  PM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 14, 2021\u003C/time\u003E by OHara\u003C/strong\u003E\n\u003C/span\u003E\n"}]}