{"TopicId":200318,"ForumId":16,"TopicTitle":"bro how do i get good","CreatedByName":"bruhmomentium69","CreatedById":210040,"CreatedDateTime":"2021-02-13T06:59:58Z","PageNum":1,"Articles":[{"CreatedByName":"bruhmomentium69","CreatedById":210040,"CreatedDateTime":"2021-02-13T06:59:58Z","Content":"\n\u003Cp\u003E\nhow i ned a turoial plz halp \n\u003C/p\u003E\n\u003Cp\u003E\npoggers\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-02-13T07:01:43Z\u0022 title=\u002202/13/2021 07:01  AM\u0022 data-short=\u00223 yr\u0022\u003EFebruary 13, 2021\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003EFixed formatting\n\u003C/span\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2021-02-13T07:04:00Z","Content":"\n\u003Cp\u003E\nWelcome to the forum \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210040\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0022 rel=\u0022\u0022\u003E@bruhmomentium69\u003C/a\u003E, your question has been moved from KSP discussion as it is a question about gameplay. Your post has also been edited to remove a lot of white space.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere are you at in terms of gameplay? \n\u003C/p\u003E\n"},{"CreatedByName":"Anonymous49","CreatedById":209341,"CreatedDateTime":"2021-02-13T08:28:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223925515\u0022 data-ipsquote-contentid=\u0022200318\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221613199598\u0022 data-ipsquote-userid=\u0022210040\u0022 data-ipsquote-username=\u0022bruhmomentium69\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bruhmomentium69 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhow i ned a turoial plz halp \n\u003C/p\u003E\n\u003Cp\u003E\npoggers\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nscreenshots?\n\u003C/p\u003E\n"},{"CreatedByName":"purpleivan","CreatedById":120081,"CreatedDateTime":"2021-02-13T09:52:41Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210040\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0022 rel=\u0022\u0022\u003E@bruhmomentium69\u003C/a\u003Ecan you tell us what type of things you need help with, e.g. building your vehicles, launching them or flying to other planets.\n\u003C/p\u003E\n\u003Cp\u003E\nAre you are having problems with a vehicle that you have built, e.g. it does not stage properly, or it rolls over when flying it. If you are then post some pictures of it, so people can take a look at it and give some advice.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are lots of tuturials on Youtube, here are some I found from a quick search, I don\u0027t know how far you have progressed in the game, so these are some explaining basic stuff. If these are not what you need, then take a look around Youtube for other ones or let us know what you would like help with.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m assuming that you want help with rockets, but if you need help with other types of vehicles, such as planes, then let us know.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/HN8dus_zZbE?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/vDyZgOBa9dA?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/fbNAjmooad0?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/PbMP0lo4A2o?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/WkU08pXUPKc?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2021-02-13T10:09:17Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210040\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210040-bruhmomentium69/\u0022 rel=\u0022\u0022\u003E@bruhmomentium69\u003C/a\u003E Here\u0027s what I would recommend:\n\u003C/p\u003E\n\u003Cp\u003E\nPractice makes perfect. So watch some tutorials (like the ones linked above) and then try it for yourself.  If you don\u0027t figure it out on the first try, that\u0027s fine! Watch the videos again and try again as many times as you need until you can do it.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce you\u0027ve mastered one skill, you can move on to the next - and the great thing about KSP is that many of the basic skills you learn when playing for the first time are extremely transferable to the more complex maneuvers you might want to try once you feel a bit more confident. The learning curve is steep but it flattens out as you progress and in no time you\u0027ll find yourself landing on the Mun and building space stations with your eyes closed \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2021-02-15T08:14:05Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003ETLDR: GOTO The Short Answer Below\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe art of \u0022Getting Good\u0022 is fast becoming a lost art.\n\u003C/p\u003E\n\u003Cp\u003E\nOur imagination is a huge part of the thinking process.\u003Cbr\u003E\nYour main tool at getting good is an imagination. Unfortunately, the very technology people want to \u0022Get Good\u0022 with is the same technology robbing them of the art.\n\u003C/p\u003E\n\u003Cp\u003E\nThe death of the imagination started when calculators in school became part of the thinking process.\n\u003C/p\u003E\n\u003Cp\u003E\nOne is no longer taught to visualise two apples magically vanishing from a row of five to leave three remaining apples. Now one simply presses 4 buttons to get the answer.\u003Cbr\u003E\nGoing hunting used to involve throwing a spear or shooting an arrow.\u003Cbr\u003E\nBefore the shot one would visualise the path of the spear or arrow and be able to estimate how much power was involved in making the shot.\u003Cbr\u003E\nToday over 95% of the population of the world have never even seen an animal in the wild, let alone have to hunt one.\u003Cbr\u003E\nIt is fascinating to think that so many people eat hamburgers yet in cities less than 6% have even seen a cow. They are only ever seen on TV for so many people.\n\u003C/p\u003E\n\u003Cp\u003E\nPeople used to walk from place to place and the number of possibilities of things that could be imagined might happen on the way is what gave birth to so much of human literature. That people are not having their own individual experiences any more is the main reason why there is so little in the way of new stories.\n\u003C/p\u003E\n\u003Cp\u003E\nAs children, picking up a stick or a stone and it becoming in the mind\u0027s eye an aeroplane or a motor car and imagining the forces acting on it as one flew of drove at insane speeds around the garden was the foundation of many great scientists and thinkers.\u003Cbr\u003E\nImagining who might live in that creepy old house and what they might be like became the start of many scary stories which have since become books and movies.\u003Cbr\u003E\nSpeaking of books. Reading stories means that you have to be able to see the story in your mind. Excellent training for the imagination. But today, even though there are so many more people in the world than there were, there are actually fewer people in the world today that have read an actual book than there were just fifty years ago. They see the product of the imaginations of others splashed on a screen and never use their own.\n\u003C/p\u003E\n\u003Cp\u003E\nBack when the human population didn\u0027t have so many zero\u0027s in it\u0027s number people used to imagine for their entertainment or used it as a tool for their livelihoods. It was a tool used to  invent new and wondrous things. The wheel, flight, submersibles and yes, even the first rockets. Someone had to imagine wearing the skin of an animal before clothing was invented.\n\u003C/p\u003E\n\u003Cp\u003E\nIf our children and their children never imagine what life would really be like in the low gravity of The Moon or on Mars then as adults, they will never want to go.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EThe Short Answer\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you get good? Stop looking for the short answer. Imagine. Feel. Think.\n\u003C/p\u003E\n\u003Cp\u003E\nD.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-02-15T09:47:59Z","Content":"\n\u003Cp\u003E\nThe in game tutorials were what got me through the early days of playing KSP, gradually getting an idea of what I was doing in bite-sized chunks. Try the tutorials first, that’s what they’re for, but after that you just have to learn by trial and error. There are a variety of video series etc. which can also help you, along with the stock craft files which can give you some ideas for your next design and KSPedia which has some information about a lot of things.\n\u003C/p\u003E\n\u003Cp\u003E\nUltimately it’s just like learning to ride a bike or play a musical instrument- practice, practice, practice.\n\u003C/p\u003E\n"}]}