{"TopicId":200598,"ForumId":110,"TopicTitle":"Developer Insights #8 – What Does A Game Producer Do?","CreatedByName":"Intercept Games","CreatedById":210281,"CreatedDateTime":"2021-02-11T03:00:41Z","PageNum":1,"Articles":[{"CreatedByName":"Intercept Games","CreatedById":210281,"CreatedDateTime":"2021-02-11T03:00:41Z","Content":"\n\u003Cp\u003E\nHi, friends! I’m Nate Robinson, senior producer on the KSP2 team, and I watched a \u003Cem\u003Elot \u003C/em\u003Eof \u003Cem\u003EApollo 13 \u003C/em\u003Eas a kid – to the point that I practically wore out our family’s VHS copy.\n\u003C/p\u003E\n\u003Cp\u003E\nNaturally, I always imagined myself in the role of astronauts Jim Lovell, Fred Haise, and Jack Swigert. Every 90s kid wanted to go to Space Camp, become an astronaut, and fly on the Space Shuttle, and I was no different.\n\u003C/p\u003E\n\u003Cp\u003E\nBut a funny thing happened a couple of decades later when I watched the film again as an adult: I didn’t find myself associating with the astronauts.\n\u003C/p\u003E\n\u003Cp\u003E\nI, of course, had long ago moved on from any dreams of being an astronaut myself (I blame my poor vision, but trigonometry was truly where I gave up the ghost). Instead, I found myself far more engrossed in another role – that of flight director Gene Kranz.\n\u003C/p\u003E\n\u003Cp\u003E\nKranz, spends the entirety of the film not in space, but on the ground, trying to keep on top of an ever-shifting situation. He works feverishly with the bright minds around him for clever solutions to unpredictable problems and to keep everyone focused on the important goals in front of them.\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words, he’s a game producer.\n\u003C/p\u003E\n\u003Cfigure aria-describedby=\u0022caption-attachment-6472\u0022 class=\u0022wp-caption alignnone\u0022 id=\u0022attachment_6472\u0022 style=\u0022width: 624px\u0022\u003E\u003Cimg alt=\u0022Dev-Diary-NateR-1\u0022 data-ratio=\u002253.04\u0022 width=\u0022624\u0022 src=\u0022https://images.ctfassets.net/wn7ipiv9ue5v/5gcL5exXekaLa3ZP8NWn2R/23d64938bd930a08563049267055f562/Dev-Diary-NateR-1.png\u0022\u003E\u003Cfigcaption class=\u0022wp-caption-text\u0022 id=\u0022caption-attachment-6472\u0022\u003E\nA game producer in their natural habitat.\n\u003C/figcaption\u003E\u003C/figure\u003E\u003Cp\u003E\nThe role of production in games is often tricky to define as it can vary from studio to studio and game to game, but it’s similar to that of a Product Owner or Project Manager in software development and other industries.\n\u003C/p\u003E\n\u003Cp\u003E\nAt Intercept, we have a team of three terrific* producers – including Fernanda Diaz and Paige Ketcham – whose job it is to ensure that development is running smoothly. We create and manage team processes, set goals and measure deliverables, coordinate cross-discipline efforts, prevent roadblocks, and do our best to keep everyone pointed in the same direction. Doing the job well requires strong communication, organization, multi-tasking, and leadership skills, along with a deep knowledge of the game you’re trying to make.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can imagine, it’s a lot to manage across a game with the mind-boggling size and scale of Kerbal Space Program (I have incidentally come to understand flight director Kranz’s evident chain-smoking habit), but it’s also the most rewarding job I’ve ever had. Establishing or optimizing a workflow that lets your team’s talented artists, engineers, or designers do their job even better may not \u003Cem\u003Esound\u003C/em\u003E sexy, but the reality is that it results in a much better game — and that never really gets old.\n\u003C/p\u003E\n\u003Cfigure aria-describedby=\u0022caption-attachment-6473\u0022 class=\u0022wp-caption alignnone\u0022 id=\u0022attachment_6473\u0022 style=\u0022width: 624px\u0022\u003E\u003Cimg alt=\u0022Dev-Diary-NateR-2\u0022 data-ratio=\u002255.93\u0022 width=\u0022624\u0022 src=\u0022https://images.ctfassets.net/wn7ipiv9ue5v/36ISghnBZv5s7GGExBfgjb/404ee0b95c0739bee1bdbaf99925bd44/Dev-Diary-NateR-2.png\u0022\u003E\u003Cfigcaption class=\u0022wp-caption-text\u0022 id=\u0022caption-attachment-6473\u0022\u003E\nThe KSP 2 dev team celebrates a successful milestone\n\u003C/figcaption\u003E\u003C/figure\u003E\u003Cp\u003E\nOn the KSP2 team, production’s fingerprints are everywhere. One day, we may be helping sort out the pipeline for creating new parts (What are the requirements for the part? Who will do the modelling and texturing? How many parts are needed and how much time do we have?) and another you may find us sort through bugs from a recent playtest (What is the priority of this issue? Who can help fix it on the dev team? When should it be looked at? Who replaced the Poodle engine with an actual dog?!). We are intimately involved in practically every aspect of development, which keeps us on our toes and no two days from being quite the same.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, in order to get the answers to a lot of these questions and to ensure that the whole team is on the same page, we make use of another superpower of ours: Meetings. It’s a terrifying power, one that has been known to break lesser men (\u003Ca href=\u0022https://www.kerbalspaceprogram.com/dev-diaries/developer-insights-6-kerbals-the-first-new-look/\u0022 rel=\u0022external nofollow\u0022\u003Enoted Kerbothropologist Paul Zimmer\u003C/a\u003E among them) and one we do not wield lightly. Running a meeting well is a criminally underrated skill and one that is essential to keeping a diverse, multi-discipline team moving forward hand-in-hand.\n\u003C/p\u003E\n\u003Cfigure aria-describedby=\u0022caption-attachment-6474\u0022 class=\u0022wp-caption alignnone\u0022 id=\u0022attachment_6474\u0022 style=\u0022width: 624px\u0022\u003E\u003Cimg alt=\u0022Dev-Diary-NateR-3\u0022 data-ratio=\u002251.44\u0022 width=\u0022624\u0022 src=\u0022https://images.ctfassets.net/wn7ipiv9ue5v/4OVok7m6nA9Og0PxCDUldb/b1d3e85c8e7c1c21a788d671c9a3eac8/Dev-Diary-NateR-3.png\u0022\u003E\u003Cfigcaption class=\u0022wp-caption-text\u0022 id=\u0022caption-attachment-6474\u0022\u003E\nThe normal dev-team response to me scheduling a meeting\n\u003C/figcaption\u003E\u003C/figure\u003E\u003Cp\u003E\nPerhaps our most important responsibility, however, is managing the team’s short- and long-term tasks. Like much of the software world these days, the KSP2 team runs on a version of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Scrum_(software_development)\u0022 rel=\u0022external nofollow\u0022\u003EScrum\u003C/a\u003E. Every three weeks, we gather our teams to review the previous cycle’s work, discuss how to improve our processes, and then get alignment on what the goals are for the next three weeks. There’s a lot of overhead involved in keeping a team of 30\u002B people busy, so we are constantly juggling a backlog of tasks in JIRA, our task-tracking software, so that the tasks are correctly prioritized and groomed (read: documented and clear).\n\u003C/p\u003E\n\u003Cp\u003E\nFor long-term planning, we build and maintain a development roadmap. A roadmap is simply a development schedule that lays out major milestones and when game features will be built. Some sections of the team — the part and planet artists, for instance — have their own roadmaps, but all development efforts are coordinated around a central roadmap for the entire project that is constantly being refined with adjustments to specific features and new estimates from the team itself. Even NASA’s Artemis team has a roadmap:\n\u003C/p\u003E\n\u003Cfigure aria-describedby=\u0022caption-attachment-6475\u0022 class=\u0022wp-caption alignnone\u0022 id=\u0022attachment_6475\u0022 style=\u0022width: 561px\u0022\u003E\u003Cimg alt=\u0022Dev-Diary-NateR-4\u0022 data-ratio=\u002256.33\u0022 width=\u0022561\u0022 src=\u0022https://images.ctfassets.net/wn7ipiv9ue5v/zphgrf3PboX07aH1Yuchl/0ef1d9bd2dc5d61944e893629435252a/Dev-Diary-NateR-4.png\u0022\u003E\u003Cfigcaption class=\u0022wp-caption-text\u0022 id=\u0022caption-attachment-6475\u0022\u003E\nThough, where they’re going, they won’t need roads\n\u003C/figcaption\u003E\u003C/figure\u003E\u003Cp\u003E\nWe talk a lot about the roadmap on the production team because everything stems from it. No games are made by accident and one as complicated as Kerbal Space Program requires a \u003Cem\u003Elot \u003C/em\u003Eof forward planning to ensure that our rocket leaves the launchpad on time and in one piece.\n\u003C/p\u003E\n\u003Cp\u003E\nIn future dev diaries, I hope we can give more insight into different aspects of production work as I barely scratched the surface of what is involved in this role. We didn’t get to cover our coordination with the marketing team or Squad, our instinctual need to document \u003Cem\u003Eeverything\u003C/em\u003E, or our unshakable convictions as to why Google Docs is a poor substitute for traditional Excel sheets! But I’ll just have to leave you with that tantalizing teaser — nothing gets people more excited for a dev diary than promises of spreadsheets!\n\u003C/p\u003E\n\u003Cp\u003E\n… or maybe that’s just a producer’s thing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*: I’m admittedly biased\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.kerbalspaceprogram.com/dev-diaries/developer-insights-8-what-does-a-game-producer-do/\u0022 rel=\u0022external nofollow\u0022\u003EView the full article\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Mikenike","CreatedById":196142,"CreatedDateTime":"2021-02-24T00:22:17Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210281-intercept-games/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210281\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210281-intercept-games/\u0022 rel=\u0022\u0022\u003E@Intercept Games\u003C/a\u003E, nice to see you around, and nice to hear Nate is actually going to give us road maps, updates on how the game is going.\n\u003C/p\u003E\n"},{"CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2021-02-24T06:58:55Z","Content":"\n\u003Cp\u003E\nWoo hoo! Like the reference to the KSP 1.0 launch Traler! Now it would be cool if the same animation was up listed for the release of KSP2 jspust a little nicer.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-10T16:59:16Z\u0022 title=\u002203/10/2021 04:59  PM\u0022 data-short=\u00223 yr\u0022\u003EMarch 10, 2021\u003C/time\u003E by Dr. Kerbal\u003C/strong\u003E\n\u003Cbr\u003EWhy did autocorrect spell Woo hoo as Woo Boo?\n\u003C/span\u003E\n"},{"CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2021-04-14T22:08:33Z","Content":"\n\u003Cp\u003E\nWhen’s the ninth coming?\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-04-17T07:46:35Z","Content":"\n\u003Cp\u003E\nEvery time I see this post, all I can think is cat wrangler.\n\u003C/p\u003E\n"}]}