{"TopicId":200649,"ForumId":109,"TopicTitle":"Colony Sizes and Evolution","CreatedByName":"B.Riches2500","CreatedById":210329,"CreatedDateTime":"2021-02-25T21:31:25Z","PageNum":1,"Articles":[{"CreatedByName":"B.Riches2500","CreatedById":210329,"CreatedDateTime":"2021-02-25T21:31:25Z","Content":"\n\u003Cp\u003E\nAs we have seen in trailers and have been told by developers, the colonies that can be built will be huge. As far as I know, all the ones we’ve seen so far implement a full \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E and launchpad. What I’d like to know, either from your thoughts or from developers themselves, is can we build small communities of say 12 Kerbals like we do now on KSP. No \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, no huge scale production sites, just a simple little base for a few Kerbals to stay.\n\u003C/p\u003E\n\u003Cp\u003E\nWould that be something we can do in the base assembly editor? Or would bases like that have to be built the traditional way of just landing them ourselves?\n\u003C/p\u003E\n\u003Cp\u003E\nI just feel that these small, initial outposts make sense for us to gradually colonise other planets and moons, and would be a good starting place to upgrade and eventually go from a base of 6, to 30, to 100, to 1000, etc. over a reasonable period of time, and with that also go from a rough landing site, to a solid one, to a \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, to a Runway. Or we could keep it as a 6-12 Kerbal community forever if we choose to, and have little bases like we do on KSP currently just for the fun of it.\n\u003C/p\u003E\n\u003Cp\u003E\nJust a few things I’ve been thinking of for a while.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-02-25T22:59:25Z","Content":"\n\u003Cp\u003E\nYes, you can build small colonies using the items you land on a planet. You should be able to dock the parts together the old fashioned way, or use the BAE with the landed parts. These are what Nate is referring to as \u0022phase one\u0022 colonies.\n\u003C/p\u003E\n"}]}