{"TopicId":20072,"ForumId":36,"TopicTitle":"fast testing of plugins","CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2012-09-23T19:59:33Z","PageNum":1,"Articles":[{"CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2012-09-23T19:59:33Z","Content":"\n\u003Cp\u003EI play around with the plugin developement for KSP and I wonder if there is a faster method for testing the plugins when coding. \u003C/p\u003E\u003Cp\u003ERight now I use a post build event from visual studio to copy the DLL and a shortcut pointing on a \u0022lighter\u0022 KSP (I removed several parts for faster loading)\u003C/p\u003E\u003Cp\u003EEven with this, it take a long time to wait : squad credit, loading parts, start a game, resume game, click, VAB, assemble ship, lauchpad, TEST !\u003C/p\u003E\u003Cp\u003EIt can be very long and boring when we compile often, any tip about this ? Maybe a launch parameter for the exe to skip some repetitive task ?\u003C/p\u003E\n"},{"CreatedByName":"tjitte","CreatedById":38033,"CreatedDateTime":"2012-10-02T19:02:13Z","Content":"\n\u003Cp\u003Ethe only thing missing from your setup is to set the build path directly to the ksp plugin folder, and just allot of patience,\u003C/p\u003E\n"},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-10-02T19:39:40Z","Content":"\n\u003Cp\u003E\u0026gt;tjitte\u003C/p\u003E\u003Cp\u003EHe already has auto-copying done in a nicer way.\u003C/p\u003E\u003Cp\u003EThere\u0027s no way to do that faster, I usually take that time to check the IRC.\u003C/p\u003E\n"},{"CreatedByName":"tjitte","CreatedById":38033,"CreatedDateTime":"2012-10-02T20:32:31Z","Content":"\n\u003Cp\u003Ethey should realy add some kind of part and plugin re-loading system for modders in ksp...\u003C/p\u003E\n"},{"CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2012-10-03T16:33:57Z","Content":"\n\u003Cp\u003EFor information, I found another way to test my plugin : using Unity.\u003C/p\u003E\u003Cp\u003EThe only problem is I cannot load the KSP C# assembly DLL in it (a strange error happen), so I have no access to KSP class.\u003C/p\u003E\u003Cp\u003EIn my case it\u0027s not important because I\u0027m creating something that only use unity objects. When all my functions will be ready I will switch to KSP for coding the rest of things that need it.\u003C/p\u003E\n"}]}