{"TopicId":200992,"ForumId":70,"TopicTitle":"deployable radiator specs config","CreatedByName":"si2504","CreatedById":203262,"CreatedDateTime":"2021-03-13T21:16:00Z","PageNum":1,"Articles":[{"CreatedByName":"si2504","CreatedById":203262,"CreatedDateTime":"2021-03-13T21:16:00Z","Content":"\n\u003Cp\u003E\nHi, I\u0027m trying to figure out how/where radiators thermals are configured. In particular the Squad \u0022Thermal Control System - Medium\u0022 deployable radiator. I have gone through the .cfg file for the rad in the Squad folder, but I can\u0027t figure out how the radiator\u0027s specs are calculated. The max temp one is obvious, but the one\u0027s that aren\u0027t are the \u0022Core heat Xfer\u0022 and \u0022max cooling\u0022 configurations.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m having an issue with a ship where the Ion engines, a fission reactor and the radiators themselves just keep overheating. I took all of the parts Xfer values into consideration and attached a number of radiators that in specs should be able to cope with the heat production of the said parts. Now as I understand it, deployable radiators can \u0022soak up\u0022 heat production of a part no matter where it is placed on a vessel, but fixed one\u0027s have to be close to a part that require cooling. I would really like to learn how these radiators work and are configured in the settings so that I can better understand them. Any help would be great. A couple of attached pictures of my craft I built in orbit that will serve as a long distance vessel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uGzr6yL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uGzr6yL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vdA2wPY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vdA2wPY.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-14T08:21:15Z","Content":"\n\u003Cp\u003E\nLooks like you have Near Future stuff going on there, in which case- do you also have System Heat installed? If so you’ll need to set up the cooling loops etc., which I haven’t actually used before so check the System Heat forum thread to find out how that works. If not, just add more/bigger radiators. Sometimes radiators can get stuck in a weird loop where they keep trying to cool each other and end up all maxed out at 100%, usually a bit of time warping can shift the excess heat especially if you turn off the big heat sources like the fission reactor.\n\u003C/p\u003E\n"}]}