{"TopicId":20104,"ForumId":16,"TopicTitle":"3 person pod to another planet and back.","CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-09-23T23:24:35Z","PageNum":1,"Articles":[{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-09-23T23:24:35Z","Content":"\n\u003Cp\u003Eim finding this really difficult with the default parts.... especially without a proper docking system\u003C/p\u003E\u003Cp\u003Eits either too laggy due to the 300\u002B required beams for the larger parts\u003C/p\u003E\u003Cp\u003Eor it falls apart on the launch pad...\u003C/p\u003E\n"},{"CreatedByName":"princessjane","CreatedById":30815,"CreatedDateTime":"2012-09-23T23:28:00Z","Content":"\n\u003Cp\u003Eyou can try the ship in my sig. it is on the laggy side at liftoff but once you get into space has little to no lag. My issue is actually getting into the sphere of influence.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-09-23T23:29:26Z","Content":"\n\u003Cp\u003E[ATTACH]33411[/ATTACH]Honestly, you dont need that big of a rocket. ive included my IRS wich is only 1 man, however its a demonstration of how you dont need that much parts. tip: Boosters are good because they are light but give good thrust, and you always want a powerfull first stage, as once youve cleared the atmosphere, it accelerates much faster.\u003C/p\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2012-09-23T23:29:54Z","Content":"\n\u003Cp\u003ECo\u0027mon!You can\u0027t land on another planet with 3 man pod?I\u0027m doing grand interplanetary tours!\u003C/p\u003E\n"},{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-09-23T23:34:09Z","Content":"\n\u003Cp\u003Efor the IRS craft, that landing stage is REALLY small. are you telling me that has the ability to make it off the surface of a planet all the way back?\u003C/p\u003E\u003Cp\u003Ethis is what i dont understand. without docking, ships need to be as big as they were to get to the planet (EVE for example) to take off and go all the way back to kerbin.\u003C/p\u003E\n"},{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-09-23T23:35:01Z","Content":"\n\u003Cp\u003Eits not about landing, thats easy, but i dont like to do missions knowing i wont get them BACK. i just find it unrealistic i dont know...\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2012-09-23T23:41:06Z","Content":"\n\u003Cp\u003EWhile it\u0027s hard to comment without seeing an example of the rocket you\u0027re using...\u003C/p\u003E\u003Cp\u003EThe general trick is to optimise the hell out of your launch system: Efficient fuel crossfeed, using a pair of X2 symmetry droptanks/boosters rather than a single X4 set so you can drop one of them earlier...use as few struts as possible and have them in critical areas to reduce the risk of failure...and then try to get a lot of fuel up, along with as little propulsion as you can get away with. Unless you want a return mission, which needs both more fuel AND more thrust than a one-way mission.\u003C/p\u003E\u003Cp\u003EBasically, the problem with the insane lag KSP has on launch is down to two things: Rendering the land and the wierd ocean underneath it (which is annoying, but apart from turning everything down/custom configs, not much can be done), and physics simulation. Physics is the really big one with large rockets...and to cut back on physics lag/explosions, you want \u003Cem\u003Eas few parts as is physically possible\u003C/em\u003E, while still having the required strength to get off the pad. So cut back on winglets, struts that haven\u0027t joined properly, struts that aren\u0027t attached to things that were previously breaking off, struts that aren\u0027t along the direction of stressing forces. Connector pieces as well (most of them are dead weight anyway). Same goes for the ship you\u0027re carrying up: The lighter it is, the less the rest of your rocket needs to do to get it up, and the fewer parts it needs to have.\u003C/p\u003E\u003Cp\u003EPausing the game a few times while physics is turning itself on sometimes also helps for me. I\u0027ve had very similar issues with larger rockets falling apart/exploding because the physics is glitching...ultimately it took me about an hour to work out how to get a rocket fixed to the point where it could lift off (I cut a LOT of struts,put new ones in the places they were 100% needed and redesigned the rocket to not need the others, and I paused the game while it was rendering the launch area, then again when physics had just been enabled.), and it worked just fine (apart from me missing my destination from a mistimed burn).\u003C/p\u003E\u003Cp\u003EEdit: Summary= Optimise the hell out of things, and see how it goes. And try your first return mission as a flyby/orbit mission, see what fuel you\u0027ve got, then try a return. THEN worry about a return landing.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-09-23T23:42:29Z","Content":"\n\u003Cp\u003EOh right, i didnt mean for it to get back.... i see what you mean now. try ORDA or erkles docking mod. they work fine.\u003C/p\u003E\n"},{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-09-23T23:46:38Z","Content":"\n\u003Cp\u003Ewell here is my idea for a 3 seated lander for another planet....\u003C/p\u003E\u003Cp\u003Ei DOUBT it would have enough fuel to come back even if i landed with full fuel\u003C/p\u003E\u003Cp\u003Eand the thing is so heavy getting it up on another stage is impossible without lag\u003C/p\u003E\u003Cp\u003Eits a shame, i spent alot of time on it too.\u003C/p\u003E\n"}]}