{"TopicId":201089,"ForumId":16,"TopicTitle":"Tiny unKerballed probe into LKO? Stability trouble over 25km.","CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-18T06:17:43Z","PageNum":1,"Articles":[{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-18T06:17:43Z","Content":"\n\u003Cp\u003E\nI\u0027m trying the Unkerballed Start tech tree along with the Career Evolution contract pack, all of which emphasizes flying unmanned probes for a long time.  My mod list is pretty short otherwise: OPM, \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E, Final Frontier.  It\u0027s been a while since I played KSP, but I can\u0027t believe the trouble I\u0027m having getting an unmanned satellite into orbit.  I\u0027ve managed suborbital flight and recovery fine.  I\u0027ve upgraded the launch pad once, so I can use up to 18t.  I\u0027m in Career mode on normal default settings.  I\u0027ve got Thumpers unlocked and the Reliant and Swivel, but those rockets tend to end up too heavy.  Plus I\u0027m short on cash.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027ve been trying engines I\u0027ve never used before -- Spiders and Twitches, stacked on tiny little Oscar fuel tanks.  I\u0027m trying to launch the first Octo probe.  For just 4 or 5000 funds, three stages with these little guys gets me 3600 delta V or so, which is pretty cool.  The Twitches have plenty of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to get off the launchpad.  It\u0027s all very cute and small!  I love the idea of putting teeny little sats like this in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nExcept that I can\u0027t fly the darn thing.  The first stage is fine; I easily get to 10,000m and can start a gravity turn, trying to keep speed under 300.  Those little Twitches have nice gimballing.  Plus I have the small basic fin on the bottom of stages 1 and 2, which makes the thing look like something out of Ray Bradbury.  (Sorry, I forgot to take a screenshot. I can post one tomorrow if need be.) The second stage, with Spiders, starts okay too, but I gradually lose control authority until the thing starts spinning.  Maybe I should try Twitches here too?  Maybe get rid of fins on stage 2?  I\u0027ve tried putting the smallest reaction wheel below the octo, above it; I\u0027ve tried multiple reaction wheels.  Maybe I need no reaction wheels at all, or to turn down torque on it?  One thing I haven\u0027t done is fuss with how fuel drains, because I can\u0027t remember how to do it.  Eventually the thing just starts spinning wildly and I lose control.\n\u003C/p\u003E\n\u003Cp\u003E\nAny advice? Thanks in advance.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-18T08:38:03Z","Content":"\n\u003Cp\u003E\nSounds like a weight balance issue to me, you should try setting the fuel tanks to drain from bottom to top which will keep the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E as far forward as possible. If you have the stack-mounted Ant or Spark engines unlocked, they would be a better option than using multiple radially mounted engines to reduce drag and mass.\n\u003C/p\u003E\n\u003Cp\u003E\nHave you tried using a 1.25m lower stage then a 0.625m second stage? It was a pretty common thing to do for real sounding and early orbital rockets and if you can squeeze inside the mass limits (and have some form of tapering part to bridge the size difference e.g. FL-A10 adapter or a fairing) that might make it easier to reach space than relying on the relatively inefficient smaller parts. You could also try using a small \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E as your first stage as they pack a lot of punch for their size.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-03-18T09:16:03Z","Content":"\n\u003Cp\u003E\nYou mean spinning or flipping?\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s spinning (like, you know, a spinner) then it\u0027s probably something wrong with the fins, picture would be nice.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s flipping, then I would blame your approach to gravity turn (or more like gravity slap really, looking at how you describe it). Low speed, late turn is a thing of the past, over five years now. It may still work while the rocket is long, with first stage still attached but then it often goes sideways, literally. It\u0027s now more like a 1.2twr on the pad, 28° at 5km, 45° at 10k, 70° at 20km and almost horizontally at 40km. Don\u0027t go too far from prograde marker, turn on aero overlay and don\u0027t let the red arrow (drag) appear anywhere else than at the bottom of the rocket.\n\u003C/p\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2021-03-18T09:46:54Z","Content":"\n\u003Cp\u003E\nIts probably aerodynamics, at 25km trying to reach orbit you ought to be going pretty fast, and you\u0027re still somewhat in the atmosphere. That stages 1 and 2 are okay means you have the drag balanced okay on those (or that its just a bit slower).\n\u003C/p\u003E\n\u003Cp\u003E\nYou didn\u0027t include a pic but.....do you have a nosecone? The idea is, you want it slippery at the front and draggy at the back. If you don\u0027t have the available parts yet so that its a bit draggy at the front, sometimes you can deliberately make it \u0022a bit draggy\u0022 at the back too, it will be less efficient but it will make it to orbit (given enough fuel).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso sounds crazy......but if it starts flipping, turn off the throttle, wait (it will still have upwards acceleration), get it back to pointing the right way and put the throttle back on. 25km is kinda near the edge of where aerodynamics start to not matter any more...and you might just squeak it into orbit that way. Or make the 1st stage \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E higher, its inefficient too but it will \u0022kick it\u0022 up higher for the 3rd stage.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, 1.2 sounds lovely and efficient etc but sometimes you want a bit more, it will trade drag with gravity losses though - all the time you are suborbital, you are wasting (or need for gravity losses...) fuel/energy. The higher the overall \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, the less time is spent suborbital so the lower the \u0022gravity losses\u0022 (but the higher the drag losses).\n\u003C/p\u003E\u003Cp\u003E\nETA you\u0027ll need a reaction wheel - the small one should be okay for a low-weight satellite/rocket.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-18T16:11:37Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/199902-jimmymcgoochie/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022199902\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/199902-jimmymcgoochie/\u0022 rel=\u0022\u0022\u003E@jimmymcgoochie\u003C/a\u003EThanks for your reply.  I have indeed unlocked the Ant, though I don\u0027t think I have the Spark; I\u0027ll play around with the Ant.  I did indeed have a successful suborbital flight with a 1.25m lower stage, so maybe I should go back to that.  But I love the idea of getting to orbit with the smallest parts possible, just because.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  How do I drain fuel tanks from bottom to top?  When I click on them in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, I don\u0027t see an option for that.  Maybe I need fuel lines?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150811-the-aziz/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150811\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150811-the-aziz/\u0022 rel=\u0022\u0022\u003E@The Aziz\u003C/a\u003EYou\u0027re right, I\u0027m flipping, not spinning.  And yeah, I haven\u0027t played KSP for 5 years, so I have been using the \u0022old\u0022 gravity turn. I\u0027ll try your approach.  I like the idea of a lower launch \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.  Er, I didn\u0027t even realize there was an \u0022aerodynamic overlay\u0022; it seems it\u0027s new since 1.0.1.  F12 key.  I\u0027ll try that.  After rebinding it so it doesn\u0027t conflict with screenshots.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208135-paul_c/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022208135\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208135-paul_c/\u0022 rel=\u0022\u0022\u003E@paul_c\u003C/a\u003EOK, I was wondering whether it could be aerodynamics at 25K altitude, but it sounds like it can.  I do indeed have a nosecone -- the rocket is pointy at top with big old fins on the bottom of stage 1 and 2.  I\u0027ll try the aero overlay to learn more about what\u0027s happening.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThanks to all of you for your help.  I\u0027ll report back later today! Maybe this time with screenshots.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2021-03-18T17:26:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942034\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616083897\u0022 data-ipsquote-userid=\u0022116542\u0022 data-ipsquote-username=\u0022Mister Spock\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Mister Spock said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  How do I drain fuel tanks from bottom to top?  When I click on them in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, I don\u0027t see an option for that.  Maybe I need fuel lines?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTurn on \u0022advanced tweakables\u0022 then set the priority on the right-click context menu, which will have a bunch more options available.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-18T17:27:16Z\u0022 title=\u002203/18/2021 05:27  PM\u0022 data-short=\u00223 yr\u0022\u003EMarch 18, 2021\u003C/time\u003E by paul_c\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-18T17:32:07Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/116542-mister-spock/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022116542\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/116542-mister-spock/\u0022 rel=\u0022\u0022\u003E@Mister Spock\u003C/a\u003E You should see a \u0022fuel priority\u0022 value with a number and \u002B/- buttons. Fuel will drain from the highest numbered tank to the lowest so if your stage has three tanks, set the bottom tank to e.g. 11, the second to 10 and the top tank to 9 so they\u0027ll drain from bottom to top. You might have to enable \u0022advanced tweakables\u0022 in the main menu settings to see this option (spoiler: you really want it turned on all the time, there are several very useful extra features that get enabled).\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I remember, the radially mounted engines e.g. Twitch and Spider are usually less efficient than the axially (stack) mounted engines e.g. Spark and Ant but have bigger gimbal angles.\n\u003C/p\u003E\n\u003Cp\u003E\nScreenshots would definitely help though.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-19T02:55:40Z","Content":"\n\u003Cp\u003E\nThanks for your further replies.  I\u0027m thinking my issue isn\u0027t aerodynamics so much as reaction wheel.  I followed your suggestions and changed engine drain flow, used Ants inline, etc.  This time I got into space easily, but once there, the slightest touch on the keyboard sends the navball spinning.  I tried decreasing the reaction wheel\u0027s control authority to 1%, and that made things less bad, but still not controllable.  I tried disabling torque and that didn\u0027t help.  Using the alt key to make movements less drastic seemed to make no difference at all.  I was flying a simple two-stage rocket, first stage with Spiders that got me out of the atmosphere, and the second stage with an Ant.  Should I remove the reaction wheel?  Er, what exactly does it do, anyway?  I\u0027ve never fully understood \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E or reaction wheels. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I worry the Ant is underpowered for circularizing the orbit, as it worked very slowly.  But putting spiders or other radial-mounted engines on an upper stage does complicate aerodynamics.  \n\u003C/p\u003E\n\u003Cp\u003E\nHere are a couple screenshots.  First, a curiosity about the Ant -- how does one close the gap between the ant and the next stage?  Normally, a vertical decoupler adds a metal shroud around the engine.  But the Ant doesn\u0027t do that.  It looks like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022evQ1NHg.jpg\u0022 src=\u0022https://i.imgur.com/evQ1NHg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo I tried covering it with these newfangled procedural fairings that weren\u0027t in the base game when I played.  A bit top heavy, but the drag indicators were red only at the bottom.  Here\u0027s an example in early flight.  Note, though, that even here I\u0027m having trouble pointing the rocket in the correct (eastward) direction.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022lqvAGD6.jpg\u0022 src=\u0022https://i.imgur.com/lqvAGD6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to try removing the reaction wheel altogether and going again. But I\u0027ve had this problem with every unmanned flight I\u0027ve done.  It\u0027s a bummer, because the whole point of the mod I\u0027m playing is to visit the entire solar system with probes before flying manned.  Any further suggestions?\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-19T05:02:25Z","Content":"\n\u003Cp\u003E\nUpdate: I got that little two-stage rocket into orbit -- with lots of fuel to spare!  Kind of a thrill!  I\u0027ve achieved orbit countless times before, but never with a tiny unmanned rocket like this.  And I don\u0027t think I\u0027ve ever used the Spider or Ant before. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, total \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E was 3,450 m/s.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nRnhPwW.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/nRnhPwW.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat said, I\u0027m still having big problems with control.  For this flight, I just removed the reaction wheel altogether.  I guess the Octo has its own \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E system, because I can still cycle among \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E, Pilot, and some other setting.  Everything  was fine until I got to space; then the navball drifted constantly.  At least it didn\u0027t jump around madly, and I kept the craft from tumbling end-over-end.  It helped marginally to keep control authority pretty high.  \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E has to be on too.  I was able to point it in a wobbly prograde direction and achieve a quite high orbit, as you can see from this shot.  But in this shot, the probe was tumbling slowly end-over-end. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EuCrBjL.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/EuCrBjL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe itself is rather useless.  It has almost no payload other than 4 basic solar panels.  I took out the antenna, batteries and science experiments so I could concentrate on the basics of flight.  But for a cost of 3,156 funds, I completed two big contracts worth many times that.  So \u0022Tiny 1\u0022 has done its job.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, eventually I will mark this thread as \u0022answered,\u0022 but before I do, I invite anyone to chime in to help me fix my problems controlling probes.  I had this problem with the Stayputnik, too.  Am I missing some basic setting that prevents them from spinning around?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-19T05:21:56Z\u0022 title=\u002203/19/2021 05:21  AM\u0022 data-short=\u00223 yr\u0022\u003EMarch 19, 2021\u003C/time\u003E by Mister Spock\u003C/strong\u003E\n\u003Cbr\u003EMinor syntax edits. Adjusted funds figure.\n\u003C/span\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2021-03-19T08:14:28Z","Content":"\n\u003Cp\u003E\nHaving a fairing has a big effect on aerodynamics. Don\u0027t forget, for a small rocket, its a significant weight though, so deploy it at the optimal time (which is, when the penalty in control/speed from aerodynamics is less than the weight penalty) - around 40-50km is a good guide there.\n\u003C/p\u003E\n\u003Cp\u003E\nA rocket is controlled by 3 things: reaction wheel; \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E; engine gimballing. Its possible that engine gimballing has complete control over it - but only while engines are running. Reaction wheels convert electricity into control movements, and are needed once off the throttle. For orbital positioning, its very useful to be able to point it a direction with no throttle at all (for precision burns) so I\u0027d always recommend at least some reaction wheel, although its interesting you got it into orbit without!\n\u003C/p\u003E\n\u003Cp\u003E\nFull \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E controls is a bug in the latest version of KSP. It should be that OCTO has \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, while the HECS gets prograde/retrograde controls too (I think....but we\u0027re going back a few versions now!)\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-19T08:58:09Z","Content":"\n\u003Cp\u003E\nYou don’t need a dedicated reaction wheel on a probe that small- each probe core (except the Stayputnik, OKTO2 and RoveMate) has one built in that is more than sufficient to control a smallish probe.\n\u003C/p\u003E\n\u003Cp\u003E\nYou’re probably running out of electricity which is why the probe is tumbling; probe cores have puny batteries and the smaller engines don’t tend to have any power generation capacity when they’re running so you could easily run out of power especially with a big, power hungry reaction wheel to use it up. If you have the probe inside a fairing you can ditch the nosecone and put two solar panels on the top of your probe, then point that at the Sun in orbit to recharge the batteries; you can also enable ‘hibernate in warp’ on the probe core to make it automatically go into hibernate mode and save a lot of power that way.\n\u003C/p\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2021-03-19T10:39:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942306\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616144289\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou don’t need a dedicated reaction wheel on a probe that small- each probe core (except the Stayputnik, OKTO2 and RoveMate) has one built in that is more than sufficient to control a smallish probe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nApologies, I didn\u0027t realise some of the probe cores had a small reaction wheel included - if that\u0027s the case, then no, you won\u0027t need the additional one.\n\u003C/p\u003E\u003Cp\u003E\nETA In theory, you don\u0027t need 4 solar panels either. It would be a brave soul who took 1 fixed panel. 2 is marginal, 3 guarantees solar power so long as its not nose or tail to the sun (leave it in normal/antinormal - pink marker - to ensure that). If you get to the stage of unlocking the deployable panels then 2 of these will 100% guarantee sun (1 will be 99% and I\u0027ve seen it obscured!).\n\u003C/p\u003E\n\u003Cp\u003E\nIf the worst happens and you end up in the chicken-egg scenario of out of power, and no power/control to command the controller to turn it, timewarp ahead about 1/4 year and the sun will have shifted round with respect to the craft and it should burst into life again.\n\u003C/p\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2021-03-19T11:08:42Z","Content":"\n\u003Cp\u003E\nYou could use an engine with gimbaling, e.g. the Spark, or the Caravel from the RLA Reborn part mod pack.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-19T11:28:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942331\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616152122\u0022 data-ipsquote-userid=\u0022196199\u0022 data-ipsquote-username=\u0022VoidSquid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, VoidSquid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou could use an engine with gimbaling, e.g. the Spark, or the Caravel from the RLA Reborn part mod pack.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI second this- RLA has a lot of small parts, from fuel tanks to mini NERVs to electric monopropellant thrusters with 4-figure \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, so if you’re doing a lot of small probes and such then it’s a good addition; not sure if it’s configured for the alternate tech tree you’re using though. Restock\u002B also has some additional fuel tanks in the 0.625m size range and Luciole adds a good collection of great-looking parts in this area too.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-19T16:33:55Z","Content":"\n\u003Cp\u003E\nThanks for your replies. That RLA mod does have a lot of cool-looking probe cores and engines.  I\u0027ll probably give it a try.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to be clear, I do have some control over the probe throughout the flight and right now, as it orbits with the engines off.  (I have toggled on hibernation mode for now.)  It responds to commands to tilt this way or that.  In fact, I can spin it quite fast if I want.  But I just can\u0027t get the thing to hold a particular attitude, which is the most important thing -- if you can\u0027t hold a steady attitude, you can\u0027t burn in a particular direction.  Maybe I have enough electricity to rotate it but not enough power to make it hold still?  \n\u003C/p\u003E\n\u003Cp\u003E\nOn electricity: I have 4 solar panels evenly spaced around the Octo, as my screenshot indicates.  So it\u0027s getting some power.  But I did NOT pack batteries at all.  Is this perhaps the problem?  Are solar panels useless without batteries?  \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I\u0027m still curious why the Ant isn\u0027t covered by the stack decoupler, the way most big liquid-fuel engines are.  The resulting \u0022gap\u0022 is depicted in my first photo above.  Thanks!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-19T16:36:10Z\u0022 title=\u002203/19/2021 04:36  PM\u0022 data-short=\u00223 yr\u0022\u003EMarch 19, 2021\u003C/time\u003E by Mister Spock\u003C/strong\u003E\n\u003Cbr\u003EAdded question about the Ant decoupler.\n\u003C/span\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-03-20T07:20:13Z","Content":"\n\u003Cp\u003E\nFirst off, probe cores carry a very tiny amount of electric charge, so they can go dead after few minutes of no sunlight. Or even faster after moving them around too much. Single radial battery is more than enough, does not add a lot of mass, fits with the stack and easily protects from running out of juice.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, your pictures show that you don\u0027t use \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E. It should be always on. (The only core that does not have that feature is stayputnik, but I see you\u0027re already past that) that could also explain unplanned movements.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-20T07:20:50Z\u0022 title=\u002203/20/2021 07:20  AM\u0022 data-short=\u00223 yr\u0022\u003EMarch 20, 2021\u003C/time\u003E by The Aziz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-03-20T16:34:23Z","Content":"\n\u003Cp\u003E\nyes, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E won\u0027t help if you leave it turned off. or perhaps you have it on, but then the probe goes in shadow, the batteries run out, and \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003Esas\u003C/abbr\u003E deactivates.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, you should add a battery. the basic one is a bit bad for aerodinamics, but there is the stackable circular one that you can put between the body and the nose cone for only 10 kg.\n\u003C/p\u003E\n\u003Cp\u003E\nthen the octo does not have the functionality to hold directions. it will keep your probe still, but it will not point to any specific direction. you have to direct it manually. you said your probe was drifting, right? i assume you were trying a prograde burn, started with the prograde indicator there, and then the probe gradually shifted away from the indicator? in this case it\u0027s not the probe drifting, it\u0027s the prograde direction drifting. as you circle the planet, where is prograde changes. so yeah, you will have to make the manuever by hand holding the direction and compensating for that.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, i also see in the picture that the probe icon on top is in yellow. which means it has somewhat limited functionality. it\u0027s in the sun, so it has power. perhaps it is still hybernated?\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-20T17:56:29Z","Content":"\n\u003Cp\u003E\nThanks for your replies.  I\u0027ll check whether I have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E on.  Yes, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0022 rel=\u0022\u0022\u003E@king of nowhere\u003C/a\u003E, it\u0027s possible the craft is in hibernation mode in that last screenshot.  I was toggling hibernation on and off to see how it works.  I\u0027ve never used it before.\n\u003C/p\u003E\n\u003Cp\u003E\nBy \u0022drifting,\u0022 I mean the navball wanders around even with the engines off, in space.  It doesn\u0027t want to stay still.  Again, I may have inadvertently disabled \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E.   \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if my \u0022slight adjustment\u0022 keys are working.  On Windows, by default that\u0027s alt plus the direction key (WASD), I think.  My alt key can be a little unreliable, so maybe I should bind these keys to something else.  In previous iterations of KSP I had no problem orienting probes, burning in various directions, etc -- I had dozens of satellites.  So I\u0027m starting to wonder if there\u0027s just something wonky with my keyboard.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m about to try a new contract, to orbit and return to earth, so this time I\u0027ll add a battery and a parachute.  Alas, I do not yet have that nice circular battery.  I\u0027m stuck with the big clunky boxy thing.  Maybe I can put it on top of the Octo and cover it all with a nose cone.  I tried mounting 2 or 3 radially on the rocket, but the batteries dramatically increased mass.  For a tiny little probe like this, every bit of payload matters!  Even adding one battery and one parachute may require a change in the rocket.  I do see there are other tiny engines with more thrust, so I\u0027ll play around with those.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks again for all your help.  Once I figure out how to operate my probes correctly, which I hope is soon, I\u0027ll mark this thread \u0022answered.\u0022  Not quite there yet, though!  I appreciate all of your input a lot.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-20T17:57:45Z\u0022 title=\u002203/20/2021 05:57  PM\u0022 data-short=\u00223 yr\u0022\u003EMarch 20, 2021\u003C/time\u003E by Mister Spock\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-03-20T18:00:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942887\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616262989\u0022 data-ipsquote-userid=\u0022116542\u0022 data-ipsquote-username=\u0022Mister Spock\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Mister Spock said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m about to try a new contract, to orbit and return to earth, so this time I\u0027ll add a battery and a parachute.  Alas, I do not yet have that nice circular battery.  I\u0027m stuck with the big clunky boxy thing.  Maybe I can put it on top of the Octo and cover it all with a nose cone.  I tried mounting 2 or 3 radially on the rocket, but the batteries dramatically increased mass.  For a tiny little probe like this, every bit of payload matters!  Even adding one battery and one parachute may require a change in the rocket.  I do see there are other tiny engines with more thrust, so I\u0027ll play around with those\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA battery looks big, but it\u0027s just 5 kg.\n\u003C/p\u003E\n\u003Cp\u003E\na parachute, on the other hand, is no less than 100 kg - unless there is some modded lighter version.\n\u003C/p\u003E\n\u003Cp\u003E\non a probe so small, it may actually be more convenient to mount a more powerful engine and rocket brake.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-20T18:03:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942889\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616263208\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\non a probe so small, it may actually be more convenient to mount a more powerful engine and rocket brake.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, I hadn\u0027t though of that at all!  That would be really fun to try.\n\u003C/p\u003E\n\u003Cp\u003E\nI have unlocked a mini heat shield, I think.  I suppose I\u0027d need one of those too, even if rocket braking.  I don\u0027t know how heavy they are.  \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, great idea!  I will play around with it in KSP later today.\n\u003C/p\u003E\n"},{"CreatedByName":"paul_c","CreatedById":208135,"CreatedDateTime":"2021-03-20T18:12:35Z","Content":"\n\u003Cp\u003E\nYou can reduce the amount of ablator on a heatshield to reduce its weight.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-20T18:20:33Z","Content":"\n\u003Cp\u003E\nAnother idea I hadn\u0027t thought of!  Thanks, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208135-paul_c/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022208135\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208135-paul_c/\u0022 rel=\u0022\u0022\u003E@paul_c\u003C/a\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-03-20T19:13:20Z","Content":"\n\u003Cp\u003E\nif you are coming back from low orbit, you can forego the heat shield if you don\u0027t mind losing the solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\nfrom interplanetary destinations you need a heat shield.\n\u003C/p\u003E\n\u003Cp\u003E\nthe good thing about those small probes is that they are very light and with a large surface, so they aerobrake a lot. they fall down at around 50 m/s without parachute, so they only need a little braking.\n\u003C/p\u003E\n\u003Cp\u003E\ni have experimented with even more extreme avenues of weight saving. i tried to make a lithobraking probe, no parachute and no rocket, just some structural parts that could take the impact. couldn\u0027t make it work without adding too much weight.\n\u003C/p\u003E\n\u003Cp\u003E\nand i tried to add two wings to land like an airplane. it worked, sometimes. problem was, the only \u0022wings\u0022 light enough to make it worthwhile are the basic fins, and they have abysmally low thermal resistance, so they tend to burn during reentry. but they were fun attempts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2021-03-20T19:33:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942887\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616262989\u0022 data-ipsquote-userid=\u0022116542\u0022 data-ipsquote-username=\u0022Mister Spock\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Mister Spock said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder if my \u0022slight adjustment\u0022 keys are working.  On Windows, by default that\u0027s alt plus the direction key (WASD), I think.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat by default  is control trim. And may be the reason why your navball is wandering around.  Alt\u002BX will reset trim.\n\u003C/p\u003E\n\u003Cp\u003E\nPrecision control is now a mode, Caplocks toggle it on/off.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942889\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616263208\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\non a probe so small, it may actually be more convenient to mount a more powerful engine and rocket brake.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, maybe  cheaper, cooler or something but strapping a parachute to recover the thing is as convenient as it get. \n\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2021-03-20T22:55:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223942944\u0022 data-ipsquote-contentid=\u0022201089\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221616268809\u0022 data-ipsquote-userid=\u0022166502\u0022 data-ipsquote-username=\u0022Spricigo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Spricigo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat by default  is control trim. And may be the reason why your navball is wandering around.  Alt\u002BX will reset trim.\n\u003C/p\u003E\n\u003Cp\u003E\nPrecision control is now a mode, Caplocks toggle it on/off.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOMG, this may explain my woes.  I\u0027ve been stabbing at alt-WASD thinking I was making small movements, when in fact I was setting trim, lol!  That means I may have told my craft to \u0022pitch up\u0022 constantly, heh. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s more,   I accidentally hit Caps Lock all the time, when I\u0027m trying to hit Shift to increase throttle, or Tab to do something else.  I will try rebinding the Precision Control toggle to something I\u0027m less likely to hit by accident.  I had no idea precision control was now a toggle.  Which is a welcome thing, I might add.  I hate using the alt key for anything.\n\u003C/p\u003E\n\u003Cp\u003E\nFor hotkeys, I\u0027ve been consulting an outdated wiki post (on my phone, so I don\u0027t have to alt-tab out).  Sounds like I need to find a different hotkey website!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try flying again tonight and report back.  I look forward to marking this thread as \u0022answered\u0022 soon, I swear!\n\u003C/p\u003E\n"}]}