{"TopicId":201199,"ForumId":16,"TopicTitle":"How would you approach this recovery mission?","CreatedByName":"El Sancho","CreatedById":178103,"CreatedDateTime":"2021-03-23T23:10:21Z","PageNum":1,"Articles":[{"CreatedByName":"El Sancho","CreatedById":178103,"CreatedDateTime":"2021-03-23T23:10:21Z","Content":"\n\u003Cp\u003E\nRecovering Jalock is easy, I am asking how would you recover her scrap. They give you the mass and dimensions. Do you think a grabber is the way to go, and would a grabber hold it through re-entry?\n\u003C/p\u003E\n\u003Cp\u003E\nOr perhaps once you had it in orbit of Kerbin, an Engineer could weld a controller and some \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E onto it, and you could maneuver it into a cargo bay? Or maybe just weld a couple parachutes and a heat shield onto it, drop it on a re-entry arc, and hope for the best...\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow, what do you folks think?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eu2a6GZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022125.40\u0022 height=\u0022790\u0022 width=\u0022630\u0022 src=\u0022https://i.imgur.com/eu2a6GZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2021-03-23T23:14:51Z","Content":"\n\u003Cp\u003E\nA grabber, a couple of tiny perpendicular wings for aerodynamic drag, a small girder for something to attach to, a couple of parachutes, and a decoupler to disconnect it all is plenty. And then you need to maneuver it cleverly to get it to reenter.\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2021-03-24T01:59:35Z","Content":"\n\u003Cp\u003E\nGrabbers hold through Kerbin reentry.\n\u003C/p\u003E\n\u003Cp\u003E\nThe part is on Minmus. Picking it up with a grabber might be the most challenging part of the mission. Minmus is forgiving due to very low gravity, but still make sure to include enough \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or reaction wheels to help with targeting.\n\u003C/p\u003E\n\u003Cp\u003E\nI assume you are playing with default heat settings and no mods that make reentry more dangerous. Even so, the random mystery part you pick up might have low heat tolerance, so I suggest saving your game before committing to reentry. If the part burns up, reload, keep the part in Kerbin orbit, and send a cargo bay with internal grabber to get the part.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2021-03-24T02:41:09Z","Content":"\n\u003Cp\u003E\nHeat problems:  Most parts can survive a careful re-entry from Minmus.   \u003Cbr\u003E\u003Cbr\u003E\nIf you end up with a part that has trouble surviving re-entry, just bring more \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E (fuel).  If you keep the speed low enough, the heat is less severe.   \u003Cbr\u003E\u003Cbr\u003E\nDoing a deep-dive into the atmosphere from Minmus will generate a lot of heat, your velocity will be roughly 3,000m/s.   The slower you can enter the atmosphere, the better- heat will be reduced.  Some parts are more tolerant than others.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-24T14:53:02Z","Content":"\n\u003Cp\u003E\nLooking at those numbers, I’d guess that your target is probably a Making History KV-1 pod meaning you can throw it into the atmosphere without worrying \u003Ci\u003Etoo \u003C/i\u003Emuch about it overheating. You would need to add parachutes to it though, so it’s probably best to send out a mission with at least one engineer aboard to land next to the stranded pod, weld it on top of their own vessel and then fly back with it to Kerbin or possibly add some type of skycrane assembly (with parachute!) on the KV pod’s top node and use that to fly back.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can recover parts from the surface of a body like Minmus with a rocket or rover based system and grabbing it with a klaw, but it’s much harder to do. Building a Mk3 based cargo ship or shuttle would be one way of doing that which would avoid the perils of imbalanced thrust and weight that you’d get just by grappling the pod with a rocket and flying away with it, but that’s still pretty expensive compared to using a much smaller lander and doing some EVA construction.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-03-25T01:17:49Z","Content":"\n\u003Cp\u003E\ni would not use a cargo bay due to the difficulty of getting the part inside. a claw, a lander with wheels to move on the ground, many reaction wheels to compensate for thrust imbalance, and you should be fine\n\u003C/p\u003E\n"},{"CreatedByName":"El Sancho","CreatedById":178103,"CreatedDateTime":"2021-03-25T01:28:46Z","Content":"\n\u003Cp\u003E\nI do thank you all for your helpful replies\n\u003C/p\u003E\n"}]}