{"TopicId":20157,"ForumId":25,"TopicTitle":"Race to the Jool (and back)","CreatedByName":"adammada","CreatedById":29884,"CreatedDateTime":"2012-09-24T08:51:16Z","PageNum":1,"Articles":[{"CreatedByName":"adammada","CreatedById":29884,"CreatedDateTime":"2012-09-24T08:51:16Z","Content":"\n\u003Cp\u003ESo, munolith on Mun sent strange signal in direction of Jool. Kerbals have to go to Jool and check it ASAP.\u003C/p\u003E\u003Cp\u003ERules;\u003C/p\u003E\u003Cp\u003E1. Only stock parts \u002B mechJeb \u002B information tools like AdamKSP etc allowed.\u003C/p\u003E\u003Cp\u003E2. You need to launch without waiting on launchpad (start new profile, launch asap, don\u0027t wait for correct phase angle). You can always wait on high orbit and warp.\u003C/p\u003E\u003Cp\u003E3. Jool is reached when you will be on less than 200 000 m altidude.\u003C/p\u003E\u003Cp\u003E4. You have to go back to Kerbin!\u003C/p\u003E\u003Cp\u003E5. Time of flight showed on upper lef corner of screen counts.\u003C/p\u003E\u003Cp\u003E6. Show screens, write about your strategy.\u003C/p\u003E\u003Cp\u003ETwo categories:\u003C/p\u003E\u003Cp\u003E- fastest to Jool and back (time of land on Kerbin counts)\u003C/p\u003E\u003Cp\u003E- fastest to Jool (not important how slow you will go back, time of reaching Jool counts)\u003C/p\u003E\n"},{"CreatedByName":"adammada","CreatedById":29884,"CreatedDateTime":"2012-09-24T21:53:14Z","Content":"\n\u003Cp\u003EMine result:\u003C/p\u003E\u003Cp\u003E- total journey time = 561 Days, 4 Hours, 39 Minutes, 20 seconds\u003C/p\u003E\u003Cp\u003E- time to Jool = 297 Days, 15 hours, 41 minutes\u003C/p\u003E\u003Cp\u003EPhotos: \u003Ca href=\u0022http://imgur.com/a/ci1tT\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ci1tT\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EStrategy:\u003C/p\u003E\u003Cp\u003EI used Protractor Mod ( \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/21544-Plugin-Part-17-Protractor-Planetary-Lunar-Rendezvous-Mod\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/21544-Plugin-Part-17-Protractor-Planetary-Lunar-Rendezvous-Mod\u003C/a\u003E ) to calculate / show angles and MechJeb to help piloting (but not used any mechjeb transfers, just Ascent and SmartAss).\u003C/p\u003E\u003Cp\u003EAfter launch I went to 620 000 m Kerbin orbit (maximum warp requires over 600 000 m altitude). Then i waited for good phase angle. Because high orbit is pretty slow, i didnt get excatly phase angle, because i wanted good ejection angle.\u003C/p\u003E\u003Cp\u003EI fired prograde and waited until I saw that ship would be entering Jool SOI (got caught by Minimus SOI on way...). Then i warped until about half of way and then corrected inclination (go up), also made periapsis close to Jool. Warped again until entering Jool SOI. I saw that i would orbit Jool clockwise, which is not supported by Protractor Mod, so i changed course to go counterclockwise and periapsis about 131 000 m, cause i wanted aerobraking. Jool atmoshpere starts at about 137 000.\u003C/p\u003E\u003Cp\u003EBy trial and error i discovered that lower than 125 000 periapsis guarantees to much aerobraking (no going orbit again), thats why i used 131 000 .\u003C/p\u003E\u003Cp\u003EThat aerobraking gave me higly elliptical orbit. \u003C/p\u003E\u003Cp\u003EI also saw, that i\u0027m few degrees from good phase angle to Kerbin, and angle is getting worse. I tried to circularize orbit to make good ejection, first made retrograde to have orbit less elliptical, then at apostatis burned to make it circular at higher altitude (didn\u0027t want to wast to much speed), it required lots of dV. When i reached ejection angle I fired engines.\u003C/p\u003E\u003Cp\u003EI watched my orbit on MAP, and got worried cause it crossed Kerbin orbit, and there was no hit. But when it crossed some more, i got hit (better be to early than too late \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). I warped until about half of journey and corrected periapsis (inclination and retro burn to go straight to Kerbin).\u003C/p\u003E\u003Cp\u003EI hit atmoshpere really fast, but aerobraking \u002B some engine thrust was enough to lower speed (but max G is 72 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-24T22:06:58Z\u0022 title=\u002209/24/2012 10:06  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 24, 2012\u003C/time\u003E by adammada\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oggula","CreatedById":10927,"CreatedDateTime":"2012-09-24T23:19:40Z","Content":"\n\u003Cp\u003EI\u0027m in the process of return from a 140km circular Jool orbit at the moment, but it won\u0027t be record breaking by the time it gets back to Kerbin because I delayed leaving Jool to make sure my landers from Bop and Vall got back\u003C/p\u003E\n"},{"CreatedByName":"adammada","CreatedById":29884,"CreatedDateTime":"2012-09-25T06:23:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E140km circular Jool orbit\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdge of atmosphere, better dont dive your landers few km below...\u003C/p\u003E\u003Cp\u003EAnyway, i\u0027m looking for faster transfer ways than Hohmann orbit, cause fuel isnt really an issue ( Nerva rulez \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E )\u003C/p\u003E\n"}]}