{"TopicId":201905,"ForumId":32,"TopicTitle":"Precise measurement tecniques","CreatedByName":"An_ordinary_kerbal","CreatedById":211279,"CreatedDateTime":"2021-04-22T15:25:19Z","PageNum":1,"Articles":[{"CreatedByName":"An_ordinary_kerbal","CreatedById":211279,"CreatedDateTime":"2021-04-22T15:25:19Z","Content":"\n\u003Cp\u003E\nI am using the mod Principia and I am playing without using the trajectory calculations given by the stock game using patched conics or the one given by Principia which also considers n-body dynamics. While trying to navigate through space, I quickly realized that precise measurements are critical, for example, for returning to Kerbin safely by aiming for the atmosphere around 55 kilometers. Would you share ways for taking some precise measurements for:\n\u003C/p\u003E\n\u003Cp\u003E\n1- Vertical speed, that is, the velocity component paralel to the displacement vector from the celestial body to the spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n2- The velocity component perpendicular to the displacement vector r from a celestial body. (I know we can use the navball but it isn\u0027t precise enough!)\n\u003C/p\u003E\n\u003Cp\u003E\n2- True anomaly (or eccentric anomaly)\n\u003C/p\u003E\n\u003Cp\u003E\n3- Distance to another celestial body different from the one which contains you in its sphere of influence.\n\u003C/p\u003E\n\u003Cp\u003E\nand other things which are useful for calculation of your trajectory. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI have devised some ways myself:\n\u003C/p\u003E\n\u003Cp\u003E\n1- In order to find the time where your angular position with respect to a celestial body (Say Kerbin) is exactly \\alpha less than the angular position of another celestial body (e.g. The Mun) around Kerbin, you can do the following (assuming you and the other body are orbiting in the same plane): Make your orbit circular and note the time of your passage between Kerbin and The Mun. Calculate the average angular speed of The Mun, subtract it from your constant angular speed and divide 2pi-\\alpha with this number. After that much seconds you will be in the position described.\n\u003C/p\u003E\n\u003Cp\u003E\n2- If your distance to the body is high enough, you can approximate your vertical speed by using a chronometer to count to t seconds, and divide the total change in your distance to the body by t. t must not be large since this approximation is of the first order, 30 sec is probably fine for most situations.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n"}]}