{"TopicId":202059,"ForumId":16,"TopicTitle":"What\u0026#039;s a good apoapsis height for a Duna to Kerbin free return?","CreatedByName":"TitiKSP","CreatedById":206756,"CreatedDateTime":"2021-04-28T13:02:27Z","PageNum":1,"Articles":[{"CreatedByName":"TitiKSP","CreatedById":206756,"CreatedDateTime":"2021-04-28T13:02:27Z","Content":"\n\u003Cp\u003E\nI\u0027m using Starship from Tundra Exploration.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-04-30T07:55:33Z","Content":"\n\u003Cp\u003E\nI’m fairly sure you don’t mean ‘free return’, which describes a trajectory that can get you back from a moon (or \u003Ci\u003Ethe\u003C/i\u003E Moon) without any additional energy input, and was used on the Apollo missions to ensure that if they had an engine failure they’d still come back from the Moon instead of floating off into space.\n\u003C/p\u003E\n\u003Cp\u003E\nThis only works when the body you’re trying to visit is in orbit of the one you came from (and want to return to) e.g. Kerbin/Mun or Earth/Moon; it’s next to impossible when you’re talking about two bodies orbiting a common parent e.g. Kerbin/Duna because they’re both moving at different speeds, plus the effects of a gravity assist are much smaller relative to your overall orbital velocity around the sun than they are for a planet/moon system. I’m not saying it’s totally impossible to do, but I don’t think Duna has the gravity to change your orbit enough to make it work without many orbits around the Sun and you’ll probably need a course correction at some point anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you’re talking about the ideal periapsis for re-entry, the only way to find out is to stick down a quick save and try different altitudes until you find one that gets you down in one piece without skipping off the atmosphere and flying back into space or burning up in a blaze of fiery explosions.\n\u003C/p\u003E\n"},{"CreatedByName":"Wizard Kerbal","CreatedById":209063,"CreatedDateTime":"2021-04-30T14:55:07Z","Content":"\n\u003Cp\u003E\n25-35 km usually works, but watch your trajectory around kerbin. If it\u0027s near a straight line, just re-entering is dangerous.\n\u003C/p\u003E\n\u003Cp\u003E\nThe more horseshoe-shaped your trajectory is, the slower your re-entry.\n\u003C/p\u003E\n"}]}