{"TopicId":202413,"ForumId":109,"TopicTitle":"Actual Uses for Aeroplanes","CreatedByName":"Nirgal","CreatedById":211448,"CreatedDateTime":"2021-05-15T21:16:20Z","PageNum":1,"Articles":[{"CreatedByName":"Nirgal","CreatedById":211448,"CreatedDateTime":"2021-05-15T21:16:20Z","Content":"\n\u003Cp\u003E\nAfter being in awe of the new procedural system for wings in KSP 2, it got me thinking \u0022well that\u0027s cool but it\u0027s just a toy\u0022. There should be multiple, productive uses for such a great feature beyond a bit of tinkering, I have some ideas to suggest below and I look forward to seeing what you guys come up with \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1. The obvious one, SSTOs. In KSP1 the greatest barrier to using space planes was the time constraint of having to manually fly up to space (much slower than just shooting up a rocket). Since we will have some automation ability in KSP2 I can easily see space planes being used to ferry construction materials to Kerbin orbit in a resource and time efficient manner. The \u0027Super Kerbin\u0027 planet with high gravity and probable atmosphere may be where space planes will truly shine.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Resource transport from extraction point to processing. To bring more depth and utility to the new colony system, I\u0027m thinking the resource distribution on celestial bodies will be far more location dependent than what we have now, where \u0027ore\u0027 can be mined anywhere, only at differing rates. If we find a great place to build a colony, say under the lip of an overhang for radiation protection and find essential resources 300km away over rough terrain, an automated cargo aeroplane would be gold dust.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Kerbal transport on water worlds. Without land, air travel may dominate (still hoping for ships and submarines). A Laythe or Puff colony may need to shuffle around experienced Kerbals to pioneer and research positions, or a growing colony may decide to transport workers across the planet to oversee a complex construction / resource extraction / research program.\n\u003C/p\u003E\n\u003Cp\u003E\n@\u003Cstrong\u003E\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/209403-kspstar/\u0026amp;do=hovercard\u0026amp;referrer=https%253A%252F%252Fforum.kerbalspaceprogram.com%252Findex.php%253F%252Ftopic%252F203080-ksp2-suggestion-the-ability-to-command-other-kerbals-to-do-something%252F\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/209403-kspstar/\u0022 style=\u0022background-color:transparent;color:inherit;\u0022 title=\u0022Go to KSPStar\u0027s profile\u0022 rel=\u0022\u0022\u003EKSPStar\u003C/a\u003E could you move this to development please?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-06-30T10:41:34Z\u0022 title=\u002206/30/2021 10:41  AM\u0022 data-short=\u00223 yr\u0022\u003EJune 30, 2021\u003C/time\u003E by Nirgal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Caerfinon","CreatedById":207619,"CreatedDateTime":"2021-05-15T22:59:24Z","Content":"\n\u003Cp\u003E\nAnd some usefulness on the home world will be most appreciated.\n\u003C/p\u003E\n\u003Cp\u003E\nScience Research, Passenger Flights, Buzzing the Tower, Sky diving, Barn Storming, and many others as well! \n\u003C/p\u003E\n"}]}