{"TopicId":203094,"ForumId":70,"TopicTitle":"Game instantly crashing shortly after docking.","CreatedByName":"epicpupster239","CreatedById":212210,"CreatedDateTime":"2021-06-17T17:37:45Z","PageNum":1,"Articles":[{"CreatedByName":"epicpupster239","CreatedById":212210,"CreatedDateTime":"2021-06-17T17:37:45Z","Content":"\n\u003Cp\u003E\nThis was encountered in a custom difficulty modded save, and occurred while assembling a space station in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\u003Cbr\u003E\nShortly after docking the space station with the new module (the mobile processing lab), the game ran for about 3 seconds before closing entirely. No freeze, no error message, the game immediately closes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe following link has two text documents; the log and the mod list.\n\u003C/p\u003E\n\u003Cp\u003E\nhttps://mega.nz/folder/QUoBHYZa#LOX50saa8jW3XJHlpuIztw\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-06-18T12:22:18Z","Content":"\n\u003Cp\u003E\nI opened up the log file and on the very first line something stands out- you\u0027ve put mods into the Steam copy of KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t put mods in the Steam copy of KSP, Steam has a habit of messing things up when you do that which frequently causes game crashes. Fortunately there\u0027s an easy way to fix it- copy KSP and put mods in the copies instead. The logs look pretty ordinary but you have a few exceptions for Parallax near the end and a strange database exception right at the very end which probably caused the game to crash and quit. I think the problem is that Steam has corrupted some mod files which then causes the game to crash.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m guessing from that mod list that you\u0027re using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E to install your mods, so the first thing you want to do is create a modpack in \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E- File \u0026gt; Export modpack \u0026gt; save the modpack on your desktop or somewhere else that Steam can\u0027t touch it.\n\u003C/p\u003E\n\u003Cp\u003E\nWith that modpack safe, copy your save games from KSP/saves and keep those somewhere safe (wherever you put the modpack file), then go into Steam, right-click KSP and open the Properties menu, then deselect the Steam cloud options (which are the main cause of mod-related issues). Now completely uninstall and reinstall KSP, and once that\u0027s done open the properties menu again, click \u0027local files\u0027 and then \u0027verify integrity of game files\u0027- this will ensure that all the game files have been restored and aren\u0027t corrupted. You should boot up KSP without mods just to check that it works properly.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce you have a working copy of stock KSP, go into the Steam folders- steam/steamapps/common- then copy KSP and paste it somewhere outside of Steam\u0027s control. This copy is the one you want to put mods in, where Steam can\u0027t interfere with it and mods won\u0027t break due to game updates, while the Steam copy can sit there and collect game updates, or you can choose a specific game version to download if you want to use specific mods that are only compatible with certain versions of the game (that\u0027s in Properties \u0026gt; betas \u0026gt; pick a version from the drop-down list). \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E can also copy an existing instance of KSP that it already knows about and you can install modpacks very easily once you\u0027ve added an instance for \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E to keep track of.\n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps!\n\u003C/p\u003E\n"}]}