{"TopicId":203148,"ForumId":16,"TopicTitle":"Time warping and structural integrity","CreatedByName":"MetricKerbalist","CreatedById":211699,"CreatedDateTime":"2021-06-20T17:46:04Z","PageNum":1,"Articles":[{"CreatedByName":"MetricKerbalist","CreatedById":211699,"CreatedDateTime":"2021-06-20T17:46:04Z","Content":"\n\u003Cp\u003E\nHi KSP colleagues,\n\u003C/p\u003E\n\u003Cp\u003E\nI have noticed that sometimes if you time warp -- especially by large amounts -- you will get a warning that time warping can damage the spacecraft\u0027s structural integrity.  (I may not have the wording exactly correct.)\n\u003C/p\u003E\n\u003Cp\u003E\nCould this really happen?  Is time warping potentially dangerous to one\u0027s spacecraft?\n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n\u003Cp\u003E\nStanley\n\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2021-06-20T18:03:48Z","Content":"\n\u003Cp\u003E\nPretty sure the warning comes when you physics warp, the 2, 3, or 4x warp you get if you try to warp in the atmospherere or by holding alt and warping. which could cause problems since the game is trying to calculate the same physics on the vessel in a fraction of the time.  I have never had any issues but don\u0027t use it much either.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor regular time warp there is sometimes a bit of a jolt when you exit warp, which can cause problems for landed vessels or  large, complex vessels and particularly those with creative use of docking ports.\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2021-06-20T20:02:40Z","Content":"\n\u003Cp\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/2440-rhomphaia/\u0026amp;do=hovercard\u0022 data-mentionid=\u00222440\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/2440-rhomphaia/\u0022 rel=\u0022\u0022\u003E@Rhomphaia\u003C/a\u003E said, that warning only applies to ‘Physics Warp’.\n\u003C/p\u003E\n\u003Cp\u003E\nPhysics Warp normally only occurs while you are in an atmosphere.   While in atmosphere you are prevented from hitting ‘Normal’ warp.   You enter Physics Warp by holding the left modifier key while pressing warp.  Physics warp can also be induced while in space (outside of any atmosphere too.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the name suggests, during Physics Warp, the game still calculates physical effects.  Yes, bad things can happen to your ship.   If you are careful, it is usually fine however.   I use it all the time.\n\u003C/p\u003E\n\u003Cp\u003E\nHere’s a few examples of bad things that can happen.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhile controlling an aircraft it is easy to accidentally over-control, and exceed G limits, causing parts to fall off.\n\u003C/li\u003E\n\u003Cli\u003E\nUsing rovers on the surface makes it more likely for parts to break.\n\u003C/li\u003E\n\u003Cli\u003E\nIn some cases, usually with rovers, parts can actually move slightly into a different position.  That’s usually just annoying for small rovers, but for rovers with a lot of parts the cumulative effect can be a big problem.\n\u003C/li\u003E\n\u003Cli\u003E\nEven in space, using Physics Warp can cause issues with large ships.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNote that using ‘Normal’ warp doesn’t really cause these problems.   Normal Warp is sometimes called ‘On-Rails’ warp, because objects stay ‘on-rails’, just obeying basic orbital paths, but otherwise ignoring the effects of atmosphere or other physical considerations.   During Normal warp, there is not much concern for strange things happening to your ship.\n\u003C/p\u003E\n\u003Cp\u003E\nOne example where I use Physics Warp is while waiting for a pod to settle to the surface under parachutes.   Waiting for a vessel to descend 1000 m at 2.0 m/s is painful, I usually use 4X Physics Warp for that.  I do try to be at 1X warp at the moment the vessel contacts the surface though.\n\u003C/p\u003E\n"},{"CreatedByName":"MetricKerbalist","CreatedById":211699,"CreatedDateTime":"2021-06-20T20:05:44Z","Content":"\n\u003Cp\u003E\nHi everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nThen I am confused.  When I am talking about time-warping, all I mean is pressing the period key to speed things up.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t know about physics warp.\n\u003C/p\u003E\n\u003Cp\u003E\nStanley\n\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2021-06-20T20:36:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223992161\u0022 data-ipsquote-contentid=\u0022203148\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624219544\u0022 data-ipsquote-userid=\u0022211699\u0022 data-ipsquote-username=\u0022MetricKerbalist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, MetricKerbalist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHi everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nThen I am confused.  When I am talking about time-warping, all I mean is pressing the period key to speed things up.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t know about physics warp.\n\u003C/p\u003E\n\u003Cp\u003E\nStanley\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you press the period key while you are in the atmosphere it uses physics warp to speed things up, if you are not in the atmosphere then it will use normal time warp.  physics warp can be used out of atmosphere by pressing alt\u002Bperiod\n\u003C/p\u003E\n\u003Cp\u003E\nNormally the warning message is seen when launching and trying to warp before you have fully left the atmosphere\n\u003C/p\u003E\n"},{"CreatedByName":"MetricKerbalist","CreatedById":211699,"CreatedDateTime":"2021-06-20T20:39:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223992179\u0022 data-ipsquote-contentid=\u0022203148\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624221415\u0022 data-ipsquote-userid=\u00222440\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Rhomphaia said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you press the period key while you are in the atmosphere it uses physics warp to speed things up, if you are not in the atmosphere then it will use normal time warp.  physics warp can be used out of atmosphere by pressing alt\u002Bperiod\n\u003C/p\u003E\n\u003Cp\u003E\nNormally the warning message is seen when launching and trying to warp before you have fully left the atmosphere\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/2440-rhomphaia/\u0026amp;do=hovercard\u0022 data-mentionid=\u00222440\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/2440-rhomphaia/\u0022 rel=\u0022\u0022\u003E@Rhomphaia\u003C/a\u003E.  That explains a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-06-20T22:05:07Z","Content":"\n\u003Cp\u003E\nPhysics warp speeds up the game while still running the physics system- in atmosphere this is the only type of time warp you can get if you\u0027re moving, but you can also activate this in space using Alt\u002B,/. to make longer burns take less time. Be warned that physics warp can have unintended consequences- if your engines are running then your entire craft can crumple into itself like an accordion and become unstable, or have pieces pulled beyond their limits and break off especially in atmosphere, or just become uncontrollable as the controls can\u0027t keep up with the increased physics speed and keep overcorrecting. Physics warp goes up to x4 speed, although there are mods such as Better Time Warp which can change this value, both to make it slower for dramatic slow-motion shots and make it faster which can help with low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E engines, large ships that cause game lag due to their high part counts, or both.\n\u003C/p\u003E\n\u003Cp\u003E\nTime warp is different- the physics system is suspended and everything proceeds \u0022on rails\u0022 without the effects of thrust, and cancelling any spinning that the craft may have picked up. This is a slightly cheaty way to bring an unstable craft back under control and can immediately stop wobbles and other instabilities that can be caused by having unbalanced reaction wheel torque or large parts connected by much smaller ones (e.g. docking a station together using small docking ports). Time warp starts at x5 and goes all the way up to x10,000, although again mods can change these values. Time warp is only available in space and when stationary on the surface of a planet or moon and will automatically be disabled when you enter an atmosphere or if you get below a specified altitude on each body; however if you\u0027re warping really fast the delay before it slows down to normal speed and re-engages the physics system can result in your craft ending up under the surface, deep into the atmosphere and burning up or in very rare cases going straight through and out the other side!\n\u003C/p\u003E\n"}]}