{"TopicId":203175,"ForumId":16,"TopicTitle":"Workaround for instant self-destruct on quickload?","CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2021-06-21T17:41:07Z","PageNum":1,"Articles":[{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2021-06-21T17:41:07Z","Content":"\n\u003Cp\u003E\nHello all,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m playing through a career game with the BG DLC, and part of that is the propeller-driven Eve spaceplane pictured below approaching the place I want to land:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XbHnP6z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XbHnP6z.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt handles re-entry just fine, and getting it to stable flight on the props and keeping it that way is a bit tricky but doable, as is landing it based on sandbox testing. So long as I don\u0027t push it too hard or lose control with the props  (easier said than done!), it holds together perfectly well. What it doesn\u0027t seem to be able to survive however is quicksaving/quickloading in atmospheric flight. No matter how slow, straight, and level I have it before I hit F5, it always seems to break up instantly when I reload it, forcing me to start all the way back in early re-entry if I mess up anywhere in this long, long phase of flight between  around 40km and the ground. Basically as soon as the physics load, the wings just snap off no matter what I do.  So my my question is this: is this some kind of a bug in the vessel file  or is it just some inherent bad feature of how the game handles static vs. dynamic loading? In the former case, does anybody know how to edit this behavior away? I\u0027m not above using physics cheats transiently either, since it seems so unfair, but it appears that once I load a vessel with \u0022unbreakable joints\u0022 enabled, it stays that way until I reload it even if I turn it off, which of course takes all the challenge out of landing it. Thanks in advance for any insights from the knowledgeable!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-06-21T17:42:13Z\u0022 title=\u002206/21/2021 05:42  PM\u0022 data-short=\u00223 yr\u0022\u003EJune 21, 2021\u003C/time\u003E by herbal space program\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2021-06-21T19:03:44Z","Content":"\n\u003Cp\u003E\nThe quicksave stores the craft with unflexed wings, but at the full airspeed, so yes upon reload the dynamic loading double flexes the wings which could break them. \n\u003C/p\u003E\n\u003Cp\u003E\nI have had this problem and used a temporary \u0027hack gravity = 0.1\u0027 before F9-reload and then an immediate nose-down to take the load off the wings.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Breaking Ground rotors also reload at zero RPM, I think, so you might also need a temporary cheat-\u0026gt;physics-\u0026gt;aero-\u0026gt;DragMultiplier = 0  to avoid drag of the stationary propellers.\n\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2021-06-21T19:46:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223992622\u0022 data-ipsquote-contentid=\u0022203175\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624302224\u0022 data-ipsquote-userid=\u0022162784\u0022 data-ipsquote-username=\u0022OHara\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, OHara said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe quicksave stores the craft with unflexed wings, but at the full airspeed, so yes upon reload the dynamic loading double flexes the wings which could break them. \n\u003C/p\u003E\n\u003Cp\u003E\nI have had this problem and used a temporary \u0027hack gravity = 0.1\u0027 before F9-reload and then an immediate nose-down to take the load off the wings.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Breaking Ground rotors also reload at zero RPM, I think, so you might also need a temporary cheat-\u0026gt;physics-\u0026gt;aero-\u0026gt;DragMultiplier = 0  to avoid drag of the stationary propellers.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for the explanation, that makes perfect sense to me.  And obviously you can\u0027t fix that by editing the save file. Perhaps if I enable auto-strut and rigid attachment everywhere that will help going forward, although there\u0027s obviously no time to do that on my save while flying. I\u0027ll try your suggestion about the gravity parameter. Maybe I was just really lucky, but after I turned \u0022unbreakable joints\u0022 off in alt-f12, it really seemed like I could still get away with stuff that would have broken my plane up before, and I want to land it fair and square. As an aside, it really seems like it shouldn\u0027t be so hard for them to fix this. They should just apply some kind of damping to the structure\u0027s movement for the first second or so after reloading so that the momentum of the parts doesn\u0027t apply double stress to everything. I suppose that might open the door to some exploits, but it still seems like a reasonable tradeoff to me in exchange for not having perfectly good airframes spontaneously disassemble upon loading.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-06-21T19:48:22Z\u0022 title=\u002206/21/2021 07:48  PM\u0022 data-short=\u00223 yr\u0022\u003EJune 21, 2021\u003C/time\u003E by herbal space program\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2021-06-22T13:46:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223992644\u0022 data-ipsquote-contentid=\u0022203175\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624304762\u0022 data-ipsquote-userid=\u0022112590\u0022 data-ipsquote-username=\u0022herbal space program\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, herbal space program said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nobviously you can\u0027t fix that by editing the save file. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, and no... the craft disintegrates because physics kicks in when the atmosphere and velocity combine to create too much force. You can edit parameters of the save file to either make your craft be higher upon loading (thus in thinner air), or slower.\n\u003C/p\u003E\n\u003Cp\u003E\nOr you can try to only quicksave when you\u0027r going slow and you\u0027ve unloaded the wings. Quicksaving in a high G turn is a bad idea, quicksaving when you are at less than 1g acceleration should work fine.\n\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2021-06-22T17:14:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223992926\u0022 data-ipsquote-contentid=\u0022203175\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624369572\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, and no... the craft disintegrates because physics kicks in when the atmosphere and velocity combine to create too much force. You can edit parameters of the save file to either make your craft be higher upon loading (thus in thinner air), or slower.\n\u003C/p\u003E\n\u003Cp\u003E\nOr you can try to only quicksave when you\u0027r going slow and you\u0027ve unloaded the wings. Quicksaving in a high G turn is a bad idea, quicksaving when you are at less than 1g acceleration should work fine.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou make a good point. Changing the speed and/or altitude probably would have worked.  I\u0027m pretty sure that at 20km and that speed, the aero forces wouldn\u0027t have been strong enough to snap off my wings, although that would have represented re-flying a lot of the approach.  Another thing that probably would have worked is changing my motion where I was so that it had an upward component that would reduce the force on the wings.   As to changing the attitude of my craft where it was to unload the wings, in that situation on Eve, the only thing that did  that seemed to be going into a vertical nose dive, which becomes really fast really quickly.  In the end I determined (based on my first landing attempt) that invoking unbreakable joints in alt-F12  for just the couple of seconds after loading was in fact only temporary, so it seemed like the least amount of cheating to get me around this problem. My second attempt at landing was successful, so I\u0027m past that roadblock now, but I do think my experience with this does point out an area where the game really isn\u0027t behaving the way it ought to.  I wouldn\u0027t call it a bug per se, but obviously the way they have combined the relaxed save state of the craft and the instantaneous activation of the physics engine in the atmosphere can readily produce catastrophic events when they shouldn\u0027t happen.  As a plane enthusiast, I do hope they get around to fixing that behavior at some point, at least before KSP2 rolls off the line.\n\u003C/p\u003E\n"}]}