{"TopicId":203682,"ForumId":16,"TopicTitle":"How to use a Delta-V map.","CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-07-07T23:51:37Z","PageNum":1,"Articles":[{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-07-07T23:51:37Z","Content":"\n\u003Cp\u003E\nWhenever I look at a delta-v map like this:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yO0bQax.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yO0bQax.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIt makes no sense. For example, on the Mun part of the map, by 5120 does it mean the total Delta V to get there, or something else?\u003Cbr\u003E\nHelp would be greatly appreciated. Thanks! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2021-07-08T02:02:02Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EFIRST NOTE: These numbers are suggestions and will vary in reality based on your skill, rocket, and how you do each burn. But given a typical rocket and correct burns, they should be pretty close. I like to keep a 10% margin for error in my tank, especially for landing on airless worlds.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou need to think of the map in sections. There\u0027s a \u0022get into orbit or land from orbit\u0022 section of flight, a \u0022circularize orbit from interplanetary or go from circular orbit to interplanetary\u0022 section. Each trip includes one or more of these and they\u0027re not all together.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s take a simple one, getting to Mun.  First you get into orbit (3400m/s, which I\u0027ll skip from now on and assume we\u0027re in orbit of Kerbin to start) and then there\u0027s the \u0022go to Mun from circular orbit\u0022 which is 860. When you\u0027re done with that burn, you should have a periapsis around Mun at around 14km. You won\u0027t, but a tiny mid-course correction should do it. Then when you\u0027re at that \u003Cabbr title=\u0022Periapsis\u0022\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u003C/abbr\u003E you need to do the \u0022circularize at mun\u0022 burn which is 280. Then to land from there you need 580.\n\u003C/p\u003E\n\u003Cp\u003E\nReversing that, you need 580 to orbit Mun, 280 to eject back to kerbin, 860 to brake at Kerbin back into a circular orbit, and 3400 to land back at Kerbin. However, those last 2 can utilize aerobraking so you can do them all for free, assuming you can stand the heat \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOkay now for the harder part (don\u0027t worry it\u0027s not much harder), getting to Duna. Duna has more numbers than Mun after the initial 3400 to reach orbit. you\u0027ve got 930, 130, a little \u002710\u0027 off of that 130, 250, 360, and finally 1450. Whew, what to do?\n\u003C/p\u003E\n\u003Cp\u003E\nRemember, there are only 2 actual ways to spend fuel: landing/takoff, or circularize/eject. So, we\u0027re in orbit of Kerbin and we want to eject to Duna, so we just add up all the numbers to achieve that. Note the little flyby icon in the Mun trip we did. We want to add all the numbers to Duna that reach that same flyby icon. That\u0027s 930 \u002B 130 or 1060. You do that burn (at the right time and in the right direction) and your ship will encounter Duna, or at least be really close, and you may need up to 10m/s mid-course to fix your angle. You also will need a tiny bit to tweak your flyby so your periapsis is 60km away.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you\u0027re at that \u003Cabbr title=\u0022Periapsis\u0022\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u003C/abbr\u003E and you want to circularize, so you need to burn 250\u002B360 to do that. if all you want to do is get into ANY orbit (say, you\u0027re going to Ike instead of Duna) you\u0027d need to at least burn 250. But to land on Duna, you need an extra 360. You do those at once though so need 610, but if you\u0027re daring you can use Duna\u0027s atmosphere to do them for you.\n\u003C/p\u003E\n\u003Cp\u003E\nThen to land you need 1450, though really you can do it for almost nothing and let the air slow you down most of the way. Returning, though, you need 1450 to get back into orbit, 610 to eject back to Kerbin, 1060 to slow down at Kerbin back into a circular orbit, and 3400 to land at kerbin. As before, those last 2 can be reduced to almost 0 via aerobraking.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s basically it, all other planets are similar to Duna.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-08T04:24:08Z\u0022 title=\u002207/08/2021 04:24  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 8, 2021\u003C/time\u003E by Superfluous J\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-07-08T06:48:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224001184\u0022 data-ipsquote-contentid=\u0022203682\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625701897\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt makes no sense. For example, on the Mun part of the map, by 5120 does it mean the total Delta V to get there, or something else?\u003Cbr\u003E\nHelp would be greatly appreciated. Thanks! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, it means total (vacuum) deltaV to get there from Kerbin\u0027s surface.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming reasonable efficiency on manuevers, and no gravity assists.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}