{"TopicId":203794,"ForumId":112,"TopicTitle":"More drop down menus","CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-07-13T17:29:58Z","PageNum":1,"Articles":[{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-07-13T17:29:58Z","Content":"\n\u003Cp\u003E\nWith the amount of different menus and tools we are provided in the game I think this would be a sensible inclusion to the game in lieu of the toolbar at the top right of the last KSP. Perhaps a toolbar could still have a place for the most crucial of tools or maybe have it be more customizable with pinning tools such as is the case with many of our operating systems. In short though I think I am not alone in seeing the tool bar getting overly cluttered. That said, I understand that including a dropdown menu might not be aesthetically pleasing or fitting to the silly aspects of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-07-13T18:22:18Z","Content":"\n\u003Cp\u003E\nIt\u0027s really hard to say. There\u0027s benefits and drawbacks to both. I personally like to have everything in front of me. But there are times where there are so many functions that you have no choice but to have a directory structure.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-07-13T18:28:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224004157\u0022 data-ipsquote-contentid=\u0022203794\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626200538\u0022 data-ipsquote-userid=\u0022113880\u0022 data-ipsquote-username=\u0022shdwlrd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, shdwlrd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s really hard to say. There\u0027s benefits and drawbacks to both. I personally like to have everything in front of me. But there are times where there are so many functions that you have no choice but to have a directory structure.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is why I voted for both while knowing that could lead to more clutter. I do so banking on the belief that KSP 2 will have multi window support so more room for minor clutter will be available. But, like you, I too like to have things available so I don\u0027t have to click 5 times in a drop down to get to a function I use repeatedly\n\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2021-07-13T23:13:46Z","Content":"\n\u003Cp\u003E\nI personally am a fan of the idea of semi-merging the UI/UX of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/builder-ui\u0027s with the flight UI. Namely the sidenav to change UI \u0022contexts\u0022 pattern\n\u003C/p\u003E\n\u003Cp\u003E\nThis can be best compared to having an overlay of windows/UI-elements and a list of possible overlays on the left and right of your screen. Similar to the current \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E UI, which has a list of part-types and clicking on it opens up different contexts on the left of the screen.\n\u003C/p\u003E\n\u003Cp\u003E\nSo something like mechjeb would have to consolidate its multiple windows into these 2 \u0022side-nav\u0022 areas, which when selected would show floating windows with the relevant information. This would push a lot of complexity into the first button, and may create longer lists of buttons on the sides of the window, but would open up more possibilities on both sides of the screen once the sidenav \u0022category\u0022 is selected which can show anything from more windows/sub-views/UI anything.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224004161\u0022 data-ipsquote-contentid=\u0022203794\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626200893\u0022 data-ipsquote-userid=\u0022180102\u0022 data-ipsquote-username=\u0022mcwaffles2003\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, mcwaffles2003 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI do so banking on the belief that KSP 2 will have multi window support so more room for minor clutter will be available\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis would be amazing, but I doubt it would drop when the game first releases as very \u003Cstrong\u003Every\u003C/strong\u003E few games support these sorts of features. I can see VR dropping first, to support console players who wouldn\u0027t benefit from multi-monitor support as much and hopefully get this kind of feature down the line eventually.\n\u003C/p\u003E\n"}]}