{"TopicId":203840,"ForumId":112,"TopicTitle":"Does KSP 2 need three currencies? All Kerbals need is Enthusiasm!","CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2021-07-15T15:23:55Z","PageNum":1,"Articles":[{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2021-07-15T15:23:55Z","Content":"\n\u003Cp\u003E\nOne of the annoyances (to me) of KSP\u0027s career mode is the three currencies - Science, reputation and money.  Most especially annoying is the artificial link between scientific discovery and technological Research and Development!  In The Real World, it is social and political enthusiasm for space exploration that opens the purse-strings for tech development and rocket building.\n\u003C/p\u003E\n\u003Cp\u003E\nThis arbitrary clutch of currencies has helped drive me away from career mode. (The use of a tech tree is the other gameplay mechanism that has put me off career mode, but that\u0027s another suggestion I am cogitating.) The multiple-currency model is one much-used in many games, but I feel it isn\u0027t a natural fit for KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to propose an alternative, single currency: \u003Cstrong\u003EEnthusiasm\u003C/strong\u003E. Kerbals are profoundly enthusiastic! They make rockets because of enthusiasm, they go up in rockets because of enthusiasm, and they create new technologies because of enthusiasm. One can easily imagine that a population of Kerbals would become increasingly enthusiastic about spaceflight every time they learn of new rocketry achievements, new scientific discoveries and the creation of new colonies; and that enthusiasm would drive them to produce the means to advance the spaceflight industry.\n\u003C/p\u003E\n\u003Cp\u003E\nSo: as a game-play currency Enthusiasm would be earned by:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRocketry achievements such as first Kerbal into space, first Kerbal into orbit etc\n\u003C/li\u003E\n\u003Cli\u003E\nScientific discovery, whether made on the ground, in flight or in space\n\u003C/li\u003E\n\u003Cli\u003E\nGetting Kerbals back to Kerbin (or a colony with space for them to reside) safe and sound\n\u003C/li\u003E\n\u003Cli\u003E\nEven bigger, badder explosion with no loss of life would add some Enthusiasm to the pot (To earn Enthusiasm an explosion would have to be even bigger than the last Enthusiasm-earning explosion - you have to break the record every time.) It\u0027s OK to lose a new, bigger rocket, so long as your Launch Escape System has worked.\n\u003C/li\u003E\n\u003Cli\u003E\nSocial achievements such as creating habitation for Kerbals off-world\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm would diminish through:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBuilding rockets - it\u0027s back-breaking work!\n\u003C/li\u003E\n\u003Cli\u003E\nResearching technology - it\u0027s mind-numbing!\n\u003C/li\u003E\n\u003Cli\u003E\nDeaths\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm could be represented as a simple number, but I like the idea that it could additionally be represented as a graphic displaying a number of emojis of Kerbals who are emotionally invested in space exploration, with varying degrees of interest, enthusiasm and excitement. It could be described as the results of a continuous opinion-poll of the Kerbal population.\n\u003C/p\u003E\n\u003Cp\u003E\nI feel that this mechanism is a natural fit for the game and would reinforce one of the standout aspects of the game: the personalities of the Kerbals.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2021-07-15T16:02:57Z","Content":"\n\u003Cp\u003E\nCareer mode adds challenges to the game. If those challenges are unwanted and/or not needed, then there\u0027s sandbox mode.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make career mode even \u003Cem\u003Emore\u003C/em\u003E challenging, multiple constraints are offered. It\u0027s not just gathering research, it\u0027s gathering research \u003Cem\u003Ewhile managing a budget\u003C/em\u003E. A single currency would take that challenge away. Now you can go full out maximizing revenue, without worrying about science. Or the other way around.\n\u003C/p\u003E\n\u003Cp\u003E\nIf anything, I\u0027d like to see more interaction between them. Reputation influencing hiring costs, for instance. different types of research points required for different parts of the tech tree (materials, construction, performance, and so on)\n\u003C/p\u003E\n"},{"CreatedByName":"PlutoISaPlanet","CreatedById":206057,"CreatedDateTime":"2021-07-15T17:23:40Z","Content":"\n\u003Cp\u003E\nI\u0027m not a big fan of multiple currencies. I like things to be more mainline in games.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-15T17:23:54Z\u0022 title=\u002207/15/2021 05:23  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 15, 2021\u003C/time\u003E by PlutoISaPlanet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2021-07-15T17:50:14Z","Content":"\n\u003Cp\u003E\nIn my opinion there\u0027s pretty much only 2 currencies in career mode. I don\u0027t think I ever really cared about reputation or effects. What I really want to see is them make reputation actually matter in some way. But I do think 3 currencies makes career mode better. Especially if reputation is improved\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-07-15T18:06:06Z","Content":"\n\u003Cp\u003E\nBut again, I have to remind people that the career and science modes as we know them are going away. There will be a replacement mode for them. We have no specifics or anything beyond mentioning of this fact. The devs are aware of the shortcomings of these modes. They wouldn\u0027t have said they are replacing them if they didn\u0027t.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-07-16T18:50:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224005180\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626362635\u0022 data-ipsquote-userid=\u00222795\u0022 data-ipsquote-username=\u0022softweir\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2021 at 11:23 AM, softweir said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of the annoyances (to me) of KSP\u0027s career mode is the three currencies - Science, reputation and money.  Most especially annoying is the artificial link between scientific discovery and technological Research and Development!  In The Real World, it is social and political enthusiasm for space exploration that opens the purse-strings for tech development and rocket building.\n\u003C/p\u003E\n\u003Cp\u003E\nThis arbitrary clutch of currencies has helped drive me away from career mode. (The use of a tech tree is the other gameplay mechanism that has put me off career mode, but that\u0027s another suggestion I am cogitating.) The multiple-currency model is one much-used in many games, but I feel it isn\u0027t a natural fit for KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to propose an alternative, single currency: \u003Cstrong\u003EEnthusiasm\u003C/strong\u003E. Kerbals are profoundly enthusiastic! They make rockets because of enthusiasm, they go up in rockets because of enthusiasm, and they create new technologies because of enthusiasm. One can easily imagine that a population of Kerbals would become increasingly enthusiastic about spaceflight every time they learn of new rocketry achievements, new scientific discoveries and the creation of new colonies; and that enthusiasm would drive them to produce the means to advance the spaceflight industry.\n\u003C/p\u003E\n\u003Cp\u003E\nSo: as a game-play currency Enthusiasm would be earned by:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRocketry achievements such as first Kerbal into space, first Kerbal into orbit etc\n\u003C/li\u003E\n\u003Cli\u003E\nScientific discovery, whether made on the ground, in flight or in space\n\u003C/li\u003E\n\u003Cli\u003E\nGetting Kerbals back to Kerbin (or a colony with space for them to reside) safe and sound\n\u003C/li\u003E\n\u003Cli\u003E\nEven bigger, badder explosion with no loss of life would add some Enthusiasm to the pot (To earn Enthusiasm an explosion would have to be even bigger than the last Enthusiasm-earning explosion - you have to break the record every time.) It\u0027s OK to lose a new, bigger rocket, so long as your Launch Escape System has worked.\n\u003C/li\u003E\n\u003Cli\u003E\nSocial achievements such as creating habitation for Kerbals off-world\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm would diminish through:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBuilding rockets - it\u0027s back-breaking work!\n\u003C/li\u003E\n\u003Cli\u003E\nResearching technology - it\u0027s mind-numbing!\n\u003C/li\u003E\n\u003Cli\u003E\nDeaths\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm could be represented as a simple number, but I like the idea that it could additionally be represented as a graphic displaying a number of emojis of Kerbals who are emotionally invested in space exploration, with varying degrees of interest, enthusiasm and excitement. It could be described as the results of a continuous opinion-poll of the Kerbal population.\n\u003C/p\u003E\n\u003Cp\u003E\nI feel that this mechanism is a natural fit for the game and would reinforce one of the standout aspects of the game: the personalities of the Kerbals.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is the same as just making everything rely on money and just calling money enthusiasm. Doesn\u0027t this solution also yield the conundrum of \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nmeasure the temperature of space around a planet\n\u003C/li\u003E\n\u003Cli\u003E\nuse this discovery to research a completely unrelated technology\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNot to mention, the game is unbalanced as it is and making everything dependent on 1 currency, IMO, would be way harder to balance. \n\u003C/p\u003E\n"},{"CreatedByName":"Jack Mcslay","CreatedById":208257,"CreatedDateTime":"2021-07-16T19:41:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224005180\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626362635\u0022 data-ipsquote-userid=\u00222795\u0022 data-ipsquote-username=\u0022softweir\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2021 at 12:23 PM, softweir said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would like to propose an alternative, single currency: \u003Cstrong\u003EEnthusiasm\u003C/strong\u003E. Kerbals are profoundly enthusiastic! They make rockets because of enthusiasm, they go up in rockets because of enthusiasm, and they create new technologies because of enthusiasm.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf that\u0027s the case they better have a drill that pierces the heavens\n\u003C/p\u003E\n"},{"CreatedByName":"Akira_R","CreatedById":117470,"CreatedDateTime":"2021-07-22T20:40:14Z","Content":"\n\u003Cp\u003E\nReally interesting idea \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, I don\u0027t know if I\u0027m 100% on board with the single currency model (at least for a career mode), but I have been pleasantly surprised by making similar switches in the past. Just as an example I was a long time user of TAC life support, I liked the realism it offered, a number of mods I used began dropping their TAC-LS support in favor of \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS. I wasn\u0027t a fan of this as it was going from a 3 resource model to a more abstracted single resource model, I felt this took away a lot of the realism. After finally giving it a go though I found \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS just as enjoyable as TAC-LS, it reduced some of the complexity without reducing any of the difficulty and challenge that needing to consider life support adds to the game. Not a perfect analogy for this situation I know.\n\u003C/p\u003E\n\u003Cp\u003E\nIt could be a good alternative to the current science mode though. An addition that could be made for something a bit more like career mode could be adding basically a second resource such as a break through discovery mechanic.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nMake either certain levels of the tech tree or certain branches of it locked behind a break through discovery requirement. I\u0027m thinking things like the more futuristic propulsion systems, and any other more advanced things that you need to visit the other stars and maybe some of the more advanced totally self sufficient colony buildings (or however that system will work).\n\u003C/li\u003E\n\u003Cli\u003E\nBreak through discoveries have a % chance of being gained whenever conducting any type science experiment in a situation other than landed at Kerbin.\n\u003C/li\u003E\n\u003Cli\u003E\nThe % chance increases as you progress further out into the solar system with the hardest to reach bodies providing the highest chance of making a discovery.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThis would give reason to do more than just grind up Enthusiasm at Kerbin until you have entirely unlocked the tech tree, and it would give reason for repeat missions to places. Some additional features that could make it interesting and open up more gameplay options.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou could have actions that could increase the % chance. For instance having a crewed lab could give a boost to discovery % on that craft or in that \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nMaking a discovery in a specific situation could reduce the % chance for any further discoveries in that same situation. Or only reduce it for that type of experiment in that same situation.\n\u003C/li\u003E\n\u003Cli\u003E\nYou could require that a kerbal must be involved, or that only certain high tier science equipment can make the discoveries without a kerbal present.\n\u003C/li\u003E\n\u003Cli\u003E\nYou could have some kind of designated research station parts, for both ground and orbit, that are guaranteed to produce a breakthrough after a given amount of time in operation, something pretty long like 10-20 years by default.\n\u003Cul\u003E\u003Cli\u003E\nRequire the parts to be staffed\n\u003C/li\u003E\n\u003Cli\u003E\nThey could have high power requirements and/or require various expendable materials that you would need to resupply periodically, making it so that you need to have infrastructure set up to support them. This would need to be balanced such that periodic resupply flights don\u0027t get overly tedious.\n\u003C/li\u003E\n\u003Cli\u003E\nHave ways to decrease the time, again being further out in the system could reduce it, or have it so if you supply materials that can only be gathered in places like the Jool system, Eeloo, etc they will greatly reduce the time requirement.\n\u003C/li\u003E\n\u003Cli\u003E\nPerhaps could tie into a procedural mission system, things like some parts failing and you need to bring out new stuff, scientist has an idea and needs some special material that can only be gathered from a certain area in Eve\u0027s ocean or something and supplying it would dramatically reduce time to breakthrough.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAny ways just spit-balling some ideas, basically I really want to see anything that will provide some kind of mid term goals for gameplay, it\u0027s one of the big problems I face when I play KSP, the contracts rarely inspire me to do anything interesting, I will often set myself a midterm goal like establishing a gateway station around Mun and a ground outpost on the Mun. But then I will complete that and just be stuck with \u0022ok I did the thing... Now what should I do??\u0022 and kind of get stuck trying to decide what my next steps should be.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2021-07-22T21:39:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224005180\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626362635\u0022 data-ipsquote-userid=\u00222795\u0022 data-ipsquote-username=\u0022softweir\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2021 at 4:23 PM, softweir said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo: as a game-play currency Enthusiasm would be earned by:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRocketry achievements such as first Kerbal into space, first Kerbal into orbit etc\n\u003C/li\u003E\n\u003Cli\u003E\nScientific discovery, whether made on the ground, in flight or in space\n\u003C/li\u003E\n\u003Cli\u003E\nGetting Kerbals back to Kerbin (or a colony with space for them to reside) safe and sound\n\u003C/li\u003E\n\u003Cli\u003E\nEven bigger, badder explosion with no loss of life would add some Enthusiasm to the pot (To earn Enthusiasm an explosion would have to be even bigger than the last Enthusiasm-earning explosion - you have to break the record every time.) It\u0027s OK to lose a new, bigger rocket, so long as your Launch Escape System has worked.\n\u003C/li\u003E\n\u003Cli\u003E\nSocial achievements such as creating habitation for Kerbals off-world\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm would diminish through:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBuilding rockets - it\u0027s back-breaking work!\n\u003C/li\u003E\n\u003Cli\u003E\nResearching technology - it\u0027s mind-numbing!\n\u003C/li\u003E\n\u003Cli\u003E\nDeaths\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRename KSP 1 Science to Enthusiasm and give player science for explosions. Got it.\n\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2021-07-22T23:51:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224008136\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626989967\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRename KSP 1 Science to Enthusiasm and give player science for explosions. Got it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd finance rocket building with it.\n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2021-07-23T14:05:25Z","Content":"\n\u003Cp\u003E\nNever fails that someone presents an idea for change and other people attack it simply because it is change.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat interests me here is how often people play KSP but want it to be something else. A prime example are the people who instantly add mods to make weapons, because what\u0027s a game without weapons? Or people who worry about \u0022balance\u0022 and making the game \u0022too easy\u0022 when it is basically (even in career mode) a sandbox game where there are no real measures of \u0022winning\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThe most obvious inherent goal is to land on Mun and return, but most people accomplish this reasonably quickly. The second most obvious inherent goal is to research the entire tech tree, but in a stock game with the stock tech tree this can be accomplished entirely in the Kerbin orbital space.\n\u003C/p\u003E\n\u003Cp\u003E\nGoing to Duna and coming back is a pretty obvious stretch goal.\n\u003C/p\u003E\n\u003Cp\u003E\nBut there is nothing wrong with this \u0022enthusiasm\u0022 idea. To me it actually sounds not perfect, but more promising than the current career mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m guessing KSP2 devs have their own ideas for how to change KSP. Guess we\u0027ll see, eventually.\n\u003C/p\u003E\n"},{"CreatedByName":"Akira_R","CreatedById":117470,"CreatedDateTime":"2021-07-23T22:04:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224005198\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626364977\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2021 at 9:02 AM, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCareer mode adds challenges to the game. If those challenges are unwanted and/or not needed, then there\u0027s sandbox mode.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make career mode even \u003Cem\u003Emore\u003C/em\u003E challenging, multiple constraints are offered. It\u0027s not just gathering research, it\u0027s gathering research \u003Cem\u003Ewhile managing a budget\u003C/em\u003E. A single currency would take that challenge away. Now you can go full out maximizing revenue, without worrying about science. Or the other way around.\n\u003C/p\u003E\n\u003Cp\u003E\nIf anything, I\u0027d like to see more interaction between them. Reputation influencing hiring costs, for instance. different types of research points required for different parts of the tech tree (materials, construction, performance, and so on)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTL;DR: Complexity =\\= challenge or difficulty. The most important thing a gameplay system/mechanic can do is give the player the opportunity to make meaningful decisions that impact their gameplay experience, single resource systems can easily do this while the current system does not.\n\u003C/p\u003E\n\u003Cp\u003E\n-----------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nI have to disagree with the premise of your argument. Having 3 currencies is not inherently more challenging than having 1 currency, adding these \u0022multiple constraints\u0022 is only guaranteed to add complexity, and complexity is not the same thing as challenge or difficulty. Nor does complexity inherently facilitate meaningful gameplay decisions, which is THE most important thing any gameplay system should do. While complexity, when done correctly and in the correct situation, can add these types of things to a game, more often than not the only thing it adds is unneeded tedium or clutter. I would argue the current career system does nothing to facilitate any kind of interesting or meaningful decision making. In many ways a single currency could be set up to be far more difficult or challenging than a 3 currency model, and present the player with much more meaningful decisions.\n\u003C/p\u003E\n\u003Cp\u003E\nAllow me to illustrate; what can you do with funds? Build vehicles, that\u0027s pretty much it and, if you turn it on, buy part unlocks. What can you do with science? Unlock techs. That\u0027s it. What can you do with reputation? No seriously anybody know what it\u0027s for??? Lol ok you use it to apply the policy things or whatever they are called which give various bonuses to your space program. Each resource is really only used for a single thing with no real overlap aside from turning on purchased part unlocking. This means the only real decision you need to make is \u0022do I save this resource or spend it now\u0022. If we consider the real world for a short moment, research costs money, in fact R\u0026amp;D costs are typically far far higher than manufacturing costs. Not that I think realism is a good argument to justify a game mechanic but consider the decision that has to be made, how much money do you devote to increasing production vs how much do you spend on developing something new. A single resource system would add more of this type of decision making to the game; having to decide how you want to allocate your resources, spend more building rockets, spend more researching new tech, or spend more now to add bonuses that increase how quickly you get more resources. This very very basic example where you just merge all of the resources to one without changing any of the other systems would still add some meaningful management decision making to the career experience, something which is currently very very lacking.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother good example of this is the system in Kerbal Construction Time, one of the mods I typically can\u0027t play without now. For those that don\u0027t know it makes things take actual time; building vehicles, unlocking techs, and upgrading facilities is no longer instantaneous. It has a single resource that you can spend in a huge variety of ways, increase the production rate of rockets or increase the production rate of space planes, add additional production lines so that you can build multiple things at once, add and increase the science point reward you get for building vehicles, increase the speed at which new techs are unlocked etc. By adding this single resource to the game it gives the player a ton of choices that have a meaningful and tangible impact on their gameplay experience.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-23T22:11:10Z\u0022 title=\u002207/23/2021 10:11  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 23, 2021\u003C/time\u003E by Akira_R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kspnerd122","CreatedById":199169,"CreatedDateTime":"2021-07-26T14:08:07Z","Content":"\n\u003Cp\u003E\nHeres how I feel it should be, 1st off, players start off with similar tech to what we have now, however, players who want to unlock new technologies will need to go to places and examine things such as ruins of abandoned kerbal bases on the mun and minmus, on duna, the remains of a old rover, etc. pretty much, you find a anomaly, and then set up a outpost to examine it and get more technology after a few months to years. Colony remains for example will provide technologies to improve habitation, or finding an old solar powered rover will let you make solar panels more effective\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-07-26T15:25:53Z","Content":"\n\u003Cp\u003E\nI quite like this idea in principle. It\u0027s hard to guess how far along Intercept already is on this. My guess is even if the cake has not been baked the batter is probably mixed. But I don\u0027t see the harm in speculating. I tend to agree there should be no more than 2 currencies. Technically speaking because parts will likely have resource costs (ore, uranium, fuel) you could even get away with zero. The real trick here is how the game will handle the transition from terrestrial resources to off-world \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E resources. This will likely begin relatively early in the progression of the game, so any paradigm tailored to paying for rocket parts and research on Kerbin will either have to work when spending gathered resources or transition to them. There might be loopholes using supply routes later on, but I would think short of that rockets built off-world would spend \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E resources rather than money or enthusiasm. So if you have a central currency (whatever you chose to call it) you would need to think about how it remains useful after most of your production has moved off of Kerbin. \u003Cbr\u003E\u003Cbr\u003E\nLet\u0027s consider a few different frameworks:\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EA) 1 Currency\u003C/strong\u003E - Enthusiasm is generated by completing goals and discovering anomalies. Parts cost enthusiasm on Kerbin but \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E resources on other worlds. Research always costs enthusiasm.\u003Cbr\u003E\u003Cbr\u003E\n- The pros  are that its relatively simple and no-fuss. It also incentivizes building colonies because the less enthusiasm you\u0027re spending on parts the more you can devote to research. The question for me is whether we want do ditch the idea of science experiments entirely? The other issue is what happens after the tech tree is complete and you\u0027re building almost everything off-world? Does Enthusiasm cease to have meaning?\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EB) 1.5 Currencies -\u003C/strong\u003E Enthusiasm is generated either by completing goals or by processing raw data from experiments. This can happen on Kerbin or in off-world labs. Parts cost both \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E resources and Enthusiasm on Kerbin and off. On Kerbin resources can be/must be purchased with Enthusiasm or delivered via mining. \u003Cbr\u003E\u003Cbr\u003E\n- This version would add back in a science mechanic and experiments but treat data as a raw resource that could be converted into enthusiasm. It would also give a purpose to off-world labs. It would still incentivize colonies because parts would cost less enthusiasm, but even parts built off-world would cost \u003Cem\u003Esome\u003C/em\u003E. If experiments continue to be a part of the game though I think some serious work would need to go into streamlining them, making them harvest automatically, radically increasing the rate at which scientific value is depleted from each planet, etc. to reduce KSP1\u0027s grind problem.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EC) Zero Currencies -\u003C/strong\u003E Completing different goals gives different sets of rewards, including raw materials on Kerbin and/or population boosts off-world. There is no intermediary currency. Nodes on the tech tree are also rewarded based on specific goals being achieved.\n\u003C/p\u003E\n\u003Cp\u003E\n- In this version we\u0027ve eliminated all non-harvested currencies and just dolled out rewards directly. This might allow for different goals like landing on Eve or building a colony on Duna to have fine-tuned and tailored rewards, either in the form of tech unlocks, minerals, rare fuels, etc. While a really well balanced set of goals and rewards could be fun I worry this would be too inflexible for most players, as they\u0027d basically HAVE to do specific missions in a somewhat specific order in order to progress as they wished. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nDifferent aspects of these could be swapped around or augmented. I lay these out only for discussion. The other question is if we are eliminating reputation how is it being replaced? Right now increasing reputation unlocks more ambitious and further flung contracts, but given that they\u0027re all random and no one particularly likes them its a bit of a moot point. Still, if there is a set of more and more ambitious goals how are they being unlocked? Is it linear? or a tree? Or are there different levels? If the latter what are the conditions that need to be met to progress to the next tier of missions?\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-26T22:48:13Z\u0022 title=\u002207/26/2021 10:48  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 26, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stratennotblitz","CreatedById":213042,"CreatedDateTime":"2021-07-27T02:06:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224005180\u0022 data-ipsquote-contentid=\u0022203840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221626362635\u0022 data-ipsquote-userid=\u00222795\u0022 data-ipsquote-username=\u0022softweir\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2021 at 11:23 AM, softweir said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of the annoyances (to me) of KSP\u0027s career mode is the three currencies - Science, reputation and money.  Most especially annoying is the artificial link between scientific discovery and technological Research and Development!  In The Real World, it is social and political enthusiasm for space exploration that opens the purse-strings for tech development and rocket building.\n\u003C/p\u003E\n\u003Cp\u003E\nThis arbitrary clutch of currencies has helped drive me away from career mode. (The use of a tech tree is the other gameplay mechanism that has put me off career mode, but that\u0027s another suggestion I am cogitating.) The multiple-currency model is one much-used in many games, but I feel it isn\u0027t a natural fit for KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to propose an alternative, single currency: \u003Cstrong\u003EEnthusiasm\u003C/strong\u003E. Kerbals are profoundly enthusiastic! They make rockets because of enthusiasm, they go up in rockets because of enthusiasm, and they create new technologies because of enthusiasm. One can easily imagine that a population of Kerbals would become increasingly enthusiastic about spaceflight every time they learn of new rocketry achievements, new scientific discoveries and the creation of new colonies; and that enthusiasm would drive them to produce the means to advance the spaceflight industry.\n\u003C/p\u003E\n\u003Cp\u003E\nSo: as a game-play currency Enthusiasm would be earned by:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRocketry achievements such as first Kerbal into space, first Kerbal into orbit etc\n\u003C/li\u003E\n\u003Cli\u003E\nScientific discovery, whether made on the ground, in flight or in space\n\u003C/li\u003E\n\u003Cli\u003E\nGetting Kerbals back to Kerbin (or a colony with space for them to reside) safe and sound\n\u003C/li\u003E\n\u003Cli\u003E\nEven bigger, badder explosion with no loss of life would add some Enthusiasm to the pot (To earn Enthusiasm an explosion would have to be even bigger than the last Enthusiasm-earning explosion - you have to break the record every time.) It\u0027s OK to lose a new, bigger rocket, so long as your Launch Escape System has worked.\n\u003C/li\u003E\n\u003Cli\u003E\nSocial achievements such as creating habitation for Kerbals off-world\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm would diminish through:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBuilding rockets - it\u0027s back-breaking work!\n\u003C/li\u003E\n\u003Cli\u003E\nResearching technology - it\u0027s mind-numbing!\n\u003C/li\u003E\n\u003Cli\u003E\nDeaths\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEnthusiasm could be represented as a simple number, but I like the idea that it could additionally be represented as a graphic displaying a number of emojis of Kerbals who are emotionally invested in space exploration, with varying degrees of interest, enthusiasm and excitement. It could be described as the results of a continuous opinion-poll of the Kerbal population.\n\u003C/p\u003E\n\u003Cp\u003E\nI feel that this mechanism is a natural fit for the game and would reinforce one of the standout aspects of the game: the personalities of the Kerbals.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think we should be able to create personal currencies as our population reaches a certain threshold, the more you trade the more value your currency will have per example 1 kerb-coin = 1 ore etc, it\u0027d add complexity of trade but represent the real world in a more correct manner\n\u003C/p\u003E\n"}]}