{"TopicId":203971,"ForumId":51,"TopicTitle":"Into the Snarkiverse","CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-23T22:23:25Z","PageNum":1,"Articles":[{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-23T22:23:25Z","Content":"\n\u003Cp\u003E\nYesterday my graphics card broke. Probably. I can\u0027t be sure that it actually is broken, but it just stopped outputting video with no warning and many attempts to resolve it (including reinstalling Windows, which caused some issues like \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E forgetting all my KSP instances; fortunately they\u0027re all stored on an external disk so they\u0027re all safe) didn\u0027t fix anything. It\u0027s still under warranty so I\u0027ve sent it back for repair or replacing, but in the meantime I\u0027m stuck with no GPU and so very limited gaming.\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately, I know I can run KSP on just integrated graphics after doing so on my old PC back home, with the caveat that looking down at terrain causes the frame rates to tank horribly, so I threw together a mod pack that has zero graphics mods at all and not that much of anything else but which should be pretty fun to play.\n\u003C/p\u003E\n\u003Cp\u003E\nPlanet pack- Snarkiverse. Rearranges stock bodies, doesn\u0027t add any new ones to my knowledge so should be fine performance-wise. (I tried Grannus and it just couldn\u0027t handle it, the game was stuttering badly on the main menu screen...)\n\u003C/p\u003E\n\u003Cp\u003E\nOther key mods- Kerbalism with all the trimmings, Stage Recovery to catch those discarded boosters and a few minor QoL things like Simple Logistics, MechJeb and Deployable Batteries. This will be a hard mode career, with some settings (e.g. science returns) made even harder than hard mode but reverts/reloads on.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd so we enter the Snarkiverse!\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch 1: boring old Jumping Flea-esque thing to get science.\u003Cimg alt=\u00224ciql6x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4ciql6x.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDeath Star not yet confirmed...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WzOdIiQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WzOdIiQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch 2: slap some fuel tanks and a Swivel on it instead of the Flea \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E and try to land it in the water for a contract (test Swivel splashed) as well as getting more science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lM51n56.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lM51n56.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI forgot about the whole \u0022limited ignitions\u0022 thing and the engine blew up. No contract, but Val went swimming to get a bit more science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xM0GGoM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xM0GGoM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne soggy spacesuit sent over to R\u0026amp;D to be hung up behind their latest engine prototype to dry off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RGloogs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RGloogs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLots of science experiments, but many have no value because the pod has limited data storage and quickly ran out in the face of multiple science experiments.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch 3: nearly identical to the last one, removed a fuel tank and successfully splashed down with engine intact to complete the contract. More science gathered but again lack of data capacity was an issue.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UGRykJR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/UGRykJR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch 4: Bigger and better than before, went a good distance but missed reaching space by about 2km. Despite doubling the pod\u0027s data capacity to the maximum possible (a heady 2MB) it still ran out of data capacity.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222lNoW4g.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2lNoW4g.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bTCwAc1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/bTCwAc1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch 5: contract to throw a Thumper high into the atmosphere means I can use the Thumper to shoot for orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223jRU6S9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3jRU6S9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut once again, it fell slightly short.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k42vIvE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/k42vIvE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd once again, data storage ran out so limited science gained; an antenna was included but the flight path didn\u0027t have any ground stations under it for most of the time so only a little data was transmitted.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225vlHEA3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5vlHEA3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve made some adjustments to the mods- Restock is gone, Minimum Ambient Lighting is added to make night screenshots properly visible and a couple of utilities were added or removed.\n\u003C/p\u003E\n\u003Cp\u003E\nFull album with contracts and stuff: \u003Ca href=\u0022https://imgur.com/a/a8dteJb\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/a8dteJb\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI might come back tomorrow and edit this report to turn it into a story of some sort to make it more interesting, both for anyone reading it and for me doing it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-02T16:25:16Z\u0022 title=\u002209/02/2021 04:25  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 2, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003Cbr\u003EChanged title\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-24T10:00:42Z","Content":"\n\u003Cp\u003E\nStory mode activated!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EINTO THE SNARKIVERSE\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEveryone on Kerbin remembers where they were when The Anomaly occurred.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ground shook all over the world. The Mun did a handbrake turn, transforming its circular equatorial orbit into a highly inclined and eccentric one that played havoc with the tides. Minmus disappeared into the distance; a strange lump of rock appeared close to Kerbin, though it was hard to tell if it orbited Kerbin itself or was just in a strange overlapping orbit of Kerbol- some called it Dres, others argued there was no such thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the other planets, that was a mystery yet to be solved. It took several decades, a great deal of effort and the rediscovery of magnets, but at last the Kerbals were ready to venture out from their homeworld to find out just what kind of solar system they now lived in.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is their story.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbal Space Centre: grand words for a collection of rundown huts, converted shipping containers and corrugated iron shacks. The team was small- twenty in all- and technology was primitive, little more than old barrels filled with volatile chemicals and parachutes sewn together by the residents of a local care home. Still, it was a start.\n\u003C/p\u003E\n\u003Cp\u003E\nTheir first launch was the aptly named Rocket 1, piloted by plucky young daredevil Jebediah. Already (in)famous for crashing a home-made microlight into his school when the engine fell off, Jeb had at least passable piloting skills and a total lack of fear that made him the perfect candidate for being strapped into the untested and possibly deadly contraption known as Rocket 1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224ciql6x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4ciql6x.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Mun hung large in the sky during this launch, looming like \u0022that planet-busting space station thingy from that film with the laser swords and stuff,\u0022 as Jeb put it; though he was pulling five gees at the time and most people knew what he meant.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the flight itself went fine and the rocket landed safely, the impact with the water caused the flimsy fins on the bottom to disintegrate. A useful haul of scientific data was gathered, much of it from Jeb\u0027s observations (though how \u0022I can see my house from here!\u0022 is scientifically valuable remains to be seen...) but the limited data storage capacity in the pod was an issue. Future launches will use upgraded hard drives with a mind-blowing \u003Cem\u003Etwo megabytes\u003C/em\u003E of storage to try and cope with the greater data volumes produced by running more instruments.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aduEdAX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aduEdAX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Mun sped over the horizon as Jeb\u0027s pod got fished out of the ocean; meanwhile a second rocket was being prepared, using lessons learnt from the first. It also included a thermometer, previously used to show if the coffee pot had gone cold. They were going to use a larger solid motor than the first, but then a representative of Jeb\u0027s Junkyard turned up and offered a significant payment if they could test their new Swivel liquid-fuelled rocket engine in the sea. The rep seemed as confused as everyone else about doing it in the sea, but a contract\u0027s a contract and funds are funds.\n\u003C/p\u003E\n\u003Cp\u003E\nRocket 2 flew off the pad, gaining speed and altitude and gathering data while pilot Valentina added her own observations (\u0022Wheeeeee! This is fun!\u0022). Val was widely regarded as more level-headed than her younger brother Jeb, so it came as a surprise to everyone when she managed to blow up the engine:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lM51n56.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lM51n56.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce again the fragile fins snapped off on splashdown, but while waiting for the recovery boat to come and collect her Val popped open the hatch- and promptly fell into the sea. Fortunately her \u0022spacesuit\u0022 was buoyant enough to keep her afloat, so she spent a few minutes swimming around and \u0022doing science\u0022 (\u0022Bleugh, this water tastes like rocket fuel!\u0022) before discovering that the pod\u0027s hard drive was full and deciding to keep her reports saved to her suit\u0027s internal memory instead.\n\u003C/p\u003E\n\u003Cp\u003E\nAn investigation quickly revealed that multiple engine restarts had caused a catastrophic fuel leak that destroyed the engine. The Jeb\u0027s Junkyard rep handed over a second Swivel, along with strict instructions to avoid restarting it too many times.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter replacing the engine and removing one of the five small fuel tanks above it, the same rocket was launched again, now wearing the moniker of Rocket 3 and with second year chemical physics student Robert at the controls. While less adventurous and more timid than Val and Jeb, Bob\u0027s technical knowledge was put to good use as he monitored the data from several science experiments and landed the craft with its engine intact to run the required tests.  Sadly the official photographer had gone for lunch at that point so no photos were taken of the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nMere minutes after the Jeb\u0027s Junkyard rep left after handing over the final contract payment, a second rep from OMB Demolition turned up wanting them to test out their new \u0022decouplers\u0022. While the idea of attaching even small quantities of explosives to an already highly explosion-prone rocket made some (Bob) nervous, chief designer Wernher could see the utility of separating bits of rocket from each other and agreed to test the radial separator on the launch pad.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then promptly ignored that request when creating Rocket 4, which used three solid motors to lift it off the pad, then ignited the main engine when the boosters burnt out and discarded the spent boosters with those new-fangled separators. It was loaded with all the science experiments- a barometer and radiation sensor were added to join the thermometer and those \u0022mystery goo\u0022 things- and had enough fuel to make it all the way to space, if only briefly.\n\u003C/p\u003E\n\u003Cp\u003E\nIt should have been engineering student William\u0027s turn in the pod, but Jeb heard \u0022going into space\u0022 and immediately pushed to the front of the queue. His enthusiasm was misplaced- the ascent profile went too far downrange and ended up reaching an apoapsis of 68 kilometres, still inside the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222lNoW4g.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2lNoW4g.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb wasn\u0027t happy...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd neither were the science team- once again the pod\u0027s hard drive got filled up with data even with an antenna to try and transmit some of it. There wasn\u0027t anything they could do about it though, 2MB was the most they could squeeze in.\n\u003C/p\u003E\n\u003Cp\u003E\nThe OMB rep was also unhappy at them using the separators without doing the tests, so to placate him they decided to run that test on the next launch.\n\u003C/p\u003E\n\u003Cp\u003E\nThe accounts team (Mortimer and his pot plant so far) were happy though- those three SRBs had been fitted with parachutes and came back down to the launchpad in almost pristine condition, if a little charred around the edges.\n\u003C/p\u003E\n\u003Cp\u003E\n And then yet another rep arrived, this time wanting them to take a Thumper solid booster and launch it to well over forty kilometres of altitude. Wernher saw an opportunity and swapped the three little Flea boosters for a single Thumper.\n\u003C/p\u003E\n\u003Cp\u003E\nRocket 5 was the big one- the first attempt at getting into orbit. Jeb would have leapt at the chance to fly that one, but Jeb was still waiting for the recovery boat to come and pick him up so big sister Val got the flight instead. She made sure to fire that separator on the pad to make the OMB rep happy, then fired up the Thumper and headed for space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223jRU6S9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3jRU6S9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut alas, some combination of trajectory, design and piloting meant that she was just short of reaching orbit. A disappointing result, yes, but Val still made it into space and reached over 120km altitude, plus the trajectory meant there was plenty of time to gather scientific data from outside the atmosphere. Once again the memory ran out, something that really needs addressed soon; the antenna on top of the pod was of limited use since much of the flight was over the ocean without a signal to the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k42vIvE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/k42vIvE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal landed on the far side of Kerbin, a very long way from the Space Centre and somewhere near some mountains; it was dark so she couldn\u0027t tell where exactly she was. Search teams have been deployed to try and find her and bring her, the rocket and that valuable data back, but the sun was setting at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E so everyone  packed up and headed to the local pub for a celebration. Fuelled by contract money and a lot of bonuses from the Kerbin World-Firsts organisation for breaking speed and altitude records, they partied long into the night- except Jeb who was horribly seasick, and Val who was dozing in her pod, out of radio contact, waiting for the recovery teams to find her.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-24T10:02:27Z\u0022 title=\u002207/24/2021 10:02  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 24, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-24T15:13:49Z","Content":"\n\u003Cp\u003E\nDay 2 of the Space Program and there were more than a few headaches around. Jeb turned up in the middle of the party and was a bit miffed that they were partying without him (and that Val had beaten him to space), and since he was the least hungover (and Val still wasn\u0027t back yet) he got to fly Rocket 6.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bU6oTQO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/bU6oTQO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the data from the previous launch to work with, the ascent trajectory was better this time and Jeb made it into orbit- with fuel to come back too!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QKpOZiq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QKpOZiq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe smugness was unbearable...\n\u003C/p\u003E\n\u003Cp\u003E\nAfter letting all the experiments run through, Jeb turned retrograde and fired the engine to come back. There was some concern about how the little \u0022Pug\u0022 engine would handle the heat of re-entry, but it managed fine and Jeb landed without any issues.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228PgPQAt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8PgPQAt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal returned while Jeb was still being located and took to the sky again in Rocket 7, modified from the previous versions with a brand new probe core on the nose. A \u003Cem\u003Espherical\u003C/em\u003E probe core, which wasn\u0027t particularly aerodynamic and meant that for the second time in as many launches and as many days, Val ended up just short of orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cKCiBD6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cKCiBD6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe was out of radio contact with \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E by the time she landed, so didn\u0027t have to listen to little brother Jeb\u0027s incessant smugness. Unlike everyone else at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and the local area.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DJolczo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/DJolczo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSensing an opportunity, Bill and Bob teamed up with Wernher to create a crewless craft using that new-fangled probe doodah, sticking it inside a service bay to avoid the (completely un)aerodynamic issues of Rocket 7.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221VGfNqK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/1VGfNqK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith no reaction wheels for attitude control and no \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E on the probe, this launch was a bit tricky to control. The upper stage used a Swivel rather than the gimbal-less Pug so it could actually point in the right direction. Probe 1 made it all the way into orbit, but by that point Jeb\u0027s mission had collected most of the science from low orbit so there wasn\u0027t much left for the probe to mop up.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JeESckH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JeESckH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel cells worked as intended and the probe came back intact, both good results.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat followed was a veritable smorgasbord of probe-related tomfoolery, some of which were more successful than others. When it got dark at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E they sent the probes over to the Dessert Launchsite and then to Woomerang Launchsite to keep the science rolling in.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224XCLBLf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4XCLBLf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qiaR0fu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qiaR0fu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022waIyuBk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/waIyuBk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JJpjZRP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JJpjZRP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis particular rocket didn\u0027t go according to plan...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JmhvGDm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JmhvGDm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis one was supposed to be another orbital satellite, but a catastrophic launch failure and a lack of parachutes meant only quick reactions and a well-timed suicide burn averted the complete loss of the probe:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227peRzG8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7peRzG8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Z1rXJrn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Z1rXJrn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ITS9LvT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ITS9LvT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll the probes aimed at the polar ice caps failed for one reason or another, the last one because it was just going too fast to slow down in time for the parachutes to open; Bill fired them anyway but they ripped off due to excess speed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yf1HMJv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/yf1HMJv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then the biggest success- Highshot 1, intended simply to go as high as possible. It crossed through the radiation belts, past Kerbin\u0027s rings (another product of The Anomaly) and up to over 3000km altitude, gathering science and sending it back until its experiments were run and its batteries were dead.\n\u003C/p\u003E\n\u003Cp\u003E\nDespite having no power, no control and re-entering at nearly 3km/s parachute first (and with 120% re-entry heating too!), it survived the descent and landed safely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022diEopLv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/diEopLv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe team at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E are in a bit of a quandary- to make probes useful they need reaction wheels, but to get reaction wheels they need science and to get science they need to launch more probes, which they can\u0027t control properly. This might mean someone has to fly the first mission to the Mun in person, in a pod, before the probes can be sent out to land there.\n\u003C/p\u003E\n\u003Cp\u003E\nA new campaign was started, intending to land probes on the Mun in different places, with a few aerospace companies taking an interest and starting to stump up bigger financial rewards for Mun-related activities. Jeb was all for the \u0022free ice cream\u0022 campaign instead, but was outvoted.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/63t9RqI\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/63t9RqI\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-07-25T00:09:13Z","Content":"\n\u003Cp\u003E\nNeat!\u003Cbr\u003E\nWhat mods do you have?\u003Cbr\u003E\n(Besides Restock)\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-25T07:18:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224009144\u0022 data-ipsquote-contentid=\u0022203971\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627171753\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNeat!\u003Cbr\u003E\nWhat mods do you have?\u003Cbr\u003E\n(Besides Restock)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot much- Snarkiverse, obviously; Bon Voyage, MechJeb, Stage Recovery, Simple Logistics; Kerbalism plus the Kerbalism Companion Calculator to do antenna range calculations; I’ve also just added Cryo Engines, Waterfall (PC can just about handle it), BetterSRBs, SSR MicroSat, OctoSat, Blur Steel and X-20 Moroz, though most of those parts are much later in the tech tree than I’ve got to so far, and Kerbin’s Smol Rings is the sole graphics-related addition. I considered Luciole, but the engines are too \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E for my liking. Also Strategia, because stock strategies are a bit boring, though some of the Strategia stuff doesn\u0027t work that well with Kerbalism so I might drop that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-25T12:10:44Z\u0022 title=\u002207/25/2021 12:10  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 25, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-07-25T12:17:15Z","Content":"\n\u003Cp\u003E\nAbsolutely epic! Keep it going, please! I love this.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-25T13:07:57Z","Content":"\n\u003Cp\u003E\nBill: So, what do you think?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: ...\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Yeah, it\u0027s a bit unconventional but it\u0027s the best we could do with the current part limits?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Huh?\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Er, I mean, health and safety regulations \u003Csub\u003EorsomethinglikethatIdunno...\u003C/sub\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal: ...\n\u003C/p\u003E\n\u003Cp\u003E\nBill: It\u0027s going to fly past the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Did someone say-\n\u003C/p\u003E\n\u003Cp\u003E\nVal: DIBS!\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd so Munshot 1 lifted off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223FE1FpP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3FE1FpP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt has one \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E, OK? It\u0027s the best we could do.\n\u003C/p\u003E\n\u003Cp\u003E\nDuring this mission Val reported seeing a series of small, faint rings around Kerbin; later the same rings were spotted on the ground. Where did they come from? How did they get there? Are they made of sherbet or icing sugar? All these and more questions will need to be answered, but that\u0027s not what we\u0027re here for now.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to launch into a 60 degree orbit by hand with a rocket with lopsided thrust is a rather, um, \u003Ci\u003Einteresting\u003C/i\u003E experience, but a quick plane change in orbit fixed that. Val did the transfer burn so her orbit overlapped the Mun\u0027s, then just had to sit and wait for a few days until they both reached the same place at the same time. The Mun at periapsis is inside Kerbin\u0027s outer radiation belt now so spending several days getting lightly irradiated wasn\u0027t the best idea ever...\n\u003C/p\u003E\n\u003Cp\u003E\nIt was worth it though:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Hcu6bYX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Hcu6bYX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA safe flyby of the Mun, huge milestone bonuses due to the Mun Probes Strategia strategy and a load of science too. The only problem was that after leaving the Mun\u0027s gravity Val found herself on a very suborbital trajectory; burning her remaining fuel helped a bit, but re-entry was brutal and she pulled over 16G as her pod slammed into the lower atmosphere. When she came around again after blacking out from the excessive G-forces, she found herself floating down under parachutes to land in the middle of nowhere. AGAIN.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022160CD05.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/160CD05.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLook, Val, if you want to spend some time alone all you have to do is ask, OK? This whole \u0022landing in the middle of nowhere\u0022 thing is getting out of hand, it costs money to send those recovery crews out to get you.\n\u003C/p\u003E\n\u003Cp\u003E\nFresh from the success of Munshot 1, Munshot 2 was launched to orbit and then land on the Mun. Unlike Munshot 1, all later models are probes and use a more conventional booster to get into space. Munshot 2 struggled to reach orbit at all due to some aerodynamic instability and while it made orbit of the Mun with fuel to spare, there wasn\u0027t enough left to try and land- at least not in one piece!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vlRUluB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vlRUluB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPart of the problem was that the tracking station couldn\u0027t predict when and where the intercept with the Mun was going to be, but with all the milestone bonuses rolling in the first facility upgrade could be done:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RCe0fB3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RCe0fB3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow powered by two Kommodore 64s instead of one and boasting three dinky little dishes, the new and improved Tracking Station had everything it needed to calculate patched conics and so accurately predict trajectories moving from one body\u0027s gravity to another.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing this new capability, Munshot 3 got a good intercept of the Mun and flew straight down to the surface without even bothering to get to orbit first.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wosAmqV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/wosAmqV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe landed safely in the Mun\u0027s Highlands, completed its science experiments and sent the data home along with the first image of Kerbin from the surface of the Mun:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IAw8n6a.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IAw8n6a.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was a little fuel left over and a promising crater nearby that might yield more science. Rolling the probe with its reaction wheel had limited success as it kept trying to stand on its end and went off-course. A short hop with the remaining fuel was attempted, but the engine failed during the descent and was destroyed on impact leaving the now immobile probe languishing on the surface with no new science after all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229x6vFQ6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9x6vFQ6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E team were only slightly disappointed by the failure of the hop- just landing on the Mun at all was a major success. Munshot 4 rolled out two days later- nobody was in any fit state to work the morning after Munshot 3\u0027s landing, including Val who made it back just in time to join in the festivities- and replicated its sibling probe\u0027s feat, landing in a prominent crater with another great view of Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226WS2tvS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6WS2tvS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was extra fuel in this one too so another hop was attempted; the engine worked fine, but the probe landed in the same biome as before and had insufficient fuel to try again. Another successful Mun landing and more science sent home, so another raucous party in the local pub and another spate of sick days taken the next day.\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems someone partied a little too hard that night, because when Munshot 5 lifted off, this happened:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uENSUSr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uENSUSr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe was still low enough and slow enough that most of it landed within a few kilometres of the launchpad, but unfortunately not in one piece:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223RBmlgN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3RBmlgN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA slight redesign and hammering most of the dents out and the same probe was ready to launch again by lunchtime:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xbsZaxG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xbsZaxG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEveryone was slightly confused by the change in rocket plumes. Maybe it was Linus\u0027 homebrew that he\u0027d brought to the Munshot 4 party, which definitely had a whiff of formaldehyde about it...\n\u003C/p\u003E\n\u003Cp\u003E\nUnlike previous missions, Munshot 5 aimed to intercept the Mun close to its apoapsis, meaning it managed to land with more fuel left over than previous attempts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YSxayYh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YSxayYh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing site was chosen carefully- a canyon-like feature at the edge of a large crater- and a short biome hop was successfully executed to gather science from both. The only complication was that the probe lost its connection to Kerbin during the second descent and it took over a day to reconnect, much to the relief of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E crew- some more than others, as there had been a little sweepstake going about whether or not the probe had survived.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iwvXVGt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iwvXVGt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo days later after yet another party, a slightly dishevelled Gene found a line of wealthy Kerbals all offering to pay handsomely for the privilege of flying into space. The team came up with a design that might do the job, carrying two tourists and a pilot in one go, but the KV-series pods added too much drag and the first launch was aborted; the two tourists on board didn\u0027t mind too much, becoming the first Kerbals (along with Jeb) to experience an in-flight launch abort, but the other tourists waiting for their turn looked a little less keen after that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WcwWyc2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WcwWyc2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMore industry reps showed up offering money for doing some strange things to their parts. Thumper \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E, Erebus hydrolox engine, Compsognathus methalox engine, parachute, landing gear, heatshield- all were tested, launched to specific altitudes and speeds or otherwise (mis)used as requested.\n\u003C/p\u003E\n\u003Cp\u003E\nBob was impressed by the little Compsognathus- just 62.5cm across yet packing more than triple the thrust of the Pug and performing almost as well at sea level as in vacuum, it would make a great engine for a side booster or for a small probe. It also looked great at full power:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JkJ0EAF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JkJ0EAF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the Mun Probes strategy complete following three successful landings, a strategy meeting was called to decide on their next steps. Science is still needed so more Mun probes are an option, however their yields are relatively low and there may be more science to be gained by looking further afield.\n\u003C/p\u003E\n\u003Cp\u003E\nWait, isn\u0027t that Dres lurking just beyond Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E? And what\u0027s that little moon beside it- Minmus!?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/BR4S21X\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/BR4S21X\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-25T13:10:30Z\u0022 title=\u002207/25/2021 01:10  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 25, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-25T19:24:12Z","Content":"\n\u003Cp\u003E\n\u0022I\u0027m booooooooored!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFor all that Jeb\u0027s a great pilot, he can be a bit petulant and sulky at times. Fortunately for everyone else at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, there\u0027s a solution that puts his piloting to good use and can get some science at the same time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HjhNmZW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/HjhNmZW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a bit of initial confusion as to why the \u0022Blue Steel\u0022 wasn\u0027t actually blue \u003Cem\u003Eor\u003C/em\u003E steel, Jeb took the plane out for a spin- it flew well enough with a low minimum speed, but seemed to have asymmetric lift and was very prone to rolling when \u003Cs\u003Ephysics warp was on\u003C/s\u003E Jeb started daydreaming.\n\u003C/p\u003E\n\u003Cp\u003E\nWith atmospheric pressure readings gathered above the shores, highlands and mountains, Jeb spotted something up the coast from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and decided to take a look. So naturally, that\u0027s when the engine failed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nCGJrNS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nCGJrNS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA parachute landing and a lot of rolling later, it turned out to be an abandoned launchsite, slowly being reclaimed by the sea:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xO73Ihq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xO73Ihq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the engine repaired and Jeb busy exploring this new launchsite, it was up to Val to take the plane for its next mission in the desert.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221Cdlap7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/1Cdlap7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey, Control? What\u0027s that metal doodah?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0022Uh, let me get back to you on that. \u003Csub\u003ETERRY! WHAT DID I TELL YOU ABOUT LEAVING YOUR \u0022ARTWORKS\u0022 LYING AROUND ON THE BASE!?\u003C/sub\u003E\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Your mic is still on, Control... OK, I\u0027m taking off now, oof this thing\u0027s suspension is awful- ouch! ooyah! \u003Cem\u003E*scraaaaaaaaaape* \u003C/em\u003Eow, my shin!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uj9yWjW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uj9yWjW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ground team worked wonders, replacing the broken parts and upgrading the engine to a more powerful model to give the plane a bit more speed. Unfortunately they didn\u0027t manage to fix the wheels...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OeWZQfg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/OeWZQfg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal: \u0022Wow, this thing handles terribly! It\u0027s like half a wing is missing.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nControl: \u0022Uh, Val? You\u0027re missing a wingtip and they\u0027re the only ailerons on the plane.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nVal: \u0022Well, that figures. Ooh, what\u0027s that down there?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oWchYzJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oWchYzJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVal: \u0022Can I go and see it, pleeease?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene: \u0022No can do, Val, you don\u0027t have the fuel.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nVal: \u0022Bah, you\u0027re no fun.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWith that mission over with and some more science gathered, someone had the bright idea of stapling some big solid boosters to that plane and launching it from Woomerang launchsite towards the polar ice caps.\n\u003C/p\u003E\n\u003Cp\u003E\nThere was only one Kerbal up for the job of piloting it...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vK6JrOH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vK6JrOH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u0022WOOOOOOOOOOOOOOO!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u0022Hey Jeb? You\u0027re on a science mission, not a-\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u0022Yeah, yeah, science stuff switched on, it\u0027ll do its thing when I get there.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u0022The hard drive is full.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u0022So?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u0022So, you need to get out and take the data so it can keep running.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u0022...get out? I\u0027m almost at the north pole, ice all around me, and you want me to GET OUT!?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u0022What, you\u0027re scared of a little cold? Just remember to leave the engine running-\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u0022To keep me warm?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u0022No, to power the science stuff.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: ...\n\u003C/p\u003E\n\u003Cp\u003E\nBob: \u003Csub\u003E\u0022And to keep you warm too I suppose...\u0022\u003C/sub\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oSFSLos.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oSFSLos.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe jet fuel ran out in the end, halting the science gathering. Jeb wasn\u0027t too impressed about having to stand around outside in the freezing cold until the recovery team arrived, but the science data was worth it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile Jeb defrosted with copious application of \u0022antifreeze\u0022 (read: more of Linus\u0027 homebrew), the science team put their heads together and modified the Munshot probe design to include a return capsule. Munshot 6 wouldn\u0027t land but instead orbit, gather the mystery goo readings from low altitude around the Mun and then send that sample back in the capsule while the rest of the probe stayed in Kerbin orbit doing more science. The mission was hampered a bit by the high electricity use of the new MITE and SITE experiments, however careful energy management was enough to ensure that it completed its primary objective.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002256zNLaC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/56zNLaC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mmLjVYn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/mmLjVYn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMunshot 6\u0027s orbiter also included a relay dish so it could provide some signal relaying capacity; the existing DSN stations worked well enough for equatorial orbits, but the Mun\u0027s orbit had been shifted to 60 degrees inclination by The Anomaly and launching into that orbital plane meant a probe could go around for an entire orbit without getting any signal at all.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next launch, Highshot 3, also carried a relay dish and was launched into a polar orbit. A modification of the earlier Munshot probes, Highshot 3 traded most of the extraneous parts for maximum fuel cell fuel and was designed to gather as much MITE and SITE data as possible with over 6 days worth of continuous power generation with everything running. Not nearly as good as having solar panels, but they\u0027re still some way away yet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229mvZPSc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9mvZPSc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSeeing an opportunity, Bill proposed another idea- using bigger fuel tanks and a more efficient Terrier engine, it should be easy enough to launch a probe into interplanetary space and most likely to Dres, which continues to hover just outside Kerbin\u0027s gravity well. The Sunshot 1 probe was pared back, carrying only the science experiments that could be transmitted back and which consumed the least power to stretch out the fuel cell fuel for as long as possible, but carried two relay dishes to improve its communication range.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oGUEtHB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oGUEtHB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt last, Kerbin\u0027s inhabitants have begun the exploration of their reshuffled solar system. There\u0027s still a long way to go, but Sunshot 1 is the first step on that path and with any luck will find out how Kerbin\u0027s second satellite ended up around that good-for-nothing-not-really-a-planet-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#e74c3c;\u0022\u003EJeb, stop tampering with the official reports!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#e74c3c;\u0022\u003E- Gene\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/AuhU0Wz\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/AuhU0Wz\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-07-26T07:57:14Z","Content":"\n\u003Cp\u003E\nHehe \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThat last part is realmy funny.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAnd i REALLY love this mission report.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-26T21:45:16Z","Content":"\n\u003Cp\u003E\nAnother day, another probe launched to get science around Kerbin. The team at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E are amassing an impressive collection of loyalty points from various rocket suppliers and hardware stores by launching all these probes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AqNJlur.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/AqNJlur.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn between probe missions, there was time to squeeze in an engine test along with a materials bay experiment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uGIH8do.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uGIH8do.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPurple fire? Nice.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then came the big incident...\n\u003C/p\u003E\n\u003Cp\u003E\nGene: So we\u0027re going to launch a special crewed mission-\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: DIBS!!!\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Jeb, I haven\u0027t even told you what-\n\u003C/p\u003E\n\u003Cp\u003E\nJeb, already climbing into the pod before it\u0027s even attached to the rocket: MINE!\n\u003C/p\u003E\n\u003Cp\u003E\nGene: *sigh* fine, you can have this one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Elater...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Aaaand engine cutoff! So now that I\u0027m in space and all, are you going to tell me what this mission is for?\n\u003C/p\u003E\n\u003Cp\u003E\nGene: It\u0027s a long-duration mission to test the effects of long-term exposure-\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: yawn...\n\u003C/p\u003E\n\u003Cp\u003E\nGene: -for thirty days.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: What?\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Controls locked out, see you in thirty days.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pTSVc5Y.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pTSVc5Y.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0027While Jeb orbited Kerbin again, and again, \u003Cem\u003Eand again\u003C/em\u003E, Sunshot 1 arrived at Kerbin\u0027s new neighbour, the moon-thieving sub-planet called Dres.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#e74c3c;\u0022\u003EOK, seriously, what do you all have against Dres? It may not be that big, or pretty, or interesting in any way whatsoever, but...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#e74c3c;\u0022\u003EHmm, actually you may have a point.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#e74c3c;\u0022\u003E- Gene\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eiixz5S.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/eiixz5S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSoon after arriving, it set a course for Minmus and first orbited, then landed on the little minty moon.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m24jeoC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/m24jeoC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a large reserve of fuel left over, the probe hopped to several different biomes to maximise its science yield. Unfortunately for the probe, Bill was too fixated on the rated ignitions counter to notice that the rated burn time counter had ticked down to zero, resulting in an engine failure at the worst possible time- half way through another biome hop, with the probe flying through the air.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p3JBMXz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/p3JBMXz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe team were convinced that the probe would be destroyed on impact, however the service bay seemed to protect the probe inside from most of the impact forces and the probe survived, minus one of its two dishes, to transmit the remaining science data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vBreo5M.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vBreo5M.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOf course, it was only after this that they realised the probe hadn\u0027t sent back any data from space low around Dres, because it hadn\u0027t actually \u003Cem\u003Ebeen\u003C/em\u003E to space low around Dres. Intercepting Minmus on the first orbit meant that it never lowered its periapsis far enough. Still, any excuse for a second probe...\n\u003C/p\u003E\n\u003Cp\u003E\nWith all the data coming back from Sunshot 1, the team were able to get their hands on some new tech- the OKTO probe core, with built-in \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and reaction wheel, and solar panels! No more relying on fuel cells with finite fuel to provide the power for these probes. They were also able to upgrade the launchpad from a scorched lump of concrete to a proper launchpad with a real pad crawler instead of an old tow truck to move the rockets out there, upping the maximum launch weight sevenfold to a hefty 140 tons.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s a looooot of boosters...\n\u003C/p\u003E\n\u003Cp\u003E\nThe next launch only required two boosters, but due to the increased launch mass it could fire the boosters first and then activate the core liquid-fuelled stage once the boosters were burnt out. On the top, the first X-20 spaceplane configured to carry a crew of up to 4 and so complete all those space tourism contracts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002205N5l38.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/05N5l38.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTrying to launch a plane on top of a rocket wasn\u0027t particularly easy- one slip-up and the whole rocket flips- so for the first flight it was just Val on board to steer the slightly unwieldy shuttle into space; a task which she was more than capable of completing, making orbit with a healthy margin of fuel in the upper stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NQ0BO0U.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NQ0BO0U.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSpaceplanes are uncharted territory, especially for EDL (entry, descent, landing) so perhaps unsurprisingly, Val totally overshot the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. She was still over 20km up as she flew over!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xsfXJHN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xsfXJHN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBy the time she slowed down and turned around she was too far out to fly back to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. She tried to make it to the Island Airfield, but a combination of tricky controls and accidentally leaving the airbrakes switched on meant she fell short of that too and had to ditch in the ocean instead. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E team watched with concern as she dropped into the ocean, but they needn\u0027t have worried- the ditching was textbook and no damage was done to Val or the shuttle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OxImux1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/OxImux1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe even landed close to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E this time!\n\u003C/p\u003E\n\u003Cp\u003E\nWith the test flight out of the way and the shuttle demonstrated to be flightworthy, the tourists were queueing up for flights. Flight number 2 took Val, two tourists (the same two who flew on the first aborted tourism flight) and Bill, who got his first flight at last (and made orbit before Bob, who wasn\u0027t best pleased) before returning on a much more accurate re-entry trajectory. They still overshot, but not by much and Val brought the shuttle in for a landing- on the runway of all places!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TJH8Djc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/TJH8Djc.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAt this point I couldn\u0027t be bothered to actually fly all the other tourism contracts using the same craft and doing the same flight in each, so I calculated the funds gained from the contracts, subtracted launch costs and just cheated the whole thing done. I\u0027m only doing them for the money anyway and I have better things to do with my time than repeat the same boring flight over and over again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBill was so caught up in his first spaceflight (and Bob so caught up in his jealousy at not having had his own orbital flight) that they completely forgot about those new-fangled \u0022sun panels\u0022 on Sunshot 2, sending it off to Dres with a new OKTO probe core and vastly improved data storage, but still powered by a fuel cell.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ULT5PnH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ULT5PnH.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/iM7iOvt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/iM7iOvt\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nJeb: Hello? Anyone!? I\u0027m getting bored up here!\n\u003C/p\u003E\n\u003Cp\u003E\nVal: What\u0027s wrong, little bro? I thought you wanted to set all the spaceflight records?\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: ...\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-07-27T08:07:39Z","Content":"\n\u003Cp\u003E\nWhat can i say? I absolutely love this mission report\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-28T17:19:07Z","Content":"\n\u003Cp\u003E\nGood news- my broken GPU has been replaced under warranty and the new one is on its way. However I\u0027m rather enjoying this playthrough and I think I\u0027ll continue it- just with the graphics turned up again and without the lag whenever I look at the ground!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-29T17:16:59Z","Content":"\n\u003Cp\u003E\nThese newfangled solar panels require some experimentation. Deploy the probes!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fzFIs9z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fzFIs9z.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oYdxpCk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oYdxpCk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBack to fuel cells for a materials bay probe to grab that data from space high over Kerbin- it requires 2EC per second which is the equivalent of about 14 solar panels, or one fuel cell and a couple of little tanks of hydrogen/oxygen since it\u0027ll be in space for an hour at most.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R1tcs89.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/R1tcs89.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cSjx0lD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cSjx0lD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat brought back enough science to research something new. New engines? New plane-related stuff? New probes? New experiments?\n\u003C/p\u003E\n\u003Cp\u003E\nNah, in the end they went for fuel tanks, then created this thing:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sB3LEiB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sB3LEiB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot the prettiest rocket ever- in fact it\u0027s mildly absurd- but methalox is lighter than conventional \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E/Ox so gets good delta-V without making it too heavy to get off the pad. The first stage had a probe core on it to do a propulsive landing (said StageRecovery) and then the upper stage put the probe above into orbit around the Mun, for science!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NHpjjJB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NHpjjJB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis one is solar powered and used 10 of those little panels (out of a total of 30 parts!) to feed the power-hungry materials bays. Getting to the Mun was pretty easy, but capturing into orbit required a lot more fuel than expected, partly because the probe was launched into an equatorial Kerbin orbit instead of matching the Mun\u0027s inclination. Returning from the Mun at apoapsis is a lot easier, just leaving its \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E retrograde to its orbit around Kerbin puts you on a suborbital trajectory; wait until the Mun has moved away before trying to fix that or you\u0027ll end up falling back into the Mun\u0027s gravity and getting flung off in a strange direction or crashing into it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J7D1Huw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/J7D1Huw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith those samples returned, the team realised that materials bay samples had been acquired from everywhere in Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, apart from Kerbin\u0027s upper atmosphere. This was quickly fixed with a pair of probes to skim through the rarefied air over 60km up and gather those samples before returning.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NMxL0cd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NMxL0cd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RgEpjEz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RgEpjEz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd finally- FINALLY!!!- it was time for Jeb to come home after 30 long, \u003Cem\u003Elong\u003C/em\u003E days in orbit. His behaviour was rather... \u003Cem\u003Eerratic.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ITfmetc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ITfmetc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnclear if he was kissing the ground or eating it, all the recovery crews know is that by the time they got there, all the grass in a hundred metre radius had withered and the smell was unbelievable. With the benefit of hindsight, maybe including some kind of tank to hold the, er, waste products, would have been advisable...\n\u003C/p\u003E\n\u003Cp\u003E\nShortly after that Sunshot 2 arrived at Dres, completely overshot its course correction burn and ended up having to use Minmus for a gravity assist to capture into a retrograde orbit. It seems the automatic alarm system in Mission Control didn\u0027t go off properly in time for the burn, resulting in the probe having less fuel than planned.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zyv6S1e.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Zyv6S1e.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aXuv2ST.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aXuv2ST.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing attempt went ahead anyway but disaster struck- the probe ran out of fuel and hit the ground at about 35m/s, smashing the engine and fuel tank and sending it tumbling away downhill. Everything looked OK until the second impact, which ripped off one of the two HG-5 dishes and also destroyed the fuel cell and with it the probe\u0027s only source of power. The probe stopped on the surface with no further damage and collected its data, but without the fuel cell the batteries wouldn\u0027t last long and with only one dish data transmission rates were painfully slow. Most of the data was still waiting to be sent when the power ran out, marking an inauspicious end to the first Dres landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fGwYkRS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fGwYkRS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut then again Dres did steal Minmus so it was hardly surprising that it didn\u0027t play fair. Substantial financial rewards for reaching Dres and landing on it, as well as the flyby of Minmus and a variety of contracts, are almost enough to upgrade the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and \u003Cs\u003Eescape the 30 part limit\u003C/s\u003E bring in a bigger workforce and better cranes to make the rockets even bigger.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point Bob stormed into Mission Control, stole Gene\u0027s master launch key and refused to give it back unless he was sent to orbit on the very next launch. Two tourists turned up at around the same time looking for their own orbital experience, so Val took the Tourist Shuttle out for another flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225Snaksz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5Snaksz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ascent was completely fine, Bob got his orbital flight at last and Val\u0027s re-entry profile was perfect, skimming through the atmosphere and controlling their descent rate nicely. She overshot a bit though, but had ample speed and altitude to turn around and approach from the east.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022szvHEVr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/szvHEVr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt Bob\u0027s insistence, the Tourist Shuttle had been fitted with a parachute for emergency landings; seems only fair that they tested it while he was on board. Unfortunately it didn\u0027t go entirely according to plan, providing insufficient drag to slow the shuttle down entirely and resulting in a hard landing when the landing gear \u003Cs\u003Ephased through the ground\u003C/s\u003E collapsed due to the high vertical speed and the tail fins broke off on impact.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YVFDDFo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YVFDDFo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNo sooner had the parachute crumpled to the ground, Bob burst out of the rear hatch, bolted across the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E complex and locked himself in his office in the R\u0026amp;D department where he\u0027s been ever since. It\u0027s rather unlikely that he\u0027ll ever go to space again so we may need to hire some more scientists for future missions...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/5oiOdig\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/5oiOdig\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy new GPU is here at last! Still no graphics mods, but now I can turn all the textures up full and play the game at a reasonable resolution- and with sound too! Though why the integrated graphics thingy couldn\u0027t do sound is beyond me...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E upgrade is top priority, however it might have to be put on hold to upgrade the Astronaut Complex instead- that upgrade would allow EVA training so Kerbals could do EVAs in flight, as well as plant flags.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nJeb- Why can\u0027t we plant flags now? It\u0027s not rocket science, you just stick the pointy end in the ground, pull that handle and *smacks himself in the face with the extending flag boom* never mind...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-30T09:57:09Z","Content":"\n\u003Cp\u003E\nWhat just happened? Was it another Anomaly? Everything seems... brighter, sharper, more defined than before. Look at the ground! Look at the water! Look at, well, EVERYTHING!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nNew GPU is here! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E All graphics settings go from (almost) minimum to maximum, spot the differences in the screenshots \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSome crazy rich guy turned up at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E offering good money for the privilege of being made to black out from excessive G-forces. While the sanity of the idea was questionable, the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E crew never knowingly turn down easy money and stuck this crazy tourist in a capsule on top of the biggest and most powerful \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E they had with the bare minimum of solid fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229Dvo5UI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9Dvo5UI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n15G or more for five seconds did the job!\n\u003C/p\u003E\n\u003Cp\u003E\nSeeing an opportunity, Bill, Bob and Wernher put their heads together and soon unveiled their new creation- a self-driving rover for the Mun, launched using another of those big SRBs but with full fuel and a more sensible thrust curve.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kGT2Ciy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kGT2Ciy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen they launched another, but then...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YNm5ki9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YNm5ki9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEngine failure on the second stage when it ignited to circularise over Kerbin. While the rover isn\u0027t going to the Mun, the skycrane on top is more than capable of doing a powered landing on Kerbin- and is stupidly overpowered for the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nThe replacement for that mission seemed to launch at exactly the right time, arriving at the Mun a whole day before the first one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229qTKr3N.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9qTKr3N.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe skycrane worked as intended, though it barely got above 5% throttle, and the rover landed safely on the Mun in a Highland Crater.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AlIYWRL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AlIYWRL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the skycrane was jettisoned and the science had been gathered, the Bon Voyage module was switched on and programmed to take the rover to one of the Mun\u0027s largest craters to get more science.\n\u003C/p\u003E\n\u003Cp\u003E\nA day later, Mun Rover 1 joined its sibling on the Mun and went in search of science:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222kRfSEI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2kRfSEI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the Mun rovers done it looked like the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E team were ready to move on to something new, but then Linus had a brilliant idea- why not send rovers around Kerbin?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gTghECW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gTghECW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first Kerbin rover rolled out from Woomerang shortly after, its mission- go to the northern ice shelf via as many icy biomes as possible and get science. It also has a big relay antenna and might be useful as a signal booster for craft in low polar orbits, though that remains to be seen.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gTghECW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gTghECW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPositively giddy at being listened to, Linus threw an even more outlandish suggestion out there- what if we made a rover \u003Cem\u003Ethat can go on water too! \u003C/em\u003EAnd that\u0027s exactly what they did:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c1nEnqV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/c1nEnqV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThree Amphibious Rovers were built in total, one dispatched from Woomerang to drive to the ocean then sail itself to Crater Island and two sent from the partly subsided Cove launch site, discovered by Jeb on his first plane flight, which went in opposite directions: one headed south-east towards Kerbin\u0027s second continent to try and find the semi-mythical \u0022badlands\u0022 where no Kerb dare tread, while the other headed south-west to explore some islands in the southern hemisphere and eventually reach the south pole.\n\u003C/p\u003E\n\u003Cp\u003E\nThe loss of Sunshot 2 after its crash-landing on Dres was still weighing on Wernher\u0027s mind- if only they\u0027d had a better signal, they could have gotten much more data out of the stricken probe before its batteries died. Working long into the night and then into the next morning, he finally revealed his idea to the rest of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E crew, whose reaction was... lukewarm at best. Most of that was just because he said \u0022Dres\u0022 though, the idea itself was sound plus they got to see one of those new-fangled hydrogen-burning engines in action:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sdrLl2d.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sdrLl2d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IIiHdYK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/IIiHdYK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Dres Relay was duly dispatched to everyone\u0027s least-favourite planetary body where it will take up a high polar orbit, gather some SITE data and hopefully boost the signal transmission rates for future missions to Minmus. \n\u003C/p\u003E\n\u003Cp\u003E\n(Fine, and to Dres too...)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then, just when they thought they\u0027d seen every contract offer out there, some rather sheepish looking corporate reps turned up with a rather embarrassing coincidence- three private companies had tried to launch Kerbals into space, but all three had failed and there were now three Kerbals stuck in low Kerbin orbit with no way to get back.\n\u003C/p\u003E\n\u003Cp\u003E\nThe heads of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E departments got together to discuss, The deal was simple- rescue them and they\u0027ll join the Space Program, free of charge; in fact the companies they previously worked for were offering pretty significant financial rewards for rescuing them. CFO (sole accountant) Mortimer was immediately onboard with that and managed to talk Head of Facilities (chief janitor and maintenance man) Gus into it when he pointed out that the money saved would mean they could upgrade the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E; VP Public Relations (a.k.a. three-time Kerbin\u0027s Most Soporific Voice winner) Walt saw the reputation benefits of rescuing the stricken Kerbals (though by this point he was really regretting losing that bet with Morty during the \u0022first orbit\u0022 party since he now had to do all the press conferences wearing a full hazmat suit for the rest of the year); Acting Head of Science (because Wernher was Head of Design in these meetings and the others felt that giving him two roles- and two votes- was a bit unfair) Linus didn\u0027t contribute much, he would much rather be in Mission Control keeping watch over his fleet of rovers, despite the fact that they were fully autonomous; and Head of Design Wernher was too busy demolishing the tray of pastries in the middle of the table to make any meaningful contribution, besides suggesting they use the Tourist Shuttle and rescue all three stranded Kerbals in one go (through a massive spray of pastry crumbs).\n\u003C/p\u003E\n\u003Cp\u003E\nWith that decided, the Tourist Shuttle was duly wheeled out and despite the reservations of many, Jeb was chosen to pilot it. They weren\u0027t sure how Jeb would react to being back in space following the flight of Endurance 1, but aside from the occasional eye twitch or spontaneous giggling fit he seemed to be back to normal; or something vaguely resembling normal at any rate.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GSZdN8E.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/GSZdN8E.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was a brief panic in Mission Control when Jeb suddenly popped the hatch and went out on an EVA, but all they heard over the radio was \u0022WHEEEEEEEE!\u0022 as he jetted around for a few minutes then returned.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dsgoLC4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dsgoLC4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne by one the stranded Kerbals were rescued, the task using up all the fuel in the shuttle\u0027s upper stage and a sizeable portion of its onboard \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E too. When they were all aboard Jeb deorbited the shuttle and soon realised that the weak \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters weren\u0027t slowing them down nearly quickly enough to try and land at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Sure enough, they overshot by a much higher margin than Val ever did (which she was happy to remind him of at any available opportunity, in much the same way that he had reminded her of her two failed orbital flights while he made it on his first try) and splashed down into the ocean some distance away.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220PRFKYC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0PRFKYC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022stlSjgo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/stlSjgo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRecovery teams were scrambled to pick them up, however a passing merchant freighter saw them splash down and quickly came over, fished them out of the ocean with an onboard crane and took them to the nearest port- after the entire crew posed with the shuttle and its crew of spacekerbs, obviously!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/FNb8Pex\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/FNb8Pex\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe money from the rescue missions was enough to upgrade the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E at last, meaning much bigger and better rockets can now be assembled and launched to more far-flung destinations. At long last, Kerbalkind can discover exactly what happened to their solar system during The Anomaly and where all the various planetary bodies ended up. Besides the Mun, Minmus and Dres it\u0027s not clear what happened to everything else; most of the planets seem to be in the same places, more or less, but the moons are anyone\u0027s guess.\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-07-30T11:26:46Z","Content":"\n\u003Cp\u003E\nAbsolutely love this! Ran outta likes today, will like tomorrow \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-01T12:42:06Z","Content":"\n\u003Cp\u003E\nFor over sixty days the Space Program has been exploring, investigating, pushing the frontiers of Kerbalkind\u0027s understanding of The Anomaly that reshaped their solar system. Well, today The Anomaly fought back:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224fPzBqd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4fPzBqd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Wpi9asK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Wpi9asK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BhCCEFX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BhCCEFX.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nQuit smashing my rover wheels, Bon Voyage \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe loss of both Mun rovers hurt, they could easily have visited all the Mun\u0027s biomes and gathered a lot more science; maybe the next generation of rovers will have more luck? The rovers on Kerbin aren\u0027t doing much better- Amphibious Rover 3 lost some of its wheels followed by a high-speed crash when it tried to stop itself careering downhill, Amphibious Rover 2 keeps stopping because the autopilot module thinks it\u0027s out of fuel (it\u0027s still almost full, and the identical Amphibious Rover 1 has no such issues) and the pole-bound Kerbin Rover 1 is just really, really slow. The team sent out another Amphibious Rover from Woomerang, but modified with many more solar panels and some backup communications systems in case the main dish breaks, which will take up the lost rover\u0027s mission of visiting Crater Island.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make up for the losses and to boost morale at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, the most significant mission to date was launched- CREWED MUN LANDING!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022z0wlFPr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z0wlFPr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShortly after Val launched into orbit, Jeb was found in a store cupboard in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with a splitting headache and smelling faintly of chloroform...\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission went exactly as planned, most of the time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eKtQ2HX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eKtQ2HX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HJei5AL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HJei5AL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then the weirdness began...\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Wheeeee! This low gravity is great fun!\n\u003C/p\u003E\n\u003Cp\u003E\nGene: OK Val, we\u0027ve done the publicity shots so you can pack up those lights again.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: ...um, no.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: What do you mean, no?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: I mean, I can\u0027t pick them up. They\u0027re too big and heavy.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Val, they\u0027re two kilos each.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: I know that, but...\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Hey Val, try again now?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: ...nope.\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Really? Even with the mass/volume cheats switched on?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Say again?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Er, I mean, um... Is that a Kraken?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: KRAKEN!? I\u0027m outta here!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nYeah, those lights seemed to be cursed- Val could quite happily take them out of the pod and carry them and they were well within the volume and mass limits, but picking one up once it had been deployed? Not a chance, even with the cheats turned on it would \u0022exceed her carry limits\u0022 or something like that. Weird.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDespite the incident with the lights the mission was an outstanding success- much science was gathered, many funds were acquired from a variety of contracts and world-firsts rewards, and Val returned without any further incidents- even hopping out her pod to plant a flag once she\u0027d returned to Kerbin\u0027s surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZULlOTy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ZULlOTy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA mission was being put together when an urgent call came in- someone had tried to do a Mun mission of their own but had managed to strand their intrepid Kerbonaut in orbit of the Mun. This was a perfect opportunity to test out a new upper-stage engine, complete a bunch of contracts and bolster the Space Program\u0027s reputation, so the existing design was modified to include \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters and launched at the next alignment with the Mun\u0027s inclined orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022idE1LZc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/idE1LZc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nActually rendezvousing with the stranded craft was tricky- they were in a near equatorial orbit whereas the rescue craft arrived in a highly inclined orbit due to the way the Mun orbits Kerbin. A series of course corrections were performed using the same RK-0109 second stage as for the Mun lander, then with a prototype \u0022Hecate\u0022 cryogenic engine with a simply astounding \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E of 465s, making up for the low density of liquid hydrogen with sheer efficiency and low overall mass.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hiUi0Tb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hiUi0Tb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe craft was fitted with strobe lights in case the rendezvous happened in the dark (as is right and proper), however it happened in daylight instead.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Rendezvous coming up, stand by to cancel relative velocity at closest approach.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Roger that.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: What\u0027s our closest approach?\n\u003C/p\u003E\n\u003Cp\u003E\n*clang scraaaaaaaaaaape*\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Never mind...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EQJKeAk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/EQJKeAk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe collision was at a very slow speed so there was no real damage to either craft besides a bit of paint swapping; that being said, where did this big flange thing come from and should we be worried that it\u0027s not attached to anything any more?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SavEnqJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SavEnqJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe return trajectory was downright weird- leaving the Mun at its apoapsis, the craft ended up in a retrograde orbit of Kerbin and spent most of the trip back down stuck in Kerbin\u0027s shadow, requiring a course correction radially to get light on the solar panels and avoid running out of power entirely. There was plenty of fuel left on that oh-so-efficient upper stage to make that burn and to brake before re-entry and the pod landed safely without any trouble.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022s8qnMsi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/s8qnMsi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe craft wasn\u0027t intended to get any science, however an EVA report combined with the observations of that flange (how is that \u0022science\u0022? -Jeb) meant that it got a higher science return than some of the old Munshot landers.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile that was going on, the other three rescued Kerbals headed out on a \u0022team building exercise\u0022 as Gene put it, deploying a big cluster of deployed science equipment near the flagpole outside the Astronaut Complex.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eWrVyCm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eWrVyCm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(How is \u003Cem\u003Egolf\u003C/em\u003E \u0022science\u0022!? -Jeb)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the Dres Relay arrived at nobody\u0027s favourite celestial body and captured into a high polar orbit where it will stay for a while and gather science. Orbital velocity up there is a mere 60m/s and there\u0027s several hundred left in the tanks so plenty of scope to change the orbit if the signal to other craft isn\u0027t strong enough at that range.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gXLvlNQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gXLvlNQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the recent influx of science the new Hitchhiker crew module is now available, along with a series of crew experiments that can be done in a variety of places. A space station might be a good idea, however it would still need to be powered by many small static solar panels and small batteries, connected up with the smallest docking ports and with limited signal bandwidth to the surface even using those HG-20 quad dishes. Better technologies require a lot of science and a very expensive R\u0026amp;D upgrade though, so it might be a case of making the best of what\u0027s available now. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E systems are available now so at least docking is a possibility.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/3A97SSh\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/3A97SSh\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The Dressian Exploder","CreatedById":191542,"CreatedDateTime":"2021-08-01T13:10:16Z","Content":"\n\u003Cp\u003E\nGotta say I\u0027m loving this mission report.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224013075\u0022 data-ipsquote-contentid=\u0022203971\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627821726\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile that was going on, the other three rescued Kerbals headed out on a \u0022team building exercise\u0022 as Gene put it, deploying a big cluster of deployed science equipment near the flagpole outside the Astronaut Complex.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/eWrVyCm.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022eWrVyCm.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eWrVyCm.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(How is \u003Cem\u003Egolf\u003C/em\u003E \u0022science\u0022!? -Jeb)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust asking though, what\u0027s that cuboid-ish deployed science part in front of the leftmost kerbal? It doesn\u0027t look like any of the stock parts I\u0027ve seen, and if it\u0027s a mod, which one?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-08-02T06:54:39Z\u0022 title=\u002208/02/2021 06:54  AM\u0022 data-short=\u00222 yr\u0022\u003EAugust 2, 2021\u003C/time\u003E by The Dressian Exploder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-08-01T13:53:23Z","Content":"\n\u003Cp\u003E\nLove this\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-01T14:00:35Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/191542-the-dressian-exploder/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022191542\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/191542-the-dressian-exploder/\u0022 rel=\u0022\u0022\u003E@The Dressian Exploder\u003C/a\u003E That\u0027s a deployable battery, from the Deployable Batteries mod \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E . The mod\u0027s a bit old and hasn\u0027t been updated with the inventory changes in 1.12 (no part volume) but the parts still work fine and can still be deployed.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-03T16:33:20Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSo here\u0027s the thing- I\u0027ve already done a playthrough of the stock system with Kerbalism and after nearly 6 years of in-game time I barely managed to put a base on Gilly: \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022199902\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6945979529\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/196959-kerbalism-space-program/\u0026amp;do=embed\u0022 style=\u0022height:195px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure how long I\u0027ll stick to this game as while it\u0027s still interesting enough now I don\u0027t particularly fancy the grind of unlocking everything and doing interplanetary missions again, especially after two Kerbalism Grand Tours. That said, I\u0027m still playing with the science, funds and reputation gains at 50% so I might bump those up to make the game less grindy without making it any easier to do the missions.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now back to our (ir)regularly scheduled viewing...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe idea seemed simple enough- launch the core of a space station into orbit, take the contract money, then use the station to do some science. Thus a new station was launched with loads of batteries, some reserve fuel and even some blinky lights to show where the doors and docking ports are.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LBHhx9H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LBHhx9H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FYyWn2F.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FYyWn2F.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately nobody bothered to look at the small print for the one crew experiment currently available, which says it needs four crew, about a whole hitchhiker\u0027s worth of internal space for each of those four crew, and six electric charge per second to run the experiment. Oops. That \u0022station\u0022 might yet be useful for something, but until then it\u0027ll just sit in orbit as a gloriously overdesigned relay.\n\u003C/p\u003E\n\u003Cp\u003E\nToo late, the next X-20 shuttle was already built with a docking section to allow it to dock to the station. Instead of doing that, it took a tourist into space and rescued another stranded Kerbal:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tXWOP8L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tXWOP8L.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224eQUmxl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4eQUmxl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd this is why they call them the \u0022Whoopstooshort Mountains\u0022:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SdQ1X0h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SdQ1X0h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe shuttle landed safely under parachutes after turning back to avoid the mountains. Nobody was really paying attention at that point, too busy either trying to figure out why the Amphibious Rovers kept stopping and saying they were \u0022out of fuel\u0022 when they\u0027re clearly not (OOC: Come on, Bon Voyage, it can\u0027t be \u003Cem\u003Ethat\u003C/em\u003E hard- AR1 is absolutely fine but all the others keep stopping every other day and have to be rebooted, which isn\u0027t easy when there\u0027s no signal due to a lack of relays in Kerbin orbit) or building Munlander 2 to take a crew of two to the Mun. Jeb was once again eager to get his boots on the Mun, but oddly enough when it reached the launchpad he was nowhere to be found and so Bill and Bob went up instead.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g4R7ICj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/g4R7ICj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then just as they started the trans-Munar injection burn...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zrh26QS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Zrh26QS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second stage engine blew up. With nearly 2km/s still left in the tanks that was a major blow for the mission- Bill and Bob would still make it to Munar orbit and most likely to the surface as well, but once landed they\u0027d be stuck there.\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately for them there was a backup Munlander and an untested prototype Mun crew rover that could be launched in a hurry to salvage the mission:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223ydoiut.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3ydoiut.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tDQyRdk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tDQyRdk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RVl5sJX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RVl5sJX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was a little bit of a delay to the launches as the Dessert Launchsite moved around into the Mun\u0027s orbital plane, allowing a little relay to be stuck on the top of the second Munlander to be dropped off in orbit of the Mun. (This delay also meant Jeb and Val had a chance to try and sneak onto the second Munlander and steal a ride to the Mun, but they were discovered before the launch and unceremoniously removed from the capsule...)\n\u003C/p\u003E\n\u003Cp\u003E\nOnce the relay was deployed, rover and lander made their descents.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZuF4scH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ZuF4scH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220gXk3Dw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0gXk3Dw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd once the return infrastructure was in place, Bill and Bob headed down to the surface too. They ended up running out of fuel about ten metres above the surface, showing just how much fuel they\u0027d lost when the second stage engine failed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220zJWM6l.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0zJWM6l.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224ZazILZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4ZazILZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AYAmlV9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AYAmlV9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe deployed science site was deployed, the, er, \u0022EVA science\u0022 was performed, and then the rover arrived in the nick of time to carry them to their new lander- but not before Bill had nicked some parts off their now defunct lander.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eGdGTrI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eGdGTrI.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAnd once again, Bon Voyage wrecked the wheels on arrival \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mtJUiJM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mtJUiJM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n8 wheels on it, but it ended up with just three; enough to still drive with Bon Voyage but I don\u0027t trust it any more...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThere was just time for a single postcard shot of the lander with Kerbin right behind it:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221EZVXwp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1EZVXwp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(That\u0027s going to sell\u003Cem\u003E a lot \u003C/em\u003Eof postcards and fridge magnets - Mortimer)\n\u003C/p\u003E\n\u003Cp\u003E\nAfter launching near the Mun\u0027s apoapsis they came back to Kerbin, giving Bob a chance to grab some more \u0022EVA science\u0022 along the way:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iDZOMG6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/iDZOMG6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd despite the lack of heatshields (because 1.875m heatshields are in a node that hasn\u0027t been researched yet) the re-entry went without incident, bringing Bill and Bob back home with a bounty of science data which will be put to good use in the near future.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002236YUyvB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/36YUyvB.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/XPdwio2\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/XPdwio2\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThere\u0027s a lot of science still to be had on the Mun and loads more over at Dres and Minmus, which have only been visited once each- this would normally call for a fleet of rovers, except that many rovers have met untimely ends or had serious incidents with exploding wheels so the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E team no longer trust them to work as intended once they arrive at their destinations. Perhaps a fleet of tiny probes would be a better option? Maybe even shooting interplanetary to somewhere like Eve or Duna? And how about a proper communications network around Kerbin?\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-04T17:47:20Z","Content":"\n\u003Cp\u003E\nTEAM MEETING\n\u003C/p\u003E\n\u003Cp\u003E\nBoardroom.\n\u003C/p\u003E\n\u003Cp\u003E\n2 o\u0027clock sharp.\n\u003C/p\u003E\n\u003Cp\u003E\nEveryone is required.\n\u003C/p\u003E\n\u003Cp\u003E\n(That means you, Jeb!)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u003Cspan style=\u0022font-size:8px;\u0022\u003Eowowow\u003C/span\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003Eowow\u003C/span\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Eow\u003C/span\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003Eowow\u003C/span\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Eow\u003C/span\u003Eow (Val and Jeb enter the room, Val dragging Jeb along by the ear) OK, OK, I\u0027m here \u003Cspan style=\u0022font-size:8px;\u0022\u003Eplease let go...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene: So now that we\u0027re all accounted for, here\u0027s the situation. Next slide please.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: Uh, Gene? That\u0027s not a slideshow, that\u0027s a window...\n\u003C/p\u003E\n\u003Cp\u003E\nGene: As I was saying- the Munlander 2 mission may have been a success and we got some good publicity out of the whole \u0022daring rescue\u0022 thing, but there are a lot of people asking why we deliberately sent Bill and Bob down to the Mun knowing they couldn\u0027t get back and had to rely on a rescue mission in the first place. And quite frankly, they\u0027re right- it was reckless, dangerous and we can\u0027t afford another mishap like that. Until we get some solid successes to reassure the public that we know what we\u0027re doing, no more crewed missions beyond low Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: \u003Cem\u003Einarticulate whimpering noises\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Over to you, Wernher.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: Thanks Gene. With the additional scientific data gathered by Bill and Bob on and around the Mun, we\u0027ve developed a new generation of small, lightweight probes that we can send to other planets in groups to maximise the gains and at the same time form a preliminary communications system. We have two missions ready for construction: the first will send four small probes out to Dres-\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Boo-ouch! My shin! *glowers at Val sitting opposite*\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: -with the aim of attempting multiple landings on both Dres and Minmus; the second uses a similar design but adds relay capabilities to the transfer stage and will be launched to Duna. It\u0027s not the ideal time to be launching to Duna, but the design has the delta-V for it and the low chance of failure is outweighed by the potentially large gains for success. We have to start investigating The Anomaly further afield than Kerbin\u0027s immediate vicinity and ground-based telescopes seem to suggest that Duna\u0027s moon Ike has either broken apart or disappeared entirely, which this mission can investigate in advance of a more sophisticated mission that will be better equipped as a result of the data we can get now.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: I\u0027m not too fond of the idea of launching a \u0022risky\u0022 mission, however the low cost of the probes and the potentially large gains make it worth doing. If we\u0027re going to find out what caused The Anomaly, we\u0027re going to need to take some risks. The cluster missions are a go.\n\u003C/p\u003E\n\u003Cp\u003E\nBill, Bob, Linus, Wernher, Gus: \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E; Jeb: \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nOwSc8o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nOwSc8o.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UJtWSrL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UJtWSrL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDres Quartet, above, and Duna Quartet, below, launching to their respective \u003Cs\u003Eplanets\u003C/s\u003E destinations (Dres is NOT a planet!)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227xTYQv4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7xTYQv4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vmsYxws.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vmsYxws.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EGene: The next item to discuss is the fate of those amphibious rovers we sent out across Kerbin. Linus, can you update us on their progress?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003ELinus: Unfortunately the Amphibious Rovers haven\u0027t worked nearly as well as we\u0027d hoped. There seems to be an issue with the autonomous control module that causes them to repeatedly stop and go into a safe mode; it\u0027s easy enough to reset them, but for that we need to connect them to the DSN and right now they\u0027re in remote areas of the oceans where communications are patchy at best.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EGene: I thought you included the best relay dishes we had on those rovers.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003ELinus: It\u0027s not the rovers that are the problem- they just can\u0027t \u0022see\u0022 any of the ground stations where they are and there are no dedicated relays around Kerbin to connect to the DSN stations. We get occasional, sporadic connections when one of the Kerbin orbit probes with a relay dish happens to pass by overhead, but most of the time they\u0027re operating blind and so will keep stopping for long periods of time if there\u0027s a problem.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EGene: Wernher, would a keostationary relay network around Kerbin be possible with the Mun in its current orbit?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EWernher: It\u0027s, er, possible, but the margins around the Mun would be too close for comfort. It would be more practical to launch them into a higher orbit that avoids the Mun completely when it\u0027s passing through Kerbin\u0027s equatorial plane, providing better coverage of higher latitudes.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003ELinus: We could re-use the probe design from the Dres and Duna Quartets, simplify it by removing the scientific instruments and launch three of them on a much smaller rocket, then use a resonant orbit to ensure they\u0027re evenly spaced in their orbit.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EGene: Sounds like a good idea- do it.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kt8OB53.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Kt8OB53.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D8Pdj8V.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/D8Pdj8V.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGene: Next up, we\u0027ve been contacted by no less than three aerospace companies who\u0027ve been trying to launch their own space programs but keep stranding their crews in space.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: We could send up that tourist shuttle with just a pilot on board and pick all three of them up in one go.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Ah yes, I remember you doing that before. Very good- do it again.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E; \u003C/span\u003EJeb: \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022chQvC0b.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/chQvC0b.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022df3yUVU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/df3yUVU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThis mission was completely successful, absolutely no problems with the landing skids clipping through the ground resulting in many explosions as the whole shuttle was destroyed on landing, nope, no siree...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Now we move on to this \u0022SCAN\u0022 stuff. Bill, Bob?\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Yes, the planetary mapping folk. They want us to create maps of Kerbin in multiple wavelengths including radar, infrared and UV to get a better picture of what Kerbin actually looks like.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: If the technology works out around Kerbin we could use it around other planets and moons (and Dres...) to not only find the best landing sites and any unusual surface features, but also to look for any tell-tale traces of The Anomaly or what caused it.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: The scanners are rather bulky compared to our available probe cores and they use quite a lot of power, but the results will be worth it. It\u0027ll also give us an extra relay satellite in a polar orbit which should cover a few black spots in the relay network. We\u0027d like to launch from Woomerang for two reasons- Kerbin\u0027s rotation is slower nearer the poles so it requires less effort to reach a polar orbit, plus the higher elevation will save some delta-V to make up for the increased fuel cost of launching into a polar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Very good. Make it so.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221a6ORCX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1a6ORCX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DXCDHEr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/DXCDHEr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGene: And now for the final item on the agenda- Linus?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: After the mishaps with the rovers on Kerbin and the Mun, we\u0027ve designed a new and improved rover that should address the issues encountered by those earlier models. This new design uses rugged girders to protect the more delicate electronics, comes with powerful communications and reaction wheels and ample solar panels to allow fully autonomous exploration. We call it the \u0022super-rover\u0022 and the same design should be usable on the Mun, Minmus and \u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cem\u003Ecoughcoughnotarealplanetcoughcough\u003C/em\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E \u003C/span\u003EDres. Making three identical rovers should reduce the chances of any mistakes in the manufacturing process.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: I like the sound of that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M50GAiI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/M50GAiI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLinus: ...hang on a minute- oh...\n\u003C/p\u003E\n\u003Cp\u003E\nGene: What?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Just a second-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EF9\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene: *confused blinking* ...Sorry, did you say something, Linus?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Nope. Nothing at all, everything is absolutely fine, the probe cores are definitely the right way up as they were the whole time, nothing to worry about.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Huh. OK then...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KzozHtg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KzozHtg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022difz9sM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/difz9sM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LLTSxIy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LLTSxIy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBob: Uh, Linus? You seem to be a bit low on fuel there.\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Don\u0027t worry, this design features a novel landing system\n\u003C/p\u003E\n\u003Cp\u003E\n*KABOOM*\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bEDRxMk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bEDRxMk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBob: How is \u0022running out of fuel and smashing the transfer stage into the Mun\u0022 a novel landing system?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: It worked, didn\u0027t it? The rover is perfectly fine.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: Explosions aren\u0027t \u0022perfectly fine\u0022!\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Did someone say explosions? \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGene: Meeting adjourned. Wait, why can I smell burning?\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Barbecue time!\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: You didn\u0027t take one of those \u0022Poodle\u0022 engines and turn it upside down like the advertising blurb said, did you?\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: ...\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: ...you didn\u0027t, did you?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: I saw a meme like this once...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/DMGFvq9\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/DMGFvq9\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2021-08-05T09:07:43Z","Content":"\n\u003Cp\u003E\nIf it looks stupid but it works, it ain\u0027t stupid. Just... Ablative lithobraking.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-06T22:44:43Z","Content":"\n\u003Cp\u003E\nJeb: Hi Gene, you wanted to see me? And was that Walt with a tranquiliser gun?\n\u003C/p\u003E\n\u003Cp\u003E\nGene: What? No, of course not. Anyway, I just wanted to let you know before we announce it to anyone else...\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: *hopeful* Go on.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: A very lucrative contract has just come in, one which will require a trip over to the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: *barely contained excited squeals*\n\u003C/p\u003E\n\u003Cp\u003E\nGene: It\u0027s a satellite repair contract, so we\u0027re sending Bill.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: *eyelid twitching*\n\u003C/p\u003E\n\u003Cp\u003E\nGene: We\u0027re getting a lot of funds out of this and by the looks of the small print access to the satellite too, and quite frankly we need that money. Now.\n\u003C/p\u003E\n\u003Cp\u003E\nWalt: *shoots tranquiliser dart*\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: *dodges* HA!\n\u003C/p\u003E\n\u003Cp\u003E\nVal: *shoots tranquiliser dart from behind Walt*\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Val... whyyyyy? *thud*\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Alright team, we are go for launch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BFqqSv5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BFqqSv5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill: Uh, guys? Someone forgot the forwards/backwards \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters on this thing. How am I supposed to park beside this thing?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Like this.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Aaagh! No barrel rolls! Hey, is that a gravity sensor on that satellite?\n\u003C/p\u003E\n\u003Cp\u003E\nWernher, Bob, Linus: Gravity sensor?\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Oh. That\u0027s not good- for some reason the nosecone won\u0027t come off the top of my capsule so I can\u0027t take the reaction wheel underneath it off and stick it to that satellite.\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Just a second-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Esaving edits to persistent.exe...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBill: ...huh, that\u0027s weird, it just popped off fine. Must\u0027ve been stuck or something.\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Must\u0027ve been...\n\u003C/p\u003E\n\u003Cp\u003E\nMorty: Contract complete, look at all those sweet, sweet-\n\u003C/p\u003E\n\u003Cp\u003E\nBill: YOINK! All your satellites are belong to me!\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Bill, what are you doing? That\u0027s not our satellite!\n\u003C/p\u003E\n\u003Cp\u003E\nBobak: According to my display, it is now.\n\u003C/p\u003E\n\u003Cp\u003E\nMorty: So they paid us to fix their satellite then gave it to us? That makes no sense at all.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Behold, Bill-Sat One!\n\u003C/p\u003E\n\u003Cp\u003E\nGene: ...\n\u003C/p\u003E\n\u003Cp\u003E\nBob: ...it\u0027s literally exactly the same as it was, but with the OKTO probe core from the top of your capsule instead of the objectively better HECS core that it had originally. And some \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E bits you ripped off your own craft. And you\u0027ve stolen some parts off of it too.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Shut up and take your gravity readings.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: Ooh, gravity readings!\n\u003C/p\u003E\n\u003Cp\u003E\nBill: I\u0027m coming back now, alert the recovery teams.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zTsQFOY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zTsQFOY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBill: ...hello? Where is everybody?\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Bad news Bill, you landed in the middle of the Badlands.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: So? Badlands aren\u0027t \u0022bad lands\u0022, that\u0027s just a misunderstanding of the geological term.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Yeah, but the recovery teams are a superstitious bunch. They\u0027ll be there as soon as they find three spoons and a shrubbery.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: And grab us some science data while you\u0027re there- reports, surface sample, that sort of thing.\n\u003C/p\u003E\n\u003Cp\u003E\nBill: What\u0027s the shrubbery for?\n\u003C/p\u003E\n\u003Cp\u003E\nGene: Who knows...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*several days later*\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cLYX301.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/cLYX301.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s Dres Quartet time! The intrepid foursome of dinky little probes are about to science the, er, science(?), out of nobody\u0027s favourite celestial body. And also Minmus. Communications hampered by low signal strength resulting in really low data rates (single digit bytes per second) even with the Dres Relay providing some relaying capabilities; that relay is too high and is already being moved to a lower orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nProbe 1: 5/10, landed in the lowlands like the Sunshot 2 probe did, but did a hop to the nearby midlands and got some science from it. Took a long time to transmit its science due to LOS and generally weak signal when it had one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WvxcLTu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WvxcLTu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nProbe 2: 6/10, expensive plane change burn brought it down almost on top of the south pole. Found a strange crater nearby but couldn\u0027t do anything about it. Maintained a signal, but low data rates still meant it took a long time to get and transmit all the science due to limited hard drive space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xBy7PH2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xBy7PH2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nProbe 3: 8/10, initial landing accuracy wasn\u0027t great but it \u003Cem\u003Ewas\u003C/em\u003E landing on the edge of that gopping great gouge in Dres\u0027 surface so that\u0027s forgivable. Did a hop down into the canyon for some science, signal and sunlight are hard to come by down there so took a while to get the data out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221IWk5bL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1IWk5bL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022opaE4Fj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/opaE4Fj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sJMy6Md.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sJMy6Md.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBobak: I never realised it was that big.\n\u003C/p\u003E\n\u003Cp\u003E\nMorty: That\u0027s going to sell a lot of fridge magnets at the gift shop.\n\u003C/p\u003E\n\u003Cp\u003E\nProbe 4: 17/10. Blatant cheating going on as it rode the transfer stage out to Minmus then landed repeatedly using the remaining fuel, burn time and ignitions on that stage before flying under its own power. Visited four biomes in total with fuel to spare for more hops in the future. Also fell over and had to scrape itself across the ground to try and point the right way up again. Exhausted engine burn time and ignitions so failure was inevitable, occurred at low altitude and speed so no explosions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wvD5aKo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wvD5aKo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zVVC9nR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zVVC9nR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dFtGHho.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dFtGHho.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xPLbGqs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xPLbGqs.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIf you zoom in closely enough, you can see the crescent of Kerbin in that last image, but it\u0027s so small that it\u0027s really hard to see even in the original screenshot. Distant Object Enhancement is now installed but Kerbin is visible from here without it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n*smash cut back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E*\n\u003C/p\u003E\n\u003Cp\u003E\nGene: They want us to SCAN the Mun now? Is that feasible?\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Actually yes- a few minor tweaks to the probe that did the scans around Kerbin and we can use it for the Mun, no trouble at all.\n\u003C/p\u003E\n\u003Cp\u003E\nBob: Slightly bigger upper stage, rearrange the solar panels a bit... Yup, entirely workable.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JxGxVUU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JxGxVUU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA rare launch from the Dessert Launchsite to take advantage of its position relative to the Mun\u0027s orbit (i.e. directly below it so the rocket could launch directly into its orbital plane), not a single solid booster in sight. Pathetic \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zSJfusC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zSJfusC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uxqSm7F.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uxqSm7F.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n*impromptu team meeting*\n\u003C/p\u003E\n\u003Cp\u003E\nVal: We need to give Jeb his Mun landing. It\u0027s just not fair how we\u0027ve been treating him lately and it would mean a lot to him-\n\u003C/p\u003E\n\u003Cp\u003E\nBob: What if we sent him to Dres instead?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: -what?\n\u003C/p\u003E\n\u003Cp\u003E\nBill: Yeah, going to the Mun is boring and we\u0027ve already done that, but nobody\u0027s been to Dres yet.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: But-\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: That\u0027s not a bad idea, actually- it\u0027s an interplanetary mission, but one where he\u0027s still close enough to come back pretty quickly and without worrying about transfer windows or anything like that.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Wait-\n\u003C/p\u003E\n\u003Cp\u003E\nGus: What about all those other Kerbonauts we\u0027ve rescued? Don\u0027t they deserve a chance too?\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Do you \u003Cem\u003Ewant\u003C/em\u003E Jeb to try and fly a plane through the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E? Because that\u0027s how you get Jeb trying to fly a plane through the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nGene: OK, that settles it. Prepare a mission to Dres and make sure Jeb\u0027s flying it. I want him planting that flag on Dres and if possible Minmus too.\n\u003C/p\u003E\n\u003Cp\u003E\nVal: Hmm, first Kerbal to land somewhere outside Kerbin\u0027s gravity well and a double landing too? That might just do it.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: Do what? Why is everyone staring at me? And why does Gene have \u0022SEND JEB TO DRES\u0022 written on his notepad?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/1G3HT2P\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/1G3HT2P\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI wasn\u0027t actually planning a crewed mission over to Dres/Minmus, but there\u0027s nothing actually stopping me right now- I have the technology to get there and back, the life support systems to keep the crew alive for the trip and it\u0027s a good dress rehearsal for a trip further afield- Dres stays close to Kerbin for its entire orbit so the trips can be just a few days long either way depending on how much fuel you\u0027re willing to use.\n\u003C/p\u003E\n\u003Cp\u003E\n(Sorry, Jeb...)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-07T22:01:40Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EOperation Send Jeb To Dres is a go!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EBut first, the design team got their heads together for a serious discussion. Since the Dres mission is (hopefully!) coming back and the two-crew pod has ample sample storage space, why not take the materials bays and mystery goos on that trip and return with the samples?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E...well, aside from the additional weight of nearly a ton from the six materials bays and two mystery goo capsules (each one holds three samples), that is. Adding that to the crew mission would be prohibitively heavy, so instead they came up with a compromise: launch them separately, have them do their science and then the crew can pick up the samples later. Simple!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cimg alt=\u0022uNjmMxa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uNjmMxa.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cimg alt=\u0022sDAZ47l.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sDAZ47l.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EWith the maximum size of rockets still limited by the relatively small launchpad (and the relatively small parts currently available) there was no chance of building an all in one craft to fly out, land on Dres and Minmus and then return in one go, or to launch the lander on the same rocket either. The lander was launched separately instead, with the crew and service module (CSM) launched on the next orbit.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cimg alt=\u0022SQvDfwG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SQvDfwG.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: SECURITY! There\u0027s some weirdo in my capsule!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESanlan: Uh, I work here?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: Wait, do you?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene: Yes, she does.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: Huh. I was expecting Bill or Bob.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESanlan: I think I heard them saying something about \u0022fifty days in a tin can with Jeb? Not for all the funds in the world!\u0022 or something like that.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EBob: Hey! That was Bill, not me!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EBill: Well, you said you\u0027d rather spend the time rubbing a cheese grater across your face.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene: Can we focus on the launch please?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: Roger that, LAUNCHING!!!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene: Jeb, wait-\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cimg alt=\u0022PO8DfDo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PO8DfDo.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene: Jeb, you launched too early- you were supposed to wait so you could launch straight up beside the lander; now you have to try and rendezvous with it- in the dark.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ELinus: As is right and proper.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGene: Huh?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ELinus: ...never mind.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EVal: *whispers to Bill* Is it just me, or has Linus been acting weird lately?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: Docking in three, two, one...\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cimg alt=\u0022OfQIEFD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OfQIEFD.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: So you want me to burn that upper stage on the bottom of the lander first, then dump it once it\u0027s empty and finish on the CSM engine with a handbrake turn half way through?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EWernher: That\u0027s not what I said, but close enough.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: OK then, firing the engine and oh boy this thing is wobbling like crazy I mean it\u0027s just \u003Csup\u003Econsta\u003C/sup\u003Ently s\u003Csub\u003Ewaying ba\u003C/sub\u003Eck and \u003Csup\u003Eforth \u003C/sup\u003Elik\u003Csub\u003Ee a pen\u003C/sub\u003Edul\u003Csup\u003Eum\u003C/sup\u003E-\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESanlan: \u003Cem\u003EDon\u0027t throw up don\u0027t throw up don\u0027t throw up...\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: What\u0027s that docking port made out of anyway, plasticene? It\u0027s not so bad now with the main engine but that was horrible.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VM7S7rJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VM7S7rJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EVal: Hey Jeb? Did you bring your EVA pack with you?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: ...yes?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EVal: Because I just found an EVA pack with \u0022Property of Jeb, do not touch\u0022 written on the back in your locker and I don\u0027t remember seeing you wearing one when you headed out to the launchpad.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EJeb: \u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003EВЯЕZНЙЕVS ТФЕИДILS!\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003EVal: Hey, that\u0027s my line!\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022S4oQzba.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/S4oQzba.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027, Times, serif;\u0022\u003EAnd now for something \u003Cs\u003Ecompletely\u003C/s\u003E slightly different...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229oR47wn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9oR47wn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EIt\u0027s rover time! The Dres and Minmus super-rovers have arrived in Dres\u0027 \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and will now begin their landing sequences. First up, Dres:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gr7M9cm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gr7M9cm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n9/10 successful landing with fuel to spare despite switching to a direct descent trajectory because the margins looked tighter than they were.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now Minmus:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229BXa07f.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9BXa07f.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022F9pphl2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/F9pphl2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n8/10 Landed safely with fuel to spare, on a plateau above the flats. Points deducted for nearly breaking the antenna while trying to remain \u0022surface retrograde\u0022 when already landed.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the Dres Relay completes its move to a lower (~400km) polar orbit to try and boost the signal from craft on the surface of Dres and Minmus back to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X4VwrlD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/X4VwrlD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n6/10 nearly drained the batteries by pointing the solar panels away from the sun but recovered at the last minute.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: So what\u0027s the situation with those rovers we sent out across Kerbin?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: Well, Kerbin Rover 1 should have reached its destination by now and hopefully it\u0027ll find what we\u0027re looking for.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: ...which is?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220RHh9Qj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0RHh9Qj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CI5vyPX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CI5vyPX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLinus: That\u0027s odd, we haven\u0027t had that message saying that the launchsite is available yet, maybe it needs to drive away a bit then come back because spawning inside the radius doesn\u0027t trigger the dialog?\n\u003C/p\u003E\n\u003Cp\u003E\nWernher: Dialog box? Spawning? What are you talking about, Linus!?\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: *grabs Wernher by his lapels* \u003Cem\u003EYou ask too many questions, von Kerman. \u003C/em\u003E*dead-eyed stare*\n\u003C/p\u003E\n\u003Cp\u003E\nWerhner: \u003Cspan style=\u0022font-size:8px;\u0022\u003Emeep\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinus: *acts like nothing happened* See, just needed to drive away for a bit then come back, sometimes these geolocation things don\u0027t work first time.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/uRiU5gl\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/uRiU5gl\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBob: Uh, Jeb? Sanlan? Your course keeps changing and the tracking systems are struggling to plot your trajectory properly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBob: Guys? Hello?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRadio: *heavy breathing*\n\u003C/p\u003E\n\u003Cp\u003E\nBob: ... \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb: Sorry about that, Sanlan just found a tiny little spider in one of the storage bins and had a little freak out.\n\u003C/p\u003E\n\u003Cp\u003E\nSanlan: It was a HUGE spider! Absolutely massive!\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: So obviously she tried to get away from it, but it\u0027s a small capsule and she kept crashing into stuff like the controls (good job I switched those off, eh?) and she must have scared it into hiding because now we can\u0027t find it again.\n\u003C/p\u003E\n\u003Cp\u003E\nSanlan: I\u0027m sleeping in the lander from now on.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb: How do you know the spider isn\u0027t in the lander already?\n\u003C/p\u003E\n\u003Cp\u003E\nSanlan: \u003Cspan style=\u0022font-size:8px;\u0022\u003E...I hate you.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-08-08T11:45:25Z","Content":"\n\u003Cp\u003E\nBut spooders awe absowutely lovely \u003Cspan\u003E:3\u003C/span\u003E\n\u003C/p\u003E\n"}]}