{"TopicId":204092,"ForumId":109,"TopicTitle":"In game Progression of KSP 2","CreatedByName":"Basesixty","CreatedById":210715,"CreatedDateTime":"2021-07-29T17:10:22Z","PageNum":1,"Articles":[{"CreatedByName":"Basesixty","CreatedById":210715,"CreatedDateTime":"2021-07-29T17:10:22Z","Content":"\n\u003Cp\u003E\nIn the first kerbal game the progression  you would make through the tech tree(finishing the game at minmus) and through exploration(Going to the mun within ten minutes of starting a new game) had an extremely fast pace which seemed almost too fast for me personally. So I wanted to know peoples opinions on if the progression speed should stay the same be slower or be faster for KSP 2 especially with the fact that colonies and interstellar travel will be introduced.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-07-29T19:28:19Z","Content":"\n\u003Cp\u003E\nGreat topic. I actually feel exactly the opposite haha. Or rather I agree but I see it differently. To my mind the pacing from Kerbin to the Mun is about right, after which it comes to a grinding halt. I say that because by progression I don\u0027t just mean the tech-tree, but the entire structure of the game. From this standpoint 2-3 missions to reach orbit followed by 2-3 missions to land on Minmus and/or the Mun, 2-3 missions to set up your first station, etc, really isn\u0027t bad, and players should have access to a good portion of the existing tech-tree to do that. There is nothing however after that point that impels players to start sending interplanetary probes and crewed missions and so they spend another dozen or two missions tediously farming around Kerbin and its moons until the tech tree is done, and of those that even reach that point half of them never leave. Given all of the cool stuff KSP2 has in scope it really can\u0027t allow that post-mun-mission bog-down to happen. \u003Cbr\u003E\u003Cbr\u003E\n I spent a minute this spring estimating the number of distinct missions it should probably take to get out and build a few colonies and tech up to your first interstellar vessel:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#e6e8e9;color:#2d3134;font-size:15px;\u0022\u003E\nJust some quick estimates: I think in principle it should be possible for a semi-experienced player to go interstellar within 100-150 hours of gameplay, or 4h/ week for 6-9 months (for reference it takes around 200h to get to level 100 in Skyrim.) Others may vary but I find I average about 2h/ mission all-in between planning, design, testing, and flight-time. That’s just 50-75 missions. How might that budget out?\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#e6e8e9;color:#2d3134;font-size:15px;\u0022\u003E\n1 survey probe per body: 16 missions\u003Cbr\u003E\n2 initial landings on 8 bodies (probe and/or crewed): 16 missions\u003Cbr\u003E\n2 prospecting missions on 4 bodies: 8 missions\u003Cbr\u003E\n3 asteroid/comet missions\u003Cbr\u003E\n3 colony set up missions on 2 bodies: 6 missions\u003Cbr\u003E\n4 logistics missions on 2 bodies (satellites, milk-run establishment): 8 missions\u003Cbr\u003E\n3 additional exploration/science missions on 2 bodies: 6 missions\u003Cbr\u003E\n2 interstellar probes\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#e6e8e9;color:#2d3134;font-size:15px;\u0022\u003E\nTotal: 65 missions\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#e6e8e9;color:#2d3134;font-size:15px;\u0022\u003E\nThat, plus down-time spent managing tech development, crews, colony building, and managing economies and resources probably brings you close to that 140-150h mark. Keep in mind these are just guesstimated averages, some missions will be much faster or longer than 2h and different players might spend more time on a few bodies rather than trying to visit all 16. You\u0027ll notice this isn\u0027t really that many missions to play with, but I think its about right considering this is just to get to the point where you\u0027ve completed enough of the tech tree to build your first interplanetary colony ship. If you make it drastically more time consuming than that or bog players down with tedious tasks you aren\u0027t going to get most players to even start colonies, let alone explore other star systems. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nGiven that kind of pacing I really don\u0027t think you want more than 5-6 initial launches to get to orbit and reach Minmus and the Mun, and you definitely don\u0027t want a dozen repetitive biome hops around them. Those first 6 missions should furnish you with everything you need to go interplanetary and start prospecting and building your first rudimentary stations and outposts. The fortunate thing is KSP2\u0027s tech tree is going to be much deeper, so you absolutely can dole out 3/4 of the existing parts within the Kerbin system. After that though I think its important that Kerbin and its moons are mostly mined out for tech rewards so players can\u0027t just putter around and have to make some leaps to keep moving. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"maxadmiral","CreatedById":37003,"CreatedDateTime":"2021-07-30T09:56:58Z","Content":"\n\u003Cp\u003E\nI absolutely love the progression in \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1, but it might be too hardcore/tedious for many players.\n\u003C/p\u003E\n"},{"CreatedByName":"Dientus","CreatedById":209823,"CreatedDateTime":"2021-07-30T17:50:25Z","Content":"\n\u003Cp\u003E\nThats were the options and sliders come in. Not to mention sandbox.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs initial, stock settings, I think a more realistic and logical approach should be taken. After that, changing options and/add mods to taste.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022105624\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0022 rel=\u0022\u0022\u003E@Pthigrivi\u003C/a\u003E  I think what you have is realistic eenough the way it\u0027s stated\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-30T17:53:47Z\u0022 title=\u002207/30/2021 05:53  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 30, 2021\u003C/time\u003E by Dientus\u003C/strong\u003E\n\u003Cbr\u003Eaddition and changes meh mobile\n\u003C/span\u003E\n"},{"CreatedByName":"Black Dog","CreatedById":144087,"CreatedDateTime":"2021-07-30T19:22:23Z","Content":"\n\u003Cp\u003E\nDuring science career, I usually set the slider to 20% Science rewards.  Sometimes even 10% and adding a flat 20-50 point to get you started.  This means the progression curve is much flatter and you have to build some rugged rockets to achieve your goals.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-07-30T20:30:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224012455\u0022 data-ipsquote-contentid=\u0022204092\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627672943\u0022 data-ipsquote-userid=\u0022144087\u0022 data-ipsquote-username=\u0022Black Dog\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Black Dog said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDuring science career, I usually set the slider to 20% Science rewards.  Sometimes even 10% and adding a flat 20-50 point to get you started.  This means the progression curve is much flatter and you have to build some rugged rockets to achieve your goals.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThats funny I set it to 120-150% because I want to get right to it. How many missions do you fly before you send a probe to Duna?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-30T20:30:40Z\u0022 title=\u002207/30/2021 08:30  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 30, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Black Dog","CreatedById":144087,"CreatedDateTime":"2021-07-31T06:20:49Z","Content":"\n\u003Cp\u003E\nDon\u0027t send any unmanned probes. It\u0027s always Kerbals with \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Life Support to add to the difficulty.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it\u0027s usually 2-3 missions on and around Kerbin, then flying around mun/minmus and leaving Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E to get Kerbol science before attempting the first lander on Mun/Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter that it\u0027s Duna/Eve Flybys befor landing on one of the moons\n\u003C/p\u003E\n"}]}