{"TopicId":204049,"ForumId":32,"TopicTitle":"Anyone else having a bug where too much body lift is produced with Sepratrons or other stuff?","CreatedByName":"TeikuMaximus","CreatedById":213092,"CreatedDateTime":"2021-07-27T01:38:39Z","PageNum":1,"Articles":[{"CreatedByName":"TeikuMaximus","CreatedById":213092,"CreatedDateTime":"2021-07-27T01:38:39Z","Content":"\n\u003Cp\u003E\nSo before I got the new update, I had a Saturn V that worked perfectly and would be able to get me to the Mun. After the update, however, I noticed my rocket kept wanting to steer itself upwards. I later turned on Aerodynamic Overlay and saw that there was a huge amount of body lift being produced where the Sepratrons and three monoprop. tanks (which weren\u0027t even on the outside of the craft) were located. I took off the Sepratrons and it seemed fine afterwards. So I believe this might be a bug of some sort.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-07-27T11:43:49Z","Content":"\n\u003Cp\u003E\nthere are parts that produce extreme amounts of lift when exposed to airflow at certain angles. it\u0027s more of a glitch than a bug.\n\u003C/p\u003E\n\u003Cp\u003E\nsome people use it to create planes more efficient than they could ever be. they call them \u0022magic wings\u0022, though i prefer the term \u0022kraken aerodinamics\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2021-07-29T20:20:51Z","Content":"\n\u003Cp\u003E\nI don\u0027t see any similar problem when I tilt the sepratrons on my \u003Ca href=\u0022https://kerbalx.com/OHara/Apollo-15-ish-without-MH/parts\u0022 rel=\u0022external nofollow\u0022\u003ESaturn V\u003C/a\u003E.    Maybe something got confused in your install. Maybe deleting partdatabase.cfg to let KSP rebuild it will solve it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you like, you can put your craft file on the bug tracker, and I\u0027ll try to spot the problem, or someone else might spot it first.\n\u003C/p\u003E\n"}]}