{"TopicId":204368,"ForumId":15,"TopicTitle":"Assistance for Custom IVA Creation with ASET Props","CreatedByName":"sawg","CreatedById":205150,"CreatedDateTime":"2021-08-15T07:23:21Z","PageNum":1,"Articles":[{"CreatedByName":"sawg","CreatedById":205150,"CreatedDateTime":"2021-08-15T07:23:21Z","Content":"\n\u003Cp\u003E\nSo I am a complete modding novice. I have never touched a 3D game engine, I don\u0027t know the first thing about C\u002B\u002B or C#, and I\u0027ve never created a KSP mod in my life, but I would like to task myself with creating a new custom IVA for some of the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133590-111x-endurance-from-interstellar-continued-v113-20th-feb-2021/\u0022 rel=\u0022\u0022\u003EEndurance Mod \u003C/a\u003E command pods, more specifically; I would like to create new interactive IVA\u0027s for the command pods using ASET props.\n\u003C/p\u003E\n\u003Cp\u003E\nI noticed that when you download ASET props and all the other dependencies, the interactive RPM cockpits for the ships such as the lander, ranger, and Endurance Command Module do not work anymore for any of the interiors, and I would like to create new ASET IVA\u0027s for them. However, all the articles that I\u0027ve look at which try and tell me how to get into modding are 5\u002B years old, and furthermore, none of them are specific towards ASET props. I know there is a link on the original site but that link does not work anymore.\n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone has any assistance in to helping me get started with using ASET props in creating custom IVA\u0027s it would be greatly appreciated \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2021-08-15T17:35:48Z","Content":"\n\u003Cp\u003E\nI have not tried modding either, but I have moved your post to the sub where you can find people who have. \n\u003C/p\u003E\n"}]}