{"TopicId":20452,"ForumId":18,"TopicTitle":"Fresh opinion of the music I\u0026#039;ve been writing (Rock/punk)","CreatedByName":"boac89","CreatedById":39429,"CreatedDateTime":"2012-09-26T14:03:02Z","PageNum":1,"Articles":[{"CreatedByName":"boac89","CreatedById":39429,"CreatedDateTime":"2012-09-26T14:03:02Z","Content":"\n\u003Cp\u003EI\u0027ve been writing all the songs for my band since we started but I don\u0027t really have a background in song writing. I mainly use song writing to get my opinions out, but it would be good if I could actually write something that sounds entertaining.\u003C/p\u003E\u003Cp\u003EI\u0027ve made a page at Reverb Nation under my name (rather than for my band) and recorded some \u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003Evocals on top of midis\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E I\u0027ve written out for a few of our songs. Just looking for some opinions on them, which ones were better, etc.\u003C/p\u003E\u003Cp\u003ESongs:\u003C/p\u003E\u003Cp\u003EBurn (Rushed vocals)\u003C/p\u003E\u003Cp\u003ERipped and Stoned (First song I wrote)\u003C/p\u003E\u003Cp\u003ESet Me Free (Palm muting in the guitar/drum section doesn\u0027t come up in this version)\u003C/p\u003E\u003Cp\u003EStart Again (Newest song I\u0027ve written. Haven\u0027t yet written the bass line or guitar solo. Originally written for 2 guitars but I\u0027ve removed the lead guitar line)\u003C/p\u003E\u003Cp\u003ETake It or Leave It (Slightly different style, written about Saturday nights in my home town. Seems to be a crowd favourite)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.reverbnation.com/randyfromreckless\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reverbnation.com/randyfromreckless\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-27T00:26:01Z\u0022 title=\u002209/27/2012 12:26  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 27, 2012\u003C/time\u003E by boac89\u003C/strong\u003E\n\u003Cbr\u003EHighlighting the fact I used midis\n\u003C/span\u003E\n"},{"CreatedByName":"Vostre Roy","CreatedById":51582,"CreatedDateTime":"2012-09-26T19:16:57Z","Content":"\n\u003Cp\u003EHey man, here\u0027s my opinion!\u003C/p\u003E\u003Cp\u003EFirst of all, I should had read your post totally before hitting the play button, I was all \u0022damn, guitars and drums sound freaking midi...\u0022. Riffs seems pretty nice, totally get into the punk/rock vibe, imagining them with a decent sound and they are more likely pretty catchy.\u003C/p\u003E\u003Cp\u003ENow, for the singing part, since its what you want opinion on mostly. You got a really nice voice, you control your pitch pretty nicely and the type of vocals fits the music pretty nicely. That being said, here is what I\u0027d suggest you: give a little heat/harsh to your voice, not telling you that you should go all death metal or anything, your singing is just too clean for punk rock IMO (keep in mind, I\u0027m listening mostly to metal, so thats a metalhead opinion lol).\u003C/p\u003E\u003Cp\u003EAnyway, keep up making music. I\u0027m also a musician myself (playing guitar in a project, bass in another, back vocalist for both), nice to see some other on this board\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-09-26T21:20:12Z","Content":"\n\u003Cp\u003EIt does sound good, and you do have a good voice.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure if this is good or bad, but I half-agree with Vostre Roy on your voice being too clean.\u003C/p\u003E\u003Cp\u003EThe voice reminds me of Green Day style music (punk/rock I guess), but the music makes me think darker more metal. I attached it to Metalocalypse, although it certainly isn\u0027t NEARLY as hardcore metal as that.\u003C/p\u003E\u003Cp\u003EMy point is that I almost felt like they juxtaposed. They didn\u0027t clash, but juxtaposed.\u003C/p\u003E\u003Cp\u003EI don\u0027t know what else to say. I liked your voice, and the music beat (it sounded to much like a midi file for my taste), so...yeah. I can\u0027t really describe what I\u0027m trying to get at lol\u003C/p\u003E\u003Cp\u003EEdit: \u0026gt;_\u0026gt; Maybe you should bold face the part about MIDI files in your post, because I read right over it somehow lol\u003C/p\u003E\n"},{"CreatedByName":"boac89","CreatedById":39429,"CreatedDateTime":"2012-09-27T00:24:57Z","Content":"\n\u003Cp\u003EThanks for the advice! I\u0027ll bold up the midi part. lol.\u003C/p\u003E\u003Cp\u003EI actually agree a fair bit with what you\u0027re saying about my voice being too clean. I\u0027m currently working on that for most of the songs. In fact, my band has put Avenues and Alleyways by Rancid on our playlist because it\u0027s a good song for me to practise a harsher voice on.\u003C/p\u003E\u003Cp\u003EThanks again! I posted this on another forum too but considering my experience of that forum I\u0027m not expecting too much help there XD\u003C/p\u003E\n"},{"CreatedByName":"boac89","CreatedById":39429,"CreatedDateTime":"2012-09-27T00:40:05Z","Content":"\n\u003Cp\u003EBTW, did anyone work out any of my hidden lyrical meanings? I always have meaning in my lyrics but I try to keep them fairly cryptic. So far I think I\u0027m the only one that understand what the songs are about.\u003C/p\u003E\n"}]}