{"TopicId":204913,"ForumId":81,"TopicTitle":"PS4 Career Save Lost","CreatedByName":"Ande","CreatedById":216227,"CreatedDateTime":"2021-09-20T12:15:48Z","PageNum":1,"Articles":[{"CreatedByName":"Ande","CreatedById":216227,"CreatedDateTime":"2021-09-20T12:15:48Z","Content":"\n\u003Cp\u003E\nPS4 user here. Just about got used to all there is to know on KSP basics and been building out my career nicely, last night I added another module to my munstation, about 5 modules in total. Spent a good hour getting it docked and saved game fine back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E. I had a fleet of boosters in sub assembly and have been really enjoying the game. Last night I quickly loaded back into my munstation to check a few things again before closing for the night and it blue screen errored. It\u0027s done that a few times since I\u0027ve been playing and usually it just loads up the last persistent save file fine. But for unknown reason on loading just now it says corrupt file keep or remove. I selected to keep but now when trying to load my career save has been removed. Noticed on here a few old threads but not for a while, as we recently had updates to breaking ground on PS4 I wondered if old bugs have crept back in or if this is just a result of poor quality on console versions? End result, I\u0027ve lost hours and hours of hard graft and enjoyable gameplay... All those seat of the pants rescues and missions I\u0027ve completed are down the drain and I\u0027ve been forced to start new career. Am I the only one that thinks this is very poor? Even if they aren\u0027t releasing new updates anymore, surely we need a stable game to play!? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-20T12:21:55Z\u0022 title=\u002209/20/2021 12:21  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 20, 2021\u003C/time\u003E by Ande\u003C/strong\u003E\n\u003Cbr\u003ESpelling\n\u003C/span\u003E\n"},{"CreatedByName":"MZ_per_X1","CreatedById":199474,"CreatedDateTime":"2021-09-24T08:17:41Z","Content":"\n\u003Cp\u003E\nUnfortunately, the console edition is riddled with bugs, highly unstable, not much looked after. You can try to copy your save onto USB every time you save the game. But one USB still doesn\u0027t guarantee success. Two USB drives can minimise the loss if the save gets corrupted (save to one USB, and the next time you save, save to the second USB. As a result if you lose anything, you only lose the difference) but it is too tedious, slow and the game becomes a save management game rather than space exploration. \n\u003C/p\u003E\n\u003Cp\u003E\nI stopped playing because of the issues. The PS5 upgrade is coming but not sure if the ps4 version gets more support. \n\u003C/p\u003E\n"},{"CreatedByName":"Ande","CreatedById":216227,"CreatedDateTime":"2021-11-16T00:39:36Z","Content":"\n\u003Cp\u003E\nI genuinely think it\u0027s got worse for me since this post in September. I never had any issue with hanging on ps4 during flight but in the last 3 days every night I\u0027ve had a hanging issue. Latest one after getting everything ready to land on Ike for the first time.. I think I took a quicksave so not end of the world. \n\u003C/p\u003E\n\u003Cp\u003E\nMaybe it\u0027s been programmed to break so as to avoid being used as an excuse for tiredness I dunno but it definitely is more frequently crashing at the moment. \n\u003C/p\u003E\n"}]}