{"TopicId":205054,"ForumId":36,"TopicTitle":"Thought SIMPLEX Colony","CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2021-09-29T20:04:07Z","PageNum":1,"Articles":[{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2021-09-29T20:04:07Z","Content":"\n\u003Cp\u003E\nHi everyone.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m just about there on a release for a new SIMPLEX Colony Mod.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically... colonists are a resource, and expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nThere will be three parts using stock part models, although I\u0027m now thinking of a fourth part\n\u003C/p\u003E\n\u003Cp\u003E\nTwo Arcologies, and one Taxi (and maybe a kerbal training facility)\n\u003C/p\u003E\n\u003Cp\u003E\nThe Arcologies are around 45m in diameter, a ring of mk3 crew cabins (internals removed) connected to a central hitchhiker via structural fuselages and have a mass in  excess of 350 tons.  The suggestion is to either have a massively oversized rocket, or use Extraplanetary Launchpads, or Global Construction.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Taxi is a Mk3 tank with some minor greballing carrying 5 kerbals - twenty parts to fill one arcology.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing the Moar Kerbals mod (zer0Kerbal and LinuxGuruGamer), a kerbonaut visits the arcology which has been filled with Colonists.  The kerbonaut then generates Interest (another resource, not tweakable, not available in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E) and once this is full, the kerbonaut then \u0027Recruits\u0027 a fresh kerbal.  The Interest returns to nil and a Colonist unit is reduced by 1.\n\u003C/p\u003E\n\u003Cp\u003E\nThe interest generator is a \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E module with no heat.  It also requires a certain number of Colonists to work, so 96 of the 100 capacity of the Arcology.  \n\u003C/p\u003E\n\u003Cp\u003E\nA second arcology with an additional ring has the ability to generate more Colonists, but needs 10 or so to start, requiring \u0022\u003Cem\u003Ea village to raise a kerbal\u003C/em\u003E\u0022.   In-game lore (as this will be a late techtree part) will say that through specialised growth and brain coding, it will only take weeks/months to bring about a fully realised adult colonist.  This will be at eth end of the Techtree.\n\u003C/p\u003E\n\u003Cp\u003E\nMoar Kerbals \u0027klones\u0027 kerbonauts spawning a civilian, but this mod will rename that process to recruiting.  For training, I currently had this in the Lab, but I may create anther part for training civilians to pilot/ engineer, etc, before release.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-29T20:13:45Z\u0022 title=\u002209/29/2021 08:13  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 29, 2021\u003C/time\u003E by theJesuit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2021-10-02T08:03:05Z","Content":"\n\u003Cp\u003E\nReleased \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022122369\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3798923745\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/205078-1122-simplex-colonies/\u0026amp;do=embed\u0022 style=\u0022height:194px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}