{"TopicId":205141,"ForumId":70,"TopicTitle":"The plague of 1.12 - Engine sounds / Vessel sound effects stop working occassionally, mainly post timewarp","CreatedByName":"Alexsys","CreatedById":211693,"CreatedDateTime":"2021-10-05T06:42:27Z","PageNum":1,"Articles":[{"CreatedByName":"Alexsys","CreatedById":211693,"CreatedDateTime":"2021-10-05T06:42:27Z","Content":"\n\u003Cp\u003E\nThis issue has been plaguing ksp since 1.12 hit. When at first everyone were going mad about it, devs patched it some time after in the latest vesion we have, and lowered the probability of it happening by at least 50%. Yet it\u0027s still there.\u003Cbr\u003E\nAnd I am lost on pinpointing it, which leads me to believe 1.12 has something in it that causes this thing, whether its a script incompatability with mods, or whatever this is. This is not mod specific, after tons of uninstalling and tries. (I dont remember about my stock game time due to memory loss, so cant state on that.)\n\u003C/p\u003E\n\u003Cp\u003E\nFor some reason, the main trigger are time warps, and at times the trigger to the complete sound effect silence of the vessel (\u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E / Engine sounds / Mining drill sounds), tends to be simply pressing M often and coming in and out of the map, during flights.\u003Cbr\u003E\nIt forces you, in about every hour and a half or so, restart the game to regain engine sounds, of course after some intensive flight with intensive time warps (just the usual moon job) but TIME WARP is the deal breaker seemingly.\u003Cbr\u003E\nAnd surprisingly, a completely normal time warp without any extra modification.\n\u003C/p\u003E\n\u003Cp\u003E\nIt looks like it\u0027s a rather common issue as well, with itself striking occassionally but unoccassionally. (My experience, it hits in about 1.4 hours, after you do some flying, map in and out and so on.)\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems and sounds like the vessel is actually FARTHER away from the camera than it actually is, therefore getting the sound effects sound distant, until over time they completely vanish requiring a game restart, which more and more narrows it down to being some kind of a time warp related thing, and I am not the only one to narrow it down to this.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyone has any leads? Or maybe found a secret solution and just hasn\u0027t shared with the world yet?\u003Cbr\u003E\nIf this is what squad has left us in the last version, it really sucks. No one wants to restart the game after doing some ingame fiddling and losing all ship sound effects turning all vessels ingame silent until a restart is done.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/cuj6etcxnhtmqz3/logs%2Cand%20all%20the%20rest.rar?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/cuj6etcxnhtmqz3/logs%2Cand all the rest.rar?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAll the logs that may be needed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nModlist:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZilojgR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002252.03\u0022 height=\u0022550\u0022 width=\u00221057\u0022 src=\u0022https://i.imgur.com/ZilojgR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is like the cure for cancer of KSP 1.12.\n\u003C/p\u003E\n\u003Cp\u003E\nWho ever manages to find a lead to it, will infact save this game.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried my best digging into it myself, but just as the rest that I\u0027ve seen, left with no answers, eventually dropping off interesting.\u003Cbr\u003E\nAm not professional at these kind of things, unlike many amazing individuals on this community that have certainly impressed with their skill and abilities,\u003Cbr\u003E\nyet I do believe there is something we\u0027re missing. There must be.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-05T06:57:26Z\u0022 title=\u002210/05/2021 06:57  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 5, 2021\u003C/time\u003E by Alexsys\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2021-11-03T14:28:51Z","Content":"\n\u003Cp\u003E\nI\u0027ll add that the 1.12.2 engine sound bugs might also be triggered by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E buildings.\n\u003C/p\u003E\n\u003Cp\u003E\nI have my music volume at 0%.  I usually hear no music while in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E overview. If I go into the R\u0026amp;D building or \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, sometimes after leaving the building music will start playing for the rest of my game session, and I lose engine sounds. Minor sounds like the wind rushing over my rocket continue to work.\n\u003C/p\u003E\n"},{"CreatedByName":"hellothere___","CreatedById":230901,"CreatedDateTime":"2023-12-13T19:15:23Z","Content":"\n\u003Cp\u003E\nthis happened to me, except it was triggered by nothing, randomly happened\n\u003C/p\u003E\n"}]}