{"TopicId":205243,"ForumId":16,"TopicTitle":"First time to the Grey planet. Someone can help me?","CreatedByName":"Alien21","CreatedById":211562,"CreatedDateTime":"2021-10-13T21:18:55Z","PageNum":1,"Articles":[{"CreatedByName":"Alien21","CreatedById":211562,"CreatedDateTime":"2021-10-13T21:18:55Z","Content":"\n\u003Cp\u003E\nHello KSP users. Alien21 Space Agency has evaluated to plan a mission to the most strange planet. Maybe isn\u0027t correct call it a planet, but Dres seems in a great position for a launch and we\u0027re evaluating to do a direct mission to that undiscovered planet after our first fly by to Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nOur MCC (maybe it could be better call it\u003Ca href=\u0022https://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003E https://alexmoon.github.io/ksp/\u003C/a\u003E ), has calculated for us these data which seems helpful for reach the target, but someone can explain us how to use it?\n\u003C/p\u003E\n\u003Cp\u003E\nIf our intial orbit around Kerbin will be at 100 KM with a Balistic profile:\n\u003C/p\u003E\n\u003Cdl\u003E\u003Cdt\u003E\nDeparture\n\u003C/dt\u003E\n\u003Cdd\u003E\n\u003Cabbr title=\u0022UT: 20918304s\u0022\u003EYear 3, day 117 at 2:38:24\u003C/abbr\u003E\n\u003C/dd\u003E\n\u003Cdt\u003E\nArrival\n\u003C/dt\u003E\n\u003Cdd\u003E\n\u003Cabbr title=\u0022UT: 33736824s\u0022\u003EYear 4, day 284 at 5:20:24\u003C/abbr\u003E\n\u003C/dd\u003E\n\u003Cdt\u003E\nTime of flight\n\u003C/dt\u003E\n\u003Cdd\u003E\n\u003Cabbr title=\u002212818520s\u0022\u003E1 years 167 days 2:42:00\u003C/abbr\u003E\n\u003C/dd\u003E\n\u003Cdt\u003E\nPhase angle\n\u003C/dt\u003E\n\u003Cdd\u003E\n61.20°\n\u003C/dd\u003E\n\u003Cdt\u003E\nEjection angle\n\u003C/dt\u003E\n\u003Cdd\u003E\n120° to prograde\n\u003C/dd\u003E\n\u003Cdt\u003E\nEjection inclination\n\u003C/dt\u003E\n\u003Cdd\u003E\n1.01°\n\u003C/dd\u003E\n\u003Cdt\u003E\nEjection Δv\n\u003C/dt\u003E\n\u003Cdd\u003E\n\u003Cspan\u003E1,530 m/s\u003C/span\u003E\n\u003C/dd\u003E\n\u003Cdt\u003E\nTransfer periapsis\n\u003C/dt\u003E\n\u003Cdd\u003E\n13,337 Mm\n\u003C/dd\u003E\n\u003Cdt\u003E\nTransfer apoapsis\n\u003C/dt\u003E\n\u003Cdd\u003E\n39,726 Mm\n\u003C/dd\u003E\n\u003Cdt\u003E\nTransfer inclination\n\u003C/dt\u003E\n\u003Cdd\u003E\n0.15°\n\u003C/dd\u003E\n\u003Cdt\u003E\nTransfer angle\n\u003C/dt\u003E\n\u003Cdd\u003E\n182°\n\u003C/dd\u003E\n\u003Cdt\u003E\nInsertion inclination\n\u003C/dt\u003E\n\u003Cdd\u003E\n14.90°\n\u003C/dd\u003E\n\u003Cdt\u003E\nInsertion Δv\n\u003C/dt\u003E\n\u003Cdd\u003E\n1,544 m/s\n\u003C/dd\u003E\n\u003Cdt\u003E\nTotal Δv\n\u003C/dt\u003E\n\u003Cdd\u003E\n3,074 m/s\n\u003C/dd\u003E\n\u003Cdd\u003E\n \n\u003C/dd\u003E\n\u003Cdd\u003E\nSo phase angle is basically the angle where the target will be located in front or behind our departure planet (in this case it will be in front of us)\n\u003C/dd\u003E\n\u003Cdd\u003E\nEjection angle will be basically the angle where we will start our transfer maneuver, and this exact angle will allow us to leave Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and leave the planet to its own orbital prograde or retrograde heading.\n\u003C/dd\u003E\n\u003Cdd\u003E\nEjection inclination: what is? is the angle which must be added from our planned transfer maneuver if we would leave the equatorial orbit and start the interplanetary flight?\n\u003C/dd\u003E\n\u003Cdd\u003E\nEjection Delta V: simple, the speed required for this maneuver.\n\u003C/dd\u003E\n\u003Cdd\u003E\nTransfer Periapsis and Transfer Apoapsis: Are maybe the data about the Kerbol Orbit when we will fly around the sun?\n\u003C/dd\u003E\n\u003Cdd\u003E\nTransfer inclination: will be the inclination in comparison to Kerbol Star during the flight?\n\u003C/dd\u003E\n\u003Cdd\u003E\nTranfer angle: will be the total angle from our departure position to our destination position looked from Kerbol?\n\u003C/dd\u003E\n\u003Cdd\u003E\nInsertion Inclination: I think that will be the angle of difference with the equatorial line of our destination.\n\u003C/dd\u003E\n\u003Cdd\u003E\nInsertion Delta V: another speed which must be planned if I would get an orbit (possible something which could be great, but not sure if required for achive this mission, also a fly by will be appreciate)\n\u003C/dd\u003E\n\u003Cdd\u003E\nTotal Delta V: the speed required for the travel, really, I don\u0027t think that someone could have question about this \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/dd\u003E\n\u003Cdd\u003E\n \n\u003C/dd\u003E\n\u003Cdd\u003E\n\u003Cspan\u003E\u003Cspan\u003EIf someone will be able to explain me this, will be appreciate his-her help. In addition, if you would share with me your agency flag if you would see also your flag on my space probe, will be a pleasure do it.\u003C/span\u003E\u003C/span\u003E\n\u003C/dd\u003E\n\u003Cdd\u003E\n \n\u003C/dd\u003E\n\u003Cdd\u003E\n\u003Cspan\u003E\u003Cspan\u003EOf course, if someone will be able also to tell me how to calculate manually any interplanetary travel, will be a pleasure learn and try personally your precious sources. This game is really amazing if you would learn phisics.\u003C/span\u003E\u003C/span\u003E\n\u003C/dd\u003E\n\u003Cdd\u003E\n \n\u003C/dd\u003E\n\u003Cdd\u003E\n \n\u003C/dd\u003E\n\u003C/dl\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-10-13T21:25:32Z","Content":"\n\u003Cp\u003E\nLooks nice. The delta v amounts I use on a Dres mission usually is sorted into this amount:\n\u003C/p\u003E\n\u003Cp\u003E\n-3400 for Kerbin orbit\n\u003C/p\u003E\n\u003Cp\u003E\n-2500 for Dres insertion and Kerbin escape\n\u003C/p\u003E\n\u003Cp\u003E\n-500 for adjustments\n\u003C/p\u003E\n\u003Cp\u003E\nDepending on how good you are at insertion, capture will be around 1500 to 4500 m/s.  Then a similar style to how you would land on Mun (so pack 1400 for landing and circulization)\n\u003C/p\u003E\n\u003Cp\u003E\nI added some fuel to each number so that you can  have some area to spare. I\u0027m assuming since this is your first time that you would want these numbers.\n\u003C/p\u003E\n"},{"CreatedByName":"Alien21","CreatedById":211562,"CreatedDateTime":"2021-10-14T08:08:04Z","Content":"\n\u003Cp\u003E\nAlien21 Space Agency here. Mission \u0022Grey World\u0022 was launched with success with a balistic orbit with an Atlas V 551 stock replica. It was required however a second maneuver for adjust the balistic trajectory in order to allow our probe to join the Dres \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn case at this point, someone will still continue to have question like I had previously, I will explain all details.\n\u003C/p\u003E\n\u003Cp\u003E\nMy question was:\n\u003C/p\u003E\n\u003Cp\u003E\nEjection inclination: what is? is the angle which must be added from our planned transfer maneuver if we would leave the equatorial orbit and start the interplanetary flight?\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer: Yes, this could be positive or negative. In case the value is positive, this mean that you must deviate to the north pole of Kerbin while you will do the transfer maneuver. If it\u0027s negative, your direction must going to the south pole.\n\u003C/p\u003E\n\u003Cp\u003E\nTransfer Periapsis and Transfer Apoapsis: Are maybe the data about the Kerbol Orbit when we will fly around the sun?\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer: after the balistic maneuver, will be exactly that data if the transfer maneuver will be done exactly (this it could be harder, but not impossible)\n\u003C/p\u003E\n\u003Cp\u003E\nTransfer inclination: will be the inclination in comparison to Kerbol Star during the flight?\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer: yes, like the previous question\n\u003C/p\u003E\n\u003Cp\u003E\nInsertion Inclination: I think that will be the angle of difference with the equatorial line of our destination.\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer: yes, but to be honest, don\u0027t take this value so much as relevant. With the planets with a significant inclination around Kerbol star, is really harder get all these data exactly.\n\u003C/p\u003E\n\u003Cp\u003E\nI will show you at this point the photo of the probe when I will reach Dres! Luckly it could be possible also download from gitlab the Launch Transfer Window of alexmoon!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-14T08:12:29Z\u0022 title=\u002210/14/2021 08:12  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 14, 2021\u003C/time\u003E by Alien21\u003C/strong\u003E\n\u003Cbr\u003Efew changes\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-10-14T23:04:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224042755\u0022 data-ipsquote-contentid=\u0022205243\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221634159935\u0022 data-ipsquote-userid=\u0022211562\u0022 data-ipsquote-username=\u0022Alien21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/13/2021 at 11:18 PM, Alien21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EOf course, if someone will be able also to tell me how to calculate manually any interplanetary travel, will be a pleasure learn and try personally your precious sources. This game is really amazing if you would learn phisics.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCalculate? No. Eyeball? yes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nfor start, you go from Kerbin to Dres, Dres moves slower because it is farther from the sun, so you need Dres in front of Kerbin. By how much exactly? No idea, but I eyeball them by trying, from Kerbin, a prograde burn until I hit Dres orbit. For efficiency, make sure to start in the right place; move the manuever node slowly, you\u0027ll see that the apoapsis will change. Find the position where you get the highest apoapsis. Be aware that it will change if you change the deltaV, so keep adjusting. eventually you will find the cheapest prograde burn to intercept dres orbit. You also need to set up a plane change, though it\u0027s generally not the best way to reach dres. When you match planes, you will see a close approach marker. If you\u0027re passing in front of your target, you have to wait. if you\u0027ll pass behind, the transfer window has passed. this way you eyeball a transfer window\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222bo5WKd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/2bo5WKd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthis method applied to a sarnus-jool transfer. my spaceship would reach jool\u0027s orbit before the passage of jool. By roughly eyeballing the angle and jool\u0027s orbital speed, i estimated waiting one to two years.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nthis is also a good way to reach your target with an efficient burn; when you do it at the right time, you\u0027ll get an intercept, or at least a close approach that\u0027s close enough that you can get there with some small corrections.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cbHMQeK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/cbHMQeK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nindeed, two years later i easily got an approach.\n\u003C/p\u003E\n\u003Cp\u003E\nclose approach was very close, at this point it\u0027s just a matter of fiddling with all the directions and seeing what will cause you to pass closer to the planet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}