{"TopicId":205300,"ForumId":16,"TopicTitle":"manuever planner broke","CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-10-18T21:35:52Z","PageNum":1,"Articles":[{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-10-18T21:35:52Z","Content":"\n\u003Cp\u003E\nIf you fly by a planet, and the trajectory goes onward, and then you place a new manuever node, you will see your ascending and descending nodes in the new orbit. You\u0027ll see close approaches after the last manuever node. Indeed, up until two days ago that\u0027s what happened for me.\n\u003C/p\u003E\n\u003Cp\u003E\nNo more. Now placing future manuever will show the nodes before the manuever, and there\u0027s no way to see them after.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the initial situation. The asccending node is clearly shown as referring to the purple orbit, i.e. the one that will be taken after the eve flyby\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tihnKS8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/tihnKS8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nbut as i place a new manuever node there (you can see from the time tag, it is in the right place)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oFz9obm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/oFz9obm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nsuddenly i get a new ascending node. This one clearly referring to my current orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hJ1bMYZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/hJ1bMYZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd manipulating the manuever node (here you can see i\u0027m trying a 400 m/s normal burn just to show the lack of effect) won\u0027t have any effect on ascending node\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022u1YW6FW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/u1YW6FW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI am trying to set up the first gravity assist so that I can get a second gravity assist a few orbits later, but if I can\u0027t see inclination and close approach (another thing that disappeared) then I have no hope.\n\u003C/p\u003E\n\u003Cp\u003E\nI did not touch anything in the settings and I had no updates or new mods. I tried closing and restarting the game, didn\u0027t work.\n\u003C/p\u003E\n\u003Cp\u003E\nwhat the hell happened and how can I revert it?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: after I passed Eve, everything went back to normal. But I alredy planned multiple gravity assists before, just a few days ago, and everything worked fine. now that i see it, i never had the same planet i was using for the flyby set as the target. perhaps that\u0027s what caused the system to behave oddly\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-18T21:58:15Z\u0022 title=\u002210/18/2021 09:58  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 18, 2021\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2021-10-20T00:00:27Z","Content":"\n\u003Cp\u003E\nThese markers have, unfortunately, always had a habit of appearing and disappearing. I have no idea what, but for some reason it\u0027s a thing they\u0027ve never been able to fix.\n\u003C/p\u003E\n"}]}