{"TopicId":20560,"ForumId":16,"TopicTitle":"adjusting nodes of elliptical orbits","CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2012-09-27T09:03:16Z","PageNum":1,"Articles":[{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2012-09-27T09:03:16Z","Content":"\n\u003Cp\u003EHi guys, i\u0027ve just recently started getting some orbital debris around Kerbin, and thought i\u0027d go clean up.\u003C/p\u003E\u003Cp\u003EI ran out of fuel while trying to land, so the orbit of my target is about 104x268 km.\u003C/p\u003E\u003Cp\u003EI can match the orbital eccentricity without too much difficulty, but I am having trouble moving my ap and pe to match the vessel. Behold!\u003C/p\u003E\u003Cp\u003E[ATTACH=CONFIG]33715[/ATTACH]\u003C/p\u003E\u003Cp\u003Ethe [ap] is the same, but about 10 degrees west of what I need.\u003C/p\u003E\u003Cp\u003EI tried changing the orbit from where I needed the nodes to be, but it \u0027undid\u0027 all my good work when putting it back to the correct orbit.\u003C/p\u003E\u003Cp\u003Ehalp?\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2012-09-27T13:52:45Z","Content":"\n\u003Cp\u003EYou need to thrust radially (toward or away from the planet) to swing your AP around.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-09-27T16:07:02Z","Content":"\n\u003Cp\u003ERoboRay\u0027s suggestion is good, but you can avoid having to make many such adjustments (and save a lot of fuel) if you start from a circular orbit then bump up/down as appropriate when you pass your target\u0027s Pe or Ap.\u003C/p\u003E\u003Cp\u003EIn your case, I would start with either 104 km or 268 km circular orbit, depending on whether I want to speed up or slow down to rendezvous. I would then bump my orbit up or down as needed at the instant I passed my target\u0027s Pe or Ap.\u003C/p\u003E\n"},{"CreatedByName":"Luxmaster-CZ","CreatedById":21176,"CreatedDateTime":"2012-09-27T16:31:50Z","Content":"\n\u003Cp\u003EBurn towards a planet at your Pe if you are rotating anticlockwise, or opposite direction if clockwise\u003C/p\u003E\n"}]}