{"TopicId":205833,"ForumId":16,"TopicTitle":"overheating bug on KSP 1.12.2 RSS on loading a save game","CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2021-12-02T19:45:03Z","PageNum":1,"Articles":[{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2021-12-02T19:45:03Z","Content":"\n\u003Cp\u003E\nHello guys\n\u003C/p\u003E\n\u003Cp\u003E\nHave you ever experienced overheating on loading a saved game on KSP 1.12.2 ? Anywhere except when I am orbiting earth, loading a saved game triggers an overheating off all parts of my ship and it explodes.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if you save, go to the Space center, or go to The Space center and save, then jump to Tracking Station to fly your ship, without having to load the game, if it takes too long, overheating is triggered.\n\u003C/p\u003E\n\u003Cp\u003E\nI just jump very quickly to see what happen and was lucky to get the ship just a few seconds before it was too hot. It\u0027s a question of time, I don\u0027t know what is happening, but sure, if you have to load a game, you\u0027re going to overheat.....\n\u003C/p\u003E\n\u003Cp\u003E\nDeadly Re entry is not in my Game Data folder\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-02T19:45:53Z\u0022 title=\u002212/02/2021 07:45  PM\u0022 data-short=\u00222 yr\u0022\u003EDecember 2, 2021\u003C/time\u003E by gilflo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2021-12-02T19:53:53Z","Content":"\n\u003Cp\u003E\nNo, that does not happen to me. What other mods are installed? If this is easily reproducible then let a ship explode and then  get the logs and upload them somewhere like Dropbox where they can be accessed by others. Post the links here where they can be downloaded\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2021-12-02T21:20:57Z","Content":"\n\u003Cp\u003E\nI’ve personally only seen that with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E equipment.  In my case it was always when there was another vessel nearby (within physics range).\n\u003C/p\u003E\n\u003Cp\u003E\nA better description of the affected vessel, including its location, would be helpful, you haven’t given many details to work with.  Even better would be a screenshot.\n\u003C/p\u003E\n\u003Cp\u003E\nYes there are still a few glitches with the thermal simulation, particularly when time-warping.  In your case you might need to go into the F12 menu and disable thermal damage to get your ship to cool down.\n\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2021-12-05T22:44:49Z","Content":"\n\u003Cp\u003E\nHello\n\u003C/p\u003E\n\u003Cp\u003E\nhere is my log if somebody is able to tell why saved game or restored lead to explosion when craft is orbiting sun!!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/0qy9jj9f8x4bbjk/KSP%20log%20overheating%20after%20restore.rtf?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/0qy9jj9f8x4bbjk/KSP log overheating after restore.rtf?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}