{"TopicId":20649,"ForumId":32,"TopicTitle":"First development, mapping \u0026amp; rover to Duna. R.I.P. Joefred Kerman (very image heavy)","CreatedByName":"Baleur","CreatedById":9954,"CreatedDateTime":"2012-09-28T02:55:28Z","PageNum":1,"Articles":[{"CreatedByName":"Baleur","CreatedById":9954,"CreatedDateTime":"2012-09-28T02:55:28Z","Content":"\n\u003Cp\u003EInspired by the success of the recent interplanetary initiative by KSP, where a brave kerman being was lost while setting first foot on an alien planet...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xkOyL.jpg\u0022 alt=\u0022xkOyL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E.. the team at KSP decided it was time to reach Duna, as organized and properly as possible.\u003C/p\u003E\u003Cp\u003EFirst they needed some sort of staging area in Kerbal orbit, a refuelling and restocking station. The first segment of the KISS was launched.\u003C/p\u003E\u003Cp\u003EFully outfitted with solar panels for electricity, plenty of auxillary \u0027just in case\u0027 oxygen tanks and a large inflatable habitation module.\u003C/p\u003E\u003Cp\u003EThe blue light indicates the \u0022top\u0022 part of the station, where the crew hatch and the main ladder running up to it can be found.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cKjbQ.jpg\u0022 alt=\u0022cKjbQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoosting it into a circular orbit while entering the night side.\u003C/p\u003E\u003Cp\u003EThe red light indicates the \u0022bottom\u0022 part of the station, reserved for sensory equipment and the link back to KSP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tMNcA.jpg\u0022 alt=\u0022tMNcA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe final rendevous as the second station segment was launched, identical to the first. Docking was tricky business, the RCS thrusters were barely enough to maneuver the slow lumbering beast, but success at last!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tE8CE.jpg\u0022 alt=\u0022tE8CE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA brave kerman investigating the docking procedure, checking the seal, confirming the completion of the station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lZt8O.jpg\u0022 alt=\u0022lZt8O.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELadders extended on the first station on the right, one of the habitation modules on the left.\u003C/p\u003E\u003Cp\u003EAs the automatic guidance system radiates near the docking ports, the fellas over at KSP are pleased. Jim Kerman is as well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LMYVl.jpg\u0022 alt=\u0022LMYVl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first mapping satellite is launched, launch stages seperated!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XZAK5.jpg\u0022 alt=\u0022XZAK5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMapping Kerbin has begun, a step on our own world, to reach the others.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DvAjY.jpg\u0022 alt=\u0022DvAjY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother satellite launched at the Mun. Anomalies detected, cows mutilated, movies obsessing over black rectangles are aired.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/afZGi.jpg\u0022 alt=\u0022afZGi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next more advanced satellite headed for Duna, finally, is seperated.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gfSUU.jpg\u0022 alt=\u0022gfSUU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe nuclear engine boosting its way to Kerbal escape velocity, overheat at 40% and holding steady. Full thrust.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YV6gG.jpg\u0022 alt=\u0022YV6gG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpon arrival in Dunar orbit, the KSP engineers convince mission control to run a pass around Ike. \u0022We might as well map 2 balls in one go, eh?\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BeXwL.jpg\u0022 alt=\u0022BeXwL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEasier than expected, mapping the small moon was quick and effortless with an orbit of 60 degrees inclanation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/S7fUr.jpg\u0022 alt=\u0022S7fUr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal thrust towards Duna once more.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7KhoH.jpg\u0022 alt=\u00227KhoH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOrbit adjustments for a 70 degree inclanation, the red planet fills the cameras.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SYtoO.jpg\u0022 alt=\u0022SYtoO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeperation of the satellite itself, the interplanetary stage is now left to eternity in orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Sm9fg.jpg\u0022 alt=\u0022Sm9fg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeep. Beep. Beep. Beep.. -Spuknil\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WtzWg.jpg\u0022 alt=\u0022WtzWg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESurprise visit from KSP, due to an uncommon disregard for public awareness, neither the launch nor the launch vehicle was recorded! (sorry about that, i was so excited i forgot to take screens of it!).\u003C/p\u003E\u003Cp\u003EThe Dunar lander makes its appearance to the world known.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tbL8p.jpg\u0022 alt=\u0022tbL8p.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEquipped with a rover below the capsule, a sensory instrument dish above the capsule, solar panels, oxygen supply to last a week and three fuel pods designed to assist in landing along with three heavy duty parachutes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KEc09.jpg\u0022 alt=\u0022KEc09.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe fuel spent to get this somewhat heavy vehicle to Duna was too much, more than expected.. As such the three lander engines had to be used for deceleration and orbit adjustments to a nearby anomaly detected by the mapping satellite.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X0T6H.jpg\u0022 alt=\u0022X0T6H.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBraking maneuvers initiate, it\u0027s time for final descent!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pXpEJ.jpg\u0022 alt=\u0022pXpEJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen disaster strucks! The fuel readout was ignored in favor of \u0022ooh\u0022s and \u0022aah\u0022s over the ever closer surface.\u003C/p\u003E\u003Cp\u003EWith an apoapsis of 81.000km and a periapsis of 50.000km, there was simply not enough atmosphere to slow the vehicle down!\u003C/p\u003E\u003Cp\u003EJoefred knew he had come this far, and there was no way back. He literally went out and pushed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YLqEF.jpg\u0022 alt=\u0022YLqEF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEach successive pass at the apoapsis, a new series of pushes.\u003C/p\u003E\u003Cp\u003EClose disaster strikes at the final push, after bringing the periapsis down to 37.000km, Joefred is almost spun out of control into deep space, but quickly makes a recovery!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wig92.jpg\u0022 alt=\u0022Wig92.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAdmiring the view, he recedes back into his chair in the capsule, knowing that all that remains now is to wait for the aerobraking. 30.000km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HqlXP.jpg\u0022 alt=\u0022HqlXP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs he\u0027s getting ever closer, his heart beats stronger as the predictions put his landing trajectory into the night side of Duna. This was never planned. 24.000km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DcCKZ.jpg\u0022 alt=\u0022DcCKZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFuel tanks empty, RCS tanks empty, he had nothing to rely on besides the parachutes. 21.000km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PBJ4t.jpg\u0022 alt=\u0022PBJ4t.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E10.000km, his nerves can take no more, the darkness of the rusty dust below him plays tricks on his depth perception. He deploys the parachutes early.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c5F9j.jpg\u0022 alt=\u0022c5F9j.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter an excruciating minute of free fall, it seemed as the parachutes would fail.. And then they deployed. Thank the gods of Kerbol!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4CoD5.jpg\u0022 alt=\u00224CoD5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETurning on the landing lights, the empty terrain below looms closer.. The air is filled with a rusty hue.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PSv6c.jpg\u0022 alt=\u0022PSv6c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo Dunians in sight, no canals in sight. This was a dead planet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u5vPj.jpg\u0022 alt=\u0022u5vPj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETouchdown, relief at last! Turning off the landing lights, and switching to the rover lights, exploration can commence.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IBawj.jpg\u0022 alt=\u0022IBawj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJettisoning the trio of well served parachutes and descent engines, Joefred drives off some distance to test the rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HWOQO.jpg\u0022 alt=\u0022HWOQO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EObligatory rcs-jumping exercises.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ebpOQ.jpg\u0022 alt=\u0022ebpOQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a few minutes sprint back to the descent engines, he decides to check who to thank for weaving those life saving parachutes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/edLMt.jpg\u0022 alt=\u0022edLMt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022DANGER\u0022, seemed to be the individual responsible for saving Joefred\u0027s life. \u0022Danger Kerman, i owe you my life.\u0022 he thought quietly to himself.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cwUay.jpg\u0022 alt=\u0022cwUay.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA quick rcs-jump back to the rover, his exploration senses run wild.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yaCdz.jpg\u0022 alt=\u0022yaCdz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt turns out that 40km/h in free rcs-jumping-flight can knock a kerbal landing on his feet out cold for several minutes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LCW4n.jpg\u0022 alt=\u0022LCW4n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEventually, he recovers and makes it back to the rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/taklv.jpg\u0022 alt=\u0022taklv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeing too excited, too reckless, he starts picking up too much speed. 60km/h on a downhill slope, the rover starts to tilt..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yzN6T.jpg\u0022 alt=\u0022yzN6T.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDisaster strikes!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RcYYY.jpg\u0022 alt=\u0022RcYYY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJoefred Kerman, we hardly knew you. May your head forever rest in the sand. So say we all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UKv3D.jpg\u0022 alt=\u0022UKv3D.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"um3k","CreatedById":37350,"CreatedDateTime":"2012-09-28T02:59:17Z","Content":"\n\u003Cp\u003EI has a sad for Joefred. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2012-09-28T14:00:49Z","Content":"\n\u003Cp\u003EWhat mods are you using? I like them!\u003C/p\u003E\n"},{"CreatedByName":"0jam3290","CreatedById":37975,"CreatedDateTime":"2012-09-28T18:38:32Z","Content":"\n\u003Cp\u003ERIP Joefred. Also, it looks like Probodobodyne, Bace, Tosh\u0027s Carts, and a few others I may or may not know.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-28T20:46:53Z\u0022 title=\u002209/28/2012 08:46  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 28, 2012\u003C/time\u003E by 0jam3290\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Baleur","CreatedById":9954,"CreatedDateTime":"2012-09-28T19:54:39Z","Content":"\n\u003Cp\u003EIndeed, Probodyne, Bace, Carts, Down Under Aerospace, Erkle Warp Clamps, Navigation Lights, Truss Pack, RocktCo and Munar Institute.\u003C/p\u003E\n"}]}