{"TopicId":206564,"ForumId":44,"TopicTitle":"hydrogen ISP in scramjet? 2000 ton oribal sto?! Now methalox or kerolox. FLYING AEROSPIKE!!?","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-23T15:54:33Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-23T15:54:33Z","Content":"\n\u003Cp\u003E\nIs it true that a scramjet can get 1200-2700 isp from a scramjet?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m making a fantasy bomber/cargo plane and trying to figure out how it could fly. It\u0027s a bit over the top, but if that \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E can be obtained I think it could go to orbit. Even with it\u0027s massive 2000 tons to orbit max take off weight goal! 8)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.researchgate.net/figure/SP-of-MI-Martian-Ramjet-Scramjet-engine_fig13_346778009\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.researchgate.net/figure/SP-of-MI-Martian-Ramjet-Scramjet-engine_fig13_346778009\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMost things say hydrogen in rockets are only 430-460 at most. Is it different for scramjets?\n\u003C/p\u003E\n\u003Cp\u003E\nOn a side note. Can liquid hydrogen be converted into a salt or similar form and reconverted for fuel to increase density? I\u0027ve seen stuff on hypothetical metalic hydrogen that will get near 1200 isp. Are there any other solid forms besides metalic that could be used?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s built partially around the idea of collecting water and converting it. Even though I\u0027ve seen it\u0027s cheap enough for all fuel, I\u0027m making the ship into a giant flying chemistry set just for the potential of fuels or converting resources. Especially if it can help build/maintain the vehicle to lower overall long term cost and building or other function. No idea how to do that, but it\u0027s fun trying to figure out. Possibly useful at minimum for space debri patching or something without having to get out of the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nOne idea is for it to turn into cryogenic freezing near the engines for better cooling. Then solid in the ship interior. Potentially with permanent magnets in the hull structure and similar for passive power on top of any potential engine power.\n\u003C/p\u003E\n\u003Cp\u003E\nThat and the idea of covering the hull in cold plasma/air to get more lift and reduce drag in a programmed manner to enhance the aircraft.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-27T06:38:38Z\u0022 title=\u002201/27/2022 06:38  AM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 27, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2022-01-23T16:14:08Z","Content":"\n\u003Cp\u003E\nScramjets, and really any atmospheric jet, gets much higher isp than rocket engines would. Turbofans can get well into the thousands of seconds. The reason is that they\u0027re not carrying internal oxidizer and remass, most of the reaction mass of a jet engine is the air.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2022-01-23T17:30:11Z","Content":"\n\u003Cp\u003E\nWikipedia has \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E of RR Trent 1000C at 13 200 s. But that is meaningless for spaceflight since turbofans, just like any other airbreathing engine can\u0027t operate in vacuum (the term \u0022airbreathing\u0022 in the name should be a clue).\n\u003C/p\u003E\n\u003Cp\u003E\nConverting substances back and forth can be done but is always going to cost energy and require additional equipment, and you know what they say about mass when it comes to space travel.\n\u003C/p\u003E\n\u003Cp\u003E\nPermanent magnets for passive power? What does that mean? There is no energy in a magnet that can be harvested.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-23T17:44:29Z","Content":"\n\u003Cp\u003E\nIf it uses large amounts of liquid oxygen and helium I was hoping it could go from possibly the ocean or land to air then space. Or just ground to space.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it could get a lot of unfinished tonnage and some robots to space you could build lots of stuff in orbit. Or maybe get it to the moon. It\u0027s based on 5ft diameter tubes for holding moab bombs and stuff the b2 and b-52 can drop. I wonder how hard it would be to get a full cargo of up to 1500\u002Btons to orbit. I think the max cargo is just under 1700 tons for what I somewhat randomly allotted. I gave it a somewhat low 288,000 lbs or 144 tons of fuel total. With 1200-2700 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E It look like it should make it to orbit. I was hoping to use extra air from the body to pull in air to increase the flow so it could hit super/hypersonic at lower levels. Or just plow through with a lower end turbofan engine or something.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-23T17:48:09Z\u0022 title=\u002201/23/2022 05:48  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 23, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2022-01-23T17:48:25Z","Content":"\n\u003Cp\u003E\nRemember, the fundamental issue of the rocket equation is that to accelerate, you need fuel.  And then when you do accelerate, you are \u0022paying\u0022 to move all your fuel as well.  Ramjets and Scramjets don\u0027t need to carry, and thus accelerate, the oxygen.  Hydrogen is absurdly light (although the density is an issue), so extreme Isp is possible.  Also expect Isp to reduce as you increase speed.  2700s Isp is probably only going to happen during the initial acceleration and the overall Isp will decrease (to less than rocket Isp by orbital speed).  Unfortunately I couldn\u0027t find the \u0022free online\u0022 paper for the X-43, but that includes all the best data about the fastest hydrogen Scramjet to fly (no idea if the Australian project was hydrogen, the Air Force\u0027s follow up uses kerosene).\n\u003C/p\u003E\n\u003Cp\u003E\nAren\u0027t salts what you get when you strip excess hydrogen from acids (I was a lousy chemistry student, so maybe not).  In any event, you would be carrying far too much mass of \u0022not hydrogen\u0022, no matter how much hydrogen you could shove in a molecule.  The whole point of the fuel is low mass (it isn\u0027t all that energetic).  Similar for cracking water.  This only works if you cracked it *before* accelerating, and then either discard the oxygen or use it for some other purpose (possibly saving some for final orbital insertion.  But most of the oxygen wouldn\u0027t be needed).  Also realize just how inefficient cracking water is, and you\u0027d probably need a nuclear reactor (you probably don\u0027t want to send it and its shielding to orbit).\n\u003C/p\u003E\n\u003Cp\u003E\nMetalic hydrogen, more specifically meta-stable metalic hydrogen, doesn\u0027t appear to be a thing.  The idea was that you could apply sufficient pressure to turn it metal (this may have happened), and when you lower that pressure it would remain metalic.  This doesn\u0027t happen.  Metalic hydrogen was assumed to not only be an ideal way to store hydrogen, but \u0022monatomic hydrogen\u0022 which would be an ideal\u003Cfont color=\u0022#222222\u0022\u003E\u003Cspan style=\u0022font-size:14.4px;\u0022\u003E monopropellant (think nuclear levels of density and energy).\u003C/span\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as I know, the shuttle had the hydrogen about as dense as it gets, and the fuel tank was mostly hydrogen by volume and mostly oxygen by mass.\n\u003C/p\u003E\n\u003Cp\u003E\nOne last thing about hydrogen.  Being the lightest stuff around it is also the best form of rocket exhaust (assuming you are generating momentum by heating).  It is by far preferred for nuclear thermal rockets, solar or microwave heated rockets, and hydrolox rockets not only run fuel rich to save the engine from melting (many rockets do that) but also the theoretical ideal mixture of hydrolox is fairly fuel rich to gain the benefit of heating up all that hydrogen (even if doing so lowers the temperature of the exhaust).\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-23T18:16:47Z","Content":"\n\u003Cp\u003E\nIf I\u0027m doing my math right. I did 288,000 lbs of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www1.eere.energy.gov/hydrogenandfuelcells/tech_validation/pdfs/fcm01r0.pdf\u0022 rel=\u0022external nofollow\u0022\u003EThis says\u003C/a\u003E: 4.432 lb/ft3\n\u003C/p\u003E\n\u003Cp\u003E\nIf I\u0027m not mistaken that is 42x42x42?\n\u003C/p\u003E\n\u003Cp\u003E\n2*42x42x21\n\u003C/p\u003E\n\u003Cp\u003E\nThat might fit in the dimensions of the plane. Mostly the stub past the cargo and into the wings.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s starting as a diamond shape 166.5 ft wide * 96 ft long* 30\u002Bft tall. It\u0027s basically a diamond B2 with a much fatter body and must fatter wings from top to bottom. I think that perfectly fits in the wing structure outside of the bombbay/cargo. If the plane does an aerospike in the body it only needs 2*sr2200\u0027s or 4*xsr2200\u0027s. the fuel cold be in front and the air could come from the front I assume. the pictures with engines are for top and bottom SR71 engines. 24 in total. Would the X/SR2200\u0027s be lighter overall? I couldn\u0027t find total weight. I gave 72 tons for engine that might not be needed.\n\u003C/p\u003E\n\u003Cp\u003E\ncargo is 5ft diameter tubes that are 72 ft long. I\u0027ll get a picture.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Ca href=\u0022https://imgur.com/5245Pgg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/5245Pgg\u003C/a\u003E\u003C/span\u003E\u003Cimg alt=\u00225245Pgg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5245Pgg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf I added three more tubes on the ends I think it would cover half of the 288,000lbs of fuel approximately. 12-15 tubes of Liquid hydrogen total after you consider the ends get smaller as you go past the center core of cargo tubes.\n\u003C/p\u003E\n\u003Cp\u003E\nI came up with this idea for a flap/aerospike combo:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LOFwTFa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LOFwTFa.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s internal structure could allow the flaps to extend /retract. It might also help with elongating the thrust if it helps. Might need the crygenic cooling inside it though to help cool it. I assumed cold plasma between the plasma and aerospike surface \u002Bcryogenics flowing through the metal to help cool.\n\u003C/p\u003E\n\u003Cp\u003E\nAny gas left over could be used to help cold plasma/air surface the plane to control the relative drag and other issues to land better. Plus to gain efficiency going up. Said holes on surface then could also be used as maneuvering thrusters.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: If structural issues aren\u0027t a problem and it can actually fly is this a problem? Hydrogen embrittlement? I\u0027m assuming an sto reusable concept might not like this.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/DiH5Hg21W8E?start=1115\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nMaybe a mix of fuels in that outside set of tanks that aren\u0027t on the cargo view. If it combines either kerolox or metholox and then has some extra lh2 for something maybe it can get away with less density. some of the cryogenics could be shared with the engines for enhance performances and then us different fuels or mixed fuels at different altitudes. Could you get away with an even mix of hydrolox, methalox, liquid oxygen?\n\u003C/p\u003E\n\u003Cp\u003E\nNot sure about engine position and structure for the wings. But if you get it all in those last 6 tanks(3 each side) it would put all fuel in the body near some potential rear engines. Then just extra structure to the thick wings if possible... Then landing gear...\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, if I only used 6 tubes what would be the best fuel? Methalox?\n\u003C/p\u003E\n\u003Cp\u003E\nThat is 8246.68- 8482.3 ft3(1375-1413ft3 per tube) of room and 288,000 lbs minimum. If you can fit it in that space that is 10,042.6932 delta v at 950 isp.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if any combo works you could have two go up in whatever configuration. One fuel the other and push it part way to lunar orbit then separate and return to earth while the other finishes the burn. And if needed it could always convert some tubes into more fuel tubes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-23T21:19:11Z\u0022 title=\u002201/23/2022 09:19  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 23, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-01-23T21:20:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081112\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642953273\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCan liquid hydrogen be converted into a salt or similar form and reconverted for fuel to increase density?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Ayaks#Thermochemical_reactors\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.m.wikipedia.org/wiki/Ayaks#Thermochemical_reactors\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-01-23T21:46:20Z","Content":"\n\u003Cp\u003E\n\u003Cs\u003EMMH\u003C/s\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-01-23T22:42:19Z","Content":"\n\u003Cp\u003E\nAs I understand one reason why hydrogen is popular for scramjets is that it burn fast and you don\u0027t have much time to burn the fuel inside an scramjet an added bonus is the cooling you get. \u003Cbr\u003E\nHowever I say hydrogen has downsides for an warplane as its hard to handle and an orbital rocket can be much more optimized as it can have an long set up time. \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-01-24T05:46:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081294\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642977739\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs I understand one reason why hydrogen is popular for scramjets is that it burn fast\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts high \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E due to the lowest possible molecular mass and its enormously huge heat capacity.\u003Cbr\u003E\nIt can\u0027t be competed by any other coolant, and that\u0027s the case when the coolant is at same time  the fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nThe historical HSHL \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E projects of 1960s-70s include a plane with turbojets, a scramjet, and air scoops.\n\u003C/p\u003E\n\u003Cp\u003E\nOn start the spaceplane has its oxytanks empty, so weights much less. While the hydrotank is full.\u003Cbr\u003E\nIt starts by turbojets using the hydrogen and atmospheric air.\u003Cbr\u003E\nReaching several machs, it switches off the turbojets and engages the scramjet working on the hydrogen and atmospheric air, too.\n\u003C/p\u003E\n\u003Cp\u003E\nIt begins accelerating and slowly raising, taking air from scoops, liquifying it, and storing the oxygen in the oxytanks.\u003Cbr\u003E\nThe lifting forse supports it, so it gets much heavier than on start.\n\u003C/p\u003E\n\u003Cp\u003E\nIt reaches the thin air altitude simultaneously with full oxytanks.\u003Cbr\u003E\nAt the same time it starts feeding the engine with the extracted oxygen .\n\u003C/p\u003E\n\u003Cp\u003E\nIt closes the air intakes, and its hybrid scramjet is fed by the same hydrogen and the oxygen from tanks.\n\u003C/p\u003E\n\u003Cp\u003E\nIt reaches the orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nThe hydrogen is used to cool both engine and hull.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-24T09:29:27Z","Content":"\n\u003Cp\u003E\nThis is the max length you could get if you stopped the tanks at one side. I assume you want air intakes and or aerospikes at the end. Just about get the exact amount needed for hydrolox.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XFmtDcj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XFmtDcj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe 1x and 2x are how many are stacked on stop of each other. They make two triangles one in the butt of the other triangle like how the bomb bays are squished together.\n\u003C/p\u003E\n\u003Cp\u003E\nNVM, that is the tonnage at 4.432 lb/ft3... I keep getting the math mixed up. You would need about 4.3 times this area.\n\u003C/p\u003E\n\u003Cp\u003E\nThe entire bomb bay and side additions are just enough to hold a little over 288000 lbs of hydrolox. My math was bad before. So, it would need to hold something much more dense.\n\u003C/p\u003E\n\u003Cp\u003E\nthose 6 side tanks hold a total of 7,557.76 for double that for both sides. 15,115.526 ft3 total for fuel in that configuration. That means I need a fuel that can hold 19 lb/f3.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it was all in the body I would need 46 tanks for hydrolox. That means 46\u002B36= 82 tubes at 72 ft.\n\u003C/p\u003E\n\u003Cp\u003E\nI could do a pattern of 3\u002B4\u002B5\u002B6\u002B7\u002B8\u002B9\u002B9\u002B8\u002B7\u002B6\u002B5\u002B4\u002B3. for 84 tanks and a bigger body.\n\u003C/p\u003E\n\u003Cp\u003E\nOr change fuel types.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, if my math is right(normally not) I could do 2x3x2x1 from the center mass to get 16 total tanks on each side.\n\u003C/p\u003E\n\u003Cp\u003E\nWould butane or kerosene work better? It\u0027s more dense in this case. I think..\n\u003C/p\u003E\n\u003Cp\u003E\nLiquid kerosene would only require 4 extra tanks. It\u0027s probably better unless it\u0027s \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E is bad. Then it needs more fuel. That is 1 tank per XRS2200 or 2 tanks per RS2200. That might be the better fuel. As long as it\u0027s \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E isn\u0027t too low or other issues. It\u0027s the correct density.\n\u003C/p\u003E\n\u003Cp\u003E\nCould you hold the lox in a smaller tank and keep it at crygenics temps in a closed cycle before releasing it for cooling and then keep kerolox at it\u0027s temp in bigger tanks. Then release the lox in orbit? Maybe save extra for cooling for a return trip? If you can replace lox as you use the kerolox maybe it would work out easy on the flight up? still not sure how much lox you would need.\n\u003C/p\u003E\n\u003Cp\u003E\npardon the messiness:\n\u003C/p\u003E\n\u003Cp\u003E\n4xkerolox tubes\u002B2xlox tubes.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could even fill them both up within the 2000 ton limit. If the structure has a limit of 144,000lbs engines have 144,000 lbs. Kerolox a limit of 288,000 lbs. That leaves a 28,800lbs and 155200lbs left over from a max payload of mop bombs. So, you have a very large density of around 66lb/f3 for cargo.\n\u003C/p\u003E\n\u003Cp\u003E\nThis leaves 92 tons left over. This could fill another 2 fuel tank with lox almost perfectly. This leaves around 277,000 lbs of kerolox and 92 lox without even having to add to it during flight. Although you could to save fuel. And might to add a bit more effective kerolox efficiency. Hopefully I got the math right this time.\n\u003C/p\u003E\n\u003Cp\u003E\nThis means the bomb bay tubes are in a 1\u002B2\u002B3\u002B4\u002B5\u002B6\u002B6\u002B5\u002B4\u002B3\u002B2\u002B1 setup. The 1\u002B2\u002B2\u002B1 on the side are fuel tanks and the scramjets are behind them and air intakes in front if there is room for both. I\u0027m assuming sadly near the wing edge. If this plane technically has a wing edge. I\u0027m hoping the diamondish shape lends to making that a non issue. You could also change the size of the tanks and make them shorter and wider in order to compensate for the engine positions. Or move the engines to fit mid between them.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming kerolox is 50lb/f3: 10ft diameter tanks, 36.67ft longx2. 1 per wing.\n\u003C/p\u003E\n\u003Cp\u003E\n5x5xPix36.67x2x50=288,000lbs of kerolox.\n\u003C/p\u003E\n\u003Cp\u003E\nThat gives lot of room in front and back for engines and air intakes.\n\u003C/p\u003E\n\u003Cp\u003E\nLesson: 5ft diameter tubes are very inefficient for storage. Especially fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mKGM33O.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mKGM33O.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlthough a similar 10 ft diameter tube at 66 ft could hold 288,000 lbs of methalox. So, I guess it\u0027s a matter of choice..?!\n\u003C/p\u003E\n\u003Cp\u003E\ndo expandable 10ft diameter tubes exist for fuel? This could expand/contract for different fuels including filling it with oxygen later.\n\u003C/p\u003E\n\u003Cp\u003E\nStill not sure if this would have to take off from water or need lots of landing gear. I would assume each has problems. One extra mass to float from boyancy needed 2 for wheel mass.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it uses the anton 225\u0027s wheels it might need up to 50-54 pairs of wheels. 100-108 total.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrent max cargo is 1620 tons. This can be dropped to 1555.2 tons or 1440 tons for extra wight for landing gear and structural reinforcement. Max tonnage without cargo at 1440 tons cargo is then 560 tons plane weight. I\u0027m assuming that would help with making it strong enough for good maintenance/reusability. It\u0027s also a potential wing loading of 144lb/f2. Not sure how the cubic wing loading would work out. Or what shape it should have.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it can generate lox in flight is that useful for putting over the fuselage to control vortices and drag to increase aerodynamics and landing weight. It could land with lox seeping out it\u0027s pores. And possibly burn all fuels then use pure lox to deorbit if it has enough. Not sure if it would have a small amount of normal fuel for landings or subsonic flight or whatnot. And could lox be used to lower the speed and pressure along with intaken air of super and hypersonic flight speeds?\n\u003C/p\u003E\n\u003Cp\u003E\nWith 560 tons outside of cargo that is 144 tons fuel(methalox or kerolox), 144 tons structure, 108 tons landing gear(100*2160 lbs average each), 92 tons lox(if and when desired).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NS25gUp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NS25gUp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother cargo config is 6x6x6x6x6x6 circles for 30x30x72ft. This makes a sqaure 1600sqft area or 64800 ft3. This simplifies the wheels to 12 per row. Or 12 per 5 ft. I think this gets 44,444to40,000 lbs per wheel pod. then divided by wheels.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eTBjOaP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eTBjOaP.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-24T17:24:55Z\u0022 title=\u002201/24/2022 05:24  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 24, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-01-24T16:41:24Z","Content":"\n\u003Cp\u003E\nZAZ-968 \u0022Zaporozhets\u0022, 1970s\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022542f9cu-960.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022540\u0022 width=\u0022960\u0022 src=\u0022https://a.d-cd.net/542f9cu-960.jpg\u0022\u003E\u003Cimg alt=\u0022autowpru-zaz-968ae-zaporozhets-5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022768\u0022 width=\u00221024\u0022 src=\u0022https://kolesa-uploads.ru/-/49617a42-789e-45d6-b13d-9b35ef3710ae/autowpru-zaz-968ae-zaporozhets-5.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nPower ~45 HP (non-British, 736 W/HP) ~= 33 kW.\n\u003C/p\u003E\n\u003Cp\u003E\nFuel:  gasoline, consumption ~6 l / 100 km at 80 km/h speed, density ~= 0.75 kg/l,\u003Cbr\u003E\nso ~0.045 kg / km at speed 22.2 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, effective thrust = 33 000 / 22.2 ~= 1.5 kN\n\u003C/p\u003E\n\u003Cp\u003E\nMass: 840 .. 1 160 kg, let it be average = 1 000 kg.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, effective acceleration (in absense of road and air drag): 1 500 / 1 000 ~= 1.5 m/s\u003Csup\u003E2\u003C/sup\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nTank capacity: 40 l.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, trip distance = 40 * 100 / 6  ~= 667 km.\u003Cbr\u003E\nTrip duration = 667 / 80 * 3 600 ~= 30 000 s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETotal delta-V\u003C/strong\u003E = 30 000 * 1.5  ~= \u003Cstrong\u003E45 km/s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n45 000 = Exhaust speed *ln (1000 / (1000 - 80))\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExhaust speed\u003C/strong\u003E = 45 000  / ln (1000 / (1000 - 80)) ~= 45 000  / ln (1000 / (1000 - 80)) ~= 45 000 / 0.0834 ~= \u003Cstrong\u003E540 km/s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/strong\u003E = 540 000 / 9.81 ~= \u003Cstrong\u003E55 000 s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nOnce again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETotal delta-V\u003C/strong\u003E ~= \u003Cstrong\u003E45 km/s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExhaust speed\u003C/strong\u003E ~= \u003Cstrong\u003E540 km/s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/strong\u003E ~= \u003Cstrong\u003E55 000 s\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn Soviet Russia the cheapest cars were having \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E of a thermonuclear torch ship and were able to pass 1 AU in 40 days.\u003Cbr\u003E\n(Ok, in 80 days, as they needed fuel to brake.)\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-01-24T17:42:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081388\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643003182\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIts high \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E due to the lowest possible molecular mass and its enormously huge heat capacity.\u003Cbr\u003E\nIt can\u0027t be competed by any other coolant, and that\u0027s the case when the coolant is at same time  the fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nThe historical HSHL \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E projects of 1960s-70s include a plane with turbojets, a scramjet, and air scoops.\n\u003C/p\u003E\n\u003Cp\u003E\nOn start the spaceplane has its oxytanks empty, so weights much less. While the hydrotank is full.\u003Cbr\u003E\nIt starts by turbojets using the hydrogen and atmospheric air.\u003Cbr\u003E\nReaching several machs, it switches off the turbojets and engages the scramjet working on the hydrogen and atmospheric air, too.\n\u003C/p\u003E\n\u003Cp\u003E\nIt begins accelerating and slowly raising, taking air from scoops, liquifying it, and storing the oxygen in the oxytanks.\u003Cbr\u003E\nThe lifting forse supports it, so it gets much heavier than on start.\n\u003C/p\u003E\n\u003Cp\u003E\nIt reaches the thin air altitude simultaneously with full oxytanks.\u003Cbr\u003E\nAt the same time it starts feeding the engine with the extracted oxygen .\n\u003C/p\u003E\n\u003Cp\u003E\nIt closes the air intakes, and its hybrid scramjet is fed by the same hydrogen and the oxygen from tanks.\n\u003C/p\u003E\n\u003Cp\u003E\nIt reaches the orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nThe hydrogen is used to cool both engine and hull.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe questionable part here is to scavenge the oxygen in flight, that will require energy, granted you can use the cold hydrogen but wonder if its not better to run the turbojet on jet fuel and save on fuel tanks the liquefying equipment. \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-01-24T19:00:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081585\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643046169\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe questionable part here is to scavenge the oxygen in flight, that will require energy, granted you can use the cold hydrogen but wonder if its not better to run the turbojet on jet fuel and save on fuel tanks the liquefying equipment. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWho knows, but the projects were done by respectable companies, not on the back of the envelope.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, probably of same possibility as Starship.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-24T21:21:40Z","Content":"\n\u003Cp\u003E\nI did give it enough weight for a full 92 tons of lox from takeoff. Maybe it could store enough fuel in a turbofan as part of the normal weight for the engines/aerospikes. If it can generate any lox it can help keep it topped off though. And maybe use it for the plane surface to improve aerodynamics. If it has enough energy maybe some cold plasma here and there if it helps. I would assume to cool the engines/help with surface drag or other things.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think it can use hydrolox though. It would have to be enlarged quite a bit. I did the math wrong at first.\n\u003C/p\u003E\n\u003Cp\u003E\nIs this possible: \u003Ca href=\u0022https://www.scientia.global/wp-content/uploads/Huu_Duc_Vo_Njuki_Mureithi/Huu_Duc_Vo_Njuki_Mureithi.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.scientia.global/wp-content/uploads/Huu_Duc_Vo_Njuki_Mureithi/Huu_Duc_Vo_Njuki_Mureithi.pdf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI was hoping it and things like controlled air over the surface could help control things similarly. and if possibly intaking air like a bee to increase air flow to the engine to get a lower flight speed for super/hyper sonic. this might be a reason to use permanent magnets in a layer of the plane. I also though I saw a way to get electricity from them that didn\u0027t use moving parts. Not sure how much though. Would passing gasses help?\n\u003C/p\u003E\n\u003Cp\u003E\nsomething odd like this applied to an air surface: \u003Ca href=\u0022https://www.windpowerengineering.com/dutch-wind-wheel-generates-electricity-without-moving-parts/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.windpowerengineering.com/dutch-wind-wheel-generates-electricity-without-moving-parts/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/AZeWPlVoLko?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nmaybe these could be useful to pull air in via small holes in the wing or from other ducts? Before the air gets faster that is. Would it create too much drag to pull in air in smaller holes? can it help speed up the air in the main engine?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-24T21:51:08Z\u0022 title=\u002201/24/2022 09:51  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 24, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2022-01-25T05:51:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081706\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643059300\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthis might be a reason to use permanent magnets in a layer of the plane\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis makes no sense. \n\u003C/p\u003E\n\u003Cp\u003E\nMagnets in the RR video are a part of a brushless electric motor, and there certainly are moving parts.\n\u003C/p\u003E\n\u003Cp\u003E\nMagnets are magic, but they still abide by laws of thermodynamics.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-01-25T06:52:52Z","Content":"\n\u003Cp\u003E\nThey said. the copper is expensive in motors...\n\u003C/p\u003E\n\u003Cp\u003E\n... until somebody suggested a motor based on neodymium magnets.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-25T07:23:03Z","Content":"\n\u003Cp\u003E\nWhat if the gas tanks have giant archimedis screws(or regular?) in them and they could be allowed to rotate when desired. They could be surrounded by permanent magnets to slowly rotate. Particularly as everything says you can\u0027t do high torque with them. Could this generate electricity? Would it help get rid of gas bubbles? They could be counter rotating on each side of the plane. When allowed to move they could generate electricity as the fuel is being used. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat about a toroidal doughnut shape with two tanks? The inside and outside have a thin tank for lox for lubricant/friction control. The middle tank layer has the methalox. Then the farthest inside of the tube is the air tunnel for shock cone/scramjet? The inside of the methalox has a screw and the outside has permanent magnets and maybe so does the screw thread. When activated it rotates to generate electricity. The tank could be up to 20 ft wide.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso I saw a permanent magnet turbofan somewhere also. Not sure if it worked or not. It was a defunct patent.\n\u003C/p\u003E\n\u003Cp\u003E\nCould you put a permanent magnet based turbofan in the front of the plane behind the air inlets/shockcone to balance the aircraft weight out. Assuming where it needs to go physically?\n\u003C/p\u003E\n\u003Cp\u003E\nThat or put it inside part of the toroidal shaft where it balances properly on the craft. Not sure what you do about the cold/hot regions next to the lox/methalox tanks. Could this be used to help create flow? And is trying to cool superflow air helpful for ram/scramjets or harmful? Would cold plasma being pumped into the aircraft air stream help at all? If not also in the body automatically when the tanks rotate?\n\u003C/p\u003E\n\u003Cp\u003E\nThe giant tanks could be part of the air/turbojet/air intake system. would that be hard to cool properly or could it be useful or at least used for something?\n\u003C/p\u003E\n\u003Cp\u003E\nI just read heating the air reduces power. So, if you super chill it and put the permanent magnet tuborfan at the back or just lived with the heating of the tank that could increase the gas expansion along the path creating more airflow and then activate it at an early speed? Then the toroidal shape could be part of the air intake system.\n\u003C/p\u003E\n\u003Cp\u003E\ncould you simplify the cryogenics by then only needing to cool the lox and then leave the temperature difference naturally for the methalox via the shape of the tank?\n\u003C/p\u003E\n\u003Cp\u003E\nAt that point I still wonder if the tanks/engines could be balance to leave a diamond shape airframe or if the wings would be needed to be brought back a bit to leave the com ahead of the \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003Ecol\u003C/abbr\u003E\u003C/abbr\u003E. I imagine you could design the tanks to be forward a bit to balance on empty. They would probably be heavy in themselves.\n\u003C/p\u003E\n\u003Cp\u003E\ncool sound too:\u003Ca href=\u0022https://www.youtube.com/watch?v=rHvpcqj4XB8\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=rHvpcqj4XB8\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if you could use the cyrotanks to cool it enough for the mangets to work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://cen.acs.org/energy/fossil-fuels/Cool-fuel-hypersonic-aircraft/96/i18\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://cen.acs.org/energy/fossil-fuels/Cool-fuel-hypersonic-aircraft/96/i18\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, could the concept of a sterling engine be used to produce electricity from the hot side? Some Lox could be pumped in if it\u0027s safe enough. If cold plasma is to be used it might need a lot of electricity. I haven\u0027t found how much can be generated in general yet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-25T08:32:00Z\u0022 title=\u002201/25/2022 08:32  AM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 25, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2022-01-25T08:33:48Z","Content":"\n\u003Cp\u003E\nCan you please pick one concept and refine it instead of just throwing a random though out there and moving on to something completely different in a same sentence?\n\u003C/p\u003E\n\u003Cp\u003E\nPlease forget about magnets. They are not a source of energy, no matter how cold you make them, nor will they make an Archimedes screw rotate.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t concern yourself with \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E and \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E. You\u0027re not designing a spacecraft. Figure out the fundamental physics and basic concept of your ideas first.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-25T09:23:42Z","Content":"\n\u003Cp\u003E\nOr  you could learn the concept and not be bothered by it(or god forbid share.). You\u0027re not exactly adding to the conversation and It\u0027s not my fault the information to learn anything is so bad. Particularly because of people like you. I\u0027m not paying 10\u0027s of thousands of dollars to learn something. And if you hadn\u0027t noticed all information on the internet and otherwise has been reduced to make people reliant on colleges on purpose. So take your complaining elsewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll simplify something for you. Correct answers are just all the information. If it\u0027s not present or impossible to find people cannot and will not learn something(particularly when certain layers are constantly missing. Or data is very heavily specialized and no middle info is available.). The real world measure is if they did or didn\u0027t. At this point it doesn\u0027t exist. And this info is only complicated because of the lack of translation and ability to do so over the giant mess that is the modern internet/libraries and other sources. That is how the real world works. If you can\u0027t  find the info and layers are missing or too messy it\u0027s not reasonable and destroys how many people can and do learn things. We\u0027re not in a remotely reasonable environment. There are practical things that must be done for others to learn.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW, aerodynamics isn\u0027t complicated fundamentally. It\u0027s because of the mess of information and how hard it is to find info and other issues. It always has been. Although previously we had the difficulty of going to places to get info in a less than ideal manner.\n\u003C/p\u003E\n\u003Cp\u003E\nif you translate and supply information most subjects are absurdly simple.(basic proper writing and definitions. Not relying/overrelying on third party info etc. Not adding unneeded wording.) Most modern issues have to do with nothing else. It\u0027s also why things don\u0027t advance as far. If you hadn\u0027t noticed we are getting ever increasing childish egotistical issues in science and similar areas for decades now. This is why. It\u0027s the lack of surrounding data from more people learning the subject in an inefficient setup. If the data were better and people could learn it reasonably this would all change and there would be more to go against and more learned overall.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m so sorry I\u0027m looking at it from an engineering standpoint and exploring. But those areas have no information on it. I figured you guys are so knowledgeable it would be trivial in a conversation.\n\u003C/p\u003E\n\u003Cp\u003E\nYou noticed how in real world applications you usually want to keep large data on everything. You want that or a equivalent in information available for simple translation amongst other things. Just like before we messed up the computer world. anything is possible if you have sufficient documentation to bridge it. Most science area\u0027s are ultra focused. That is bad for learning or broadly learning and leads to lot\u0027s of problems. It destroys bridging information. Then followed up by the other problem with expecting everyone to know something because someone else does. Without any real world understanding of how that happens or what must be there it to exist. Especially when those people have areas heavily done and formatted for them and learned in a specialized manner. People all come from different starting points. What you need is the info from different point to all get to the same points. But broadly enough to cover all subjects. We have that distinctly missing or culled currently for personal gain and other childish reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the same fundamental reason colleges can\u0027t translate credits between them efficiently. That, btw, should not exist as a problem. That is from a fundamental reduction in education standards that should no way exist. It should literally void all degrees attached to the problem. The ability to do that is literally the basis of the standard for education naturally...\n\u003C/p\u003E\n\u003Cp\u003E\nLets see if you can be useful. Find me a source of actual data of weight and tolerances of real world aircraft landing gear models. I can\u0027t find any.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd this for increased lift. The entire body could have it withing the unused parts going to the edge. And partially closed off to the direct it to the engine for inceased performanced potentially: (during takeoff and landing likely.)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Rc7PcmAl7Ag?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIt would be adjustable. And when closed it would be a single solid air frame wing that is symmetrical. Probably held in the wing itself. like a closable air intake. Or something else if possible.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are putting lox outside the plane could you use it and or methalox to make the entire plane body into giant aerospike and fly into orbit like a flaming pheonix? Originally I was wondering if the lox would help lower air surface temps. But if you can just use it like a giant engine... The entire plane could get a boost of speed at the top to get into orbit faster with the entire body of the aircraft. That would be a possible advantage to making the plane body like a giant aerospike diamond. And a reason to carry up all of that lox with you. If you mixed it with methalox over a much larger surface! AND THE ENTIRE PLANE WAS \u003Cabbr title=\u0022Ascending Node\u0022\u003E\u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E\u003C/abbr\u003E AEROSPIKE!! 8D\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s the perfect solution. None of the plane is wasted. And the low lift of the plane is made up for in raw thrust! Just need some temp controls and whatever structural issues! 8)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the wheels might need to be based on quad weight tolerances(or more) instead of double. That might be easily possible though with the numbers. This is in case the aircraft leans sideways. But not sure how to figure that out.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-25T22:26:04Z\u0022 title=\u002201/25/2022 10:26  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 25, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2022-01-25T22:55:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081874\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643102622\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr  you could learn the concept and not be bothered by it(or god forbid share.). You\u0027re not exactly adding to the conversation and It\u0027s not my fault the information to learn anything is so bad. Particularly because of people like you. I\u0027m not paying 10\u0027s of thousands of dollars to learn something. And if you hadn\u0027t noticed all information on the internet and otherwise has been reduced to make people reliant on colleges on purpose. So take your complaining elsewhere.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI am trying to add to conversation by pointing out flaws in your concepts. If you don\u0027t want criticism, just say so and I\u0027ll add a little clap at the end of my post. You don\u0027t need 10s of thousands of dollars to access information and learn. I don\u0027t know where you live, but libraries are free, or next to free in  most of the world. Internet is full of free courses on every topic imaginable. If you want to read a scientific article that is behind a paywall of a journal, just email the author and in 9 out of 10 cases they\u0027ll happily send you the article for free. I\u0027m not sure what complaining you are referring to, but I\u0027m not doing any of that.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081874\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643102622\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ll simplify something for you. Correct answers are just all the information. If it\u0027s not present or impossible to find people cannot and will not learn something(particularly when certain layers are constantly missing. Or data is very heavily specialized and no middle info is available.). The real world measure is if they did or didn\u0027t. At this point it doesn\u0027t exist. And this info is only complicated because of the lack of translation and ability to do so over the giant mess that is the modern internet/libraries and other sources. That is how the real world works. If you can\u0027t  find the info and layers are missing or too messy it\u0027s not reasonable and destroys how many people can and do learn things. We\u0027re not in a remotely reasonable environment. There are practical things that must be done for others to learn.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is impossible to categorize and neatly organize every bit of obscure information available. It is entirely reasonable that for some specialized info you need a little bit more than a single google search. Do some legwork.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is also unreasonable to expect every bit of information to be available in a perfect translation to every language. Someones inability to understand the language of the author is not authors fault, nor is it the responsibility of the author to provide every possible translation.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081874\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643102622\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBTW, aerodynamics isn\u0027t complicated fundamentally. It\u0027s because of the mess of information and how hard it is to find info and other issues. It always has been. Although previously we had the difficulty of going to places to get info in a less than ideal manner.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I\u0027m gonna disagree on this one.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081874\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643102622\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLets see if you can be useful. Find me a source of actual data of weight and tolerances of real world aircraft landing gear models. I can\u0027t find any.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI managed. It took me about 15 minutes. This is for 747-400, hope it suits your needs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://moam.info/d043u544-gpr1-747-412-4h6_59beb58d1723dd45281d4de0.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://moam.info/d043u544-gpr1-747-412-4h6_59beb58d1723dd45281d4de0.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSearch for 1-86-041 and 1-86-051\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224081874\u0022 data-ipsquote-contentid=\u0022206564\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643102622\u0022 data-ipsquote-userid=\u0022133381\u0022 data-ipsquote-username=\u0022Arugela\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Arugela said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd this for increased lift. The entire body could have it withing the unused parts going to the edge. And partially closed off to the direct it to the engine for inceased performanced potentially: (during takeoff and landing likely.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re talking about a scramjet and post a video about wing configuration specifically designed for ultra-slow flight. I don\u0027t see a connection.\n\u003C/p\u003E\n\u003Cp\u003E\nIncreasing lift is not free. It comes at a cost of drag.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-25T23:04:33Z","Content":"\n\u003Cp\u003E\nYou realize all the data charts were removed from that link. It literally has no info. And if that bottom info is it it\u0027s unreadable.\n\u003C/p\u003E\n\u003Cp\u003E\nThe wing idea was for landing/takeoff. The idea would be to open the front/back of the wing, or some other transformable wing, give it a similar config for takeoff for life, then close it back up for normal flight if possible. It\u0027s just an idea. It\u0027s giving a semi statick ability that birds have in a normal craft. Plus giving the craft one of it\u0027s most needed qualities. This could be combined with funneling air into the intakes for extra low super/hypercruise potentially. It might just need to be designed well enough to not create too much drag. I would assume it\u0027s only used at important point to get air speed up. It would have to be adjustable enough for different uses. Open for that air wing configuration. Closed with a different shape for getting extra air to start super cruise early. Particularly since the wing isn\u0027t being used much.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW, I used to look this stuff up for fun a long time ago. It was very easy to find very detailed info on every part of something like landing gear worked. Tolerances for every part, material, etc. All heavily condensed into single sources and easy to read or study if you desired. This is getting ridiculous.\n\u003C/p\u003E\n\u003Cp\u003E\nAll I\u0027m finding on any subject, besides a few documents I don\u0027t now enough to read, are very rare occasional to a single weight or piece of info that is not enough to do much of anything with. It doesn\u0027t matter what the subject is either.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-25T23:19:58Z\u0022 title=\u002201/25/2022 11:19  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 25, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2022-01-25T23:26:19Z","Content":"\n\u003Cp\u003E\nI wouldn\u0027t have posted it if it didn\u0027t contain the data. If you can\u0027t see it, there is something wrong with your computer.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a screenshot of one of the relevant pages.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jTZbLKu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022130.95\u0022 height=\u00221079\u0022 width=\u0022824\u0022 src=\u0022https://i.imgur.com/jTZbLKu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2022-01-26T06:31:16Z","Content":"\n\u003Cp\u003E\nYea, some of it is showing up now. Not sure why it was blank for so long. Must have been loading very slowly...(like part of a day)\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the patent I found: \u003Ca href=\u0022https://patents.google.com/patent/US20160377029A1/en\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://patents.google.com/patent/US20160377029A1/en\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about an obscene 13 wheel landing gear.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a normal 2x2 but doubled. The middle has a nother 2x2 on each side on the outside. That is 12. The 13th is in the middle and is a stearing wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you only count 12 as weight supporting then, if it weight the same as the other one plus extra tires approximately, 9000lbs per wheel? If so you can get a 12 wheel x12 x2. I guess a double 4 setup with a front steering wheel might be easier if it helps to have stearing. easier to acount for the mass of the cargo(8000lbs for 8 wheels.). Outside of the body weight.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to read this, but going with my aerospike wing idea: \u003Ca href=\u0022https://link.springer.com/chapter/10.1007/978-3-540-85181-3_83\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://link.springer.com/chapter/10.1007/978-3-540-85181-3_83\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: I\u0027m starting to wonder if the problem is google... I have a tendency to open up to 100 tabs(or more) when I play games searching for info. I think I\u0027ve had this happen in the past. The moment an external link is introduced from someone else(or several) magically the same search results start flooding real information. Before this I\u0027m literally going insane trying to find information and getting nothing.  I wonder if their search logarithms are being flooded by this sort of activity. And the info being searched from another persons external source is adding data for it to finally show other websites. I\u0027m betting their search/display logic has some sort of limit or focus problem. Maybe too many youtube videos also... Since they own youtube I wonder if it effects google searches.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to read this, but going with my aerospike wing idea I might be in the right direction: \u003Ca href=\u0022https://link.springer.com/chapter/10.1007/978-3-540-85181-3_83\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://link.springer.com/chapter/10.1007/978-3-540-85181-3_83\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJust the wrong type of aerospike. 8\\ Wonder how light weight it is. You could being them out of the body on demand for certain parts of flight. Maybe they could be made to auto adjust as needed or as is efficient somehow in a simplistic reactive way that doesn\u0027t create too much extra drag. I\u0027m assuming my wing being symmetrical, and potentially designed to fly upside down, might want these on top and bottom.\n\u003C/p\u003E\n\u003Cp\u003E\nApparently this isn\u0027t new: \u003Ca href=\u0022https://www.hindawi.com/journals/ijae/2021/9370331/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.hindawi.com/journals/ijae/2021/9370331/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCould these be made of that niobium metal for going to orbit?\n\u003C/p\u003E\n\u003Cp\u003E\nCould these be put in a scramjets air flow to help light it?\n\u003C/p\u003E\n\u003Cp\u003E\nI found the thrust to weight of the xrs2200 and rs2200. 35 and 80. so 800,000 thrust is only 11-12 tons no matter what. That is fairly light. So, that could go in the engine or fuselage weight.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit2: I also forgot to apparently multiply by ln. I was working with much larger delta v. I was doing 900x9.81x1.0776 instead of ln(1.0776)*9.81*900.... Unless scramjets and whatnot can be that efficient on the way up. 8\\\n\u003C/p\u003E\n\u003Cp\u003E\nI think it can still get to orbit, but it needs a good chunk of the cargo to do so. Have to refigure this now.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I give it around 844 tons of more methane(assuming you can run it on methane) and near 596 tons of cargo it might be able to make it. So, maybe a 0.3 cargo ratio. similar to the shuttle. But it might need to take off more tonnage for fuel and structure. This assume 1450 average isp from the scramjets and 450 average isp for the aerospikes.(along with 9550 \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E\u003C/abbr\u003E to fully circularize orbit and not just get apoapsis up.) The fuel would fit in 2 24 ft diameter fuel tanks at 72 ft long. Might have to be specially shaped or some fuel in the wings. But this would have the benefit of more cryogen in the ship to cooling to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nNo idea on the other cost. But it is near the same values as the shuttle in some ways. I think it\u0027s main point would be for ultra dense cargo.(mainly because the original design is from a bomber for moab/mop bombs) Unless a larger version is made.\n\u003C/p\u003E\n\u003Cp\u003E\nFor less dense cargo it would need it\u0027s bigger version at around 288ftx144ft and use liquid hydrogen. That might give room for a larger cargo bay. No idea on the cargo size though.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you convert a ge9x engine into a ram/scramjet and only use the rear smaller diameter? if you could fit at 1.5meters diameter at 4x on each side and 110,000lb thrust they would be usable for takeoff. Assuming I\u0027m not missing anything else. If it could be brought down to 18,000lbs per engine instead of 21,000 it would be perfect. The rest of the engine could be in the other weight categories as It\u0027s using methalox cryogen to cool around the air intake. Assuming you can do that.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I\u0027m reading, the proper compression ratio for ramjet is around 60 and scramjet between 50 and 100... The ge9x is around 61:1.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe not. I did it with more detailed scramjet info(I think.). It might be able to get 236-308 tons to orbit. Depending on the engine weight. If it does 288 tons to orbit then that leave 20 tons for scramjet/ramjets without a turboprop.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it went up to 1.2 mach with aerospikes:\n\u003C/p\u003E\n\u003Cp\u003E\n0-1.2mach: 200t fuel(118\u002B82t) (isp360) 411.6dv? aerospike\n\u003C/p\u003E\n\u003Cp\u003E\n1.2-5mach: 68t fuel (isp 3450) 1303.4dv? Ramjet:methalox\u002Bair\n\u003C/p\u003E\n\u003Cp\u003E\n5-15mach: 288t fuel(\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E 2160-1900) 3430dv? scramjet: methalox\u002Bair?\n\u003C/p\u003E\n\u003Cp\u003E\nto orbit: 884t fuel (isp 450) 4255dv? aerospike.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit3:\n\u003C/p\u003E\n\u003Cp\u003E\nMach15-25: 262t\u002B182t 444t (isp950) LM\u002BLOX1444-1000(3430dv)scramjet\u002Blox\u003Cbr\u003E\nmach25-orbit: 98t\u002B68t 166.66t (isp450) 1000-833.333(825dv) aerospike\n\u003C/p\u003E\n\u003Cp\u003E\nThis uses 833t methalox and 333t lox.\n\u003C/p\u003E\n\u003Cp\u003E\n^If this works and the engine weight without turboprops is light enough it might get the full 560t cargo. This gives 560t cargo with 1166t of fuel. this gives 20-22 tons for aero forces for extra fuel and if ram/scram need more weight or other issues. Not sure if turboprops could add more efficiency to the start of the flight or not. Or if any of the above is even correct.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I\u0027m correct the wing weight and body weight are the same at max load. around 583/560/583 with the center more conventrated and the wings distributing the weight more on the sides and with more structure in the center and body where needed. Optimal distribution might be 666.66/666.66/666.66. The fuel would take up any space not used. Not sure how the fuel loads change over time with lower loads.\n\u003C/p\u003E\n\u003Cp\u003E\nWith fuel cost alone that is 5 dollars per lb of cargo. and you could run tickets for 1728 persons, if they can fit, at near 3-5k a seat! 8) 5k making around 3.3million per flight above fuel costs. Fuel cost 5.25 million per flight at full load. Not sure how much fuel for a people run. That is about less than halve the tonnage, not including seats and other things. So maybe half the tonnage. If fuel is halved for half cargo then you could have bare minimum seats cost 1500 per person for a 1728 person flight. I\u0027m assuming that doesn\u0027t work that way with fuel though.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit4: And I forgot to half the cubic area so unless you fly a wing that has a blunt or very rounded edge along the front/back it has a lot less space and must run on kerosene. Not sure how to do that one. If you could make the front fat and round enough to make up for the thin back and not loose volume for fuel you might be able to run on methane. If not kerosene. Unless I just did all the math wront... I hate math. Nope, it has around 72,000 cubft to use and I thought it had 144,000. This means it can\u0027t hold the methane fuel. It needs more dense. by about 2x. Or more interesting combinations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EThis can probably be done better for more cargo space. But as is it might allow 288t cargo. If not it might be able to get up to the 560t stated before with more details. Especially the scramjet to mach 25 part.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EThis is then down to 0.144 cargo ratio. So, unless it\u0027s cheaper it\u0027s worse than the shuttle. And airfriction not accounted for could take the entire cargo away. So, a 2 ton maybe reusable ship for a few crew members and if lucky a few 100 tons of cargo at most. Unless my math is still that far off in a good way. Probably not since I used what were probably hydrogen \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E values and not methane! 8) So, goodbye cargo! 2000 ton 2 passenger plane to orbit! Maybe. Not to mention structural weight hasn\u0027t been gone over. I bet it\u0027s heavier than expected. Maybe a bigger plane with more weight and bigger wing. Then hydrogen and maybe some less dense cargo. Maybe 3600t to orbit!\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you figure delta v and tonnage for a fuel and need the 200tonnage for delta v to get to 411.6 velocity. If you use the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E of the fuel do you add the oxidizer to that weight or can you simply divide by the fuel ratio within that tonnage?\n\u003C/p\u003E\n\u003Cp\u003E\nI was doing 2.5lox-3.6lmethane. I took 200/6.1 and multiplied each number to get the total of each fuel. Is that mistaken? 82lox-118lmethane.\n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone know the answer to this also: \u003Ca href=\u0022https://chemistry.stackexchange.com/questions/111355/can-a-stoichiometric-mixture-of-oxygen-and-methane-exist-as-a-liquid-at-standard\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://chemistry.stackexchange.com/questions/111355/can-a-stoichiometric-mixture-of-oxygen-and-methane-exist-as-a-liquid-at-standard\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://space.stackexchange.com/questions/34973/pre-mixing-cryogenic-fuels-and-using-only-one-fuel-tank\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://space.stackexchange.com/questions/34973/pre-mixing-cryogenic-fuels-and-using-only-one-fuel-tank\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nparticularly as JPL later demonstrated that you could make the mixture detonate merely by shining a bright light on it\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, ignition source is dependent on time of day! 8)\n\u003C/p\u003E\n\u003Cp\u003E\nThis has nice stuff in it: \u003Ca href=\u0022https://www.sto.nato.int/publications/_layouts/mobile/view.aspx?List=44a8f49d-e481-458a-91b4-212a9605bd9e\u0026amp;View=b927897e-9dc2-4392-aa25-598b0c04b48e\u0026amp;RootFolder=%2Fpublications%2FSTO%20Educational%20Notes%2FRTO-EN-AVT-150\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.sto.nato.int/publications/_layouts/mobile/view.aspx?List=44a8f49d-e481-458a-91b4-212a9605bd9e\u0026amp;View=b927897e-9dc2-4392-aa25-598b0c04b48e\u0026amp;RootFolder=%2Fpublications%2FSTO Educational Notes%2FRTO-EN-AVT-150\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIncluding an als (air liquification system).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Air-augmented_rocket\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Air-augmented_rocket\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Liquid_air_cycle_engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Liquid_air_cycle_engine\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nmaybe a sabre engine that liquifies the air for use at the upper stages of flight so it starts with empty tanks and the lox/lair for closed cycle. And with a scramjet attached.\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if you could get 2x sabers on the bottom and 2 on the top and use the body shape to get the less angled air filled. then the engine weight could be centered.\n\u003C/p\u003E\n\u003Cp\u003E\nWith 4 sabre engine, pulling hydrogen and lox out of the air, and a scramjet you might be able to make it work.  You would need your hydrogen to produce a decent amount of more hydrogen though. Maybe from water and use the remains. The liberally projected 198tons of hydrogen takes up around 83,000ft3 and the ship is only around 71,200ft3. So, it needs something to make a lot of hydrogen. Or a bigger design. Or a different fuel. Liquid kerosene might work with the design and some engine configuration.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nEdit5: Actually I have 96,480ft3. So, I have enough to carry all of the 70kft3 needed for fuel(assuming any of my delta v is correct.). Anything generating oxygen can reduce this more and get more volume for cargo. So, the older methane with aerospikes and just ram/scram and no props might work if that is possible to begin with. And technically the hydrogen might work also if it can be efficient enough, but with even less cargo space and value. Or is the 96480 per side of the aircraft. If it is then hydrogen is on the table.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nI\u0027m bad at geometry:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIs the volume of the ship: (83.75*96*36)/3 = 96,480x2=192,960ft3? \u0026lt;- this is half of the ship as a 3d triangle. NVM, I took 96/36=2.666666 and divided further for approx 72kft3. That makes more sense. That formula I\u0027m guessing only works for a sqaure. So, back to kerosene or a change in body design.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Ca href=\u0022http://www.astronautix.com/l/l-1linearaeospikebooster.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.astronautix.com/l/l-1linearaeospikebooster.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nI\u0027m hoping this means it can run on it.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nPart of my original idea might be good. If I make it fly omnidirectionally with sc/ramjets facing towards the 60degree angle and the other engines towards the 120 degree angle or something. It can use both edges for a nose. This may help it in supersonic flight. Maybe it can be designed to slowly yaw sideways towards the other nose as it activates the ramjets. Maybe a spherical middle area with fuel tanks and engines and the body rotates around it. Or at least giant spherical gas tanks inside.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Ca href=\u0022https://space.stackexchange.com/questions/43677/is-it-correct-that-the-saturn-v-rp1-tank-was-pressurized-by-high-pressure-helium\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://space.stackexchange.com/questions/43677/is-it-correct-that-the-saturn-v-rp1-tank-was-pressurized-by-high-pressure-helium\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nI assume it would help with ominidirectional pressure release.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Cimg alt=\u0022wzrbyLe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wzrbyLe.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nEdit6: (bingo!)New rotating ship. If my new math is correct I have 192,000ft3 to play with(maybe 172,000ft3?) and not 72k. This means  pure hydrogen(maybe methane/lox if it can get to mars) and a massive tank in the middle. This ships points is to start at a 120 degree angle and slowly turn towards to 60 degree angle as you increase mach speed. If it can get liquid air/lox all the way up to mach 25 it only needs a tank of 168 tons of hydrogen(52.5105984 ft diameter, 75812.27ft3) to start until it hits space and then fills(or already has filled) a middle tank inside with lox/Lair for the final boost. This means a max takeoff weight of 2160 tons. 8 sabre engines(body rotates, but tank/engines stay in the same direction as body rotates around them.) and double landing gear top and bottom. Not sure where to put them.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nThe front angle is exactly 120 degrees. The side angle exactly 60 degrees. The top side angle is almost exactly 114 degrees and the side side angle is almost exactly 66 degrees. It has exactly 192,000ft3 of room. A little more with the sphere\u0027s popping out of the body. Not sure if it helps to have that exact of a number for the angle. If it does I could dop to exactly because of the extra ft3 from the sphere\u0027s sticking out.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nSpecs:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nDimensions: 166.27x96x54.0266ft(sphere 57.6 ft diameter(body angling from 54.0266ft.)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nCargo: 1440tons (passengers 800\u002B?)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nMax takeoff weight: 2160 tons (2000 nonimally.)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nEngines: \u003Cs\u003E16\u003C/s\u003E8 sabre engines (with scramjet abilities added to mach 25.)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nfuel tank: \u003Cs\u003E52.5105984\u003C/s\u003E 54.02663253650301115974ft diameter sphere(inner diameter)\u003Cs\u003E(up to 54ft diameter(57.6)), 168\u003C/s\u003E(182tons max\u003Cs\u003E(222)\u003C/s\u003E) tons of LH2 max(has an inner tank that expands to hold Liquid air or lox as needed. Or some equivilant.)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nCrew bubbles: 14.4ft diameter\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nPassenger bubbles: 28.8 ft diameter\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nTonnages:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nCargo: 1440t\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nLanding gear: \u003Cs\u003E162 tons (50 pairs of 4x wheels?)\u003C/s\u003E 120tons(36-37x4)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nFuselage: 144 tons\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nEngines: \u003Cs\u003E192\u003C/s\u003E 96 tons (\u003Cs\u003E16\u003C/s\u003E8xsabre engines, /w scramjet/las?) (up to 12? for \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E\u003C/abbr\u003E 1.25 and up.) 8 engines is 1.1 or less than 1 on takeoff. May need 2.0 thrust to not overuse fuel. 16 engines or less if new ones with sufficient thrust exist.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nFuel: 182.9tons LH2 (multifunctioning tank.)(54.02663253650301115974ft diameter, 82,570ft3) 21 tons dry weight?\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nSo, now it\u0027s a matter of how bad my math is for the fuel usage. And structural issues... (including landing gear placement. maybe water/landing takeoff and fuel up in the water for free to fill hydrogen?)\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nThe middle tank would be attached to a plate on the surface that holds the engines. This can rotate. Or the body can rotate around it. This gives dynamic life/aerodynamics and the ability to rotate the engines to any combination for entry or other situations.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIt would be a little like the interdictor from star wars, but with the bubble in the middle and two side bubbles.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIt may needs lots of liquid oxidizer and go way above the normal weight for flight. I wonder if the cargo bays could be used as duel tank for oxidizer without harming them.  Depending one how aggresively it can get or convert lox/ liquid air.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIs there a way to recollect some of the vapor water/ break it back down, then use the oxidizer over again to reduce the needed mass and never go over the max ship weight? If you run at 8:1 ratio and some of it is recollected like it were at 6:1 could this save on oxidizer somehow. The last stage has to go up to 2500 tons if it can\u0027t collect/recycle. any reuse might be helpful to add to collection and have more on hand at any moment, even if it adds inefficiencies. The ship has enough storage room for oxidizer, but the weight of it makes the hydrogen use too inneficient and increases it beyond the tank limit potentially. If not close(assuming my math is close to correct.) any effective increase in oxidizer without adding more mass at any given moment would help. could the bell nozzles lap any of it up the sides like a reverse regenerative cooler. Or literally with the regenerative cooling system? If it goes back in the hole like a reverse film cooling it could be broken back down and shot out again hypothetically. Or just shot out as water and steam as an additive if it gains enough efficiency or acts as an oxidizer. The objective is oxidizer at all costs. Not sure how much could be collected at that point. A little bit of hydrogen wouldn\u0027t hurt either. Else cargo tonnage has to be reduced. Which is probably ok.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nSo, would a recycling, regenerative, (reverse?)film cooling be possible? The point would be to reuse some of the oxidizer or water forming and keep reusing it as oxidier in effect or something similar. Could you lap water back up the engine wall like water up a spoon? Maybe on the outside of the nozzle?\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Ca href=\u0022https://www.quora.com/How-much-water-does-it-take-to-put-a-rocket-into-space-using-hydrogen-and-oxygen\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.quora.com/How-much-water-does-it-take-to-put-a-rocket-into-space-using-hydrogen-and-oxygen\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/4eM1mNNdguA?start=45\u0026amp;feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nThat is a lot of water to collect by the looks of it.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIf anything maybe a low thrust space rocket variation that recycles the lost water on purpose. Or is that less efficient?\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nActually that would be the most beneficial thing. The lack of needed oxidizer during orbital circularization burn would save the most mass and problems.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nHere are my guesses as to performance.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Cimg alt=\u0022nbFJqKf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nbFJqKf.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nDid I use delta v in KM/s or similar vs lb\u0027s? And does that change the end answer? I\u0027m almost wondering if it\u0027s odd odd this is actually almost working. I think I was thinking Delta V was a neutral term. Yep, I used m/s as delta v.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIf I can ever get my brain to do the conversion properly maybe it can do methane or kerosene still.. I think I correctly found I have near 172kft3. So, I have the volume to work with now... 8\\ I was previously using the cross lengths to determine volume. I think I found the side lengths are about 55.6 ft in all directsion. Could still be wrong. I\u0027m getting worse at math by the year. 55.6x55.6x83.13/3 = 85,661.585ft3x2= 171,323.1712ft3 for both sides. Still not sure that is correct though.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nI\u0027m very unused to metric. It will take a while for my brain to figure out how to convert it fully.  As simple as this technically is.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nHere is a new chart. 8 hour flights to orbit with only 8 engines:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Cimg alt=\u0022QdCgkrp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QdCgkrp.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nThis design has 1440 tons cargo.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n360 tons structural: 96tons(engines), 144 structure, 120tons landing gear.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n360 tons fuel maximum: single 54ft diameter tank with 182.7 tons lh2 and enough weight for lox/lair to be added in flight.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nMax weight around 2160. Normal takeoff weight around or under 2000 tons. last burn in space would be 2160 tons with 360 split between needed hydrogen and oxidizer.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nAs long as isp is neutral and doesn\u0027t need to be converted to ft/s this is a potentially feasible design. The only thing I haven\u0027t gone over in detail is the structural issues. At least from a superficial standpoint.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nThe main problem may be I used 8:1 ratio and if it can\u0027t go that hot it may not have enough fuel in the 182 tons if using 6:1 ratio or less. I was hoping this could be relatively solved by the engines being mounted to the giant cryogenic tank holding the hydrogen.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nIf you filled the center tank with a mix of lox and methane it could get over 6000 delta v with 360 tons of cargo and 360 tons of ship.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nNew messier version with optional positions and exact angles:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Cimg alt=\u0022YsDHnRQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YsDHnRQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nStill trying to figure out the correct isp at 8:1 ration, but can you run  8:1 if enough cooling could be produced and use liquid air\u0027s extra bits to provide higher isp? It would save huge amounts of tank space. If not I have to largely increase the tank size potentially. Though probably not too much because of the volume increase with a sphere. I was also hoping to over pressurize the hydrogen. Assuming it can go past the 4.432 I think I saw for the mass/ft3 I saw for the shuttle. I haven\u0027t gotten far enough to figure out how this works yet to work out the details.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nWild assumption here, but if I went with the flying aerospike idea could the thrust being pushed off the body of the aircraft like an aerospike help with cooling?\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n\u003Ca href=\u0022https://news.brown.edu/articles/2015/07/melting\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://news.brown.edu/articles/2015/07/melting\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nMaybe this. My hypothetical material heat limit is for 4420 K. Just because it\u0027s the value for compressed hydrogen.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nCould excess liquid air be stored to raise \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E by allowing the engines to fire into an artificial atmosphere at the end of the jet nozzle. Hopefully allow more heat to be outside of the engine and not inside. I assume by letting it out at the end of the nozzle and like if it were regenerative cooling released at the end of the cycle. It\u0027s probably excessive, but an \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E of 1200 past mach 15 and in deep space would be an interesting goal. How much liquid oxygen would need to be released to burn into if that is effecting \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E and not thrust.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;text-indent:0px;\u0022\u003E\nSo far my design, probably not realistic, stores 82,570 ft3 of space for hydrogen. If it has a lining to store the hydrogen that shrinks and then fills the outside with liquid air(or the reverse), if the liquid air is the same as lox, then that is 71.2 density per ft3 filling in afterwards. That maxes at under 3000tons(just under 2250 tons if lair is 54.3123/ft3.). So, there is lots of room. The hydrogen can only get around 183 tons of liquid and 218 tons of slush.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-02-26T07:13:36Z\u0022 title=\u002202/26/2022 07:13  AM\u0022 data-short=\u00222 yr\u0022\u003EFebruary 26, 2022\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}