{"TopicId":20668,"ForumId":25,"TopicTitle":"No Chutes!","CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T07:27:43Z","PageNum":1,"Articles":[{"CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T07:27:43Z","Content":"\n\u003Cp\u003EGet an orbiter into orbit and safely land it on solid ground without the use of Parachutes, or wheels, of any kind. I was up all night working on a ship that served as proof of concept. Yes, it has 3 chutes. But I managed to get it landed without them. I\u0027ll tell you this much. It takes some creativity with the stages to pull it off.\u003C/p\u003E\n"},{"CreatedByName":"-Gamah","CreatedById":42887,"CreatedDateTime":"2012-09-28T10:25:56Z","Content":"\n\u003Cp\u003EAll you need is a typical lander with enough thrust to negate kerbin\u0027s gravity, it\u0027s not that complex.\u003C/p\u003E\n"},{"CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T14:22:46Z","Content":"\n\u003Cp\u003EYa. I JUST realized that there are now automated pilots, orbital calculators, and precision guidance in KSP now... lol Kinda takes the difficulty out of a challenge like this.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-09-28T15:41:28Z","Content":"\n\u003Cp\u003EGray, that is why you request no mods etc to do the challenge. I have done this stuff before (mostly by accidental design errors) and quite enjoy it. I have never set one up purposefully for it, but I have a challenge idea that should just work....\u003C/p\u003E\n"},{"CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T20:26:48Z","Content":"\n\u003Cp\u003EI would say \u0022No Mods\u0022 but I am still using 0.13 until I get some cash flowing. Have you SEEN 0.13 with no mods? lol\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-09-28T21:45:50Z","Content":"\n\u003Cp\u003Eoh, I remember 0.13, but not for very long since it quickly became v.14 but I think in terms of doing engine only landings, earlier versions might be easier since fuel tanks and consumption etc make it lots more fuel intensive for engine atmo decelerations. Is why when 0.16 came out, many designs of mine stopped working since I needed more tanks and the different thrusts/consumptions. All those calculators etc are stuff that is external. I have to manually fly everything stilll since I don\u0027t use them. eyeballing orbit captures ftw\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-28T21:55:26Z\u0022 title=\u002209/28/2012 09:55  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 28, 2012\u003C/time\u003E by Markus Reese\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheProdigy","CreatedById":15985,"CreatedDateTime":"2012-09-28T22:08:15Z","Content":"\n\u003Cp\u003EEh? It barely takes any fuel to land back on kerbin because of its terminal velocity anyway.\u003C/p\u003E\n"},{"CreatedByName":"Exclipse","CreatedById":45977,"CreatedDateTime":"2012-09-28T22:12:43Z","Content":"\n\u003Cp\u003ELanding back on Kerbin is easy even without mods, chutes or wheels.\u003C/p\u003E\n"},{"CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T22:13:45Z","Content":"\n\u003Cp\u003EMy \u0022Proof of Concept\u0022 ship never reached Terminal Velocity. I Kept it under 100M/s from the moment it hit atmo. Hardest part is actually making contact with the ground. The thrust is hard to get perfect. It likes to bounce.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-09-28T22:19:57Z","Content":"\n\u003Cp\u003EYou can do this stock, too.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-09-28T22:44:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gray Death\u0022 data-cite=\u0022Gray Death\u0022\u003E\u003Cdiv\u003EMy \u0022Proof of Concept\u0022 ship never reached Terminal Velocity. I Kept it under 100M/s from the moment it hit atmo. Hardest part is actually making contact with the ground. The thrust is hard to get perfect. It likes to bounce.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe typical terminal speed of a ship in Kerbin is usually around 130-150 m/s at sea level ( depending mostly of how much fuel you have... by comparison a empty fuel tank has a terminal speed of \u002B/- 107 m/s at Kerbin sea level ( a lot of Kerbals died for science to get this data \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ) ). So you pretty much only need to have around 150-160 dV in store, nerves of steel for a suicidal burn and a no lag at Kerbin surface computer to do it. Even a 1m capsule \u002B one 1m RCS tank \u002B enough linear RCS will work ( been there , done that --- you will need a surface to put the linear RCS, though. I used a empty small fuel tank )\u003C/p\u003E\n"},{"CreatedByName":"Gray Death","CreatedById":22362,"CreatedDateTime":"2012-09-28T23:51:50Z","Content":"\n\u003Cp\u003EI used the Thunderbird Fuel tank. Yes. The infinite one. Just to make sure I had the fuel gor it. I\u0027ll eventually crunch the numbers to figure out what it\u0027ll actually take to do it. I used the small vernier Liquid fueled Thrusters and the basic landing lege. lol I haven\u0027t tried it with all stock parts yet.\u003C/p\u003E\n"},{"CreatedByName":"-Gamah","CreatedById":42887,"CreatedDateTime":"2012-09-29T01:10:36Z","Content":"\n\u003Cp\u003EThis isn\u0027t difficult even with stock no mods on .13\u003C/p\u003E\u003Cp\u003EJust last night in .17 I landed on the Mun and flew back to kerbin to land with the same 2.5 tanks of fuel\u003C/p\u003E\n"}]}