{"TopicId":207126,"ForumId":16,"TopicTitle":"How to prevent rocket from exploding during gravity turn?","CreatedByName":"EH14","CreatedById":218817,"CreatedDateTime":"2022-03-04T03:01:46Z","PageNum":1,"Articles":[{"CreatedByName":"EH14","CreatedById":218817,"CreatedDateTime":"2022-03-04T03:01:46Z","Content":"\n\u003Cp\u003E\nI\u0027m attempting to build a massive \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rocket but when I attempt to start turning in the air my rocket instantly explodes.  I\u0027m using part clipping to get the  diameter of the rocket smaller but from what I understood that shouldnt affect the physics of the craft. The flight log says that there was a structural linkage failure between two adapters high up on the rocket in a random spot. If it helps I\u0027m using vector engines attached to an engine plate onto a 5m fuel tank.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2022-03-04T07:16:43Z","Content":"\n\u003Cp\u003E\nPart clipping can absolutely cause issues in some rare cases, especially when the clipped parts bear a lot of load...\n\u003C/p\u003E\n\u003Cp\u003E\n...But, as always when it comes to asking for help troubleshooting specific vehicles: screenshots please \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2022-03-04T21:13:31Z","Content":"\n\u003Cp\u003E\nThe Vector engine has a wider range of motion to assist with steering, but that also means that it\u0027s levering the ship around with greater force, and possibly too much. Maybe try reducing the gimbal range or substituting another engine type. \n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-03-05T17:45:56Z","Content":"\n\u003Cp\u003E\nUsing Rigid Attachment and Autostruts can help prevent structural failures, especially when using larger boosters.   Those options appear in the Part Action Window in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, when you right-click on an installed part.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are playing a career game, the option to Autostrut will not be available until you have unlocked the tech node that contains struts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe suggestions above by Streetwind and Vanamonde are also very likely to cause what you are describing.  A screenshot would be helpful.\n\u003C/p\u003E\n"},{"CreatedByName":"AlchemistZ7","CreatedById":219711,"CreatedDateTime":"2022-03-13T17:16:55Z","Content":"\n\u003Cp\u003E\nI don\u0027t know how far you tilt for your gravity turns, but I recommend a gentle 5 degree tilt once the rocket reaches 100m/s, then lock to prograde and throttle down to maintain time to apoapsis 32-42 sec. This will allow your rocket to slowly tilt while minimizing air resistance and stresses. \n\u003C/p\u003E\n"},{"CreatedByName":"Autochrome","CreatedById":212032,"CreatedDateTime":"2022-05-01T02:43:32Z","Content":"\n\u003Cp\u003E\nThe rocket might have broken apart due to aerodynamic stresses when you tried to turn the \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E. Make sure to autostrut everything to increase the strength of the fuselage, and try to make very gentle turns when flying the craft. Those are my recommendations.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-05-01T12:08:03Z","Content":"\n\u003Cp\u003E\nWhen you ask for help with a rocket design, it really does help to include pictures of said rocket- or even better, a video, or better yet the craft file- or else all we can do is guess at the problem. There\u0027s a big difference between a vertically and horizontally launched \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E, between an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rocket and an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E spaceplane and things like engine and payload placement can create vessels that handle in dramatically different ways.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat speed do you reach before you start your gravity turn, what altitude are you at and how far do you pitch over? Starting your turn earlier (50-100m/s) and pitching only slightly (5-10 degrees) minimises the forces applied to the craft from aerodynamic drag and is less likely to cause the rocket to start flipping and tear itself apart,  whereas waiting until you\u0027ve built up a lot of speed and then aggressively turning causes a lot more stress on the craft and is more likely to cause things to break apart. Try to stay close to the prograde marker on the navball to minimise drag, throttle your engines back once your time to apoapsis reaches about 40-50 seconds and keep burning until you reach the desired apoapsis, then do a circularisation burn- if you do a gravity turn right, the final burn to enter orbit should be pretty small.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rockets are hard. You need to build something with the thrust to lift off the ground, the delta-V to make it all the way to orbit and still carry a useful payload, then preferably return it to the surface in one piece. Atmosphere-optimised booster engines are inefficient in space, while vacuum-optimised engines don\u0027t work well (or at all) in the thick air near sea level; aerodynamic features are critical at low altitude, but dead weight in space; carrying extra weight reduces delta-V, requiring more fuel, meaning more weight, meaning more thrust is needed, meaning more engines, meaning yet more weight, and so on. It takes a lot of effort to make a functional \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rocket, never mind a good one, and there\u0027s a lot of trial and error involved. Don\u0027t give up \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}