{"TopicId":207238,"ForumId":99,"TopicTitle":"Mission Builder - Need help creating a stable loop","CreatedByName":"Zanaten","CreatedById":182271,"CreatedDateTime":"2022-03-11T21:23:59Z","PageNum":1,"Articles":[{"CreatedByName":"Zanaten","CreatedById":182271,"CreatedDateTime":"2022-03-11T21:23:59Z","Content":"\n\u003Cp\u003E\nNot sure if this is the right place to post this, but I need some assistance in creating a basic mission in the Mission Builder. I\u0027m trying to build a mission where users can learn about traffic patterns around airports, and I\u0027d like them to be able to fly the pattern as many times as they\u0027d like, then end the mission by landing and coming to a stop. The hope is that they could practice touch-and-go\u0027s, go-around\u0027s, or just fly the pattern to get familiar with it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I have so far is the bare bones version of what I\u0027m trying to create, as I wanted to be sure I could get the core functionality working before I started in on messages and scoring and things like that.\u003Cbr\u003E\u003Cimg alt=\u0022ZiufrnK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002254.50\u0022 height=\u0022514\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ZiufrnK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI have each Fly-Through \u0022Turn\u0022 objective set so that it won\u0027t activate just once, but the issue I\u0027m running into currently is that after I Fly Through \u0022Final Turn\u0022 all four of the Fly Through objectives start cycling rapidly one after the other.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried having them all marked as \u0022Activate Once Only\u0022 which stops that endless looping, but doesn\u0027t let me pass any of the Fly Through objectives again (obviously). I tried to add in an Always True in a couple spots but couldn\u0027t get it to work like I wanted to. Does anyone have any recommendations for how I could get this to work? Thanks in advance.\n\u003C/p\u003E\n"}]}