{"TopicId":207803,"ForumId":16,"TopicTitle":"Problem with FMRS ( flight manager for reusable stages)","CreatedByName":"Beaver6513","CreatedById":221053,"CreatedDateTime":"2022-04-17T14:53:29Z","PageNum":1,"Articles":[{"CreatedByName":"Beaver6513","CreatedById":221053,"CreatedDateTime":"2022-04-17T14:53:29Z","Content":"\n\u003Cp\u003E\nHello fellow ksp connoisseurs. I wanted to ask a question. Basically, I have a problem with the fmrs mod. I created a big cargo plane that is used to drop a few droppods all over kerbin. Since you need some way to control those pods after you detach, i figured i could use fmrs. The problem appears exactly for this reason. It doesnt seem to work \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003Cbr\u003E\nWhen i drop the pod, i then use fmrs menu to switch to the pod perspective at detach time. I then land it and start doing science. The main plane then crashes because it doesnt have any control (maybe its because of this but i doubt). When i finish doing everything, I then return to the point of separation with main plane to continue the mission moving to the next point, but fmrs doesnt seem to remember that my pod landed, and so it deletes it. The option to go back to separation is still there, and i can repeat it, but i end up in the same situation as before...... I really dont know what could be causing it, because I know for sure that my copy of fmrs is working correctly, as I was testing things before with a rocket booster. If someone knows what is causing this, lemme know \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E . It might just be the fact that im crshing the main plane, but that seems stupid, as im then returning to the separation and continuing with my mission. To note that the \u0022craft is landed\u0022 does not appear in the menu after I return to main plane, as if I didn\u0027t detach it at all...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-04-19T08:21:48Z\u0022 title=\u002204/19/2022 08:21  AM\u0022 data-short=\u00222 yr\u0022\u003EApril 19, 2022\u003C/time\u003E by Beaver6513\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2022-04-17T17:29:10Z","Content":"\n\u003Cp\u003E\nAre you sure it\u0027s deleting the pod, and not recovering it?  By default FMRS will recover the landed vessel when you switch back to separation.\n\u003C/p\u003E\n"},{"CreatedByName":"Beaver6513","CreatedById":221053,"CreatedDateTime":"2022-04-17T18:23:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224118620\u0022 data-ipsquote-contentid=\u0022207803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221650216550\u0022 data-ipsquote-userid=\u0022179753\u0022 data-ipsquote-username=\u0022Geonovast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, Geonovast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre you sure it\u0027s deleting the pod, and not recovering it?  By default FMRS will recover the landed vessel when you switch back to separation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, it\u0027s deleting the pod. For two reasons:\u003Cbr\u003E\n1) The option for returning to stage separation is still there, even after landing the pod and recovering. It should be green with a \u0022Landed\u0022 or \u0022Recovered\u0022 ,i dont remember wich one , written beside, but not for me.\u003Cbr\u003E\n2) After failing to recover the pod (I did this both via the menu and via normal recovery) I tried looking for it in the tracking station. It\u0027s completely deleted, the kerbal inside is no longer present in the aviable kerbals, and it doesnt show the craft in the kerbalism menu.\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-04-19T15:46:34Z","Content":"\n\u003Cp\u003E\nI can\u0027t help with FMRS but I can offer an alternative that might work for your case. Try designing the drop pods so they don\u0027t have to be controlled; let them them fall with parachutes, mod airbags, impact resistant parts, or other techniques that can survive an uncontrolled drop.\n\u003C/p\u003E\n\u003Cp\u003E\nDefault physics range in atmosphere is only 2.5km before falling objects get deleted. Your cargo plane will need to loiter while each pod lands, or drop things at extremely low altitude, or investigate mods such as Physics Range Extender.\n\u003C/p\u003E\n\u003Cp\u003E\nRefer to my post in another thread for an example. My drop technique was to stage each pod with a decoupler\u002Bparachute so the parachute opened instantly even though I wasn\u0027t controlling the pod. The plane then circled while each pod landed.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022201293\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8040747784\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/201867-show-off-the-aircraft-jetpropcargopassengergliderfighter-etc-that-you-put-loads-of-time-into-getting-just-right/\u0026amp;do=embed\u0026amp;comment=4098802\u0026amp;embedComment=4098802\u0026amp;embedDo=findComment\u0022 style=\u0022height:297px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022haPA1Rg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/haPA1Rg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}