{"TopicId":208138,"ForumId":18,"TopicTitle":"Solved(?) my BSOD Crashes","CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-05-11T20:05:04Z","PageNum":1,"Articles":[{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-05-11T20:05:04Z","Content":"\n\u003Cp\u003E\n(This is more of a blog than a request for help, and my problem wasn\u0027t limited to KSP, so it\u0027s off-topic and goes to The Lounge.)\n\u003C/p\u003E\n\u003Cp\u003E\nTwo weeks ago I started getting BSOD crashes while playing KSP in Windows 10. Uh oh! It\u0027s been a long time since I saw one of those. The crash circumstances were weird, often happening while clicking parts in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E. It wasn\u0027t always the same part triggering the crash. Sometimes it would happen on a left click to attach or move a part, other times a right click to see part info.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP sometimes didn\u0027t want to reload after the bluescreen. It was getting stuck loading Breaking Ground files. Both times I deleted my Breaking Ground part folder and copied it from a backup. Odd. I think KSP writes part thumbnails while in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E and I guess the part clicked as the crash happened got corrupted. The most recent mod I added was Kerbal Wind Tunnel, and that does some heavy calculations, so I backed that out. Problems continued. The problem seemed bigger than just KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nMemory, CPU, etc. diagnostics didn\u0027t find any errors. Then I got lucky: a BSOD while doing some lightweight stuff in another app without KSP loaded. Armed with evidence that multiple apps could trigger crash, and my hardware seemed reasonably good (diagnostics can miss things), my next place to look was recent Windows patches.\n\u003C/p\u003E\n\u003Cp\u003E\nI rolled back the 2 most recent Windows patches. I played KSP for a while but got another BSOD within an hour. Damn! Would I have to restore my entire system from backup!?\n\u003C/p\u003E\n\u003Cp\u003E\nBefore restoring, since I had nothing else to lose, I tried to add even more Windows patches, including an optional 21H2 update that didn\u0027t offer anything I cared about. It looks like that may have fixed my problem. KSP and everything else has been stable for around 10 hours, instead of BSODing within an hour.\n\u003C/p\u003E\n\u003Cp\u003E\nAlong the way I also slowed my system RAM from DDR 1600 to DDR 1333 just in case my 6 year old RAM is dying. If I get no more BSOD\u0027s I\u0027ll speed it back to 1600 and see what happens.\n\u003C/p\u003E\n\u003Cp\u003E\nThis whole experience was surprisingly fun assuming that things stay stable and my 10 hours of freedom from BSOD hell continues:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIt\u0027s nice to verify I still remember how to diagnose problems after many years since my last serious PC problem.\n\u003C/li\u003E\n\u003Cli\u003E\nI told my wife about things after I got the problem fixed. She asked why I didn\u0027t tell her about the problem earlier. \u0022I wanted a solution, not sympathy\u0022 got a good laugh from both of us ... she\u0027s used to me being an a-hole.\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027m starting to think about building a new PC. It\u0027s time.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-05-11T20:05:36Z\u0022 title=\u002205/11/2022 08:05  PM\u0022 data-short=\u00222 yr\u0022\u003EMay 11, 2022\u003C/time\u003E by DeadJohn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Second Hand Rocket Science","CreatedById":218328,"CreatedDateTime":"2022-05-12T11:13:03Z","Content":"\n\u003Cp\u003E\nLooking forward to seeing what happens when you put the old ram back in. Plus, building a new PC will be a massive topic of interest for this forum! Best of luck!\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-05-12T12:47:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224130892\u0022 data-ipsquote-contentid=\u0022208138\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221652353983\u0022 data-ipsquote-userid=\u0022218328\u0022 data-ipsquote-username=\u0022Second Hand Rocket Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Second Hand Rocket Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooking forward to seeing what happens when you put the old ram back in. Plus, building a new PC will be a massive topic of interest for this forum! Best of luck!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s still the same RAM with the BIOS settings changed from 1600 to 1333.\n\u003C/p\u003E\n"}]}