{"TopicId":208626,"ForumId":69,"TopicTitle":"KSP crashing randomly.","CreatedByName":"Quantumkakes","CreatedById":221845,"CreatedDateTime":"2022-06-16T18:22:40Z","PageNum":1,"Articles":[{"CreatedByName":"Quantumkakes","CreatedById":221845,"CreatedDateTime":"2022-06-16T18:22:40Z","Content":"\n\u003Cp\u003E\nFirst of all I will give my computer specs for the support team.  Battery (I usually keep my laptop plugged in): Microsoft ACPI-Compliant Control Method Battery.  Adapter: Microsoft AC Adapter. Computer: ACPI x64-Based PC. Disk Drive: Micron_2210_MTFDHBA1T0QFD GPU (I have 2): Intel(R) UHD Graphics, NVIDIA GeForce RTX 3060 Laptop GPU (NOTE: I do overclock my GPUs, (Because I usually plug my laptop in, I don\u0027t need to worry about power usage.) They do stay in a safe temperature (around 40-60 Celsius) The highest my GPU has gotten was 70 Celsius one time when I was seeing what graphics one of my games should be.)) CPU: 11th Gen Intel(R) Core(TM) i7-11800H at 2.30GHz (I also overclock my CPU, but it also stays at a safe temperature) IMPORTANT! Tech support, Please let me know if there is anything I need to add, remove because it is not relevant to my problem, or change.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, onto my problem. I have noticed that KSP has crashed randomly when I am playing, even though My GPU and CPU can easily handle it at even high graphics. This is what would happen: first, the audio would freeze (It sounds like a loud metallic buzz) for a few seconds. Next, the game would freeze but the audio kept playing. The strange thing is that my whole computer would not load any new elements in for the duration of the crash. this would go on for about 30-60 seconds. Sometimes the spin wheel would show up and the game would give the white tint of death. but the: KSP is not responding  window would appear. If I clicked end program, it would close it. Sometimes though I would Wait out of curiosity, and the unity crash manager would close the game after some time.  another thing to note is that steam would not let me open the game because it was \u0022still running\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are the methods that I tried to use: First, I would try lowering the graphics. There was no change in the crash frequency, I updated my Graphics Driver. No change. The only thing that temporally reduces the crashes is restarting my computer. But, even that does not eliminate the crashes completely.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease let me know what I should do to fix this, thanks!\n\u003C/p\u003E\n"}]}