{"TopicId":208785,"ForumId":44,"TopicTitle":"Anyone visited Marshall SFC?","CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-06-30T14:02:27Z","PageNum":1,"Articles":[{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-06-30T14:02:27Z","Content":"\n\u003Cp\u003E\nIs visiting Marshall worth diverting an otherwise long drive past (I-65)? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYears ago I tacked a visit to Kennedy SC onto a nearby Florida vacation and it was totally worth it.  Family had a great time. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI\u0027m taking a trip that won\u0027t stop anywhere near Marshall - but the path gets close.  Is it worth it to add an hour or two (or four) to the trip to swing by and take a tour? \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(intentionally ignoring forum etiquette because I have a short window of opportunity to make a decision - this sub gets a lot more and focused traffic - mods, please indulge me today and then merge with my \u0027Lounge\u0027 thread tomorrow?) \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-06-30T14:30:09Z","Content":"\n\u003Cp\u003E\nAsking my buddy at JSC if he\u0027s been there, and what he thinks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFriend has not been since the 90s. He said the vertical Saturn V might be worth a stop alone, though.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2022-06-30T22:29:49Z","Content":"\n\u003Cp\u003E\nI was there on business a little over 4 years ago.  Not bad.\n\u003C/p\u003E\n\u003Cp\u003E\nThe vertical stack of the Saturn V is really something to see.  If you don\u0027t take the time to stop, at least drive by so you can get a view of it.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-01T14:35:22Z","Content":"\n\u003Cp\u003E\nSo it turns out that the tour bus is canceled because of Covid (or rather, \u003Cem\u003Eremains\u003C/em\u003E canceled).  The bus ride around Kennedy was a highlight of the trip... \n\u003C/p\u003E\n\u003Cp\u003E\nThere \u003Cem\u003Eare\u003C/em\u003E museums open.  The museum at Kennedy was cool and I can hope that the museum at Marshall would be, too. \n\u003C/p\u003E\n\u003Cp\u003E\nBut it\u0027s not enough of a draw to get the kids and She Who Must be Indulged to make a significant detour.  Kinda disappointing. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks folks. \n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-01T15:01:39Z","Content":"\n\u003Cp\u003E\nMods - I\u0027m okay with merging this with my \u0027Lounge\u0027 post and letting them both stagnate. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the indulgence! \n\u003C/p\u003E\n"}]}