{"TopicId":209050,"ForumId":20,"TopicTitle":"how to permaprune","CreatedByName":"darthvader15001","CreatedById":222173,"CreatedDateTime":"2022-07-20T11:55:47Z","PageNum":1,"Articles":[{"CreatedByName":"darthvader15001","CreatedById":222173,"CreatedDateTime":"2022-07-20T11:55:47Z","Content":"\n\u003Cp\u003E\nso, I use janitors closet and have no idea how to permaprune. help? Edit: I have uninstalled tjc so please do not post here.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-21T11:00:41Z\u0022 title=\u002207/21/2022 11:00  AM\u0022 data-short=\u00221 yr\u0022\u003EJuly 21, 2022\u003C/time\u003E by darthvader15001\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-07-21T03:34:37Z","Content":"\n\u003Cp\u003E\nIn general terms, use TJC to \u003Cem\u003Ehide\u003C/em\u003E some parts (alt-click) in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E. Then pick permaprune from the TJC menu button. It will \u003Cem\u003Edelete\u003C/em\u003E all the hidden parts, saving memory and load times. Any vessels (saved \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E craft, and more importantly vessels in flight) that use those parts will break.\n\u003C/p\u003E\n\u003Cp\u003E\nPermaprune is risky if you accidentally hid some important parts. I suggest backing up your entire KSP install folder before using it.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a TJC thread if you need more specific help.\n\u003C/p\u003E\n"},{"CreatedByName":"darthvader15001","CreatedById":222173,"CreatedDateTime":"2022-07-21T10:59:30Z","Content":"\n\u003Cp\u003E\nOh thanks\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2022-07-21T12:00:38Z","Content":"\n\u003Cp\u003E\nIt\u0027s also worth noting that if you \u003Cu\u003E\u003Cem\u003Edid\u003C/em\u003E\u003C/u\u003E accidentally permaprune important stock parts and wanted to get them back, then there\u0027s a good chance that you can repair your installation, depending on how you purchased KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, if you bought it through Steam, you can go into the KSP page of your Steam library and there\u0027s an option to \u0022validate local files\u0022-- doing that will cause it to scan your local installation, compare that with the \u0022fingerprint\u0022 of what a fresh install looks like, and then if it finds any files that are missing or modified, it\u0027ll download them from the Steam servers and fix it up.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m only familiar with Steam, myself, but I have the impression that other game purchase platforms tend to have something like that, too.\n\u003C/p\u003E\n"}]}