{"TopicId":209425,"ForumId":32,"TopicTitle":"KSP1 Computer Building/Buying Megathread","CreatedByName":"Leonov","CreatedById":51498,"CreatedDateTime":"2013-04-20T02:28:51Z","PageNum":103,"Articles":[{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-10-21T02:47:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kelderek\u0022 data-cite=\u0022Kelderek\u0022\u003E\u003Cdiv\u003EHaha, I see you changed the video card to AMD. Everyone seems to prefer one or the other about the same way that we Americans vote republican or democrat.\u003Cp\u003EI have no idea how soon I\u0027ll be able to make my purchase, and I expect a lot of possible price fluctuation almost daily, so it\u0027s good to have multiple options for each item in case one of them is on sale at the right time. I\u0027m hoping to place an order later this week, but it may be next week before the money is available.\u003C/p\u003E\u003Cp\u003EMy biggest worry about a smaller SSD would be choosing which games to install on it and which to put on the HDD. I know the main benefit of the SSD is the OS, but with the 1 TB size I\u0027m pretty sure I could fit the vast majority of my games on it. I\u0027ll have to think on that some more.\u003C/p\u003E\u003Cp\u003EAlso, regardless of which case I choose, I will likely buy a couple extra fans to help with the air flow. Each case only comes with 2 or 3 but has slots for around 7.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe GPU thing is a pretty accurate assumption. \u003C/p\u003E\u003Cp\u003EDo think about the SSD while having games on it will give slightly better load time I can\u0027t really tell the difference. \u003C/p\u003E\u003Cp\u003EI would hold off on the extra fans. On the higher priced cases the 2 or 3 that they come with are really enough and the extra slots are just marketing.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-10-21T04:51:19Z","Content":"\n\u003Cp\u003EI\u0027m fascinated by the newer designs for cases. They\u0027ve made some significant improvements since I built my last PC 6\u002B years ago. Most cases have moved the PSU to the bottom now and they have much better cable management than before (like modular PSU cables). SSDs didn\u0027t even exist back then, well at least not in the mainstream - I had never heard of them until a few months later.\u003C/p\u003E\u003Cp\u003EI can\u0027t wait, I always love building a new PC.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-10-21T21:59:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kelderek\u0022 data-cite=\u0022Kelderek\u0022\u003E\u003Cdiv\u003EHow about either of these two cases then:\u003Cp\u003E\u003Ca href=\u0022http://www.newegg.com/Product/Product.aspx?Item=N82E16811352020\u0026amp;ignorebbr=1\u0022 rel=\u0022external nofollow\u0022\u003EFractal Design Define R4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.newegg.com/Product/Product.aspx?Item=N82E16811139042\u0026amp;ignorebbr=1\u0022 rel=\u0022external nofollow\u0022\u003ECorsair Obsidian Series 450D\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the Fractal Define R3 (the R4 is a minor upgrade, almost identical) It\u0027s a pretty nice case. I bought mine for the 8 3.5\u0022 internal bays, but it\u0027s also \u003Cem\u003Every\u003C/em\u003E quiet (even with dual Xeons in it, though I did have to fabricate brackets for socket 771) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-10-21T22:10:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EI have the Fractal Define R3 (the R4 is a minor upgrade, almost identical) It\u0027s a pretty nice case. I bought mine for the 8 3.5\u0022 internal bays, but it\u0027s also \u003Cem\u003Every\u003C/em\u003E quiet (even with dual Xeons in it, though I did have to fabricate brackets for socket 771) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow hot do the internals get?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-10-25T07:29:10Z","Content":"\n\u003Cp\u003EI thought I was being clever by coding a function that allows the program to use the full range of an integer (-2147483648 to 2147483647), but it seems the conversion back to normal values takes too much computing power to make it worth the hassle. Where before up to 1500 items could be displayed before things really bogged down, now just 500 is enough. That is without some more complex calculations that still need to be implemented. \u003C/p\u003E\u003Cp\u003EMaybe I would be better off multiplying everything by two or three orders of magnitude to reduce rounding errors and leave it at that. Though I just realised that if you limit yourself to the positive part of the integer, you only need a \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Efudge\u003C/span\u003E conversion factor to translate your coordinates pretty much in one simple division. I just am not too comfortable running the whole thing 1 to 1. Rounding errors would become large, causing problems in different areas.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-25T16:10:47Z\u0022 title=\u002210/25/2015 04:10  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 25, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Moriarty Avalon","CreatedById":152704,"CreatedDateTime":"2015-10-25T21:37:27Z","Content":"\n\u003Cp\u003EEvening all, with Christmas and Black Friday rolling around its time for my annual \u0022Do I need moar\u0022 brain drain.\u003C/p\u003E\u003Cp\u003ESpecs are below, just looking for the largest single improvement I can make to this setup. Obviously want to push KSP faster but also looking with an eye to XCom 2 (squee!)\u003C/p\u003E\u003Cp\u003EGigabyte GA-MA770T-UD3 AMD 770\u003C/p\u003E\u003Cp\u003EAMD Phenom II X4 555 Black Edition 3.2GHz Socket AM3 6MB Cache\u003C/p\u003E\u003Cp\u003ECorsair 8GB (4x2GB) DDR3 1333MHz Memory Kit Unbuffered CL9 \u003C/p\u003E\u003Cp\u003EXFX HD 5770 1GB XXX Editon GDDR 5 Arctic Power 700W PSU\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-25T23:30:58Z","Content":"\n\u003Cp\u003EKSP will appreciate a modern Intel CPU. Of course that also means a new motherboard, and if you go Skylake you might need new RAM too.\u003C/p\u003E\u003Cp\u003EMany other games will gain more benefit from a graphics card upgrade, but check you have a quality power supply and what the wattage is.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-10-27T04:36:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ESomething you may need to watch out for: I noticed the price of the Core i5 6600K has spiked in the last few days and it seems like there may be a shortage. I got it for Ã‚Â£200, the same as it was around launch, but I\u0027ve no idea when mine will arrive. Some retailers have pushed the price up to Ã‚Â£220 or even Ã‚Â£250 and on some sites the processor is completely absent.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETurns out you were right. I came home from a long weekend vacation in the mountains ready to place my order for PC parts and the i5 6600K was sold out on Newegg. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Then I did a new search and found it in stock at my local Microcenter store and on sale to boot! I was able to go buy it and pick it up for only $213, more than $50 less than Newegg\u0027s price before they went out of stock. I was also able to grab a \u003Ca href=\u0022http://www.newegg.com/Product/Product.aspx?Item=N82E16824160253\u0022 rel=\u0022external nofollow\u0022\u003EAOC 27\u0022 \u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E2560 x 1440 1ms monitor on sale for $299, the same price that Newegg has it, so I saved a little on potential shipping costs.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-10-28T07:49:06Z","Content":"\n\u003Cp\u003EWhat do you think of this build? It\u0027s mainly for lower-end graphics games like Besiege or Rocket League. I\u0027m trying to keep the price down as much as possible.\u003C/p\u003E\u003Cp\u003ECPU: Pentium Anniversary Edition G2358 (Planning on overclocking it because why would you not)\u003C/p\u003E\u003Cp\u003EMotherboard: MSI H81M-P33 (MicroATX)\u003C/p\u003E\u003Cp\u003EGPU: EVGA GTX 950 2GB\u003C/p\u003E\u003Cp\u003ERAM: Crucial Ballistix Sport 2x4GB\u003C/p\u003E\u003Cp\u003ECooler: Cooler Master Hyper 212 Evo\u003C/p\u003E\u003Cp\u003EPSU: EVGA 500W\u003C/p\u003E\u003Cp\u003ECase: Corsair Carbide Series 200R (With a window, because... windows.)\u003C/p\u003E\u003Cp\u003EMonitor: Acer S220HQL 21.5\u0022 LCD\u003C/p\u003E\u003Cp\u003EKeyboard: Redragon S101 VAJRA\u003C/p\u003E\u003Cp\u003EMouse: Redragon CENTROPHOROUS (Not the best keyboard/mouse combo, but it\u0027s $27 USD for both and the closest thing to an FPS I\u0027m going to play on this thing is Space Engineers)\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2015-10-29T14:11:04Z","Content":"\n\u003Cp\u003E(This isn\u0027t directly relevant to computer building, but I assumed the mods wouldn\u0027t want another thread. The title also says \u0022All questions acceptable\u0022, so I\u0027m going to put this here.)\u003C/p\u003E\u003Cp\u003E(This isn\u0027t really the problem. Well, it sort of is.) I\u0027ve recently been having an issue with my computer, mainly that the start menu and several default Windows applications no longer function correctly or at all. \u003C/p\u003E\u003Cp\u003EThe desktop also takes a very long time to load (upwards of 5 minutes) and the hard disk seems far slower than usual (only at \u0026lt; 30% usage constantly) and just... Takes longer for everything. After a lengthy conversation with Microsoft, they came to the conclusion that Windows was somehow corrupted. After this I ran the default Windows app to check that the hard disk wasn\u0027t failing or corrupted (Which showed nothing) as well as the Western Digital version (Which also registered nothing.) So there\u0027s apparently nothing wrong with that, so I ran a malware scan, which also showed nothing, and I also haven\u0027t downloaded anything in a few weeks. So unless a part of the drive somehow got messed up and now isn\u0027t registering as being corrupted, I don\u0027t know whats causing this (It could be malware and just didn\u0027t show up until recently, but it still didn\u0027t register anything on the scan, so...) If you have any idea what\u0027s causing this, please reply, and if nothing else I\u0027ll try reinstalling everything later. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-10-29T15:08:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hobbes Novakoff\u0022 data-cite=\u0022Hobbes Novakoff\u0022\u003E\u003Cdiv\u003EWhat do you think of this build? It\u0027s mainly for lower-end graphics games like Besiege or Rocket League. I\u0027m trying to keep the price down as much as possible.\u003Cp\u003ECPU: Pentium Anniversary Edition G2358 (Planning on overclocking it because why would you not)\u003C/p\u003E\u003Cp\u003EMotherboard: MSI H81M-P33 (MicroATX)\u003C/p\u003E\u003Cp\u003EGPU: EVGA GTX 950 2GB\u003C/p\u003E\u003Cp\u003ERAM: Crucial Ballistix Sport 2x4GB\u003C/p\u003E\u003Cp\u003ECooler: Cooler Master Hyper 212 Evo\u003C/p\u003E\u003Cp\u003EPSU: EVGA 500W\u003C/p\u003E\u003Cp\u003ECase: Corsair Carbide Series 200R (With a window, because... windows.)\u003C/p\u003E\u003Cp\u003EMonitor: Acer S220HQL 21.5\u0022 LCD\u003C/p\u003E\u003Cp\u003EKeyboard: Redragon S101 VAJRA\u003C/p\u003E\u003Cp\u003EMouse: Redragon CENTROPHOROUS (Not the best keyboard/mouse combo, but it\u0027s $27 USD for both and the closest thing to an FPS I\u0027m going to play on this thing is Space Engineers)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t get a pentium even overclocked it won\u0027t be that good.\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-10-29T15:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t get a pentium even overclocked it won\u0027t be that good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve heard great things about the G2358\u0027s overclocks. Think 4.2 Ghz with the stock cooler. Plus, it\u0027s a steal at $70.\u003C/p\u003E\n"},{"CreatedByName":"masiboss","CreatedById":63787,"CreatedDateTime":"2015-10-29T15:18:14Z","Content":"\n\u003Cp\u003Ei was wondering is gsync worth it? i was looking for a 1440p monitor and the monitors with g-sinc are to expensive so what if i buy a 144hz monitor to what framerate will \u003C/p\u003E\u003Cp\u003Ev-sync limit my fps? \u003C/p\u003E\u003Cp\u003Eany sugestions ?\u003C/p\u003E\u003Cp\u003Eedit: gpu: gigabyte g1 gtx 970 windforce \u003C/p\u003E\u003Cp\u003Ewill it even run any games at that resulotion with max setings?\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-10-29T15:21:52Z","Content":"\n\u003Cp\u003EDepends on the game your playing, but probably. Gsync is way to expensive right now and if you ever use a AMD card then it\u0027s useless.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-29T15:25:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t get a pentium even overclocked it won\u0027t be that good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a Pentium G3258 and it performs quite well when overclocked. In single thread applications like KSP it will keep up with higher end i5s and i7s at a fraction of the cost, currently it is the best choice for a KSPer on a modest budget as there\u0027s nothing at that price point that comes close. If you\u0027re doing very heavily threaded stuff an AMD might be better, but most games aren\u0027t that heavily threaded (and Intel\u0027s better IPC can make up for the core count to some degree).\u003C/p\u003E\u003Cp\u003ETechReport\u0027s rather glowing review: \u003Ca href=\u0022http://techreport.com/review/26735/overclocking-intel-pentium-g3258-anniversary-edition-processor\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://techreport.com/review/26735/overclocking-intel-pentium-g3258-anniversary-edition-processor\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-10-29T15:32:40Z","Content":"\n\u003Cp\u003EI wouldnt buy a monitor with gsync, since you have to pay quite much extra and it will only work with Nvidia cards, so its not realy future proof. AMDs Freesync is a bit better in this, since its an open standart (so maybe Nvidia will support it one day) and it also doesnt make the monitors very expensive...\u003C/p\u003E\n"},{"CreatedByName":"masiboss","CreatedById":63787,"CreatedDateTime":"2015-10-29T15:38:53Z","Content":"\n\u003Cp\u003Ei know but when buying a 144hz monitor what will v-sync do?\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-10-29T15:49:43Z","Content":"\n\u003Cp\u003EVsync lets the GPU only produce an image when the monitor is ready to recieve it. For 144hz that means it will produce up to 144 fps, (which is unlikely since most programs are limited by your CPU before), not more. If your PC isnt fast enough for 144hz (that will happen very often!) it will send a new image to the monitor every 2 refresh cycles of the monitor, you will see \u0022only\u0022 72fps. It can reduce the speed even futher.\u003C/p\u003E\u003Cp\u003EThe advantage of Vsync is that your monitor wont show half images, e.g. when your GPU finished a new image while the monitor is still busy showing the first one (know as tearing, can be realy ugly). The disadvantage is that when your PC is to weak for a constant framerate you get reduced to half of the monitor framerate, even when its able to calculate 90% of the required FPS. \u003C/p\u003E\u003Cp\u003EThis is what Gsync and Freesync try to slove, both make your monitor adjust to the fps of your PC, not the other way around.\u003C/p\u003E\n"},{"CreatedByName":"masiboss","CreatedById":63787,"CreatedDateTime":"2015-10-29T15:58:56Z","Content":"\n\u003Cp\u003Eoh ok i just didn\u0027t know vsync worked thanks but as far as i know many high end monitors let you set thier refreshrate in thier menue so would it not be better to set my monitor to a refreshrate slightly lower than my avrage fps??\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-29T16:15:04Z\u0022 title=\u002210/29/2015 04:15  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 29, 2015\u003C/time\u003E by masiboss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-30T13:13:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ESomething you may need to watch out for: I noticed the price of the Core i5 6600K has spiked in the last few days and it seems like there may be a shortage. I got it for Ã‚Â£200, the same as it was around launch, but I\u0027ve no idea when mine will arrive. Some retailers have pushed the price up to Ã‚Â£220 or even Ã‚Â£250 and on some sites the processor is completely absent.\u003C/div\u003E\u003C/blockquote\u003ERemember I mentioned this? Well about two weeks after placing my order I telephoned the supplier and was informed they were expecting new stock in \u003Cem\u003EJanuary\u003C/em\u003E. So in the end I\u0027ve had to switch my build to the i3 6100 anyway, since I don\u0027t want to wait that long.\u003Cp\u003EI guess the lesson learned should be, don\u0027t order computer stuff from places that don\u0027t have it in stock! And perhaps don\u0027t dither about purchasing so much; if I\u0027d moved earlier I probably would have got the i5.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-10-30T14:31:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ERemember I mentioned this? Well about two weeks after placing my order I telephoned the supplier and was informed they were expecting new stock in \u003Cem\u003EJanuary\u003C/em\u003E. So in the end I\u0027ve had to switch my build to the i3 6100 anyway, since I don\u0027t want to wait that long.\u003Cp\u003EI guess the lesson learned should be, don\u0027t order computer stuff from places that don\u0027t have it in stock! And perhaps don\u0027t dither about purchasing so much; if I\u0027d moved earlier I probably would have got the i5.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI remember you saying this, and sure enough by the time I had the money to place an order Newegg was sold out. When I searched other retailers online for it I really lucked out and found that the local MicroCenter store a couple miles away had 25 in stock. So I ordered one and did an in-store pickup. Better yet, it was on sale so I only paid $213. I\u0027m now in the process of configuring a killer new PC and will be busy with installations and screwing with settings for the next few days - something that is both fun and boring at the same time, LOL. I did manage to OC the i5 6600K to 4.5 GHz, I\u0027m not sure if I should push it much further.\u003C/p\u003E\u003Cp\u003EAlso, I have G.Skill Ripjaws V 2400 DDR4 16 GB (2x8 GB) memory that seems to be only running at 2133. Does this mean that the memory was mislabeled or do I need to OC the memory to correct it? I\u0027ve never OCed memory before so I\u0027m not sure how to go about doing it.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-30T14:34:30Z","Content":"\n\u003Cp\u003EWhat I heard is that with Skylake, 2133 is the only standard speed and anything above that is technically overclocking, even if the memory is officially rated for higher.\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-10-30T15:08:43Z","Content":"\n\u003Cp\u003EYou propably have to select the right profile in your UEFI.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-10-30T17:00:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kelderek\u0022 data-cite=\u0022Kelderek\u0022\u003E\u003Cdiv\u003EAlso, I have G.Skill Ripjaws V 2400 DDR4 16 GB (2x8 GB) memory that seems to be only running at 2133. Does this mean that the memory was mislabeled or do I need to OC the memory to correct it? I\u0027ve never OCed memory before so I\u0027m not sure how to go about doing it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECertain generations of chips are rated up to a certain speed. Memory manufacturers will often make memory that can clock higher, but the system will not automatically do this for you. You (generally) will need to tell the system to run at these higher speeds.\u003C/p\u003E\u003Cp\u003EIf you go into your BIOS/UEFI, you will very likely see a relevant setting. Each manufacturer tends to call things differently, but if you see 2133 somewhere, chances are you are in the right place.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T17:06:45Z\u0022 title=\u002210/30/2015 05:06  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-10-30T17:34:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI have a Pentium G3258 and it performs quite well when overclocked. In single thread applications like KSP it will keep up with higher end i5s and i7s at a fraction of the cost, currently it is the best choice for a KSPer on a modest budget as there\u0027s nothing at that price point that comes close. If you\u0027re doing very heavily threaded stuff an AMD might be better, but most games aren\u0027t that heavily threaded (and Intel\u0027s better IPC can make up for the core count to some degree).\u003Cp\u003ETechReport\u0027s rather glowing review: \u003Ca href=\u0022http://techreport.com/review/26735/overclocking-intel-pentium-g3258-anniversary-edition-processor\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://techreport.com/review/26735/overclocking-intel-pentium-g3258-anniversary-edition-processor\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHun. didn\u0027t know that.\u003C/p\u003E\n"}]}