{"TopicId":209425,"ForumId":32,"TopicTitle":"KSP1 Computer Building/Buying Megathread","CreatedByName":"Leonov","CreatedById":51498,"CreatedDateTime":"2013-04-20T02:28:51Z","PageNum":49,"Articles":[{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-06-30T20:16:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EYou didn\u0027t have a gtx-760 like me did you?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is a GTS 450, but I have read that more Nvidia cards are afflicted, as well as mobile chips.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlthough my full system crashes seem to have stopped since following your advice on thoroughly cleaning the drivers, I did get a display driver crash that was provoked the same way. As in basically doing nothing. I was watching Netflix and had KSP in the background. Seems that others have fixed the problem by going to an older driver or updating the card\u0027s BIOS if I remember correctly. Eh, at least with this bug I can still save everything and restart on my own terms.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid it do that once? The behaviour I observed was quite a bit more intrusive. Sometimes everything would continue functioning just fine, but on occasion screens would become irresponsive and turn black, prompting a reboot. Not as disastrous as a crash, but very annoying none the less. It seems to happen mostly with playing (Flash) movies in the browser and 3D gaming - so roughly anything accelerated - though I still cannot provoke the phenomena reliably.\u003C/p\u003E\u003Cp\u003EI hope I can fix it with the solutions others posted, as it seems that different things work for different people. For as far as its broken, rather than badly made.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-30T20:23:57Z\u0022 title=\u002206/30/2014 08:23  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 30, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-07-01T00:52:51Z","Content":"\n\u003Cp\u003EJust once so far if I take your question the right way. This latest time it flashed my screen and started acting funny, and just when I was SURE it was going to freeze the system again it snapped out of it but Windows appeared to be using the generic vga driver (I didn\u0027t actually go check). Video playback was a little glitchy, no aero etc, but everything still worked including KSP. Eh anyway I hope you get it fixed. These graphics card/driver problems are truly irritating... I just jokingly told myself I was going to buy a Mac and be done with it, but I\u0027d sooner eat my Kerbal figurine.\u003C/p\u003E\u003Cp\u003EIf I could find one that was both stable \u003Cem\u003Eand\u003C/em\u003E up to date I\u0027d go take out a small loan just to buy it, but unfortunately price doesn\u0027t seem to be entirely related with these. When I was playing around with Radeon cards I saw just as many people if not more complaining about the 280x (that I decided not to buy), as the 270x and 260x both of which I gave a whirl. But I don\u0027t recall any of the complaints involving fire, so maybe I didn\u0027t get the last laugh on that one.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-01T01:18:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EThese graphics card/driver problems are truly irritating... I just jokingly told myself I was going to buy a Mac and be done with it, but I\u0027d sooner eat my Kerbal figurine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe choice seems between frustration because it does not work properly, or frustration because it does work properly - but not in the way you want it. That and the fact that Macs are not impervious to errors and problems either, I have had my share of marbles of doom. Plus, of course, that some specialist programs are only available for Windows. Like it or not, I am stuck with Windows. \u003C/p\u003E\u003Cp\u003EBut I must admit I rather like Windows 8, if you give it a chance it is really pretty good. I sure do hope the rumours of Microsoft going back to a Windows 7 type setup with a classic start menu and no Metro menu are not true, I feel that would truly be a loss. It is sad when something good gets scrubbed because people can not get used to new things.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf I could find one that was both stable \u003Cem\u003Eand\u003C/em\u003E up to date I\u0027d go take out a small loan just to buy it, but unfortunately price doesn\u0027t seem to be entirely related with these. When I was playing around with Radeon cards I saw just as many people if not more complaining about the 280x (that I decided not to buy), as the 270x and 260x both of which I gave a whirl. But I don\u0027t recall any of the complaints involving fire, so maybe I didn\u0027t get the last laugh on that one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth the 280X and 270X seem to be good cards.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EYou were kidding about the loan, right?\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-07-01T01:54:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThe choice seems between frustration because it does not work properly, or frustration because it does work properly - but not in the way you want it. That and the fact that Macs are not impervious to errors and problems either, I have had my share of marbles of doom. Plus, of course, that some specialist programs are only available for Windows. Like it or not, I am stuck with Windows. \u003Cp\u003EBut I must admit I rather like Windows 8, if you give it a chance it is really pretty good. I sure do hope the rumours of Microsoft going back to a Windows 7 type setup with a classic start menu and no Metro menu are not true, I feel that would truly be a loss. It is sad when something good gets scrubbed because people can not get used to new things.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EYes very true. In fact I think the only reason people believe they work better is because they aren\u0027t able to do half the things we try to do which might bring a problem to the surface. Most gaming for example, or throwing together a bunch of parts that haven\u0027t necessarily been tested together then tweaking the settings in all of them... Not to even mention the lack of a real malware threat. But yes I\u0027m stuck too, at least on this computer. I do tend to run a Debian based Linux distro on whatever computer isn\u0027t my main one. I actually have KSP running decently on my old laptop with Mint. There\u0027s something to be said for an operating system you can mess with until you can\u0027t even tell what version it was with backports and forced installations of unsupported software, and it still run without a hitch for the most part. \u003Cp\u003EI agree 8 is nice once you get used to it. There are some things that need to be ironed out. For one I\u0027m not a fan of the big push towards everything being in the cloud these days -- by all means make it an option after the fact but please don\u0027t make it default and then you have to hunt around to disable it. But I think it has a lot of potential if people will stop grumbling about it being \u0022different\u0022. I mean really, if you don\u0027t like Metro it\u0027s not that hard to put the start menu back, there are several programs for it and some are free (the one from IOBit comes to mind). I helped my mom set up her new laptop with 8 on it and we did just that, now she doesn\u0027t have a quite as confused look on her face when she uses it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But I grumbled too at first and after thinking about it, it was time to change up the UI. It\u0027s been pretty much the same since NT4 / Win95 with most major changes being under the hood. I kept saying why not make it optional within Windows setup to run Metro or classic. Linux has GNOME, MATE, KDE, LXDE, XFCE, etc why can\u0027t Windows have just two options?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBoth the 280X and 270X seem to be good cards.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EYou were kidding about the loan, right?\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the 270x wasn\u0027t bad before the flaming incident. It did have some slightly off colors from what I was used to and some microstutter though. I looked at some real world comparisons and it appeared that the Radeon drivers do better at spiking the maximum framerate than keeping a steady one across the board. I actually didn\u0027t have any complaints about the 260x other than the obvious, it wasn\u0027t quite powerful enough for what I wanted. I was... half joking about the loan? Come on, tell me you wouldn\u0027t pay a crazy amount of money for a graphics card guaranteed to run perfectly and play everything for the next 7 years or so. I was just saying it seems that no matter what card you buy it\u0027s going to have some kind of inescapable irritating issue.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-01T01:57:10Z\u0022 title=\u002207/01/2014 01:57  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 1, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-01T03:53:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EI was... half joking about the loan? Come on, tell me you wouldn\u0027t pay a crazy amount of money for a graphics card guaranteed to run perfectly and play everything for the next 7 years or so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing is, the high end cards are not *that* much faster than the more economically priced ones. You are quite certainly not going to play games with it for 7 years. Top performers are a little more prone to defects and in one or two generations you will be stuck with a slow, hot and noisy card. You paid a bunch for it, so you will not get rid of it, yet much cheaper and less power hungry cards easily outperform it. It is the law of the handicap of a head start in all its glory. Unless you need the performance now, I always strongly advise against buying high end computer gear. Buying speed for the future simply does not work in computer land. If you have 700 dollar to spend you are better off with two 350 dollar cards or even three 200 dollar cards instead of a 700 dollar card. The latter will be fastest initially, but in a year or three you still have money to upgrade to a new card when buying the cheaper ones. It will certainly outperform the older, more expensive card at that point. On average, you will have more frames for more years.\u003C/p\u003E\u003Cp\u003EAnother things is that I think that taking out loans on anything but a house and education is generally ill advised. Especially so in the case of electronics, where the device often wears out before you make your last payment. If you wait a little while and save up your money will stretch that much further (because you do not pay interest), with the added bonus of preventing unnecessary impulse buys.\u003C/p\u003E\u003Cp\u003ESorry if I sound a bit preachy with that one, but I see people burning their fingers all the time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI was just saying it seems that no matter what card you buy it\u0027s going to have some kind of inescapable irritating issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you are right on the money with that one.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-07-01T19:50:26Z","Content":"\n\u003Cp\u003EI think you misunderstand me, that wasn\u0027t meant to be completely serious... I agree with everything you said wholeheartedly. I was more suggesting that if we lived in a world where it was possible to do that and not get horribly screwed, I would. The state of technology is much too volatile to spend money you can\u0027t afford to toss in the trash for the newer model in a couple years. This is why I waited a couple years before jumping on the smartphone / tablet bandwagon, and why I like to stick to upper-midrange parts at best although I do go for certain brand preferences depending on what it is.\u003C/p\u003E\u003Cp\u003EEdit: Well I guess you can scratch what I said before about my system crash, it just happened again. Sigh.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-02T03:56:39Z\u0022 title=\u002207/02/2014 03:56  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 2, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-02T12:34:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EI think you misunderstand me, that wasn\u0027t meant to be completely serious... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, a bit of a kneejerk reaction on my part there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Too many people make those mistakes: \u003Cem\u003EI want a computer that stays high-end for at least seven years, I will spend a lot of money on it to make that work\u003C/em\u003E. It usually takes quite a bit of convincing to make them understand they are just throwing away money.\u003C/p\u003E\u003Cp\u003ELooks like we have about the same attitude on the technological curve - I tend to buy most stuff on the edge between midrange and high-end. A lot of bang for your buck while being relatively affordable. I am done with buying cheap crap, but also need to spend my money wisely to stretch what I can do with it.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-07-02T17:15:15Z","Content":"\n\u003Cp\u003EIt\u0027s okay, I forget this is the Internet and you can\u0027t see my face, lol. Going by Moore\u0027s law you could expect to have a high end computer for a few months, but given the way they tend to release things I\u0027d give it a year or so before they come out with something that makes you feel silly for not \u0022waiting\u0022 which is pointless in itself. \u003C/p\u003E\u003Cp\u003EI know I\u0027ve felt that way. \u0022Well if I had just waited I could have got that discount, or this better item would have fallen into my price range.\u0022 Then I realize how deceiving that line of thought is because it never ends and I\u0027d rather have something than nothing. In reality I try to plan for my computer or x piece of technology to accomplish what I need it to do (within reason) for \u0022at least\u0022 2 years, but it\u0027s all relative I guess. \u003C/p\u003E\u003Cp\u003EYou\u0027re right though it\u0027s hard to get this concept through to people. I\u0027ve gotten the strangest looks when I tell someone that I can\u0027t magically make their computer do what they\u0027re asking of me. \u0022But I just bought it 4 years ago on sale, it\u0027s not even that old!\u0022 Okay well let\u0027s just upgrade everything but the case and hard drive, and then maybe you can play the newest COD... Those things are on sale for a reason, they\u0027re already a year out of date before you take it off the shelf! Frustrating, but what can you do?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-02T19:01:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EI know I\u0027ve felt that way. \u0022Well if I had just waited I could have got that discount, or this better item would have fallen into my price range.\u0022 Then I realize how deceiving that line of thought is because it never ends and I\u0027d rather have something than nothing. In reality I try to plan for my computer or x piece of technology to accomplish what I need it to do (within reason) for \u0022at least\u0022 2 years, but it\u0027s all relative I guess.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only thing I somewhat regret is not waiting for SSD\u0027s to be 1 dollar per GB before buying one. Within four months SSD\u0027s were a lot cheaper. On the other hand, I have had a lot of fun and good use out of it, so that is not that bad. It is just that I am used to a bit less write-off on my computer stuff. \u003C/p\u003E\u003Cp\u003EI expected to feel sorry about buying a Sandy Bridge since the next generation (Ivy) was only one or two months out and I really needed to buy a computer, but I never regretted that. Every generation after that was about efficiency and not raw speed, so when you overclock your system the new stuff is actually not that much faster than two generations back - if at all. On stock clocks every generation was an upgrade, but since they started messing with TIM rather than soldered IHS\u0027s overclocking has not been the same.\u003C/p\u003E\u003Cp\u003EThe only advantage I see in the new stuff are native USB3 ports, which may come in handy when booting from a stick. That is quite a minor thing though and generally can be worked around.\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-02T20:09:02Z","Content":"\n\u003Cp\u003EWhen you say that high end GPUs are to expensive for their value you have compare the price and performance of the whole pc and not just the GPU. Lets say you get 30% more performance if you pay 400 instead of 200 for the GPU. But when the other parts of the PC are 600 you get slightly more performance per money with the better GPU (only true when games are limited by GPU, not CPU, but most games are)...\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-02T21:03:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Elthy\u0022 data-cite=\u0022Elthy\u0022\u003E\u003Cdiv\u003EWhen you say that high end GPUs are to expensive for their value you have compare the price and performance of the whole pc and not just the GPU. Lets say you get 30% more performance if you pay 400 instead of 200 for the GPU. But when the other parts of the PC are 600 you get slightly more performance per money with the better GPU (only true when games are limited by GPU, not CPU, but most games are)...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, if you want maximum performance you should go for the pricey cards. But if you are more concerned with value for money and/or gaming is not the only reason you build a PC the high-end cards are really not worth the huge difference in price. I mean, you could almost buy two 280X\u0027s for one 290X, or three 270X\u0027s. Meanwhile, the difference in frame rate is going to be a lot more minimal. I can think of better ways of spending thpse 250-350 dollars that separate the 290X from the 280X. Add to that the previous comments of ending up with an old, expensive, hot and noisy cards and I feel high-end cards are hardly ever worth it. You\u0027d better save half of your money so you can buy that 380X or 480X when it is released. It will outperform the 290X, be cooler and you will have more frames on average. High-end cards just have shoddy value for money.\u003C/p\u003E\u003Cp\u003EAnd yes, a lot of people buy faster and more expensive processors than they actually need. Everyone wants an i7, but practically nobody actually needs one. That is barely a reason to buy an overly expensive card \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-03T08:36:47Z","Content":"\n\u003Cp\u003EWhat i tried to say is that even when you want high performance per spend money you can go for high end cards since the rising price isnt that big compared to the overall price of the pc.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-07-03T23:09:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Elthy\u0022 data-cite=\u0022Elthy\u0022\u003E\u003Cdiv\u003EWhat i tried to say is that even when you want high performance per spend money you can go for high end cards since the rising price isnt that big compared to the overall price of the pc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat depends on how you build your PC. An expensive card could almost double the price of a budget concious build, and that is with a decent processor like a i5. It boils down to the 80/20 percent rule: the first 80% of effect/performance are as easily achieved as the second 20%. That last bit of performance will cost you dearly.\u003C/p\u003E\u003Cp\u003EIt is also worth to note that an expensive GPU is pretty much good for gaming and not much else. More things are becoming hardware accelerated, but very few benefit from the added power of a high-end card. Meanwhile, a faster CPU, hard drive or enough RAM benefits pretty much every operation you do.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T23:39:31Z\u0022 title=\u002207/03/2014 11:39  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-07-04T22:08:30Z","Content":"\n\u003Cp\u003EWell, I\u0027m back, and I\u0027m typing this from my new computer. Everything seems to be working as it should, and KSP runs soooo smooth; it ran well on my laptop, but this...ahh, bliss \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, I do have a question. I got the GTX 760 in the end, but soon discovered that it has no VGA ports unlike my monitor, which has \u003Cem\u003Ejust\u003C/em\u003E VGA ports \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E. The 760 does have a DVI-I port amongst others and I chose to get an adapter for it, but I\u0027ve wound up with a DVI-A to VGA adapter for lack of better choice. My question is this;\u003Cstrong\u003E Would it be a good idea to get my hands on a DVI-I to VGA adapter instead of using the DVI-A adapter?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAlso, thanks again for the help earlier on guys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2014-07-05T10:36:36Z","Content":"\n\u003Cp\u003EHi, i would like some advice on choosing between two laptops since my current one seems to be fried. The first is a toshiba laptop with the following specs\u003C/p\u003E\u003Cp\u003Escreen 15.6\u0022 LED 1366 x 768 \u003C/p\u003E\u003Cp\u003Egraphics card nVidia GeForce GT 740M \u003C/p\u003E\u003Cp\u003Eprocessor Intel Core i7 3630QM 2.40 GHz \u003C/p\u003E\u003Cp\u003ERAM 4GB DDR3 up to 16 GB \u003C/p\u003E\u003Cp\u003EHDD 750 GB SATA 5400 rpm \u003C/p\u003E\u003Cp\u003Eand the second one is the Lenovo y510p\u003C/p\u003E\u003Cp\u003EProcessor:\u003C/p\u003E\u003Cp\u003EIntel Core i7\u003C/p\u003E\u003Cp\u003EI7-4700MQ\u003C/p\u003E\u003Cp\u003E2.40 Ghz\u003C/p\u003E\u003Cp\u003ERAM: 8 GB up to 16GB DDR3\u003C/p\u003E\u003Cp\u003EHDD: Hybrid HDD 1TB:\u003C/p\u003E\u003Cp\u003EGraphics card: Nvidia Geforce GT 750M\u003C/p\u003E\u003Cp\u003EIt will be a gaming laptop but it will also be used for daily use, my main concern is the graphics card when it comes to games, what will be the difference between these two graphics cards?\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-07-05T14:04:56Z","Content":"\n\u003Cp\u003EComputer building is very daunting for me, but I\u0027d love to build a proper gaming PC. Does anyone have any tips?\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2014-07-05T14:19:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RogueMason\u0022 data-cite=\u0022RogueMason\u0022\u003E\u003Cdiv\u003EWell, I\u0027m back, and I\u0027m typing this from my new computer. Everything seems to be working as it should, and KSP runs soooo smooth; it ran well on my laptop, but this...ahh, bliss \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EHowever, I do have a question. I got the GTX 760 in the end, but soon discovered that it has no VGA ports unlike my monitor, which has \u003Cem\u003Ejust\u003C/em\u003E VGA ports \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E. The 760 does have a DVI-I port amongst others and I chose to get an adapter for it, but I\u0027ve wound up with a DVI-A to VGA adapter for lack of better choice. My question is this;\u003Cstrong\u003E Would it be a good idea to get my hands on a DVI-I to VGA adapter instead of using the DVI-A adapter?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAlso, thanks again for the help earlier on guys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt least if the DVI adapter successfully transform DVI signals into VGA, its good enough\u003C/p\u003E\u003Cp\u003EQuestion: I\u0027m thinking about getting a graphics card that can be use as a drop-in replacement for my old Geforce 210, and I doesn\u0027t feel I want to change my PSU, as my brother will freak out if suddenly my PSU have a 600W rating because he thinks that it means the PC is always drawing 600W from the wall and he will argue with me about hibernation is the same as standby and consuming power\u003C/p\u003E\u003Cp\u003EYes, I do know that this is not true. But because I don\u0027t want to always argue for power efficiency and stuff, this is necessary\u003C/p\u003E\u003Cp\u003EAnd I do have a PC with that 600W PSU, its my mother\u0027s work PC with GTX 660 Ti, as its the only descent gaming PC that we have\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-05T14:28:26Z\u0022 title=\u002207/05/2014 02:28  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 5, 2014\u003C/time\u003E by Aghanim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-05T16:31:08Z","Content":"\n\u003Cp\u003E@kookoo_gr:\u003C/p\u003E\u003Cp\u003EThe problem is that the GT 740M and 750M come in lots of different versions (they even have other chips with the same name). To know what the differnece you have to tell us which chip, memory and clock the GPUs have. Also i want to point out that you shouldnt expect to much from these cards, you wont play modern games with more than minimum-medium graphics, not what i would consider gaming hardware...\u003C/p\u003E\u003Cp\u003E@Javster:\u003C/p\u003E\u003Cp\u003E1. Dont buy a complete PC, buy the parts and build it on your own (as easy as Lego).\u003C/p\u003E\u003Cp\u003E2. Ask someone to help you with the part selection. You could ask here or (better) in a big forum only about hardware from you country. Be sure to specifie budget and games you want to play.\u003C/p\u003E\u003Cp\u003E3. Dont rely on single opinions, read several tests about every part (dont buy untested parts except for the drive) and dont get caught in Nvidia/AMD Fanboy battles\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2014-07-05T17:42:27Z","Content":"\n\u003Cp\u003Ethanks for the info. Unfortunately the only info available for the GPUs from the official sites are that they have 2GB of RAM. I don\u0027t expect to play modern games to full graphics i am happy to play them at medium, heck i am pleased if the laptop can tun KSP at an acceptable degree (i know that KSP right now does not support multi threading) and these laptops are the closest thing to my budget, 900 euros and 1000 euros respectively.\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-05T17:47:26Z","Content":"\n\u003Cp\u003ESure that you need a laptop? A PC for 1000Ã¢â€šÂ¬ would be at least 2 times as good...\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2014-07-05T17:55:49Z","Content":"\n\u003Cp\u003EI would like to have a tabletop pc but i use a laptop for my astrophotography sessions as well\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-07-05T20:49:46Z","Content":"\n\u003Cp\u003EHow is this for a gaming computer? \u003Ca href=\u0022http://uk.pcpartpicker.com/p/P4C2bv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://uk.pcpartpicker.com/p/P4C2bv\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-05T22:54:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Javster\u0022 data-cite=\u0022Javster\u0022\u003E\u003Cdiv\u003EHow is this for a gaming computer? \u003Ca href=\u0022http://uk.pcpartpicker.com/p/P4C2bv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://uk.pcpartpicker.com/p/P4C2bv\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have a K-CPU and a good cooler but you choose only a B85 mainboard. If you want to overclock you should take a mainboard with Z87/Z97, if not you could take a cheaper i5 4XXX quadcore. Also your PSU is extremly overpowered, with that GPU you wont need more than 400W, even with overclocking.\u003C/p\u003E\u003Cp\u003EYou RAM is a problem, too. I would allways take RAM without a large heatsink, you wont need it and it just collides with most larger CPU-coolers (not sure about your choice). Also 16GB are quite much, there isnt a single game that requires that much (i doubt you will mod the 64bit KSP to that size). Since RAM is expensive these days i would rather spend the money for a better GPU or invest in a SSD.\u003C/p\u003E\u003Cp\u003EYour GPU is a bad choice, there is no sense in a 4GB GTX 760 since your will run out of processingpower when a game demands more than 2GB. I would go for a better GPU like the R9 280X which you can get for the same price. Also i would use a custom design since it will greatly reduce the noise, but i cant recommend one since im not completly up to date with noiselevels of recent customdesigns.\u003C/p\u003E\u003Cp\u003EI think you can get 1TB of storage for about 10 pound more, maybe you should think about that...\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-07-06T14:14:09Z","Content":"\n\u003Cp\u003EBudget is really important here, I want to keep the price as low as possible.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://uk.pcpartpicker.com/p/PkT4Bm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://uk.pcpartpicker.com/p/PkT4Bm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve followed the advice from the above post.\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-07-06T16:22:48Z","Content":"\n\u003Cp\u003EI would choose a better PSU, the one you selected has the worst efficency rating. One i recommend often for low budget is the BeQuiet PurePower L8 CM 430W, its 80\u002BBronze and has cable management which is imho a must.\u003C/p\u003E\u003Cp\u003EAlso i have no idea which games you want to play on which resolution, perhaps a lower price GPU is enough when you are short on money. And you could choose a cheaper CPU-cooler, the AlpenfÃƒÂ¶hn Brocken 2 and the Thermalright Macho are very good and cheaper. Or you dont buy a cooler at all, thats the cheapes but also loudest variant...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-06T16:26:13Z\u0022 title=\u002207/06/2014 04:26  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 6, 2014\u003C/time\u003E by Elthy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}