{"TopicId":20980,"ForumId":39,"TopicTitle":"Jebediah Kerman, First Kerbal on the Mun","CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-01T02:05:46Z","PageNum":1,"Articles":[{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-01T02:05:46Z","Content":"\n\u003Cp\u003EThis is a little story I wrote based on my first Mun landing in 0.17. Please give constructive criticism. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E Jebediah Kerman was the right stuff. He had guts, pride and years of training. Strenuous tests had led up to this moment, a lonely Kerbonaut, eyes glued to his window, the cratered Munar surface beneath him. A quarter of an orbit more and he would begin the de-orbit burn. The Kerbal Space Center had made it very clear that failure was not an option, and ensured that by picking a flat crater. Interesting geology would be saved for later missions, he was told. His thoughts were interrupted by the chatter of the Kerbal Space Center. The voice of CAPCOM came on. \u0022Uh... Jeb, we\u0027re going to need you to begin the de-orbit burn.\u0022 Jebidiah acknowledged this and eased the throttle to full. He read his velocity; 600...500...400...350. He cut the throttle. He undershot the landing site purposefully, it gave him extra margin for error. The voice came on the speaker again. \u0022Okay Jeb we\u0027re tracking ya... we need you to engage your reaction control system.\u0022 He flipped the switch, the ship responded with a large bang.\u003C/p\u003E\u003Cp\u003E Jebediah stared out of his window. He saw debris. He saw his precious RCS fuel spray out. He cursed. Something really, \u003Cem\u003Ereally\u003C/em\u003E, bad had happened. Jebidiah checked his course; the craft was headed for a small, rocky canyon. The voice came through the speaker; \u0022Jeb... we need you to abort...\u0022 Jebediah looked at his fuel levels. He wasn\u0027t going home either way. \u0022Jebediah, abort the mi-...\u0022 Jeb shut off his communications. He flicked on the radar altimeter, read his velocity, and gripped the throttle. Ten thousand meters up. He eased the throttle. 500...400...350...200...145. He was down to 100 meters per second, a manageable speed. He watched his altitude drop; 1000...850...400. He slowly oriented the ship with the retrograde marker. He wished he had more than the pod\u0027s RCS to use. His speed had dropped considerably. He cut the throttle. The ship drifted down to the surface. The landing legs depressed themselves into the Munar surface. He had landed.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJebediah stared out at the gray dunes around him. In front of him was a large gash in the surface; possibly from a meteor impact? He looked up and saw the bright stars around him. Behind him was his craft, which was his home until the next flight. The Kerbal Space Center had celebrated his landing, despite his disobedience. They had decided Jebidiah\u0027s landing spot would be perfect to begin the first Munar outpost, studying the exposed rock near the landing site. Jebidiah looked out to the east. He saw Kerbin. He covered the blue world up with his thumb. \u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EHe didn\u0027t feel like a giant. He felt very, very small. \u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-04T08:33:01Z\u0022 title=\u002210/04/2012 08:33  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 4, 2012\u003C/time\u003E by Nutt007\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-03T02:48:53Z","Content":"\n\u003Cp\u003ESo; thirty five readers, what are your thoughts? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(shameless bump)\u003C/p\u003E\n"},{"CreatedByName":"halocon720","CreatedById":34910,"CreatedDateTime":"2012-10-04T06:47:30Z","Content":"\n\u003Cp\u003EYou spelled Jebediah wrong. Just saying. Overall, good story.\u003C/p\u003E\n"},{"CreatedByName":"Grand Lander","CreatedById":31521,"CreatedDateTime":"2012-10-04T10:11:00Z","Content":"\n\u003Cp\u003EJust spell Jeb \u003C/p\u003E\u003Cp\u003EMakes it easier.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-04T14:44:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grand Lander\u0022 data-cite=\u0022Grand Lander\u0022\u003E\u003Cdiv\u003EJust spell Jeb \u003Cp\u003EMakes it easier.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA lone Kerbonaut inched down the ladder. His large eyes fixed to the Munar regolith below. The sun gloriously reflecting off his golden visor as he triumphantly pressed his foot into the soil. His name was Jeb.\u003C/p\u003E\u003Cp\u003ENo back story.\u003C/p\u003E\u003Cp\u003ENo full name\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t make him feel like a real character.\u003C/p\u003E\u003Cp\u003EHe is Jebediah Kerman and he will stay that way.\u003C/p\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2012-10-04T15:30:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nutt007\u0022 data-cite=\u0022Nutt007\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENo back story.\u003C/p\u003E\u003Cp\u003ENo full name\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t make him feel like a real character.\u003C/p\u003E\u003Cp\u003EHe is Jebediah Kerman and he will stay that way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow about this? \u003C/p\u003E\u003Cp\u003EA lone Kerbonaut inched down the ladder. His large eyes fixed to the Munar regolith below. The sun gloriously reflecting off his golden visor as he triumphantly pressed his foot into the soil. To the future generation of young Kerbals, he was known as Jeb Kerman, the first Kerbal on the Mun, \u0022Jeb\u0022 was in fact Jebediah Kerman, an ace pilot and known daredevil.\u003C/p\u003E\n"}]}