{"TopicId":210028,"ForumId":16,"TopicTitle":"Attaching subassemblies to assembly in VAB","CreatedByName":"stewake1306","CreatedById":223162,"CreatedDateTime":"2022-10-08T01:23:22Z","PageNum":1,"Articles":[{"CreatedByName":"stewake1306","CreatedById":223162,"CreatedDateTime":"2022-10-08T01:23:23Z","Content":"\n\u003Cp\u003E\nI am starting to use subassemblies, but I can never attach them to my main assembly. I am trying to do a geostationary network and launch all satellites in one launch.\n\u003C/p\u003E\n\u003Cp\u003E\nThe bottom of my subassembly is a terrier engine, and I want to attach it to a radial decoupler. If I pull out a terrier engine alone, I can attach it to my radial decoupler no problem. But when I pull my subassembly out, I cannot attach it in the same method. the only spot I can attach it is the top of the probe core, which cause a ton of interference on other parts.\n\u003C/p\u003E\n\u003Cp\u003E\nAm I missing something when creating or pulling in subassemblies? All my attachment points on the subassembly (including lets say a docking port) do not attach to my main assembly and remain red/transparent.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-10-08T07:56:43Z","Content":"\n\u003Cp\u003E\nSubassemblies can only be attached by their root part when you use them. Try re-rooting the subassembly to the part you want to attach it by (which can make it follow the wrong part after stage separation), or attach it with the current root part and then use the move and rotate tools to position it where you want it.\n\u003C/p\u003E\n"},{"CreatedByName":"Poppa Wheelie","CreatedById":218525,"CreatedDateTime":"2022-10-08T14:51:52Z","Content":"\n\u003Cp\u003E\nHere\u0027s how to re-root the subassembly on PC (I don\u0027t know about console): \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nWhile your mouse still has \u0022control\u0022 of the subassembly, press 4\n\u003C/li\u003E\n\u003Cli\u003E\nNow left click the part that you want to be the new root part of the subassembly\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nYou should now be able to attach the subassembly at the point (part) that you wanted.\n\u003C/p\u003E\n"}]}