{"TopicId":210533,"ForumId":112,"TopicTitle":"Options to proliferate mod creation for KSP2 modding comunity","CreatedByName":"MrFancyPL","CreatedById":94843,"CreatedDateTime":"2022-11-09T16:51:21Z","PageNum":1,"Articles":[{"CreatedByName":"MrFancyPL","CreatedById":94843,"CreatedDateTime":"2022-11-09T16:51:22Z","Content":"\n\u003Cp\u003E\n   One of the biggest goals that devs set for KSP2 is accessibility. I agree, learning curve in original KSP game was pretty steep, and without YT or this forum it would be even steeper. One thing I am afraid that it\u0027s curve will remain steep compared to KSP is mod creation. KSP is a landscape of art made by many people, and before version 1.12.3 it was everchanging, so naturally certain code, and artstyle inside game were evolving. The result of that state of things were many attempts to make tutorial series about mod creation, that were soon doomed by obsoletion.\n\u003C/p\u003E\n\u003Cp\u003E\n   KSP 2 will also come through that same evolution mechanism that original game did via Early Access, but this time game is made by people having much deeper understanding in fields they work in. After Early Access, we may suspect that most changes to the game will be based on the code created and tested earlier, so base of the game will be less susceptible to change. This will also apply to the style of the game, since this time it is more uniform and planned.\u003Cbr\u003E\n\u003Cbr\u003E\n   Therefore, I suggest creation of the modding tutorial by devs. I fully realise, this is quite heavy request, both in time and effort, but in my opinion it can really help in setting the bar for other modding communities. Here are the topics I believe that are worth mentioning\n\u003C/p\u003E\n\u003Cp\u003E\n-modelling\u003Cbr\u003E\n-texturing and animation\u003Cbr\u003E\n-rigging\u003Cbr\u003E\n-unity import\u003Cbr\u003E\n-troubleshooting\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E   \u003C/span\u003EWhile i fully understand chances to put this idea to life are bleak, and community probably could handle creation of tutorials by themselves, I belive there are other things that KSP2 authors to do to aid in creation of mods, not only for newbie, but also for advanced modders. Here is listed what I mean by that:\n\u003C/p\u003E\n\u003Cp\u003E\n- better access to code in general (e.g. ablility to not only access Kerbals suit textures, but also their rigs, mesh and so on. It will make creating animations, suit, helmet and accessory much easier. I think it could in this way, in which community wouldn’t infringe any licensing of the game.)\n\u003C/p\u003E\n\u003Cp\u003E\n-creation of set of standards of 3d models, texturing and animations, to create art. More uniform (texture resolution and density, color pallettes, polygon counts, possibly lod levels for parts, file in universal 3d mesh format that contains shapes of profiles used by parts, size of fillets/bevels to keep them consistent, other data that could aid in texturing such as levels of specular map for different materials.). Good job in this spirit was done in the Restock wiki on GitHub, but I believe it could be expanded. I don’t believe all mods should ‘stockalike’, variation in art is sometimes necessary to make it stand out, but standards could help beginning mod creators to create better stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n-toolbox for modders – it kind of overlaps with last point, but could be expanded.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease join the discussion, or add other ideas below. Thanks in advance.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-12T19:53:58Z\u0022 title=\u002211/12/2022 07:53  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 12, 2022\u003C/time\u003E by MrFancyPL\u003C/strong\u003E\n\u003Cbr\u003Egrammar\n\u003C/span\u003E\n"}]}