{"TopicId":210762,"ForumId":112,"TopicTitle":"Planets should get their own music","CreatedByName":"GeoStorm81","CreatedById":223927,"CreatedDateTime":"2022-11-24T15:11:52Z","PageNum":1,"Articles":[{"CreatedByName":"GeoStorm81","CreatedById":223927,"CreatedDateTime":"2022-11-24T15:11:52Z","Content":"\n\u003Cp\u003E\nIt would be really cool if each planet had its own soundtrack or at least a motif or a variant of the original (such as adding chimes for Eeloo or whooshing sounds for Jool). It would give each planet a lot more character and make rover drives a little less tedious! I know it\u0027d be pretty hard, but somewhere in the future it could be added hopefully.\n\u003C/p\u003E\n"},{"CreatedByName":"AstroWolfie","CreatedById":223932,"CreatedDateTime":"2022-11-24T18:20:21Z","Content":"\n\u003Cp\u003E\nthat is very cool! I would like to see this in the game.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal123_Furry","CreatedById":222628,"CreatedDateTime":"2022-11-24T23:44:40Z","Content":"\n\u003Cp\u003E\nYES!\n\u003C/p\u003E\n\u003Cp\u003E\nWe need more environmental sounds and planet‘s own music to render the \u0022base mood\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-11-25T00:01:42Z","Content":"\n\u003Cp\u003E\nThis is actually a really good idea. Jool would almost certainly have the heaviest, deepest sound. Think large booming drums, tuba, bass. I\u0027d also suggest that whatever instruments are used for Jool itself should be reused for Jool\u0027s moons, maybe adding a new instrument here and there.\n\u003C/p\u003E\n\u003Cp\u003E\nTo take this idea even further, the heavier sounds should be present when Jool is in the sky. If it is not in the sky, then such sounds are either muted or absent entirely.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal123_Furry","CreatedById":222628,"CreatedDateTime":"2022-11-25T04:11:44Z","Content":"\n\u003Cp\u003E\nAlso on Kerbin, music will lighter, played by guitar like \u003Cem\u003ETimber Hearth\u003C/em\u003E in Outer wilds?\n\u003C/p\u003E\n\u003Cp\u003E\nAs on Eve, music could be like the nether in \u003Cem\u003EMinecraft\u003C/em\u003E(eg \u003Cem\u003EConcrete Halls\u003C/em\u003E, \u003Cem\u003EDead Voxel\u003C/em\u003E), deep, low, just like its atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe even have some music for special events? Such as aerobraking near kerbin, driving a plane on laythe, or visiting your colonies?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jen X-1","CreatedById":223751,"CreatedDateTime":"2022-11-25T21:14:41Z","Content":"\n\u003Cp\u003E\nI doubt this will be a thing, but for those of you who’ve played Little Big Planet, you might know that the music was interactive.\n\u003C/p\u003E\n\u003Cp\u003E\nSo as the player progresses through a level, different tracks in the song would play. In the first wilderness level, there would at first be like a harp and a glockenspiel or something, but as the sack person walks into the icy cave, the bass track fades in. Then the icicles start falling while enemies approach, and there’s now a choir and strings playing.\n\u003C/p\u003E\n\u003Cp\u003E\nSo a possibility is for music similar to this being implemented in KSP2. And I think Simple Rockets 2 has something like that too, where different tracks will play depending on what’s happening to the craft, like flying low above the terrain will make the music seem a bit more stressful. I have no clue whether the OST will include interactive music, but either way, I know Howard Mostrom’s the right guy for the job, and what I’ve heard so far sounds wonderful.\n\u003C/p\u003E\n"},{"CreatedByName":"Nazalassa","CreatedById":217956,"CreatedDateTime":"2022-11-26T11:17:57Z","Content":"\n\u003Cp\u003E\nProcedural music!\n\u003C/p\u003E\n"},{"CreatedByName":"salaminho","CreatedById":217180,"CreatedDateTime":"2022-11-26T16:54:56Z","Content":"\n\u003Cp\u003E\nGreat idea! In that scenario the hellish landscapes of Charr will probably have a heavy metal vibe.\n\u003C/p\u003E\n"},{"CreatedByName":"Wubslin","CreatedById":209472,"CreatedDateTime":"2022-11-26T23:41:29Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/Nz0b4STz1lo?feature=oembed\u0022 title=\u0022Gustav Holst - The Planets - Jupiter, the Bringer of Jollity\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-11-27T00:50:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203093\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669506089\u0022 data-ipsquote-userid=\u0022209472\u0022 data-ipsquote-username=\u0022Wubslin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Wubslin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/Nz0b4STz1lo?feature=oembed\u0022 title=\u0022Gustav Holst - The Planets - Jupiter, the Bringer of Jollity\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGustav Holst\u0027s planets suite was actually based on the planets as gods and concepts instead of physical locations. Honestly, I don\u0027t believe using them as representations of the physical places works anyway. People only do it because it\u0027s well-known\n\u003C/p\u003E\n"},{"CreatedByName":"Wubslin","CreatedById":209472,"CreatedDateTime":"2022-11-27T07:16:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203117\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669510222\u0022 data-ipsquote-userid=\u0022209738\u0022 data-ipsquote-username=\u0022intelliCom\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, intelliCom said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGustav Holst\u0027s planets suite was actually based on the planets as gods and concepts instead of physical locations. Honestly, I don\u0027t believe using them as representations of the physical places works anyway. People only do it because it\u0027s well-known\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI dunno, that particular piece is about as magnificent as the planet itself is. And have you \u003Cem\u003Eheard \u003C/em\u003EMars?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pia21974.0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://cdn.vox-cdn.com/thumbor/J85lBLditBHKUEguiZh8rPEmWqg=/0x0:3805x1288/1200x675/filters:focal(1599x340:2207x948)/cdn.vox-cdn.com/uploads/chorus_image/image/59799667/pia21974.0.jpg\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-11-27T07:19:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203197\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669533394\u0022 data-ipsquote-userid=\u0022209472\u0022 data-ipsquote-username=\u0022Wubslin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Wubslin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd have you \u003Cem\u003Eheard \u003C/em\u003EMars?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA bit overdramatic for a planet whose environment isn\u0027t much tougher on equipment than the Saharan desert, I feel.\n\u003C/p\u003E\n"},{"CreatedByName":"Nazalassa","CreatedById":217956,"CreatedDateTime":"2022-11-27T09:57:53Z","Content":"\n\u003Cp\u003E\nMaybe having small sections of midi music, with different feels, etc. and the game decides which one to play and can dynamically apply \u0022modifiers\u0022 so that, for example, a music gets more and more fast as you accelerate towards an escape trajectory...\n\u003C/p\u003E\n"},{"CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-11-27T12:16:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203214\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669543073\u0022 data-ipsquote-userid=\u0022217956\u0022 data-ipsquote-username=\u0022Nazalassa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Nazalassa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe having small sections of midi music, with different feels, etc. and the game decides which one to play and can dynamically apply \u0022modifiers\u0022 so that, for example, a music gets more and more fast as you accelerate towards an escape trajectory...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like the idea, but unfortunately change in tempo doesn\u0027t always work well, especially when it happens all the time. Also, trying to have music working with how your spacecraft is moving would be quite technical and unreliable, given how unpredictable player input could be. The player could decide to immediately flip their ship 180 degrees mid-burn. Also... \u003Cem\u003EMIDI?\u003C/em\u003E Like, Doom MIDI? Skrillex-Scary-Monsters-and-Nice-Sprites-as-a-MIDI kind of MIDI?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a modern video game. They\u0027d obviously use proper compositions. I\u0027m certainly for dynamic music, but don\u0027t fragment that dynamic music into too many conditions and situations.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203197\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669533394\u0022 data-ipsquote-userid=\u0022209472\u0022 data-ipsquote-username=\u0022Wubslin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Wubslin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI dunno, that particular piece is about as magnificent as the planet itself is. And have you \u003Cem\u003Eheard \u003C/em\u003EMars?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://cdn.vox-cdn.com/thumbor/J85lBLditBHKUEguiZh8rPEmWqg=/0x0:3805x1288/1200x675/filters:focal(1599x340:2207x948)/cdn.vox-cdn.com/uploads/chorus_image/image/59799667/pia21974.0.jpg\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022pia21974.0.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://cdn.vox-cdn.com/thumbor/J85lBLditBHKUEguiZh8rPEmWqg=/0x0:3805x1288/1200x675/filters:focal(1599x340:2207x948)/cdn.vox-cdn.com/uploads/chorus_image/image/59799667/pia21974.0.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh, yes. \u003Cem\u003EMars\u003C/em\u003E. A \u003Cu\u003Ewarlike\u003C/u\u003E theme for an extremely dead, desolate, quiet and cold planet. How fitting\u003Cem\u003E.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will say again: the planets suite was made for the planets as \u003Cu\u003EGods\u003C/u\u003E of their own theming, not as celestial bodies.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Jupiter in that suite doesn\u0027t demonstrate Jupiter\u0027s whiplash-inducing wind speeds... or crushing air pressure... or brutal gravity... or its extreme radiation belts. If Gustav Holst\u0027s \u0027Jupiter\u0027 is an accurate depiction of Jupiter as a place, I\u0027d probably want to go there for a holiday, gliding on its clouds wearing tourist clothes as if I were gliding at Rio de Janeiro.\n\u003C/p\u003E\n\u003Cp\u003E\nYou know what? Let\u0027s do this for all the planets. I\u0027m feeling real petty today and this\u0027ll be a fun exercise.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#27ae60;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E= All Planets in the Gustav Holst Suite Briefly Compared to Celestial Bodies of the Same Name =\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\nKeep in mind that I do like Gustav Holst\u0027s planets suite; it played a big part in shaping the film soundtracks of today, and Holst\u0027s masterful skill is nothing to sniff at. This is exclusively focusing on the suite\u0027s relevance to space.\u003Cbr\u003E\nGustav Holst himself did not want this association, and I believe the original, mythology-centric association should be the accepted one.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u0022Mercury, the Winged Messenger\u0022 is whimsical and flightful. A heavily cratered planet made of iron sure strikes the \u0022whimsical\u0022 nature.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Venus, Bringer of Peace\u0022 sounds peaceful, kind, loving. I\u0027m not sure what\u0027s so peaceful or kind or loving about 400 degree temperatures, volcanic activity, Venusian days lasting hundreds of Earth days, and 94 atmospheres of pressure.\n\u003C/li\u003E\n\u003Cli\u003E\nEarth is not present, as it would not be considered a planet under the mythological definition.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Mars, Bringer of War\u0022 is quite heavy, booming, and violent. Despite its strength, its orderly; almost militaristic. Unless we\u0027re talking about an army of craters, rocks, and hills, I fail to see the relation.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Jupiter, Bringer of Jollity\u0022 is quite adventurous, something I\u0027d expect to hear in Lord of the Rings. Venturing into Jupiter, you\u0027d certainly have an adventure \u003Cem\u003Ein pain\u003C/em\u003E with the aforementioned wind speeds, air pressure, and gravity. If you avoid the atmosphere, then you\u0027re getting bombarded by lifespan-reducing radiation. Pick your poison.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Saturn, Bringer of Old Age\u0022 is probably the only case where a relation to space would be present. Its beginning is eerie. Peaceful, sure, but more cold than kind. (I might have bias here since it was used for the intro of Alien) That being said, Saturn itself doesn\u0027t really have much relation to how this sounds, unfortunately. Besides, the track later turns into a far less space-related symphony, becoming grand like Jupiter was.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Uranus, the Magician\u0022 starts mischievous and becomes grand. Given its name, I\u0027m primed to imagine a magic show. I guess if you flew a spacecraft into its atmosphere, it sure would disappear.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Neptune, the Mystic\u0022. Wise, suspenseful, but with a clear sense of good will. Descending into its atmosphere would be suspenseful as you experience more and more turbulence... then the suspense would turn to panic as your spacecraft gets thrown around in the harsh winds like a dog with a toy.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI\u0027m sorry, but Gustav Holst\u0027s suite \u003Cu\u003Edoes not represent the planets as physical places\u003C/u\u003E. I wish there were a proper album that does depict space in its true harshness and brutality, so whenever someone says that Gustav Holst\u0027s The Planets is about the celestial bodies, I can refer them to said album so they hopefully change their mind.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that being said, I don\u0027t mind the use of the Planets Suite for representing humanity\u0027s progress in spaceflight. Jupiter would be great for the launch/landing of Apollo 11. (Yes, a \u003Cem\u003ESaturn \u003C/em\u003EV rocket, but that starts too eerie.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-28T01:21:02Z\u0022 title=\u002211/28/2022 01:21  AM\u0022 data-short=\u00221 yr\u0022\u003ENovember 28, 2022\u003C/time\u003E by intelliCom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wubslin","CreatedById":209472,"CreatedDateTime":"2022-11-29T18:09:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224203251\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669551407\u0022 data-ipsquote-userid=\u0022209738\u0022 data-ipsquote-username=\u0022intelliCom\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/27/2022 at 7:16 AM, intelliCom said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Jupiter, Bringer of Jollity\u0022 is quite adventurous, something I\u0027d expect to hear in Lord of the Rings. Venturing into Jupiter, you\u0027d certainly have an adventure \u003Cem\u003Ein pain\u003C/em\u003E with the aforementioned wind speeds, air pressure, and gravity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAccording to my precise calculations, please go outside. \n\u003C/p\u003E\n"},{"CreatedByName":"Minmus Taster","CreatedById":206159,"CreatedDateTime":"2022-11-29T20:12:55Z","Content":"\n\u003Cp\u003E\nI really love the idea of planets getting themes but I doubt it will happen in stock for at least a bit. There was a mod for the first game that did this to an extent and it\u0027s incredible, just imagine what KSP2 could do if it did something like this at some point. Additionally moons could get something like a small tune, like if you go to Mun you\u0027d hear a bit a Kerbins music but with some new stuff to mix into the new theme (because trying to make a theme for everything down to asteroid moons would be insane).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d Imagine Kerbin having a soft-familiar tone until you go to Minmus or go into a distant orbit where it gets distorted and fractured until it\u0027s just a sad backround tun mixing into the music for solar orbit which would be a cold unfamiliar tune that gives you a sense of the distances your traveling, like the spaced out notes you hear in the soundtrack for Interstellar. Speaking of interstellar I\u0027d imagine that that would just be a drone to communicate the complete void the player is currently inside.\n\u003C/p\u003E\n"},{"CreatedByName":"whatsEJstandfor","CreatedById":220814,"CreatedDateTime":"2022-11-29T20:30:34Z","Content":"\n\u003Cp\u003E\nI refuse to believe that jollity is a word. Miss me with that nonsense, Holst\n\u003C/p\u003E\n"},{"CreatedByName":"Nazalassa","CreatedById":217956,"CreatedDateTime":"2022-11-29T20:47:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204110\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669752775\u0022 data-ipsquote-userid=\u0022206159\u0022 data-ipsquote-username=\u0022Minmus Taster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, Minmus Taster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere was a mod for the first game that did this to an extent and it\u0027s incredible\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m interested, which one is it?\n\u003C/p\u003E\n"},{"CreatedByName":"Minmus Taster","CreatedById":206159,"CreatedDateTime":"2022-11-29T21:51:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204130\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669754851\u0022 data-ipsquote-userid=\u0022217956\u0022 data-ipsquote-username=\u0022Nazalassa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Nazalassa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m interested, which one is it?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022130898\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8681383704\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/194039-19x-ksp-original-score-project-over-2-hours-of-music-for-ksp/\u0026amp;do=embed\u0022 style=\u0022height:197px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"poopslayer78","CreatedById":212496,"CreatedDateTime":"2022-11-30T02:25:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204110\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669752775\u0022 data-ipsquote-userid=\u0022206159\u0022 data-ipsquote-username=\u0022Minmus Taster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Minmus Taster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really love the idea of planets getting themes but I doubt it will happen in stock for at least a bit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know... there is at least one dedicated composer for KSP2 (can\u0027t remember where this was confirmed, but I believe it\u0027s been mentioned briefly in a feature video and somewhere on the forums).  With a dedicated composer, it seems feasible that KSP2 could have unique/themed music for each celestial body.  Even if tracks aren\u0027t tied to locations, I think it\u0027s safe to expect multiple high-quality soundtracks with this game.\n\u003C/p\u003E\n"},{"CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-11-30T02:50:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204065\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669745355\u0022 data-ipsquote-userid=\u0022209472\u0022 data-ipsquote-username=\u0022Wubslin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Wubslin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAccording to my precise calculations, please go outside. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGustav Holst\u0027s Planets Suite does not work in representing the celestial bodies. I rest my case.\n\u003C/p\u003E\n"},{"CreatedByName":"Catto","CreatedById":137773,"CreatedDateTime":"2022-11-30T05:33:24Z","Content":"\n\u003Cp\u003E\nlapat should have like rainforest music, like birds chirping and bongos\n\u003C/p\u003E\n"},{"CreatedByName":"Minmus Taster","CreatedById":206159,"CreatedDateTime":"2022-11-30T13:31:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204296\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669786404\u0022 data-ipsquote-userid=\u0022137773\u0022 data-ipsquote-username=\u0022Catto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Catto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlapat should have like rainforest music, like birds chirping and bongos\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI doubt Lapat is gonna have anything in common with a rainforest considering what we have seen of it, wouldn\u0027t make sense to have just another Kerbin, that would be too easy. It\u0027s probably a desert-like planet given this shot of it from the air;\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qJuvVt5.png\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qJuvVt5.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine it having a theme with some elements of Kerbins theme (like made with similar instruments) but with a different vibe, perhaps something somber considering it\u0027s probably in the second system which is theorized to be an older one.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-30T13:35:38Z\u0022 title=\u002211/30/2022 01:35  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 30, 2022\u003C/time\u003E by Minmus Taster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Catto","CreatedById":137773,"CreatedDateTime":"2022-11-30T15:22:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204362\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669815099\u0022 data-ipsquote-userid=\u0022206159\u0022 data-ipsquote-username=\u0022Minmus Taster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Minmus Taster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI doubt Lapat is gonna have anything in common with a rainforest considering what we have seen of it, wouldn\u0027t make sense to have just another Kerbin, that would be too easy. It\u0027s probably a desert-like planet given this shot of it from the air;\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/qJuvVt5.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022qJuvVt5.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qJuvVt5.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine it having a theme with some elements of Kerbins theme (like made with similar instruments) but with a different vibe, perhaps something somber considering it\u0027s probably in the second system which is theorized to be an older one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh nononnoo\n\u003C/p\u003E\n\u003Cp\u003E\nif it\u0027s a desert planet it needs like, middle eastern music\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2022-11-30T15:50:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224204362\u0022 data-ipsquote-contentid=\u0022210762\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669815099\u0022 data-ipsquote-userid=\u0022206159\u0022 data-ipsquote-username=\u0022Minmus Taster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Minmus Taster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI doubt Lapat is gonna have anything in common with a rainforest considering what we have seen of it, wouldn\u0027t make sense to have just another Kerbin, that would be too easy. It\u0027s probably a desert-like planet given this shot of it from the air;\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/qJuvVt5.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u0022qJuvVt5.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qJuvVt5.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine it having a theme with some elements of Kerbins theme (like made with similar instruments) but with a different vibe, perhaps something somber considering it\u0027s probably in the second system which is theorized to be an older one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought Lapat was supposed to be younger than Kerbin.  Not sure where I got that.  Like maybe there is cellular life in the oceans, but nothing on land phase\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe I\u0027m thinking of the other that stays with \u0022G\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-30T15:51:22Z\u0022 title=\u002211/30/2022 03:51  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 30, 2022\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"}]}