{"TopicId":211001,"ForumId":112,"TopicTitle":"Tri-propellant rocket engines","CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-10T17:25:08Z","PageNum":1,"Articles":[{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-10T17:25:08Z","Content":"\n\u003Cp\u003E\nTripropellant engines are theoretically the most efficient chemical rockets in existence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERocketdyne made an engine in the 1960s that used gaseous hydrogen, liquid fluorine and liquid lithium that resulted in incredible 542 Isp. But they are not free of problems, obviously. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHeating lithium to become liquid is not exactly easy, and storing and injecting solid grains into a combustion chamber would be extremely problematic (if not impossible due to backfiring).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere are two types of tripropellant engines:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027, Times, serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003ESequential burning\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA sequential firing rocket would be something like a half-stage, only difference is that nothing is thrown away - you \u003Cem\u003Echange the fuel \u003C/em\u003Emid-flight. \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s call an engine by the name KS-325.\n\u003C/p\u003E\n\u003Cp\u003E\nKS-325 is RP-1 and LH2 compatible engine and LOX as an oxidizer. It is possible to switch between LH2 and RP-1 mid-flight. At launch, RP-1 will be the fuel used, as its higher density only offers advantages for first stages. When RP-1 ends, it will burn hydrogen, being better for upper stages.\n\u003C/p\u003E\n\u003Cp\u003E\nAll this while \u003Cem\u003Eusing the exact same engine. \u003C/em\u003EThis offers obvious advantages for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E. if the KS-325 has an extendable nozzle, this would probably be one of the best engines for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E with chemical engines. However, it still has disadvantages...\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket would have to be insanely tall to store all the Hydrogen, RP-1 and the insane amount of LOX it would need.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only new part that would need to be added would be the engine, since hydrogen tanks are already confirmed (Nerv and  NERV-US will use them) and RP-1/LOX will obviously be added.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the most likely one that would be added to the game, considering there are multiple engines that already have mode switches (e.g Panther jet engine). and NERV-US operates in a very similar way,  only needed changes will the fuels, performance and model of a NERV-US\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027, Times, serif;\u0022\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003ESimultaneous burning\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBasically it\u0027s injecting a third fuel into the combustion chamber. The hydrogen-fluor-lithium engine mentioned at the beginning is this type of engine.\n\u003C/p\u003E\n\u003Cp\u003E\nThis type of motor can theoretically achieve very high efficiencies, but as theory is not reality, injecting room temperature solids or high temperature liquids is not exactly viable. And making an engine that injects two \u0022normal\u0022 fuels would have no advantage compared to sequential injection engines. \u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere are several other problems that will certainly not be simulated in KSP, such as how to maintain the necessary high temperature.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOne suggestion of mine would be to use rubidium instead of lithium, which has a much lower melting point, only 39°C. It would be much more realistic, but I don\u0027t know if it would be highly efficient - after all, this combination has never been tested.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest problem with adding these engine to KSP would be having to create new parts. Things that difficult development should be avoided unless it\u0027s really worth it. That\u0027s why I suggest that only the engine that burns sequentially be added, since only one new engine would need to be added, and the \u0022programming\u0022 of this engine has already been done even in KSP1, with the RAPIER, so overall it would only need to be added a new model, and a change in resource used.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo that\u0027s it, I\u0027ll probably write another thread about my ideas on the science \u0026amp; spaceflight topic, where I can write the scientific part (my favorite) more deeply. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Eso yeah, see you guys later.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAny criticism of this idea is welcome, I want to know my problems\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2022-12-10T20:47:29Z","Content":"\n\u003Cp\u003E\nI like especially LH2-RP1-LOX engine, I believe it will fit in game like NERV-US. About techic difficultes of creation another tri-propellant engines I have answer - technologies of future, new future materials and methods\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-12-10T22:59:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207378\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670693108\u0022 data-ipsquote-userid=\u0022223402\u0022 data-ipsquote-username=\u0022Dragorans\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Dragorans said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOne suggestion of mine would be to use rubidium instead of lithium, which has a much lower melting point, only 39°C. \u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTerrible idea, for the simple reason that rubidium has a really high atomic mass (85) compared to lithium (7) and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E is determined by exhaust velocity, which decreases with increasing molecular mass. It\u0027s also a lot less reactive than lithium, which will readily shrug off that extra electron and hence makes for a really energetic rocket propellant when combined with fluorine which just can\u0027t wait to get hold of said extra electron. Lithium\u0027s use in batteries, fluorine\u0027s toxicity and the logistics of trying to keep both liquid in close proximity when fluorine boils at several hundred Kelvin below lithium\u0027s melting point, not to mention the hydrogen fluoride (a.k.a. hydrofluoric acid) produced as a byproduct, are just some reasons why this was A Bad Idea and, like boranes and chlorine polyfluorides, best left in the history books.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other engine you\u0027re describing sounds like the RD-701, a rocket engine designed for the MAKS spaceplane in the late 80s. It would burn both kerosene and hydrogen in the atmosphere for maximum thrust, then switch to just hydrogen once in space for maximum efficiency (switching off the kerosene turbopump but leaving the hydrogen one running as it had separate pumps for each fuel). The result was better efficiency than plain kerolox and better thrust than plain hydrolox, plus a denser propellant mix meaning smaller tanks were needed- useful for a spaceplane where larger tanks mean more wing and more thermal shielding are needed.\n\u003C/p\u003E\n"},{"CreatedByName":"yoarebignoob","CreatedById":221139,"CreatedDateTime":"2022-12-10T23:32:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207492\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670713157\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTerrible idea, for the simple reason that rubidium has a really high atomic mass (85) compared to lithium (7) and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E is determined by exhaust velocity, which decreases with increasing molecular mass. It\u0027s also a lot less reactive than lithium, which will readily shrug off that extra electron and hence makes for a really energetic rocket propellant when combined with fluorine which just can\u0027t wait to get hold of said extra electron. Lithium\u0027s use in batteries, fluorine\u0027s toxicity and the logistics of trying to keep both liquid in close proximity when fluorine boils at several hundred Kelvin below lithium\u0027s melting point, not to mention the hydrogen fluoride (a.k.a. hydrofluoric acid) produced as a byproduct, are just some reasons why this was A Bad Idea and, like boranes and chlorine polyfluorides, best left in the history books.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other engine you\u0027re describing sounds like the RD-701, a rocket engine designed for the MAKS spaceplane in the late 80s. It would burn both kerosene and hydrogen in the atmosphere for maximum thrust, then switch to just hydrogen once in space for maximum efficiency (switching off the kerosene turbopump but leaving the hydrogen one running as it had separate pumps for each fuel). The result was better efficiency than plain kerolox and better thrust than plain hydrolox, plus a denser propellant mix meaning smaller tanks were needed- useful for a spaceplane where larger tanks mean more wing and more thermal shielding are needed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nbro turned into scott manley\n\u003C/p\u003E\n"},{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-11T02:21:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207492\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670713157\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTerrible idea, for the simple reason that rubidium has a really high atomic mass (85) compared to lithium (7) and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E is determined by exhaust velocity, which decreases with increasing molecular mass. It\u0027s also a lot less reactive than lithium, which will readily shrug off that extra electron and hence makes for a really energetic rocket propellant when combined with fluorine which just can\u0027t wait to get hold of said extra electron. Lithium\u0027s use in batteries, fluorine\u0027s toxicity and the logistics of trying to keep both liquid in close proximity when fluorine boils at several hundred Kelvin below lithium\u0027s melting point, not to mention the hydrogen fluoride (a.k.a. hydrofluoric acid) produced as a byproduct, are just some reasons why this was A Bad Idea and, like boranes and chlorine polyfluorides, best left in the history books.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other engine you\u0027re describing sounds like the RD-701, a rocket engine designed for the MAKS spaceplane in the late 80s. It would burn both kerosene and hydrogen in the atmosphere for maximum thrust, then switch to just hydrogen once in space for maximum efficiency (switching off the kerosene turbopump but leaving the hydrogen one running as it had separate pumps for each fuel). The result was better efficiency than plain kerolox and better thrust than plain hydrolox, plus a denser propellant mix meaning smaller tanks were needed- useful for a spaceplane where larger tanks mean more wing and more thermal shielding are needed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1- I had forgotten about that fact. Rubidium is not good then.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2- I\u0027m talking about in-game implementation. Kerbais can stand right next to a rocket taking off and be 100% fine . Kerbals can withstand collisions at 20 m/s and just get up and continue the mission. One problem I\u0027ve noticed is that people think like human engineers, but kerbals are not humans. It would be a lot of fun to use such an engine. And I was planning to put pretty much everything you wrote about Hydrogen and Fluorine combustion and how it releases not so cool stuff. But like I said before, kerbals either die or they continue their mission as if nothing had happened. Think, why does the game let you put a kerbal in a chair for 90 years in space without any radiation protection or life support, and the kerbal doesn\u0027t show the slightest signs of health damage? Because its fun to do this. We are not talking about humans. We\u0027re talking green, clumsy alien beings who want to go to the stars, it doesn\u0027t matter if a nuclear bomb goes boom behind them, they just go.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-11T02:44:00Z\u0022 title=\u002212/11/2022 02:44  AM\u0022 data-short=\u00221 yr\u0022\u003EDecember 11, 2022\u003C/time\u003E by Dragorans\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-11T10:52:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207577\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670727446\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMost KSP engines are heavily inspired by real world equivalents, are there any existing or designed engines that use the tripropellant sequential burning method? It sounds interesting, and easy to integrate with KSP as being similar to the RAPIER. But I\u0027m unsure whether they are adding more of the widely used fuel types to replace the generic \u0022liquid fuel,\u0022 which would be necessary to make this engine. Personally I think they should at least add methane/hydrogen/kerosene equivalents to add some variety to the standard fuels, and use the 3 main rocket fuels that were covered by Everyday Astronaut, but they appear to be reusing the KSP tank design which is bipropellant tanks with ratios to match the engine fuel ratios, which are all the same. Changing this would result in significant changes to a core mechanic of the lego rocket design style, but I think there are better methods, such as tanks with switchable resources. However this adds other complications that may be beyond the interest of the average player.\n\u003C/p\u003E\n\u003Cp\u003E\nOverall there is a lot more to consider with adding this type of engine to the game. I know they are adding a few new fuel types like metallic hydrogen, but the current approach is that every engine with a new fuel type needs its own tanks with fuel ratios matching the engine, and this can quickly result in an overwhelming number of tanks. I\u0027m pretty sure they said no to switchable tanks at some point, so this engine may remain in mod territory.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe different fuels have already been confirmed.\n\u003C/p\u003E\n\u003Cp\u003E\nWe already know very well that Liquid Hydrogen will be present in the game from the beginning, since the Nerv engine will need it. \u003Cspan\u003EThe Nerv-US engine I mentioned works because it uses hydrogen. W\u003C/span\u003E\u003Cspan\u003Ee already know that methalox will be in the game, since the Swivel engine mentions it on its description.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAbout the tanks, we will have hydrogen tanks just because nuclear engines use it, and we will have nuclear engines! I dare say we will have oxygen only tanks as well, as engines like NERV-US will use them. Also we will have to separate \u0022Hydrolox\u0022 from  \u0022Liquid Hydrogen\u0022 like SimpleRockets 2, because that would eliminate the problem of having to balance the fuel/oxidizer ratio. Oxygen only tanks would be easy to add. Just a new engine and maybe some new tanks because size matters.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd there are examples of sequential burning engines. The Russian double-chamber RD-701 it worked in a similar way, burning all fuels on takeoff and using only hydrogen when in space. \n\u003C/p\u003E\n\u003Cp\u003E\nThe RD-701 was further developed into the single-chamber RD-704. But both never flew\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-11T11:13:55Z\u0022 title=\u002212/11/2022 11:13  AM\u0022 data-short=\u00221 yr\u0022\u003EDecember 11, 2022\u003C/time\u003E by Dragorans\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"yoarebignoob","CreatedById":221139,"CreatedDateTime":"2022-12-11T13:37:49Z","Content":"\n\u003Cp\u003E\ndoes liquid hydrogen\u002B liquid oxygen and helium count as tri-proppelant?????????\n\u003C/p\u003E\n"},{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-11T14:47:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207692\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670765869\u0022 data-ipsquote-userid=\u0022221139\u0022 data-ipsquote-username=\u0022yoarebignoob\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, yoarebignoob said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndoes liquid hydrogen\u002B liquid oxygen and helium count as tri-proppelant?????????\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, helium doesn\u0027t even react with anything. It only serves to maintain the pressure in the tanks.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207706\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670767950\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/Y-xyXDiC92s?start=5211\u0026amp;feature=oembed\u0022 title=\u0022The Entire Soviet Rocket Engine Family Tree\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, I didn\u0027t watch that video. Probably because I don\u0027t watch everyday astronaut. But it\u0027s always good to have more knowledge\n\u003C/p\u003E\n"},{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-13T14:25:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224208095\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670851128\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSuit yourself, I linked to the time of the video which covered those engines, for the benefit of anyone interested. It includes specs and a little more info, the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E of the second hydrogen mode was impressive.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt was said that the Americans thought most of these engines were impossible until they visited the Soviet Union after it collapsed, bought the engines and investigated the designs. I guess you don\u0027t know what you don\u0027t know.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI meant that I didn\u0027t know the video existed before you showed it to me. But I watched almost the entire video after that. Thx!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2022-12-13T20:58:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207378\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670693108\u0022 data-ipsquote-userid=\u0022223402\u0022 data-ipsquote-username=\u0022Dragorans\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/10/2022 at 11:25 AM, Dragorans said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTripropellant engines are theoretically the most efficient chemical rockets in existence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERocketdyne made an engine in the 1960s that used gaseous hydrogen, liquid fluorine and liquid lithium that resulted in incredible 542 Isp. But they are not free of problems, obviously. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHeating lithium to become liquid is not exactly easy, and storing and injecting solid grains into a combustion chamber would be extremely problematic (if not impossible due to backfiring).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere are two types of tripropellant engines:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027, Times, serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003ESequential burning\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA sequential firing rocket would be something like a half-stage, only difference is that nothing is thrown away - you \u003Cem\u003Echange the fuel \u003C/em\u003Emid-flight. \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s call an engine by the name KS-325.\n\u003C/p\u003E\n\u003Cp\u003E\nKS-325 is RP-1 and LH2 compatible engine and LOX as an oxidizer. It is possible to switch between LH2 and RP-1 mid-flight. At launch, RP-1 will be the fuel used, as its higher density only offers advantages for first stages. When RP-1 ends, it will burn hydrogen, being better for upper stages.\n\u003C/p\u003E\n\u003Cp\u003E\nAll this while \u003Cem\u003Eusing the exact same engine. \u003C/em\u003EThis offers obvious advantages for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E. if the KS-325 has an extendable nozzle, this would probably be one of the best engines for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E with chemical engines. However, it still has disadvantages...\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket would have to be insanely tall to store all the Hydrogen, RP-1 and the insane amount of LOX it would need.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only new part that would need to be added would be the engine, since hydrogen tanks are already confirmed (Nerv and  NERV-US will use them) and RP-1/LOX will obviously be added.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the most likely one that would be added to the game, considering there are multiple engines that already have mode switches (e.g Panther jet engine). and NERV-US operates in a very similar way,  only needed changes will the fuels, performance and model of a NERV-US\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027, Times, serif;\u0022\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003ESimultaneous burning\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBasically it\u0027s injecting a third fuel into the combustion chamber. The hydrogen-fluor-lithium engine mentioned at the beginning is this type of engine.\n\u003C/p\u003E\n\u003Cp\u003E\nThis type of motor can theoretically achieve very high efficiencies, but as theory is not reality, injecting room temperature solids or high temperature liquids is not exactly viable. And making an engine that injects two \u0022normal\u0022 fuels would have no advantage compared to sequential injection engines. \u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere are several other problems that will certainly not be simulated in KSP, such as how to maintain the necessary high temperature.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOne suggestion of mine would be to use rubidium instead of lithium, which has a much lower melting point, only 39°C. It would be much more realistic, but I don\u0027t know if it would be highly efficient - after all, this combination has never been tested.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest problem with adding these engine to KSP would be having to create new parts. Things that difficult development should be avoided unless it\u0027s really worth it. That\u0027s why I suggest that only the engine that burns sequentially be added, since only one new engine would need to be added, and the \u0022programming\u0022 of this engine has already been done even in KSP1, with the RAPIER, so overall it would only need to be added a new model, and a change in resource used.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo that\u0027s it, I\u0027ll probably write another thread about my ideas on the science \u0026amp; spaceflight topic, where I can write the scientific part (my favorite) more deeply. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Eso yeah, see you guys later.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAny criticism of this idea is welcome, I want to know my problems\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHeck, do you want a mod patch for this?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be willing to do it if you like \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Dragorans","CreatedById":223402,"CreatedDateTime":"2022-12-13T21:13:09Z","Content":"\n\u003Cp\u003E\nIm console player\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224208561\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670965108\u0022 data-ipsquote-userid=\u0022210823\u0022 data-ipsquote-username=\u0022AtomicTech\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, AtomicTech said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeck, do you want a mod patch for this?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be willing to do it if you like \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Abel Military Services","CreatedById":219257,"CreatedDateTime":"2023-01-10T06:00:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224208561\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670965108\u0022 data-ipsquote-userid=\u0022210823\u0022 data-ipsquote-username=\u0022AtomicTech\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/14/2022 at 4:58 AM, AtomicTech said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeck, do you want a mod patch for this?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be willing to do it if you like \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you want, just do it. Remember to add MOAR juice! \n\u003C/p\u003E\n\u003Cp\u003E\nMy opinions: \n\u003C/p\u003E\n\u003Cp\u003E\nMaybe we can add a gas-core NTR that has a afterburner mode. It consumes Enriched Uranium(Or other fissile material, because the reactor itself will go out) Liquid Hydrogen and Oxidizer. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-01-10T06:00:55Z\u0022 title=\u002201/10/2023 06:00  AM\u0022 data-short=\u00221 yr\u0022\u003EJanuary 10, 2023\u003C/time\u003E by Abel Military Services\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-01-10T17:38:13Z","Content":"\n\u003Cp\u003E\nDon\u0027t see it as very practical, exception might be an multi fuel nuclear thermal engine with an afterburner. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-01-10T20:51:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224217702\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221673372293\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDon\u0027t see it as very practical, exception might be an multi fuel nuclear thermal engine with an afterburner. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWho said anything about KSP monstrosity creations being practical?!\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-01-11T04:59:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224217751\u0022 data-ipsquote-contentid=\u0022211001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221673383901\u0022 data-ipsquote-userid=\u0022223169\u0022 data-ipsquote-username=\u0022zeekzeek22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, zeekzeek22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWho said anything about KSP monstrosity creations being practical?!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure, but then you get Orion pulse nuclear the only way to top it is antimatter. \n\u003C/p\u003E\n"}]}