{"TopicId":211092,"ForumId":112,"TopicTitle":"Rocket propellents….","CreatedByName":"Drakenred65","CreatedById":154503,"CreatedDateTime":"2022-12-18T03:11:20Z","PageNum":1,"Articles":[{"CreatedByName":"Drakenred65","CreatedById":154503,"CreatedDateTime":"2022-12-18T03:11:20Z","Content":"\n\u003Cp\u003E\nShould we have more that are in game thand the ones so far?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nafter all in the real world, we have…\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLox. We have been working with it since 1883. It’s basically a standard oxidizer.\n\u003C/p\u003E\n\u003Cp\u003E\nOzone, studied, generally considered to be unsafe to work with as a Rocket oxidizer.\n\u003C/p\u003E\n\u003Cp\u003E\nGasoline. First rocket fuel. Quickly replaced  by ethanol in Germany\n\u003C/p\u003E\n\u003Cp\u003E\nDiesel  briefly tested and discarded, can probably be ignored. Sometimes revived in various “biofuel” proposals\n\u003C/p\u003E\n\u003Cp\u003E\nKerosine generally replaced alcohol.\n\u003C/p\u003E\n\u003Cp\u003E\nHydrogen seemed to have generally replaced Kerosine ( RP1)\n\u003C/p\u003E\n\u003Cp\u003E\nLNG/Methane seems to be replacing Hydrogen and Kerosine, because it’s relatively straight forward to make.\n\u003C/p\u003E\n\u003Cp\u003E\nCarbon monoxide is being looked at for use on Mars because it would be fairly easy to produce there.\n\u003C/p\u003E\n\u003Cp\u003E\nbeyond that you have \n\u003C/p\u003E\n\u003Cp\u003E\nT stoff and H Stoff, basicaly 80 Hydrogen peroxide And methanol and \u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:16px;text-align:left;\u0022\u003Ehydrazine hydrate. Nasty stuff, used mostly by (pedant) German in Rocket fighters. Has a reputation for exploding or dissolving people when mishandled.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:16px;text-align:left;\u0022\u003Eto be honest Hydrogen peroxide keeps cropping up,  in both liquid and hybrid solid fuel rockets.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:16px;text-align:left;\u0022\u003Ealso Nitric acid, red fuming inhibited nitric acid, 2 different Tetroxides, and a few dozen other compounds ranging from seemingly inert to Tri floride compounds that can make Water and glass burn.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nthen you have various Hybrid solid/ liquid fuel rockets, and solid rockets. \n\u003C/p\u003E\n\u003Cp\u003E\nOxidizers including O2 as compressed gas or extracted from air, and Lox, N2O ( Nitrus oxide) aka Laughing Gas) or in the case of revers hybrid motors such tch things as liquid Hydrogen and Kerosine used as the liquid part.\n\u003C/p\u003E\n\u003Cp\u003E\nPropellents have included such things as Paraffin ( yes wax) and Plexiglas ( yes my glasses are made of rocket fuel….as are the frames. Nightmare fuel when you think about it.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHydroxyl-terminated polybutadine Is often an ingredient in all kinds of solid rocket fuels, as is aluminum , magnesium and others.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGiven what they make toy car wheels out of can be used for rocket fule it gives a whole new meaning to Hot-wheels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeriously tucking all of that into a tech tree, is going to take a lot of stuffing. For new players it’s going to be a bit much.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-18T03:15:33Z\u0022 title=\u002212/18/2022 03:15  AM\u0022 data-short=\u00221 yr\u0022\u003EDecember 18, 2022\u003C/time\u003E by \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u00227c380e1d1719120e19184a493c3b111d1510521f1311\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SolarAdmiral","CreatedById":107350,"CreatedDateTime":"2022-12-18T14:19:09Z","Content":"\n\u003Cp\u003E\nYeh definitely not. For mods absolutely. But the base game isn\u0027t intended to be a 1 to 1 super realistic replica sim. It\u0027s meant to be balanced as a simplified and fun game.\n\u003C/p\u003E\n\u003Cp\u003E\nDifferent liquid fuels/oxidizers should only be included if they have significant enough differences to meaningfully effect gameplay. Something like, this fuel has 20% more isp or is 20% lighter alone isnt really enough to bother. And ksp probably isn\u0027t going to have issues like limited engine restarts, or challenges for restarts with half empty tanks, or toxicity of the fuel which would be the main difference between many fuel types. Rockets in ksp mostly boil down to \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E and \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. All the other finer points of rocket science are glossed over. Also, I don\u0027t think it\u0027s worth the devs time to create multiple liquid fuels if one is clearly inferior. Why add a bunch of new fuels if they are only useful for one or two steps on the tech tree before being replaced by something superior? They\u0027d spend all that time and effort making something we\u0027d only use for a couple missions before replacing and all those parts would sit unused and cluttering up the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E menu.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, a large part of the game\u0027s tech progression is going to be into future and alternative engine technologies. I think liquid fuel oxidizer rockets are going to quickly become obsolete in terms of best \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E or best \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, and kept useful by their fuel being easy to produce. They\u0027re going to be the budget option, not the best but ok. Which is why I think they went with methane, as it can be easily made anywhere with water and nitrogen or even harvested from atmospheres or gas giants. And frankly if the team had that much time on their hands, I\u0027d much rather the devs spend it adding more possible future engine techs, where there could be more gameplay variance.\n\u003C/p\u003E\n\u003Cp\u003E\nSo with those restraints, \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E and \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E being the only stats that really matter, not devoting so much time and effort to something that would be outright replaced by another liquid fuel, ideally something easy to produce in many environments so it doesn\u0027t become completely obsolete due to new engine techs, are there any fuels that are different enough to include.\n\u003C/p\u003E\n\u003Cp\u003E\nAt most I could see setting up 2 or 3 different liquid fuels. They\u0027ve said they\u0027re going with methane for the basic fuel. Hydrogen might a possible alternative to include, as it has some significant differences. I think their challenge might be making Hydrogen different without making it worse. Maybe they could justify kerosene. But I don\u0027t think it\u0027s different enough from methane to matter for any reason other than, historical rockets more likely used kerosene.\n\u003C/p\u003E\n"},{"CreatedByName":"Drakenred65","CreatedById":154503,"CreatedDateTime":"2022-12-18T18:56:31Z","Content":"\n\u003Cp\u003E\nFirst off,\n\u003C/p\u003E\n\u003Cp\u003E\nI do agree this should be a mod or maybe a difficulty setting they add in Later.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond\n\u003C/p\u003E\n\u003Cp\u003E\nI tend to agree that having say G/LOX tanks then V/LOX  then  K/LOX  tanks and so on needlessly clutters up the tech tree and \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Take the existing tech tree and overlay this.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nso Gasoline Ox is default the starter\n\u003C/p\u003E\n\u003Cp\u003E\nget X Number of unlock anf you can use alcohol.\n\u003C/p\u003E\n\u003Cp\u003E\nget Y more unlocks and Kerosine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nand so on.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI suspect the main reason they went with MethLOx was because HLOx fuse NERV-US\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2022-12-18T19:53:34Z","Content":"\n\u003Cp\u003E\nEventually someone will create a mod where one defines fuels on a molecular level and people with chemistry backgrounds will discover KSP also. And others will still find fuels lacking, ha. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m fine with generic fuels that require forethought with regards to cryo boil off, \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E reqs at destination etc.  The point being that even if it is just \u0022liquidfuel\u0022, \u0022oxidizer\u0022, \u0022monoprop\u0022, and \u0022cryofuel\u0022 with these correlating to planning wrt \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E resources and boil off and I\u0027d be ok with that.  The \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E reqs for these should correlate with similarly simplified \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E resources with varying distribution in biomes.  But having a more realistic, or more simplified, system is also fine, within reason.  Just tell me the rules and let me play\n\u003C/p\u003E\n"},{"CreatedByName":"Drakenred65","CreatedById":154503,"CreatedDateTime":"2022-12-18T22:25:41Z","Content":"\n\u003Cp\u003E\nThe problem is\n\u003C/p\u003E\n\u003Cp\u003E\n1 H2 needs different tanks than Kerosine, and both need deferent tanks than liquid methane.  While you should be able to use an h2 tank with methane, you still need to replumb it, and the ratio of o2 needed is slightly diferent, and your lugging the dead weight of the hydrogens insulation. Going the other way you add mass with the needed insulation. Adding thoes numbers in so it’s clear what’s going on adds to ui clutter.\n\u003C/p\u003E\n\u003Cp\u003E\n2 the engines for each fuel type are diferent due to changes needed to accommodate diferent fuels and oxidizer requirements. Current.y it’s not something you do in the fly like Some land based engines can do, like that one Volkswagen/Mann  Multi-fuel diesel/gasoline/methain can.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nand like I said they need to keep it basic for new players, \n\u003C/p\u003E\n"}]}