{"TopicId":211168,"ForumId":70,"TopicTitle":"Planet/Star System Expansion Mods Only Launch Once Per Game Install","CreatedByName":"VaSIMR200","CreatedById":224327,"CreatedDateTime":"2022-12-23T12:39:21Z","PageNum":1,"Articles":[{"CreatedByName":"VaSIMR200","CreatedById":224327,"CreatedDateTime":"2022-12-23T12:39:21Z","Content":"\n\u003Cp\u003E\nMight be a problem with my computer, but as the title says. For all planet mods i\u0027ve tested (GPP, OPM, GU) the mod will only successfully launch once per instance of the game, then gets stuck at the end of game load (expansion loading complete).  Don\u0027t have any logs to show for it as it does not crash, but can pull them if there is another way.\n\u003C/p\u003E\n\u003Cp\u003E\nSymptoms:\n\u003C/p\u003E\n\u003Cp\u003E\n - Occurs whether the mod (\u002B dependancies) are alone or with any number other mods, seems to have no affect assuming there aren\u0027t other conflicts.\n\u003C/p\u003E\n\u003Cp\u003E\n - Occurs with manual and/or \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E install.\n\u003C/p\u003E\n\u003Cp\u003E\n - If I unpack another game instance from .zip and reinstall mods it will launch just fine, but after closing it will not launch again i.e. get stuck as mentioned. To elaborate, if I \u0027burn\u0027 a GPP launch, I can then remove it and install OPM. It will then launch once, but not again. Can continue for other planet packs.\n\u003C/p\u003E\n\u003Cp\u003E\nPossibly linked, can\u0027t lanch KSP from the application, have to run unix executeable directly but this is no quandry alone.  No noteable related issues with any other mods, and Kopernicus seems to work fine without the planet packs. Can\u0027t get easy access to older 1.12 versions to try, but happy to if there is a legit way to get them. I have used this OS install for many ksp versions since 0.90, so maybe the game files are getting muddled? I don\u0027t mix them intentionally, keep them as they are in seperate directories, but its a theory if paper thin. Running KSP 1.12.3 on Mac OS, non-steam. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for your considerations, first time poster on the forums here despite playing for a long time. \n\u003C/p\u003E\n"}]}