{"TopicId":21122,"ForumId":32,"TopicTitle":"Houston, no, KSP forums, we have a problem.","CreatedByName":"prullenbak","CreatedById":44642,"CreatedDateTime":"2012-10-02T14:48:36Z","PageNum":1,"Articles":[{"CreatedByName":"prullenbak","CreatedById":44642,"CreatedDateTime":"2012-10-02T14:48:36Z","Content":"\n\u003Cp\u003EHey everyone\u003C/p\u003E\u003Cp\u003EAfter a very long trip all the way to the Jool system, Cthulhu has knocked one of the nuclear engines off my lander. This prevents me from going full throttle to slow my descent.\u003C/p\u003E\u003Cp\u003EIf I use \u0027Disable Flow\u0027 on the fuel tanks above the nuclear engines it disables all of them, and the Poodle engine in the middle is not enough to slow my descent by itself.\u003C/p\u003E\u003Cp\u003EI\u0027ve also tried smashing Kerbals into the engine I want to disable, hopefully knocking off the engine so that it\u0027s balanced again. Cruel, but neccesary I thought. This destroys either the entire ship or does nothing at all, watching the guy bounce off until he regains consciousness.\u003C/p\u003E\u003Cp\u003ESo, yeah is there any way to fix this? Maybe editing the savefile to destroy the other nuclear engine? \u003C/p\u003E\u003Cp\u003EHere\u0027s a picture of my lander.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/xNU0I\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/xNU0I\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELook at my Kerbals, they\u0027re all panicking because the thing cannot land like this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-02T16:56:43Z\u0022 title=\u002210/02/2012 04:56  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 2, 2012\u003C/time\u003E by prullenbak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-02T15:30:03Z","Content":"\n\u003Cp\u003EActually prullenbak, there is something you can do, first back up your persistence file as it\u0027s going to take some surgery.....\u003C/p\u003E\u003Cp\u003EWith your persistence file safely backed up, load up your craft in the VAB and remove everything below the lander but don\u0027t save the ship, now hit launch.\u003C/p\u003E\u003Cp\u003EWith just the lander on the pad, exit to the space center and open your persistence file (not with wordpad, never with wordpad (you remembered to back it up yes?))\u003C/p\u003E\u003Cp\u003EYou\u0027ll have two near identical craft here, one in space and one on the pad, what you need to do is find the one that is at prelaunch and copy everything from just below the command pod all the way down to the last engine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/xbvpMaid\u0022 rel=\u0022external nofollow\u0022\u003EIt\u0027ll look something like this.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMake a note of how much fuel your orbiting lander has in each tank then paste this info \u003Cem\u003Eover the top\u003C/em\u003E of the info of the orbiting craft, edit the fuel levels to match what you have used.\u003C/p\u003E\u003Cp\u003ENow, if all has gone perfectly, when you go to the tracking station and back to your orbiting lander it\u0027ll be in one piece, ready for landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-02T15:34:03Z\u0022 title=\u002210/02/2012 03:34  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 2, 2012\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-10-02T15:31:32Z","Content":"\n\u003Cp\u003EI can\u0027t see the image you posted (it shows as a broken link on my computer), but why not try to limp home to Kerbin if you can? Live to fly another day...\u003C/p\u003E\n"}]}