{"TopicId":211235,"ForumId":112,"TopicTitle":"Modern, integrated mod management","CreatedByName":"Skorj","CreatedById":201273,"CreatedDateTime":"2022-12-29T19:30:48Z","PageNum":1,"Articles":[{"CreatedByName":"Skorj","CreatedById":201273,"CreatedDateTime":"2022-12-29T19:30:48Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure what precisely the devs have in mind for in-game mod management, beyond Nate saying that mods are a valued part of KSP.   I\u0027d like to see modern, integrated mod management, basically what \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E does with a bit more integration:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nA mod search/install screen, where every mod registered by a modder can be found, with a modder-provided summary page for each (just a summary, the mod website can be linked from it).  Show the list of dependent mods and install the whole \u0022tree\u0022 from there.\n\u003C/li\u003E\n\u003Cli\u003E\nA mod update screen, where you can see what mods are compatible with the current game version and pull down mod updates.\n\u003C/li\u003E\n\u003Cli\u003E\nA mod management screen where you can select mods to activate/deactivate \u003Cem\u003Ewithout uninstalling them\u003C/em\u003E (just a game restart).\n\u003C/li\u003E\n\u003Cli\u003E\nSaved games keeping track of what mods they need, so you can practically have different ongoing games with different mixes of mods in a single install.  The UI can tell you what mods are associated with a particular save slot, so you can remember what you need to toggle.\n\u003C/li\u003E\n\u003Cli\u003E\nSaved ships with modded parts keeping track of what mods those parts came from, so that the file we share (to share a ship) includes a mod manifest.  That way the game tells you what mods you need to use someone else\u0027s ship (or your own that you saved off from some long-deleted game, as I do all the time).\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Monsterlunch","CreatedById":135085,"CreatedDateTime":"2022-12-30T10:02:40Z","Content":"\n\u003Cp\u003E\nFactorio does this incredibly well \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I would love to see something like that for KSP 2. \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Catto","CreatedById":137773,"CreatedDateTime":"2022-12-30T19:21:42Z","Content":"\n\u003Cp\u003E\nSomething like rimworld\u0027s\n\u003C/p\u003E\n"},{"CreatedByName":"Nazalassa","CreatedById":217956,"CreatedDateTime":"2023-01-02T10:54:55Z","Content":"\n\u003Cp\u003E\nOr like Minetest\u0027s\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2023-01-04T10:21:55Z","Content":"\n\u003Cp\u003E\nThe original dev team said a few times in years they wanted something like this in game. \u003Cbr\u003E\nit would certainly be advantageous\n\u003C/p\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-01-10T09:37:24Z","Content":"\n\u003Cp\u003E\nI would add: having a planet pack database which is vetted and ranked by players and devs, so you can add new star systems directly into the game. This would get us closer to the idea of \u0022being able to travel to most stars you see in the sky\u0022.\n\u003C/p\u003E\n"}]}