{"TopicId":211273,"ForumId":32,"TopicTitle":"The Kerbal Calendar","CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2023-01-02T03:20:48Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2023-01-02T03:20:49Z","Content":"\n\u003Cp\u003E\nHow would Kerbals structure calendars? In Earth, we have days, weeks, months, and years. And, from what we see in the game, Kerbals have a very similar way of telling time. Except, we only get days and years, and nothing in between. However, this is still a lot of information to start with.\n\u003C/p\u003E\n\u003Cp\u003E\nLet’s start with structuring weeks. On Earth, a week is 7 days. On Kerbin, a week could also be 7 days. If we do the math, 6x7, which is 42, a Kerbin day can fit perfectly into a 7 week period. This doesn’t translate very well when compared to a year, though. If we do 426/7, we get 60.8571429, which is a really odd decimal. But if we do 426/6, we get a round 71. It’s be easier to structure a calendar like this, so a Kerbin week is most likely 6 days.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, what about a month? On Earth, a month is averagely 30 days. If we do the math, 30 days fits well into a year. 426/30=14.2. Much like on Earth, Kerbals can shift around days, making months longer or shorter.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore,\n\u003C/p\u003E\n\u003Cp\u003E\nDay = 6 Hours\n\u003C/p\u003E\n\u003Cp\u003E\nWeek = 6 Days\n\u003C/p\u003E\n\u003Cp\u003E\nMonth = 30 Days\n\u003C/p\u003E\n\u003Cp\u003E\nYear = 14 Months\n\u003C/p\u003E\n\u003Cp\u003E\nI hope you enjoyed my Ted Talk.\n\u003C/p\u003E\n"},{"CreatedByName":"Superluminal Gremlin","CreatedById":221533,"CreatedDateTime":"2023-01-02T03:59:57Z","Content":"\n\u003Cp\u003E\nSome months can have more days than others\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2023-01-02T15:21:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224214808\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221672631997\u0022 data-ipsquote-userid=\u0022221533\u0022 data-ipsquote-username=\u0022Superluminal Gremlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Superluminal Gremlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSome months can have more days than others\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI said that. \u003Cem\u003E\u0022Much like on Earth, Kerbals can shift around days, making months longer or shorter.\u0022\u003C/em\u003E It\u0027s phrased pretty weirdly, but yeah they can just make months longer or shorter.\n\u003C/p\u003E\n"},{"CreatedByName":"MythicalHeFF","CreatedById":176690,"CreatedDateTime":"2023-01-02T22:09:52Z","Content":"\n\u003Cp\u003E\nI feel that, like the moon defines months in our calendar, the Mun would define months in a Kerbal calendar. However, the Mun orbits Kerbin roughly every 6.5 Kerbal days, meaning that each month would only be 6-7 days long. This works out to there being about 65 months in a year, which is definitely too many.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso of note is the fact that Kerbin doesn’t orbit Kerbol exactly every 426 days, instead, an orbit takes roughly 426 days and 32 minutes, meaning that there would have to be a leap year roughly every twelve years or so to keep up.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2023-01-03T00:25:16Z","Content":"\n\u003Cp\u003E\nDoing more maths, I can compare the Kerbal Calendar to our own.\n\u003C/p\u003E\n\u003Cp\u003E\nEarth     Kerbin\n\u003C/p\u003E\n\u003Cp\u003E\n1 Day = 4 Days\n\u003C/p\u003E\n\u003Cp\u003E\n1 Week = 28 Days (7 Weeks)\n\u003C/p\u003E\n\u003Cp\u003E\n1 Month = 120 Days (4 Months)\n\u003C/p\u003E\n\u003Cp\u003E\n1 Year = 1,460 Days (3.4 Years)\n\u003C/p\u003E\n\u003Cp\u003E\nTo a Kerbal, our timescales are so incredibly long they’d boggle their minds. Since an Earth day is 4 times longer than a Kerbin day, evrything can be divided by 4 to get certain numbers. This would seem so long to a Kerbal, that they’d just faint from the thought. How can a species experience that long of time? To us, Kerbal timescales seem incredibly short. This whole thought experiment kind of simulates what time would be like between us and an extraterrestrial intelligent species. Time would be different to both of us, and will leave us questioning each other’s passage of time.\n\u003C/p\u003E\n"},{"CreatedByName":"Leganeski","CreatedById":220954,"CreatedDateTime":"2023-01-03T02:48:44Z","Content":"\n\u003Cp\u003E\nWhile we might like calendars to be based on nice astronomical concepts such as the orbital periods of the Earth or the Moon, this is not how it works in practice. Calendars are based on observable effects: for example, Earth\u0027s year is defined not by its orbital period but by the period of the seasonal cycle (which is about 20 minutes shorter), and the month was originally defined not by the Moon\u0027s orbital period but by its phases (which are about two days longer).\n\u003C/p\u003E\n\u003Cp\u003E\nOn Kerbin, there is no seasonal variation at all, so Kerbin\u0027s location in its orbit doesn\u0027t produce any easily noticeable effects unless you\u0027re actually paying attention to the constellations. This means its orbital period wouldn\u0027t have the same importance that Earth\u0027s year does. Instead, it seems more likely that the calendar would be based more directly on Mun. (Remember that Mun has about four times the angular diameter of the Moon, so it\u0027s way more noticeable in the sky.)\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a Munar eclipse every 6.534 days, but half of them occur at night, so from a given location, visible eclipses usually occur about every 13 days. The time of day of the eclipse advances by 25 minutes each time until it reaches sunset. Then, the alternating daytime and nighttime eclipses would swap, and the time of day of the visible eclipse would return to sunrise. This happens every 95.4 days, after seven or eight visible eclipses.\n\u003C/p\u003E\n\u003Cp\u003E\nEvery five of these \u0022eclipse cycles\u0022 (477.00044 days), the eclipse would occur at almost exactly the same time of day, off by less than ten seconds. Anyone with a watch who could see the sky getting dark due to a Munar eclipse would probably notice this, so a calendar based on this unit of time seems likely.\n\u003C/p\u003E\n\u003Cp\u003E\n(The phases of Mun cycle at the same rate as eclipses, so any such calendar would also include them as a bonus.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy proposal would be as follows:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nA \u0022year\u0022 is 477 days.\u003Cbr\u003E\nThe error between this and 73 Munar eclipses is so small that it would add up to less than an hour over the course of a human lifetime, so it\u0027s unlikely that further precision would be needed.\n\u003C/li\u003E\n\u003Cli\u003E\nThe year is broken into five \u0022cycles\u0022, each of 95 or 96 days.\n\u003C/li\u003E\n\u003Cli\u003E\nSeparately, a \u0022week\u0022 lasts 13 days, but the last week of every other cycle is followed by an extra day not part of the week.\u003Cbr\u003E\nI\u0027m not sure \u0022week\u0022 is exactly the right word since 13 is not that close to 7, but I can\u0027t think of a better alternative other than obscure terms like \u0022fortnight\u0022.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nHow would this work? As an example, let\u0027s look at this calendar from the perspective of an observer on the surface of the ocean at 0° N 0° E, where Kerbol rises at 03:00 and sets at 00:00.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe first eclipse is on Day 5 at 04:23, which is during the day. The next visible eclipse is one \u0022week\u0022 later, on Day 18 at 04:48.\n\u003C/li\u003E\n\u003Cli\u003E\nEclipses continue on the fifth day of every week until Day 57, where the eclipse continues past the end of the day.\n\u003C/li\u003E\n\u003Cli\u003E\nThe next eclipse is on Day 64 at 03:14, which is now just after sunrise on the twelfth day of the week.\n\u003C/li\u003E\n\u003Cli\u003E\nMore eclipses continue on the twelfth day of each week until Day 142 at 05:42.\n\u003C/li\u003E\n\u003Cli\u003E\nOn the 57th day of every cycle, the day of the week with the visible eclipse swaps. (At other longitudes, it\u0027s other days of the cycle, not the 57th.) During the first cycle (Day 57), it was from the fifth to the twelfth day of the week, whereas during the second cycle (Day 153), it moves from the twelfth to the sixth day of the week. The next visible eclipse is on Day 161 at 03:19.\u003Cbr\u003E\nWait, the sixth day of the week, not the fifth? It remains off for now, but then at the end of the second cycle, after the week ends on Day 195, an extra day is added between weeks, and the next week doesn\u0027t start until Day 197. The eclipse after that, on Day 201, is consequently pushed back to the fifth day of the week.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\nIn this way, \u003Cem\u003Eevery\u003C/em\u003E visible eclipse occurs on the fifth, sixth, or twelfth day of the week. (Well, they do if you start the week on Day 1 like I did. The days of the week could easily be renumbered to move them around.)\n\u003C/li\u003E\n\u003Cli\u003E\nAfter a \u0022year\u0022, on Day 482, an eclipse occurs at 04:23, the same time of day as the very first one.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nSince we\u0027re not used to thinking in terms of eclipses and time of day like this, the whole system feels unintuitive, but it lines up nicely with easily observable astronomical events, and I would say it\u0027s not any more complicated than the Gregorian calendar.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2023-01-06T19:33:49Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/220954-leganeski/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022220954\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/220954-leganeski/\u0022 rel=\u0022\u0022\u003E@Leganeski\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI see what you’re thinking there, but the calendar structure I was using is called the solar calendar, not the lunar calendar (or in this case, Kerbolar calendar and munar calendar). I assumed that, from what the game gives us, that’s how Kerbals structure calendars. However, with the Mun’s orbit being similar to my 6 day week, they probably structure their weeks around the Mun, like what you said.\n\u003C/p\u003E\n"},{"CreatedByName":"Leganeski","CreatedById":220954,"CreatedDateTime":"2023-01-07T01:19:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224216263\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221673033629\u0022 data-ipsquote-userid=\u0022222386\u0022 data-ipsquote-username=\u0022Kerbalsaurus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kerbalsaurus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI assumed that, from what the game gives us, that’s how Kerbals structure calendars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure; I was speculating based on just the actual Kerbin system. At the very least, though, the lack of seasonal variation means that there\u0027s a lot less incentive to correct the length of the year from 426 to 426.09 days, which is perhaps an in-universe explanation for why the calendar doesn\u0027t use leap years. (The real Mayan \u003Ca href=\u0022https://en.wikipedia.org/wiki/Haab%CA%BC\u0022 rel=\u0022external nofollow\u0022\u003EHaabʼ\u003C/a\u003E calendar, which was used fairly close to the equator where there is less seasonal variation than average, was exactly 365 days long.)\n\u003C/p\u003E\n"},{"CreatedByName":"MalneyKerman","CreatedById":202955,"CreatedDateTime":"2023-01-11T01:17:20Z","Content":"\n\u003Cp\u003E\nI consider hours, days, small months (munations,) great months, and years.\n\u003C/p\u003E\n\u003Cp\u003E\nIt appears that the kerbals would attach special significance to the number six: sixty seconds per minute, sixty minutes per hour, six hours per day, six days per munation, 71 munations per year. (71=2×6×6-1)\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, I suppose the kerbals for convenience would group 71 small months into 12 great months: 11 of 6 munations, and 1 of 5.\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine that the great months would be named after figures from kerbal mythology, as our months are: in no particular order, Jool, Tylo, Laythe, Eve, Neidon, Bop, Moho, Dres, Eeloo, Vall, Duna, Minmus (which would be the short great month).\n\u003C/p\u003E\n\u003Cp\u003E\nThe six phases of the Mun might be named thus: new Mun, waxing crescent, first third, full Mun, last third, waning crescent.\n\u003C/p\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2023-01-11T01:30:42Z","Content":"\n\u003Cp\u003E\nAnd, Minmus month would be celebrated as \u0027National Ice Cream Month\u0027!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEveryone can only eat mint ice cream - by law.\n\u003C/p\u003E\n"},{"CreatedByName":"Nazalassa","CreatedById":217956,"CreatedDateTime":"2023-09-09T12:04:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224320546\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221694188779\u0022 data-ipsquote-userid=\u0022230541\u0022 data-ipsquote-username=\u0022Gecem Sabah\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Gecem Sabah said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul\u003E\n\u003Cli style=\u0022border:0px solid #e5e7eb;\u0022\u003E\nSeasons affecting activities due to Kerbin\u0027s axial tilt - winter freezing lakes for ice skating etc.\n\u003C/li\u003E\n\u003Cli style=\u0022border:0px solid #e5e7eb;\u0022\u003E\nDifferent hemispheres having opposite seasons like on Earth\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKerbin, um, does \u003Cem\u003Enot\u003C/em\u003E have axial tilt, and its orbit is circular - therefore, no seasons.\n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2023-09-09T13:17:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224320845\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221694261048\u0022 data-ipsquote-userid=\u0022217956\u0022 data-ipsquote-username=\u0022Nazalassa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Nazalassa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbin, um, does \u003Cem\u003Enot\u003C/em\u003E have axial tilt, and its orbit is circular - therefore, no seasons.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSun induced seasons, for sure. But...\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin is a small but incredibly dense planet, so whatever they have under their feet must be very active. They could have seasons based on some geological cycle below their mantle.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the Mun also pretty near, sea tides are a thing there, and this can be used to pile up on the geological seasons somehow (combining  the tidal forces with Kerbol).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, whoever would implement weather on Kerbin, could use this excuse to also simulate seasons- with the duration  of week\u0027s, perhaps, as everything in this game is small in time scale.\n\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2023-09-09T15:23:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224320845\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221694261048\u0022 data-ipsquote-userid=\u0022217956\u0022 data-ipsquote-username=\u0022Nazalassa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Nazalassa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbin, um, does \u003Cem\u003Enot\u003C/em\u003E have axial tilt, and its orbit is circular - therefore, no seasons.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep. Turns out this one was a spammer \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RevanX_LSR","CreatedById":216972,"CreatedDateTime":"2023-09-11T12:47:00Z","Content":"\n\u003Cp\u003E\nTidal forces on Kerbin from Mun are around 40 times stronger than on Earth, so the effects will be very drastic. Probably their entire calendar will be based on those things, idk\n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2023-10-08T06:01:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224214804\u0022 data-ipsquote-contentid=\u0022211273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221672629649\u0022 data-ipsquote-userid=\u0022222386\u0022 data-ipsquote-username=\u0022Kerbalsaurus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/2/2023 at 11:20 AM, Kerbalsaurus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI hope you enjoyed my Ted Talk.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI really did!  (And the humor.)  It deserves the title.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u002B10\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nNow all you need is weekday and month names.\n\u003C/p\u003E\n\u003Cp\u003E\n(E.g. Mohday, Evday, Dunday, Dredesday, Joolday and Eelday.  Months after well-known constellations, perhaps?...)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-10-08T06:51:58Z\u0022 title=\u002210/08/2023 06:51  AM\u0022 data-short=\u0022Oct 8\u0022\u003EOctober 8, 2023\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"}]}