{"TopicId":211458,"ForumId":51,"TopicTitle":"Fleet to Eve","CreatedByName":"Commander Beta","CreatedById":224784,"CreatedDateTime":"2023-01-12T12:31:53Z","PageNum":1,"Articles":[{"CreatedByName":"Commander Beta","CreatedById":224784,"CreatedDateTime":"2023-01-12T12:31:53Z","Content":"\n\u003Cp\u003E\nI got 3 missions to Eve (one for Evelike Sun orbit) for which I used basically the same ship with a few tweaks for their requirements (Scaner or telescope).\n\u003C/p\u003E\n\u003Cp\u003E\nIt was a Mansail \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E with a nuclear engine orbiter it had about 2500 excess delta V , but since it was only my second attempt at interplanetary travel, I wanted to play it safe, the first 2 missions went well, despite the Eve satellite taking about 1k more delta v than it should have, but then I had to maneuver a satellite to Gilly Kolniya orbit, and it was a disastrous piloting display xd.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter capturing around Eve at about the right budget, I wasn\u0027t being able to find an encounter with Gilly, then, I saw one, but it was absurd, it meant making a huge burn to invert my orbit, I knew it was not the right thing to do, but seeing no other alternatives I decided to give it a shot.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever now that I was going against the orbit, I would be forced to cancel all of my relative speed, costing me most of my remaining delta V.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it was only now that I found myself in the most ridiculous situation of the mission (which you cam see in the photo, my inclination was almost opposite to the required one, being used to making crazy maneuvers by this point though, I did a grand normal burn followed by retrograde, and somehow managed to complete the contract with \u0022only\u0022 100 delta V remaining.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://photos.app.goo.gl/uZYUWDYfLDNn8n1V6\u0022 rel=\u0022external nofollow\u0022\u003EPhoto of crazy orbit change\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI certainly need to improve my piloting, but nuclear engines really saved the day, even though I absolutely shouldn\u0027t have succeeded.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2023-01-12T22:51:22Z","Content":"\n\u003Cp\u003E\nCongrats. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}