{"TopicId":211852,"ForumId":70,"TopicTitle":"Uh OH. Where oh Where are my Squad parts 1.12.5","CreatedByName":"cygnus008","CreatedById":224511,"CreatedDateTime":"2023-02-03T22:16:39Z","PageNum":1,"Articles":[{"CreatedByName":"cygnus008","CreatedById":224511,"CreatedDateTime":"2023-02-03T22:16:39Z","Content":"\n\u003Cp\u003E\nI started this game Dec 27 2022 with version 1.12.4 and got into orbit in a couple of days. Looked at about 500 YouTubes, read about 5000 subjects about Kerbal.  In a couple of weeks I landed on Minmus with 3 guys.  One got out and I couldn\u0027t get him back in. Tried the rocket pack and he knocked the space ship over so I had to do a restart there.  But I got them Home.  Found out that there are hundreds of cool mods, figured out - don\u0027t try to load them all.  Found out that some mods conflicted with others and uninstalled them.  Finally screwed stuff up so bad the rockets wouldn\u0027t ignite on the launch pad.  Found Kerbalx and downloaded some cool utility lifters. Nothing would ignite so decided to do a complete new install of 1.12.5.    Installed kerbalx mod and craft manager and many of the craft now say missing parts.  Tracked that down and they are from the original install of SQUAD \n\u003C/p\u003E\n\u003Cp\u003E\nThe only mods I have installed are kerbalx and craft manager so I wouldn\u0027t think they would have disappeared or inactivated parts.  did a complete new install again and am missing \u0022liquidEngine1-2\u0022 as one example.  \n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way to do a complete install of SQUAD parts from somewhere else?  Looked at the SQUAD subdirectory and no way can you go through that one item at a time and figure out what is missing.  did 1.12.5 drop something out?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI guess maybe try to install 1.12.4 copy the SQUAD subdirectory save it off delete KSP directory, reinstall 1.12.5 and copy SQUAD over the top of that.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been doing \u0022computers\u0027 since 1969  as a programer, systems design, software design, hardware and software install, DBA,  SANs, Virtual Machines, etc. etc. so can kind of fumble my way around but some times it pays to ask the Hive ,with 15 million man years of experience with Kerbal.  Love this program. \n\u003C/p\u003E\n\u003Cp\u003E\nAny Ideas?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\nCold Wyoming\n\u003C/p\u003E\n"},{"CreatedByName":"cygnus008","CreatedById":224511,"CreatedDateTime":"2023-02-03T22:50:23Z","Content":"\n\u003Cp\u003E\nWell I installed 1.12.4 and the parts are missing there also.\n\u003C/p\u003E\n\u003Cp\u003E\nWonder when they disappeared?\n\u003C/p\u003E\n\u003Cp\u003E\nlooks like a bunch of the craft were build with 1.6\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-03T22:53:26Z\u0022 title=\u002202/03/2023 10:53  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 3, 2023\u003C/time\u003E by cygnus008\u003C/strong\u003E\n\u003Cbr\u003Eadded built version\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2023-02-03T23:06:42Z","Content":"\n\u003Cp\u003E\nMoved to tech support modded. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt is not allowed to acquire the “Squad Parts” from any source other than an authorized distributor.    As in, illegal.  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut, the source you bought the game from should allow you to reinstall, or at least confirm the integrity of the original files.  That should fix any issues. \n\u003C/p\u003E\n"},{"CreatedByName":"cygnus008","CreatedById":224511,"CreatedDateTime":"2023-02-04T03:27:22Z","Content":"\n\u003Cp\u003E\nI installed it directly from the kerbal site.  I figured the parts were proprietary  to kerbal.  I haven\u0027t found anything that runs a integrity check on the install.  \n\u003C/p\u003E\n\u003Cp\u003E\nI suspect these parts got renamed somewhere between 1.6 and 1.12.  I can work around this or build my own craft as needed.\n\u003C/p\u003E\n\u003Cp\u003E\nthanks\n\u003C/p\u003E\n\u003Cp\u003E\nLarry\n\u003C/p\u003E\n"}]}