{"TopicId":212347,"ForumId":120,"TopicTitle":"SAS requires a serious overhaul","CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2023-02-24T16:24:54Z","PageNum":1,"Articles":[{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2023-02-24T16:24:54Z","Content":"\n\u003Cp\u003E\nJust built my first plane and it flies ok - without \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E. Once you have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E enabled the control surfaces start rapidly flapping up and down like the plane is a Kolibri - and this in turns leads to a wildly fluctuating lift-drag ratio. Not good for handling the plane.\n\u003C/p\u003E\n\u003Cp\u003E\nI also had a case in orbit which I could not easily reproduce, where I had a medium sized vessel in orbit with a Poodle engine and the small 1 kerbal pod, without \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or an reaction wheel. Once I throttled up my engine (which has decent gimbal) even though my craft was already oriented pro-grade it started spinning very rapidly out of control with the gimbaling engine wildly changing angles.\n\u003C/p\u003E\n\u003Cp\u003E\nSo in summary - I think the current \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E implementation has serious issues both for planes and spacecrafts.  For spacecrafts I did a total of 3 flights so far and it only happened on one, so it\u0027s definitely not as bad there as for planes.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a more humoring aside, when it tried landing my plane it literally hopped up like bunny when touching the ground. \n\u003C/p\u003E\n"},{"CreatedByName":"sjsharks39","CreatedById":63345,"CreatedDateTime":"2023-02-24T17:20:20Z","Content":"\n\u003Cp\u003E\nI have too notice the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E in general in any flight scenario seems to be overtuned, or just need tuning in general with rockets, planes, etc. Guessing the PID\u0027s need some heavy tuning.\n\u003C/p\u003E\n"},{"CreatedByName":"Skorj","CreatedById":201273,"CreatedDateTime":"2023-02-24T18:14:41Z","Content":"\n\u003Cp\u003E\nBad PIDs were one of the key things that needed fixing from KSP1!  C\u0027mon, there\u0027s a point at which you abandon the PIDs and just point the craft the right way and kill rotation - this should happen whenever the craft is nearly at the correct attitude with low angular momentum.   Let the PIDs work the simulation to get it close, and then cheat and make the UI actually work.\n\u003C/p\u003E\n"},{"CreatedByName":"Profugo Barbatus","CreatedById":220450,"CreatedDateTime":"2023-02-24T20:25:09Z","Content":"\n\u003Cp\u003E\nI\u0027d also really like to see it release the last control setting when I take over and start giving inputs, like in KSP1. \u0022Up\u0022 is great for controlling descent speed for landing, but when I\u0027m trying to tilt to now kill the remaining horizontal velocity, it comes in and keeps trying to hard pull me to \u0027up\u0027, so I\u0027m fighting controls constantly. Since the only hotkey is \u0022On/Off\u0022 I just have to give up on \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E in landing approach and wing it.\n\u003C/p\u003E\n"},{"CreatedByName":"Dinkledash","CreatedById":224462,"CreatedDateTime":"2023-02-24T21:49:13Z","Content":"\n\u003Cp\u003E\nI agree, my elevators were overcontrolling with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E on takeoff, but I turned it back on when I was landing and it was really smooth.  Maybe it\u0027s only an problem when you\u0027re at high thrust relative to your speed?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-24T21:49:55Z\u0022 title=\u002202/24/2023 09:49  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 24, 2023\u003C/time\u003E by Dinkledash\u003C/strong\u003E\n\u003Cbr\u003Eelevators aren\u0026#039;t flaps\n\u003C/span\u003E\n"}]}