{"TopicId":212358,"ForumId":120,"TopicTitle":"First impressions and thoughts","CreatedByName":"essigwurst","CreatedById":226053,"CreatedDateTime":"2023-02-24T16:57:35Z","PageNum":1,"Articles":[{"CreatedByName":"essigwurst","CreatedById":226053,"CreatedDateTime":"2023-02-24T16:57:35Z","Content":"\n\u003Cp\u003E\nFirst of all, I was really looking forward and was very curious to try  this new game. So - after the first hours of gameplay, i decided to write a short feedback of what I\u0027m thinking about the game to this point.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first thing I experienced was right after launching into the game, straight up in the graphics menu:\u003Cbr\u003E\n- Some of the buttons are enabled / highlighted multiple times (e.g. Environment Prop Density, Game Screen Mode (at the first start of the game)) . This also occasionally happens during gameplay.\u003Cbr\u003E\n- It seems there are no resolutions to pick (the dropdown menu is empty at all screen modes and also after a restart of the game)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022settings_menu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://www.essigstudios.at/qrz/settings_menu.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe loading times of the game are pretty fast (compared to KSP1), at least on my machine. It\u0027s a pity that the game seems that it doesn\u0027t use multithreading too much, probably because of Unity.\n\u003C/p\u003E\n\u003Cp\u003E\nI really enjoy the new UI and spacecraft editor (also the customizable parts, e.g. wings). Would be nice, if there was a possibility to change the fuel type of / in a tank.\u003Cbr\u003E\nAlso,  I really like the new soundtrack and sounds.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah ... and if you played KSP1 \u0022enough\u0022 hours, you are pretty fast inflight - and that\u0027s where the \u0022troubles\u0022 begun. As mentioned by lots of other people before, there are massive performance drops\u003Cbr\u003E\non Kerbin and surrounding Kerbin. But: The main problem in my opinion is the physics associated with low frame rates, for example it happens ocasionally that the spacecraft just disappear / disintegrate / ..\u003Cbr\u003E\nwhen there is a (physics) load change, for example when the engines are out of fuel and they stop providing thrust. Or when you switch from air to a closed loop on the rapiers. Actually, currently this is\u003Cbr\u003E\nwhat bothers me the most, because once you are a bit away of kerbin, the performance is getting better (so the physics calculations in the back).\n\u003C/p\u003E\n\u003Cp\u003E\nThe last thing (maybe this is a system specific issue - I\u0027m not sure) I feel to share is the graphics, especially when flying through the clouds. Don\u0027t get me wrong, the graphics is really fancy, nice and well done,\u003Cbr\u003E\nbut I\u0027m talking about the edges of the spacecraft (they seem to \u0022flicker\u0022 and are really pixelated sometimes), for example:\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cimg alt=\u0022inflight.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://www.essigstudios.at/qrz/inflight.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone else experienced this kind of graphic \u0022issues\u0022?\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nTechnical details, for reference: i9-9900K @ 5,00 GHz; RX 6950 XT 16GB; 32GB RAM; Win 10 Pro; 1920x1200 (5760x1200 fullscreen); Samsung SSD\n\u003C/p\u003E\n"}]}