{"TopicId":212631,"ForumId":119,"TopicTitle":"Rover wheel performance issues","CreatedByName":"Fireheart_Industries","CreatedById":178510,"CreatedDateTime":"2023-02-25T08:05:05Z","PageNum":1,"Articles":[{"CreatedByName":"Fireheart_Industries","CreatedById":178510,"CreatedDateTime":"2023-02-25T08:05:05Z","Content":"\n\u003Cp\u003E\nOk, so I\u0027ve been trying to make a decent rover, but the wheels have such terrible performance that I feel like something went wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I decided to build a basic rover, and use the same base for all the rover wheels in the game so far to get some kind of comparison. The rover is built using the RC-R Rovemate as it\u0027s \u0022anchor\u0022 part, EAS-1 Grumble Seat for a kerbal pilot (kept getting some error without a kerbal controlling it), 2 RTC Rottweiler structural parts to extend it\u0027s length and give the wheels a part to attach to, 2 RTGs for power, and 4 Z-400 batteries to make sure I had plenty of stored power.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rover, minus any wheels weighs a total of 2.53t. Not particularly heavy by rover standards, so it\u0027s not that I\u0027m making them weigh as much as a Saturn V rocket or anything.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAfter time warping and accelerating until it reaches this rovers top speed, these are the results with each wheel\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe RoveMax S2 (Tiny) wheels top out at 0.9 Meters/sec\n\u003C/li\u003E\n\u003Cli\u003E\nThe RoveMax M1 (Moon rover lookalike) wheels top out at 6.8 Meters/sec.\n\u003C/li\u003E\n\u003Cli\u003E\nThe RoveMax RT-2L (Ruggedized) wheels top out at 10.2 Meters/sec\n\u003C/li\u003E\n\u003Cli\u003E\nThe RoveMax XL3 (Huge) wheels top out at 15.2 Meters/sec (without doing the left/right turning nonsense that makes it go to freaking PLAID)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI got the new RoveMax TR4 wheels to 32.7 Meters/sec before it decided to flip the rover for no discernable reason.\n\u003C/p\u003E\n\u003Cp\u003E\nThis HAS to be a bug, right? I haven\u0027t seen anyone use the old wheels to make a rover in any videos yet, so I don\u0027t really have a good comparison, but there\u0027s no way the wheels are INTENDED to perform so poorly. Has anyone else had any issues with rover wheels being depressingly underpowered?\n\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2023-02-25T08:33:11Z","Content":"\n\u003Cp\u003E\nJudging by the videos, wheels slide too much. Probably traction/friction parameters need some tuning. Did devs expose them, or is it all predefined/automatic?\n\u003C/p\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-02-25T11:01:48Z","Content":"\n\u003Cp\u003E\nThe collision meshes for the wheels are wrong. Wheels need a big update in the near future.\n\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2023-02-25T13:04:35Z","Content":"\n\u003Cp\u003E\nIs it true the wheels still have that ‘single point of contact’ physics? So they don’t work properly when moved off center. \n\u003C/p\u003E\n"},{"CreatedByName":"Sequence","CreatedById":42247,"CreatedDateTime":"2023-02-25T13:21:47Z","Content":"\n\u003Cp\u003E\nI had very slow speeds with the smallest wheels when I forgot to put batteries on my rover. Maybe try removing and reattaching your batteries? The \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is pretty janky at the moment, maybe the batteries got bugged on your build. \n\u003C/p\u003E\n"},{"CreatedByName":"Stoup","CreatedById":2804,"CreatedDateTime":"2023-02-25T13:46:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224241993\u0022 data-ipsquote-contentid=\u0022212631\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677330275\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim!\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, Majorjim! said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs it true the wheels still have that ‘single point of contact’ physics? So they don’t work properly when moved off center. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSeems to be. If you knock a vehicle on its side, most of the wheel will just phase into the ground, as it seems to not even have any collision on the sides. And then when it snaps to having ground contact again it places ridiculous forces on crafts, causing them to flip over and over. Had this happen with the stock large rover.\n\u003C/p\u003E\n"}]}