{"TopicId":212672,"ForumId":120,"TopicTitle":"The SOI interception and transfers visuals: good, but needs tweaking","CreatedByName":"Daniel Prates","CreatedById":172769,"CreatedDateTime":"2023-02-25T11:47:55Z","PageNum":1,"Articles":[{"CreatedByName":"Daniel Prates","CreatedById":172769,"CreatedDateTime":"2023-02-25T11:47:55Z","Content":"\n\u003Cp\u003E\nWhomever had the idea of improving the cues you get indicating the target body\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E via a visible volumetric sphere, and the point of entry-exit on the same \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E.... you\u0027re a genious. Thank you.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the execution needs some work. The basic idea is great but falls flat on being practical for a couple of reasons:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Now you no longer see what the flight path will be after entering the new \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E, with the periapsis indication. That was the single most useful tool we had in Ksp1 in that regard. If both visual cues can\u0027t coexist (because it would look too busy or whatever) sadly it is best to revert to the old system;\n\u003C/p\u003E\n\u003Cp\u003E\n2. The concentric blue circles atop the visual sphere.... man they\u0027re just too large, cartoonish even. The idea is excellent but the point of entry/exit has to be more discrete. As it is, its kinda of an eyesore and maybe the cause for removal of more important visual data;\n\u003C/p\u003E\n\u003Cp\u003E\n3. Overall in the older system I felt I had a better feeling of what would happen in the flightpath, regarding the changes due to future transfers. I cant quite put my finger on it but I think it felt more colorful and visually intuitive. Now everything looks too similar and confusing. Then again maybe it is just lack of practice. Worth mentioning tho.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Also, it feels I can see less ahead then what I could in the old syatem. Back then, I could do a single burn that would cause me to undergo a further 4 transfers and every patch of the flight plan would be there to see. Is it me or now you only see one or two ahead? Again, maybe lack of practice of my part, but it does feel I am getting less information than I used to.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-25T11:51:14Z\u0022 title=\u002202/25/2023 11:51  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 25, 2023\u003C/time\u003E by Daniel Prates\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IbanLoL","CreatedById":226270,"CreatedDateTime":"2023-02-25T12:06:47Z","Content":"\n\u003Cp\u003E\n\u002B1 on all 4 points stated above. I have the exact same feedback. I spent a lot of hours in ksp1 and still, I\u0027m struggling to see what is going to happen and where I will go.\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2023-02-25T12:12:13Z","Content":"\n\u003Cp\u003E\nI feel the concentric blue circles are fine in principle, but they are clashing with the rest of the orbital indicators which are all very minimalistic. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d add that you really need to see your post-maneuver orbital characteristics while adjusting the node. You can see it, but only when deselecting the node. \n\u003C/p\u003E\n"},{"CreatedByName":"modus","CreatedById":207631,"CreatedDateTime":"2023-02-25T12:45:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224241890\u0022 data-ipsquote-contentid=\u0022212672\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677325675\u0022 data-ipsquote-userid=\u0022172769\u0022 data-ipsquote-username=\u0022Daniel Prates\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n52 minutes ago, Daniel Prates said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E2. The concentric blue circles atop the visual sphere.... man they\u0027re just too large, cartoonish even. The idea is excellent but the point of entry/exit has to be more discrete. As it is, its kinda of an eyesore and maybe the cause for removal of more important visual data\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor me, they\u0027re just not necessary. A small indicator was more than enough (for me).\n\u003C/p\u003E\n\u003Cp\u003E\nSome mod will definitely fix that\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Pauver","CreatedById":209137,"CreatedDateTime":"2023-02-25T13:14:00Z","Content":"\n\u003Cp\u003E\n\u002B1 on all points, especially on the first one. Such a deal breaker for me, planning interplanetary intercepts is impossible rn\n\u003C/p\u003E\n"},{"CreatedByName":"jacksawild","CreatedById":178232,"CreatedDateTime":"2023-02-25T13:30:45Z","Content":"\n\u003Cp\u003E\nThe concentric blue circles are useful for eyeballing. If they are opposite sides, you are speeding past without much effect from gravity. The closer they are together the more effect you are feeling from the body, if you are entering and exiting on the same side then you are whipping around the body and circularisation should be cheap. I think making them different colours would be good, so you know if you are ahead or behind the orbit of the body, would make gravity assists much clearer than KSP1. Actual periapsis info and flight path would be ideal though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-25T13:32:40Z\u0022 title=\u002202/25/2023 01:32  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 25, 2023\u003C/time\u003E by jacksawild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2023-02-25T13:43:07Z","Content":"\n\u003Cp\u003E\nI couldn\u0027t seem to make the flyby trajectory show up around the Mun:\n\u003C/p\u003E\n\u003Cp\u003E\nFrom \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, setup a maneuver to intercept the Mun. Once it intercepts, the future trajectory deflects from the gravity assist like it always did. At this point I used to setup camera focus on the Mun, and closely investigate where my flyby actually goes (for aligning up with a Mun station, or preparing for some surface contracts). This usually looks like a disconnected trajectory, but it is all relative to the focused planet.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP2 i cannot get that to show up, even after changing planet focus \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\n\u003C/p\u003E\n"}]}