{"TopicId":212770,"ForumId":120,"TopicTitle":"2 suggestions","CreatedByName":"omega2003","CreatedById":226347,"CreatedDateTime":"2023-02-25T20:19:28Z","PageNum":1,"Articles":[{"CreatedByName":"omega2003","CreatedById":226347,"CreatedDateTime":"2023-02-25T20:19:28Z","Content":"\n\u003Cp\u003E\n1) Allow to add, modify or remove Maneuver nodes without having to select a target and allow it when the game is paused\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n2) Improve and correct the calculation of the deltaV of the ship that we build.\u003Cbr\u003E\nThe calculation of the deltaV for a stage whose motors are turned on after a decoupling step should not take into account the weight of what is on the other side of the decoupler \u003Cspan\u003E: According to the game my rocket was losing deltaV by adding powder boosters.\u003C/span\u003E\u003Cbr\u003E\nIt would also be necessary to be able to indicate for each launch stage what is the zone of space where the ship is supposed to be located: the DeltaV produced by an engine is not the same in an atmosphere or in the space vacuum.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously these are less important changes than the correction of bugs that currently make the game unplayable.\n\u003C/p\u003E\n"},{"CreatedByName":"mattihase","CreatedById":73161,"CreatedDateTime":"2023-02-25T21:59:10Z","Content":"\n\u003Cp\u003E\nWait, that\u0027s why Delta V calc is scuffed rn? dman\n\u003C/p\u003E\n"},{"CreatedByName":"omega2003","CreatedById":226347,"CreatedDateTime":"2023-02-26T00:34:08Z","Content":"\n\u003Cp\u003E\nI did more tests and finally their calculation bug is not what I thought. In the end, their miscalculation looks more complicated.\u003Cbr\u003E\nI did a test with MY size items. We would have to test with the other elements to find out if this is a problem that concerns all the elements.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I\u0027ve seen, if you put a tank with an engine on a TT-38X side decoupler, that items is ignored in the deltaV calculation. If we connect tank directly to the central piece, it is counted.\u003Cbr\u003E\nIf you put a powder booster on a TT-38X decoupler, its fuel and weight seem to be taken into account. If it is connected directly to the center piece or to another powder booster, the calculated DeltaV decreases slightly. It\u0027s as if the weight was taken into account but not its fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThey have really weird bugs in this version.\n\u003C/p\u003E\n"}]}