{"TopicId":212832,"ForumId":196,"TopicTitle":"Clouds Make Low Quality Craft","CreatedByName":"Homaridae","CreatedById":226391,"CreatedDateTime":"2023-02-26T01:11:23Z","PageNum":1,"Articles":[{"CreatedByName":"Homaridae","CreatedById":226391,"CreatedDateTime":"2023-02-26T01:11:23Z","Content":"\n\u003Cp\u003E\nWhen Flying craft through the clouds there are patches and cube like things in the clouds and it lowers the quality of the craft and makes the edges cubes\n\u003C/p\u003E\n"},{"CreatedByName":"W2D2","CreatedById":212625,"CreatedDateTime":"2023-03-02T12:18:22Z","Content":"\n\u003Cp\u003E\nI\u0027ve seen that low-quality effect when my laptop wasn\u0027t plugged in. I think it\u0027s the game coping with dropped frame rates when my 3070 mobile GPU can\u0027t handle the load on battery power.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d turn on the FPS measurements and take a look at your frame rate.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d turn off pc power balancing mode and put it on high performance.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d check my drivers and update if available.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d plug in power if it\u0027s a laptop.\n\u003C/p\u003E\n\u003Cp\u003E\nMy 2cts\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2023-03-02T14:04:00Z","Content":"\n\u003Cp\u003E\nthe clouds look like they are put in post. would explain the pixelation. of course i had aa off since i don\u0027t feel its necessary at 4k.\n\u003C/p\u003E\n"},{"CreatedByName":"LeroyJenkins","CreatedById":227115,"CreatedDateTime":"2023-03-02T17:36:45Z","Content":"\n\u003Cp\u003E\nI saw this same pixelation as well. Images from landing on Eve. When clouds were in behind the craft the bottom heat shield got pixelated. When rotating the view so the clouds where not behind the craft. heat shield was hi-res again. The parachute faring can be seen as hi res in image, but if view is rotated so the clouds were behind it, it would also go pixelated.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022h5Nmle5.jpg\u0022 src=\u0022https://i.imgur.com/h5Nmle5.jpg\u0022\u003E\u003C/span\u003E\u003Cimg alt=\u0022h5Nmle5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/h5Nmle5.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nVersion Info: 0.1.0.0.20892\u003Cbr\u003E\nOS: Windows 11  (10.0.22621) 64bit\u003Cbr\u003E\nCPU: AMD Ryzen 9 5950X 16-Core Processor  (32)\u003Cbr\u003E\nRAM: 130992\u003Cbr\u003E\nGPU: NVIDIA GeForce RTX 3090 (24340MB)\u003Cbr\u003E\nSM: 50 (Direct3D 11.0 [level 11.1])\u003Cbr\u003E\nFPS: 60 rock solid\u003Cbr\u003E\nRT Formats: ARGB32, Depth, ARGBHalf, Shadowmap, RGB565, ARGB4444, ARGB1555, Default, ARGB2101010, DefaultHDR, ARGB64, ARGBFloat, RGFloat, RGHalf, RFloat, RHalf, R8, ARGBInt, RGInt, RInt, BGRA32, RGB111110Float, RG32, RGBAUShort, RG16, BGRA10101010_XR, BGR101010_XR, R16\n\u003C/p\u003E\n"}]}