{"TopicId":21282,"ForumId":16,"TopicTitle":"Uncontrollable Roll","CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T02:48:31Z","PageNum":1,"Articles":[{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T02:48:31Z","Content":"\n\u003Cp\u003EI have a rocket, which took an unwanted amount of strutting to stabilise from wobbling; however, the rocket invariably starts into a clockwise roll that makes it virtually uncontrollable. I cannot stop this roll from happening, nor can I counteract it once it has started. I am looking for advice on how to stop this from happening.\u003C/p\u003E\u003Cp\u003EAlso, ASAS will tear the ship apart if used, so I will not be using it.\u003C/p\u003E\u003Cp\u003EPictures:\u003C/p\u003E\u003Cp\u003EAscent stages:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8UYRo.jpg?1\u0022 alt=\u00228UYRo.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EInterplanetary and lander stages:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Lx4QX.jpg?1\u0022 alt=\u0022Lx4QX.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jeebs24","CreatedById":36727,"CreatedDateTime":"2012-10-04T03:04:20Z","Content":"\n\u003Cp\u003EIt\u0027s all the SAS. I got rid of them and it stopped spinning.\u003C/p\u003E\n"},{"CreatedByName":"fishbord","CreatedById":33091,"CreatedDateTime":"2012-10-04T03:16:30Z","Content":"\n\u003Cp\u003Elol dude i i could see the sas ****ing it up in this pic lol guys sas is good near center of mass\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T03:45:46Z","Content":"\n\u003Cp\u003ETook the SAS off, and it still really wants to go into a spin, though it isn\u0027t a guaranteed clockwise anymore.\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2012-10-04T04:23:29Z","Content":"\n\u003Cp\u003EReplace the lower fins with controllable winglets/canards. Your SAS/ASAS units are OK for in-orbit work (albiet, slow) where there\u0027s no aerodynamics at work..but for ascent, they really need something to move air around. Not sure if SAS controls winglets like ASAS does, but it should be worth a shot.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-10-04T05:20:35Z","Content":"\n\u003Cp\u003EIve always had this problem with large rockets.\u003C/p\u003E\u003Cp\u003ESouloution: RCS.\u003C/p\u003E\u003Cp\u003EThe reason is, I think the gimballing engines cant controll roll, only pitch and yaw\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2012-10-04T05:53:11Z","Content":"\n\u003Cp\u003EWhy don\u0027t multiple engines control roll? You would think that the flight computer would be able to tell...\u003C/p\u003E\u003Cp\u003EWhen running a single engine, I use a pair of NovaPunch Verniers for added roll authority, and with excellent results. The added thrust never hurts, either. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T07:01:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fendleton\u0022 data-cite=\u0022Fendleton\u0022\u003E\u003Cdiv\u003EReplace the lower fins with controllable winglets/canards. Your SAS/ASAS units are OK for in-orbit work (albiet, slow) where there\u0027s no aerodynamics at work..but for ascent, they really need something to move air around. Not sure if SAS controls winglets like ASAS does, but it should be worth a shot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the large engines weren\u0027t gimbaled, ASAS and canards would be an option, but as it is, the constant overcorrection of ASAS literally tears the ship apart... violently.\u003C/p\u003E\u003Cp\u003ERCS has never really helped me with ships this large, when in atmosphere, and this thing starts spinning around 10km. Thinking about it now, canards might be useful at the time when this rotation is its most dangerous...\u003C/p\u003E\n"},{"CreatedByName":"kamilDrakari","CreatedById":52962,"CreatedDateTime":"2012-10-04T07:19:04Z","Content":"\n\u003Cp\u003EIt\u0027s fine to leave off the ASAS as long as you can go straight easily, but if you replace the fins with controllable winglets or canards then you can just stop the roll manually. As long as you keep it to a manageable amount then you will probably be fine once the first stage separates.\u003C/p\u003E\u003Cp\u003EAlso, what\u0027s the purpose of the wings on the middle stage up there? Given the quantity of thrust and fuel you have in the first few stages I\u0027d imagine you\u0027d be beyond the atmosphere by then, and they may be applying their lift rotationally during the first stages.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-10-04T08:00:51Z","Content":"\n\u003Cp\u003EAgain your rocket is too tall, you have too many tanks. You are using at least your first 3 rows of tanks just to lift the other 2, which is counter productive. Your thrust to weight ratio is too low and you hang around at low altitudes for too long, which is wasteful.\u003C/p\u003E\u003Cp\u003EStick to no more than 2 or 3 large tanks on those 2m boosters. You will drop them earlier, but you will be going faster and higher.\u003C/p\u003E\u003Cp\u003E(Also, launching heads down is going to be uncomfortable for the crew !)\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T08:26:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EAgain your rocket is too tall, you have too many tanks. You are using at least your first 3 rows of tanks just to lift the other 2, which is counter productive. Your thrust to weight ratio is too low and you hang around at low altitudes for too long, which is wasteful.\u003Cp\u003EStick to no more than 2 or 3 large tanks on those 2m boosters. You will drop them earlier, but you will be going faster and higher.\u003C/p\u003E\u003Cp\u003E(Also, launching heads down is going to be uncomfortable for the crew !)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have tried shorter, wider rockets, and they never turn out well for me -- especially since they either barely fit on the launch pad, or force me to launch on the runway.\u003C/p\u003E\u003Cp\u003EI tried less fuel per engine, and it requires wider rockets to fly higher. This is the only combination I have found practical to reach orbit with a load as heavy as the one I am carrying (despite my current inconveniance).\u003C/p\u003E\u003Cp\u003EIt\u0027s either launch heads down, or land heads down. Landing heads down is not an option, as I would like to EVA, and the above-pod decouplers don\u0027t work right if they are arranged differently. Also, the sky crane is heavy, which makes having it lower much better for take-off.\u003C/p\u003E\u003Cp\u003EThe whole sky-crane setup is part of a two-fold experiment: if I can get something so heavy into space and to another planet; if I can get such a pod to land on a planet AND return. Also, I made a sky-crane so I could use it to land on Duna, in tribute to Curiosity.\u003C/p\u003E\u003Cp\u003EAlso, can anybody explain why any SAS WANTS this thing to spin horribly? Below is an example of what ASAS tells this thing to do, in addtion to the rapid, jerky movements it instructs to the engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vd0so.jpg\u0022 alt=\u0022vd0so.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, also, the wings in the middle you guys asked about are to provide \u0022footholds\u0022 for vertical supports, because otherwise it wobbles terribly, as the individual parts seem unable to take the strain.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-04T08:34:26Z\u0022 title=\u002210/04/2012 08:34  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 4, 2012\u003C/time\u003E by TheHengeProphet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2012-10-04T08:49:26Z","Content":"\n\u003Cp\u003ETypically when this happens to me, I just forgot to add the fuel lines symmetrically. so one side of the rocket is draining, while the other side is not.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2012-10-04T10:19:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhy don\u0027t multiple engines control roll?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMultiple gimbaling engines only point in the same direction, so you can\u0027t use them to roll.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ecan anybody explain why any SAS WANTS this thing to spin horribly?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t use them. However, from what I have read, they don\u0027t really work well unless they are in the central stack. Having a ring of them can probably do more harm than good. There\u0027s no need for them and I expect them to be removed eventually, since i think they were an interim thing when the physics was less stable.\u003C/p\u003E\u003Cp\u003EIMO If your having roll problems, use ASAS and controllable fins. Past the thick atmosphere where fins won\u0027t help, it is rare to have any roll issues anyhow.\u003C/p\u003E\n"},{"CreatedByName":"Steelfury","CreatedById":53731,"CreatedDateTime":"2012-10-04T14:01:48Z","Content":"\n\u003Cp\u003EHave you tried throttling back a bit when you reach the upper atmosphere? I find with the big rockets using mainsails that as they empty they cause a lot of instability if on full throttle. Also, attaching fuel tanks radially with smaller engines on them and then dumping those once they\u0027re empty seems to work well.\u003C/p\u003E\n"},{"CreatedByName":"kamilDrakari","CreatedById":52962,"CreatedDateTime":"2012-10-04T14:05:30Z","Content":"\n\u003Cp\u003EHe already has controlable fins and ASAS destroys the rocket.\u003C/p\u003E\u003Cp\u003EIf all else fails you can just ignore the spinning during ascent. By the time you get out of the atmosphere you will probably have disconnected the outer staging, and it should be more manageable then. Maybe add some extra RCS thrusters somewhere since I doubt the pod\u0027s internal SAS will do that quickly.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-10-04T14:19:52Z","Content":"\n\u003Cp\u003EA well set up rocket shouldn\u0027t really spin much. Also once you are a bit out of atmo, any control surface shouldn\u0027t work anyways. RCS are okay on vanilla when you jettison your booster stages, but in a heavy rocket, the effect is also minmimal. The main cause of spin is often wobble. Starts to offset, starts to turn and then you get the gyroscopic effect. All it takes is a slight deflection of your thrust engines and suddenly they are perma-angled. It is probable the flex is coming from the command module section of the rocket since it doesn\u0027t seem like there is any reinforcement across those couplers.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-04T14:40:26Z","Content":"\n\u003Cp\u003EThe ASAS isn\u0027t technically overcorrecting, it\u0027s just trying to correct based on the command pod orientation rather than that of the centre of mass for the ship and since your command pod sways a lot the corrections don\u0027t have the desired effect.\u003C/p\u003E\u003Cp\u003EPersonally when a rocket gets to this point I rename it to be the Mark 2, delete the troublesome stages and start again. In this case I\u0027d move your interplanetary stage to be radially coupled to the top stage to reduce height.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-04T15:35:39Z\u0022 title=\u002210/04/2012 03:35  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 4, 2012\u003C/time\u003E by EndlessWaves\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2012-10-04T15:34:40Z","Content":"\n\u003Cp\u003EAs far as I can tell the problem in the abundance of SAS, winglets, and mostly: \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ethe wings you\u0027re using for structure\u003C/span\u003E. These wings have lift and as that is being applied \u0022sideways\u0022 it causes the rocket to spin.\u003C/p\u003E\u003Cp\u003EI was able to get your rocket mostly stable by taking off the SAS, reducing the number of winglets by half, and taking away the structural wings. With that done I could install a large ASAS unit to control the remaining winglets, and put up some more struts to stiffen the upper structure. Result: catastrophic success! No more roll, but the next problem is in your stages smashing into each other during separation. So I ripped out the fuel lines to get rid of the semi-asparagus staging. With your entire first stage burning at full throttle I was able to get the craft into a gravity roll towards orbit. That\u0027s where I gave up because I couldn\u0027t learn upside-down controls \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But having pushed the apoapsis up to nearly 300km even on a counter-rotational trajectory, I do believe this ship has the power to make it to orbit, and from there, to interplanetary spaaaaaace!\u003C/p\u003E\u003Cp\u003E[ATTACH]34238[/ATTACH]\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-04T21:40:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EndlessWaves\u0022 data-cite=\u0022EndlessWaves\u0022\u003E\u003Cdiv\u003EThe ASAS isn\u0027t technically overcorrecting, it\u0027s just trying to correct based on the command pod orientation rather than that of the centre of mass for the ship and since your command pod sways a lot the corrections don\u0027t have the desired effect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt technically is overcorrecting, as it causes a large amout of lateral movement with gimbaling, but does not bother to cancel it out until after it should have, leading to the exact same situation that caused it to correct in the first place. Even if it is correcting relative to pod position, overcorrection is overcorrection, as such a definition does not discriminate on the cause of the overcorrection.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wayfare\u0022 data-cite=\u0022Wayfare\u0022\u003E\u003Cdiv\u003EAs far as I can tell the problem in the abundance of SAS, winglets, and mostly: \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ethe wings you\u0027re using for structure\u003C/span\u003E. These wings have lift and as that is being applied \u0022sideways\u0022 it causes the rocket to spin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWings in KSP operate on something more akin to magick than aerodynamics. They provide directionless lift that does not seem to interfere with rockets; otherwise, launching spaceplanes on rockets would be a total nightmare.\u003C/p\u003E\u003Cp\u003EOn another note, your version of my rocket works with ASAS, barely. It flops like a dead fish, which is why I had the wing for structural support, and still rolls horribly when moving for a gravity burn.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EIMO If your having roll problems, use ASAS and controllable fins. Past the thick atmosphere where fins won\u0027t help, it is rare to have any roll issues anyhow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the post I made prior to yours, please note the fin orientation on the rocket, as this is what the ASAS is telling them to do.\u003C/p\u003E\u003Cp\u003EThank you all for your help! I will keep experimenting, because I must get this into space!\u003C/p\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2012-10-04T22:12:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWings in KSP operate on something more akin to magick than aerodynamics. They provide directionless lift that does not seem to interfere with rockets; otherwise, launching spaceplanes on rockets would be a total nightmare.\u003Cp\u003EOn another note, your version of my rocket works with ASAS, barely. It flops like a dead fish, which is why I had the wing for structural support, and still rolls horribly when moving for a gravity burn.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, I took the \u0022center of lift\u0022 arrow as an indication that lift did work directionally. As far as I know launching spaceplanes on rockets \u003Cem\u003Eis\u003C/em\u003E a nightmare. Then again, as far as I know getting planes off a runway in one piece is a nightmare \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Not my field of expertise, wings, so hey - put them back on and see if that gives your rocket better structural stability. \u003C/p\u003E\u003Cp\u003EI did find that the ASAS wants to tear the ship apart but with only half the number of winglets, it no longer has the power to do that. I had no major roll issues though. Note that I switched the ASAS off when I - gently - started the gravity turn, and only turned it back on once the rocket was pitched over 45 degrees. Something else you might try is to shorten the central stack by one tank and then pushing the boosters up. This would extend your fairly rigid lower structure further up the rocket, reducing the sway at the cost of some fuel (but you gain a lot of that back in having less mass to push up, so the net loss in get-up-theredness should be mild).\u003C/p\u003E\u003Cp\u003EOn the whole I don\u0027t think you\u0027ll ever get a truly stable rocket out of that design - you will need to babysit its ascent very closely. But I do think you can get it into orbit. It\u0027s a rocket that Jeb would call \u0022fiesty\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John F. Kerman","CreatedById":40209,"CreatedDateTime":"2012-10-04T23:30:37Z","Content":"\n\u003Cp\u003EI\u0027ve had uncontrollable roll with rockets like you\u0027ve built as well. The upper stages are fine but by the time I\u0027ve jettisonned the lower stages it\u0027s usually too late \u0026amp; I\u0027ve wasted too much fuel trying to sort it out. Adding canards and turning off ASAS during the initial launch stages worked for me (most of my craft are top-heavy, and (A)SAS just shakes things around too much)\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-05T03:08:36Z","Content":"\n\u003Cp\u003EYou get a lift arrow? I checked the center of lift and it did not list a direction of lift for me. I\u0027ve used wings on other rockets and launched space planes to the same effect.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-10-05T03:51:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHengeProphet\u0022 data-cite=\u0022TheHengeProphet\u0022\u003E\u003Cdiv\u003EI have tried shorter, wider rockets, and they never turn out well for me -- especially since they either barely fit on the launch pad, or force me to launch on the runway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it is a problem I dislike as well. The launch pad is now too small. It needs to be torn down and a new one built. Or multiple pads. The way around this (which I never remember to do before first launch) is if you look at the rocket side on, you can move it away from the doors in the screen with the capsule drag. This also moves the rocket further from the launch tower.\u003C/p\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2012-10-05T08:33:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHengeProphet\u0022 data-cite=\u0022TheHengeProphet\u0022\u003E\u003Cdiv\u003EYou get a lift arrow? I checked the center of lift and it did not list a direction of lift for me. I\u0027ve used wings on other rockets and launched space planes to the same effect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot on this rocket, but normally, placing wings gives you a lift arrow. I figured with four wings working in different directions, KSP couldn\u0027t figure out where the lift is directed. They cancel each other out in terms of actually lifting anything, creating nothing but roll. That said, I have a pretty poor grasp on KSP\u0027s lift mechanics and went by \u0022what would happen if I placed four aerofoils vertically like that on a real rocket.\u0022 I may very well be wrong. In that case, putting the wings back on could definitely help in bringing the wobble under control.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2012-10-05T13:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EAgain your rocket is too tall, you have too many tanks. You are using at least your first 3 rows of tanks just to lift the other 2, which is counter productive. Your thrust to weight ratio is too low and you hang around at low altitudes for too long, which is wasteful.\u003Cp\u003EStick to no more than 2 or 3 large tanks on those 2m boosters. You will drop them earlier, but you will be going faster and higher.\u003C/p\u003E\u003Cp\u003E(Also, launching heads down is going to be uncomfortable for the crew !)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot quite so true; 5 large tanks above the 2m booster engine is about the perfect efficiency in terms of altitude gain from fuel vs. loss from weight. Granted, adding 5 large tanks by itself is slow off the launch pad, so if any significant weight is in later stages, 4 large tanks are better just so the rocket can get off the launchpad. Also, hanging around at lower altitudes by going slowly is actually \u003Cem\u003Emore\u003C/em\u003E efficient because of atmospheric resistance! Accellerating as fast as possible to 170 m/s at 2-3 km is much less efficient than going 100-150 m/s through the same altitude range, and then accellerating even more later. It may be wasteful (not denying that at all), but it\u0027s certainly the easiest and simplest way of getting a large weight into orbit. It all depends on whether or not you\u0027d rather be small, cheap, and efficient, or large, expensive, and effective!\u003C/p\u003E\u003Cp\u003EI also haven\u0027t had too many problems with very tall rockets, and if anything, they\u0027re easier to controll roll with because there isn\u0027t a lot of weight going outwards and having to slow their momentum. Then again, wide ones are harder to start rolling because of momentum, so maybe that would be better for this rocket XD idk lol\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-05T13:49:39Z\u0022 title=\u002210/05/2012 01:49  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 5, 2012\u003C/time\u003E by Ekku Zakku\u003C/strong\u003E\n\u003C/span\u003E\n"}]}