{"TopicId":213061,"ForumId":136,"TopicTitle":"RTX4070ti 25-30fps during launch","CreatedByName":"K9THUNDER","CreatedById":226498,"CreatedDateTime":"2023-02-26T08:06:30Z","PageNum":1,"Articles":[{"CreatedByName":"K9THUNDER","CreatedById":226498,"CreatedDateTime":"2023-02-26T08:06:30Z","Content":"\n\u003Cp\u003E\nHi Users and Mods,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m experiencing performance issues with my brand new rtx4070ti. I\u0027m running a setup with i7 8086k overclocked to 5ghz and 16gb ram. In \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003Evab\u003C/abbr\u003E i\u0027m getting 100fps and in space about 80fps. During launch i\u0027m getting just 25-30 fps max with all settings almost maxed out at 1440p. If i look at my cpu and gpu load they both dont go over 60% during play which i find strange. Could this be an optimization issue or is there something that i\u0027m missing?. \n\u003C/p\u003E\n\u003Cp\u003E\nBr,\n\u003C/p\u003E\n\u003Cp\u003E\nK9THUNDER\n\u003C/p\u003E\n"},{"CreatedByName":"K9THUNDER","CreatedById":226498,"CreatedDateTime":"2023-02-26T09:22:07Z","Content":"\n\u003Cp\u003E\nTo further support my case:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Performance.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.31\u0022 height=\u0022354\u0022 width=\u0022640\u0022 src=\u0022https://i.ibb.co/PWpxN28/Performance.png\u0022\u003E\u003Cimg alt=\u0022Performance-2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.57\u0022 height=\u0022165\u0022 width=\u0022308\u0022 src=\u0022https://i.ibb.co/tq88tJv/Performance-2.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Sixstrings","CreatedById":137891,"CreatedDateTime":"2023-02-26T11:51:18Z","Content":"\n\u003Cp\u003E\nCertainly an optimization issue imo. I\u0027ve seen videos and streams where RTX4090 configs get 15fps at launch with rockets that are not that complex. On my side framerate is very uneven at 1080p-medhigh with a 3060ti. A decent 60fps average in space but sub-zero fps during liftoff if the rocket has more than 30 parts or so. Optimization will come, gotta be patient !\n\u003C/p\u003E\n"},{"CreatedByName":"FuelX","CreatedById":163054,"CreatedDateTime":"2023-02-26T14:43:27Z","Content":"\n\u003Cp\u003E\nI play with a 3070 ti and my GPU is not the bottleneck. Especialy with rovers and rockets with high parts count or fuel lines. The way I test this is by playing with graphics quality and resolution. 4k should be mostly 4 times more demanding on your GPU than 1080p. High quality graphics should also be more demanding on your vram. \n\u003C/p\u003E\n\u003Cp\u003E\nMy observation are similar to Sixstrings. On a very simple ship I get over 60 fps in 1080p and about 30 to 40 fps in 4k. However, when I play around the space center in my rover I cap at 20fps whatever the resolution and graphics quality. \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s my task manager and hwmonitor on the launch pad with a very basic rocket and some highlights. Basicaly, my GPU is doing everything it can and a better GPU would do more :\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002262.56\u0022 width=\u0022796\u0022 alt=\u0022UKKQXkN.png\u0022 src=\u0022https://i.imgur.com/UKKQXkN.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd now with a complex rover on the runway \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002262.74\u0022 width=\u0022797\u0022 alt=\u0022pUSwcql.png\u0022 src=\u0022https://i.imgur.com/pUSwcql.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis second screen is much like yours. I dont see any evident bottleneck. Maybe it is RAM or VRAM bound but it is unlikely. My VRAM is fully used but not yours.\n\u003C/p\u003E\n\u003Cp\u003E\nI cannot know what is going on but it is likely a software issue. For example, bad timings or processes waiting for other processes. Picture it like a jam caused by bad traffic signal synchronization.  \n\u003C/p\u003E\n\u003Cp\u003E\nSo  yeah, there is some optimisation required. Optimisation is time consuming but I\u0027m hopeful they will eventualy fix these issues.\n\u003C/p\u003E\n"}]}