{"TopicId":213130,"ForumId":119,"TopicTitle":"Observations on aero and part balance","CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-02-26T11:17:44Z","PageNum":1,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-02-26T11:17:44Z","Content":"\n\u003Cp\u003E\nSo let\u0027s talk about the gameplay itself for once, shall we? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cspan\u003E I\u0027ve not done a whole lot in KSP2 yet, but I did do a few comparisons to KSP1, just to see how close the two games were, and where they would differ.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe primary difference I found is that apparently, the aerodynamics model is noticeably more sensitive when it comes to the shape of parts and the vessel you build. There\u0027s a bigger difference between \u0022sleek and pointy\u0022 and \u0022blunt and flat\u0022 than before.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit A: I am consistently reaching low Kerbin orbit with 3200 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E now, where I needed 3400-3500 in KSP1. Sometimes even a bit less than 3200. The rockets I was testing this with are super simple: mk1 pod with a parachute, fuel tanks, and engine. Nothing attached to the outside.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit B: I tried launching an uncrewed probe. I knew my launch vehicle was passively unstable, as it had no second stage to keep the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E forward (it is \u003Cem\u003Eso easy\u003C/em\u003E to get into Kerbin orbit single-stage), and a fairing larger than the stack, but I stubbornly tried anyway. After flipping over three times, I gave in to common sense and went back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, planning to add a second stage. But on a hunch, the first thing I tried was tucking the solar panels just a bit more snugly against the probe, and rebuilding the fairing just a bit more snugly around it. I also made the tip of the fairing more pointy. Fairings currently appear to be massless, so there\u0027s no reason to be stingy. Lo and behold - the thing flew without flipping! Just by changing the aerodynamics of the fairing.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit C: In KSP1, I would typically hold on to my fairings until about 45 km. By common wisdom, this was already considered fairly high, and most players would ditch their fairings lower than that. This time in KSP2, I had troubles with fairing separation under thrust (in KSP1 I used to turn \u003Cem\u003Edown\u003C/em\u003E the separation force of fairings to get a smooth detach, here in KSP2 it seems I need to turn it \u003Cem\u003Eup\u003C/em\u003E instead), and so I hung on to my fairing until I had my AP where I wanted and shut down the engine. That was at 55 km altitude. Just coasting like that, my apoapsis altitude changed by maybe one meter per second, dropping due to drag on the vehicle. As soon as I popped the fairings, though? The apoapsis altitude started changing rapidly, maybe as much as 10 meters per second. Not a problem, obviously, as I was rapidly leaving the atmosphere behind, but that is a huge amount of drag for 55km. An order of magnitude drag increase just from popping the fairing around a XS size probe. KSP2 definitely encourages us to encapsulate our payloads, and hang on to our fairings for longer.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: apologies for how this post became a wall of text; I was trying to split it into two posts, but the forum force-merges them every time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe second difference? There were a lot of rocket engine buffs. A few nerfs too, though far fewer and smaller. Overall, engines have gotten better, which probably contributes to how it feels easier to launch now than in KSP1.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe Reliant lost 5s of Isp (260s-305s instead of 265s-310s), but got uprated from 240 to 260 kN. Doesn\u0027t seem like much, but where a 16 ton vehicle would have a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 1.307 on the pad in KSP1, the same vehicle will have a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 1.412 in KSP2. That\u0027s a difference you\u0027ll notice in flight. In a sense, the Reliant became the Kodiak from Making History, and that was a no-brainer upgrade.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Swivel got a major buff - and fairly so, I\u0027d say, considering how the Reliant overshadowed it in KSP1. Vacuum Isp and thrust stayed the same, but sea level Isp went from 250s to 280s, and as a result, sea level thrust went from 168 kN to 188 kN. At the same time, its mass dropped from 1.5 tons to 1.4 tons. It\u0027s a much better engine now.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Terrier actually received a mild nerf! Only 335s vacuum Isp instead of 345s. This will definitely impact the way we build Mun landers. However, its role as a second stage engine for launches from Kerbin wasn\u0027t much affected, because its sea-level Isp went from 85s to 170s. The Terrier will now be more efficient and have better \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E just after stage separation.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Dart got a big swing with the nerfbat. 300s-320s Isp instead of 290s-340s, and maximum thrust dropped from 180 kN to 170 kN. But fear not... even after all that, it still remains one of the best launch engines for S-size stacks in the game. Just shows how \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E it used to be in KSP1.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Vector was another nerf candidate: it got downrated from 1000 kN to 850 kN, sea level Isp dropped from 295s to 285s, and everything else stayed the same. Yeah, it\u0027s strictly worse now. Yeah, it\u0027s still a silly engine for its form factor, and you should have no issues building shuttle replicas.\n\u003C/li\u003E\n\u003Cli\u003E\nHey, remember the Thud? Yeah, me neither! \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E In all seriousness, that engine was so underwhelming in KSP1. Now it went from 120 kN max thrust to 140 kN, hopefully helping it find more use.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nLooking at the XS-sized engines, the allmighty Ant got its vacuum Isp increased from 315s to 330s, though sadly it lost its non-blocky second variant, which I loved... \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \u003C/span\u003EThe spider got 25% more thrust with no other changes (2.0 kN -\u0026gt; 2.5 kN), while the Twitch got a little heavier (80kg -\u0026gt; 100kg) and had its Isp changed from 275s-290s to 265s-298s. The Spark lost 5s vacuum Isp but gained 5s sea level Isp (now 270s-315s).\n\u003C/li\u003E\n\u003Cli\u003E\nGoing up in size instead, the Skipper got... nerfed? A little? Max thrust went from 650 kN to 600 kN. But Isp went up... strictly speaking... theoretically... by exactly 2s \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nBut hey, at least the Mainsail, which already had too much thrust in KSP1, now has even more thrust! 1600 kN instead of 1500. It lost a lot of Isp though, going from 285s-301s to 265s-307s. Prepare to dump a lot of fuel into this hungry maw. But when you do, \u003Cem\u003Eit\u0027ll go\u003C/em\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Poodle unsurprisingly got the same treatment as the Terrier, meaning: less vacuum Isp (350s -\u0026gt; 340s) but more sea level Isp (90s -\u0026gt; 175s). But unlike the Terrier, it also went down in max thrust significantly, from 250 kN to 215 kN. Fair enough, it used to be on the awkwardly-too-strong side for most landers. This might actually make it easier to use.\n\u003C/li\u003E\n\u003Cli\u003E\nAnother size class up, the Rhino went on a diet: 8 tons instead of 9. In return its maximum thrust dropped from 2000 kN to 1750. The redesign away from orbital use to a sustainer type is felt in the Isp, which changed from 205s-340s to 285s-325s. For orbital work we now have the Labradoodle, which is completely new.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Mammoth is now the Mammoth-II, and looks the part of its namesake with its ginormous \u003Cs\u003Etrunk\u003C/s\u003E errr I mean turbopump exhaust. It got a mild thrust uprating from 4000 kN to 4250 kN, and like the mainsail, lost a good chunk of Isp: 270s-310s instead of 295s-315s.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nAll of the SRBs stayed the same, and I didn\u0027t look at the jet engines, as I\u0027m just not a plane type of person.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nHere is where it gets really interesting though: the high-impulse, alternative-fuel engines. All of them got \u003Cem\u003Eso much stronger\u003C/em\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nJust look at the Nerv. Maximum thrust went from 60 kN to 75 kN. Isp went from 185s-800s to 250s-900s. Those are two massive buffs, but it\u0027s not the end just yet: in KSP2, all fuel tanks - including hydrogen - got normed to a mass ratio of 9, whereas in KSP1, the plane parts that were so often used with the Nerv due to a lack of dedicated \u003Cabbr title=\u0022Liquid Fuel\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u003C/abbr\u003E-only rocket tanks were more around 8. So not only did the engine get a lot better, the tanks for the engine got better too!\n\u003C/li\u003E\n\u003Cli\u003E\nThen there\u0027s the new nuclear engine, the Swerv. And it\u0027s absurd. There were modded engines available for KSP1 that were considered \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E, and they were not as \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E as this engine is. It is overtuned to such a monstrous degree next to all other engines, there\u0027s just no comparison. I reckon this is our preview for what higher tech levels are going to be offering, at a game stage where the Kerbals have colonies all over the system and interstellar technology is close at hand.\n\u003C/li\u003E\n\u003Cli\u003E\nLet\u0027s not forget the Dawn ion drive, either. On the surface, it received a small nerf, in the sense that it needs a bit more energy to run now (10 EC/s instead of 8.74 EC/s). But just like the Nerv is benefitting from better tankage, so is the Dawn. Xenon tanks used to have a mass fraction of 4. Now, just like all other tanks, they\u0027re at 9. That means they contain \u003Cem\u003Emore than two and a half times\u003C/em\u003E the amount of xenon for the same dry mass. You might not notice it that much when attaching only a single tank and getting a small few thousand m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E; but it\u0027s gonna scale so much higher so much more easily. A single ion stage with 40,000m/s worth of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E would have been borderline impossible in KSP1 even without worrying about how to launch it; now in KSP2, it\u0027s not any harder to achieve than making a Terrier stage with 3,100m/s worth of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nAnd remember, the perhaps biggest buff to low-\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E engines like the Nerv and Dawn: the ability to time warp during burns. I mean, once that actually works reliably \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E But yeah, get used to the idea of working a lot more with really high \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E deep space craft in the future. It\u0027s gonna be easier than ever before.\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T11:23:55Z\u0022 title=\u002202/26/2023 11:23  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2023-02-26T13:47:20Z","Content":"\n\u003Cp\u003E\nDart was not \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E in KSP1.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s only use really was as a core stage burning from liftoff to orbit and beyond. To do well at that job, it needs a good thrust to cross section ratio (so it can lift a tall core stack).\n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t have that, it\u0027s even worse now\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-26T13:54:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224243866\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677410264\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExhibit A: I am consistently reaching low Kerbin orbit with 3200 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E now, where I needed 3400-3500 in KSP1. Sometimes even a bit less than 3200. The rockets I was testing this with are super simple: mk1 pod with a parachute, fuel tanks, and engine. Nothing attached to the outside.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit B: I tried launching an uncrewed probe. I knew my launch vehicle was passively unstable, as it had no second stage to keep the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E forward (it is \u003Cem\u003Eso easy\u003C/em\u003E to get into Kerbin orbit single-stage), and a fairing larger than the stack, but I stubbornly tried anyway. After flipping over three times, I gave in to common sense and went back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, planning to add a second stage. But on a hunch, the first thing I tried was tucking the solar panels just a bit more snugly against the probe, and rebuilding the fairing just a bit more snugly around it. I also made the tip of the fairing more pointy. Fairings currently appear to be massless, so there\u0027s no reason to be stingy. Lo and behold - the thing flew without flipping! Just by changing the aerodynamics of the fairing\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat\u0027s your launch profile? Cuz for the love of all that\u0027s green, I can\u0027t fly anything the same way I used to in KSP1.\n\u003C/p\u003E\n"},{"CreatedByName":"tstein","CreatedById":223854,"CreatedDateTime":"2023-02-26T13:57:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244072\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677419645\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u0027s your launch profile? Cuz for the love of all that\u0027s green, I can\u0027t fly anything the same way I used to in KSP1.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy impression is that the \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E shown in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is simply wrong. I get  to Orbit also with  rockets that by \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E measurements should not be able to. My impression is that the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is SUPER pessimistic about the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E in atmosphere and treat as if you  stayed the whole time at se level and suddenly  jumped to 71 km.\n\u003C/p\u003E\n\u003Cp\u003E\nAn adition for me, the lack of the vernier engine force sme in much cumber designs than in KSP 1. The lack of the \u0022soviet\u0022 parts is really frust5ratign for me since I basically  built my rockets with those almost always.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-02-26T14:26:41Z","Content":"\n\u003Cp\u003E\nIt\u0027s definitely not a \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E math issue, at least not with the test rockets I\u0027ve been flying for those observations. I can literally mount a smaller tank than in KSP1 and get into orbit anyways - with an engine that has the same or slightly less Isp (the Reliant).\n\u003C/p\u003E\n\u003Cp\u003E\nI have, however, noticed some weirdness with \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E math in more complex designs.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, I just tried to do a Mun mission. First stage with a Skipper, second stage with a Poodle, third stage was a lander can with some small tanks and eight Ant engines. The \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E certified me 6650 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E, which would be enough to land on the Mun and return to Kerbin. In practical application, I couldn\u0027t even land that without running out of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat went wrong? Well, for starters, the calculator doesn\u0027t like more than one engine on a stage. If I attached a single Ant to my lander can, the calculated \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E figure was noticeably \u003Cem\u003Esmaller\u003C/em\u003E than with all eight attached, despite this being less mass! Another problem lies in the fuel crossfeed logic being broken. When I launch this rocket, the first stage will drain its own tanks, and the tanks of the lander, but (curiously enough) not the tanks of the second stage. This not only leads to fuel being consumed by a lower Isp engine, reducing available \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E below what the calculator said, but additionally, the calculator actually factors in that it can errorneously access tanks it shouldn\u0027t be able to. So it gave me a higher \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E figure for the first stage. The second stage did not drain any tanks it shouldn\u0027t, but I can\u0027t disprove the suspicion that it, too, calculated with the wrong amount of fuel. All in all, this rocket probably displayed at least 1000m/s more than it actually had.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason I had none of these issues with my test rockets likely lies in the fact that they were a single stage with a single engine, thus neatly sidestepping all of the mentioned problems.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T14:30:08Z\u0022 title=\u002202/26/2023 02:30  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2023-02-26T16:17:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244072\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677419645\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat\u0027s your launch profile? Cuz for the love of all that\u0027s green, I can\u0027t fly anything the same way I used to in KSP1.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt depends on \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E but a good starting point is to go up until about 40~50m/s and then tilt over until your prograde is about 5~6°. Then just hold prograde. And that may even be a little shallow, when I tried a launch like that I ended up with AP 190km.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth the NERV and the SWERV have been brought up to match real/theoretical isps for their respective engine types. Which is good, there was no need to nerf that. OTOH, the SWERV is a gas core nuclear engine so hopefully we\u0027ll see mechanics related to irradiating other ships through careless firing.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-26T16:27:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244362\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677428269\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThen just hold prograde\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did. At random point my rocket tilted away from prograde on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nThe theory is simple and I understand it, trouble is it doesn\u0027t work in practice even with seemingly perfect trajectory. You\u0027d think that drag at 10km\u002B altitude shouldn\u0027t be the cause of flipping when you\u0027re holding prograde, but here we are.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2023-02-26T16:40:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244377\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677428828\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did. At random point my rocket tilted away from prograde on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nThe theory is simple and I understand it, trouble is it doesn\u0027t work in practice even with seemingly perfect trajectory. You\u0027d think that drag at 10km\u002B altitude shouldn\u0027t be the cause of flipping when you\u0027re holding prograde, but here we are.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAdd four fins at the bottom to help with stability, maybe split your one engine into four for better control authority. vOv\n\u003C/p\u003E\n\u003Cp\u003E\nClearly we\u0027re in an entirely new game with new rules.\n\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2023-02-26T16:47:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244377\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677428828\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did. At random point my rocket tilted away from prograde on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nThe theory is simple and I understand it, trouble is it doesn\u0027t work in practice even with seemingly perfect trajectory. You\u0027d think that drag at 10km\u002B altitude shouldn\u0027t be the cause of flipping when you\u0027re holding prograde, but here we are.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHave any wheeled rovers inside the fairings? There seem to be some weirdness there, with random \u0022bumps\u0022 just throwing \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off course.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-26T17:31:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244403\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677429623\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdd four fins at the bottom to help with stability, maybe split your one engine into four for better control authority. vOv\n\u003C/p\u003E\n\u003Cp\u003E\nClearly we\u0027re in an entirely new game with new rules.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFirst time I used fins for stability the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E sent me like 30 degrees off east where I was pointing at. There\u0027s a lot of unexpected behavior, unseen in KSP1. Same rocket designs, same planet, same flight path, different results.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244412\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677430054\u0022 data-ipsquote-userid=\u002263332\u0022 data-ipsquote-username=\u0022J.Random\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, J.Random said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave any wheeled rovers inside the fairings? There seem to be some weirdness there, with random \u0022bumps\u0022 just throwing \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E off course.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have a hard time getting to and returning from the Mun thanks to the rockets doing what they do, there\u0027s no place for rovers yet, or anything larger than a 2.5 capsule.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-02-26T21:30:27Z","Content":"\n\u003Cp\u003E\nThe simpler and more minimalistic a rocket is, the better it likely performs in the current state of the game. Things can\u0027t break if they\u0027re not there \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRegardless, this thread was not meant as a discussion of what doesn\u0027t work. We have like two thousand of those threads already. Instead I wanted to point out interesting little tidbits and trends we can already see.\n\u003C/p\u003E\n"},{"CreatedByName":"Sea_Kerman","CreatedById":226149,"CreatedDateTime":"2023-02-26T21:41:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244149\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677421601\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen I launch this rocket, the first stage will drain its own tanks, and the tanks of the lander, but (curiously enough) not the tanks of the second stage.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis, oddly enough, seems to be caused by landing legs\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022226149\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed9664563868\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/212807-fuel-transfers-through-decoupler-with-crossfeed-disabled-and-for-some-reason-this-depends-on-a-medium-landing-leg-being-present/\u0026amp;do=embed\u0022 style=\u0022height:197px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-02-26T22:08:17Z","Content":"\n\u003Cp\u003E\nWow, that\u0027s hilarious \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E Never would have suspected those.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2023-02-27T00:26:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244377\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677428828\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did. At random point my rocket tilted away from prograde on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nThe theory is simple and I understand it, trouble is it doesn\u0027t work in practice even with seemingly perfect trajectory. You\u0027d think that drag at 10km\u002B altitude shouldn\u0027t be the cause of flipping when you\u0027re holding prograde, but here we are.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI personally find if I’m wandering off prograde or flipping I need to\n\u003C/p\u003E\n\u003Cp\u003E\n1.  Lower the drag of the top of my stack.  Move external items (solar panels, antenna) lower down and put batteries inside the stack instead of hanging in the outside.\n\u003C/p\u003E\n\u003Cp\u003E\n2. make any fairings as pointy as possible.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Narrow the bulge of the top of the stack (make it more aerodynamic).\n\u003C/p\u003E\n\u003Cp\u003E\n4. Put fins/wings/control surfaces on the bottom of the rocket near the engines to create drag at the back of the rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Increase \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modules.\n\u003C/p\u003E\n\u003Cp\u003E\n6. If all else fails (and sometimes it does if you are lifting a monstrosity) just put a huge amount of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on board and leave it on during the dangerous ascent parts.\n\u003C/p\u003E\n\u003Cp\u003E\nWith all of the above you could launch a pancake the size of a baseball diamond.\n\u003C/p\u003E\n"},{"CreatedByName":"Rpatto92","CreatedById":145732,"CreatedDateTime":"2023-03-12T08:54:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244079\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677419844\u0022 data-ipsquote-userid=\u0022223854\u0022 data-ipsquote-username=\u0022tstein\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/26/2023 at 1:57 PM, tstein said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy impression is that the \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E\u003C/abbr\u003E shown in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E is simply wrong. I get  to Orbit also with  rockets that by \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E measurements should not be able to. My impression is that the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E is SUPER pessimistic about the \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E in atmosphere and treat as if you  stayed the whole time at se level and suddenly  jumped to 71 km.\n\u003C/p\u003E\n\u003Cp\u003E\nAn adition for me, the lack of the vernier engine force sme in much cumber designs than in KSP 1. The lack of the \u0022soviet\u0022 parts is really frust5ratign for me since I basically  built my rockets with those almost always.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI noticed when building  space planes (failed) that the rappiers were producing closer to 150KN of thrust at over bellow 5000meters and in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E they\u0027re only rated for 105KN in atm. Strangely even with that extra over max rated thrust, my plane fails to exceed 200ms. I haven\u0027t as yet eliminated all potential causes but I suspect fairing drag to be a huge factor or drag in general being significantly  higher. It also appears that inertia could perhaps be playing a role, as maintaining high speeds seems a lot easier and accelerating with massive vessels even with close to or exceeding 1:1 thrust/weight a lot harder. Also, fuel appears to burn more slowly and  larger craft appear to be much heavier than perhaps they were previously. \n\u003C/p\u003E\n\u003Cp\u003E\nCould be completely wrong, perhaps some other factor is at play warping my perception of the game balance but it\u0027s certainly a little off.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-03-12T10:35:32Z","Content":"\n\u003Cp\u003E\nIt does feel like a thick soup. Unless I put some crazy \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, my rockets are barely accelerating in low parts of the atmo, so no wonder they\u0027re flipping. There are some serious drag problems otherwise it wouldn\u0027t act like that. I used to launch rockets in KSP1 with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E ≈1.2, now it\u0027s impossible, 1.8 feels like absolute minimum to even keep the rocket going.\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-03-12T12:22:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257557\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678617332\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt does feel like a thick soup. Unless I put some crazy \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, my rockets are barely accelerating in low parts of the atmo, so no wonder they\u0027re flipping. There are some serious drag problems otherwise it wouldn\u0027t act like that. I used to launch rockets in KSP1 with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E ≈1.2, now it\u0027s impossible, 1.8 feels like absolute minimum to even keep the rocket going.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI haven\u0027t had any trouble launching but then I make my rockets pointy!\n\u003C/p\u003E\n\u003Cp\u003E\nI have noticed the same thing with planes though: a plane where everything is in a single stack is much slipperier than one that has dual fuselages or nacelles.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2023-03-12T13:41:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224243866\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677410264\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/26/2023 at 6:17 AM, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\napologies for how this post became a wall of text\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually I appreciate your write up.  I\u0027ve had the vague concern that it\u0027s much easier to get to orbit than KSP was.  Didn\u0027t know exactly, how, but the sense was there. \n\u003C/p\u003E\n\u003Cp\u003E\nIf I may suggest - this is a post about \u0027balance\u0027 which is a great discussion to have when the game is performant - and everyone is in the massive bug hunt mode.  So if you don\u0027t get much response now, bump it after the second patch! \n\u003C/p\u003E\n\u003Cp\u003E\n(Presumes most of the game is functional because of the second patch) \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244362\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677428269\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/26/2023 at 11:17 AM, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndepends on \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E but a good starting point is to go up until about 40~50m/s and then tilt over until your prograde is about 5~6°. Then just hold prograde. And that may even be a little shallow, when I tried a launch like that I ended up with AP 190km\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is pretty much what I did in KSP - but I don\u0027t trust \u0027hold prograde\u0027 in 2. \n\u003C/p\u003E\n\u003Cp\u003E\nNeed to play around with it if it is working for you - but for me?  It\u0027s like instead of holding prograde and getting pulled by gravity into a turn - the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is looking way ahead for the PE marker and using it as a target.  (hence the flip) \n\u003C/p\u003E\n"},{"CreatedByName":"RaBDawG","CreatedById":206005,"CreatedDateTime":"2023-03-12T16:04:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224243866\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677410264\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/26/2023 at 6:17 AM, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo let\u0027s talk about the gameplay itself for once, shall we? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cspan\u003E I\u0027ve not done a whole lot in KSP2 yet, but I did do a few comparisons to KSP1, just to see how close the two games were, and where they would differ.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe primary difference I found is that apparently, the aerodynamics model is noticeably more sensitive when it comes to the shape of parts and the vessel you build. There\u0027s a bigger difference between \u0022sleek and pointy\u0022 and \u0022blunt and flat\u0022 than before.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit A: I am consistently reaching low Kerbin orbit with 3200 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E now, where I needed 3400-3500 in KSP1. Sometimes even a bit less than 3200. The rockets I was testing this with are super simple: mk1 pod with a parachute, fuel tanks, and engine. Nothing attached to the outside.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit B: I tried launching an uncrewed probe. I knew my launch vehicle was passively unstable, as it had no second stage to keep the \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E forward (it is \u003Cem\u003Eso easy\u003C/em\u003E to get into Kerbin orbit single-stage), and a fairing larger than the stack, but I stubbornly tried anyway. After flipping over three times, I gave in to common sense and went back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, planning to add a second stage. But on a hunch, the first thing I tried was tucking the solar panels just a bit more snugly against the probe, and rebuilding the fairing just a bit more snugly around it. I also made the tip of the fairing more pointy. Fairings currently appear to be massless, so there\u0027s no reason to be stingy. Lo and behold - the thing flew without flipping! Just by changing the aerodynamics of the fairing.\n\u003C/p\u003E\n\u003Cp\u003E\nExhibit C: In KSP1, I would typically hold on to my fairings until about 45 km. By common wisdom, this was already considered fairly high, and most players would ditch their fairings lower than that. This time in KSP2, I had troubles with fairing separation under thrust (in KSP1 I used to turn \u003Cem\u003Edown\u003C/em\u003E the separation force of fairings to get a smooth detach, here in KSP2 it seems I need to turn it \u003Cem\u003Eup\u003C/em\u003E instead), and so I hung on to my fairing until I had my AP where I wanted and shut down the engine. That was at 55 km altitude. Just coasting like that, my apoapsis altitude changed by maybe one meter per second, dropping due to drag on the vehicle. As soon as I popped the fairings, though? The apoapsis altitude started changing rapidly, maybe as much as 10 meters per second. Not a problem, obviously, as I was rapidly leaving the atmosphere behind, but that is a huge amount of drag for 55km. An order of magnitude drag increase just from popping the fairing around a XS size probe. KSP2 definitely encourages us to encapsulate our payloads, and hang on to our fairings for longer.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: apologies for how this post became a wall of text; I was trying to split it into two posts, but the forum force-merges them every time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe second difference? There were a lot of rocket engine buffs. A few nerfs too, though far fewer and smaller. Overall, engines have gotten better, which probably contributes to how it feels easier to launch now than in KSP1.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe Reliant lost 5s of Isp (260s-305s instead of 265s-310s), but got uprated from 240 to 260 kN. Doesn\u0027t seem like much, but where a 16 ton vehicle would have a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 1.307 on the pad in KSP1, the same vehicle will have a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 1.412 in KSP2. That\u0027s a difference you\u0027ll notice in flight. In a sense, the Reliant became the Kodiak from Making History, and that was a no-brainer upgrade.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Swivel got a major buff - and fairly so, I\u0027d say, considering how the Reliant overshadowed it in KSP1. Vacuum Isp and thrust stayed the same, but sea level Isp went from 250s to 280s, and as a result, sea level thrust went from 168 kN to 188 kN. At the same time, its mass dropped from 1.5 tons to 1.4 tons. It\u0027s a much better engine now.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Terrier actually received a mild nerf! Only 335s vacuum Isp instead of 345s. This will definitely impact the way we build Mun landers. However, its role as a second stage engine for launches from Kerbin wasn\u0027t much affected, because its sea-level Isp went from 85s to 170s. The Terrier will now be more efficient and have better \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E just after stage separation.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Dart got a big swing with the nerfbat. 300s-320s Isp instead of 290s-340s, and maximum thrust dropped from 180 kN to 170 kN. But fear not... even after all that, it still remains one of the best launch engines for S-size stacks in the game. Just shows how \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E it used to be in KSP1.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Vector was another nerf candidate: it got downrated from 1000 kN to 850 kN, sea level Isp dropped from 295s to 285s, and everything else stayed the same. Yeah, it\u0027s strictly worse now. Yeah, it\u0027s still a silly engine for its form factor, and you should have no issues building shuttle replicas.\n\u003C/li\u003E\n\u003Cli\u003E\nHey, remember the Thud? Yeah, me neither! \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E In all seriousness, that engine was so underwhelming in KSP1. Now it went from 120 kN max thrust to 140 kN, hopefully helping it find more use.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nLooking at the XS-sized engines, the allmighty Ant got its vacuum Isp increased from 315s to 330s, though sadly it lost its non-blocky second variant, which I loved... \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \u003C/span\u003EThe spider got 25% more thrust with no other changes (2.0 kN -\u0026gt; 2.5 kN), while the Twitch got a little heavier (80kg -\u0026gt; 100kg) and had its Isp changed from 275s-290s to 265s-298s. The Spark lost 5s vacuum Isp but gained 5s sea level Isp (now 270s-315s).\n\u003C/li\u003E\n\u003Cli\u003E\nGoing up in size instead, the Skipper got... nerfed? A little? Max thrust went from 650 kN to 600 kN. But Isp went up... strictly speaking... theoretically... by exactly 2s \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nBut hey, at least the Mainsail, which already had too much thrust in KSP1, now has even more thrust! 1600 kN instead of 1500. It lost a lot of Isp though, going from 285s-301s to 265s-307s. Prepare to dump a lot of fuel into this hungry maw. But when you do, \u003Cem\u003Eit\u0027ll go\u003C/em\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Poodle unsurprisingly got the same treatment as the Terrier, meaning: less vacuum Isp (350s -\u0026gt; 340s) but more sea level Isp (90s -\u0026gt; 175s). But unlike the Terrier, it also went down in max thrust significantly, from 250 kN to 215 kN. Fair enough, it used to be on the awkwardly-too-strong side for most landers. This might actually make it easier to use.\n\u003C/li\u003E\n\u003Cli\u003E\nAnother size class up, the Rhino went on a diet: 8 tons instead of 9. In return its maximum thrust dropped from 2000 kN to 1750. The redesign away from orbital use to a sustainer type is felt in the Isp, which changed from 205s-340s to 285s-325s. For orbital work we now have the Labradoodle, which is completely new.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Mammoth is now the Mammoth-II, and looks the part of its namesake with its ginormous \u003Cs\u003Etrunk\u003C/s\u003E errr I mean turbopump exhaust. It got a mild thrust uprating from 4000 kN to 4250 kN, and like the mainsail, lost a good chunk of Isp: 270s-310s instead of 295s-315s.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nAll of the SRBs stayed the same, and I didn\u0027t look at the jet engines, as I\u0027m just not a plane type of person.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nHere is where it gets really interesting though: the high-impulse, alternative-fuel engines. All of them got \u003Cem\u003Eso much stronger\u003C/em\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nJust look at the Nerv. Maximum thrust went from 60 kN to 75 kN. Isp went from 185s-800s to 250s-900s. Those are two massive buffs, but it\u0027s not the end just yet: in KSP2, all fuel tanks - including hydrogen - got normed to a mass ratio of 9, whereas in KSP1, the plane parts that were so often used with the Nerv due to a lack of dedicated \u003Cabbr title=\u0022Liquid Fuel\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u003C/abbr\u003E-only rocket tanks were more around 8. So not only did the engine get a lot better, the tanks for the engine got better too!\n\u003C/li\u003E\n\u003Cli\u003E\nThen there\u0027s the new nuclear engine, the Swerv. And it\u0027s absurd. There were modded engines available for KSP1 that were considered \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E, and they were not as \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E as this engine is. It is overtuned to such a monstrous degree next to all other engines, there\u0027s just no comparison. I reckon this is our preview for what higher tech levels are going to be offering, at a game stage where the Kerbals have colonies all over the system and interstellar technology is close at hand.\n\u003C/li\u003E\n\u003Cli\u003E\nLet\u0027s not forget the Dawn ion drive, either. On the surface, it received a small nerf, in the sense that it needs a bit more energy to run now (10 EC/s instead of 8.74 EC/s). But just like the Nerv is benefitting from better tankage, so is the Dawn. Xenon tanks used to have a mass fraction of 4. Now, just like all other tanks, they\u0027re at 9. That means they contain \u003Cem\u003Emore than two and a half times\u003C/em\u003E the amount of xenon for the same dry mass. You might not notice it that much when attaching only a single tank and getting a small few thousand m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E; but it\u0027s gonna scale so much higher so much more easily. A single ion stage with 40,000m/s worth of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E would have been borderline impossible in KSP1 even without worrying about how to launch it; now in KSP2, it\u0027s not any harder to achieve than making a Terrier stage with 3,100m/s worth of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nAnd remember, the perhaps biggest buff to low-\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E engines like the Nerv and Dawn: the ability to time warp during burns. I mean, once that actually works reliably \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E But yeah, get used to the idea of working a lot more with really high \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E deep space craft in the future. It\u0027s gonna be easier than ever before.\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBro…. There is no air pressure or heat currently in KSP2.  Of course the two are going to be different \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-12T16:04:51Z\u0022 title=\u002203/12/2023 04:04  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 12, 2023\u003C/time\u003E by RaBDawG\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2023-03-12T16:08:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257618\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678628513\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNeed to play around with it if it is working for you - but for me?  It\u0027s like instead of holding prograde and getting pulled by gravity into a turn - the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E is looking way ahead for the PE marker and using it as a target.  (hence the flip) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve been using the prograde to get both rockets and spaceplanes into orbit, it generally works as expected. On some craft you have to watch for a later transition, I think somewhere around 40~50km altitude, where the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E bugs out and decides to wander off. At that point just toggle it off and on. I haven\u0027t seen that one in a while so I\u0027m of the impression it\u0027s craft-related.\n\u003C/p\u003E\n"},{"CreatedByName":"cocoscacao","CreatedById":225696,"CreatedDateTime":"2023-03-12T16:12:49Z","Content":"\n\u003Cp\u003E\nWhenever I try to increase pitch above 20 percent at 30km altitude \u002B speed ~1400, my \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E flips violently and wings get torn apart.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-12T16:19:43Z\u0022 title=\u002203/12/2023 04:19  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 12, 2023\u003C/time\u003E by cocoscacao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-03-12T16:32:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257708\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678637569\u0022 data-ipsquote-userid=\u0022225696\u0022 data-ipsquote-username=\u0022cocoscacao\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, cocoscacao said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhenever I try to increase pitch above 20 percent at 30km altitude \u002B speed ~1400, my \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E flips violently and wings get torn apart.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou are stalling.  The craft is still in the atmosphere and if you pitch up too much the aero forces will do that\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-12T16:33:24Z\u0022 title=\u002203/12/2023 04:33  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 12, 2023\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cocoscacao","CreatedById":225696,"CreatedDateTime":"2023-03-12T16:37:28Z","Content":"\n\u003Cp\u003E\nStalling? At 1400m/s? I\u0027m using caps-lock to toggle fine tuned controls. At 30 kilometers, I don\u0027t think aero-forces should be strong enough to flip me so violently for a steady 5 degrees pitch increase.\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-03-12T16:39:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257708\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678637569\u0022 data-ipsquote-userid=\u0022225696\u0022 data-ipsquote-username=\u0022cocoscacao\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, cocoscacao said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhenever I try to increase pitch above 20 percent at 30km altitude \u002B speed ~1400, my \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E flips violently and wings get torn apart.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you may have a stubby part near the nose. That will move the center of pressure forward the faster you go. Once it moves past the center of mass your craft will become unstable and will want to flip like you describe, even if in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E your center of pressure indicator is behind the center of mass indicator. This happened to me pretty often in KSP1, and I think KSP2\u0027s aero model is less forgiving of stubby parts so it might be even more accentuated here. \n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t had any difficulties of this kind with my planes in KSP2, but I have made an effort to keep them pointy and keep any stubby bits near or behind the center of mass!\n\u003C/p\u003E\n"},{"CreatedByName":"cocoscacao","CreatedById":225696,"CreatedDateTime":"2023-03-12T16:44:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257721\u0022 data-ipsquote-contentid=\u0022213130\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678639155\u0022 data-ipsquote-userid=\u0022225622\u0022 data-ipsquote-username=\u0022Periple\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Periple said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you may have a stubby part near the nose\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMk 2 cockpit. Very basic plane, although my wings \u003Cem\u003Eare \u003C/em\u003Erather wide... Still, I wasn\u0027t expecting something like that. In KSP 1, atmo becomes relatively benign after 17km mark. New game, new rules I guess...\n\u003C/p\u003E\n"}]}