{"TopicId":21343,"ForumId":20,"TopicTitle":"Inputing Landing Coordinates From Mapsat Into Mechjeb","CreatedByName":"Hiatsu2k8","CreatedById":17826,"CreatedDateTime":"2012-10-04T21:38:12Z","PageNum":1,"Articles":[{"CreatedByName":"Hiatsu2k8","CreatedById":17826,"CreatedDateTime":"2012-10-04T21:38:12Z","Content":"\n\u003Cp\u003ESubject says it all, it seems like the coordinates from the mapsat are not as detailed as the mechjeb ones are if you click on the planets surface, that or im just putting them in wrong. Any advice?\u003C/p\u003E\n"},{"CreatedByName":"0jam3290","CreatedById":37975,"CreatedDateTime":"2012-10-04T23:15:53Z","Content":"\n\u003Cp\u003EJust copy the pop-up coords from mapsat and input them directly to Mechjeb on the coord input box in the landing autopilot module\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2012-10-04T23:24:45Z","Content":"\n\u003Cp\u003EThe coordinates from the Mapsat are meant as general reference and not for landing and unless you have a really long planet scan to work from I don\u0027t think the Mapsat program can be upgraded to give better information.\u003C/p\u003E\u003Cp\u003EI do use it myself for landings, but you have to accept its limitations.\u003C/p\u003E\n"},{"CreatedByName":"Hiatsu2k8","CreatedById":17826,"CreatedDateTime":"2012-10-05T02:34:18Z","Content":"\n\u003Cp\u003EThanks, while were on the subject of mapsat does anyone know why there is no terrain for Jool?\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2012-10-05T03:02:29Z","Content":"\n\u003Cp\u003EIt\u0027s a gas giant where the gases eventually get compressed into a liquid at lower altitudes.\u003C/p\u003E\u003Cp\u003ESmaller gas giants may have a rocky core, but they are under a sea of liquid.\u003C/p\u003E\u003Cp\u003ELarger ones are more like failed suns that didn\u0027t gather enough mass to become a star, but still have large amounts of nuclear reactions going on at their centers.\u003C/p\u003E\u003Cp\u003EJupiter for example gives off more heat than it receives from the sun and produces enough radiation to fry space probes that get too close.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-05T04:03:35Z","Content":"\n\u003Cp\u003ESince no-one has asked: You \u003Cstrong\u003Eare\u003C/strong\u003E inputting those coordinates from ISA MapSat into MechJeb as decimal, right? I\u0027ve found ISA MapSat\u0027s data to be more than sufficient for accurate landing targets. ISA MapSat scans at a resolution of 0.01 degrees (each data point represents a cell of 0.01x0.01 degrees, so the \u0022real\u0022 area represented by each cell varies greatly and is dependent on the planet\u0027s equatorial radius).\u003C/p\u003E\n"},{"CreatedByName":"Aardvark","CreatedById":50558,"CreatedDateTime":"2012-10-05T15:54:20Z","Content":"\n\u003Cp\u003EYou have to reverse the coordinates. (The second in the pair goes in the first MechJeb box).\u003C/p\u003E\n"},{"CreatedByName":"Casen","CreatedById":57930,"CreatedDateTime":"2013-07-13T05:16:54Z","Content":"\n\u003Cp\u003EIs there an update to this? \u003C/p\u003E\u003Cp\u003EMapSat V3 is using degrees, I am assuming based off the center of the map, while Mechjeb is using longitude and latitude. \u003C/p\u003E\u003Cp\u003EIf I wanted to land at a Mapsat coord of -10.8, 25.2 how would I enter that into MechJeb? \u003C/p\u003E\u003Cp\u003EWould I just load the digits as decimals into the first block as -10.8\u00270\u00270 N and 25.2\u00270\u00270 E. Or would the second pair be west?\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-13T12:38:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EIt\u0027s a gas giant where the gases eventually get compressed into a liquid at lower altitudes.\u003Cp\u003ESmaller gas giants may have a rocky core, but they are under a sea of liquid.\u003C/p\u003E\u003Cp\u003ELarger ones are more like failed suns that didn\u0027t gather enough mass to become a star, but still have large amounts of nuclear reactions going on at their centers.\u003C/p\u003E\u003Cp\u003EJupiter for example gives off more heat than it receives from the sun and produces enough radiation to fry space probes that get too close.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder if you \u003Cem\u003Ecould\u003C/em\u003E make Mapsat scan Jool or Kerbol, though. Both of them do technically have a surface, albeit a weird/invisible one.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Casen\u0022 data-cite=\u0022Casen\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMapSat V3 is using degrees, I am assuming based off the center of the map, while Mechjeb is using longitude and latitude. \u003C/p\u003E\u003Cp\u003EIf I wanted to land at a Mapsat coord of -10.8, 25.2 how would I enter that into MechJeb? \u003C/p\u003E\u003Cp\u003EWould I just load the digits as decimals into the first block as -10.8\u00270\u00270 N and 25.2\u00270\u00270 E. Or would the second pair be west?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should probably use the Mapsat 4 developer build that\u0027s out. Anyway, the first block displays north or south, with negative numbers being south. The second block displays east or west, with negative numbers being west. In Mapsat 4, at least, these are longitude and latitude that should work the same in any other program that uses coordinates. The thing to watch out for is whether units smaller than a degree are listed in minutes and seconds, or whether they\u0027re listed in decimals. 1 arcminute = 1/60th of a degree, and 1 arcsecond = 1/60th of an arcminute. (Arcminutes are denoted with a single \u0027 and arcseconds with a double \u0027\u0027.)\u003C/p\u003E\u003Cp\u003EMapsat uses decimals, I don\u0027t know what Mechjeb uses. But -10.8, 25.2 degrees means 10.8 degrees south and 25.2 degrees east. 10.8 degrees can also be written as 10 degrees 48 arcminutes, 25.2 degrees can also be written as 25 degrees 12 arcminutes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-13T12:47:19Z\u0022 title=\u002207/13/2013 12:47  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 13, 2013\u003C/time\u003E by Kimberly\u003C/strong\u003E\n\u003C/span\u003E\n"}]}