{"TopicId":213426,"ForumId":196,"TopicTitle":"Any single \u0026quot;failed\u0026quot; link between parts anywhere on the rocket, that\u0026#039;s not part of a staging event, will make the game say \u0026quot;oh your rocket exploded, let me just take control of it away from you\u0026quot;","CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2023-02-26T22:02:14Z","PageNum":1,"Articles":[{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2023-02-26T22:02:14Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure if this was put in intentionally, or it\u0027s something not working right, but either way this is a horrible way to tell the player that their rocket broke.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not given the option to continue my flight, meanwhile all the thrusters on my rocket shut off and the camera freezes in place and my rocket sails off into the distance.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, on my large rockets (over 750 tons launch mass), guess what happens. I reinforce the rocket\u0027s core with a mesh of struts placed on short truss segments so that it shouldn\u0027t fall apart.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s where the trouble starts. It shouldn\u0027t fall apart right? Wrong, game says \u0022nope this breaks no matter how many struts you add\u0022 I\u0027ve tried adding literally hundreds of struts on the same dang joint that reliably breaks when launching my rocket (not too far into ascent, but after Max Q), and yet.... it just breaks.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, on large rockets (the kind you\u0027d need to build to go interstellar or even interplanetary), the struts are effectively useless.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy are they useless? Well instead of reinforcing the rocket and making it able to take more strain, even with hundreds of struts between two in-line fuel tanks (where the rocket always breaks), the rocket still wobbles just as much as it did with zero struts. And that means the struts break.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s where the bug comes in. See, whenever any single structural link on the craft fails for any reason other than \u0022part of a staging event, using a decoupler or stack separator (haven\u0027t checked docking ports yet)\u0022, the game goes \u0022\u003Cstrong\u003Eoh no, your rocket must have entirely destroyed itself, leaving nothing behind, so we\u0027ll just take away control from you, shut off all the engines (I think, the effects stop anyways), and give you the \u0022you failed, try again?\u0022 screen\u0022\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d much prefer it if I could see WHAT EXACTLY HAPPENS WHEN THAT PART FAILS. Does the vessel keep going? and make it to orbit despite losing a few parts on the way up (as is long-time KSP 1 tradition)? Does the single failure cause a cascade of further failures?\u003Cbr\u003E\nWith the game in its current state, I won\u0027t ever be able to tell if that happens, because all the game tells me about is the first failure, and worse than that it actively takes control away from me.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease, never take control away from the player like that unless ALL the control points on the vessel have been destroyed. And if that\u0027s the case, check nearby vessels to see if they have usable control points, and switch to the first one of those that is found.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Oh yeah, I should probably include all the data about my system just so we\u0027re all on the same page:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nGame version: KSP 2 (Steam) version v0.1.0.0.20892\n\u003C/li\u003E\n\u003Cli\u003E\nOS: Windows 10, up to date as far as windows update itself is concerned.\n\u003C/li\u003E\n\u003Cli\u003E\nCPU: Intel Core i7-9700k, stock clock 3.6 Ghz, overclocked to 4.6 Ghz (water cooled, and this CPU has never given me a single hiccup with respect to blue-screens or anything of the sort)\u003Cbr\u003E\nGPU: Asus ROG Strix 3070 Ti, 8GB VRAM\u003Cbr\u003E\nRAM: 32 GB 3200 MHz G.Skill Ripjaws V DDR 4 (2x 16gb sticks), on XMP timings 3200mhz CAS 14-14-14-34\u003Cbr\u003E\nDrive the game is installed on: Samsung 970 Evo Plus 2TB NVMe M.2 Solid State Drive\n\u003C/li\u003E\n\u003Cli\u003E\nExpected behavior: When a structural failure happens on a vessel that is not the result of a decoupling event (such as decouplers, stack separators, and docking ports), the game should continue to allow you to control your craft so you can see if you can still get where you were going despite the failure.\n\u003C/li\u003E\n\u003Cli\u003E\nObserved behavior: When a structural failure happens on a vessel that is not the result of a decoupling event, control of the vessel is lost, the camera freezes in place relative to the world (meaning your vessel goes sailing off-screen), and you are presented with the \u0022try again, revert to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, revert to launch or load a save\u0022 screen. This is incredibly frustrating when you\u0027ve spent over an hour designing a craft to get to Jool and are prevented from doing so by the failure of a single strut on the launch vessel (a strut that might not have even been needed).\n\u003C/li\u003E\n\u003Cli\u003E\nSteps to replicate: Build a rocket as follows:\u003Cbr\u003E\nStart with a 5m (XL) probe core, attach a 5m (XL) nosecone on the front of the probe core, and on the rear of the probe core attach one of the longest 5m (XL) methalox fuel tanks.\u003Cbr\u003E\nNow stack a tiny truss segment on the bottom node of the fuel tank (second smallest is the easiest one for building purposes), and then another of the longest 5m (XL) methalox tanks.\u003Cbr\u003E\nTo reinforce this obvious week point in the rocket stack, use 8x symmetry to put struts between the 2 fuel tanks in the gap created by the truss segment.\u003Cbr\u003E\nThen on the bottom XL fuel tank, radially attach 4 of the shortest 3.75m (Lg) fuel tanks, near the bottom of the XL fuel tank, followed by attaching a 3.75m nosecone on the front of these radially attached fuel tanks, and a Mammoth II engine on the bottom attach node of these radially attached Lg fuel tanks. Add launch clamps if you think you want them, it shouldn\u0027t make a difference.\u003Cbr\u003E\nNow it comes time to truly reproduce the bug. Launch the rocket. and I usually a gravity turn at 1750m altitude, and observe as at least one strut breaks despite your best efforts. No matter what structural link fails first, when it fails, you should immediately notice that visually the engines cut off, the camera stops tracking the vessel, and you are immediately presented with the \u0022interesting quote about failures being part of the process\u0022 screen that is supposed to happen when you crash a rocket. However, you\u0027ll notice that you didn\u0027t crash a rocket. You had a single structural failure on the rocket, that was probably able to be recovered from, were it not for the game saying \u0022nope you don\u0027t get to control this anymore\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nThe theoretical workaround would be to enable \u0022unbreakable joints\u0022 however that would only work if I could open the developer options, which I can not figure out how to do, so there are effectively zero workarounds. And if you consider using cheats to not be a viable workaround, there in fact ARE literally zero workarounds other than \u0022hope you built your craft strong enough without struts\u0022, which the game is woefully lacking in information on how to do that (I\u0027ve been going on info from my KSP 1 play time).\n\u003C/li\u003E\n\u003Cli\u003E\nNo mods installed, as I don\u0027t know of any for KSP 2.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T22:35:36Z\u0022 title=\u002202/26/2023 10:35  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003Cbr\u003ETurned it into a proper bug report.\n\u003C/span\u003E\n"},{"CreatedByName":"ChaoticPheonix","CreatedById":124657,"CreatedDateTime":"2023-02-27T15:18:56Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EKSP Version: \u003C/strong\u003E0.1.0.0.20892\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOS: \u003C/strong\u003EWindows 10\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECPU: \u003C/strong\u003ERyzen 5 5600X\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGPU: \u003C/strong\u003ERTX 2070, 8GB VRAM\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERAM: \u003C/strong\u003E16GB DDR4 3600MHz\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInstalled on: \u003C/strong\u003EWD Black SN750 SE, 1TB\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cb\u003EDescription of the bug:\u003C/b\u003E A craft will have a single part break, usually a strut. The craft is then recognized as destroyed, even though it is still completely in one piece. Kerbals are lost, vehicle is no longer controllable despite still being complete.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EExpected Behaviour: \u003C/strong\u003ECraft is still controllable and usable when a non-essential part breaks.\n\u003C/li\u003E\n\u003Cli style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EObserved Behaviour: \u003C/strong\u003EBug has presented on planes, rovers and rockets, though is most easily replicable on rovers and happens more frequently. I will be using a rover as an example. Driving along the surface of Kerbin, hit a small bump. A strut breaks, then the mission report window comes up and the craft is no longer controllable. Craft is described by the mission report as destroyed, though only one part is actually broken and the craft is still visibly in one piece on screen.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cb\u003ESteps to replicate: \u003C/b\u003EBuild a rover with struts, mine tend to have struts along the bottom to support the drivetrain. Drive along Kerbin and hit a small bump to stress the struts. Does not happen at every bump, but frequently enough to where rovers are currently useless on my end.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\nThis has also happened with a rocket coming out of timewarp. Strut breaks, craft remains in one piece but is marked as destroyed and is no longer controllable.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cstrong\u003EFixes/Workarounds: \u003C/strong\u003EAvoid rovers, avoid using timewarp in atmosphere.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EList of mods: \u003C/strong\u003ENone used, game is fully vanilla.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EScreenshots: \u003C/strong\u003ETo be added when I can replicate it again.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2023-02-27T19:16:06Z","Content":"\n\u003Cp\u003E\nI can attach a craft file to help reproduce this bug, if it helps. I managed to make a rocket that SHOULD be able to put a large lander nearly anywhere in the Kerbol system, but I can\u0027t even get it off the ground because the dang \u0022wobbly rockets syndrome\u0022 makes it not work.\u003Cbr\u003E\nSeems like it happens any time I use the 5m Engine Plate (rocket turns into a noodle, no amount of struts will stop it from being a noodle because that\u0027s how Unity joints work apparently, basically this bug would have been hidden if the wobbly rockets wasn\u0027t a thing).\n\u003C/p\u003E\n\u003Cp\u003E\nIf I could find out how to extract my craft files from the game, this is where I\u0027d be putting the hyperlink.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJust so we\u0027re clear, I\u0027m saying that BOTH the \u0022wobbly rockets\u0022 AND this bug that I reported need to be done away with entirely.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now for a (for me) short rant on wobbly rockets and what exactly that phenomena is (bug?, feature?, other?, etc.).\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m gonna go further than I normally would, because I\u0027ve been having nothing but problems (and zero successes) lately when I go to build any kind of \u0022large\u0022 rocket in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nMy position on the whole \u0022wobbly rockets\u0022 thing is this: It is, it was, and it forever will be, a bug. And so it needs to get fixed.\u003Cbr\u003E\nWhy? Because it\u0027s unintended behavior of the physics engine. It has been tolerated for far too long, so long in fact that people have started calling it \u0022part of what makes KSP the game it is\u0022.\u003Cbr\u003E\nWell I\u0027m done with it. Wobbly rockets do not contribute to KSP being the \u0022goofy cartoon rocket building game\u0022.\u003Cbr\u003E\nYes, at one point, KSP1 was indeed the \u0022goofy cartoon rocket building game\u0022. But KSP 1 in its current state is... not cartoon, and I\u0027d like to say it\u0027s aiming to be not nearly as goofy either, since it\u0027s trying to teach you things about interstellar travel using real physics.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason wobbly rockets got rolled into being thought of as \u0022part of KSP\u0022 was because some people thought it was \u0022cute\u0022 in the \u0022lol so random\u0022 way.\u003Cbr\u003E\nThose people are IMO now firmly in the wrong, given the context of KSP 2 and its aspirations), and so the wobbly rockets took a long time to get even a half-fix introduced, with that half-fix being Autostrut.\n\u003C/p\u003E\n\u003Cp\u003E\nWell guess what. KSP 1 or KSP 2, doesn\u0027t matter, wobbly rockets are still a bug.\u003Cbr\u003E\nEven if they\u0027re currently an \u0022ascended bug\u0022, they\u0027re still a bug at the core of it.\u003Cbr\u003E\nNow with the focus being on interstellar voyages the wobbly rockets phenomena needs to go the way of the dodo.\u003Cbr\u003E\nTo be more clear, it needs to become history, extinct, spoken of in the past tense only, and if that wasn\u0027t clear enough, if I never see another wobbly rocket in KSP 2 again, it\u0027ll still be too soon.\u003Cbr\u003E\nI could write pages on how much KSP 2 needs to get rid of wobbly rockets to be a successful game.\u003Cbr\u003E\nThere just have to be other ways of introducing and simulating the concept of \u0022you need to build your rocket strong enough to withstand the forces applied to it\u0022 into KSP 2, without falling back to any sort of solution that results in any kind of \u0022wobbly rockets\u0022.\u003Cbr\u003E\nI\u0027m not saying my rockets shouldn\u0027t break ever, far from it. I\u0027m saying they should BREAK, not BEND.\u003Cbr\u003E\nAnd if they DO break, don\u0027t stop the simulation, or the engines, or anything. Let me maintain control, let me try to fly out of it, LET ME KEEP PLAYING THE GAME WHEN SOMETHING BREAKS (that\u0027s the bug I originally reported).\u003Cbr\u003E\nIf this alternate structural limits mechanic needs custom code for determining the loads on individual parts, so be it. If that takes a long time, so be it.\u003Cbr\u003E\nIf I was a rich person, I\u0027d throw more than a million dollars at the problem of removing wobbly rockets from KSP2 and replacing it with something better.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy am I so adamantly opposed to any kind of wobble or flex in my constructed things? Well, the answer is simple.\u003Cbr\u003E\nIt doesn\u0027t happen to a visible degree in real life, unless you\u0027re so close to the rocket that you can\u0027t even see the whole thing within your eyesight where you\u0027re standing.\u003Cbr\u003E\nAdditionally, wobbly rockets does exactly one thing, and one thing only:\u003Cbr\u003E\nIt gets in the way of me getting anything meaningful done.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s all it ever does. It doesn\u0027t provide enjoyment, and if I do laugh at a failure that happens due to wobbly rockets I\u0027m laughing because I\u0027m crying inside, and only for just a short moment, after which I\u0027m lamenting the fact that this game \u0022simply must\u0022 simulate the physics of the entire vessel using the very fallible Unity joints system.\u003Cbr\u003E\nWobbly rockets does not provide a challenge that I can surmount with the tools given, and because of that I\u0027m left with a \u0022full\u0022 game that I can only access a small portion of due to failings of the tools the game gives me.\u003Cbr\u003E\nI want to send something to the other planets. I really do. I can pilot them there, I can build them that SHOULD be able to get there, I can do all of that (I need to look up transfer windows, but that\u0027s not that much of an ask).\u003Cbr\u003E\nWhat I can\u0027t do is get them off the launchpad without the game taking control of that vessel away from me permanently, when the probe core was most certainly not destroyed.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d love to test those huge LH2 spherical fuel tanks and the SWERV, but I can\u0027t build a launch vehicle big enough to get them in orbit without it turning into a noodle and \u0022oops something broke, you don\u0027t get to play anymore\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIf I had native XL (5m) engines, I might be able to do it, but I\u0027m very leery of that idea, because I\u0027m nearly certain it won\u0027t work out like that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2023-03-01T06:32:50Z","Content":"\n\u003Cp\u003E\nOverlapping topics have been merged.\n\u003C/p\u003E\n"}]}