{"TopicId":21349,"ForumId":32,"TopicTitle":"Kerbal Space Program questions from a newbie","CreatedByName":"shea1980","CreatedById":54045,"CreatedDateTime":"2012-10-04T22:44:16Z","PageNum":1,"Articles":[{"CreatedByName":"shea1980","CreatedById":54045,"CreatedDateTime":"2012-10-04T22:44:16Z","Content":"\n\u003Cp\u003EHi all,i am new to the forum i just have a few quick questions,i was just wondering if this is a single player game,also i was just wondering what is the objective of the game,and if there are many missions in singleplayer.one last question is Kerbal Space Program only avalible to buy on the the devs website,also do i use my registration from the forum for my login at the main page,thanks in advance all:confused:\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-04T22:48:05Z\u0022 title=\u002210/04/2012 10:48  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 4, 2012\u003C/time\u003E by shea1980\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-04T22:55:27Z","Content":"\n\u003Cp\u003EHiya shea1980, welcome to the community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKSP is still in development right now, and missions are not yet implemented though they will be eventually, the idea is to run a whole space program from humble beginnings \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECurrently KSP is a sandbox game, but many players \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/forumdisplay.php/26-Challenges\u0022 rel=\u0022external nofollow\u0022\u003Epost challenges in this board\u003C/a\u003E for others to try, and though KSP is single player, people \u0027play\u0027 against each other by comparing challenge results, also there are some persistent world add-ons that allow players to share their saved files.\u003C/p\u003E\u003Cp\u003EAlso, KSP is only purchasable\u003Ca href=\u0022http://www.kerbalspaceprogram.com/kspstore/\u0022 rel=\u0022external nofollow\u0022\u003E from the store\u003C/a\u003E at this time, but will be on Steam eventually as well, Steam do not accept alpha games though.\u003C/p\u003E\u003Cp\u003EYou only pay once, then you get the current alpha and every update after that for free, the price will gradually rise as development continues so it\u0027s best to get it now rather than wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Schweehog","CreatedById":33783,"CreatedDateTime":"2012-10-04T22:56:36Z","Content":"\n\u003Cp\u003EAt it\u0027s alpha stage there isn\u0027t \u0022singleplayer\u0022. It is currently only a sandbox game with no objective. But fear not, they will soon add objectives and singleplayer missions. And you will still be able to choose sandbox mode. Multiplayer is not being planned at the moment, it may never be in the game. It might it, might not, though saying \u0022multiplayer\u0022 is something you don\u0027t want to do. There are lots of things to do and vast places to explore with mods to help you along the way. (Use a separate account for buying I believe) If you have any questions ask them in the appropriate forum and I hope you become a fellow Kerbonaut just like the rest of us.\u003C/p\u003E\n"},{"CreatedByName":"shea1980","CreatedById":54045,"CreatedDateTime":"2012-10-04T22:57:51Z","Content":"\n\u003Cp\u003EThats fantastic thanks m8 for you quick responce\u003C/p\u003E\n"},{"CreatedByName":"Qumefox","CreatedById":43197,"CreatedDateTime":"2012-10-04T22:58:58Z","Content":"\n\u003Cp\u003EKSP is currently in alpha.. Meaning it\u0027s FAR from finished. Right now, there are no objectives. It\u0027s a giant sandbox where you do what you want. In the future there will be a campaign with missions, etc, but right now, they\u0027re still adding basic infrastructure and content.\u003C/p\u003E\u003Cp\u003EAs far as the store/forum login, i\u0027m not sure. Since I don\u0027t remember making a forum account, I THINK they\u0027re linked, but.. Best thing to do, is just try to log in.. It will either let you, or you\u0027ll have to make a store account.. not really a big deal either way.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2012-10-04T23:01:01Z","Content":"\n\u003Cp\u003EKSP is currently in awesome stage, where there are no rules, hundreds of cool mods, no objective, no enemies, no money, and plenty of bugs.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-04T23:04:33Z","Content":"\n\u003Cp\u003EYour store login and your forum login do not have to be the same, they can be if you want though, you can use the same email and password for both if you like.\u003C/p\u003E\u003Cp\u003EIf you buy KSP you\u0027ll be prompted to provide an email for the confirmation email to be sent to, and be asked to input a password, the confirmation email can often end up in the spam box so don\u0027t forget to check it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shea1980","CreatedById":54045,"CreatedDateTime":"2012-10-04T23:07:28Z","Content":"\n\u003Cp\u003EWill do,cheers guys for the help\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-05T14:04:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EAlso, KSP is only purchasable\u003Ca href=\u0022http://www.kerbalspaceprogram.com/kspstore/\u0022 rel=\u0022external nofollow\u0022\u003E from the store\u003C/a\u003E at this time, but will be on Steam eventually as well, Steam do not accept alpha games though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it\u0027ll be put on steam as part of a general release to all digital distribution sites (and physical shops if it gets popular enough). I don\u0027t think squad are the sort of development studio to make users use such an obtrusive program as steam whether or not they want it as they\u0027ve said they\u0027re not keen on DRM.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-05T14:08:43Z\u0022 title=\u002210/05/2012 02:08  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 5, 2012\u003C/time\u003E by EndlessWaves\u003C/strong\u003E\n\u003C/span\u003E\n"}]}