{"TopicId":213597,"ForumId":196,"TopicTitle":"Crashing constantly","CreatedByName":"Chris Windle","CreatedById":226812,"CreatedDateTime":"2023-02-27T11:25:28Z","PageNum":1,"Articles":[{"CreatedByName":"Chris Windle","CreatedById":226812,"CreatedDateTime":"2023-02-27T11:25:28Z","Content":"\n\u003Cp\u003E\nA very simple goal:  Create a rocket and launch 3 small satellites in orbit around Kerbin for initial communication network. \u003Cbr\u003E\n1) Start by creating base satellite, place HEC, place communication disk, save game and workspace. place 2 radial solar panels. crashes and exits.\u003Cbr\u003E\n2) Restart and load save, Attach fuel tank and engine. crashes and exits.  Repeat this step 4 or 5 more times until the base satellite is complete.\u003Cbr\u003E\n3) Restart and load save. Make copy of satellite 3 times and stack.   save game and workspace.  add small fairing.  crashes and exits.  Repeat this 3 or 4 times until able to complete before crashing.\u003Cbr\u003E\n4) Restart and load save. Add rocket base and engine.  Repeat this 3 or 4 times until able to complete before crashing.\u003Cbr\u003E\n5) Move to launch pad and test launch.  Launch went ok, but ran out of fuel before orbit. Revert to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.  crash and reload. Repeat 3 or 4 times until able to get boosters attached and to the launch pad.\u003Cbr\u003E\n6) Need to take a break from all the reloading and go play something that doesn\u0027t crash constantly.\u003Cbr\u003E\n7) Note: This was on Sunday, following a similar experience on Friday and Saturday, where I did successfully land on the Mun, and then on Minmus.   These actually went pretty well, with less crashing after I reduced the graphics settings to medium.  However, on Sunday it was crashing more frequently.\n\u003C/p\u003E\n"},{"CreatedByName":"Chris Windle","CreatedById":226812,"CreatedDateTime":"2023-02-27T12:14:55Z","Content":"\n\u003Cp\u003E\nUpdate: So, I finally launched my satellite deployment rocket and now trying to get it setup for the first satellite release at 1/3 of orbital period, and there doesn\u0027t seem to be any display of orbital period anymore. My math is not bad, but I know from experience if my orbital period is not exact to the microsecond, I will slowly lose my spatial separation of 120 Degrees.  So, I guess the communication network is on hold for now.\n\u003C/p\u003E\n"}]}