{"TopicId":213555,"ForumId":120,"TopicTitle":"The Case For Multifuel Engines In KSP 2","CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T07:19:46Z","PageNum":1,"Articles":[{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T07:19:46Z","Content":"\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EHi there. I\u0027m a recently separated USAF jet engine mechanic, and a current Physics student. I have a long time interest in propulsion systems, and have learned a great deal about them even outside of the few engines I\u0027ve had wrench time on. I bring all of this up mostly to brag if I\u0027m honest, but also hopefully to lend my opinion (and it is just an opinion) a little more credence. I know the feedback the devs are looking for currently is probably on performance and bugs at the moment, but I can\u0027t help but already make gameplay suggestions, lol. For all I know, the following suggestions are already planned, but I thought I\u0027d chime in if not.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EKSP 2 is introducing different fuel types into the game (beyond solid, liquid, and xenon), which I think is great. KSP 1 oversimplified fuel types, which is great if you\u0027re new to rocketry, but opens up exploits, like unrealistic densities when it comes to LH2 derived engines.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EHowever, I think KSP 2 could be implementing these different fuel types into the game a little bit better in the future. Currently, it looks like SSTOs are more difficult now that jet engines and NERVAs do not share fuels. And, SSTOs SHOULD be more difficult than in KSP1 imo, SSTOs are anything but easy IRL... However, I think they should be more difficult in a different way than simply not sharing fuel types... Because in reality, these engines should be capable of sharing fuel types... In short, I think KSP2 developers should consider introducing more fuels, and, make some engines multifuel capable, either in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, or in the field (as well as make well researched decisions on which engines are multifuel, how, and why).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;color:rgb(0,0,0);background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003ERP-1/JP-1 to JP-8/Kerosene/Diesel/Alcohol/Gasoline, etc:\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Ca href=\u0022https://www.govinfo.gov/content/pkg/GOVPUB-C13-18e6f8b04c5baea8df583f63c83ce583/pdf/GOVPUB-C13-18e6f8b04c5baea8df583f63c83ce583.pdf\u0022 rel=\u0022external nofollow\u0022\u003EWholly Too Much Information About RP-1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cimg alt=\u0022RP-1_.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/d/dc/RP-1_.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EOne fuel simply absent is a generic heavy hydrocarbon based liquid fuel. I understand the choice to, at least starting off, make most engines \u0022Methane\u0022 powered, as most rocket and jet engines can be made to run off of Methane, at least in theory. It\u0027s a good every-man fuel. In reality though, its lower density and cryogenic requirements often make larger hydrocarbon fuels cheaper and easier to use. It\u0027s why my own plane (The KC-135) was powered by JP-8. Methane is rising in popularity mainly because it provides better performance than larger hydrocarbons, while not being quite as demanding storage wise as LH2, but there are still plenty of reasons to use old fashioned hydrocarbons.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThere are probably hundreds of iterations of the \u0022cheap storable hydrocarbon\u0022 fuel, but KSP 2 could easily simplify this concept down to say, some fictional fuel called \u0022LP-1\u0022, that serve as a universal stand in for all of these variants... Because they all have similar chemistry, similar density, similar performances, etc... For example, one could conceivably throw RP-1 (a rocket propellant) into a jet engine, adjust its specific gravity on the fuel control, and it might run just fine (in fact, I believe that was one of the military requirements in the specifications for RP-1, that it could be used to run existing military jets in a pinch). One reason to choose this fuel in game is that, although it\u0027s dirtier and less efficient (lower \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E) than Methane or LH2, it would also be far denser (smaller tanks for the same mass of fuel), and in the future career mode, it could also be a lot cheaper than any fuel requiring cryogenics (like Methane or LH2). Less efficient fuels like these heavy hydrocarbons can remain competitive against the higher performance stuff, because the lower tankage requirements has the potential to save on dry weight.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;color:rgb(0,0,0);background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EJet Engines (and some rocket engines):\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://library.sciencemadness.org/library/books/ignition.pdf\u0022 rel=\u0022external nofollow\u0022\u003EIgntition! (Truly, one of the books of all time)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uhUJQ8S.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022453\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uhUJQ8S.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EJet engines are generally indiscriminate about what they will burn. John D. Clark even states as such on page 32 of his book Ignition. It\u0027s actually one of the advantages of jet engines, as in WW2, it allowed Germany to use low quality fuels (pretty much just diesel) in high performance aircraft. As such, it would make sense in KSP 2 for jet engines to be able to burn either Methane, or this fictional LP-1... However... It should also be able to burn LH2.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qdYK7bH.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022800\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qdYK7bH.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EAlthough it is an uncommon fuel for jet engines, it is completely conceivable to run a jet engine off of LH2. In fact, running hydrogen fed jet engines was an important stepping stone in jet engine development. Hans Von Ohain ran his first jet engine in 1937... Off of gaseous hydrogen. He chose this fuel because it doesnt leave coke behind (it has no carbon in it), and as a gas, it\u0027s already atomized before even entering the engine. Even liquid hydrogen, is easier to atomize than anything based on hydrocarbons, because of its very low boiling point. Using hydrogen, he was able to get his first prototypes up and running, before working out the issues on using hydrocarbon fuels. He briefly talks about it in the book The Jet Age on page 33 (an awesome primary source that collects accounts from the greatest jet engineers from the jet engine\u0027s early history).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EAgain, generally, hydrocarbons are simply more practical to run in jet aircraft. But, some modern jet engines are designed to run off of LH2. For example, scramjets require the fast atomization properties of LH2, due to how little time intake air spends inside the engine before being exhausted. And, the Sabre engine (the engine the Rapier is based off of) also is designed to run on LH2 for precooling purposes (I\u0027ll get to the Rapier in a minute).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EIn short, I think players should be able to select between LP-1, Methane, and LH2 to run their jet engines off of. This would require a lot of thought from players on whether they want low cost and ease of storage of LP-1, the high efficiency but poor storage of LH2, or the middle man of Methane.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EJet engines are generally aircooled, which means the main consideration in adapting a jet engine to run on different fuels would be the fuel pump, fuel control, and injectors... Which on my engine at least, wouldn\u0027t be that difficult to change out. The bigger concern would be going from normal hardware to something that can handle cryogenics, rather than the physical act of mixing the fuel and air properly. Maybe the fuel lines would need to be changed out for insulated ones as well. But, even in the field, those are all line items a qualified mechanic could change within a few shifts. Also for LH2 in particular, a service engine would likely need to be made out of slightly different alloys, to combat hydrogen embrittlement. Perhaps these changes could be reflected in the fuel efficiency, cost and weight of the engine in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E in game (maybe one day give them slightly different models depending on fuel type). Perhaps the player could select one that could be multifuel in the field (meaning, could be refueled with any of the three fuel types in situ), but also be the most expensive and heaviest version (since it would likely require multiple fuel pumps and some sort of adaptive injector).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003ERocket engines could also be selectable, but should maybe require a lot more thought from the devs on which fuels, which engines, and why. Many of them are designed with active cooling or special turbopumps that rely on a specific fuel. For example, I don\u0027t think an RS-25 (the Vector engine in game) could be very easily adapted to run on LP-1 due to its active cooling and special preburning closed cycle turbopump. By the time you redesigned that into an LP-1 engine, it would basically be a totally different engine anyway, sharing few traits with the original. So perhaps an engine like that should be limited to LH2, and \u003Cem\u003Emaybe\u003C/em\u003E methane. Point is, while in theory rocket engines should be as simple as jet engines to adapt to different fuel types, in practice, it may be really hard, and therefore, not worth doing in KSP 2 for many types of rocket engines (particularly the more advanced and realistic ones. Perhaps multiple fuel options could be restricted to OG engines, like the LV-T30, LV-T45, Skipper, and Mainsail, since those engines are more fictional anyway... Would also give some reason to use them more often).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;color:rgb(0,0,0);background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThe Rapier Engine:\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003E\u003Ca href=\u0022https://www.gov.uk/government/publications/synergetic-air-breathing-rocket-engine-sabre-programme-evaluation-report-2022/synergetic-air-breathing-rocket-engine-sabre-programme-evaluation-report-2022\u0022 rel=\u0022external nofollow\u0022\u003EWholly Too Much Information On The Sabre Engine (Upon which the Rapier engine is based)\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VD4q7YH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002247.76\u0022 height=\u0022406\u0022 width=\u0022850\u0022 src=\u0022https://i.imgur.com/VD4q7YH.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThe Rapier Engine in particular is currently running the wrong fuel. I think one could be built to run on Methane, but above the other jet engines, it is specifically designed to run on LH2 in real life (the Sabre engine), to take advantage of the cryogenic LH2 for precooling. This is one of the reasons why Skylon is so big, that \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E needs to store LH2 to run the Sabre engines.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EJet engines get most of their energy out of a fuel by having a difference in temperature between intake air, and exhaust. The greater this difference, the more power and efficiency the engine has. Engines are made out of non-fictional materials however (kind of a dumb way to put it, but it\u0027s apt), which means there\u0027s only so hot they can get before they literally just melt or fail inside. This places an upper bound on exhaust temperature. However, the intake air can also get pretty hot as a lower bound for this temperature difference. The act of forcibly compressing air through ramming (which basically every jet engine does except for Scram engines, which can\u0027t afford to do that very much) increases intake air temperature before it even has a chance to be burned, reducing efficiency and thrust. This problem gets worse and worse the faster you go, as shock heating at supersonic, and then hypersonic speeds, increases intake air temperature to the point where it\u0027s as hot as the exhaust... This is the end of the road as far as normal jet engines are concerned, as there is no way to burn fuel at those intake temperatures, without the exhaust just melting the engine.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThe Sabre engine aimed to solve this problem with the use of a precooler. Instead of using ram compression to compress intake air, it instead uses an extremely efficient heat exchanger between cryogenic fuel (liquid hydrogen) and intake air. This is pretty amazing technology actually, as it allows the engine to both compress AND cool the intake air, rather than trade off between compression and heating. Since it cools the intake air, it allows the engine to operate at airspeeds far higher than any other jet engine. This doesn\u0027t just have applications in the hybrid jet/rocket Sabre engine, in theory, adding a precooler like this to any suitable jet engine, should massively improve that engine\u0027s efficiency, thrust, and top speed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EUnfortunately, the precooler in KSP1 doesn\u0027t do a whole lot besides act as a decent inline intake. KSP2 should probably rectify this by making the in-game precooler do what it says on the tin (cooling intake air to allow faster operation of jet engines, particularly for the rapier engine... In fact, the rapier probably shouldn\u0027t be able to go faster in airbreathing mode than the panther or whiplash, without a precooler).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EConsidering all of this... The rapier engine should probably come standard as using LH2, and requiring an LH2 fed precooler to run at peak performance... Conveniently, this would mean it uses the same fuel as the nuclear engines, to the rejoice of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E builders (though also require the massive fuel tanks and the new low density LH2). As for the selectability of those two components... Well... Methane is still cryogenic to some extent, so maybe that would work. LP-1 wouldn\u0027t be cryogenic at all. However, even LP-1 ran through a precooler could be better than no precooler at all, due to the difference in heat capacity between any liquid state fuel, and the gaseous state of the intake air. That\u0027s actually one of the reasons why the precooler is so efficient IRL, it\u0027s not just that the LH2 is cold, it\u0027s also that it is in a liquid state, far denser than the intake air. So even tepid LP-1 could be used as a coolant against thousand degree intake air. So perhaps the Rapier and Precooler could be considered multifuel as well in game... But there would have to be some performance penalties for using less or non-cryogenic fuels. Perhaps the devs could reach out to Reaction Engines to ask them directly whether or not the precooler/Sabre concept could even remotely work with anything other than LH2 to confirm.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;color:rgb(0,0,0);background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003ENERVA:\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://trace.tennessee.edu/cgi/viewcontent.cgi?article=1004\u0026amp;context=utne_reports\u0022 rel=\u0022external nofollow\u0022\u003EWholly Too Much Information About Nuclear Rocket Propellants\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Drawing_of_the_NERVA_nuclear_rocket_engi\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022160.67\u0022 height=\u0022859\u0022 width=\u00221200\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/3/34/Drawing_of_the_NERVA_nuclear_rocket_engine_GRC-2003-C-00851.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThe nuclear engines are perhaps the most multifuel capable engines IRL, of the engines on this list. In nuclear engines, the \u0022fuel\u0022 is actually the fuel rods (Uranium or Plutonium), and what is exhausted is just propellant. A propellant is literally anything with mass, and in NERVA engines, are little more than a coolant for the core... So any fluid that can suitably act as a coolant, can be used in a NERVA engine. There is no need for combustibility for a NERVA propellant, so even completely inert fluids are usable (Helium, for example).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThe main reason LH2 is used is that, in any rocket, a higher exhaust velocity increases efficiency. That exhaust velocity is, at least in any thermal rocket (from chemical rockets to nuclear thermal rockets) a function of both the energy produced (heavily correlated to temperature) and the molecular weight of the exhaust... LH2 is the lowest conceivable molecular weight (unless you want to get into some crazy fuels like metallic hydrogen, plasmas, or laser light), which means that for the same operating temperature, hydrogen can be accelerated to the highest exhaust velocities possible in thermal propulsion.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThere\u0027s also a big reason not to use anything else. Most of the NERVA\u0027s efficiency is achieved purely through the use of such a lightweight propellant, and not by achieving high temperatures. The peak allowable temperature of the core of a nuclear rocket is actually often lower than what temperatures can be achieved in chemical propulsion (though the nuclear engines in game appear to achieve pretty ludicrous core temps)... This means that running something heavier, such as perhaps water, could leave the NERVA operating at as low, or lower \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E than high performance chemical rockets like the Vector (RS-25) engine, depending on the core temperature of the NERVA.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EAlthough LH2 is clearly the best option for a nuclear engine, there is still good reason to give a player the option to run suboptimal fuels. For example, maybe a player just wants fuel compatibility between engines and between other spacecraft, so they\u0027re willing to take a hit on engine efficiency if it means only dealing with Methane. I think the best reason for it is to ensure greater usability in deep space where fuel production is limited. Let\u0027s say you\u0027re busy colonizing the Jool system, and only have simple H2O or Methane mining set up, but no real LH2 production set up... A suboptimal fuel on a nuclear powered spacecraft is better than no fuel at all. In fact, I think having the nuclear engines have an in situ mutlifuel option would be pretty amazing, even if that version of the engine were ungodly heavy, if only because it gives the player a lot of capability in fueling it with basically anything they can find out in deep space. One could literally just melt ice from comets, and with no electrolysis or croygenics for LH2 production, run straight water to get back to Kerbin, then switch over and refuel with LH2 in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E for the outbound trip.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jk5Y6VY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.75\u0022 height=\u00221013\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jk5Y6VY.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EI found a 2016 research report which shows predicted ISPs for different propellant types, LH2, NH3, H2O, and CO2, at different core temperatures. This graph peaks at just over 1100 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E for LH2 at a core temperature of 3600k. The bigger nuclear engine in KSP 2 achieves 1450 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E, which suggests a pretty insane core temperature of more like 4,000k. Although this chart doesn\u0027t go that high, we can still make some educated guesses.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EMethane has a molecular weight of about 16 g/mol, which should give it an \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E slightly better than NH3 (which has about 17 g/mol). Now, the two nuclear engines in the game are at 900 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E and 1450 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E with LH2 (if I remember correctly). Going off the graph in this document, it would be reasonable to have a methane propelled version at 500 and 800 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E respectively... Which honestly, is nothing to sneeze at. Even H2O propelled versions (if H2O is ever added as a resource) would manage 350 and 500 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E respectively (even worse, but better than nothing, and still \u003Cem\u003Ejust\u003C/em\u003E outperforming most chemical rockets... Though in a much heavier engine than any chemical rocket). Then LP-1 could be used too, though I\u0027d imagine its \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003E\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E\u003C/abbr\u003E would be awful (maybe as bad as monopropellant)... That\u0027d be the sort of thing a player would just use in an emergency, like if they\u0027re willing to throw ANYTHING in the core to get back home.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EThat reminds me, it would be nice to use oxidizer as well, as a way to use unspent oxidizer... Though that might not be the best idea IRL, given most oxidizers, particularly liquid oxygen, HAPPILY react with metals in high temperature environments in the absence of fuel to react with... Perhaps that could be a funny feature though, like, use oxidizer in a nuclear engine for an emergency, but take care not to use it too long, or the engine blows up.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EBTW, this is sort of in-line with the performance of methane and water nuclear thermal rockets from the game Children of a Dead Earth, which is another realistic space sim that does allow for different propellants on nuclear thermal engines.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EOne final advantage of allowing for different fuels on nuclear engines, is heavier fuels may actually increase the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of the engine (it\u0027s easier to get higher mass flow rates out of heavier fuels, if for example, the propellant pumps and injectors being used are more volume flow rate limited than mass flow rate limted). This could mean that these otherwise very heavy nuclear engines could be more useful in landing in taking off from worlds using Methane, and then switch to LH2 for long hauls between planets.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n----------------------------------------------------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.38;margin-top:0pt;margin-bottom:0pt;\u0022\u003E\n\u003Cspan style=\u0022font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\u0022\u003EAnyway, this has been a long winded case for multifuel engines.\u003C/span\u003E If you\u0027ve managed to drag yourself this far through my word vomit, then I\u0027d be interested to hear what your thoughts are as a player. Do you think this would add to player choices, dilemmas, and improve game-play, or do you think multifuel engines only needlessly complicate things? Personally, I like the Dilemma of... Do I rot in deep space for eternity, or dare use the forbidden propellant (pure oxidizer) in the 10 ton nuclear power plant, rolling the dice on getting back home alive? Or detonating in a mini Chernoby that can be seen from Kerbin...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-27T07:30:51Z\u0022 title=\u002202/27/2023 07:30  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 27, 2023\u003C/time\u003E by justmeman117\u003C/strong\u003E\n\u003Cbr\u003EOG engines note\n\u003C/span\u003E\n"},{"CreatedByName":"Sea_Kerman","CreatedById":226149,"CreatedDateTime":"2023-02-27T07:34:37Z","Content":"\n\u003Cp\u003E\nI recall one of the dev sneakpeeks talking about a bimodal NTR where you could inject oxygen to get increased thrust but lower specific impulse\n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T17:04:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224245511\u0022 data-ipsquote-contentid=\u0022213555\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677483277\u0022 data-ipsquote-userid=\u0022226149\u0022 data-ipsquote-username=\u0022Sea_Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Sea_Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI recall one of the dev sneakpeeks talking about a bimodal NTR where you could inject oxygen to get increased thrust but lower specific impulse\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027d be interesting. I bet it could be doable IRL too, if you injected the oxidizer after the nuclear core, so all it serves is to add a little extra chemical energy to an already hot LH2 exhaust. After passing LH2 through the core, you could probably handle higher exhaust temps. It would kill \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E somewhat because of the oxygen\u0027s molar mass, but it could increase thrust by quite a lot.\n\u003C/p\u003E\n"}]}