{"TopicId":213581,"ForumId":119,"TopicTitle":"Where are the devs?","CreatedByName":"coyotesfrontier","CreatedById":181596,"CreatedDateTime":"2023-02-27T10:08:48Z","PageNum":5,"Articles":[{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2023-02-27T20:50:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246544\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677530844\u0022 data-ipsquote-userid=\u0022176003\u0022 data-ipsquote-username=\u0022DunaManiac\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, DunaManiac said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246105\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677511608\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022We\u0027re going to kill the Kraken!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nNot \u0022We killed the Kraken\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s just semantics and is ultimately a meaningless distinction.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen people start making the devs out as liars because of that \u0022\u0022\u0022meaningless distinction\u0022\u0022\u0022, then it really isn\u0027t meaningless.\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2023-02-27T20:54:45Z","Content":"\n\u003Cp\u003E\nI don\u0027t think it meaningless, and pointing out the difference is very fair. TBH I think most people had forgotten the exact context of the statement instead of arguing in bad faith though.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I still think there is a very valid criticism even in proper context. And that\u0027s that from my perspective we don\u0027t see Intercept even \u003Cem\u003Etry\u003C/em\u003E to slay the kraken.\n\u003C/p\u003E\n\u003Cp\u003E\nThey seem to be using exactly the same Unity physics engine, with exactly the same bugs as in KSP 1 from buggy wheels to noodly rockets to docking/undocking explosions. If you want to use the Kraken you don\u0027t reuse the exact same messy joint system and don\u0027t even add something like autostrut to at least tame the kraken a little. The first time I suspected there would be trouble with this part of the game was when Matt Lowne off-handedly mentioned the planes veering to the side issue and that he told the Devs what settings to use for the wheels (friction) to avoid that.\n\u003C/p\u003E\n\u003Cp\u003E\nAs weird as it sounds if we had at least \u003Cem\u003Edifferent\u003C/em\u003E physics bugs this time around, I could believe that they tried to really work on that part and it just turned out harder than expected.\n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T21:21:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246543\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677530687\u0022 data-ipsquote-userid=\u002275586\u0022 data-ipsquote-username=\u0022Grease1991\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, Grease1991 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI started playing KSP back at .19 i think, and have followed the devs and enjoyed the game despite bugs and kraken type issues, and that\u0027s was fine because of the fact that this was merely a small team just doing something they were passionate about, \u003Cbr\u003E\nI was hyped about ksp2 back in 2019 when they announced it and was always on the side of make it right take the time to make it right, \u003Cbr\u003E\nThe problem is that the devs have seemly only cared about attracting people to the KSP world, with shiny graphics and tutorials, and spending time and money on making video about how much they cared, instead of fixing core issues with the game. and making a SOLID CORE to release into EA, \u003Cbr\u003E\nthere are super basic bugs that would have been blindingly obvious, if there was any play testing at all, that aren\u0027t even a problem in KSP 1 officially,  due to the old devs fixing it, \u003Cbr\u003E\n\u003Cbr\u003E\nI\u0027m not talking about FPS issues or random things that are hard to repeat, i\u0027m talking about things as simple as making a simple 11 part Plane, be able to roll down the runway without wobbling it self to destruction.\u003Cbr\u003E\n\u003Cbr\u003E\nI really hope that they get their priorities straight because every ounce of faith i had in this team died on friday, and the idea of T2 taking the money they have got and running doesn\u0027t sound out of character for them, \u003Cbr\u003E\nI think the people in charge tried to make KSP into an Triple A franchise and focused on the shiny bits of that and i don\u0027t think they realized what a difficult thing making KSP is, \u003Cbr\u003E\n\u003Cbr\u003E\nMy prediction is that Modders are going to end up fixing way more and improving the game far more than the devs will, until I see something that resembles REAL progress, I\u0027m not going to throw money back at this game, not at 50 bucks,  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have similar worries about Take Two, because youre right, it wouldnt be out of character for them. Take Two is the one variable that makes me doubt my decision in buying the game.\n\u003C/p\u003E\n\u003Cp\u003E\nBut, I wouldnt claim the devs only worked on shiny stuff. The more I play, the more hidden features I find (like what seems like a more complex damage model for vehicles and parts, something I\u0027ve always wanted, or struts that WILL bind to the part you tell it to, regardless of part occlusions... Which imo, is a big improvement over KSP 1 struts). Also, BECAUSE they\u0027ve been rushed, I wouldnt be surprised if the last few months of dev work has actually been about stripping out stuff that simply wasnt going to be ready in time. We already have a load of in-game footage for content like the late game propulsion systems, and the other solar systems... Do they not get credit for developing stuff that is in progress, and that had to be stripped out to try and make, what is ostensibly a dev version of the game, somewhat playable?\n\u003C/p\u003E\n\u003Cp\u003E\nConsidering what they were working on in the dev videos, I get the impression the dev team was under the assumption they wouldnt release the game until that content had been reasonably finished, and probably got a rude awakening from Take Two.\n\u003C/p\u003E\n\u003Cp\u003E\nIts a reasonable criticism to argue they should have made a solid core game before EA... I just get the impression they intended on doing exactly that with, well, a larger and more feature rich, core of game than their publisher allowed time for. Had they gotten all the parts and planets done first, then they could have more completely and easily squashed bugs after that (rather than introducing both parts, planets, AND bugs, piecemeal, the same way KSP 1 did that made that game a slog to develop).\n\u003C/p\u003E\n\u003Cp\u003E\nNow that it\u0027s out, Im more concerned about them rushing bug fixes and feature development in a bandaide solution manner, the same way KSP 1 feels like its held together by hopes and dreams sometimes.\n\u003C/p\u003E\n\u003Cp\u003E\nPS, planes wobble themselves apart on the runway in KSP 1 too. Its a known problem with a known solution, Matt Lowne even made it a point to Nate Simpson himself. The nosewheel is the problem. Disable automatic friction control, and braking, on the nose wheel, on all your aircraft. Ive done nothing but make planes in KSP 2, and theyve all gone down the runway just fine with these settings (except one really botched landing).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-27T21:23:41Z\u0022 title=\u002202/27/2023 09:23  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 27, 2023\u003C/time\u003E by justmeman117\u003C/strong\u003E\n\u003Cbr\u003EPs\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-02-27T21:22:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246489\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677528288\u0022 data-ipsquote-userid=\u002284618\u0022 data-ipsquote-username=\u0022justmeman117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, justmeman117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEXACTLY this, I made this point in youtube comment. I get the anger over the price vs the quality (because that IS a genuine discrepancy), but it makes complete sense to me if you want to limit the game to committed and invested players who dont mind paying that much to play test a mess. The price would have been infintely more disturbing if they\u0027d tried to obfuscate the game\u0027s actual progress prerelease like Anthem tried to (which was a serious cash grab).\n\u003C/p\u003E\n\u003Cp\u003E\nPrice is a useful filter. I actually figured this out trying to do photography as a side business. One of the biggest complaints in that field is that customers wouldnt know what quality photography looks like if it smacked them in the face, and most customers just want the cheapest deal they can find. And new photographers run themselves ragged trying to take on too many clients compensating for their \u0022new photographer\u0022 price with sheer volume. That might work initially to get a few clients as a nobody with no portfolio yet (I actually did most of my photography for others for free just to build a portfolio, and not feel obligated to push out a product asap), but can quickly snowball if your work truly is good, and truly does get popular. Something I realized is that, if you truly are a decent photographer, one way to work less for the same amount of profit, and deal with less crappy customers, is to just increase your price. It weeds out metaphorical tire kickers that waste your time, and focusses solely on customers that appreciate your product. A lot of people complaining this game didnt release at 15 dollars, or comparing it to KSP 1s early access (when 8 dollars a copy could pay a 1 man dev team doing it as a side hustle reasonably well in 2011) are the very sorts of people who would have bought it, then left a ton of unhelpful angry hot takes as \u0022feedback\u0022 to the point of drowning out invested players. As price goes down, number of players and opinions goes up dramatically, and the quality of those voices tends to go down... I can point to just how toxic (and also terrible at the game) the teams are in free to play games like World Of Tanks as an example. By virtue of being free, any moron can (and does) play it.\n\u003C/p\u003E\n\u003Cp\u003E\nI started playing KSP 1 back in 2013 on a crap laptop. It too was a 5-20 fps experience on minimum settings, in a game full of bugs. But I was there for most of the game\u0027s development, and enjoyed having a voice in that development... So I plan to be here for KSP 2\u0027s as well. I\u0027ll play till I get frustrated, give feedback, then put the game down till next patch, and pick it up again when bug and content patches come out. That was one of the few things that ever got me hyped in gaming, seeing KSP 1 drop a new patch. It was fun playing with the new parts and features... And I expected new bugs everytime, as the new parts inevitably broke something previously working. I feel like KSP 1 didnt really get popular till the last like, 5 years, after the game had already improved immenseley. And perhaps older players have some rose colored glasses. I actually have to think pretty hard to try and remember WHAT bugs early KSP 1 had, but then a few memories start popping up, and I\u0027m just like \u0022Oh yeah... That game was broken as all hell, lol\u0022. One way or another, people\u0027s expectations were gonna be too high for this game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis, starting playing KSP early enough to get in by the free dlc cause but probably not by much, no rover wheels yet. Had some mod probe rover based on the bouncy ball Mars lander. and an two man crewed one I took on an grand tour using kethane?\u003Cbr\u003E\nInducing an Eve landing with an rover and using airship to get out of the soup. \u003Cbr\u003E\n\u003Cbr\u003E\nIs it me or did the ESA event had less bugs than we see now? Yes they had better hardware and scope was more limited. Has an feeling KSP 2 get way much more bugs if stressed and get low frame rates, was not an thing in KSP 1.\u003Cbr\u003E\nBut know this is common in games. Classical is physic is implemented before buildings are loaded so stuff falls \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\nThis get much worse in multiplayer games, and it can be exploited here if you accept client lag as New World showed, in short it was ways you could delay damage doing simple stuff on client. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut back to KSP 2, how does it work for people with high end setups who scale back graphic. or do simpler stuff. \u003Cbr\u003E\nWaiting for my new graphic card so no KSP 2 for me. Ryzen 9  3900X, 64 GB ram and an fast M2 SSD, but the GPU is an 980 ti. Got money to upgrade system back then lock down started so updated everything but the GPU and the disc drives stack. \u003Cbr\u003E\nGetting an 4070 ti, wanted an 4080 but the 4070 ti is the one I probably able to get company to pay for  upgrade. \u003Cbr\u003E\nAs in I tell them to pull from salary if to expensive, who i\u0027m sure would happen with I got an 4090, perhaps with an 4080 bu the 4070 ti is below the limit I think. \n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T21:37:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246589\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677532920\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis, starting playing KSP early enough to get in by the free dlc cause but probably not by much, no rover wheels yet. Had some mod probe rover based on the bouncy ball Mars lander. and an two man crewed one I took on an grand tour using kethane?\u003Cbr\u003E\nInducing an Eve landing with an rover and using airship to get out of the soup. \u003Cbr\u003E\n\u003Cbr\u003E\nIs it me or did the ESA event had less bugs than we see now? Yes they had better hardware and scope was more limited. Has an feeling KSP 2 get way much more bugs if stressed and get low frame rates, was not an thing in KSP 1.\u003Cbr\u003E\nBut know this is common in games. Classical is physic is implemented before buildings are loaded so stuff falls \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\nThis get much worse in multiplayer games, and it can be exploited here if you accept client lag as New World showed, in short it was ways you could delay damage doing simple stuff on client. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut back to KSP 2, how does it work for people with high end setups who scale back graphic. or do simpler stuff. \u003Cbr\u003E\nWaiting for my new graphic card so no KSP 2 for me. Ryzen 9  3900X, 64 GB ram and an fast M2 SSD, but the GPU is an 980 ti. Got money to upgrade system back then lock down started so updated everything but the GPU and the disc drives stack. \u003Cbr\u003E\nGetting an 4070 ti, wanted an 4080 but the 4070 ti is the one I probably able to get company to pay for  upgrade. \u003Cbr\u003E\nAs in I tell them to pull from salary if to expensive, who i\u0027m sure would happen with I got an 4090, perhaps with an 4080 bu the 4070 ti is below the limit I think. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBro, I was so mad at myself about the DLC.\n\u003C/p\u003E\n\u003Cp\u003E\nI started playing KSP in 2013, inside the window to get the DLC for free... But as a teen with parents who hated video games, and no credit card, I must admit, I pirated it. I probably have another thousand or more hours in the game that Steam hasnt logged, because of this. In 2015, I finally bought. Ended up getting the DLC anyway, but I was kicking myself for not just finding a way to buy it back in 2013.\n\u003C/p\u003E\n\u003Cp\u003E\nI watched every ESA video I could, and I dunno man, it seemed pretty buggy even then to me. One of the youtubers showed their plane just... disintigrating into a pile... IN THE \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (lol. It wouldve been actually funny if it didnt destroy that persons work). So far, it\u0027s actually been less buggy than the ESA videos to me. I have yet to have a \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E vehicle do something that insane to me. To be fair though, the most time I\u0027ve spent in space is one suborbital flight in a plane. And it seems like most of the truly game breaking bugs people are complaining about are quicksave/quickload on longer missions, kraken attacks on big rockets, and phantom forces interferring with orbital dynamics. I\u0027ve mostly avoided all that so far, just playing with planes.\n\u003C/p\u003E\n\u003Cp\u003E\nBtw, Im running the game on an i7-6700k, GTX 1070, and 64gb of ram, 1080p min settings. It definitely chugs, but I can get like 15-20 fps with small planes around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. I wouldnt call it unplayable, I\u0027ve been enjoying it actually. The multiple running engines and fuel flow calculations do make the game chug though (one of their current optamization priorities). Im probably going to go see if I can improve framerate with my jumpjet by making one that flies well with only 1 engine on, instead of needing 5.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d kill for a 4090. But, I recently spent my life savings on a plane to pursue a private pilots license, so I cant really afford to upgrade for a hot minute. If its gonna come between playing KSP, and finally chasing my dream of flying, flying is gonna win. I dont get 15 FPS sitting in a real plane, lol.\n\u003C/p\u003E\n"},{"CreatedByName":"jost","CreatedById":196999,"CreatedDateTime":"2023-02-27T22:04:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246588\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677532888\u0022 data-ipsquote-userid=\u002284618\u0022 data-ipsquote-username=\u0022justmeman117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, justmeman117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut, I wouldnt claim the devs only worked on shiny stuff. The more I play, the more hidden features I find (like what seems like a more complex damage model for vehicles and parts, something I\u0027ve always wanted, or struts that WILL bind to the part you tell it to, regardless of part occlusions... Which imo, is a big improvement over KSP 1 struts). Also, BECAUSE they\u0027ve been rushed, I wouldnt be surprised if the last few months of dev work has actually been about stripping out stuff that simply wasnt going to be ready in time.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. I used to work in a software engineering company who developed an infotainment systems for cars. Our flagship product had a lot of issues during development resulting from two incompatible wishes of our managment and the customers managment: The customer always wanted more features but also wanted to have a stable (meaning: A crash is only allowed every 10000 kilo metres ) navigation system (which was the core function of our product). \u003Cbr\u003E\nAt some point it was agreed to reduce features to have a stable product at the release date (aka beginning of assembly of the new cars the software was supposed to run on) and adding the other features with later maintenance patches. \u003Cbr\u003E\nSo I guess there were  similiar discussions between TakeTwo and Intercept Games although with a much more disappointing result for every envolved party. Frankly: Neither the community nor the KSP2 developers nor the publisher  can be happy with the current state but now they have to deal with it somehow.\u003Cbr\u003E\nEdit: Just to avoid misunderstanding: I wasn\u0027t a software developer but part of the integration/infrastructure team (we were responsible for tools the developer needed to actually do their work. Think of it as a kind of corporate github). \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-27T22:21:50Z\u0022 title=\u002202/27/2023 10:21  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 27, 2023\u003C/time\u003E by jost\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"whatsEJstandfor","CreatedById":220814,"CreatedDateTime":"2023-02-27T22:12:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246606\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677533847\u0022 data-ipsquote-userid=\u002284618\u0022 data-ipsquote-username=\u0022justmeman117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, justmeman117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut, I recently spent my life savings on a plane to pursue a private pilots license, so I cant really afford to upgrade for a hot minute. If its gonna come between playing KSP, and finally chasing my dream of flying, flying is gonna win. I dont get 15 FPS sitting in a real plane, lol.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUnrelated to the thread, but dude congrats. I was going for mine, too, and considering switching careers to become a commercial pilot at some point, but then I got scared after reading the divorce rates of pilots lmao. As much as I love flying, I love my wife more\n\u003C/p\u003E\n"},{"CreatedByName":"TheArturro","CreatedById":225694,"CreatedDateTime":"2023-02-27T22:15:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246673\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677535959\u0022 data-ipsquote-userid=\u0022220814\u0022 data-ipsquote-username=\u0022whatsEJstandfor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, whatsEJstandfor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[...] As much as I love flying, I love my wife more\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDude, that\u0027s so wholesome!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBack to the topic:\n\u003C/p\u003E\n\u003Cp\u003E\nI think that devs will try to get away from socials at least until first major bug-fixing update.\n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-27T22:23:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246660\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677535478\u0022 data-ipsquote-userid=\u0022196999\u0022 data-ipsquote-username=\u0022jost\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, jost said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis. I used to work in a software engeneering company who developed infotainment systems for cars. Our flagship product had a lot of issues resulting from two incompatible wishes of our managment and the customers managment: The customer always wanted more features but also wanted to have a stable (meaning: A crash is allowed every 10000 kilo metres ) navigation system (which was the core function of our product). \u003Cbr\u003E\nAt some point it was agreed to reduce features to have a stable product at the release date (aka beginning of assembly of the new cars the software was developed) and adding the other features with later maintenance patches. \u003Cbr\u003E\nSo I guess there were  similiar discussions between TakeTwo and Intercept Games although with a much more disappointing result for every envolved party. Frankly: Neither the community nor the KSP2 developers nor the publisher  can be happy with the current state but now they have to deal with it somehow.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for your input, I don\u0027t work in IT myself... But I\u0027ve had other similar experiences. I used to work as a jet engine mechanic in the military, so there was always a balance between getting fixes done right, vs in time enough for planned missions to please bosses... At some point, I realized it would never be \u0022fast enough\u0022 for them, especially with out resources, and just tried to do it right regardless of time crunch. It also gave me a lot of troubleshooting experience (a lot like bug hunting), which is a lengthy and methodical process. I\u0027ve also tried to teach myself programming, and will probably have to actually learn it as a physics major at some point... It\u0027s insane how one missed thing can completely implode a program, and KSP 2 probably has a couple hundred such lines of code hiding in its bowls somewhere. It\u0027s easy to judge from the outside looking in, but programing and game development isn\u0027t easy, and it gets even harder when you got a soulless corp like Take Two calling the biggest shots like release dates.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also sure the devs and Take Two are as unhappy with the launch as the player base, this will probably hurt their profits and reputation in the long run. I\u0027ve also wondered if Steam fines publishers for refunds, in which case, KSP 2 has incurred a massive cost that wouldn\u0027t have happened it they just left it in the oven as it were. I still ultimately blame Take Two. It was most likely their call to release it by this arbitrary release date. And it\u0027s such a TRASH way of managing developer time. They\u0027ve wasted how many developer hours now having to gut the entire game of anything unfinished, and whats left never had a chance to be optimized? And now they have to optimize what\u0027s left, and THEN return to the unfinished content, THEN finish it, THEN implement it piecemeal, THEN optimize each piece, THEN still get bug reports from annoyed players that then become your play testers now that it\u0027s \u0022released\u0022. It reminds me of doing 4 times the work to cannibalize parts off of grounded planes, just to get other planes up and running slightly sooner than waiting for parts to ship through the supply system. This is the kind of trash workflow that leads to developer crunch and burnout culture. I get that games need to come out SOMEDAY, but Take Two are literally blind if they think this was done enough. You can\u0027t just WILL a game into being complete enough by an arbitrary date, to release. I get the impression publishers put release dates on devs to pressure them into working harder to get it done by that date, but when it\u0027s SO out of line with reality, it becomes physically impossible.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2023-02-27T22:24:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246673\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677535959\u0022 data-ipsquote-userid=\u0022220814\u0022 data-ipsquote-username=\u0022whatsEJstandfor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, whatsEJstandfor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUnrelated to the thread, but dude congrats. I was going for mine, too, and considering switching careers to become a commercial pilot at some point, but then I got scared after reading the divorce rates of pilots lmao. As much as I love flying, I love my wife more\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nForum user attempts to apply statistics, broad general things, to a very specific situation\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ig2rdxX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.58\u0022 height=\u0022195\u0022 width=\u0022258\u0022 src=\u0022https://i.imgur.com/ig2rdxX.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jost","CreatedById":196999,"CreatedDateTime":"2023-02-27T22:29:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246675\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677536143\u0022 data-ipsquote-userid=\u0022225694\u0022 data-ipsquote-username=\u0022TheArturro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, TheArturro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think that devs will try to get away from socials at least until first major bug-fixing update.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis . It\u0027s part of management jobs to give the developers space so they can focus on important issues. And reading and reacting to social is not important if you want to actually fix the issues. There is a reason why in automotive software the project managers of customers talk with the project managers of the software studio. \u003Cbr\u003E\nFor the same reasons gaming studios have community managers: Developers have more important things to do than throwing themselves in ashes in front of disappointed players. \n\u003C/p\u003E\n"},{"CreatedByName":"RocketRockington","CreatedById":223189,"CreatedDateTime":"2023-02-28T00:00:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246675\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677536143\u0022 data-ipsquote-userid=\u0022225694\u0022 data-ipsquote-username=\u0022TheArturro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, TheArturro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDude, that\u0027s so wholesome!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBack to the topic:\n\u003C/p\u003E\n\u003Cp\u003E\nI think that devs will try to get away from socials at least until first major bug-fixing update.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProbably.  Watching the KSP devs come hang out on streamer\u0027s streams right after a release, I got the sense that they were happy and proud to share what they built and enjoyed seeing the streamers play it.\n\u003C/p\u003E\n\u003Cp\u003E\nSince that didn\u0027t happen with the KSP2 release, the only possibilities are that either the devs from KSP 2 were encouraged not to interact with the community because it\u0027s a bigger project so they wanted to keep a tighter control of public contact,  the devs knew what kind of reception it would be getting and voluntarily stayed away, or that the devs didn\u0027t care that much about how the fans saw it. Hard to believe that last one but threw it in to be complete.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of those are a good look vs KSP1.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T00:00:52Z\u0022 title=\u002202/28/2023 12:00  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by RocketRockington\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2023-02-28T01:12:12Z","Content":"\n\u003Cp\u003E\nDevs should be working on game.  \n\u003C/p\u003E\n\u003Cp\u003E\nCommunity managers on the other hand... Good question.\n\u003C/p\u003E\n\u003Cp\u003E\nThey should head to the steam forums and put the fires out.  Because the damage the haters on steam are causing is going to sting for awhile.  And not talking about the generally upset person.  I talking about the people actively telling lies, and causing mayem.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T01:16:21Z\u0022 title=\u002202/28/2023 01:16  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2023-02-28T01:27:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246913\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677547439\u0022 data-ipsquote-userid=\u0022225683\u0022 data-ipsquote-username=\u0022VlonaldKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, VlonaldKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhich lies and what mayhem? Genuinely curious.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know people are saying the devs claimed to have defeated the Kraken when they were clearly just issuing themselves the challenge, in a very tongue-in-cheek way as well I might add.\n\u003C/p\u003E\n"},{"CreatedByName":"Niroc","CreatedById":226187,"CreatedDateTime":"2023-02-28T01:30:46Z","Content":"\n\u003Cp\u003E\nAs a refugee from said steam forums. It\u0027s bad out there guys, real bad. We got people over there who don\u0027t even own the game (so far as I can tell) just making stuff up, we got those same people creating copy pasted threads to keep their stuff bumped to the top and we have legit 11-12 page 150\u002B post long threads arguing over things we have little control over. \u003Cbr\u003E\n\u003Cbr\u003E\nEdit: Oh and that\u0027s not to mention the people who are just stirring things up to farm points. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T01:32:15Z\u0022 title=\u002202/28/2023 01:32  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by Niroc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"abobination","CreatedById":226918,"CreatedDateTime":"2023-02-28T01:32:19Z","Content":"\n\u003Cp\u003E\nThere is also a developer saying that goes. Tho shall not deploy on Fridays. I feel like they should have deployed Monday so they have people on hand to fix those critical day one bugs.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope there is something pushed soon so I can undock around a planet.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224245671\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677493152\u0022 data-ipsquote-userid=\u0022174038\u0022 data-ipsquote-username=\u0022LoSBoL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, LoSBoL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere is a Dutch saying that applies here, sit still when being shaved. \n\u003C/p\u003E\n\u003Cp\u003E\nOn a sidenote I hope they are working their bottoms off creating a 1st day patch, which is late already. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DadJokeCinema","CreatedById":226590,"CreatedDateTime":"2023-02-28T02:19:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246350\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677521910\u0022 data-ipsquote-userid=\u0022139108\u0022 data-ipsquote-username=\u0022radimov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, radimov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCommunication between developers and the community should be constant, especially in the early days, but it is not.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNah\n\u003C/p\u003E\n"},{"CreatedByName":"Fullmetal Analyst","CreatedById":212373,"CreatedDateTime":"2023-02-28T02:30:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224245807\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677499881\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut I have seen community managers popping up here and there few times already, so they\u0027re with us.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni dont really have the feeling that they are with us, they didnt even mention most of the obvious, game breaking bugs in the early access notes, they are just trying to sweep this under the carpet and get as many 50€ sales as possible before the bubble bursts...\u003Cbr\u003E\n\u003Cbr\u003E\nread my post \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/213142-do-you-guys-feel-like-this-is-what-the-fan-patience-deserved/\u0026amp;do=findComment\u0026amp;comment=4246919\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E and think again carefully - are they with us or are they just trying to mitigate damage on sales?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T04:44:40Z\u0022 title=\u002202/28/2023 04:44  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by Fullmetal Analyst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dragonart777","CreatedById":225542,"CreatedDateTime":"2023-02-28T02:31:19Z","Content":"\n\u003Cp\u003E\nthere is a lot of people on steam making up rumors about them in the hole and no funding and so on with no proof.   there is a lot of cry babys out there over this price tag.  acting like this game was cheap 8 years ago.  when in fact it was 39$ when ksp first came out.  that is 10$ less then what it is now.    they could of made it 20$ and they still cry about it.   most of this people crying dont even own the game  or can not afford it.  some just follow the leader and cant make there own decisions.     if this game does go cashgrab  i not going to blame the devs  i blame the karens that or crying over price tags.      give the devs a chance and let them work on the game.  i be hinding my crew to.  i wont them to focus on the bugs not worrie about the haters,     and let us all hope that is whats going on.  cause as of right now.  we all crossing fingers waiting for that first update.  or some word from or devs to give us all hope.     devs  dont leave us.  and dont pay them no mind.   this well turn around  crossing fingers \n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2023-02-28T03:17:18Z","Content":"\n\u003Cp\u003E\nSeveral off topic comments have been removed.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease keep to the topic at hand.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThank you for your understanding.\u003Cbr\u003E\nForum Moderation Team\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2023-02-28T03:43:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246505\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677528705\u0022 data-ipsquote-userid=\u0022161623\u0022 data-ipsquote-username=\u0022Missingno200\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Missingno200 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d find it hard to justify that price, unless it came with a joystick or something... I already find it difficult to justify 60 dollar games today. There\u0027s a reason why I had way more DS games than Xbox and Wii games.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDespite N64 games  cost 45 bucks in 1998... 50 in 2023, a quarter century later, is definitely pushing it\n\u003C/p\u003E\n"},{"CreatedByName":"Fullmetal Analyst","CreatedById":212373,"CreatedDateTime":"2023-02-28T04:18:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224246832\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677542406\u0022 data-ipsquote-userid=\u0022223189\u0022 data-ipsquote-username=\u0022RocketRockington\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, RocketRockington said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSince that didn\u0027t happen with the KSP2 release, the only possibilities are that either the devs from KSP 2 were encouraged not to interact with the community because it\u0027s a bigger project so they wanted to keep a tighter control of public contact,  the devs knew what kind of reception it would be getting and voluntarily stayed away, or that the devs didn\u0027t care that much about how the fans saw it. Hard to believe that last one but threw it in to be complete.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of those are a good look vs KSP1.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nagreed, no matter how you put it, they are doing \u003Cstrong\u003Eterrible, \u003C/strong\u003Ei already see where this is going...\n\u003C/p\u003E\n\u003Cp\u003E\nanyhow, it is how it is, and i can only agree with most people on the steam forums, they arent making this up, the game is just a complete mess\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T19:21:54Z\u0022 title=\u002202/28/2023 07:21  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003Eremoved spaces\n\u003C/span\u003E\n"},{"CreatedByName":"radimov","CreatedById":139108,"CreatedDateTime":"2023-02-28T18:12:09Z","Content":"\n\u003Cp\u003E\nI\u0027m happy with the game, I don\u0027t have any complaints I think it will be a great game and I\u0027m very calm about that.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat really bothers me is the silence of the developers, I honestly don\u0027t understand it, from day one they should be solving doubts, helping in the forums to people who have problems with the game, defending their work, I don\u0027t understand that absolutely no one has come out to show their face for their game. I honestly can\u0027t understand it.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2023-02-28T19:02:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224247756\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677607929\u0022 data-ipsquote-userid=\u0022139108\u0022 data-ipsquote-username=\u0022radimov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, radimov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nfrom day one they should be solving doubts\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224247756\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677607929\u0022 data-ipsquote-userid=\u0022139108\u0022 data-ipsquote-username=\u0022radimov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, radimov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhelping in the forums to people who have problems with the game\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224247756\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677607929\u0022 data-ipsquote-userid=\u0022139108\u0022 data-ipsquote-username=\u0022radimov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, radimov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndefending their work\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027d just be childish\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224247756\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677607929\u0022 data-ipsquote-userid=\u0022139108\u0022 data-ipsquote-username=\u0022radimov\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, radimov said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t understand that absolutely no one has come out to show their face for their game\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause fixing the game takes priority over wasting time entering slap fights with unruly forum users.\n\u003C/p\u003E\n\u003Cp\u003E\nPeople have given extremely detailed answers about why all of this would be utterly pointless. All I\u0027ll say is that I don\u0027t see what any of this would solve.\n\u003C/p\u003E\n"},{"CreatedByName":"DadJokeCinema","CreatedById":226590,"CreatedDateTime":"2023-02-28T19:14:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224247800\u0022 data-ipsquote-contentid=\u0022213581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677610968\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027d just be childish\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFull agree\n\u003C/p\u003E\n"}]}