{"TopicId":213863,"ForumId":136,"TopicTitle":"KSP2 and OBS intercaction","CreatedByName":"L3_3x","CreatedById":226948,"CreatedDateTime":"2023-02-28T07:57:05Z","PageNum":1,"Articles":[{"CreatedByName":"L3_3x","CreatedById":226948,"CreatedDateTime":"2023-02-28T07:57:05Z","Content":"\n\u003Cp\u003E\nWhile running KSP2, OBS camera and microphone capture completely glitch out. The camera feed keeps disconnecting and the microphone feed behaves similarly. The encoding version (software/hardware) doesn\u0027t make a difference. This only happens while I\u0027m in the KSP window (as in my mouse is active on it, if i have it open but interacting with my browser on my other screen, OBS works fine). This doesn\u0027t happen with any other game or program. In-game settings don\u0027t have any impact either, tried different quality settings, fullscreen, borderless and even windowed. I would love to stream the game but currently can\u0027t. The actual display/game capture seems to work normally \n\u003C/p\u003E\n\u003Cp\u003E\nSpecs:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EKSP current \u003C/span\u003E\u003Cspan\u003Eversion, Windows 11, AMD Ryzen 5 5600, AMD RX 6700XT, 16GB 3600MHz RAM \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2023-02-28T09:09:18Z","Content":"\n\u003Cp\u003E\nMoved to tech support. \n\u003C/p\u003E\n"},{"CreatedByName":"Fab Space Industries","CreatedById":227304,"CreatedDateTime":"2023-03-04T10:27:44Z","Content":"\n\u003Cp\u003E\nI have this problem, I think. My rig uses a 3080 TI, Ryzen 5 5600  and 32 GB of RAM. The game runs alright, GPU utilisation is between 65 and 90 %, the CPU never goes above 20%. When I stream it with OBS studio, as soon as I switch to KSP2, my camera stutters heavily and the game capture also starts to drop frames. OBS stats say I am losing frames due to rendering lag. Switching between encoding on the CPU or the GPU doesn’t matter. Unplugging my webcam (an Elgato Face Cam) fixes the issue.\n\u003C/p\u003E\n\u003Cp\u003E\nI managed to somehow fix this temporarily by playing around with the game’s graphics settings and OBS, but I have no idea what fixed it. In any case, the problem came back. The way the game doesn’t adhere to the graphics settings I change without a restart and this sometimes fixing this and other issues makes me think this is a bug with the game. I am using the latest drivers from Nvidia, BTW.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-04T11:26:54Z\u0022 title=\u002203/04/2023 11:26  AM\u0022 data-short=\u00221 yr\u0022\u003EMarch 4, 2023\u003C/time\u003E by Fab Space Industries\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HansAcker","CreatedById":195534,"CreatedDateTime":"2023-03-05T11:29:41Z","Content":"\n\u003Cp\u003E\nOBS needs VRAM and a few GPU resources to scale and compose the frames. KSP takes all your VRAM.\u003Cbr\u003E\nYou could try and reduce the amount of resources OBS needs, e.g. set the camera to a lower resolution and don\u0027t transform it with OBS, don\u0027t use fancy masking filters, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://obsproject.com/wiki/GPU-overload-issues\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://obsproject.com/wiki/GPU-overload-issues\u003C/a\u003E\n\u003C/p\u003E\n"}]}