{"TopicId":21462,"ForumId":16,"TopicTitle":"Can\u0026#039;t Build a Ship to Save my Life","CreatedByName":"XNerd_Bomber","CreatedById":54332,"CreatedDateTime":"2012-10-06T05:30:50Z","PageNum":1,"Articles":[{"CreatedByName":"XNerd_Bomber","CreatedById":54332,"CreatedDateTime":"2012-10-06T05:30:50Z","Content":"\n\u003Cp\u003EAfter spending quite a bit of time with the free version of KSP, I finally landed on the moon (using mods) after seeing how awesome this was, I bit, and purchased the full version.\u003C/p\u003E\u003Cp\u003ENo surprise here, however, as it is seriously amazing. However, I cannot build a descent flying ship at all. I understand the asperagus staging system, which works well, but I cannot add onto the ship without actually making it slower/not go as far.\u003C/p\u003E\u003Cp\u003ESo, I now cannot even land on the moon in the game. I really need help, design tips, plans, ideas, anything.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-10-06T06:47:29Z","Content":"\n\u003Cp\u003EFirst of all, welcome to the forums \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince 0.16, there has been some rebalancing of the parts, and this makes some things a bit more difficult than before. However, if you could get to the Mun in the demo, there\u0027s no reason the rocket you used then couldn\u0027t get there anymore (but it may need a few more fuel tanks). If you want to get a three-man rocket there, though, it will require a bit more work, as you have to get used to the size 2 engines as well.\u003C/p\u003E\u003Cp\u003EI\u0027m sure that after some trial and error, you will most probably be able to return to the Mun, and then get to other moons and planets.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"Khiro","CreatedById":52209,"CreatedDateTime":"2012-10-06T08:41:10Z","Content":"\n\u003Cp\u003ELearning how to accomplish such things is definitely part of the fun. I would recommend playing around with the example ships that come with the game. Another thing that I did was to try to develop a Mun lander that held the absolute minimum required to get back from Mun to Kerbin, and then try to design an ascent stage that was the absolute minimum to get that lander to Mun. Knowing where the edges of the design envelope fall will make it easier to then go after your own designs.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-06T12:51:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XNerd_Bomber\u0022 data-cite=\u0022XNerd_Bomber\u0022\u003E\u003Cdiv\u003EHowever, I cannot build a descent flying ship at all. I understand the asperagus staging system, which works well, but I cannot add onto the ship without actually making it slower/not go as far.\u003Cp\u003ESo, I now cannot even land on the moon in the game. I really need help, design tips, plans, ideas, anything.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere are you having trouble descending to? Different planets have different challenges. The Mun is low gravity so you need very little in the way of engines but it\u0027s got some very rolling terrain so you want to make your lander low and wide.\u003C/p\u003E\u003Cp\u003EYou probably don\u0027t want to bother with asparagus when flying a Mun descent given it doesn\u0027t use much fuel as an asparagus vehicle can be more wobbly and harder to launch.\u003C/p\u003E\u003Cp\u003EThere are several things you could be doing wrong and a picture would help identify them but it sounds like your rockets might not be particularly efficient. You want as little weight that isn\u0027t fuel as possible, in particular engines should be placed so they\u0027re usable for the longest possible time (engines not being used are dead weight).\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-10-06T18:58:34Z","Content":"\n\u003Cp\u003ETypically when new players see all the added parts they go a little crazy. They start slapping large numbers of fuel tanks and engines onto a ship, not realizing that a heavy rocket goes nowhere fast. Start small, add as \u003Cem\u003Efew\u003C/em\u003E parts in the form of fuel tanks and engines. And see how high you get. Go for sub orbital flights. Then work your way to orbit. Then to the Mun. Trying to design a ship to go straight to the Mun will just frustrate you. Unless you like math. In which case, download the \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/18230-0-17-Kerbal-Engineer-Redux-v0-4-2-%2817-Sep%29?highlight=kerbal\u002Bengineer\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Engineer Redux\u003C/a\u003E mod here. This will do the math for the Delta-V of your stages as you build them. Read \u003Ca href=\u0022http://kspwiki.nexisonline.net/wiki/A_Guide_to_Basic_Kerbal_Rocket_Design_Through_Rocket_Science\u0022 rel=\u0022external nofollow\u0022\u003E This Wiki \u003C/a\u003Eto get an idea of how much Delta-V you need for orbit, Mun TMI, Landing, and build a delta-v plan. Then build your ship to fit that plan. Profit.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2012-10-06T21:10:33Z","Content":"\n\u003Cp\u003EDon\u0027t worry, I had to decommission a three-Kerbal lander that had proven itself very worthy in 0.16, when the 0.17 update arrived, simply because I just couldn\u0027t get it back to Kerbin no matter what I tried. So, having resorted to an older but equally worthy, 1-Kerbal design, I\u0027m now able to go to Mun, Minmus and back to Kerbin with relative ease, and the very same ship is fully capable of landing on Duna too. It\u0027s a matter of finding a design that works for you, and making it work well. Just do some testing; make some (basic) rockets that can get into orbit, then see if they are able to get to Mun. If they can, build on that design to improve it. I\u0027ve found that more often than not, just one lander design can make it to both Mun and Minmus.\u003C/p\u003E\u003Cp\u003EThe general design that I use for a heavy-lift rocket is something like this:\u003C/p\u003E\u003Cp\u003E[Lander]\u003C/p\u003E\u003Cp\u003E[booster stage]\u003C/p\u003E\u003Cp\u003E[Lift-off stage]\u003C/p\u003E\u003Cp\u003EThe lift-off stage consists of a trio Rockomax engine and fuel tank stacks, as well as 9 large SRBs.\u003C/p\u003E\u003Cp\u003EThe booster stage consists of 3 FL-series engine and fuel tank stacks, and 3 small SRBs.\u003C/p\u003E\u003Cp\u003EI won\u0027t say too much more for my own personal copyright purposes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHopefully this helped just a little bit.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphere","CreatedById":44571,"CreatedDateTime":"2012-10-06T22:32:47Z","Content":"\n\u003Cp\u003EI remember being frustrated building ships at first, except, this was way back in v.10 and I was just trying to get to orbit (it was a lot harder before we had the map view \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E). I found that the most helpful thing for me to do before designing was to look at screenshots other players had posted of their rockets that had made it to orbit or the Mun or wherever. This, at the very least, gave me a sense of the scale of the rocket that would be required, it\u0027s often easy to underestimate how many stages and fuel tanks you are going to need. Also, if my design just wasn\u0027t working and I didn\u0027t know why, I could just make it more and more similar to the other rocket until it worked, discovering what I was doing wrong in the process. Secondly, I highly recommend using the small 1 Kerbal pod for your first trip, and only switching to the 3-kerbal pod with the size 2 parts afterwards (the 1 Kerbal pod of the current version is approximately the same size and weight as the command pod from the demo). Thirdly, try to make sure that each stage is smaller and lighter than the one below it. This is because, due to the oberth effect, the efficiency of the upper stages is much higher than those below them, and also the lower stages have to carry much more weight than those above them.\u003C/p\u003E\u003Cp\u003E\u0026lt;----------------------------------------------------The basic formula I follow for designing a moon rocket is this--------------------------------------------------------------\u0026gt;\u003C/p\u003E\u003Cp\u003EFirst build the lander, it needs only a tank or two of fuel, and, of course, at least one small landing engine, to get to the surface of the Mun and back the Kerbin (if flown right).\u003C/p\u003E\u003Cp\u003EAttach a decoupler to the bottom of the lander, and make the second stage by stacking up 3 or 4 liquid fuel tanks and putting a gimbaling liquid engine on the bottom, then, alt click the top tank (this will make a copy) and leave the copy floating near the rocket. Use the symmetry tool to attach several radial decouplers (2? 3? 4? 6? It\u0027s your choice!) to the side of the stack of tanks in stage two, then grab the copied stack you made earlier and attach it to the decouplers. Route fuel lines from the outer tanks to the inner tank. When the stage is activated, all the engines should fire, but the outer tanks will drain first and be jettisoned, leaving the center one completely full to continue the climb to orbit.\u003C/p\u003E\u003Cp\u003EFor the third stage, attach more stacks of fuel tanks beneath decouplers attached to the base of each engine in the second stage. You can either have the outer tanks on the bottom stage feed fuel to the center one and drop away first (better for efficiency), or keep all the stacks separate and have them burn out and fall away at the same time (better for stability). This stage should get you most of the way through the lower (light blue) layer of the atmosphere.\u003C/p\u003E\u003Cp\u003EFinally place a bunch of solid rocket boosters on radial decouplers around the outside of the third stage and wire them to fire along with the liquid thrusters at launch. For heavy rockets, this is usually the only way to get them off the pad (without wasting a bunch of fuel).\u003C/p\u003E\u003Cp\u003EApply struts liberally throughout.\u003C/p\u003E\u003Cp\u003E\u0026lt;---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\u0026gt;\u003C/p\u003E\u003Cp\u003EIt might take a little tweaking, but some variant of the above design should get you to the Mun.\u003C/p\u003E\u003Cp\u003EDISCLAIMER: I have been building almost exclusively with size 2 tanks for the last few weeks, so, while the general structure of the above rocket should work, the actual number of fuel tanks in each stage may need to be a bit higher if you use small tanks. Once again, look at screenshots of what other people have done.\u003C/p\u003E\u003Cp\u003EHope that helps, good luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-06T22:52:50Z\u0022 title=\u002210/06/2012 10:52  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 6, 2012\u003C/time\u003E by SpaceSphere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-07T00:53:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSphere\u0022 data-cite=\u0022SpaceSphere\u0022\u003E\u003Cdiv\u003EThis, at the very least, gave me a sense of the scale of the rocket that would be required, it\u0027s often easy to underestimate how many stages and fuel tanks you are going to need. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find the problem is frequently the opposite, people overestimate what\u0027s needed. For example on the rocket you described the first two stages should be sufficient to make the trip with a few minor tweaks (if flown right) and the third and fourth stages will just provide more margin for error.\u003C/p\u003E\u003Cp\u003EI\u0027ve done a quick build of a rocket very similar to the first two stages you described that should be capable of a Mun landing and return \u0027if flown right\u0027. I haven\u0027t got the time to test it right now but I\u0027m pretty confident and I\u0027ll check it tomorrow to make sure.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Kg5DY.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Kg5DYl.jpg\u0022 alt=\u0022Kg5DYl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E[ATTACH]34381[/ATTACH]\u003C/p\u003E\u003Cp\u003EIt\u0027s also an example of how you would use asparagus staging to increase range. The fuel lines are just slapped down so they make the interface a bit messy (draining both ends of a stack at once) but the difference with and without them should be noticeable.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphere","CreatedById":44571,"CreatedDateTime":"2012-10-07T05:55:07Z","Content":"\n\u003Cp\u003ECool, I guess I\u0027ve been working so hard on interplanetary missions lately that I forgot what Moon landings were like \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"}]}