{"TopicId":21466,"ForumId":34,"TopicTitle":"[1.6.1] Tiny Parts and Other Useless Junk","CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2012-10-06T08:42:14Z","PageNum":3,"Articles":[{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-16T23:10:30Z","Content":"\n\u003Cp\u003EFor those interested... \u003C/p\u003E\u003Cp\u003ENUKEMod is working fine in 21.1.\u003C/p\u003E\u003Cp\u003EAs far as what I am using it for: With TT modular wheels NUKEMod is the best parts scaled for stable driving rovers I have found. Here is the large science truck with crane. The 1/2 meter parts form the basic structure every thing else attaches to. Gives me 2 meter wheel base for really good control... Max turning speed I have managed on Mun is 28 m/s while in a flat out run I gunned it up 48 m/s before terrain made it uncontrollable.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DCfAwM2.jpg\u0022 alt=\u0022DCfAwM2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is my Olympus station with two smaller rover, 1.5 meters sacross a a fair bit smaller, these utility rovers are still amazingly stable. I got one over 60 m/s in a flat out run, tho turning is a little more chancey.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R5EDTAD.png\u0022 alt=\u0022R5EDTAD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DCfAwM2.jpg\u0022 alt=\u0022DCfAwM2.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-08-17T06:00:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RychschaX\u0022 data-cite=\u0022RychschaX\u0022\u003E\u003Cdiv\u003ESo is it just me, or are the MPD engines getting nowhere near the mileage (so to speak) they used to? I can\u0027t find anything in the config files that would explain it, but I used to get \u0026gt;10km/s of vacuum delta V on my surveyor probes, and now I am lucky if i get 4km/s. all evidence in the config files would suggest that my fuel tanks should weigh even less now with the switch to xenon (.0005 density for arrrghon versus .0001 for xenon), so I would sorta expect to be getting slightly \u003Cem\u003Emore\u003C/em\u003E delta V now. Any idea why, or is the reason totally obvious and I am just missing it?\u003Cp\u003Ethough now that I think of it...if the tank stores a similar number of units of xenon, and the engines produce the same thrust as before, maybe it would have to consume more xenon to pruduce the same thrust, thanks to xenon having only 1/5 the density of arrrghon...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei think arrrghon had the same density as xenon, but i think squad nerfed xenon shortly after i converted over to it. i remember my big keg o arrrghon used to be about 10k kilograms or whatever units ksp uses, now its nowhere near that heavy. it also seems they are using a lot more power as well. i may need to tweak the engines somewhat in a later release.\u003C/p\u003E\n"},{"CreatedByName":"Fooblack","CreatedById":81138,"CreatedDateTime":"2013-09-02T09:26:59Z","Content":"\n\u003Cp\u003EAttempting to install this with KSP mod manager causes it to crash. Anyone else have that problem?\u003C/p\u003E\n"},{"CreatedByName":"WhatsThisButtonDo","CreatedById":60877,"CreatedDateTime":"2013-09-02T11:12:55Z","Content":"\n\u003Cp\u003ENuke, I\u0027ve tried re-texturing the png files for the 2 liquid fuel tanks into something that will fit in with the stock look, like an off-white, but can\u0027t figure out how to do it with Microsoft Paint. Could you or someone else do it for me or give me some suggestions how to do it? Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-09-02T11:24:09Z","Content":"\n\u003Cp\u003EI don\u0027t think mod manager uses the GameData system, install it manually.\u003C/p\u003E\n"},{"CreatedByName":"Fooblack","CreatedById":81138,"CreatedDateTime":"2013-10-30T07:55:29Z","Content":"\n\u003Cp\u003EKSPMM does use gamedata, just for some reason doesn\u0027t like this particular mod. It\u0027s strange. Installs fine when I manually paste the folder into gamedata; and it has the same folder tree as other mods that install perfectly with KSPMM. A corner case for KSPMM to look at, I think, not an issue with this mod. I submitted a bug report to their thread.\u003C/p\u003E\u003Cp\u003ELots of neat little parts. I especially like the downwards-facing jet engines, I make little quadrotors out of them sometimes- I reduce the amount of thrust they produce for this, for better control. Also, the 1-3 lateral coupler is fantastic for space planes using the 1 jet 2 rocket motor configuration that\u0027s popular on small SSTOs. I also like your textures.\u003C/p\u003E\u003Cp\u003ENoticed a little bug- it\u0027s my understanding based on the ratio to your liquid fuel tank and your description, that the liquid oxygen tank is meant to be an oxidizer tank? If so, it\u0027s filled with liquid fuel by mistake.\u003C/p\u003E\n"},{"CreatedByName":"ultrasquid","CreatedById":10944,"CreatedDateTime":"2013-11-02T04:29:17Z","Content":"\n\u003Cp\u003EI hope about two months of inactivity isn\u0027t too much to alert the necro-cops. KSP could really use small parts like these updated for the 0.22 tech tree/career mode. They fill a gaping hole in the existing collection of parts. @Nuke: I hope you\u0027ll be able to get back to them soon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-11-02T04:39:31Z","Content":"\n\u003Cp\u003Eim mostly just havent been in a modding (or any other hobby) mood in the last several months. you can blame various battletech games and some computer problems. im a natural procrastinator. \u003C/p\u003E\u003Cp\u003Ei dont consider the mod dead, just in hibernation.\u003C/p\u003E\n"},{"CreatedByName":"ultrasquid","CreatedById":10944,"CreatedDateTime":"2013-11-02T04:42:36Z","Content":"\n\u003Cp\u003ENo worries, take your time. Just trying to say that your work is appreciated.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-11-12T10:45:03Z","Content":"\n\u003Cp\u003Ehave we tested theparts in .22 sandbox? IF they work there maybe I can do some programming to get it folded into the sci-tree for the interim.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2013-11-12T12:57:52Z","Content":"\n\u003Cp\u003EThe parts worked fine in .21 and .22 didn\u0027t change much. If the license allows for it (or Nuke gives his blessing) then an update is just a matter of figuring out where to place the parts in the tree and adding two lines to each config. The half meter pod still uses the old SAS I think too, so that would need a quick update as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T12:59:51Z\u0022 title=\u002211/12/2013 12:59  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by Bloodbunny\u003C/strong\u003E\n\u003Cbr\u003Egrammar error :O\n\u003C/span\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-01-15T04:07:43Z","Content":"\n\u003Cp\u003ENuke? Are you still with us on this mod?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-16T22:12:29Z","Content":"\n\u003Cp\u003Ei was making some new parts, but progress has been slow. it takes me forever to get anything done.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-01-18T02:10:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ei was making some new parts, but progress has been slow. it takes me forever to get anything done.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlright- I just wanted to know because I would like to play with the current parts- updated for the tech tree and all. I could update them if you like.\u003C/p\u003E\u003Cp\u003EMaybe with modulemanager? Just stick them into the precision-engineering segment of the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-19T02:17:05Z","Content":"\n\u003Cp\u003Eid have nothing against a 3rd party patch. but at some point im going to release a new version. the todo list keeps getting shorter.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-01-19T02:36:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Eid have nothing against a 3rd party patch. but at some point im going to release a new version. the todo list keeps getting shorter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo- what is on the to do list?\u003C/p\u003E\n"},{"CreatedByName":"MonkeyLunch","CreatedById":57799,"CreatedDateTime":"2014-02-09T20:49:24Z","Content":"\n\u003Cp\u003ELooking forward to your next release. I use your parts a lot. Excellent stuff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-19T09:50:42Z","Content":"\n\u003Cp\u003Ea smallish, hardly useful update. as you know, i am incredibly lazy. but after suffering a string of horrible failures and a few marginal successes with my electronics hobby and growing weary of electron hearding, i have decided put some time into the mod instead. i want to aim for a post 0.24 update (so i can support any new features that come with it). \u003C/p\u003E\u003Cp\u003Ethe next version will have a a few new parts. they are all in game and being tested/balenced, but they still need textures (this is the major item on the todo list). there are also other parts in the pipeline in lesser states of completeness, some of those may get worked in if im in the mood (or any that are in but which ive forgotten about). heres the new stuff:\u003C/p\u003E\u003Cp\u003E -dual mode arcjet engine, which runs on monoprop/monoprop-charge. it can act in chemical or electrical modes. chem mode gives more thrust, electric mode gives more isp.\u003C/p\u003E\u003Cp\u003E -electric ducted fan, nifty for flying around on kerbin/eve/jool/laythe/duna.\u003C/p\u003E\u003Cp\u003E -set of small(ish) wings, including but not limited to: glider wing, delta wing (with internal lf tankage), canard, tail fin, aerodynamic structural pylon, solar wings (with built in solar panels and batteries).\u003C/p\u003E\u003Cp\u003Enew particle effects. the mpd engines and arcjet (and i want to do the hall thrusters if i figure out how) now have exhaust effects.\u003C/p\u003E\u003Cp\u003Esounds work now and there are more of them (i apologize in advance for my horrible sound engineering skills).\u003C/p\u003E\u003Cp\u003Emost of the duplicate textures have been eliminated, that was a major memory hole. \u003C/p\u003E\u003Cp\u003Etech tree support is in, but is currently untested.\u003C/p\u003E\u003Cp\u003Eall part cfgs now use MODEL{} and NODE{} instead of the old skool way.\u003C/p\u003E\u003Cp\u003Eexperimental: ducted fan and vtol engine now have working rotors (powered by firespitter).\u003C/p\u003E\u003Cp\u003Ereworked mpd thrusters, should now work more sanely (but still power hungry).\u003C/p\u003E\u003Cp\u003Ereplaced bleed air and bleed gas with bleed system pressure, bleed thrusters are now interchangeable.\u003C/p\u003E\u003Cp\u003Eexperimental: intakes may accept atmosphere with or without oxygen and produce appropriate resources (though i need to find a better way to do this).\u003C/p\u003E\u003Cp\u003Evarious balance tweaks.\u003C/p\u003E\u003Cp\u003Epretty much enough stuff to justify an update. the only real hold up is some texture work i absolutely need to do, some bugs i need to fix, and support new 0.24 features when they come out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-19T09:59:13Z\u0022 title=\u002203/19/2014 09:59  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 19, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-03-19T10:27:18Z","Content":"\n\u003Cp\u003ENUKE! \u003C/p\u003E\u003Cp\u003EWe missed you man!\u003C/p\u003E\n"},{"CreatedByName":"webkilla","CreatedById":71356,"CreatedDateTime":"2014-03-19T10:42:27Z","Content":"\n\u003Cp\u003EMy 2 cents:\u003C/p\u003E\u003Cp\u003E1) \u0022death cult of jeb\u0022 as the manufacturer. Ya, that makes sense \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E2) tons of weird adatpers for really outlandish designs. Love it.\u003C/p\u003E\u003Cp\u003E - there\u0027s a 1.25m to 0.625x4 quad adapter which allows for far more creative use of small engines like the 48-7S\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i120.photobucket.com/albums/o194/alemly/KerbalStuff/NukeMod2.png~original\u0022 alt=\u0022NukeMod2.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E - there\u0027s a monstrous 3.75m to 1.25x19 adapter (with about 1Ã‚Â½ times as much inbuilt fuel storage as a jumbo tank) - \u003Cstrong\u003Ethat\u0027s 19 1.25m attachment points. That\u0027s nuts! I love it!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E(I\u0027ve used parts from KW rocketry to work with this mod\u0027s 3.75m parts)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i120.photobucket.com/albums/o194/alemly/KerbalStuff/NukeMod1.png~original\u0022 alt=\u0022NukeMod1.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E - a wide assortment of 1.25 multi-adapters. 1 to 3, 1 to 3 but in 3 in a row (also for 1.25m), 1 to 2... plus some new xenon engines that are far more powerful than the stock one, but drain so much electricity its insane\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i120.photobucket.com/albums/o194/alemly/KerbalStuff/NukeMod4.png~original\u0022 alt=\u0022NukeMod4.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E3) the aesthetics appear very black and with polished copper, which looks kinda orange. Very stark contrast.\u003C/p\u003E\u003Cp\u003E - IMHO it doesn\u0027t mesh that well with the usual KSP metal and white look. I would love if these parts looked more like normal KSP parts, but that\u0027s the mod-maker\u0027s choice\u003C/p\u003E\u003Cp\u003E4) there\u0027s also some stuff for VTOL spaceplanes and aircraft, but I didn\u0027t look into any of that\u003C/p\u003E\u003Cp\u003EOverall, then at least some of the parts have some very interesting use - the rest looks cool.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-19T12:39:22Z","Content":"\n\u003Cp\u003Eive used the \u0022steampunk from hell\u0022 look on a lot of earlier parts, lots of graphite, tungsten and copper colors in there. i rather like it, but im trying to move away from it with newer parts. then some of the newer aircraft parts kinda use an anodized aluminum and glassy black scheme. i will probibly apply that to the edf for sake of color continuity, so it matches the engine pylons and intakes. the wings might also get the anodized aluminum color, but without the black. the girders i wanted to keep simple with a heavy duty looking connecting ring, and then an aluminum truss.\u003C/p\u003E\u003Cp\u003Eas for that big 19-coupler, which is the first part i got into ksp (back around 0.11 or 0.13, i dont remember). i just wanted to do something insane. i probibly slapped it together in 3dsmax over the course of a couple hours, texture was based off of some other textures i made for another mod for another game. since at the time you could just dump a dae in the parts folder, and since i was already setup for that, i just had to do it. i wanted something to go with the 3m tanks that were available at the time (the reason this is called the half meter pack and not the .625 meter pack, is because it predates the changes in scale, and im very stubborn and dont like change). im thinking about nerfing it, making it much lighter but eliminating its fuel. i noticed it kinda locks you into using chemical or nuclear engines, and sometimes you just want a piece of structure, a job for which it is just too heavy. il think about it. \u003C/p\u003E\u003Cp\u003Eas for the future, i want to do some smaller parts, to match those tiny stock girder sections, ibeams, etc. with some lightweight hubs and adapters for better integrating them into larger sizes. will also include engines similar to the ant in form factor, though in arcjet and mpd varieties. this should make really small probes more diverse. i want to have more power components, lights, apus, asas, solar, wheels, reactors, etc. i have a couple other pod ideas i want to try out. there is also some stuff on the other side of the spectrum, i have an 11 meter centrifuge in the works which matches the 3.75 meter profile, im also working on 3.75 meter polywell type fusion reactor, and appropriate tankage. i have an idea for a multipurpose hanger based on extraplanetary launchpads, to let you construct and then recycle mission specific space craft onboard. my entusiasim for ksp modding varies wildly from day to day but i hate to have half-finished models laying around.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-19T07:20:00Z","Content":"\n\u003Cp\u003Ea little teaser of things to come:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s213.photobucket.com/user/Emperor_of_Nihil/media/Nukemod%20For%20KSP/tinygirderconstructionkit_zps99764625.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i213.photobucket.com/albums/cc103/Emperor_of_Nihil/Nukemod%20For%20KSP/tinygirderconstructionkit_zps99764625.jpg\u0022 alt=\u0022tinygirderconstructionkit_zps99764625.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Emicro girder construction set. should make probe builders happy.\u003C/p\u003E\u003Cp\u003E6 sizes of girders\u003C/p\u003E\u003Cp\u003E3 kinds of hubs\u003C/p\u003E\u003Cp\u003E2 elbow sizes\u003C/p\u003E\u003Cp\u003Emicro docking port\u003C/p\u003E\u003Cp\u003Ehalf meter adapter (all parts are compatible with the existing half meter girder kit btw)\u003C/p\u003E\u003Cp\u003Ehub tank and truss tank\u003C/p\u003E\u003Cp\u003Emicro engines and other goodies to come.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-19T07:24:20Z\u0022 title=\u002204/19/2014 07:24  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 19, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-04-19T07:47:16Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyes yes yes yes!\u003C/p\u003E\n"},{"CreatedByName":"Honeybadga","CreatedById":64977,"CreatedDateTime":"2014-04-19T08:29:14Z","Content":"\n\u003Cp\u003ENice! Moar girders!\u003C/p\u003E\n"},{"CreatedByName":"MonkeyLunch","CreatedById":57799,"CreatedDateTime":"2014-04-19T08:40:53Z","Content":"\n\u003Cp\u003EInteresting and useful girder designs are something that\u0027s needed, great stuff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}