{"TopicId":21473,"ForumId":16,"TopicTitle":"How to put your rocket in the same orbit as another?","CreatedByName":"gaktkr","CreatedById":14948,"CreatedDateTime":"2012-10-06T10:42:41Z","PageNum":1,"Articles":[{"CreatedByName":"gaktkr","CreatedById":14948,"CreatedDateTime":"2012-10-06T10:42:41Z","Content":"\n\u003Cp\u003EHi I\u0027m just wondering how to put a rocket in the same orbit as another one of my rockets or near. I did try but it went horribly wrong and I ran out of fuel. So if anyone could tell me how I get a rocket into the same orbit as another it would be greatly helpful, and I\u0027m sure it will help others too.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-06T12:54:29Z","Content":"\n\u003Cp\u003EThe same orbit just requires you to be at the same height (and eccentricity/inclination of course) the same point in the orbit (i.e. a rendezvous) is trickier but I don\u0027t have any experience of that myself.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-10-06T16:34:04Z","Content":"\n\u003Cp\u003EAre you trying to get the two ships to meet? What kind of trouble were you having? \u003C/p\u003E\u003Cp\u003EIf you\u0027re orbit is not parallel, have your ship turn 90 degrees in the direction of the other orbit and burn the engines, watching on the map view as the orbits get closer to parallel. (It\u0027s more efficient to stay 90 degrees from prograde during the burn, but kind of tricky to keep turning the ship at the right rate.) Once the orbits are lined up on the same plane, speed up (burn toward the prograde marker) on the part of your orbit where you\u0027re below the other orbit, and slow down (burn toward retrograde on the part of your orbit where you\u0027re above the other orbit,) again watching the map view to see how this affects your path and brings it closer to the target orbit. This is NOT the most efficient way to do it, but it is a good way to get a feel for how orbits work. Don\u0027t be a hurry, don\u0027t make big dramatic burns, and just keep tinkering until you get an intuitive feel for what\u0027s going on. \u003C/p\u003E\u003Cp\u003ETo actually meet the other ship, once you have the orbits matching shape, the next part seems backwards. If you want to catch up with a ship ahead of you, slow down. This will cause your orbit to drop below that of the target, where the slight fall will speed you up, and you will begin to overtake the targer ship. If you want the other ship to catch up with you, speed up. The slight climb will slow you down as gravity fights you, allowing the other ship to catch up. Again, keep the changes small or things will rapidly get out of hand. Once you get to within around 20km, you can begin to steer directly toward the target ship without messing up your orbit too badly, as long as you don\u0027t go too fast.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2012-10-06T17:19:05Z","Content":"\n\u003Cp\u003EThe table Kosmo-not posted here - \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/8915-Orbital-Rendezvous-Made-Easy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/8915-Orbital-Rendezvous-Made-Easy\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eis by far the easiest way to perform a rendezvous I have seen.\u003C/p\u003E\u003Cp\u003EYou send your first ship into a circular 90 degree orbit at a certain altitude (say 150 km), then you launch another ship into another circular 90 degree orbit with a lower altidude (say 110 km), and then you look up the altitudes on the table (altitudes in the table are shown from the center of kerbin so it is your altitude \u002B 600 km) and see the number they cross at - in this case you would get 99.4. You take control of the ship with the lower altitude, wait until you can see the other ship in front and above you, and at the moment the distance from that ship is 99.4km you burn to increase your apoapsis to 150 km. This will bring you to under 1 km from the other ship. Then you circularize the orbit and slowly approach the other ship using RCS...\u003C/p\u003E\n"}]}