{"TopicId":214938,"ForumId":129,"TopicTitle":"[IDEA] KSP 1 Craft File Converter","CreatedByName":"Johnster_Space_Program","CreatedById":187334,"CreatedDateTime":"2023-03-12T13:55:23Z","PageNum":1,"Articles":[{"CreatedByName":"Johnster_Space_Program","CreatedById":187334,"CreatedDateTime":"2023-03-12T13:55:23Z","Content":"\n\u003Cp\u003E\nHello everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nI think it would be a good idea if someone could create a mod (or maybe a separate tool instead) that lets you convert a KSP 1 craft file into a KSP 2 workspace file. However, it would only let you convert a craft if all of its parts had an equivalent in KSP 2. Also, when converting a KSP 1 craft to KSP 2, the tool should be able to let you set the workspace name and description for the craft when setting it up to be converted. And maybe the tool/mod would let you convert KSP 2 workspace files to KSP 1 craft files as well. What do you think? I think something like this would save a lot of time for someone trying to recreate a KSP 1 craft in KSP 2, as you could just convert the original craft instead. Especially if it had a high part count...\n\u003C/p\u003E\n"},{"CreatedByName":"Elox","CreatedById":227245,"CreatedDateTime":"2023-03-12T17:10:56Z","Content":"\n\u003Cp\u003E\nI think is a good idea, not sure how hard would be\n\u003C/p\u003E\n"},{"CreatedByName":"Johnster_Space_Program","CreatedById":187334,"CreatedDateTime":"2023-03-15T17:09:52Z","Content":"\n\u003Cp\u003E\nI decided to create some concept art for what the UI of this mod could look like in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. My idea for the process of how this mod could work is below.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 1: After clicking on the icon for the mod in the app bar, a window would appear that lets you select a craft file from KSP 1. After clicking on \u0022Select...\u0022, an explorer window would pop up asking you to specify where the .craft file you want to convert is located. After selecting one, the window would change to how it appears in Step 2.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SznO2L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://img.itch.zone/aW1hZ2UvNjY1MDAwLzExNTkxMjQzLnBuZw==/original/SznO2L.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStep 2. After selecting a craft file, the craft file section of the UI would change to show the name of your craft file. Under that, a \u0022CONVERT!!!\u0022 button would appear which when pressed would begin converting your craft file and proceed to Step 3. The minus button next to the craft file\u0027s name could be pressed to remove the currently selected craft and revert the UI back to how it looks in Step 1, allowing you to select a different craft file if you wanted to do so.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v6vDex.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://img.itch.zone/aW1hZ2UvNjY1MDAwLzExNTkxMjQ0LnBuZw==/original/v6vDex.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStep 3. The window would change to show that your craft conversion is now in progress. If the conversion was successful, the window would change to how it appears in Step 4. If the conversion failed (for example, if your craft contained a part that isn\u0027t in KSP 2), you would get a conversion failed message and then the window would revert back to how it appears in Step 1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022owFg6o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://img.itch.zone/aW1hZ2UvNjY1MDAwLzExNTkxMjQyLnBuZw==/original/owFg6o.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStep 4.  After a successful craft conversion, some input boxes would appear allowing you to put in the name of your vehicle, the name of the workspace, and a description for that workspace. The converter would try to automatically pull the name and description of your vehicle from it\u0027s KSP 1 .craft file and enter that name and description in for the converted vehicle\u0027s workspace and vehicle names, as well as the workspace description. Workspace and vehicle names would be required to continue, but the workspace description would be optional. Pressing the \u0022SAVE CRAFT\u0022 button would save your craft and create an entry in the location where you can load workspaces from in KSP 2, while pressing the \u0022SAVE AND LOAD CRAFT\u0022 button would do the same thing as well as load the converted craft in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E as shown in Step 5.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022f.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://img.itch.zone/aW1hZ2UvNjY1MDAwLzExNTkxMjQxLnBuZw==/original/4MCu/f.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStep 5. The craft converted from KSP 1 loaded in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, with the craft file converter window ready to convert another craft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ref.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://img.itch.zone/aW1hZ2UvNjY1MDAwLzExNTkxMjQwLnBuZw==/original/UO/Ref.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWell, that\u0027s my concept for this mod idea. I may also create some concept art for the other part of the converter I mentioned in the original post, which you can view in the quote below.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257624\u0022 data-ipsquote-contentid=\u0022214938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678629323\u0022 data-ipsquote-userid=\u0022187334\u0022 data-ipsquote-username=\u0022Johnster_Space_Program\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/12/2023 at 9:55 AM, Johnster_Space_Program said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd maybe the tool/mod would let you convert KSP 2 workspace files to KSP 1 craft files as well.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs I currently have no modding experience with KSP 2, hopefully someone else will be able to turn this mod idea into a reality, as I\u0027m sure a lot of KSP 1 players who have just started playing KSP 2 would really enjoy a helpful mod like this to speed up their KSP 1 craft recreation times.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2023-03-21T12:05:46Z","Content":"\n\u003Cp\u003E\nKSP 1 and 2 aren’t the same game and trying to get a craft file from the former to work in the latter would probably take a lot of work: wings are completely different, parts have different names, shapes and sizes not to mention mass and engine performance, the fuels are different and in different ratios, to name just a few of the things to consider even before you think about the parts that don’t exist in one game or the other (e.g. the DLC parts) or from mods.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of that assumes that the files are structured in the same way using the same parameters, which is a big assumption that could completely scupper the whole idea if it’s not true. It would probably be easier to just manually rebuild each design in KSP2 unless it’s a really intricate design or replica.\n\u003C/p\u003E\n"}]}