{"TopicId":215067,"ForumId":196,"TopicTitle":"Orbit Line issues, VAB issues, coupling issues","CreatedByName":"onionpeddler","CreatedById":227822,"CreatedDateTime":"2023-03-15T07:44:49Z","PageNum":1,"Articles":[{"CreatedByName":"onionpeddler","CreatedById":227822,"CreatedDateTime":"2023-03-15T07:44:49Z","Content":"\n\u003Cp\u003E\n- After decoupling stage, sometimes orbit lines disappear on map. Have to go into json save file and change vesselstate situation from \u0022Landed\u0022 to \u0022Orbitting\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n- When I have a space station in orbit, any launch after the first vehicle gets \u0026lt;10 FPS. seems to be limit on how many parts are in the world causing all launches after first launch to be significantly laggy\n\u003C/p\u003E\n\u003Cp\u003E\n- kraken\n\u003C/p\u003E\n\u003Cp\u003E\n- coupling fuel crossfeed not working as expected\n\u003C/p\u003E\n\u003Cp\u003E\n- vessel names dont save when you change them in tracking center\n\u003C/p\u003E\n\u003Cp\u003E\n- \u0022destroy debris\u0022 option in tracking center doesnt ever actually delete debris object. Need to manually do it in map by clicking on each object. Sometimes impossible if the debris orbit is exactly the same as ships orbit because you can never click on debris  to destroy, ship is always in the way\n\u003C/p\u003E\n\u003Cp\u003E\n- sometimes loading game save and get stuck at \u0022Never leaving Eve - Creating vehicle\u0022. Need to quit app and restart\n\u003C/p\u003E\n\u003Cp\u003E\n- In \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E,  using shift doesnt always open extra details. Quite frustrating because you cant compare engine stats or anything. Still need to have wiki opened on another tab\n\u003C/p\u003E\n\u003Cp\u003E\n- In \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, some part descriptions are cut off and there is no shift option to show additional details or see the entire text\n\u003C/p\u003E\n\u003Cp\u003E\n- Could be user error but I couldnt get to control any remote controlled probe. I tried every combination of communication devices and nothing gave me commnet connection\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally game is fine but the FPS issues make it unplayable sometimes. I have a watercooled pc with ryzen 5600x, 3080ti, 64gb ram, and have settings set at high but still get bad FPS when have multiple ships in orbit.\n\u003C/p\u003E\n"}]}