{"TopicId":215772,"ForumId":120,"TopicTitle":"Switching engine mount size like in Making History","CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-03-23T05:51:35Z","PageNum":1,"Articles":[{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-03-23T05:51:35Z","Content":"\n\u003Cp\u003E\nReason for removing twin-boar and mammoth engines was that you can do  the same by attachment on engine plates. But in KSP2 it\u0027s so difficult to make rocket with several medium/big engines in most cases, because engines have big mount, which often goes over the edge of engine plate. Only vector engine suits well for engine plate way of building rockets, this is unfair. I suggest to make different variants of mount like in making history, it will make engine placement more comfortable, even if their nozzle is bigger than mount like KE-1 in last example\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IMG20230323080021.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002248.43\u0022 height=\u0022523\u0022 width=\u00221080\u0022 src=\u0022https://u.cubeupload.com/Vortygont/IMG20230323080021.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI think it\u0027s not so big problem, just reworking of model. It will make creation of craft more comfortable and some engines and plates more useful. It will be more convenient to balance \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E by changing engines configuration on different stages, you could use available on current stage of career/progression mode engines more creatively, and also it will be good feature to make accurate replica\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Tazooka","CreatedById":226666,"CreatedDateTime":"2023-03-23T14:47:01Z","Content":"\n\u003Cp\u003E\nI miss this feature\n\u003C/p\u003E\n"},{"CreatedByName":"Wetzelrad","CreatedById":228424,"CreatedDateTime":"2023-04-07T06:26:30Z","Content":"\n\u003Cp\u003E\nI\u0027m having the same problem. When I go to build at the XL size, I want something that can put out more thrust than the Mammoth, but most of the competitive engines are simply too wide to use in symmetry. If I try to fit even three Mainsails on the XL engine plate, they either intersect at the nozzles, or they intersect with the plate itself. \u003Cimg alt=\u0022Screenshot-from-2023-04-06-20-57-44.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022677\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/yfDkfwJ/Screenshot-from-2023-04-06-20-57-44.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFlipping the engine plate upsidedown gives room for 3x or 4x Mainsails without looking too bad. Mostly I\u0027m stuck using Vectors, which look incredibly small compared to the XL tanks. I think we either need narrow versions of existing engines or to wait for new engines.\n\u003C/p\u003E\n"}]}