{"TopicId":215932,"ForumId":197,"TopicTitle":"KSP 2 Random Crashing, can\u0026#039;t load any game without putting low graphics","CreatedByName":"Kayou","CreatedById":228263,"CreatedDateTime":"2023-03-26T10:57:21Z","PageNum":1,"Articles":[{"CreatedByName":"Kayou","CreatedById":228263,"CreatedDateTime":"2023-03-26T10:57:21Z","Content":"\n\u003Cp\u003E\nHello there!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve bought KSP 2 day one and was verry happy to test the game, so far I like it (even if a lot of things aren\u0027t there or not working as expected, but you know it\u0027s an Early Access).\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, my PC specs \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERyzen 5600X\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERX 7900XTX\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E32 GB DDR4 3200MHz\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n500Go SSD NVMe\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see my components are above the minimum requirement so I don\u0027t think my problem comes from here. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat is currently happening is pretty annoying however.\n\u003C/p\u003E\n\u003Cp\u003E\nSince launch, I can barely play the game on my main computer since it either crash when I load a game (Pumping sim Once) which I found a temporary fix for it (Deleting DirectX cache and playing in ultra low quality). The second crash I have is freezing at Setup OAB. I can\u0027t really tell the end of the sentence since the game just closes by itself really quickly.\n\u003C/p\u003E\n\u003Cp\u003E\nSadly, I don\u0027t really have any fix fir this second issue, sometimes it happens, and sometimes it doesn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat is interesting though, is the crash log. It seems to be an memory access violation error (I will provide every crash logs/dump in a zip file so you can look at them). So I did a memtest for 8 hours, no errors, my memory is fine. I also did a S.M.A.R.T test on my drive, nothing wrong there.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI bought the game directly on the Priviate Division website, so no Steam launcher or anything, the game is portable. I also am launching it as an administrator.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne more issue is, when the game is finally launching, I can play it normally for a few minutes until it crashes. It\u0027s a random crash that appears randomly, there are no reasons for it (I tried being idle in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, crash. Building a rocket, crash. Orbiting Kerbin, crash etc). Which is really annoying. \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, when the game is running fine, it is very smooth and I don\u0027t have any frame drops. \n\u003C/p\u003E\n\u003Cp\u003E\nI also have one issue with the games graphics overall, the volumetrics clouds are very buggy and blurry which causes everything that looks into it to be very blurry (the craft edges etc), even from space. I also find the parts pretty blurry overall and pixellated, as if the Anti Aliasing wasn\u0027t working at all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne more thing though, is that I have a laptop running on a RTX 3080, and i don\u0027t have any issue at all, the game is running fine, no crash at all, clouds are fine.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the problem is coming from the AMD drivers (updated to 23.3.2 yesterday, still have issues) but I might be wrong. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, I hope this topic could help you to fix these issue for us, AMD users and maybe one day we will be able to play the game fine. I\u0027m gonna stick playing on my laptop since it doesn\u0027t have any issue for now.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance !\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMat\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLink to the crash files : \u003Ca href=\u0022https://mega.nz/file/BwpixZwa#JDsoi-i4w9K_Hkbu5gm3FMu0nt7zFjjTqDxWvVAncds\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://mega.nz/file/BwpixZwa#JDsoi-i4w9K_Hkbu5gm3FMu0nt7zFjjTqDxWvVAncds\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kayou","CreatedById":228263,"CreatedDateTime":"2023-04-17T07:01:33Z","Content":"\n\u003Cp\u003E\nHi again,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI found the fix for my problem, I tried everything, and the only fix that finally worked for me was to update my motherboard\u0027s BIOS.\n\u003C/p\u003E\n\u003Cp\u003E\nFeel free to tell me if it worked for you too, I can finally play the game without any issue now \u003Cspan\u003E:)\u003C/span\u003E\n\u003C/p\u003E\n"}]}