{"TopicId":215969,"ForumId":120,"TopicTitle":"EVA Construction - Am I The Only Player Who Misses this feature?","CreatedByName":"Buzz313th","CreatedById":149043,"CreatedDateTime":"2023-03-27T04:09:22Z","PageNum":1,"Articles":[{"CreatedByName":"Buzz313th","CreatedById":149043,"CreatedDateTime":"2023-03-27T04:09:22Z","Content":"\n\u003Cp\u003E\nI know IG has a ton of fixes they need to prioritize before they start adding back original KSP1 features, but I haven\u0027t seen anyone mention they miss EVA Construction.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI for one, miss that feature and I hope it gets included in the future.\n\u003C/p\u003E\n"},{"CreatedByName":"Little 908","CreatedById":228185,"CreatedDateTime":"2023-03-27T04:12:19Z","Content":"\n\u003Cp\u003E\nNope, I loved having the ability to repair and  bring up storage containers. But there is a slight, very slight possibility this might come with the science update,  since evas are a big part of gaining science.\n\u003C/p\u003E\n"},{"CreatedByName":"Buzz313th","CreatedById":149043,"CreatedDateTime":"2023-03-27T04:22:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224266035\u0022 data-ipsquote-contentid=\u0022215969\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221679890339\u0022 data-ipsquote-userid=\u0022228185\u0022 data-ipsquote-username=\u0022Little 908\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Little 908 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNope, I loved having the ability to repair and  bring up storage containers. But there is a slight, very slight possibility this might come with the science update,  since evas are a big part of gaining science.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCrossing my fingers...\n\u003C/p\u003E\n\u003Cp\u003E\nPlaying KSP1 in the later stages of a career was often centered around engineer Kerbals modifying and building craft on the surface of a body and or an orbiting station.  This was a central activity to help keep space program costs down for me.\n\u003C/p\u003E\n\u003Cp\u003E\nI miss career and science.  \n\u003C/p\u003E\n"},{"CreatedByName":"Xheotris","CreatedById":186363,"CreatedDateTime":"2023-03-27T04:58:52Z","Content":"\n\u003Cp\u003E\nI actually don\u0027t. It was super fiddly. What I\u0027m hoping for is orbital shipyards.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-03-27T09:30:18Z","Content":"\n\u003Cp\u003E\nI lived for nearly a decade without EVA construction. Yes, removing parts to get more \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E out of the ship was convenient but eh, I can deal without it.\n\u003C/p\u003E\n"},{"CreatedByName":"stephensmat","CreatedById":200752,"CreatedDateTime":"2023-03-29T10:31:26Z","Content":"\n\u003Cp\u003E\nEVA Construction was a big help, especially for my interplanetary craft. I was able to take up science experiments, add docking ports, increase power generation... Essentially, it was a way to \u0027revert to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u0027 without having to revert anything.\n\u003C/p\u003E\n\u003Cp\u003E\nIs it essential? No. But I look forward to getting it back.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I look forward to the Orbital \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u0027s more. All my larger ship designs are based around the idea of not wasting orbital boosters. I would put a Probe, small solar panels, and multiple docking ports on every booster. After three or four Orbital launches, I would spend an hour guiding them to each other and linking them up to create a \u0027drive section\u0027 to get something to other planets. \n\u003C/p\u003E\n\u003Cp\u003E\nAn Orbital \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E means I can build a ship that\u0027s not based around the leftovers of things getting launched first. That\u0027s going to be my favorite way to spend time, I believe.\n\u003C/p\u003E\n"},{"CreatedByName":"dsplaisted","CreatedById":225798,"CreatedDateTime":"2023-03-30T00:33:19Z","Content":"\n\u003Cp\u003E\nI want it to.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2023-03-30T09:35:57Z","Content":"\n\u003Cp\u003E\nI can\u0027t say I\u0027m missing it as such, but I did find it very useful and a nice thing to have.   My surface refueling system relied on being able to connect fuel lines .\n\u003C/p\u003E\n\u003Cp\u003E\nOrbital VABs serve a different function IMO, they are for building the vessels.  The EVA construction allowed in the field repairs and modifications \n\u003C/p\u003E\n"},{"CreatedByName":"CiberX15","CreatedById":68461,"CreatedDateTime":"2023-03-30T13:46:28Z","Content":"\n\u003Cp\u003E\nI miss the idea of EVA construction, but not the implementation. Honestly even after KSP1 updated to include the feature I usually kept the Kerbal Attachment System mod installed anyway. Mostly for the attachable fuel lines.\n\u003C/p\u003E\n\u003Cp\u003E\nI am perhaps, very bad at correctly calculating (guessing) how much delta v I need to get to a place and return home, and would often run out of fuel in high orbits of the Mun or Kerbin. I ran a lot of Gas and Go missions where I flew out with a big tanker, attached a fuel port, then hooked up a fuel line and used that to refuel the stranded ship. Theoretically I could have done the same mission with docking ports but A: It wouldn\u0027t have been as much fun, and B: I rarely remembered to put docking ports on the original ship. If I knew I was going to need to refuel, I\u0027d have just built the ship better in the first place. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTo me, being able to fix a craft mid mission when you realize you\u0027ve done something catastrophically stupid is one of the most kerbal things ever. I hope KSP 2 has an improved version of this feature.  I wouldn\u0027t mind having to EVA a kerbal some of the time.\n\u003C/p\u003E\n\u003Cp\u003E\nLike, if I\u0027m at an orbital shipyard I\u0027d expect to be able to just change to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E mode, which is what I\u0027ve heard they have planned for the base building feature. But if I\u0027m just lost in space, I like that feeling of vulnerability of having to get a kerbal out and do the repair myself.  Since the kerbals can now stand on ships, they\u0027ve already fixed the most fiddly bit of that system where you have to juggle keeping your kerbal in place while trying to place the part, so they really just need a clean UI for storing and attaching parts.\n\u003C/p\u003E\n\u003Cp\u003E\nPotentially give EVA kerbals a backpack that stores whatever resources are already planned to construct ship parts, or let them pick a tank on the ship to pull supplies from, plus require an impact driver or something to explain how the kerbal can assemble a part alone in space. Then allow building anything they have the resources for, within a small radius of the kerbal. So you have to walk the kerbal over to the target area, probably click some button to open build mode, then pick a part and attach it like you were in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E but from the perspective of the Kerbal. \n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-03-31T18:16:06Z","Content":"\n\u003Cp\u003E\nI hope we keep it. It was really nifty and I loved the idea of having the parts tucked away to built a tiny spacecraft in situ. I think it is compatible with the orbital construction...they\u0027re different scenarios and is a big part of Kerbaly fun.\n\u003C/p\u003E\n"},{"CreatedByName":"jastrone","CreatedById":208489,"CreatedDateTime":"2023-04-03T10:49:21Z","Content":"\n\u003Cp\u003E\ni defenetly want a system like it but this is the one thing i think they should change the most. it was too annoying to deal with for anything exept maybe a big spacestation project.  meybe a way to drive a ship into a space station and change a few things easily. but defenetly some way of doing this with kerbals is needed especially with those big ships because they honestly do look like they need a bit of maintinance\n\u003C/p\u003E\n"}]}