{"TopicId":216452,"ForumId":44,"TopicTitle":"How To Dodge The Waste Heat Bullet As A Heavy Scifi Rocket SSTO....","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-04-13T06:09:04Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-04-13T06:09:04Z","Content":"\n\u003Cp\u003E\nSome will say waste heat no matter the energy can be managed as long as you burn enough propellant to get rid of it. In practical terms what that means is more rocket nozzles/ engines, since there is a practical limit to how fast you can pump propellant into a reaction chamber, but there is theoretically no limit except practicality for how many nozzles or engines you put on an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn scifi \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003E\u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E\u003C/abbr\u003E belly landers/taker offers are commonplace. Yet if you apply IRL science and math to them one quickly realizes that the energy required to fly to space without using up most or all of the propellant on a 300 ton \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E would also melt the engine... unless you used disposable staging at lower efficiency but then it is no longer \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe secondary problem of using greater fuel flow to solve waste heat issues of heavy scifi SSTOs is the fact that it trades one problem for another. The whole point of a scifi \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E is to try and take 10% propellant mass and get to space without using most or all of it up. So for a 300 ton \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E that means 30 tons of propellant to get 270 tons of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E to space orbit without exhausting all or even most of it. Instead you would only use 10% of 30 tons to reach orbit, which is 3 tons.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you increase your propellant flow you run out faster and you will need more than 10% propellant, which eventually means your spaceship is back to a large propellant tank with a tiny payload... which defies the entire point of a heavy scifi \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nScifi ways of dodging waste heat: If you don\u0027t want to waste more propellant just add extra energy to propelling it. Normally this is limited by how much heat an engine can tolerate... but what if the reaction happened OUTSIDE the engine?\n\u003C/p\u003E\n\u003Cp\u003E\nScifi Scenario: Scifi rocket nozzles are like super batteries that can store enough electrical energy to equal their mass/weight at maximum. They can convert the stored energy with 100% efficiency into tactile kinetic energy. In practical terms what this means is a liquid sprayer down the throat of each nozzle sprays propellant down the inner walls of the nozzle. Yet when the nozzles\u0027 tactile kinesis is activated the propellant squirted down them is moved so fast it ionizes and become a plasma plume as it exits the nozzles.\n\u003C/p\u003E\n\u003Cp\u003E\nMain Question: It costs no waste heat to convert the stored electrical energy of the nozzles into tactile kinetic energy... because of scifi conceit. Yet I am also aware that moving propellant fast enough to heat it would ALSO heat the nozzle from the sheer heat the propellant is generating as it is accelerated out the nozzle. So have I dodged the waste heat bullet with my scifi conceit? Or have I just made the matter much worse? Meaning that the plasma plume is so hot it begins to melt the nozzles... which releases all their stored electrical energy at once with a blast that would wipe a small country off the face of the earth.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI dunno.. I would like to think that the heat on a rocket nozzle from a plasma plume thrusty and efficient enough to burn 3 tons of propellant to orbit carrying 297 tons of propellant/\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E could be managed with regenerative cooling but I dunno. Granted if we use multiple nozzles... like 16 you divide that heat by 16 so it\u0027s not as much. Or maybe it requires a hundred... I dunno.\n\u003C/p\u003E\n\u003Cp\u003E\nOr maybe 3 tons is just unrealistic and I would need to use more to reach orbit, like ten tons... and just refeuel in orbit with a fuel tanker.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThoughts?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-04-13T09:42:45Z\u0022 title=\u002204/13/2023 09:42  AM\u0022 data-short=\u00221 yr\u0022\u003EApril 13, 2023\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2023-04-13T13:35:13Z","Content":"\n\u003Cp\u003E\nIn early 23rd century, with the discovery of I-Can\u0027t-Believe-It\u0027s-not-Paper (digital, cheaper, better alternative to paper), the world finally went almost completely paperless, effectively collapsing the inkjet cartrige market almost overnight. Luckily for HP, they\u0027ve been diversifying for a while, and invested heavily into space propulsion tech.\n\u003C/p\u003E\n\u003Cp\u003E\nRefuelling your SSTOs has never been easier and more convenient. Call your HP representative and schedule a refuelling appointment at the time of your choosing at any of the 73 space ports on Earth and 34 off world stations. Replacing your launch licence chip and HP Fuel Cartriges takes mere minutes. We would like to remind you that both HP Planetary Launch Drive Fuel Cartrige*, as well as HP Space Drive Fuel Cartrige are needed for launch and space travel. Both cartriges are integrated in one convenient unit and need to be replaced at the same time. It is not possible to transfer unused fuel to a new cartrige. Your HP representative will take care of your spent fuel cartriges and safely transport then for recycling. Your HP representative will also perform a diagnostics check of your HP Drives and inform you of the upcoming HP Drive Licence expiration dates.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*HP Planetary Drive Fuel Cartrige contains enough fuel for 17 launches OR landings at any rocky body in the solar system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s all your reader needs to know about fuel usage in fiction, unless you want to go hard SF, but then forget doing 10 orbital launches without refuelling.\n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2023-04-17T15:28:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224272270\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681392913\u0022 data-ipsquote-userid=\u002245577\u0022 data-ipsquote-username=\u0022Shpaget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/13/2023 at 8:35 AM, Shpaget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s all your reader needs to know about fuel usage in fiction, unless you want to go hard SF, but then forget doing 10 orbital launches without refuelling.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOnly if you want to \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E from a large body.\n\u003C/p\u003E\n\u003Cp\u003E\nDemios has an escape velocity of only 20kph, letting you both land and launch with only about 12m/s/s of thrust.  This would let a MMU land and liftoff twice before running out of fuel, and any \u0027real\u0027 rocket could probably do a lot more.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut for earth?  Any realistic rocket using less than 50%  of it\u0027s wet-mass as propellant to get to orbit is pure fantasy.  (the real number is probably above 80%, but I am willing to allow for new technologies like rotating detonation engines getting that number lower, just not *that* much lower)  \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-04-17T16:22:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224273880\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681745310\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOnly if you want to \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E from a large body.\n\u003C/p\u003E\n\u003Cp\u003E\nDemios has an escape velocity of only 20kph, letting you both land and launch with only about 12m/s/s of thrust.  This would let a MMU land and liftoff twice before running out of fuel, and any \u0027real\u0027 rocket could probably do a lot more.\n\u003C/p\u003E\n\u003Cp\u003E\nBut for earth?  Any realistic rocket using less than 50%  of it\u0027s wet-mass as propellant to get to orbit is pure fantasy.  (the real number is probably above 80%, but I am willing to allow for new technologies like rotating detonation engines getting that number lower, just not *that* much lower)  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgree, yes its systems  like antimatter or nuclear salt water but you don\u0027t want to irradiate the planet. Also lots of fusion engine concepts will not work in an atmosphere. \u003Cbr\u003E\nOne potential way to get high trust is to have the fusion happen outside the ship and control the plasma with magnetic fields. This way gamma rays and neutrons mostly escape. \u003Cbr\u003E\nThis will not work in an atmosphere. \n\u003C/p\u003E\n\u003Cp\u003E\nNow very good fusion reactors is probably your best bet, use the helium ions created to heat up air for the first part, then heat up reaction mass once out of atmosphere. In space you simply use the helium exhaust as an very high isp but much lower trust, still an touch ship  but far lower than 1 g trust. \u003Cbr\u003E\n\u003Cbr\u003E\nBut  its not much of an issue refueling after each flight. Planes does. Yes you might use an long range plane for an pretty short trip, say Stockholm to Paris. In this case you don\u0027t top up the fuel tanks as you will just use more fuel carrying the extra fuel around.\u003Cbr\u003E\nFor transatlantic flights planes carry so much fuel plane has to dump or burn fuel to land, for shorter flight they can just turn around and land. Experienced both. \u003Cbr\u003E\nFirst was an national flight who could not retract the nose wheel. Second was an navigation system fail on a transatlantic one. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Codraroll","CreatedById":163815,"CreatedDateTime":"2023-04-17T17:35:26Z","Content":"\n\u003Cp\u003E\nThe word \u0022Scifi\u0022 is in there, which greatly lowers the difficulty of the question into a simple two-step process:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Pretend it\u0027s not an issue. It\u0027s fiction.\n\u003C/p\u003E\n\u003Cp\u003E\n2) See 1.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-04-18T01:48:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224273890\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681748561\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgree, yes its systems  like antimatter or nuclear salt water but you don\u0027t want to irradiate the planet. Also lots of fusion engine concepts will not work in an atmosphere. \u003Cbr\u003E\nOne potential way to get high trust is to have the fusion happen outside the ship and control the plasma with magnetic fields. This way gamma rays and neutrons mostly escape. \u003Cbr\u003E\nThis will not work in an atmosphere. \n\u003C/p\u003E\n\u003Cp\u003E\nNow very good fusion reactors is probably your best bet, use the helium ions created to heat up air for the first part, then heat up reaction mass once out of atmosphere. In space you simply use the helium exhaust as an very high isp but much lower trust, still an touch ship  but far lower than 1 g trust. \u003Cbr\u003E\n\u003Cbr\u003E\nBut  its not much of an issue refueling after each flight. Planes does. Yes you might use an long range plane for an pretty short trip, say Stockholm to Paris. In this case you don\u0027t top up the fuel tanks as you will just use more fuel carrying the extra fuel around.\u003Cbr\u003E\nFor transatlantic flights planes carry so much fuel plane has to dump or burn fuel to land, for shorter flight they can just turn around and land. Experienced both. \u003Cbr\u003E\nFirst was an national flight who could not retract the nose wheel. Second was an navigation system fail on a transatlantic one. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnless you are doing the Star Trek thing where \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E do it yourself is the only way to refuel your propellant.\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately the drive is not my only scifi gimmick. Another propellant saver is a slower than light vacuum translation drive which translates or moves space past the ship at the same rate of it\u0027s current acceleration. So just do a  quick 3g burn, shut it off, and let the translation drive let you slow warp at 3g. Once dropped out of warp, speed and heading returns to normal... meaning you can get places a lot faster because you do not have to accelerate all the way there and retroburn to slow down nearly as much.\n\u003C/p\u003E\n\u003Cp\u003E\nSo use this to get close to ice. Mine it. And refuel. Vacuum translation drive only works in vacuum though.\n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2023-04-18T16:46:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274102\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681782528\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nVacuum translation drive only works in vacuum though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCompared to what?\n\u003C/p\u003E\n\u003Cp\u003E\nInterstellar space(1/10 particles per cc) is a vacuum compared to the solar wind, the solar wind(5 particles/cc) is a vacuum compared to the surface of the moon, the surface of the moon(10^4-10^5 particles/cc) is a vacuum compared to Mars, and Mars(0.02 kg/m^3) is a vacuum compared to earth, and earth(1.3kg/m^3) is a vacuum compared to Venus, and Venus(65kg/m^3) is a vacuum compared to Jupiter(25,000 mile deep ocean of liquid metallic hydrogen).\n\u003C/p\u003E\n\u003Cp\u003E\nCan it enter the solar system?  Can it land on the moon? Can it land on Mars?  Can it land on Earth? etc.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are trying to write a story, spending all your time coming up with rules about the universe is a backwards way to do it.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst you come up with the story, then you identify interesting complications that can be added to the story.  \n\u003C/p\u003E\n\u003Cp\u003E\nOnly then are you in a position to do general world-building, and it must be constrained by your story.  (and every question you ask would need to include the relevant story-beat details so helpers know the constraints)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd frankly, anything that involves startrek-style shuttles is science-fantasy at best.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-04-18T17:48:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274102\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681782528\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUnless you are doing the Star Trek thing where \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E do it yourself is the only way to refuel your propellant.\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately the drive is not my only scifi gimmick. Another propellant saver is a slower than light vacuum translation drive which translates or moves space past the ship at the same rate of it\u0027s current acceleration. So just do a  quick 3g burn, shut it off, and let the translation drive let you slow warp at 3g. Once dropped out of warp, speed and heading returns to normal... meaning you can get places a lot faster because you do not have to accelerate all the way there and retroburn to slow down nearly as much.\n\u003C/p\u003E\n\u003Cp\u003E\nSo use this to get close to ice. Mine it. And refuel. Vacuum translation drive only works in vacuum though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI assumed shuttle launched from a mothership who would carry fuel for shuttles like an aircraft carrier carry jet fuel for the planes as an worst case, if you launch from an spaceport you would refuel at ground.\u003Cbr\u003E\nYou could use an fusion powered shuttle for interplanetary missions a bit like how SpaceX plan to use Starship.  But shuttles tend to be better as you want ship comfort for month long flights but plane level comfort works for hours. \n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2023-04-18T18:21:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224273923\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681752926\u0022 data-ipsquote-userid=\u0022163815\u0022 data-ipsquote-username=\u0022Codraroll\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/17/2023 at 10:35 AM, Codraroll said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe word \u0022Scifi\u0022 is in there, which greatly lowers the difficulty of the question into a simple two-step process:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Pretend it\u0027s not an issue. It\u0027s fiction.\n\u003C/p\u003E\n\u003Cp\u003E\n2) See 1.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou forgot something…\n\u003C/p\u003E\n\u003Cp\u003E\n1a) Add copious amounts of handwavium\n\u003C/p\u003E\n"},{"CreatedByName":"Codraroll","CreatedById":163815,"CreatedDateTime":"2023-04-18T18:45:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274248\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681842063\u0022 data-ipsquote-userid=\u002289439\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, StrandedonEarth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou forgot something…\n\u003C/p\u003E\n\u003Cp\u003E\n1a) Add copious amounts of handwavium\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI prefer to call it the \u0022five-finger oscillating motion device\u0022. Solves every problem in sci-fi.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2023-04-19T02:51:50Z","Content":"\n\u003Cp\u003E\nWhat happens if somebody starts moving about the ship just as this vacuum translation thing cones online? Do they continue to accelerate through ship walls?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about moving parts of the ship itself, or even the structure of the ship that is certainly experiencing some vibration? Your ship would disintegrate as soon as you turn this on.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-04-19T22:23:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274222\u0022 data-ipsquote-contentid=\u0022216452\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681836400\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/18/2023 at 5:46 PM, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you are trying to write a story, spending all your time coming up with rules about the universe is a backwards way to do it.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst you come up with the story, then you identify interesting complications that can be added to the story.  \n\u003C/p\u003E\n\u003Cp\u003E\nOnly then are you in a position to do general world-building, and it must be constrained by your story.  (and every question you ask would need to include the relevant story-beat details so helpers know the constraints)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI’m always a bit wary when folks get all prescriptive about writing, since I doubt that any two writers have exactly the same process.\n\u003C/p\u003E\n\u003Cp\u003E\nYour way is certainly one way of doing it but it’s not difficult to think of counterexamples.\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes a widget that can do x, y, or z is central to the story - and might be the initial idea behind the story. In which case, figuring out some ground rules about how the widget works might be a sensible place to start (for consistency if nothing else) and might be a way of coming up with those interesting complications to add to the story.\n\u003C/p\u003E\n\u003Cp\u003E\nLikewise (and here I have personal experience), general worldbuilding can be the framework that makes the story and holds it together. It’s not necessarily something that’s just painted on at the end.\n\u003C/p\u003E\n\u003Cp\u003E\nI do agree that there’s a point at which it’s probably more useful to just present the reader with ‘a widget that does x’ rather than bombarding them with screeds of technobabble to justify it. Where that point is, is harder to define.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-04-19T22:25:12Z\u0022 title=\u002204/19/2023 10:25  PM\u0022 data-short=\u00221 yr\u0022\u003EApril 19, 2023\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"}]}