{"TopicId":216686,"ForumId":123,"TopicTitle":"KSP2: New player; mission to mun involving stranding Bill Kerman, ship falling through the ground, editing JSON files and more.","CreatedByName":"mrjsonkerbal","CreatedById":228707,"CreatedDateTime":"2023-04-18T14:19:02Z","PageNum":1,"Articles":[{"CreatedByName":"mrjsonkerbal","CreatedById":228707,"CreatedDateTime":"2023-04-18T14:19:02Z","Content":"\n\u003Cp\u003E\nHad my first \u0022successful\u0022 mun mission. No doubt there are things I did not know/understand that could have made this go better, but I had fun despite all the unexpected challenges.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, here\u0027s the GPT\u0027d version of my mission to make it more fun, or just skip that and see the steps below.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn the year 2023, the Kerbal Space Program launched an ambitious lunar mission, with the fearless Bill Kerman at the helm. His mission: to boldly set foot on the moon, a celestial body shrouded in mystery and cheese.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAs fate would have it, Bill\u0027s lunar landing was a touch too exuberant. He managed to plant his feet on the moon\u0027s surface but found himself marooned, his trusty spacecraft now a fuel-less hunk of metal. Bill was stranded, but not forgotten. Back at mission control, they hatched a daring rescue plan: send Valentina Kerman, space pilot extraordinaire, to bring Bill home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nValentina rocketed to the moon, her heart set on saving her compatriot. The landing was far from textbook, but she touched down a mere 10 kilometers from Bill. Surely, they thought, a brisk lunar stroll would reunite the two astronauts. The universe, however, had other plans.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAs Bill lumbered toward Valentina, he and his ship inexplicably fell through the moon\u0027s surface. This was no ordinary lunar quirk; it was a bug, a glitch in the very fabric of space-time! The heroes at mission control sprang into action, tinkering with the JSON save files in a desperate attempt to right this cosmic wrong. Alas, their efforts were in vain. But hope springs eternal in the heart of a Kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nA eureka moment: time-warping! By manipulating the flow of time, the moon could be rotated, allowing Bill and his ship to emerge on the surface once more. But their troubles were far from over. Now 42 kilometers apart, the two astronauts faced a grueling journey to reunite.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nBill, the eternal optimist, clambered into his glitched ship and somehow managed to launch it skyward, before landing and shaving 20 kilometers off the distance. He then donned his trusty jetpack and blazed across the lunar surface, only to run out of fuel a mere 5 kilometers from Valentina\u0027s ship. Undeterred, Bill trudged on, dreaming of a hero\u0027s welcome.\u003Cbr\u003E\nUpon reaching Valentina\u0027s ship, a crushing realization set in: her vessel had also fallen prey to the insidious bug, rendering it incapable of returning to Kerbin. Despair loomed large, but the indomitable Kerbal spirit refused to be extinguished.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWith renewed vigor, they turned once more to the JSON save files. Scouring through lines of code, they found a previous save with Valentina\u0027s ship upright and functional. The moon\u0027s lack of storms and wind couldn\u0027t possibly have toppled the spacecraft - this was a bug, and they were going to fix it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAnd fix it, they did! Bill boarded the now-upright ship, and together, they rocketed away from the treacherous lunar surface, hearts swelling with relief and triumph. With deft orbital maneuvers, they made their way back to Kerbin, their homecoming heralded by a graceful re-entry and a perfectly timed parachute deployment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIn the end, Bill and Valentina were saved, their harrowing adventure a testament to the resilience, determination, and ingenuity of the Kerbal spirit. The mission, against all odds, was a resounding success, and their tale of lunar derring-do would be remembered for generations to come.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd here\u0027s the actual mission step by step:\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nFlew Bill Kerman to the moon.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nRan out of fuel.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nSo Bill is stuck there.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nSend Valentina Kerman in a bigger rocket.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nValentina arrives and lands about 10km away - not ideal but OK and I’m new to all this so a 10km walk can’t be too bad right?\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nSwitch control to Bill Kerman. Bill \u002B the ship fall through the surface of the moon. BUG.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nPlay endlessly with the JSON save file trying to move Bill and his stranded ship back up onto the surface. Can’t do it.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nI discover that time warping moves the moon around Bill and his ship so I just need to rotate the moon until Bill and his ship are above the surface. Do this, and end up 42km away from Valentina and the rescue ship.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nStart walking. Even with time warping, realize it will take a long long time to get this done.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nHead back to Bill’s ship and realize that it is on its side and has a little delta v in it. Manage to get Bill back in, and blast his ship upright and then land it back on to the surface and lose about 20km off that distance.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nGet Bill and his jetpack moving across the surface, and run out of jetpack fuel about 5km out.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nWalk the rest of the way to the ship.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nArrive at Valentina’s ship. It has bugged out and fallen on its side.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nUnlike Bill’s ship, Valentina’s ship is WAY TOO HEAVY to do any slick weird maneuvers back to upright. We’re doomed. Or are we?\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nGo back to the JSON save files that we unsuccessfully used before.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nValentina’s ship WAS upright when it landed, so I found a save file and overwrite the broken side ways location of Valentina’s ship with an upright older version. (It’s the moon. It’s not going to blow over in a god damn storm this is a bug.)\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nWe now have an upright ship and Bill can board!!!\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nWe get off the moon and leave the moon sphere of influence as fast as possible.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nFrom here it’s a pretty easy sequence of orbital maneuvers (and we have the fuel!) to get back to Kerbin.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nRe-entry goes smoothly, I remember to arm the parachute and we land safely.\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\nBill and Valentina are saved. The mission is a success. \n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2023-04-18T19:14:04Z","Content":"\n\u003Cp\u003E\nNo pictures? \u003Cspan\u003E:\u0027( \u003C/span\u003E\n\u003C/p\u003E\n"}]}