{"TopicId":21735,"ForumId":32,"TopicTitle":"Fuel and engine properties standards?","CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2012-10-08T22:13:23Z","PageNum":1,"Articles":[{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2012-10-08T22:13:23Z","Content":"\n\u003Cp\u003EHas there ever been a standard established by Squad or the community for the realistic range of engine parameters?\u003C/p\u003E\u003Cp\u003Ethings like,\u003C/p\u003E\u003Cp\u003Ethe density of fuel,\u003C/p\u003E\u003Cp\u003Ethe mass of engines\u003C/p\u003E\u003Cp\u003Ethe dry weight and capacity of tanks\u003C/p\u003E\u003Cp\u003Ethe masses of random connection parts\u003C/p\u003E\u003Cp\u003EEngine fuel burn rates\u003C/p\u003E\u003Cp\u003EIt would be nice, for example to say, in a challenge, that only parts which comply to the realistic standard are allowed.\u003C/p\u003E\u003Cp\u003Ehas any attempt been made to derive masses and tank capacities from the mesh? I\u0027m thinking of writing something to do this.\u003C/p\u003E\n"},{"CreatedByName":"MKSheppard","CreatedById":53580,"CreatedDateTime":"2012-10-09T04:25:48Z","Content":"\n\u003Cp\u003EI actually did something like this for my own private mod that I\u0027m still working on in bits and pieces -- it\u0027s playable on my computer, and I\u0027m still refining the system a bit before I release it.\u003C/p\u003E\u003Cp\u003EMasses of engines?\u003C/p\u003E\u003Cp\u003ECheck out real world engines, as engines are very \u0022rubber-bandy\u0022 that can go up and down a wide range of maximum thrusts and retain their T/W ratios...\u003C/p\u003E\u003Cp\u003E[the one exception is Nuclear Thermal Rockets, you can\u0027t rubber band them]\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.alternatewars.com/BBOW/Space/Reference_Spacecraft_Engines.htm\u0022 rel=\u0022external nofollow\u0022\u003ELink to Engines on my Website\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Etl;dr:\u003C/p\u003E\u003Cp\u003E1960s Kerosene Engines (H-1/F-1): 95~\u003C/p\u003E\u003Cp\u003E1960s Hydrogen Engines (J-2): 50-65~\u003C/p\u003E\u003Cp\u003E1960s Hypergolic Engines (LEM Descent Engine, etc): 20-30\u003C/p\u003E\u003Cp\u003E1970s/80s Kerosene Engines (NK-33): 125~\u003C/p\u003E\u003Cp\u003E1970s/80s Hydrogen Engines (SSME): 70~\u003C/p\u003E\u003Cp\u003ESo lets say you have a Kerosene engine that puts out 200 kN of thrust. 200 kN is about 20,400~ kilograms-force.\u003C/p\u003E\u003Cp\u003EWith a T/W of about 90, that means your engine would weigh:\u003C/p\u003E\u003Cp\u003E20,400 kgf / 90 = 226.66 kg, or 0.226 tonnes.\u003C/p\u003E\u003Cp\u003EThe reason you can\u0027t \u0022rubber band\u0022 Nuclear Thermal Rockets is because you need a minimum amount of fissionable mass in the reactor to achieve criticality (the amount needed depends on how advanced your nuclear science is), and that\u0027s constrained by the laws of physics, which appear to work the same in Kerbalistani land as on Earth.\u003C/p\u003E\u003Cp\u003EPlus, there\u0027s the need for radiation shielding on the NTR, which is a very inflexible parameter.\u003C/p\u003E\u003Cp\u003EAs for dry masses of tanks; NASA actually did the work for us:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.alternatewars.com/BBOW/Space/JSC-26098_Tank_Mass_Estimating.gif\u0022 rel=\u0022external nofollow\u0022\u003ELink to NASA graphs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBasically:\u003C/p\u003E\u003Cp\u003E------------\u003C/p\u003E\u003Cp\u003EMassTank = 10.41 * (VolumeTank^0.75)\u003C/p\u003E\u003Cp\u003EWhere:\u003C/p\u003E\u003Cp\u003EMassTank: Mass of the propellant tank in pounds\u003C/p\u003E\u003Cp\u003EVolumeTank: Volume of the propellant tank in cubic feet (ft3)\u003C/p\u003E\u003Cp\u003E-----------\u003C/p\u003E\u003Cp\u003ENote that this just considers the propellant tanks and their insulation; and propellant tanks are not perfectly cylindrical.\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-10-09T04:45:58Z","Content":"\n\u003Cp\u003EBeing that the game is in Alpha, and only version .17, many of these things are sure to change. In fact a couple of the engines changed in each of the last 3 versions.\u003C/p\u003E\n"}]}