{"TopicId":21769,"ForumId":39,"TopicTitle":"The Story of Jake Kermin","CreatedByName":"halo2austin","CreatedById":17383,"CreatedDateTime":"2012-10-09T06:03:40Z","PageNum":1,"Articles":[{"CreatedByName":"halo2austin","CreatedById":17383,"CreatedDateTime":"2012-10-09T06:03:40Z","Content":"\n\u003Cp\u003EA short story by Austin Smith based on Kerbal Space Program. My name is Jake Kermin I fly Rockets to the moon and to other planets. Today is my first flight of the year and I feel good about it, like anything could go wrong. The ship I am flying today is the Kitty Cat Mark II, I must say its a nice ship. This trip I am going alone, the capsule on the ship only fits one man. 30 seconds after lift off I am in the orbit I set my nose to point the north pole towards the mun. I must say Kerbin is a nice planet its sad that Kerbin Space Centre is the the only buildings for miles on in. 2 hours after take off. I check my map on where I am going, \u0022WHAT THIS CANT BE! I am going to escape the orbit of Kerbin.\u0022 It seems everything has gone wrong. 3 hours after take off. \u0022I am orbiting the sun right now and it seems I am out of fuel and RCS there is no way back home.\u0022 2 years later. \u0022Seems they have forgotten about me. You know what I am going to hang on to my later on the outside of my ship.\u0022 2 years later. \u0022No no no no I lost my grip must reach pod.\u0022 Ah no use I guess I stuck in space forever now. That is the story of Jake Kermin. (Yes this actually did happen to me in the game)\u003C/p\u003E\n"},{"CreatedByName":"swiftgates24","CreatedById":22280,"CreatedDateTime":"2012-10-09T19:31:34Z","Content":"\n\u003Cp\u003ENice \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Kitty Cat Mark II, that is too good.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-09T20:08:32Z","Content":"\n\u003Cp\u003EThird grade quality. It is very quick and doesn\u0027t have a very well thought out plot. It is very hard to read. \u003C/p\u003E\u003Cp\u003EPlease read books. It really helps with writing.\u003C/p\u003E\n"},{"CreatedByName":"halo2austin","CreatedById":17383,"CreatedDateTime":"2012-10-09T20:37:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nutt007\u0022 data-cite=\u0022Nutt007\u0022\u003E\u003Cdiv\u003EThird grade quality. It is very quick and doesn\u0027t have a very well thought out plot. It is very hard to read. \u003Cp\u003EPlease read books. It really helps with writing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThird grade quality in my mind is little or no punctuation,no capitals and bad spelling\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-09T21:20:53Z","Content":"\n\u003Cp\u003EPerhaps that was a poor remark to make. But the point still stands:\u003C/p\u003E\u003Cp\u003ERead books. That is the best way to get better at writing.\u003C/p\u003E\n"},{"CreatedByName":"halo2austin","CreatedById":17383,"CreatedDateTime":"2012-10-09T21:30:16Z","Content":"\n\u003Cp\u003EI do read books. And i am also pointing out that one more post and you got 1000\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-10-10T02:33:00Z","Content":"\n\u003Cp\u003EHonsently, it be nice if:\u003C/p\u003E\u003Cp\u003EA: Spaced out\u003C/p\u003E\u003Cp\u003EB: More storyline, like thats not a story, its just a little adventure\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-10-10T03:41:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003EHonsently, it be nice if:\u003Cp\u003EA: Spaced out\u003C/p\u003E\u003Cp\u003EB: More storyline, like thats not a story, its just a little adventure\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree there is no real story. Most stories have a beginning, middle, and end.\u003C/p\u003E\u003Cp\u003EI\u0027m starting to sound like an English teacher. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"}]}