{"TopicId":217895,"ForumId":120,"TopicTitle":"More custamizable and procedural parts","CreatedByName":"Lowi_Sace","CreatedById":224820,"CreatedDateTime":"2023-06-23T09:15:02Z","PageNum":1,"Articles":[{"CreatedByName":"Lowi_Sace","CreatedById":224820,"CreatedDateTime":"2023-06-23T09:15:02Z","Content":"\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBring customizable parts back and make way more parts procedural. Stacking of parts is very time consuming and is often not he exact size I want. Also with the current amount of parts and the ones that will be added searching for a part would be nice.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSome examples: \u003Cbr\u003E\n\u003Cstrong\u003Efuel tanks: \u003C/strong\u003E\u003Cbr\u003E\n•    regular: procedural in length (smooth) and width (stepwise xs,s,m,l,xl)\u003Cbr\u003E\n          o    maybe for tanks add sizes: sm, ml and xxl\u003Cbr\u003E\n•    MK2/MK3: procedural in length\u003Cbr\u003E\n•    MK2/MK3 to regular adapter: en length procedural and regular side in width \u003Cbr\u003E\n•    Droptank: procedural in length (smooth) and width (stepwise xs,s,m,l,xl)\u003Cbr\u003E\n•    Donut tank: just size switchable (xs,s,m,l,xl)\u003Cbr\u003E\n•    Make (for liquid feul) chosable which feul will go in tank\u003Cbr\u003E\n          o    Options (Methalox, Hydrolox and keralox)\u003Cbr\u003E\n          o    Slider for feul/oxidizer ratio: practically for engines that work with or without oxidizer\u003Cbr\u003E\n          o    No need anymore for methane only thanks \u003Cbr\u003E\n          o    Tank automatically switches to type of detached engine (also be dome manually if necceserry)\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEngines:\u003C/strong\u003E\u003Cbr\u003E\n•    Customizable engine nozzles\u003Cbr\u003E\n          o    Choose from thick atmosphere (eve) (small)\u003Cbr\u003E\n          o     sea-level kerbin (medium)\u003Cbr\u003E\n          o    thin admoshere (high kerbin or duna) (standard)\u003Cbr\u003E\n          o    vacuum (biggest)\u003Cbr\u003E\n•    choose variants for feul type\u003Cbr\u003E\n          o    Choose liquid fuel engine variant for hydrolox, methalox and keralox\u003Cbr\u003E\n                        Default is methalox\u003Cbr\u003E\n          o    For nuclear this option also is available (hydrogen, methane and kerosine)\u003Cbr\u003E\n                        Default is hydrogen  by far most efficient\u003Cbr\u003E\n          o    Jets also switchable\u003Cbr\u003E\n                        Default kerosine\u003Cbr\u003E\n          o    Tank automatically switches to same as engine\u003Cbr\u003E\n                        Can be separately done if necessary\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESolid rocked boosters\u003C/strong\u003E\u003Cbr\u003E\n•    In lengt procedural in sizes S, M and L\u003Cbr\u003E\n          o    Only 3 needed\u003Cbr\u003E\n•    Add cones with \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E separator build in for every size \u003Cbr\u003E\n          o    maybe length procedural and asymmetric option\u003Cbr\u003E\n•    In tech tree progression for this parts will be more powerful longer and other options like Gimbel\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECargo parts\u003C/strong\u003E\u003Cbr\u003E\n•    Cargo bays procedural in lengt\u003Cbr\u003E\n•    MK2/MK3 crew parts stepwise (per window) procedural in lengt  (more size options)\u003Cbr\u003E\n•    Open cargo part also in lengt procedural\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESolar pannels \u003C/strong\u003E\u003Cbr\u003E\n•    Easy placements for making big solar farms\u003Cbr\u003E\n          o    Procedural is not necessary (real life also standard size)\u003Cbr\u003E\n•    In tech tree they will get more efficient while progressing\u003Cbr\u003E\nParts like struts, panels and radiators will already become procedural\n\u003C/p\u003E\n\u003Cp\u003E\nI think making parts like this would give players way more customizability, part options without just adding way to much parts and having to search endlessly\u003Cbr\u003E\n \n\u003C/p\u003E\n"}]}