{"TopicId":218238,"ForumId":120,"TopicTitle":"Suggestion: An overly verbose examination of \u0026quot;wobbly rockets\u0026quot; and joint simulations","CreatedByName":"Kavaeric","CreatedById":107109,"CreatedDateTime":"2023-07-06T05:30:26Z","PageNum":1,"Articles":[{"CreatedByName":"Kavaeric","CreatedById":107109,"CreatedDateTime":"2023-07-06T05:30:26Z","Content":"\n\u003Cp\u003E\nFolks on the Discord said I should type up my thoughts on wobbly joints, so here they are. As a disclaimer I\u0027m merely a design student and not a game developer. I\u0027m \u003Cem\u003Eespecially\u003C/em\u003E not a programmer so some of my assumptions about performance may be wildly wrong. I have at least been playing Kerbal Space Program on and off since at least v0.11 or so, so I\u0027d like to say I have a fair amount of experience and remember much of the time before autostrut and mods like KJR.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EGetting everyone on the same page\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBefore I dive in I want to make sure everyone reading this (dev or player or otherwise) understands the distinction between \u0022wobbly rockets\u0022 and \u0022destructible joints\u0022, because I think it\u0027s a major reason why, when I read conversations on Discord or elsewhere, the debate on wobbly rockets goes around in circles endlessly. For the purposes of this:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u0022Wobbly rockets\u0022 \u003C/strong\u003Erefers to how \u003Cstrong\u003Epart joints\u003C/strong\u003E \u003Cstrong\u003Eare simulated as springs\u003C/strong\u003E, i.e. the nature of how joints have a lot of give and elasticity, giving rise to non-structurally sound rockets that bend like a wet noodle.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Wobbly rockets\u0022 does \u003Cem\u003Enot\u003C/em\u003E cover the actual strength of joints or the fact that they are breakable. You can have a game with structural failure at part joints \u003Cem\u003Ewithout\u003C/em\u003E the elastic spring simulation.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nOr, to summarise ahead, my suggestion is for KSP2 to move away from having flexible joint simulation while still retaining the characteristics and spirit of having wobbly rockets.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll also take the time to point out that the devs \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/topic/217724-calvinball-more-like-spherical-hydrogen-tank-ball\u0022 rel=\u0022\u0022\u003Ehave acknowledged and have committed to improving the joint system\u003C/a\u003E such that certain joints are much stiffer, namely how parts inline parts stacked serially should have \u0022little to no flexing\u0022, among other things:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOur team shares the community view that overly-wobbly rockets are a major issue in KSP2 (it is number 10 on our top-ten issues list). We have introduced a number of mitigations to address aspects of that issue (altering inertia tensor values to decrease joint issues that emerge when high-mass and low-mass parts are connected, introducing various bespoke multi-joint augmentations to areas of known over-flexibility), but we still see this as an area where major improvement is needed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor whatever reason, a large number of people I\u0027ve seen discussing this topic believe that the devs aren\u0027t interested in changing the joint system as it stands now in EA KSP2/KSP1, and operating off of this misconception. I don\u0027t think it\u0027s productive and I\u0027m not really interested in discussing this with folks who need to put words in people\u0027s mouths to get their point across. I\u0027ll also point out any criticisms I have that are shared by the KSP2 dev team.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EThe case against wobbly rockets\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try my best to avoid stating the obvious while acknowledging issues that others have pointed out in the past. Nonetheless, I\u0027ve tried to best condense my own reasons why I think wobbly rockets (as in, flexible, elastic joints, not breakable joints; see above if you need a reminder) are detrimental to KSP\u0027s gameplay visions as they stand now (again, acknowledging that the final iteration in KSP2 is \u003Cem\u003Enot\u003C/em\u003E going to be how it is right now), based on my experiences of KSP1:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFlexible joints are frustrating particularly for new or inexperienced players, as it is an unintuitive and difficult-to-mitigate barrier to launching early rockets.\u003C/strong\u003E In my time helping new players on various servers and communities, one of the biggest sources of difficulty for getting into orbit for the first time is wobbly rockets, and not in the ways more experienced players playing modded or tweaked versions of the game might expect. I\u0027ve seen it happen many times where a new player in a Discord call has designed a rocket that seems perfectly capable of flying straight and stable, but the small deflections caused by springy joints can lead to a cascading instability. The most common example in my experience helping new players is when micro-oscillations suddenly compound into an unrecoverable situation:\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002245.88\u0022 height=\u0022550\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1039965578754007060/1126306366303240283/image.png\u0022\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nIt\u0027s a big source of frustration because it\u0027s almost impossible to really account for until it\u0027s too late: the fluctuations are so small that new players can easily miss them, and once they become obvious it\u0027s often too late. Newer players early in Science or Career mode often also have only a limited selection of parts to help control and stabilise. Additionally, inputs via keyboard or even through overcompensating \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E can make the oscillations worse. It becomes a unintuitive source of failure and frustration for new players.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESimulated joints runs counter to a game about presenting design and engineering concepts in an accessible ways\u003C/strong\u003E. One of the odd things about structural stability is how much on \u0022vibes\u0022 it goes off of in KSP1: the game will calculate things like \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E in or out of atmosphere or how much \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E each stage your rocket has depending on payload and fuel/engine properties, and countless details about mass, fuel consumption, and even impact strength are exposed in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E. My assumption was that this was meant to ensure that any failures the players experienced were due to mistakes on their fault and not because the game obscured information it had. Hence, it\u0027s always been strange how it was difficult to answer questions like \u0022how heavy can my radial boosters be before these radial decouplers give out and I need to consider adding reinforcing struts?\u0022\u003Cbr\u003E\n\u003Cbr\u003E\nI realise it\u0027s probably not possible now given how joint stresses are simulated on the fly and not an inherit property of each part—nonetheless, maximum loading capacity for critical attachment points like radial decouplers not being listed feels like a very strange departure from what a player is led to expect from in-game parts documentation.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESpring joint simulations are very taxing on hardware and is difficult to program\u003C/strong\u003E. This one I admit is more guesswork based on limited experience of how games are programmed, but from my understanding simulating a lot of joints as flexible soft-body springs is very expensive, at least as described by the devs themselves. From what I know it also often lends itself to cascading problems: some users have reported how the small gap created in between two parts that are bent from each other causes increased drag, compounding situations like the one mentioned previously. I can also imagine it leads to a lot of headaches regarding collision boxes and krakens.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nTo reiterate, I understand that KSP2 devs share many of these concerns and that they are aiming to change this joint model for KSP2; this is merely my attempt at zeroing on the specific problems of the current model.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EThe case...\u003Cem\u003Efor \u003C/em\u003Ewobbly rockets?\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s also worth pointing out to ourselves that there are certain gameplay opportunities to wobbly rockets that we need to keep in mind, even if they are compromised in the current state of KSP1/2. I want to take a nuanced approach to these though and try to drill down what these benefits are, though, since it will inform how a new solution can be designed for KSP2.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EWobbly rockets provide feedback to the player as to the viability of their craft design\u003C/strong\u003E. In addition to watching many new players fumble with the micro-oscillation problem, I\u0027ve also noticed a lot of players who discovered the importance of structural stability for large craft through the flexible joints. There have been times when I\u0027ve watched a new player strap two SRBs to their core stage with a single decoupler each and watching them bow inwards due to the amount of thrust they are dealing with. Aside from them finding it funny (which we\u0027ll get to in a bit), it does also provide visible (if exaggerated) feedback to their design: you need a heftier joint or more reinforcement.\u003Cbr\u003E\n\u003Cbr\u003E\nThis does get diminished by how the joints can feel \u003Cem\u003Eso \u003C/em\u003Eelastic that they seem unbreakable, because it suggests your rocket is made out of indestructible bundles of rubber bands, which may undermine attempts to suggest limitations in the structural strength of joints. Nonetheless, I believe that any new solution should at least retain (and improve) how this system is valuable in the form of feedback.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EIt\u0027s fun and funny.\u003C/strong\u003E This point might be more contentious, but I think in hyperfixating on this specific point from June 16th\u0027s upnate the community (and maybe even the devs) failed to find the nuance in the statement. See my above distinction between having wobbly rockets vs having destructible joints: here, I don\u0027t think that wobbly rockets and flexible joints themselves are necessarily part of KSP DNA, but rather the experience of trial, error, and comedic mishap. Having played this game for very long and seeing players of different intents and backgrounds play, I don\u0027t think I recall much in the way of people finding fun in how rockets act like slinkies, but more with watching their designs fail is spectacular or unexpected ways, with boosters spinning rapidly or what not. I think this sense of finding joy in the sandbox of failure can be preserved without necessarily having flexible joints!\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EArmchair game designer Kavaeric hypothesises a solution\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the point where I go into armchair video game designer mode and try to come up with a concept that satisfies the points, which summarised are:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe new solution should be intuitive to understand and not cause unexpected or unforeseeable vehicle failures for new players.\n\u003C/li\u003E\n\u003Cli\u003E\nThe new solution should work with the game\u0027s intent of giving players as much (or as little) information as they desire when constructing their rockets.\n\u003C/li\u003E\n\u003Cli\u003E\nThe new solution should be performant and scale well with many parts.\n\u003C/li\u003E\n\u003Cli\u003E\nThe new solution should provide avenues for the player to discover design flaws in their designs, both for players who prefer to scrutinise their craft in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E and for players who like to experiment and watch what happens in flight.\n\u003C/li\u003E\n\u003Cli\u003E\nThe new solution should not run counter to the game\u0027s spiritual and aesthetic/comedic tones of failure and mishap on the road to success.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nInterestingly, my source of inspiration for a possible design solution is from the KSP Early Access cinematic launch trailer. Specifically, this moment where the SRBs of the first rocket come off:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/STTTp9nDFOE?start=16\u0026amp;feature=oembed\u0022 title=\u0022Kerbal Space Program 2 Early Access Launch Cinematic\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDespite the trailer not depicting any of the craft bending like a funfair inflatable guy, I think the vibe of the trailer still feels very kerbal in terms of the ways the craft fail structurally, don\u0027t you think?\n\u003C/p\u003E\n\u003Cp\u003E\nAnimation also gives some pointers. I\u0027m a fan of the film The Wind Rises (2013), which has a few moments where aircraft shake themselves apart from the stress. Miyazaki exaggerates the stress, bending, and motion of the aircraft, which could be a source of inspiration on how to depict structural failure of a craft in KSP2.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vlc_nXcedL57Tv.gif\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.80\u0022 height=\u0022269\u0022 width=\u0022500\u0022 src=\u0022https://cdn.discordapp.com/attachments/1107055131511488723/1126382669446525018/vlc_nXcedL57Tv.gif\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, my modded KSP1 game includes \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/topic/188027-112x-shipeffects-continued/\u0022 rel=\u0022\u0022\u003EShip Effects Continued\u003C/a\u003E, which adds to the soundscape of the game by introducing rattling and vibration sound effects when a craft is experiencing significant structural forces, such as during launch or re-entry. I think collecting all these as inspiration, I can start to visualise an updated system for joints for KSP2:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nJoints are rigid. They do not flex and they are not simulated as flexible parts.\n\u003C/li\u003E\n\u003Cli\u003E\nEach joint on a part has a value that represents the maximum stress it can take. Generally, smaller parts have lower thresholds, as do radially-attached parts.\n\u003C/li\u003E\n\u003Cli\u003E\nAttaching a part without using an attachment node (usually the top/bottom node but also the other directions if using a hub connector part) incurs a strength penalty.\n\u003C/li\u003E\n\u003Cli\u003E\nA joint breaks when the lower stress number of the two parts is exceeded.\n\u003C/li\u003E\n\u003Cli\u003E\nIf a joint is close to breaking, an animation is interpolated in along with sound effects that signal to the player that something is wrong, similar to how the radial decoupler in the trailer rattles violently before detaching.\n\u003C/li\u003E\n\u003Cli\u003E\nStruts are special parts that boost joint strength to parts they are attached to, increasing the floor of breakage. The system can still allow for autostrut for advanced players who still desire it (e.g., if building vehicles that have parts stacked and clipped into each other for aesthetic purposes) while not making it necessary for players who do not play in such ways.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022600\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1039965578754007060/1126367603028402206/image.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis new system should provide the following benefits:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nJoint stress does not result in microdeflections or deforming that can cascade into bigger problems, lessening the learning curve for new players by avoiding situations where their rocket breaks apart for no reason.\n\u003C/li\u003E\n\u003Cli\u003E\nJoint stress is now a very easily quantifiable concept as it is a single part stat that can be exposed to the more engineering-oriented player rather than something that needs to be simulated in the game.\n\u003C/li\u003E\n\u003Cli\u003E\nPlayers who are less technically-minded or experienced and rely more on trial and error receive clearer and better feedback in flight on weak structural joints of their rocket, and can better identify and correct them.\n\u003C/li\u003E\n\u003Cli\u003E\nAudio feedback now adds a new dimension of atmosphere and feedback for players, especially if the the player is in a situation where they don\u0027t have a clear view of their entire craft (e.g., in IVA).\n\u003C/li\u003E\n\u003Cli\u003E\nRockets will still break up and explode if it is poorly designed or if its structural considerations were under-specced.\n\u003C/li\u003E\n\u003Cli\u003E\nThe system should work both for players who prefer the core Kerbal tone of exaggerated comedic mishaps (we can still watch Fleas fly around like fireworks), while being tweakable enough for modded players to depict these kinds of failures more conservatively.\n\u003C/li\u003E\n\u003Cli\u003E\nJoint simulation has been simplified making it less expensive to simulate and overall improving performance of the game especially for extremely large craft.\n\u003C/li\u003E\n\u003Cli\u003E\nWatching a rocket shake itself apart will probably be its own special form of joy.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nAs a bonus, for advanced players, when compared to spring yjoints the proposed static joint system should be simple enough (at least for my amateur non-programmer brain) where new analysis tools in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E can be added. This will not only add depth to the game for those looking to endlessly tweak their designs, but also can expand the potential of Kerbal Space Program as a STEM educational game by providing an approximation of static linear truss analysis, a concept very common across all areas of mechanical and aerospace engineering. Below is a simple sketch of how this approximated system can be presented to the player:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wobbly_rockets_3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.25\u0022 height=\u0022807\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1039965578754007060/1126376945484042310/wobbly_rockets_3.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt is also possible with this model to apply a simplified model of stress/strain, where increased stress does not directly break parts but slowly fills a \u0022strain\u0022 stat. More stress fills the stat faster, and when the stat reaches a maximum threshold the joint breaks. Increased strain could then be tied to a random deflection transform to represent the deformation of the joint.\n\u003C/p\u003E\n\u003Cp\u003E\nIn conclusion I think shifting to this static joints system in lieu of the spring joint system currently implemented in both games will be an improvement in terms of a gameplay, aesthetic, and programming/performance overhead perspective. While again I\u0027ll give the disclaimer that I am not a game designer nor do I have any specific training, I think that at the very least peeling back the layers on why a feature feels needed or otherwise can lend itself to insight on new avenues for gameplay design solutions.\n\u003C/p\u003E\n\u003Cp\u003E\nclickbait title: top 5 reasons how wobbly rockets torched my crops and poisoned my water (you will not believe #2)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-06T14:00:06Z\u0022 title=\u002207/06/2023 02:00  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 6, 2023\u003C/time\u003E by Kavaeric\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Toastie","CreatedById":229796,"CreatedDateTime":"2023-07-06T06:07:48Z","Content":"\n\u003Cp\u003E\nI think this is pretty epic and amazing.\n\u003C/p\u003E\n"},{"CreatedByName":"AzuryxxVORTEX","CreatedById":229641,"CreatedDateTime":"2023-07-06T07:03:08Z","Content":"\n\u003Cp\u003E\nI do agree, this sounds quite interesting! \n\u003C/p\u003E\n\u003Cp\u003E\n1. It destroys the need for wobbly rockets to have silly ksp momentos\n\u003C/p\u003E\n\u003Cp\u003E\n2. It brings KSP2 closer to the cinematic\u0027s mechanics- Which is quite frankly very cool. \n\u003C/p\u003E\n\u003Cp\u003E\n3. Adds a bit of realism and \u0022immersion\u0022 whilst still staying in the theme of KSP\n\u003C/p\u003E\n\u003Cp\u003E\nAnd overall, if you fly well, you won\u0027t be victim of it. So, it\u0027s a win-\n\u003C/p\u003E\n\u003Cp\u003E\nReally hoping to see this go up, it\u0027s a well thought idea. \n\u003C/p\u003E\n"},{"CreatedByName":"Starseeker","CreatedById":146175,"CreatedDateTime":"2023-07-06T07:50:10Z","Content":"\n\u003Cp\u003E\nA very solid proposal - the stress-calc visualization would definitely be helpful! One thing that\u0027d have to be kept in mind is how the simulation would know which engines should be considered as applying force, though that could probably be pretty easily done using a selector that tells it \u0022calculate for stage X\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"S1lenced7","CreatedById":229751,"CreatedDateTime":"2023-07-06T07:56:02Z","Content":"\n\u003Cp\u003E\nThis is very close to what I had in mind, however you’ve put it into words very well and went above and beyond with the illustrations.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the type of system I’d choose over springy joints\n\u003C/p\u003E\n"},{"CreatedByName":"Lyneira","CreatedById":149515,"CreatedDateTime":"2023-07-06T07:59:20Z","Content":"\n\u003Cp\u003E\nThank you for this great write-up! I\u0027m especially interested in the proposals for presenting part stress information better in the parts catalogue, \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E and through visual and audio cues. Regarding performance, I do wonder how much can really be gained since to calculate stress on each joint, you still need to propagate forces from impacts, wheels, drag and thrust throughout the vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll also reiterate my desire here for such a system to allow for parts to be connected in loops, allowing rectangles, triangles, toruses etc to be built much more stable (to share stresses over multiple joints) and for true multi-docking port connections between vessels. It might even be a necessity to enable players to build structurally sound vessels when going ambitious.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-06T08:25:40Z\u0022 title=\u002207/06/2023 08:25  AM\u0022 data-short=\u00221 yr\u0022\u003EJuly 6, 2023\u003C/time\u003E by Lyneira\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"S_Coriolis","CreatedById":226711,"CreatedDateTime":"2023-07-06T13:14:38Z","Content":"\n\u003Cp\u003E\nI think that would be fantastic, the rocket keeps heading in the direction you want, the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E will struggle less AND you still get the explosion after a cinematic vibration after doing things you shouldn\u0027t.\u003Cbr\u003E\n\u003Cbr\u003E\nWe need a voting system for suggestion so that goes to the top !\n\u003C/p\u003E\n"},{"CreatedByName":"Datau03","CreatedById":223270,"CreatedDateTime":"2023-07-06T13:18:37Z","Content":"\n\u003Cp\u003E\nI like the idea and this is very well written! Maybe they could add parts which can flex a little but have a higher maximum stress before breaking, for example special radial decouplers, but they should only be optional\n\u003C/p\u003E\n"},{"CreatedByName":"Skitles","CreatedById":229461,"CreatedDateTime":"2023-07-06T13:42:00Z","Content":"\n\u003Cp\u003E\nHi!\n\u003C/p\u003E\n\u003Cp\u003E\nI think it is worth concidering the paragraph after your quote:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:13px;\u0022\u003EAs a person who has dive-bombed more than one physics meeting with an exasperated \u0022can’t we just make the joints stiffer\u0022 comment, let me assure you that in true KSP fashion, this is not a problem with a simple remedy. We’ve got very capable people on the case, and we will arrive at a good solution\u003C/span\u003E\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:13px;\u0022\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(On mobile and don’t know how to include the link…) \n\u003C/p\u003E\n\u003Cp\u003E\nIt is worth considering how you calculate stress in a static linear truss system, and how it is calculated with computer software, as Nate mentioned increasing stiffness is not going to solve the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nThe main equation used for these calculations is hookes law: (highly simplified)\n\u003C/p\u003E\n\u003Cp\u003E\nFor a spring it is:\n\u003C/p\u003E\n\u003Cp\u003E\nForce = Stiffness * deformation\n\u003C/p\u003E\n\u003Cp\u003E\nThis can also be used for calculating stress in a static linear system as:\n\u003C/p\u003E\n\u003Cp\u003E\nStress = E * Strain (E is the linear stiffness of the truss, or just the stiffness factor)\n\u003C/p\u003E\n\u003Cp\u003E\n(Strain is the change in deformation, and what causes the wobble)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe softwares work by calculating the total deformation (strain) of every part of the rocket, and from that calculate the total stress.\n\u003C/p\u003E\n\u003Cp\u003E\nif we were to say that no deformation is allowed, (no wobblyness) calculating the stress would not be possible, as the deformation (strain) is defined as 0.\n\u003C/p\u003E\n\u003Cp\u003E\nso when you calculate the stress the equation looks like this for a joint in a rigid system:\n\u003C/p\u003E\n\u003Cp\u003E\nStress = E * deformation \u003Cbr\u003E\ndeformation = 0 \n\u003C/p\u003E\n\u003Cp\u003E\nStress = E*0=0\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nNow since we are working in a 3D space, you are calculating the deformations in all directions, so it could be possible to say that deformations in X and Y is not allowed, but Z is allowed, allowing stress to be calculated.\n\u003C/p\u003E\n\u003Cp\u003E\n(stress would be significantly higher in the Z direction in this case as it now needs to cover the stress in X and Y, and could be harder to calculate for the software than allowing deformations in all directions)\n\u003C/p\u003E\n\u003Cp\u003E\nHope this is understandable as I wrote it on a mobile, but the short version is that calculating the stress on a system that is fully rigid as you proposed is likely going to require a full re-write of the physics engine, and going away from the standard method today as it currently is not possible. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sylvi Fisthaug","CreatedById":228381,"CreatedDateTime":"2023-07-06T13:54:52Z","Content":"\n\u003Cp\u003E\nKav for president \u003Cimg alt=\u0022:purpleheart:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/purple-heart_1f49c.png\u0022 title=\u0022:purpleheart:\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"whatsEJstandfor","CreatedById":220814,"CreatedDateTime":"2023-07-06T16:44:21Z","Content":"\n\u003Cp\u003E\nObvs, I agree with every single thing in this post. You\u0027re a hero for laying it out so thoroughly and convincingly. The idea of being able to do a static analysis and show the user where the weak points are is simply chef\u0027s kiss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E \u003C/span\u003E \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224300243\u0022 data-ipsquote-contentid=\u0022218238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221688650920\u0022 data-ipsquote-userid=\u0022229461\u0022 data-ipsquote-username=\u0022Skitles\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Skitles said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe softwares work by calculating the total deformation (strain) of every part of the rocket, and from that calculate the total stress.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAre you sure that\u0027s how the calculation is done in KSP? That sounds backwards to my intuition; it seems like stress should be computed first, and strain then computed based on that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-06T17:22:32Z\u0022 title=\u002207/06/2023 05:22  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 6, 2023\u003C/time\u003E by whatsEJstandfor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skitles","CreatedById":229461,"CreatedDateTime":"2023-07-06T18:32:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224300288\u0022 data-ipsquote-contentid=\u0022218238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221688661861\u0022 data-ipsquote-userid=\u0022220814\u0022 data-ipsquote-username=\u0022whatsEJstandfor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, whatsEJstandfor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nObvs, I agree with every single thing in this post. You\u0027re a hero for laying it out so thoroughly and convincingly. The idea of being able to do a static analysis and show the user where the weak points are is simply chef\u0027s kiss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E \u003C/span\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAre you sure that\u0027s how the calculation is done in KSP? That sounds backwards to my intuition; it seems like stress should be computed first, and strain then computed based on that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHi!\n\u003C/p\u003E\n\u003Cp\u003E\nI am not sure that this is how KSP runs the simulations. That is up to the devs to say.\n\u003C/p\u003E\n\u003Cp\u003E\nI do work with FEM simulations, and it would be a smart way to include every ”element” (evey single part of the rocket), vector loads, (engines etc) and other physics (heat, air resistance etc) into one single complex mathematical differential equation  to solve. And calculating the strain (deformations) from all applied physical affects is the ”standard” solid mechanics way of doing it.\n\u003C/p\u003E\n\u003Cp\u003E\nyou can easily calculate stress, entire model deformations, etc from the strain. If you solve for stress you would need to back-track the solution to find strain-dependent properties. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow most of the reason FEM solves the strain and not stress is not relevant to KSP, as you say. But there is a LOT more material, knowledge and help available if you use an already developed method for this type of calculation and why i belive this is (to some degree) how they run the physics simulation. \n\u003C/p\u003E\n"},{"CreatedByName":"Kavaeric","CreatedById":107109,"CreatedDateTime":"2023-07-06T20:58:58Z","Content":"\n\u003Cp\u003E\nHi all, thanks for the feedback. I chatted with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/220814-whatsejstandfor/?do=hovercard\u0022 data-mentionid=\u0022220814\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/220814-whatsejstandfor/\u0022 rel=\u0022\u0022\u003E@whatsEJstandfor\u003C/a\u003E on Discord and while this is jumping ahead, some thoughts on how to integrate strut placement into the static/rigid joints model.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022111.75\u0022 height=\u00221200\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1039965578754007060/1126617834353598504/image.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe also briefly mentioned other games to take precedent from: PolyBridge is the most famous contemporary example, but folks might remember playing West Point Bridge Designer or Pontifex. It was what suggested to me that much of the performance overhead of larger vehicles in KSP(2) is from the spring joint simulation, and that moving to a more static physics implementation would accomplish much the same thing while being much more performant.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-06T21:06:15Z\u0022 title=\u002207/06/2023 09:06  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 6, 2023\u003C/time\u003E by Kavaeric\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sea_Kerman","CreatedById":226149,"CreatedDateTime":"2023-07-07T08:18:26Z","Content":"\n\u003Cp\u003E\nI think that the actual geometric placement of the struts should matter, in that making triangles and trusses is good.\n\u003C/p\u003E\n"},{"CreatedByName":"Lowi_Sace","CreatedById":224820,"CreatedDateTime":"2023-07-07T09:43:33Z","Content":"\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EI hope the devs see this point because it sounds like a great solution. A real rocked does also not flex. For scenarios where some flex is expected (for example whings) the part itself could have some flex and not the joint. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EA simple stress/strain model would also add challenge and fun failures to the game. Could also be implemented in the game modes the game already provides (easy, medium, hard). Could be indicated with a bar similar to the heath damage in KSP1. Also some kind of simple animation (like in the trailer) would be very cool. Giving the player in advance a indication that something is not going well.  \u003C/span\u003E\u003Cspan lang=\u0022en-us\u0022 style=\u0022font-size:11pt;\u0022 xml:lang=\u0022en-us\u0022\u003EFollowed by joints breaking, losing control and the rocked falling apart due to high forced \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EIn case of boosters I always found struts very ugly. Would like if the devs would include a easy method for detaching an booster with multiple radial decouplers (like in on top and on bottom)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Clóvis","CreatedById":229686,"CreatedDateTime":"2023-07-07T23:58:14Z","Content":"\n\u003Cp\u003E\nI don\u0027t know if thats is possible to be implemented as is, but seems like a good start for the devs to think in a less anachronistic more reasonable way to solve the wobbly problem at hand.\u003Cbr\u003E\nI hope the devs get to see this and take  at least an inspirations about what to do.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"dr.phees","CreatedById":32383,"CreatedDateTime":"2023-07-11T16:39:48Z","Content":"\n\u003Cdiv\u003E\n\u003Cp\u003E\nIf the devs want to keep the wobbly rockets, there should be a toggleable, researchable node, that makes connections much stiffer. Maybe even two nodes? Stiff and Very Stiff?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy not integrate it into the science development, research tree? All discussions are over, and everyone can finally be happy.\n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"AngryBaer","CreatedById":227014,"CreatedDateTime":"2023-07-12T03:21:54Z","Content":"\n\u003Cp\u003E\nI find some small amount of flexing helps give a feeling for how heavy a craft is. If you\u0027ve ever looked out the window while flying in an airplane it\u0027s often surprising how much the wings bend. It makes sense because they were built for that purpose, rocket stacks perhaps not so much. So a lot of this would have to include some kind of material science for each part. I think poorly built wobbly rockets should just tear themselves apart violently much quicker instead of turning into noodles. Or perhaps stay connected just long enough to be funny before failing.\n\u003C/p\u003E\n"},{"CreatedByName":"Lyneira","CreatedById":149515,"CreatedDateTime":"2023-07-13T09:25:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224301573\u0022 data-ipsquote-contentid=\u0022218238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221689093588\u0022 data-ipsquote-userid=\u002232383\u0022 data-ipsquote-username=\u0022dr.phees\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/11/2023 at 6:39 PM, dr.phees said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf the devs want to keep the wobbly rockets, there should be a toggleable, researchable node, that makes connections much stiffer. Maybe even two nodes? Stiff and Very Stiff?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy not integrate it into the science development, research tree? All discussions are over, and everyone can finally be happy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is not a solution because in sandbox mode it is effectively the same as the current hack of increasing joint stiffness in the config file. The developers have already said that raising joint stiffness alone is not an acceptable solution. Further, when it comes to science and exploration mode, now an identical vessel can behave differently from game to game based on what technology you happen to have unlocked. This adds pitfalls for both players and developers alike when sharing vessels and/or bug reports. Anything is better than inconsistent vessel behaviour.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-13T09:27:46Z\u0022 title=\u002207/13/2023 09:27  AM\u0022 data-short=\u0022Jul 13\u0022\u003EJuly 13, 2023\u003C/time\u003E by Lyneira\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Clóvis","CreatedById":229686,"CreatedDateTime":"2023-07-14T11:26:37Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/32383-drphees/?do=hovercard\u0022 data-mentionid=\u002232383\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/32383-drphees/\u0022 rel=\u0022\u0022\u003E@dr.phees\u003C/a\u003E I stand for what i said before:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224299065\u0022 data-ipsquote-contentid=\u0022214159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221688236977\u0022 data-ipsquote-userid=\u0022229686\u0022 data-ipsquote-username=\u0022Clóvis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/1/2023 at 3:42 PM, Clóvis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWobbly rockets are not fun and should be removed. That said, if wobbliness is to become a feature it needs to be reliable and controllable, and not an wild stupid random thing that is only there for annoying reasons and to impede you to make the rockets you want. I mean, if wobble is feedback for a too long rocket, or a poorly designed aerodynamics, or you forgot to configure the stage and one of the four planned thrusters didn\u0027t ignite, or if you misaligned something something, if its used as feedback for something useful that is bad if you do with an rocket and its possible to understand and avoid it from happening because there is a physical based gameplay plan for it to be happening the way it happens I think is acceptable to have it in the game, and even could be a fun opportunity for game youtubers to generate content. But the way it works now its just frustrating and time consuming, making planning a rocket not as fun as it could be.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut as a complement I will add that wobble as a feature could also be used like: you messed up your ship and it should already have exploded, but, I will let it wobble a bit before i destroy it because I\u0027m a tolerant game to player\u0027s messy stuff...\n\u003C/p\u003E\n"},{"CreatedByName":"dr.phees","CreatedById":32383,"CreatedDateTime":"2023-07-14T21:55:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224302392\u0022 data-ipsquote-contentid=\u0022218238\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221689333997\u0022 data-ipsquote-userid=\u0022229686\u0022 data-ipsquote-username=\u0022Clóvis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Clóvis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut as a complement I will add that wobble as a feature could also be used like: you messed up your ship and it should already have exploded, but, I will let it wobble a bit before i destroy it because I\u0027m a tolerant game to player\u0027s messy stuff...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like that.\n\u003C/p\u003E\n"},{"CreatedByName":"RocketRockington","CreatedById":223189,"CreatedDateTime":"2023-07-15T10:26:53Z","Content":"\n\u003Cp\u003E\nLove the suggestion.  I proposed the same thing elsewhere.  Unfortunately, I think that the KSP2 team has decided against this sort of thing - because (and no offense here) it\u0027s very obvious idea if you wanted to not use spring-system joints.  My feeling is that the KSP2 team would already have thought of this and discarded it because they wanted the lol-Kerbal Wobble effect, and we\u0027re going to be stuck with some form of it forever.  The fact that some players can\u0027t wrap their head around change too and argue for wobble just reinforces to them that \u0027hey, maybe it\u0027s a controversial idea, so why put the effort into changing\u0027.  Unfortunate. I think there\u0027d be more gameplay to tuning a well designed Polybridge/bridge builder based strength system than the current system where all the joints are essentially the same strength and the only option the player has is to slap more struts onto the craft. \n\u003C/p\u003E\n"},{"CreatedByName":"Clóvis","CreatedById":229686,"CreatedDateTime":"2023-07-15T15:01:07Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/223189-rocketrockington/?do=hovercard\u0022 data-mentionid=\u0022223189\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/223189-rocketrockington/\u0022 rel=\u0022\u0022\u003E@RocketRockington\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYour guess is as good as mine, but I\u0027m not sure if this is necessarily the case.\u003Cbr\u003E\nMaking a game is a complex endeavor and the team might have to prioritize other systems instead of wobble. I say this because of the released info we have of the development.\u003Cbr\u003E\nThe develop team have a more advanced build in wich there are already advanced systems like colonization and probably science, interstellar stuff and things we don\u0027t know about.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, the wobble might be a complex programming problem they are not sure is a priority to them or the community, besides an strong vocal minority.\n\u003C/p\u003E\n\u003Cp\u003E\nWe also don\u0027t really know how much marketing and corporate stuff have a say in this systems and if they believe wobble is considered an strong brand characteristic for the game.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIf my guess is correct, they might be waiting to understand if wobble is really something they want to change to improve the game or the marketability of the game, or if there is another priority that might bring a more successful. Also, wobble, although very annoying for a share of the community, isn\u0027t really game breaking. The recently patched \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E trajectory bug was way worse than wobble.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the develop team are really exploring a way to solve this matter, but I\u0027m sure there are more pressing things to be looked at. So, don\u0027t loose hope yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-15T15:01:59Z\u0022 title=\u002207/15/2023 03:01  PM\u0022 data-short=\u0022Jul 15\u0022\u003EJuly 15, 2023\u003C/time\u003E by Clóvis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DoCDoC","CreatedById":229939,"CreatedDateTime":"2023-07-16T01:56:03Z","Content":"\n\u003Cp\u003E\nA bit wobbly is fine, I understand that the dev\u0027s strongly believe that it is in the DNA and for a small part I agree , but maybe it should be adjustable by the users in settings. I for one think it is still a huge negative to the game and a part of the reason for many negative steam reviews.\n\u003C/p\u003E\n"},{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-07-17T19:25:12Z","Content":"\n\u003Cp\u003E\nI thought how improve situation with wobbly rockets, but save wobbles as some feature. Wobbles could happen only after crossing a certain level of detail stress where spring physics will turn on. It would look like your craft start to deformate after huge stress. So with this solution wobble begins almost only in situation when craft certainly will be damaged by heavy stress, but with wobble it will look like more gorgeous\n\u003C/p\u003E\n"}]}