{"TopicId":218489,"ForumId":119,"TopicTitle":"How do struts even strut?","CreatedByName":"mrjsonkerbal","CreatedById":228707,"CreatedDateTime":"2023-07-18T21:50:07Z","PageNum":1,"Articles":[{"CreatedByName":"mrjsonkerbal","CreatedById":228707,"CreatedDateTime":"2023-07-18T21:50:07Z","Content":"\n\u003Cp\u003E\nhey, i started strutting the hell out of my rockets to get them to work and i\u0027ve done duna and back a few times now so i\u0027m onto eve. I want to land on eve, and the info I\u0027ve gathered is it\u0027s going to be tough. So I watched some youtubes, and it appears that I need a ridiculously high delta-v lander/launcher.\n\u003C/p\u003E\n\u003Cp\u003E\nI give you eve thumper 1: \u003Ca href=\u0022https://imgur.com/a/BlzfDHu\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/BlzfDHu\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nmy question relates to the top of the craft, which is an onion-skin type setup so i can use all those engines to push off of eve\u0027s strong gravity when i get there. BUT. In testing, my copious struts keep disappearing. If you follow along the imgur pics, \u003Ca href=\u0022https://imgur.com/a/BlzfDHu\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/BlzfDHu\u003C/a\u003E you\u0027ll see the stages, but when I hit that last stage, the lander, in the last screenshot it\u0027s a little hard to tell but all of my struts are gone. To keep the whole rocket from wobbling, I have strutted it heavily. But it seems that firing the decoupler for that last stage to get the lander by itself (e.g. here I was going to test land it on kerbin) eliminates all of the struts across the lander, so it becomes an unusable wobbly rocket and breaks apart too easily.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is the trick/rule to keeping struts from all vaporizing? I DO have struts that cross across the decoupler. I have to, otherwise the whole setup is too wobbly. So what\u0027s the right approach to making sure only the struts that make sense to break when i decouple, vs. ALL of the ones on the lander breaking at once?\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s obvious I don\u0027t understand strutting or how to build rockets please do tell me what is a good approach, or point me at documentation. Frustrated  there aren\u0027t any tutorials on strutting ksp2 rockets built in since it\u0027s so fundamental to getting anything big off the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso I do like how ludicrously amazing my rocket looks please don\u0027t tell me its not a good way to do things. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nShould have credited the youtube person I got the rocket inspiration from: \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/PO7cNaMSPK4?feature=oembed\u0022 title=\u0022KSP2 - Eve return mission\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-18T21:52:09Z\u0022 title=\u002207/18/2023 09:52  PM\u0022 data-short=\u0022Jul 18\u0022\u003EJuly 18, 2023\u003C/time\u003E by mrjsonkerbal\u003C/strong\u003E\n\u003Cbr\u003Ebetter imgur link with more pics\n\u003C/span\u003E\n"}]}