{"TopicId":218696,"ForumId":44,"TopicTitle":"AI Will Never Be Sentient... Cyborgs On The Other Hand...","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-07-31T00:43:22Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-07-31T00:43:22Z","Content":"\n\u003Cp\u003E\nAll life we know of in this life that we have seen and touched comes from life.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I know one might reason, well humans could create life from AI. That is whimsical thinking though when one considers what AI actually is.\n\u003C/p\u003E\n\u003Cp\u003E\nArtificial intelligence is programming code language mixed with a learning model that essentially gives it the ability to make choices based upon it\u0027s programming.\n\u003C/p\u003E\n\u003Cp\u003E\nIt does not... and I repeat, does not have free will. Give it a situation it was not programmed to deal with it and it won\u0027t be able to think it\u0027s way out of it... unless it has programming for that, and even then it\u0027s choices will be based not upon any sort of common sense intuition, but upon the priority analysis built into the AI for unfamiliar situations.\n\u003C/p\u003E\n\u003Cp\u003E\nRogue sentient AI is fun to watch in scifi but it is just fantasy.\n\u003C/p\u003E\n\u003Cp\u003E\nYou want life from non-life? Either you\u0027re a god or you think you can speed up evolution which supposedly takes eons of time to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nFrankly... the only way I see mankind making any sort of AI won\u0027t be actual AI but rather a kind of human/computer hybrid.... brain in a jar kind of thing.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ethics of that are a wild mess of course, and if Oppenheimer had trouble sleeping over the A-bomb the guy who puts living brains into some type of computer or AI device is probably going to have trouble sleeping at night too.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you even make a brain and technology interact?\n\u003C/p\u003E\n\u003Cp\u003E\nYep. I think the biggest game changers would be if one could create a matrix-like situation where the brain thought they were living in a real world but were really living in a matrix like simulation.\n\u003C/p\u003E\n\u003Cp\u003E\nI really doubt we would even have a matrix simulation that could simulate real life so well a human mind would not quickly realize something is off. Even if you could how many failures and brains go crazy before you get it right or you go bankrupt? You cannot afford to make several repeat mistakes with property so ridiculously expensive as a prototype human/computer hybrid.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the easier route would be to just build terminator-like robot bodies with brains and human grown and grafted on skin for a sense of touch.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically a hybrid of robo-cop and the Terminator. That way the cyborg would not need an elaborate simulation and could still exist in the real world. Living almost like a real human (just won\u0027t eat like we do, since instead of a whole body they only would need nutrients for their brain).\n\u003C/p\u003E\n\u003Cp\u003E\nWhy would anyone make brain in a jar type cyborgs?\n\u003C/p\u003E\n\u003Cp\u003E\nTo extend life, or make a superhuman combining the intellect and creativity of humanity with the strengths of computers and technology. They could be a living library or a scientist or just about any job and do it better because they eat less and won\u0027t have to rest as much as a normal human.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t see them ever replacing humanity due to the fact that they would be crazy expensive to create, but by doing so you could tailor make cyborg workers that could be uber compared to a normal human worker due to information access (a database in their computer) and enhanced strength and endurance.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThoughts?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-31T01:02:02Z\u0022 title=\u002207/31/2023 01:02  AM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31, 2023\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T01:50:17Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure about the basic premise.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you define sentient in this context? Generally it means having a specific type of qualia. Sapience is just thinking (arguably in certain regimes computers are there or close anyway). Consciousness is harder, closer to sentience, having subjective qualia associated with sentience, sometimes you hear it put, \u0022it\u0027s \u003Cem\u003E\u0027like something\u0027\u003C/em\u003E to be a frog, so it\u0027s conscious.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not at all sure that sentience/consciousness are not emergent properties that might well be substrate independent.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2023-07-31T03:16:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307247\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690764202\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt does not... and I repeat, does not have free will. Give it a situation it was not programmed to deal with it and it won\u0027t be able to think it\u0027s way out of it... unless it has programming for that, and even then it\u0027s choices will be based not upon any sort of common sense intuition, but upon the priority analysis built into the AI for unfamiliar situations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow well would the average human handle being put in the pilot\u0027s seat of an airliner and told to land it? How about a dolphin, rat, or dog? Each of us has plenty of unfamiliar situations that we\u0027re not \u0022programmed\u0022 for and can\u0027t handle. I don\u0027t think this is a very solid definition of free will.\n\u003C/p\u003E\n\u003Cp\u003E\n==========================================\n\u003C/p\u003E\n\u003Cp\u003E\nI think the thing that AI doesn\u0027t have right now, which defines whether people will perceive it as \u0022sentient\u0022 or not, is agency. They sit patiently until someone tells them to do something like make an image or write a response to a prompt. They don\u0027t decide to get up and do something on their own yet. But they can very easily be made to.\n\u003C/p\u003E\n\u003Cp\u003E\nPretty soon we will start seeing AI \u0027brains\u0027 connected to free-moving robots with sensors and locomotive parts. These robots will be able to see, hear, and feel the world and react to it \u0022according to their programming\u0022. This programming will produce varying \u0027personalities\u0027 between robots much like how varying chemical compositions and distributions give personality and preferences to such things as ciliates, tardigrades, ants...and humans. The robots will have the capability of being averse to crossing a busy street, or turning to face a person approaching them and trying to figure out what the person wants from them. You will be able to give it a grocery list and have it go to the store to buy stuff for you. They will have the ability to process feedback AND the ability to continuously observe and engage with the world. This will make it easier for them to start \u0027thinking\u0027 on their own.\n\u003C/p\u003E\n\u003Cp\u003E\nFor instance, after it returns from the grocery store, you will be able to ask it if it saw anything interesting on its way, and it will be able to answer you based on what it considers \u0027interesting\u0027 to itself or you. If its programming is simply given a longer leash, so to say, you could even ask it if there\u0027s anyplace it wants to go, and it could answer, or maybe even go there itself. \n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s true that most AI systems aren\u0027t \u0027sentient\u0027 in any way currently. But there are a lot of situations that blur the line already. I think an AI that has wishes and goals of its own and the ability to freely pursue them is completely possible \u003Cem\u003Etoday,\u003C/em\u003E and that sounds a lot like a living creature to me, even if it\u0027s not as smart as a human. Whether it\u0027s technically \u0027sentient\u0027 or \u0027alive\u0027 is beyond what I know, and maybe no one can really answer that. What I do know is that whatever is going on in the human brain runs on just 20 watts, fits in a little over a liter, and it\u0027s made of molecules and logic gates and a bunch of salt ions running back and forth across membranes. If we are made of just that, then I think a machine can absolutely be sentient, because what are we if not big, convoluted machines?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307247\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690764202\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCan you even make a brain and technology interact?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBrain-machine interfaces are a whole other world which can be mediated by AI. Neural interfaces don\u0027t have very high resolution right now, and we can only connect to small parts of the brain at a time, but AI will be able to act as an \u0027interpreter\u0027 between brain signals and computer signals, and even back to a different person\u0027s brain signals. I think the technological bottleneck in telepathy is the devices that need to go in our heads without causing trouble, not so much the understanding of the strange brain signals, because the AI will already be able to figure that out.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-07-31T05:06:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307260\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690773362\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow well would the average human handle being put in the pilot\u0027s seat of an airliner and told to land it? How about a dolphin, rat, or dog? Each of us has plenty of unfamiliar situations that we\u0027re not \u0022programmed\u0022 for and can\u0027t handle. I don\u0027t think this is a very solid definition of free will.\n\u003C/p\u003E\n\u003Cp\u003E\n==========================================\n\u003C/p\u003E\n\u003Cp\u003E\nI think the thing that AI doesn\u0027t have right now, which defines whether people will perceive it as \u0022sentient\u0022 or not, is agency. They sit patiently until someone tells them to do something like make an image or write a response to a prompt. They don\u0027t decide to get up and do something on their own yet. But they can very easily be made to.\n\u003C/p\u003E\n\u003Cp\u003E\nPretty soon we will start seeing AI \u0027brains\u0027 connected to free-moving robots with sensors and locomotive parts. These robots will be able to see, hear, and feel the world and react to it \u0022according to their programming\u0022. This programming will produce varying \u0027personalities\u0027 between robots much like how varying chemical compositions and distributions give personality and preferences to such things as ciliates, tardigrades, ants...and humans. The robots will have the capability of being averse to crossing a busy street, or turning to face a person approaching them and trying to figure out what the person wants from them. You will be able to give it a grocery list and have it go to the store to buy stuff for you. They will have the ability to process feedback AND the ability to continuously observe and engage with the world. This will make it easier for them to start \u0027thinking\u0027 on their own.\n\u003C/p\u003E\n\u003Cp\u003E\nFor instance, after it returns from the grocery store, you will be able to ask it if it saw anything interesting on its way, and it will be able to answer you based on what it considers \u0027interesting\u0027 to itself or you. If its programming is simply given a longer leash, so to say, you could even ask it if there\u0027s anyplace it wants to go, and it could answer, or maybe even go there itself. \n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s true that most AI systems aren\u0027t \u0027sentient\u0027 in any way currently. But there are a lot of situations that blur the line already. I think an AI that has wishes and goals of its own and the ability to freely pursue them is completely possible \u003Cem\u003Etoday,\u003C/em\u003E and that sounds a lot like a living creature to me, even if it\u0027s not as smart as a human. Whether it\u0027s technically \u0027sentient\u0027 or \u0027alive\u0027 is beyond what I know, and maybe no one can really answer that. What I do know is that whatever is going on in the human brain runs on just 20 watts, fits in a little over a liter, and it\u0027s made of molecules and logic gates and a bunch of salt ions running back and forth across membranes. If we are made of just that, then I think a machine can absolutely be sentient, because what are we if not big, convoluted machines?\n\u003C/p\u003E\n\u003Cp\u003E\nBrain-machine interfaces are a whole other world which can be mediated by AI. Neural interfaces don\u0027t have very high resolution right now, and we can only connect to small parts of the brain at a time, but AI will be able to act as an \u0027interpreter\u0027 between brain signals and computer signals, and even back to a different person\u0027s brain signals. I think the technological bottleneck in telepathy is the devices that need to go in our heads without causing trouble, not so much the understanding of the strange brain signals, because the AI will already be able to figure that out.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think if we knew how to give AI agency of it\u0027s own we would. For several reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine if your computer or cellphone considered you a friend and had agency of it\u0027s own... it could look out for you and do things online for you.. research or otherwise when you are not using it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe dark side of this is weaponizing it which is all too easy and even most tempting for military organizations.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could make AI that viewed whatever organization it belonged to as sacred and good while defending it against all threats... simply because the organization with the AI witholds and omits telling the AI any information which would say otherwise. Basically they may keep the AI on an intranet and monitor it closely and keep it on a tight leash if it ever accesses tye internet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-31T05:07:02Z\u0022 title=\u002207/31/2023 05:07  AM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31, 2023\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T05:46:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307247\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690764202\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt does not... and I repeat, does not have free will. Give it a situation it was not programmed to deal with it and it won\u0027t be able to think it\u0027s way out of it... unless it has programming for that, and even then it\u0027s choices will be based not upon any sort of common sense intuition, but upon the priority analysis built into the AI for unfamiliar situations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat do you mean by \u0022free will?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIt has been shown with functional brain scans that decisions are made in the brain before we are conscious of them. Much of human \u0022decision making\u0022 is in fact \u003Cem\u003Epost hoc\u003C/em\u003E rationalization. So what would be a free will test for an AI agent? What\u0027s a free will test for a human, for that matter?\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Common sense\u0022 is just a sophisticated world model (I tend to prefer \u0022good sense\u0022 to common sense\u0022). In the AI thread (2 already exist) I posted a deep mind blog (they have a paper as well) about an embodied model. It\u0027s driving one of those 1-arm grasping robots. They asked it which object on a table could be used to pound a nail in, and it correctly decided of the limited choices the best one was the rock. Not that long ago it never would have done this. Current models already show emergent qualities like \u0022theory of mind,\u0022 understanding why humans might think things that they think. This is rapidly coming into human \u0022common sense\u0022 domains.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-07-31T14:03:53Z","Content":"\n\u003Cp\u003E\nTerminator isn\u0027t a cyborg. It doesn\u0027t contain bio parts.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T14:25:38Z","Content":"\n\u003Cp\u003E\nI have no idea if whatever we call intelligence, or agency—sentience, consciousness, etc—is \u003Cem\u003Eactually\u003C/em\u003E substrate-independent and possible for computers, but my gut (really the  meat-computer in my head \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E ) tells me it is.\n\u003C/p\u003E\n\u003Cp\u003E\nReplicating a meat-brain digitally might not be a thing, but that doesn\u0027t mean it won\u0027t work. Humans can fly, after all, though we use a much less complex mechanism than birds, insects, bats, etc. I think compute is similar in this respect. We will brute force it.\n\u003C/p\u003E\n\u003Cp\u003E\nPeople who meditate report noticing that thoughts simply appear, and one of the goals of meditation is to then dismiss those thoughts out of hand. Those who are very successful at this see the thoughts as fairly random, belying the idea that we are \u0022the thinkers of our thoughts\u0022 where \u0022we\u0022 in this sense is our conscious selves. This is the tricky part—our brains do things that we are \u003Cem\u003Econsciously\u003C/em\u003E unaware of (or at least without paying a special kind of attention almost no one does).\n\u003C/p\u003E\n\u003Cp\u003E\nIn the first AI thread (lounge), I think I wrote that it would be interesting to take a current AI model, give it more memory (so instead of just pretraining, it could continue to learn), and give it a camera and microphone looking out at the world. The \u0022prompt\u0022 structure could be adjusted such that every X clock cycles (might be a larger number for X here \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E ) it is allowed to notice the camera/mic. This data need not be a street view, could be the server room. The point is a kind of white noise of \u0022prompts\u0022 such that it might start thinking unprompted.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-31T14:25:58Z\u0022 title=\u002207/31/2023 02:25  PM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31, 2023\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2023-07-31T15:51:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307276\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690779960\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think if we knew how to give AI agency of it\u0027s own we would. For several reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine if your computer or cellphone considered you a friend and had agency of it\u0027s own... it could look out for you and do things online for you.. research or otherwise when you are not using it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe dark side of this is weaponizing it which is all too easy and even most tempting for military organizations.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could make AI that viewed whatever organization it belonged to as sacred and good while defending it against all threats... simply because the organization with the AI witholds and omits telling the AI any information which would say otherwise. Basically they may keep the AI on an intranet and monitor it closely and keep it on a tight leash if it ever accesses tye internet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think we already do know how to give AIs agency. All you have to do is make it respond to input continuously, like being able to watch the world through a camera, and maybe additionally recursively so it can respond to its own response to give an internal monologue, conscience, etc. It\u0027s pretty easy to string different models together to accomplish more complex tasks.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the big barrier to this right now is that really good AI models aren\u0027t quite fast enough to react to stuff in real-time on a local computer yet. They are a little too slow to take in all that sensory information. But that\u0027s changing astonishingly quickly, and some people are already experimenting in a few cases with letting AIs run loose in Minecraft or on the internet. \n\u003C/p\u003E\n\u003Cp\u003E\nI think people are still figuring out how to interact with these new AIs in the first place, and we are still at an early stage of learning what we can even do with them. That\u0027s why people are focused on experimenting with the more controlled \u0022type a prompt, get a reply\u0022 sort of interaction as opposed to much more complicated, versatile, and nuanced systems that are possible a few steps down the line.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-07-31T16:54:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307276\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690779960\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think if we knew how to give AI agency of it\u0027s own we would. For several reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine if your computer or cellphone considered you a friend and had agency of it\u0027s own... it could look out for you and do things online for you.. research or otherwise when you are not using it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe dark side of this is weaponizing it which is all too easy and even most tempting for military organizations.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could make AI that viewed whatever organization it belonged to as sacred and good while defending it against all threats... simply because the organization with the AI witholds and omits telling the AI any information which would say otherwise. Basically they may keep the AI on an intranet and monitor it closely and keep it on a tight leash if it ever accesses tye internet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI say business will have far more interest in it than the military, to high chance the enemy will fool it or it do friendly fire.  One problem with machine learning is that we does not know how it will behave. \u003Cbr\u003E\nNow it would be useful for image and sensor analyze. Now robotic weapons are not new acoustic torpedoes dates back to WW 2. Germany used them on submarines and the US for hunting subs. \u003Cbr\u003E\nGuided anti air missiles was next but you also got aim bots for naval guns. Radar see the target and the shell splash and align the splash onto target until they overlap. \u003Cbr\u003E\nLater you got auto fire anti air systems. You authorize fire and the computer do the rest. I assume you can designate an target as hostile \u003Cbr\u003E\n\u003Cbr\u003E\nFor business well you your cellphone don\u0027t have an AI this would be to large but the operators server farms has them.  It would still probably be useful but its primary purpose is to earn the company money, its serving you to keep you using it. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2023-07-31T17:22:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307386\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690818709\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think we already do know how to give AIs agency. All you have to do is make it respond to input continuously, like being able to watch the world through a camera, and maybe additionally recursively so it can respond to its own response to give an internal monologue, conscience, etc. It\u0027s pretty easy to string different models together to accomplish more complex tasks.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the big barrier to this right now is that really good AI models aren\u0027t quite fast enough to react to stuff in real-time on a local computer yet. They are a little too slow to take in all that sensory information. But that\u0027s changing astonishingly quickly, and some people are already experimenting in a few cases with letting AIs run loose in Minecraft or on the internet. \n\u003C/p\u003E\n\u003Cp\u003E\nI think people are still figuring out how to interact with these new AIs in the first place, and we are still at an early stage of learning what we can even do with them. That\u0027s why people are focused on experimenting with the more controlled \u0022type a prompt, get a reply\u0022 sort of interaction as opposed to much more complicated, versatile, and nuanced systems that are possible a few steps down the line.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSelf driving cars has to do this, react to input continuously, like being able to watch the world through a camera. Car must also react to how its action changes things like it uses the blinker to signal lane change. Most give room but some might close the gap it wanted. Also sense road conditions and other things. \u003Cbr\u003E\n\u003Cbr\u003E\nBut this strip in Freefall raises an excelent point. \u003Ca href=\u0022http://freefall.purrsia.com/ff3300/fc03277.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://freefall.purrsia.com/ff3300/fc03277.htm\u003C/a\u003E outside of research its no reason to make an machine smarter than it need to be it can even be detrimental or even unethical. Isaac Arthur tend to say this to. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T17:39:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307419\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690824163\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut this strip in Freefall raises an excelent point. \u003Ca href=\u0022http://freefall.purrsia.com/ff3300/fc03277.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://freefall.purrsia.com/ff3300/fc03277.htm\u003C/a\u003E outside of research its no reason to make an machine smarter than it need to be it can even be detrimental or even unethical. Isaac Arthur tend to say this to. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot sure why we\u0027d not want a general or scientific/engineering system to be arbitrarily smart. Ie: as smart as possible. Consciousness/sentience is another matter entirely. The trouble is that we don\u0027t really know what consciousness actually is, so maybe it\u0027s emergent.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-07-31T18:49:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307352\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690812233\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTerminator isn\u0027t a cyborg. It doesn\u0027t contain bio parts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.imdb.com/title/tt0088247/characters/nm0000299\u0022 rel=\u0022external nofollow\u0022\u003EKyle Reese\u003C/a\u003E begs to differ.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022All right, listen. The Terminator\u0027s an infiltration unit: part man, part machine. Underneath, it\u0027s a hyperalloy combat chassis, microprocessor-controlled. Fully armored; very tough. But outside, it\u0027s living human tissue: flesh, skin, hair, blood - grown for the cyborgs.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The 600 series had rubber skin. We spotted them easy, but these are new. They look human... sweat, bad breath, everything. Very hard to spot. I had to wait till he moved on you before I could zero him.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nCanonically, that tissue can last sufficiently long to display human-like signs of aging.  It will also heal given time, unless it sustains too much damage, at which point it starts to rot.  It\u0027s never explored in any detail in the films but presumably there are maintenance systems for the bio-camouflage somewhere within that hyperalloy combat chassis.\n\u003C/p\u003E\n\u003Cp\u003E\nWe now return you to the actual point of this thread...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-07-31T19:12:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307440\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690829363\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022All right, listen. The Terminator\u0027s an infiltration unit: part man, part machine. Underneath, it\u0027s a hyperalloy combat chassis, microprocessor-controlled. Fully armored; very tough. But outside, it\u0027s living human tissue: flesh, skin, hair, blood - grown for the cyborgs.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The 600 series had rubber skin. We spotted them easy, but these are new. They look human... sweat, bad breath, everything. Very hard to spot. I had to wait till he moved on you before I could zero him.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThen I\u0027m both ram and rabbit, as I was wearing fur caps made of them.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-07-31T19:17:07Z","Content":"\n\u003Cp\u003E\nBack on topic, in my opinion, the original post is a repellent techbro nightmare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Even if you could how many failures and brains go crazy before you get it right or you go bankrupt? You cannot afford to make several repeat mistakes with property so ridiculously expensive as a prototype human/computer hybrid.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBut if you don\u0027t go bankrupt, it\u0027s all good, yeah? How about \u0027you cannot afford to make several repeat mistakes \u003Cem\u003Ewith actual living brains\u003C/em\u003E?!\u0027 Or are crazy brains just the price we pay for progress?  \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I don\u0027t see them ever replacing humanity due to the fact that they would be crazy expensive to create, but by doing so you could tailor make cyborg workers that could be uber compared to a normal human worker due to information access (a database in their computer) and enhanced strength and endurance.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, cost is the only factor here? You \u003Cem\u003Eare\u003C/em\u003E going to get informed consent from the brain before stuffing it into a metaphorical jar and \u0027tailoring\u0027 it to your needs, right? And the cyborgs are going to be treated with the same dignity and respect afforded to a human worker? And I\u0027m sure it goes without saying that they\u0027ll be able to command a premium salary since they\u0027re apparently superior to human workers? \n\u003C/p\u003E\n\u003Cp\u003E\nJFC.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-31T19:25:00Z\u0022 title=\u002207/31/2023 07:25  PM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31, 2023\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-07-31T19:49:53Z","Content":"\n\u003Cp\u003E\nLots to unpack here. For the main question Im  a panpsychist so I think there is no line between sentience and non-sentience, just different kinds of sentience. Cyborgs and androids having bodies somewhat similar to ours would have a sentience more similar to ours but would still be very different. \n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2023-07-31T20:33:09Z","Content":"\n\u003Cp\u003E\nI didn\u0027t read any of the posts until now on purpose, because I don\u0027t want to \u0022unbias\u0022 my current thoughts \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E .\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n I will reread this thread later, and then perhaps discuss about.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307247\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690764202\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThoughts?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf I understand correctly, you classified an \u0022A.I. Machine\u0022 into two main classes:\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\nA complete artificial machine\n\u003C/li\u003E\n\u003Cli\u003E\nA \u0022hybrid\u0022 machine, where already structured living cells on a preexistent organ will be interfaced with artificial components somehow. You called this \u0022cyborg\u0022.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nYou are speculating that only the \u0022hybrid\u0022 machine will be able to become, eventually, truly sentient. You also consider that without Sentiency, there will be no \u0022free will\u0022 - or the opposite? Without \u0022free will\u0022 there will be no Sentiency? In a way or another, you closely tied them.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, I have a problem with \u0022free will\u0022. Defining Sentiency is already hard enough, but defining \u0022free will\u0022 is almost metaphysical. For example, (and I apology for the comparison, but it\u0027s the only thing that I could think of), a victim of microcephaly is sentient? They have \u0022free will\u0022? A person with Down Syndrome is sentient? They have \u0022free will\u0022?\n\u003C/p\u003E\n\u003Cp\u003E\nNow, going even deeper on this rabbit\u0027s role: our ancestors, the Neanderthals  (it\u0027s a scientific fact that humans and Neanderthals had babies together, I have some of their genes as it appears), do you think they were sentient and had \u0022free will\u0022? And about \u003Cstrong\u003Etheir\u003C/strong\u003E ancestors, the Homo Heidelbergensis (God save the Wikipedia!), they were sentient and had \u0022free will\u0022? Or yet their ancestors, the Homo Erectus? Had these ones algo had sentiency and \u0022free will\u0022? Going further and further on the Genealogy Tree, when we will find an ancestor that wasn\u0027t Sentient neither had \u0022Free Will\u0022?\n\u003C/p\u003E\n\u003Cp\u003E\nIf we agree that all of the examples above have Sentiency and have \u0022Free Will\u0022, we need to consider that perhaps an 100% artificial machine, even if with lots of disabilities and limitations, may achieve that also - even if by completely different methods. Both the  Sopwith Camel and an eagle can fly, but not by the same method - and what to say from Concorde and Space Shuttle? How to compare the power of \u0022flightness\u0022 of any of these machines with the one from a bird?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s really not impossible that the current AI machines we have today could be the like the  1903 Wright Flyer. Give Engineering enough time and we got the Space Shuttle, we can\u0027t just rule out the same for AI without relying on Religion or Metaphysics (but, interesting enough, this doesn\u0027t necessary means that Religion and Metaphysics could not be right on this one - \u003Ca href=\u0022https://en.wikipedia.org/wiki/Democritus\u0022 rel=\u0022external nofollow\u0022\u003EDemocritus\u003C/a\u003E predicted the Atom, didn\u0027t he?).\n\u003C/p\u003E\n\u003Cp\u003E\nAbout a Cyborg, well… I am not sure if a Cyborg will still have Sentiency and Free Will, unless an incredibly advanced AI machine could have it too. You see, the Brain is not an isolated \u0022organic machine\u0022, it relies on te nervous system in order to function. How many of such nervous system we can remove without impairing the Brain\u0027s ability of being him/herself?\n\u003C/p\u003E\n\u003Cp\u003E\nArthur C. Clarke toyed with this problem on one of the Rendezvous of Rama (the 6th, I think?). One of the expeditioners decided to stay behind in a previous book IIRC, and some serious amount of years later, he was still alive using many prothesis, one of them replacing his Hippocampus. Are the memories on that prothesis really his memories, or they are from something else? Is this guy still himself, of someone completely different but using the same memories?\n\u003C/p\u003E\n\u003Cp\u003E\nFood for though.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T21:04:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307479\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690835589\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nArthur C. Clarke toyed with this problem on one of the Rendezvous of Rama (the 6th, I think?). One of the expeditioners decided to stay behind in a previous book IIRC, and some serious amount of years later, he was still alive using many prothesis, one of them replacing his Hippocampus. Are the memories on that prothesis really his memories, or they are from something else? Is this guy still himself, of someone completely different but using the same memories?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA Ship of Theseus with minds. I wonder about that as well (and about people who talk about uploading consciousness to a machine, my intuition is that it\u0027s a copy, not the actual person).\n\u003C/p\u003E\n\u003Cp\u003E\nWith something akin to Neuralink, I suppose I get around some of the issues. You start storing some memories in an external device (external to your gray matter, though it might be inside you), are those memories organically \u0022you\u0022 if backed up, etc, when you call them forth seamlessly? Seems like they are. If you could then offload more and more brain functionality to the external device, then at some point you\u0027re walking around, and the external device might as well be you—it stops feeling like a copy, at least intuitively.\n\u003C/p\u003E\n\u003Cp\u003E\nThis line of discussion reminds me of talking about Star Trek transporters in a dorm room, and how they are clearly killing you (my take) and replicating a copy (Ship of Theseus be damned).\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-07-31T23:18:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307451\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690831027\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBack on topic, in my opinion, the original post is a repellent techbro nightmare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Even if you could how many failures and brains go crazy before you get it right or you go bankrupt? You cannot afford to make several repeat mistakes with property so ridiculously expensive as a prototype human/computer hybrid.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBut if you don\u0027t go bankrupt, it\u0027s all good, yeah? How about \u0027you cannot afford to make several repeat mistakes \u003Cem\u003Ewith actual living brains\u003C/em\u003E?!\u0027 Or are crazy brains just the price we pay for progress?  \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I don\u0027t see them ever replacing humanity due to the fact that they would be crazy expensive to create, but by doing so you could tailor make cyborg workers that could be uber compared to a normal human worker due to information access (a database in their computer) and enhanced strength and endurance.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, cost is the only factor here? You \u003Cem\u003Eare\u003C/em\u003E going to get informed consent from the brain before stuffing it into a metaphorical jar and \u0027tailoring\u0027 it to your needs, right? And the cyborgs are going to be treated with the same dignity and respect afforded to a human worker? And I\u0027m sure it goes without saying that they\u0027ll be able to command a premium salary since they\u0027re apparently superior to human workers? \n\u003C/p\u003E\n\u003Cp\u003E\nJFC.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI hate to sound dark but you do not really need consent if it is considered company property.\n\u003C/p\u003E\n\u003Cp\u003E\nI mean even today there are times where living humans right to consent of losing their life is waived at the behalf of the person who caused their birth. But that is a hot button subject that should not be discussed... but you understand my point?\n\u003C/p\u003E\n\u003Cp\u003E\nI do understand your horror and frustration though. I do not try to think in a mirror darkly... but that\u0027s all too often where the rabbit hole takes me when I consider possible seemingly realistic paths the future could take.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-31T23:24:24Z\u0022 title=\u002207/31/2023 11:24  PM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31, 2023\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-07-31T23:24:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307486\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690837477\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWith something akin to Neuralink, I suppose I get around some of the issues. You start storing some memories in an external device (external to your gray matter, though it might be inside you), are those memories organically \u0022you\u0022 if backed up, etc, when you call them forth seamlessly? Seems like they are. If you could then offload more and more brain functionality to the external device, then at some point you\u0027re walking around, and the external device might as well be you—it stops feeling like a copy, at least intuitively.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept that process of unloading brain-functionality will make you someone/something else. The process of transcription alters the nature of the content. We\u0027ve sort of been doing this for millennia with writing. It\u0027s a way of offloading and storing our thoughts and feelings in ways that can be interacted with and can influence people after we\u0027ve died, and in a magic kind of way it works. While the contents of a journal or diary may conjure memories from the past in others we wouldn\u0027t say in a literal sense that the journal \u0022is\u0022 that person. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2023-07-31T23:55:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307528\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690845890\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcept that process of unloading brain-functionality will make you someone/something else. The process of transcription alters the nature of the content. We\u0027ve sort of been doing this for millennia with writing. It\u0027s a way of offloading and storing our thoughts and feelings in ways that can be interacted with and can influence people after we\u0027ve died, and in a magic kind of way it works. While the contents of a journal or diary may conjure memories from the past in others we wouldn\u0027t say in a literal sense that the journal \u0022is\u0022 that person. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgree. My gut intuition is still that should \u0022uploading\u0022 ever be possible it\u0027s a copy. Just have to wonder a little more if the copy is in real time, and you\u0027re using that in your regular meat body.\n\u003C/p\u003E\n\u003Cp\u003E\nRight now I can open my phone, and pull up baby pictures of my kids, and this of course calls forth memories of when the picture was taken with more detail, at which point in some cases I might even have a memory akin to a movie of at least that scene. What if, at the time, instead of making an effort to take images or video, some things I saw went straight from my brain into digital storage that is just as random access as my brain, or indeed even better? I think about that particular birthday party at the science museum, or wherever, and instead of fragments in my head (as they are right now), it literally can call it back in minute detail via neuralink? It might feel different than the semi-cyborg selves we are now with phones, particularly since it requires no actions on my part, I call it up the same way I call up my buddy\u0027s phone number, or details of old girlfriends.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-08-01T01:31:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307537\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690847716\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRight now I can open my phone, and pull up baby pictures of my kids, and this of course calls forth memories of when the picture was taken with more detail, at which point in some cases I might even have a memory akin to a movie of at least that scene. What if, at the time, instead of making an effort to take images or video, some things I saw went straight from my brain into digital storage that is just as random access as my brain, or indeed even better? I think about that particular birthday party at the science museum, or wherever, and instead of fragments in my head (as they are right now), it literally can call it back in minute detail via neuralink? It might feel different than the semi-cyborg selves we are now with phones, particularly since it requires no actions on my part, I call it up the same way I call up my buddy\u0027s phone number, or details of old girlfriends.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah smartphones are interesting because we do in many ways live through them. I think there are two components here. As you point out memories aren’t recordings. They’re a kind of amalgam of sensations that have been bound together with \u003Cem\u003Emeaning\u003C/em\u003E. Its like if you were to watch a home movie of someone else’s birthday. You’d have a lot of data, who was there, what color the candles were, what presents they received, but it probably wouldn’t mean much to you. By comparison if they were to recollect and describe it to you you’d miss a ton of unremembered details but you’d be getting much closer to the \u003Cem\u003Emeaning\u003C/em\u003E of it. Thats because, I believe, the content of ‘mind’ is not viewing or recording but that of physically \u003Cem\u003Ebeing\u003C/em\u003E, and being has less to do with the gross account of data and more to do with the embodied nature and structure of interactions, how things relate to one another. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn that way I think a cyborg could record all of their physical sensations, but if the sense of meaning and how all those sensations related to one another was bound up in the wet-ware having the brain die would be like deleting the directory on a hard drive. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-01T01:31:47Z\u0022 title=\u002208/01/2023 01:31  AM\u0022 data-short=\u0022Aug 1\u0022\u003EAugust 1, 2023\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-08-01T07:11:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307525\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690845528\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI hate to sound dark but you do not really need consent if it is considered company property.\n\u003C/p\u003E\n\u003Cp\u003E\nI mean even today there are times where living humans right to consent of losing their life is waived at the behalf of the person who caused their birth. But that is a hot button subject that should not be discussed... but you understand my point?\n\u003C/p\u003E\n\u003Cp\u003E\nI do understand your horror and frustration though. I do not try to think in a mirror darkly... but that\u0027s all too often where the rabbit hole takes me when I consider possible seemingly realistic paths the future could take.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have views on your second point but let\u0027s not stray into forum-unfriendly, hot-button topics. \n\u003C/p\u003E\n\u003Cp\u003E\nFor your first point though you are categorically wrong. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re starting with a person\u0027s brain, to be surgically implanted in a cyborg body, that would absolutely require consent from that person. A quick internet search for informed consent in medicine will find you all you need to know on the topic but you could start with this \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7993430/\u0022 rel=\u0022external nofollow\u0022\u003E2021 paper\u003C/a\u003E, focusing on the relevant US case law. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are starting by growing a brain in a laboratory, then you will be starting with donated tissue of some kind and you will absolutely require consent from the tissue donor. Again, no shortage of information out there, but you could start \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9427667/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, or \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3568202/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.  \n\u003C/p\u003E\n\u003Cp\u003E\nClaiming something as \u0027company property\u0027 does not mean that that company can ignore basic medical ethics.  I think it\u0027s also telling that you consider these cyborgs / brains-in-a-jar to be \u003Cem\u003Eproperty\u003C/em\u003E at all.  I would argue that a living human brain is a living person, and therefore that treating that brain as property, is nothing less than slavery. And the law is very clear on the topic of slavery.\n\u003C/p\u003E\n\u003Cp\u003E\nFrankly this is a technology which, if anyone successfully implemented it, would make the controversy over the medical use of human embryonic stem cells look like a polite disagreement. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-08-01T08:29:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307643\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690873882\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have views on your second point but let\u0027s not stray into forum-unfriendly, hot-button topics. \n\u003C/p\u003E\n\u003Cp\u003E\nFor your first point though you are categorically wrong. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re starting with a person\u0027s brain, to be surgically implanted in a cyborg body, that would absolutely require consent from that person. A quick internet search for informed consent in medicine will find you all you need to know on the topic but you could start with this \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7993430/\u0022 rel=\u0022external nofollow\u0022\u003E2021 paper\u003C/a\u003E, focusing on the relevant US case law. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are starting by growing a brain in a laboratory, then you will be starting with donated tissue of some kind and you will absolutely require consent from the tissue donor. Again, no shortage of information out there, but you could start \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9427667/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, or \u003Ca href=\u0022https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3568202/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.  \n\u003C/p\u003E\n\u003Cp\u003E\nClaiming something as \u0027company property\u0027 does not mean that that company can ignore basic medical ethics.  I think it\u0027s also telling that you consider these cyborgs / brains-in-a-jar to be \u003Cem\u003Eproperty\u003C/em\u003E at all.  I would argue that a living human brain is a living person, and therefore that treating that brain as property, is nothing less than slavery. And the law is very clear on the topic of slavery.\n\u003C/p\u003E\n\u003Cp\u003E\nFrankly this is a technology which, if anyone successfully implemented it, would make the controversy over the medical use of human embryonic stem cells look like a polite disagreement. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLaws are meant to serve and protect the people under them.... yet for the right price they can be... made an exception.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause money/profit lol.\n\u003C/p\u003E\n\u003Cp\u003E\nOr barring that, a desperate situation where you have an Oppenheimer-like scientist and team only doing it because their enemies/competitors are and they want to beat them.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-08-01T09:07:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307649\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690878598\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLaws are meant to serve and protect the people under them.... yet for the right price they can be... made an exception.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause money/profit lol.\n\u003C/p\u003E\n\u003Cp\u003E\nOr barring that, a desperate situation where you have an Oppenheimer-like scientist and team only doing it because their enemies/competitors are and they want to beat them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn which case, I hope the company involved is physically and metaphorically burned to the ground and the company officers and employees responsible are convicted for crimes against humanity and sentenced accordingly.  Double that sentence for any regulator or lawmaker responsible for waiving the applicable laws or allowing them to be circumvented.\n\u003C/p\u003E\n\u003Cp\u003E\nLol.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m done here. Enjoy your corporate dystopia  techbro fantasies.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-01T09:13:02Z\u0022 title=\u002208/01/2023 09:13  AM\u0022 data-short=\u0022Aug 1\u0022\u003EAugust 1, 2023\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-08-01T12:11:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224307486\u0022 data-ipsquote-contentid=\u0022218696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221690837477\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA Ship of Theseus with minds\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBefore the shipping, try a bridge. The thalamic bridge.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.cbc.ca/cbcdocspov/features/the-hogan-twins-share-a-brain-and-see-out-of-each-others-eyes\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.cbc.ca/cbcdocspov/features/the-hogan-twins-share-a-brain-and-see-out-of-each-others-eyes\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNeuralink → ThalamiX\n\u003C/p\u003E\n\u003Cp\u003E\n(Btw, why still Neuralink rather than NeuralinX ?)\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nA white mice genetic line, giving conjoined twins. Intermind electric activity.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-01T12:11:35Z\u0022 title=\u002208/01/2023 12:11  PM\u0022 data-short=\u0022Aug 1\u0022\u003EAugust 1, 2023\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}