{"TopicId":218708,"ForumId":120,"TopicTitle":"Suggestion: painting parts for look also can be used to implement some interesting mechanics","CreatedByName":"Herrio","CreatedById":230125,"CreatedDateTime":"2023-07-31T21:51:06Z","PageNum":1,"Articles":[{"CreatedByName":"Herrio","CreatedById":230125,"CreatedDateTime":"2023-07-31T21:51:06Z","Content":"\n\u003Cp\u003E\nHi, \n\u003C/p\u003E\n\u003Cp\u003E\ni just got idea about free painting parts in ksp 2\u003Cbr\u003E\nand saving them to template\u003Cbr\u003E\nit would be nice adition for some builds to make them little bit more interesting\u003Cbr\u003E\nsecond  thing whitch could be really amazing, is that if some paintings could have some special efects like heat resistance or light reflection\u003Cbr\u003E\njust imagine painting heat resistant tiles to botom of your space shuttle\u003Cbr\u003E\nand applying light reflecting foil on your satelites\u003Cbr\u003E\nit can also make structures lighter but more fragile or heavy and robust, even change the propreties of the air around the veassle\n\u003C/p\u003E\n\u003Cp\u003E\ni think it could be nice little thing to have in game\u003Cbr\u003E\nwhat do you think ?\n\u003C/p\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2023-08-01T23:15:11Z","Content":"\n\u003Cp\u003E\nI think there is a need for a selection of \u0022Zones\u0022 on many of the parts (most notably the Mk3 passenger cabin).   In these zones you should be able to select from several preset coloring patterns, each of which utilize the two colors and colors derived from them differently.  Additionally you can set each of these two zones to use a different pair of colors per zone and select between textures that can utilize those two colors.\u003Cbr\u003E\n\u003Cbr\u003E\nYou should be able to bookmark a large number of color pairs, with a good number of presets available for you.  There should be blanks for 8 pairs in the default interface, and 256 pairs in the advanced selection, about 16-32 of the pairs should be prefilled for you, being pulled from the various common real world space agency paint pallets and natural colors of certain common materials.\n\u003C/p\u003E\n"}]}