{"TopicId":218830,"ForumId":51,"TopicTitle":"Torch Drives and Tomfoolery: A Far Future Technology Mission Report","CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2023-08-09T18:21:53Z","PageNum":1,"Articles":[{"CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2023-08-09T18:21:53Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003ENote: this mission report begins immediately after the first launch to construct the \u003C/em\u003ESnack Accelerator\u003Cem\u003E.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIf there was an opportunity waiting for you across hundreds of light-years of the void of space, would you reach out and take it?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMinmunth 23, 442. A Kerbal astronomer, peering through his telescope, notices a planet around another star. Being a Kerbal, of course, Doodbin Kerman immediately set out on a quest to reach it.  He designed a ship: the \u003Cem\u003ESnack Accelerator\u003C/em\u003E. Of course, living the Kerbal equivalent of the Industrial Revolution, he couldn\u0027t do much about it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n250 years later, though, Jebediah Kerman, digging through an old archive, found his plan and began to work. On the 252nd anniversary of the designing of the \u003Cem\u003ESnack Accelerator\u003C/em\u003E, the first module flew into space. Aboard a medium-powered lifter, Jeb, Bill, and Bob rode a pillar of fire to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CGarAlS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CGarAlS.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, this is quite the view, isn\u0027t it?\u0022 -\u003Cem\u003EBob Kerman\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThirty-five minutes later, their Rhino engine spoke again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022One minute, thirteen seconds to burn. Mark!\u0022 -\u003Cem\u003EJebediah Kerman\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225586l8f.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5586l8f.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCircularization burn complete, Jeb and crew waited for the next segment of the \u003Cem\u003ESnack Accelerator\u003C/em\u003E to launch: the Science Module.\n\u003C/p\u003E\n"}]}