{"TopicId":219379,"ForumId":136,"TopicTitle":"KSP2 Loading Error \u0026quot;Loading Localizations from Addressables\u0026quot;","CreatedByName":"Emerald192","CreatedById":230544,"CreatedDateTime":"2023-09-09T02:17:52Z","PageNum":1,"Articles":[{"CreatedByName":"Emerald192","CreatedById":230544,"CreatedDateTime":"2023-09-09T02:17:52Z","Content":"\n\u003Cp\u003E\nThis issue has been talked about and resolved on this forum before, but its just my luck that it doesn\u0027t work for me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOk, so quick backstory.\n\u003C/p\u003E\n\u003Cp\u003E\nI stepped away from KSP2 a few months ago, to wait for optimization to be done so I could, you know, actually play the game. Once I return, I find that the loading screen freezes on \u0022Loading Localizations from Addressables.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo I looked through this forum, tried all the listed solutions, I even uninstalled the entire game, but still no good, it still wont load.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m at a loss here, I don\u0027t know what to do anymore. Would someone be willing to give me a hand?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002211.11\u0022 width=\u0022603\u0022 alt=\u0022image.png\u0022 src=\u0022https://cdn.discordapp.com/attachments/1119680350990372906/1149887965523365928/image.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MrCreeps","CreatedById":230898,"CreatedDateTime":"2023-10-14T13:10:26Z","Content":"\n\u003Cp\u003E\nHello, I just created an account to reply to this post with a solution:\u003Cbr\u003E\nThe same issue happened to me, a few months ago I played a lot, and (just today) started to play agin and faced the same loading screen issue.\u003Cbr\u003E\nI had to go to the KSP2 directory (default for me is C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program 2) and delete my BepInEx folder and my \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E folder (I used to do KSP2 modding and I now assume the issue was because of these outdated folders/mods)\u003Cbr\u003E\nThese folders still remained there even after reinstalling KSP2, so just go in there and manually delete any folders that shouldn\u0027t be there upon the first install, then (if you still want to add mods), just use the new versions of all the tools \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nEdit: I know this is tagged in unmodded installs, but this is the solution that worked for me with the same message on the loading screen.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-10-14T13:11:24Z\u0022 title=\u002210/14/2023 01:11  PM\u0022 data-short=\u0022Oct 14\u0022\u003EOctober 14, 2023\u003C/time\u003E by MrCreeps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Safarte","CreatedById":227546,"CreatedDateTime":"2023-10-14T15:29:12Z","Content":"\n\u003Cp\u003E\nMost mods have been updated since then, this issue shouldn\u0027t happen anymore for this version of the game.\n\u003C/p\u003E\n"}]}