{"TopicId":219353,"ForumId":119,"TopicTitle":"The progress of KSP2 development","CreatedByName":"Alpha_star","CreatedById":230385,"CreatedDateTime":"2023-09-07T11:02:28Z","PageNum":1,"Articles":[{"CreatedByName":"Alpha_star","CreatedById":230385,"CreatedDateTime":"2023-09-07T11:02:28Z","Content":"\n\u003Cp\u003E\n(OK, I know that there will probably be a lot of people arguing in the arguments. As a disclaimer, I\u0027m not targeting anyone or anything specific, nor am I protecting or attacking.)\n\u003C/p\u003E\n\u003Cp\u003E\nIt has been more than six months since KSP2\u0027s initial early access launch. . However, it is a popular opinion that the progress is slow, having only four patches, two hotfixes and no big update. I am not disagreeing them because people have the right to have different opinions, but I want to list all the visible progress below.\n\u003C/p\u003E\n\u003Cp\u003E\n(Note: visible means in the actual game and does not include features/bugfixes that are not in the latest version of the game by default. Thanks to Shadowzone for the numbers!)\n\u003C/p\u003E\n\u003Cp\u003E\n281 bugfixes in 0.1.1.0\n\u003C/p\u003E\n\u003Cp\u003E\n173 bugfixes in 0.1.2.0\n\u003C/p\u003E\n\u003Cp\u003E\n165 bugfixes in 0.1.3.0\n\u003C/p\u003E\n\u003Cp\u003E\n2 bugfixes in 0.1.3.1\n\u003C/p\u003E\n\u003Cp\u003E\n2 bugfixes in 0.1.3.2\n\u003C/p\u003E\n\u003Cp\u003E\n81 bugfixes in 0.1.4.0 with 13 of them among the top 20 list\n\u003C/p\u003E\n\u003Cp\u003E\n4 parts with a counterpart in KSP1\n\u003C/p\u003E\n\u003Cp\u003E\n4 new parts\n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, that counts to 704 bugfixes in total and 8 new parts for the past six months. If we divide 704 with 180, that turns out to be around 4 bugfixes per day including vacations and weekends. If excluding them, then the rate would be around 6 to 7 bugfixes per day. Of course, this number doesn\u0027t make much sense since turning off engine light likely took less work than the orbital decay bug. But still, all in all, I\u0027d say that Intercept Games has around 10 employees dedicated for bugfixing or QA testing.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s obvious that what we have in the game is less than what has been made in total, but since none of us players are aware of the exact progress, anything related to it mostly remains guessing.\n\u003C/p\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2023-09-07T11:36:56Z","Content":"\n\u003Cp\u003E\nThis topic has been flogged to death, but I\u0027ll chime in.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been pretty critical of the state of the game. The fact it released without even at least matching ksp1 is disgraceful. I don\u0027t agree with early access releases and big publishers. But if you\u0027re going to release the game before it\u0027s finished, it should at the very least have every feature the first game had, so there is a reason to play it.\n\u003C/p\u003E\n\u003Cp\u003E\nI get to the forums once each week most of the time just to see if there is any updates or news.\n\u003C/p\u003E\n\u003Cp\u003E\nThere almost never is.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve got the game on my wish list so I\u0027ll start paying attention again properly in 2-3 years if 1.0 ever releases.\n\u003C/p\u003E\n\u003Cp\u003E\nI still doubt the publisher will fund this to completion. It feels like the game is already being developed with a skeleton crew.\n\u003C/p\u003E\n"},{"CreatedByName":"Alpha_star","CreatedById":230385,"CreatedDateTime":"2023-09-07T12:59:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224320202\u0022 data-ipsquote-contentid=\u0022219353\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221694086616\u0022 data-ipsquote-userid=\u0022129740\u0022 data-ipsquote-username=\u0022uglyduckling81\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, uglyduckling81 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis topic has been flogged to death, but I\u0027ll chime in.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been pretty critical of the state of the game. The fact it released without even at least matching ksp1 is disgraceful. I don\u0027t agree with early access releases and big publishers. But if you\u0027re going to release the game before it\u0027s finished, it should at the very least have every feature the first game had, so there is a reason to play it.\n\u003C/p\u003E\n\u003Cp\u003E\nI get to the forums once each week most of the time just to see if there is any updates or news.\n\u003C/p\u003E\n\u003Cp\u003E\nThere almost never is.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve got the game on my wish list so I\u0027ll start paying attention again properly in 2-3 years if 1.0 ever releases.\n\u003C/p\u003E\n\u003Cp\u003E\nI still doubt the publisher will fund this to completion. It feels like the game is already being developed with a skeleton crew.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust my quick opinion. I don’t want to start another fight over KSP2.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat we currently know is that they are already working on features beyond science and likely even a framework for multiplayer. However, since we don’t have access to that part of the game by default,    anything regarding it is probably pure speculation.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I see, the game is still buggy and unoptimized, but already much better at launch. The developing team is still putting progress in to make the game actually better and not just add new buggy features. I believe they do want the game to improve and not just let it be some quick cash grab, otherwise they could just throw in the frameworks of the later updates and call it a day. They do care about our experience. To me, a KSP2 player, the game has improved quite a bit since launch.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, I partially agree with you about the status. It would be better if the updates could come sooner.\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2023-09-07T16:10:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224320202\u0022 data-ipsquote-contentid=\u0022219353\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221694086616\u0022 data-ipsquote-userid=\u0022129740\u0022 data-ipsquote-username=\u0022uglyduckling81\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, uglyduckling81 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis topic has been flogged to death, but I\u0027ll chime in.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nVery true.     We have a number of threads that already discuss this, in particular the grand discussion thread pinned at the top of this sub.    We really don’t need another.   Please continue discussion there.  \n\u003C/p\u003E\n"}]}