{"TopicId":220162,"ForumId":56,"TopicTitle":"Problemas con la instalación de KSP","CreatedByName":"GaelMP","CreatedById":230977,"CreatedDateTime":"2023-10-22T21:47:55Z","PageNum":1,"Articles":[{"CreatedByName":"GaelMP","CreatedById":230977,"CreatedDateTime":"2023-10-22T21:47:55Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#fcdcdc;color:#880e4f;font-size:15px;\u0022\u003EHola, tengo un problema instalando KSP, ok, la historia es que después de comprarlo (en Epic Games) lo instalé y se instala un launcher de la empresa creadora de KSP todo bien pero el ese launcher me dice que instale el juego cuando le doy al botón de instalar me dice que instalé un idioma, selecciono el idioma español y descargo. Cuando termina voy al launcher y me aparece el botón de jugar en gris, supuse que no había detectado así que cierro el launcher y vuelvo a abrir el juego se abre el launcher y me dice que lo instale otra vez lo instalo otra vez y repito esto en bucle durante media hora para después investigar y ahora estoy aquí buscando ayuda.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"JxMaster","CreatedById":232224,"CreatedDateTime":"2024-01-15T04:21:59Z","Content":"\n\u003Cp\u003E\nhola gael, llegue a este foro por el mismo problema pero lastimosamente no encontré solución para poder jugar ksp en español, descubrí que si lo instalas en idioma ingles si deja correr el juego, pero al quitar el ingles y volver a instalar el idioma español no deja abrirlo como tu mismo dijiste en esta publicación, lo mas posible es que solo se pueda jugar en ingles y que aunque aparezcan las opciones para poner el juego en otro idioma, estas no funcionan.\n\u003C/p\u003E\n\u003Cp\u003E\nsaludos\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2024-01-15T04:41:28Z","Content":"\n\u003Cp\u003E\nHola, ¿estás jugando KSP1 o KSP2??\n\u003C/p\u003E\n"}]}