{"TopicId":220725,"ForumId":119,"TopicTitle":"KSP2 Music and \u0026quot;Discoverables\u0026quot; and Resources","CreatedByName":"dansiegel30","CreatedById":225462,"CreatedDateTime":"2023-11-09T03:08:50Z","PageNum":1,"Articles":[{"CreatedByName":"dansiegel30","CreatedById":225462,"CreatedDateTime":"2023-11-09T03:08:50Z","Content":"\n\u003Cp\u003E\nSo, we all know the devs have done work on ALL facets of the game - colonies, resources, interstellar - they have even played multiplayer on an extremely limited build.  So, I think it might be fair to say they already know where ALL discoverables and resource plots will be located.  I noticed something with the music while flying a methane aircraft around Laythe, looking for interesting sites, to see if I can find anything special prior to 0.2.  Whenever I fly over the ocean, the music is bland - its fine, but it that score\u0027s filler verses for sure.  When I go over land, the music switches to its chorus - as I approach some different looking terrain in the rocky/hilly areas, the music begins to swell, and swell - and when I fly over particular spots which look like there might be minerals embedded in the rock, the music reaches the crescendo. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI flew all around other places, and crescendos seem to happen in the same spots.  I have feeling one way to help you that you are getting closer to something important, is not only visuals, or some scanner - but also the music, which I think is brilliant.  I\u0027m gonna try to find the moon arch and minmus Kerbal GemHair monument to see if its the same thing - every vid I\u0027ve seen of people exploring that, had the music turned off.  For some, I guess it gets old, but I love it, and it might be a reason for everyone to keep the music on in KSP2.\n\u003C/p\u003E\n"},{"CreatedByName":"dansiegel30","CreatedById":225462,"CreatedDateTime":"2023-11-09T04:54:41Z","Content":"\n\u003Cp\u003E\nNOPE - I went to the Minmus Discoverable and the music was pretty dead AFTER I touched down - I guess maybe my altitude triggered the music on Laythe - well, it would have been a good idea....finding an easteregg or discoverable is much more monmental than landing a craft.\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2023-11-09T06:48:38Z","Content":"\n\u003Cp\u003E\nIt\u0027s still possible? I think the idea is worth them exploring.\n\u003C/p\u003E\n"},{"CreatedByName":"dansiegel30","CreatedById":225462,"CreatedDateTime":"2023-11-09T23:05:07Z","Content":"\n\u003Cp\u003E\nWell, its certainly up to the devs, and I think it would be AWESOME for zero music while rovering around, and the music begins to swell as you drive up to the discoverable - however they do have plans for the animation/story when you do find a discoverable for the first time - as far as resources, I imagine there will be resource scanners (introduced in 0.4 with the resources and converters) that should detect them \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E before music would ever be applicable.\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2023-11-10T17:58:46Z","Content":"\n\u003Cp\u003E\nI\u0027d love there to be some hint in the game that comes up when you are close to a discoverable or easter egg.  You know, just to let you know \u0022Hey, you are close to finding something here; you might want to explore this area a bit closer\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"RUD Everyday","CreatedById":228396,"CreatedDateTime":"2023-11-19T22:45:24Z","Content":"\n\u003Cp\u003E\nI like this idea.\n\u003C/p\u003E\n"},{"CreatedByName":"joratto","CreatedById":218497,"CreatedDateTime":"2023-11-20T12:46:36Z","Content":"\n\u003Cp\u003E\nIf approaching a munar anomaly doesn\u0027t trigger music like \u003Ca href=\u0022https://www.youtube.com/watch?v=oU4Rk0NATNs\u0026amp;ab_channel=SeanWilson\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, then I want my refund immediately.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2023-11-21T17:23:42Z","Content":"\n\u003Cp\u003E\nI think, rather than all anomalies/discoverables detectable by orbital  scanning it could be nice to have a mixture.\n\u003C/p\u003E\n\u003Cp\u003E\nSome could emit detectable \u0027signals\u0027 such as heat, radiation, gravity spike\u0027s etc, that orbital scanners might pick up.  Others would just be big enough to be visible from low orbit or if you get within a few km.   And some maybe give off weak signals that may help you \u0027home in\u0027 if you are close enough.\n\u003C/p\u003E\n"}]}