{"TopicId":221026,"ForumId":51,"TopicTitle":"To Be Kerbal: Historical Career Playthrough","CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-01T00:17:23Z","PageNum":1,"Articles":[{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-01T00:17:23Z","Content":"\n\u003Cp\u003E\nHeya! This is my first try at doing one of these mission report series things so I don\u0027t know if you guys will like it or not\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, this series is basically just career mode but with a BUNCH of IRL parts mods installed (BDB, Tantares, RN Probes/Rockets, etc.)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd also History of Spaceflight for contracts\n\u003C/p\u003E\n\u003Cp\u003E\nPretty much the space race but kerbalized\n\u003C/p\u003E\n\u003Cp\u003E\nThis will also include a WHOLE bunch of world building so anyone whos a fan of that will like this hopefully\n\u003C/p\u003E\n\u003Cp\u003E\nSo I guess I should make my save now! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-01T12:37:17Z\u0022 title=\u002212/01/2023 12:37  PM\u0022 data-short=\u0022Dec 1\u0022\u003EDecember 1, 2023\u003C/time\u003E by TheSpaceDinos4037\u003C/strong\u003E\n\u003Cbr\u003EProviding more context\n\u003C/span\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-01T02:38:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EQuite A Small Start\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs knowledge of the new \u0022space program\u0022 began to spread to the people of the Totally United Korabl States (T.U.K.S.), it\u0027s reputation slowly began to grow. An early fundraiser campaign by the program provided the funds necessary for the first flights.\n\u003C/p\u003E\n\u003Cp\u003E\nThe program began development of its first rocket, the Aerabe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EAerabe Program\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Aerabe Program was named after Woseph Aerabe Kerman, one of the first pioneers of astronomy, which was only like 30 years ago. The program wanted its first rocket to be a good one, so it recruited big names in the scientific community such as Werhner Von Kerman and Nodderd Kerman.\n\u003C/p\u003E\n\u003Cp\u003E\nThe design of the rocket was simple:\n\u003C/p\u003E\n\u003Cp\u003E\nA 2 meter long fuel tank with a cover at the bottom for housing a rocket motor, which was capable of converting kerosene and liquid oxygen into a super-heated plasma which when shot out the bottom, could provide enough thrust to overcome Kerbin\u0027s gravity and launch into the stars. It was also equipped with a small transmitter hidden in the nosecone to provide constant communication and the opportunity to conduct scientific experiments. Experiments included a small camera, a thermometer, and a barometer. 3 wings were also fitted on the bottom cover to allow the rocket to cut through the air faster and to keep it stable. It total, it had a delta-v of ~1530 meters per second and a thrust of 10.44 kN. The rocket motor would run for 27 seconds, before burning all the fuel and shutting down.\n\u003C/p\u003E\n\u003Cp\u003E\nPhotograph of the Aerabe 1 on the launchpad at the Desert Missile Complex.\u003Cimg alt=\u0022aerabe_1_pad.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.75\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1177960034618060891/1179950052802838538/aerabe_1_pad.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAerabe 1 was launched on Cernuary 25th, 1947, at 11:45:00. The rocket shot into the air and at an altitude of 7.4 kilometers, the motor cut off and left the craft to the hands of gravity. Slightly less then a minute after liftoff, it reached its apogee of 12,784 meters above sea level before beginning its freefall back to Kerbin. The rocket turned sharply downward, its nosecone making it plummet to the ground faster and faster. Just over a minute and a half later, it hit the hard sand near the complex at exactly 100 m/s. The science experiments were conducted and transmitted at its apogee. They successfully recorded temperature and pressure data, as well as capturing one image of the cloud tops.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aerabe_1_camera_image.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002246.23\u0022 height=\u0022270\u0022 width=\u0022584\u0022 src=\u0022https://cdn.discordapp.com/attachments/1150966012032860235/1179971545821614080/aerabe_1_camera_image.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission was declared a complete success, despite the destruction of the rocket. The program gained a lot of reputation across the country and the world. Perhaps this would be the start of something new, a new era of the Kerbal race.\n\u003C/p\u003E\n\u003Cp\u003E\n(first post so far, I think its really good, so I hope you all enjoyed it! \u003Cspan\u003E:D)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-01T23:05:40Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EAerabe Program Continued\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the successful launch of Aerabe 1, the directors of the program wanted a second rocket to be launched, so they went ahead and asked the engineers and designers what they could come up with. In the end, they created a modified version of the Aerabe 1, instead called the Aerabe 2. It was a much taller rocket, comprising of the same basic parts as the Aerabe 1, only the fuel tank was much longer than before, which would\u0027ve given the rocket a delta v of ~1300 m/s, if it wasn\u0027t for an added part, a solid rocket booster. The \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burned a solid fuel, instead of a liquid one, providing a much more powerful source of thrust. However, the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burned its fuel much quicker than the liquid fuel did, so it could only provide thrust for about 4 seconds, although in that time it could propel the Aerabe 2 to about 370 m/s before cutting off. After the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E cutoff, it would be jettisoned from the main body by a \u0022decoupler\u0022, which was pretty much just some sticks with tape attached. Immediately after the jettison, the liquid fuel motor would come to life and continue to boost the rocket higher and higher, into Kerbin\u0027s upper atmosphere. Where it would cutoff after 22 seconds. It would then reach its apogee, perform and transmit its experiments, and begin its descent back to Kerbin, never to fly again. It would have a total delta v of around 1640 m/s, with a thrust of 28.9 kN from the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E, and 10.44 kN from the liquid fuel motor. It cost almost 1,100 funds, a bit more than the 815 funds of the Aerabe 1.\n\u003C/p\u003E\n\u003Cp\u003E\nPhotograph of Aerabe 2 on the pad minutes before liftoff.\u003Cimg alt=\u0022aerabe_2_pad.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.50\u0022 height=\u0022673\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1177960034618060891/1180124715365441626/aerabe_2_pad.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Morch 17th, 1947, at 12:30:00, Aerabe 2 fired it\u0027s \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E, and began its ascent. The \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E was a LOT more powerful than anticipated, propelling the craft to an altitude of 1.4 km before cutting off, in just 4 seconds. Instantly, it was jettisoned and the 2nd stage fired, shooting away from the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E and accelerating faster and faster. It burned its 22 seconds away, and at an estimated altitude of 10 km, the motor shut down. Before this, however, contact was lost at exactly 8,750 meters above sea level. Radar showed that the rocket was still firing after loss of contact, its engine cutting off, soaring to a height of around 20 km, and beginning its fall back to the ground. The loss of contact was theorized to have been caused by a cone of superheated air forming around the nosecone due to the immense speed of the craft, which heated up the insides of the avionics core and disabled the transmitter. All of the science experiments onboard were unable to be conducted, and the rocket was lost forever. It crashed into the desert floor, 3 minutes and 16 seconds after liftoff, at a speed of 100.6 m/s. The \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E had hit the ground just over a minute earlier.\n\u003C/p\u003E\n\u003Cp\u003E\nAerabe 2 was deemed a failure.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-02T16:01:45Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EAerabe Program Continued\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn the aftermath of Aerabe\u0027 2\u0027s very apparent failure, the program desperately needed a comeback, a successful mission that would bring back their good reputation and funding. So, they made the Aerabe 3. Designed with a much better insulated nosecone, the Aerabe 3 was similar to its predecessor, with one major difference, a 3rd stage. The 3rd stage was an \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E, just like the first, but with a TON more thrust. Almost 1000 m/s of delta v, compared to the first stage\u0027s 390 m/s. The second stage again consisted of a liquid fueled rocket motor, with about 2100 m/s of delta v, and would burn for 28 seconds. This all totaled to ~3500 m/s of delta v. This rocket was meant to reach space. It was also equipped with a new experiment, a gravimeter. This instrument could measure the gravitational pull of Kerbin, which at its surface was 9.81 m/s^2. It was theorized that the farther you are from an object, the less its gravity pulls on you. So they put a gravimeter in the nosecone to test this. If it was true, then it would be a glorious day in the field of science! If false, then we would have to rewrite our entire understanding of physics. And also probably how to do most things, like baking. This rocket had to work.\n\u003C/p\u003E\n\u003Cp\u003E\nPhotograph of Aerabe 3 around an hour before launch. (It was decided that Aerabe 3 would be launched from the Shoreline Complex instead of the Desert Complex to eliminate the problem of heat frying the components.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aerabe_3_pad.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.75\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1177960034618060891/1180372729606717440/aerabe_3_pad.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Teprill 2nd, 1947, at 0:35:00, Aerabe 3 lifted off from the Shoreline Complex Launchpad. Its 1st stage fired for 4 seconds, and cut off at an altitude of 700 meters. The 2nd stage then was fired, burned for 28 seconds, and cut off at 14.5 km. The 2nd stage encountered some heating, but it quickly dissipated as the craft climbed higher and higher. Then, at 20 km high, the 3rd stage lit. The air around the craft almost immediately turned a bright orange and scarlet as the craft shot through the atmosphere. Insulting the nosecone was a good choice, as temperatures reached almost 500 Kelvin (440 fahrenheit, 226 celsius) It only was lit for 4 seconds, but in that time, the craft had accelerated almost a full 1000 m/s. It would soon cool down as it neared the vacuum of space. At 1 minute and 13 seconds after liftoff, the craft exited the upper wisps of Kerbin\u0027s atmosphere, and entered the cold, dark, emptiness. It went MUCH higher than expected, topping out at 211.46 km from the surface of Kerbin. The rocket had reached that point in less than five minutes. The gravimeter experiment was conducted, and it recorded a lower gravity than 9.81 m/s (I guess Bob wins five funds now). Then, just under 4 minutes later, the craft reentered Kerbin\u0027s atmosphere at over 1300 m/s. The highest temperature recorded was 691 Kelvin (784 fahrenheit, 416 celsius) before contact was lost, and the rocket broke apart and dissipated into the atmosphere. The only debris that was found was the engine of the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E, which had landed on and crushed someone\u0027s bike, bounced off the pavement, and shot through another person\u0027s window, and was found lying on their couch (We definitely paid for damages).\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission was deemed a success.\n\u003C/p\u003E\n\u003Cp\u003E\nReception was widely in favor of the program. We had just ventured where nothing had ever been before! Although some other countries are starting to invest more into the field of spaceflight, so we might have competition sooner or later.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-03T01:36:10Z\u0022 title=\u002212/03/2023 01:36  AM\u0022 data-short=\u0022Dec 3\u0022\u003EDecember 3, 2023\u003C/time\u003E by TheSpaceDinos4037\u003C/strong\u003E\n\u003Cbr\u003Echanged to continue Aerabe program\n\u003C/span\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2023-12-03T02:56:04Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EThe Final Aerabe Flight\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs reputation of the program grew and grew, so did people wanting to move on from the Aerabe design and construct an entirely new rocket. But first, the engineers had been asking if they could show off a new Aerabe rocket, one that was recoverable. This rocket would be a carbon copy of the Aerabe 2, with one difference, a decoupler and parachute attached to the nose cone payload. After the 1st and 2nd stages would burn their fuel away, the nosecone would be jettisoned by a decoupler attached between it and the 2nd stage tank. Once jettisoned, a parachute beneath the payload would deploy, slowing the craft down to a safe landing speed. The payload would then be recovered. The rocket would be called the Aerabe 4.\n\u003C/p\u003E\n\u003Cp\u003E\nPhotograph of the Aerabe 4 on the launchpad at the Inland Complex.\u003Cimg alt=\u0022aerabe_4_pad.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.75\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1177960034618060891/1180696465853644922/aerabe_4_pad.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Teprill 27th, 1947, at 00:35:00, Aerabe 4 lifted off from the Inland Complex. The 1st stage fired for 4 seconds, jettisoned, and then the 2nd stage fired. More fuel had been added to the 2nd stage, so the burn would be a lot longer. It was lit for 35 seconds, and then cut off. As soon as it cut off, the payload was jettisoned. It continued to soar higher and higher, only controlled by gravity and the laws of aerodynamics. It reached its apogee at around 43.4 km, and its parachute was deployed. It only slowed the craft down a little, because it hadn\u0027t been fully opened yet and the air was still very thin. It fell slowly back down to Kerbin. At an altitude of 200 meters, its parachute opened fully and the payload was instantly snagged back and slowed down rapidly. It landed about 15 minutes after takeoff, in a patch of trees near the Inland Complex.\n\u003C/p\u003E\n\u003Cp\u003E\nPhotograph of the payload\u0027s landing site.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aerabe_4_payload_landing.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.75\u0022 height=\u0022676\u0022 width=\u00221200\u0022 src=\u0022https://cdn.discordapp.com/attachments/1177960034618060891/1180700939485712574/aerabe_4_payload_landing.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe payload was recovered safely shortly after. The only damage done to it was a scratch from it hitting a tree branch above it. All experiments were collected and sent back to R\u0026amp;D for analysis. Reception of this mission was widely acclaimed for its new ventures in safe and recoverable craft.\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission was a success.\n\u003C/p\u003E\n\u003Cp\u003E\nBut then, the directors decided that with this great success, it was time to discontinue the Aerabe And so on Kay 5th, the program announced the end of the Aerabe, and it was officially lost to history. With that, a new rocket program was needed. But what would it be?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you all of think of this so far? just asking cuz I wanna know \u003Cspan\u003E:^\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2024-01-13T04:20:01Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EUPDATE\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nhey guys just wanted to let ya know that this isnt over yet\n\u003C/p\u003E\n\u003Cp\u003E\ni just had spent a lot of time with my family over christmas break and couldnt really make more posts here and school just started again last week so\n\u003C/p\u003E\n\u003Cp\u003E\nnew posts will take longer but ill still be continuing this\n\u003C/p\u003E\n\u003Cp\u003E\nthanks! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nbonus meme image\n\u003C/p\u003E\n\u003Cp\u003E\n \u003Cimg alt=\u0022scott_manley_fly_dangerously.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.76\u0022 height=\u0022454\u0022 width=\u0022680\u0022 src=\u0022https://cdn.discordapp.com/attachments/1063135188261019749/1195162717602979940/scott_manley_fly_dangerously.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TheSpaceDinos4037","CreatedById":229961,"CreatedDateTime":"2024-04-17T22:44:02Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EAerabe and Beyond\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the end of Aerabe, the directors of the space program desperately needed a new, and more functional rocket that could send larger payloads oh sub-orbital trajectories, and beyond. To accomplish this, the design of the Aerabe rocket was entirely reworked, creating an even more powerful rocket. It\u0027s name?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EThe Kunoh Program\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kunoh sounding rocket program was named after a theorized \u0022third moon\u0022 of Kerbin, named Kunoh. Of course, this was not the case. It was actually just a bug that had landed on an early astronomer\u0027s telescope lens. But it did add a new species to the already growing list of organisms in Kerbin\u0027s ecosystem.\n\u003C/p\u003E\n\u003Cp\u003E\nIn a complete overhaul of the Aerabe, engineers reworked the data storage system from punch cards into a new \u0022magnetic storage\u0027 system, allowing larger quantities of data such as experiment read outs and telemetry data to be stored more efficiently. This came after the first computers had been pioneered during the second Kerbin War.\n\u003C/p\u003E\n\u003Cp\u003E\nThey also reworked the payload containment, instead housing the important electrical equipment and scientific experiments inside a larger \u0022payload bay\u0022 which could be open after recovery. This bay would also house the parachutes and main core of the Kunoh\u0027s control systems.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the newest addition would be more efficient rocket motors and engines, especially in the solid-fuel department. Larger tanks and engines had to be crafted for this to work, which led to the creation of the SRM Solid Rocket Motor line.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that was left was to put these pieces together.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EKunoh-1\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter around a year of designs, preparations, and lots of funds being spent, the program was ready to launch the first of the new line of rockets to further reach into the endless heavens.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kunoh-1 was bigger, thicker, and much more grand than an Aerabe rocket could\u0027ve ever been. It\u0027s one and only SRM-XL Solid-Fuel booster had just over 1500 m/s of Delta-V to send a payload into the upper-atmosphere and space itself. However, this was not enough to achieve orbit, but that would be a future rocket\u0027s problem. The motor would burn for just 12 seconds, with a thrust to weight ratio of over 10! Engineers were concerned that this would tear apart the rocket on lift off, so thrust was limited from 160 kN to only 51 kN, a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of ~3.7, and an longer burn time of around 30 seconds.\n\u003C/p\u003E\n\u003Cp\u003E\nOntop of the booster included a small payload bay, which contained electrical systems, avionics, transmitters, and a small recovery parachute that would open through a hole in the nosecone once it was half a kilometer from the ground during its descent. Scientific experiments included a thermometer, barometer, and a special geiger counter that would measure the radiation levels of the upper atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n Photograph of the Kunoh-1 on the launchpad around 10 minutes before launch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/9Dnis7y\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/9Dnis7y\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Joone 25th, 1948 at 12:25 in the afternoon, the Kunoh-1 lifted off from Pad-3b at the Dessert Launch Complex (the base was renamed to disguise the fact that it held secret underground nuclear warheads, but apparently whoever was naming it was extremely illterate.) \n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket shot through the dissipating blue atmosphere, its 3 short and stubby wings keeping it pointed straight up. At 00:00:29 seconds, the booster burned out a second earlier than expected, and communication was almost lost entirely after super-heated air plasma had formed around the craft due to its speed of nearly Mach 3, almost having an Aerabe 2 all over again. Immediately after burn-out, the booster was supposed to be shot away from the payload bay by a set of small explosive detonators, but for an unknown reason, the detonators never fired. Later analysis revealed ONE wire that had gone faulty during lift off, cutting off the connection to the detonators. The booster remained attached for a majority of the flight.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket reached an apogee of just under 54 kilometers into the sky, scraping the faint boundary of Kerbin and the endless void of space. Around this time, for an also unknown reason, one of the two thin half-cylinder shaped bays that protected the internal components was jettisoned earlier than expected. The debris of this bay was found just under a kilometer away from the landing site of the rocket and payload.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the Kunoh-1 reached an altitude of 3 kilometers above Kerbin\u0027s surface, the internal altimeter sent a short pulse to the avionics system to deploy the parachute. The top of the nose cone was jettisoned, and the chute fit right through the new hole and opened up, slowing down the craft almost immediately. At 00:07:30 seconds after lift-off, the Kunoh-1 rocket safely touched down just a short distance away from the Dessert Launch Complex.\n\u003C/p\u003E\n\u003Cp\u003E\nThe flight had found that the temperature and pressure of the upper atmosphere above a desert wasn\u0027t to different to that of the atmosphere above a forest or ocean, proving that the sands of Kerbin were infact, not burning a whole in the ozone layer. The geiger counter also found that radiation levels increased as altitude increased, proving that there was some unknown source producing this extra radiation. Origins included the sun, the stars, the Mun, even space itself! None of these could be proven, however.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nok bye\n\u003C/p\u003E\n"}]}