{"TopicId":22111,"ForumId":32,"TopicTitle":"Moon-Ception.","CreatedByName":"thatoneperson8","CreatedById":36270,"CreatedDateTime":"2012-10-13T18:06:12Z","PageNum":1,"Articles":[{"CreatedByName":"thatoneperson8","CreatedById":36270,"CreatedDateTime":"2012-10-13T18:06:12Z","Content":"\n\u003Cp\u003EAnyone wonder if one day in Ksp. there will be a moon orbiting a moon?\u003C/p\u003E\u003Cp\u003EIt would be cool. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EEven like an asteroid sized object in low orbit would be cool.\u003C/p\u003E\n"},{"CreatedByName":"Cthulufaic","CreatedById":6660,"CreatedDateTime":"2012-10-13T18:18:35Z","Content":"\n\u003Cp\u003EI think there used to be a mod that included a small moon-object with gravity, so you could just put that around the Mun, then put another one around that, and another and another ad infinium.\u003C/p\u003E\n"},{"CreatedByName":"thatoneperson8","CreatedById":36270,"CreatedDateTime":"2012-10-13T18:19:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cthulufaic\u0022 data-cite=\u0022Cthulufaic\u0022\u003E\u003Cdiv\u003EI think there used to be a mod that included a small moon-object with gravity, so you could just put that around the Mun, then put another one around that, and another and another ad infinium.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t mean the parts gravity mod.\u003C/p\u003E\n"},{"CreatedByName":"Yeomans","CreatedById":46569,"CreatedDateTime":"2012-10-14T03:32:55Z","Content":"\n\u003Cp\u003EIt\u0027s very unlikely in any situation to have a natural satellite (beta) orbiting a natural satellite (alpha) of a planet.\u003C/p\u003E\u003Cp\u003EIn terms of a large natural satellite (let\u0027s say, something that is massive enough to have a significant gravity well), you have to consider that the satellite would not only be affected by it\u0027s primary\u0027s sphere of influence, but also the sphere of influence of the primary\u0027s primary. When satellite beta is between the two primaries, it is going to be affected by each of the objects. This, in most cases, will either cause the beta satellite to escape the system (and likely alter the orbit of satellite alpha), or the beta satellite may switch bodies to the alpha satellite, if, say, the planet was a large gas giant.\u003C/p\u003E\u003Cp\u003EIn terms of a small natural satellite, it\u0027s very much the same as a spacecraft orbiting a planet. If you look at space stations, they can only last a few years in orbit without ajdustments. Around earth, during times of frequent sun spots, atmospheric drag occurs at much higher altitudes than during time of few sunspots. Not to mention that when an object is orbiting something much larger than it, gravitational radiation has a hand to play in orbital decay, imagine a coin rolling down a funnel; much like the coin, over time, the radius of a small satellite\u0027s orbit will decrease.\u003C/p\u003E\u003Cp\u003EThese two factors make it very unlikely in the real world for a satellite to orbit a planet\u0027s satellite. It is possible, but in actuality, if it wasn\u0027t implemented well in KSP, we could see some strange effects in that planetary system (the space-ception cracken, if I may so coin the term).\u003C/p\u003E\n"}]}