{"TopicId":221215,"ForumId":44,"TopicTitle":"Molten Metal Batteries... The Future and Better Battery Due To Replace Lithium Ion?","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-12-14T02:49:25Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2023-12-14T02:49:25Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://spectrum.ieee.org/liquid-metal-battery\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://spectrum.ieee.org/liquid-metal-battery\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNotably, the downside mentioned in the article was the long road of development, since the makers are quite literally blazing a trail not traveled, with no technology to help them but rather having to make things on the spot to make it all work out.\n\u003C/p\u003E\n\u003Cp\u003E\nSounds really awesome... and makes sense too, since as we all know heat is a higher energy state than cold, so it makes sense that one could store and discharge larger amounts of energy with a hot storage mechanism rather than a cold one.\n\u003C/p\u003E\n\u003Cp\u003E\nThis ain\u0027t fusion, but the makers did face problems with melting seals during development, but that was in 2017, and I would like to think that with all the money Bill Gates is throwing at it maybe they have solved that... especially now that they are getting ready to start implementing and selling the tech as a power supply for Microsoft which wants renewable energy resources instead of relying on diesel (fossil fuel) generators because of the global warming problem.\n\u003C/p\u003E\n"},{"CreatedByName":"AckSed","CreatedById":224249,"CreatedDateTime":"2023-12-14T16:42:39Z","Content":"\n\u003Cp\u003E\nIt does sound good, and more cheap batteries for renewable storage, with a company behind it producing them, is always a good thing.\n\u003C/p\u003E\n\u003Cp\u003E\nI have one point of contention... two points. The need to keep things liquid, and the use of antimony.\n\u003C/p\u003E\n\u003Cp\u003E\nThe liquid metal will need heating. My naive trawl of Wikipedia says that antimony melts at ~630 °C, calcium metal melts at 842 °C and calcium chloride ~775 °C. When Ambri reassures customers that the external surfaces of the insulated shipping-container units are \u0022safe-to-touch\u0022, you know it\u0027s hot in there. Their site says that the units are \u0022self-heating\u0022, which only means that it doesn\u0027t require external sources of heat; it has heating elements in each tray of cells. There may be natural resistance there too, I don\u0027t know. That is extra power needed before every charging cycle. It may not be much, as insulation these days can be extremely good, but it\u0027s there. If it draws from its own reserves, that is a parasitic load.\n\u003C/p\u003E\n\u003Cp\u003E\nOne key element that could mitigate this is the classic duck curve of solar, where you overproduce during the day. Divert that to heating during charging and you\u0027re good. Indeed, it\u0027s advertised as ideal for daily deep-cycling, and in this regard, it absolutely is. Round-trip efficiency might be a bit lower than advertised, though.\n\u003C/p\u003E\n\u003Cp\u003E\nThe antimony gave me pause because while it\u0027s less toxic than arsenic, its dust is not healthy. The individual sealed cells being built out of stainless steel does address this; they aren\u0027t just buckets of metal open to the air. The manufacturing side may be the only real risk to health, and that can be mitigated.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.osti.gov/biblio/1805441\u0022 rel=\u0022external nofollow\u0022\u003EDug out the patent\u003C/a\u003E: \u0022Multi-element liquid metal battery\u0022 (2021), Pat. num.: 16/193,405.\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr looks good. The patent describes a liquid or \u003Cem\u003Epartially-liquid\u003C/em\u003E metal battery, which lowers the heating requirements somewhat, using a host of different non-ferrous/alkali metals. It describes the calcium-antimony operating at 550 °C. Energy efficiency for that one was hovering around 72-73%, with a near-perfectly horizontal line on the graph of coulombic efficiency (how much a cell loses capacity over time) and energy efficiency plotted up to 40 cycle counts. Other configurations were tested to 1400 cycles with the same horizontal lines.\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting notes: the calcium alloy is 90% Ca, 10% magnesium, and the electrolyte has, at least in the patent, lithium chloride in addition to calcium chloride. One wonders how much or little they use of the LiCl (noting that even Li-ion batteries don\u0027t use that much).\n\u003C/p\u003E\n"},{"CreatedByName":"AckSed","CreatedById":224249,"CreatedDateTime":"2023-12-14T17:12:49Z","Content":"\n\u003Cp\u003E\nSince we\u0027re on the topic of batteries, \u003Ca href=\u0022https://energydome.com/our-technology/\u0022 rel=\u0022external nofollow\u0022\u003EEnergy Dome\u003C/a\u003E has my vote. It\u0027s supremely simple: use the properties of carbon dioxide to avoid the expensive cooling of liquid-air energy storage. Take a gasbag (already used in the biomethane industry), fill it with CO2; use renewable energy to compress the CO2 into liquid tanks, storing the heat of compression; when you need the electricity, open a valve and let the room-temp liquid CO2 expand through a turbine and back into the gasbag. Nearly all of this is off-the-shelf tech, too.\n\u003C/p\u003E\n\u003Cp\u003E\nI must also give a shout out to ESS Inc.\u0027s \u003Ca href=\u0022https://essinc.com/iron-flow-chemistry/\u0022 rel=\u0022external nofollow\u0022\u003Eiron flow battery\u003C/a\u003E, and the startup Aquabattery\u0027s \u003Ca href=\u0022https://www.statkraft.com/newsroom/news-and-stories/2023/cop28-statkraft-and-aquabattery-partner-to-develop-flow-batteries-made-with-salt-water/\u0022 rel=\u0022external nofollow\u0022\u003Eacid/base table salt battery\u003C/a\u003E. Both offer 12-hour storage which, believe it or not, is close to being enough to smooth out a solar/wind mixture\u0027s intermittency. They\u0027re also utilising non-toxic, easily-acquired materials.\n\u003C/p\u003E\n"}]}