{"TopicId":221212,"ForumId":11,"TopicTitle":"KSP2 For Science! Performance Check-in","CreatedByName":"Intercept Games","CreatedById":210281,"CreatedDateTime":"2023-12-14T00:03:17Z","PageNum":1,"Articles":[{"CreatedByName":"Intercept Games","CreatedById":210281,"CreatedDateTime":"2023-12-14T00:03:17Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-fileid=\u00221114\u0022 data-ratio=\u002256.33\u0022 data-unique=\u0022lzpt54rpb\u0022 style=\u0022width: 600px; height: auto;\u0022 width=\u0022801\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.png.99eb828b1f4c47f209673e34fae541a1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe team has been hard at work improving the performance of Kerbal Space Program 2 since launch, so we’d like to take a moment to really showcase the difference between the Early Access Launch (0.1.0.0) and the For Science! (0.2.0.0) release coming next week.\n\u003C/p\u003E\n\u003Cp\u003E\nHere’s a look at some graphs we use to understand the performance of the game and the improvements that have been made to our minimum specification and recommended specification machines: \n\u003C/p\u003E\n\u003Cp style=\u0022text-align: center;\u0022\u003E\n\u003Ca class=\u0022ipsAttachLink ipsAttachLink_image\u0022 href=\u0022https://kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.png.7b4731e1b1c7dbc52f1f9c858db31347.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-fileid=\u00221117\u0022 data-ratio=\u002256.17\u0022 data-unique=\u00227w4wfu0hw\u0022 style=\u0022width: 800px; height: auto;\u0022 width=\u00221200\u0022 alt=\u0022image.png\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.thumb.png.9b1ff288540cbf9ec04af8237812bf27.png\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\n\u003Cem\u003EMin Spec \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align: center;\u0022\u003E\n\u003Ca class=\u0022ipsAttachLink ipsAttachLink_image\u0022 data-fileext=\u0022png\u0022 data-fileid=\u00221098\u0022 href=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.png.ef8b4f956e2efe22c07616da4bac4b06.png\u0022 rel=\u0022\u0022\u003E\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-fileid=\u00221098\u0022 data-ratio=\u002256.33\u0022 data-unique=\u00228h1q0m0ui\u0022 style=\u0022width: 800px; height: auto;\u0022 width=\u00221200\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.thumb.png.2515120411c4a16fc35a0801155d00b0.png\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\n\u003Cem\u003ERecommended Spec \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis represents a huge amount of work by the development team across a number of features and releases. With performance optimization being one of the most frequent requests since launch, we\u0027re looking forward to hearing from players how this work improves the overall gameplay experience.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re curious about performance tuning and how we make decisions in that area, the rest of this check-in provides a high-level overview from our Engineering Team and should provide a bit of extra context for the above graphs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EPerformance 101 \u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see in the charts, performance varies quite a bit between various scenes players might find themselves in. When we’re investigating performance-related issues, we need to investigate many variables both in the game and on the physical machine. Let’s examine the basics of performance tuning and what we look at when trying to make decisions about performance optimization.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn keeping with the theme of For Science!, we should start with defining our experiments and the measurements we will use to determine if we are moving in the right direction. So, let’s start with Frames per Second (FPS), which many of you will already be familiar with. A frame is the period required to fully recalculate what has changed in the game state and redraw the scene to the player. The more FPS the smoother the game looks - and feels, as this allows us to capture inputs quicker and update the game state showing those updates to the user in a more responsive way.  \n\u003C/p\u003E\n\u003Cp\u003E\nWhen we are digging into performance, we want to look at that value in a different way: milliseconds per frame (ms). Why would we do that? Basically, we want to understand what, in a given frame, is taking up time so we can make it faster. For a 30 FPS goal, we get 33.3 milliseconds per frame, so it becomes a lot easier to set a budget for how much time a given section of the game should take. But what are we taking time from exactly? There are two pieces of hardware we generally are looking at for performance: the GPU and the CPU. \n\u003C/p\u003E\n\u003Cp\u003E\nAt a high level, a Graphics Processing Unit (GPU) is a piece of hardware that specializes in the types of calculations that are needed to render a given scene. It is much faster at smaller tasks in parallel than a Central Processing Unit (CPU) but much slower at running tasks in a series. In order to get the maximum performance out of a computer, we want to use both to their full potential and optimize the game accordingly.  \n\u003C/p\u003E\n\u003Cp\u003E\nNow some of you are thinking “What about memory, storage devices or things like that?” And you’re right that we do consider those things, but for the purposes of this overview we are going to concentrate on the biggest items that affect performance. But bonus points all around. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align: center;\u0022\u003E\n\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-fileid=\u00221099\u0022 data-ratio=\u0022122.03\u0022 data-unique=\u0022ci16y3aqv\u0022 width=\u0022295\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/monthly_2023_12/image.png.0b6d89909c673f205ee45dce1efd1607.png\u0022\u003E\u003Cbr\u003E\n\u003Cem\u003EAn example internal debug output  \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the important parts of performance tuning is to understand what the bottleneck is in each scene, either the CPU or the GPU. In the image above the CPU is taking 44ms per frame on a scene and the GPU is only taking 19ms. The CPU is the bottleneck in this case, so it doesn’t matter how much more optimization we do on the GPU. To improve this specific case on this specific hardware, we need to determine and target the most expensive operations on the CPU. \u003Cbr\u003E\n \u003Cbr\u003E\nOne of the challenges of making a PC game compared to consoles is the variety of hardware choices, specifically when it comes to CPUs and GPUs. There are thousands of combinations that someone could have, and each of them is going to perform slightly differently. That doesn’t even get into memory differences or software differences like operating system patches, hardware drivers, etc. This is why we publish minimum and recommended machine specifications - to help players understand what we have tested and if their machine should be able to play the game with adequate performance.  \n\u003C/p\u003E\n\u003Cp\u003E\nNow that we have some background on what developers look at for performance tuning, let’s go back up to those graphs at the top. For one, these are per-configuration graphs, which are used to tell us how the game is performing on that specific hardware. We do lots of these which help us to remove the hardware variables from the tests and just look at how the given build is performing overall. It also lets us look at this data over time and see if things are improving or not. As we add features, these will always affect performance, so we need to be checking the deltas consistently to determine where we need to spend time on improvements. The other thing these graphs help determine is if a given hardware setup has abnormal issues compared to other similar setups. A given manufacturer may have optimized their hardware in such a way that we get different performance out of certain improvements and knowing that helps us optimize the game for the entirety of our player-base across a wide range of hardware options. \n\u003C/p\u003E\n\u003Cp\u003E\n---\n\u003C/p\u003E\n\u003Cp\u003E\nWe hope that this has been informative! As we work towards larger performance optimization goals in the future, we’ll be sure to share updates in posts just like this – and perhaps take a more technical deep-dive in performance-focused dev blogs, so let us know if you’d like to see that! \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for reading and hope you enjoy For Science! \n\u003C/p\u003E\n\u003Cp\u003E\nKSP Team \n\u003C/p\u003E\n"},{"CreatedByName":"Datau03","CreatedById":223270,"CreatedDateTime":"2023-12-14T22:22:59Z","Content":"\n\u003Cp\u003E\nThis is great! Just 5 days until For Science! Hyypeeee\n\u003C/p\u003E\n"},{"CreatedByName":"Jaypeg","CreatedById":228190,"CreatedDateTime":"2023-12-14T22:25:40Z","Content":"\n\u003Cp\u003E\nNo way\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DibzNr","CreatedById":212219,"CreatedDateTime":"2023-12-14T22:28:01Z","Content":"\n\u003Cp\u003E\nAmazing to see how far this game has come this past year, can\u0027t wait for For Science!!\n\u003C/p\u003E\n"},{"CreatedByName":"Sade","CreatedById":226252,"CreatedDateTime":"2023-12-14T22:28:42Z","Content":"\n\u003Cp\u003E\nI wish that the 1.5 benchmark will be added to the figures, you know, to set expectations\n\u003C/p\u003E\n"},{"CreatedByName":"Sir Eskomaz","CreatedById":222560,"CreatedDateTime":"2023-12-14T22:29:09Z","Content":"\n\u003Cp\u003E\ngaming fr ong lit\n\u003C/p\u003E\n"},{"CreatedByName":"HammerTyme","CreatedById":227259,"CreatedDateTime":"2023-12-14T22:30:41Z","Content":"\n\u003Cp\u003E\nPerformance has definitely come a long ways since the early access launch. I’m very happy for that. Thank you devs. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow it’s just some of the annoying bugs I hope get squashed soon. Specifically the bugs with docking. I’ve been having issues with docking since day 1. The most annoying one is when I undock a vessel from another vessel, there’s always a high chance that it will blast away from it and at an angle all weirdly. Sometimes out of control and spinning.   Instead of a smooth decoupled motion moving in the opposite direction.  I hope this gets fixed soon. This is the main reason I’ve stopped playing for a while.  It was getting too frustrating for me. \n\u003C/p\u003E\n"},{"CreatedByName":"hidearimjosh","CreatedById":226610,"CreatedDateTime":"2023-12-14T22:35:29Z","Content":"\n\u003Cp\u003E\nheck yeah glad to see the improvements! \n\u003C/p\u003E\n"},{"CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2023-12-14T22:40:51Z","Content":"\n\u003Cp\u003E\nSeems like there\u0027s been some great optimisation passes since launch. Superb work! It would be fantastic to see 1% and 0.1% lows alongside Average FPS when looking at the benchmarks as, for a game like KSP, a nice constant 30fps is a lot more pleasant than say, a 60fps average with 1% lows of 5fps (frequent stutters or hitching).\n\u003C/p\u003E\n"},{"CreatedByName":"MARL_Mk1","CreatedById":192535,"CreatedDateTime":"2023-12-14T22:47:14Z","Content":"\n\u003Cp\u003E\nWonderful to see progress made across all fields. Even if it sounds doom-ish to say, I wish 0.2.0.0 had been the build KSP2 released with at EA launch.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd I\u0027ll also say, it\u0027s good to show 0.1.0.0 compared, but it\u0027s only fair we also had gotten a direct comparison between 1.0.5.0, which felt like a tiny introduction to 0.2.0.0 in terms of performance improvements and I\u0027m sure the difference gap isn\u0027t as big as with the broken mess (sorry, just being honestly blunt) 0.1.0.0 was.  I\u0027m still happy that the dev team kept their morale up and are working towards making KSP2 the best game it can be. We\u0027ve seen they are all super passionate people and that keeps me hopeful. I also hope we continue to get significant performance improvements like these. They are needed by the time Colonies and Interstellar are around.\u003Cbr\u003E\n\u003Cbr\u003E\nAll this said, hopefully docking isn\u0027t a death trap in 0.2.0.0 so I can actually complete many of the challenges posted throughout 2023 and not die from frustration trying!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-14T22:49:59Z\u0022 title=\u002212/14/2023 10:49  PM\u0022 data-short=\u0022Dec 14\u0022\u003EDecember 14, 2023\u003C/time\u003E by MARL_Mk1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mushylog","CreatedById":227298,"CreatedDateTime":"2023-12-14T22:52:36Z","Content":"\n\u003Cp\u003E\nGreat progress, KSP2 team! This is wonderful to see.\n\u003C/p\u003E\n\u003Cp\u003E\nI would love to read more posts like these, to know how you approach a certain challenge \u003Cem\u003E(whether you succeeded or not)\u003C/em\u003E. It is a shorter post than other big ones but I welcome it still! It is a nice read, not too long for those who fear the long ones. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E Good balance.\n\u003C/p\u003E\n"},{"CreatedByName":"the_tunnel","CreatedById":227343,"CreatedDateTime":"2023-12-14T22:53:18Z","Content":"\n\u003Cp\u003E\nLooks right.  what I experienced in 0.0.1.0 on a Intel 6700k and gtx 960 4gb. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-14T23:55:51Z\u0022 title=\u002212/14/2023 11:55  PM\u0022 data-short=\u0022Dec 14\u0022\u003EDecember 14, 2023\u003C/time\u003E by the_tunnel\u003C/strong\u003E\n\u003Cbr\u003EClarity\n\u003C/span\u003E\n"},{"CreatedByName":"Astroneer08","CreatedById":223777,"CreatedDateTime":"2023-12-15T00:41:52Z","Content":"\n\u003Cp\u003E\nThis is great! I\u0027ve been wondering about when the next dev update was. Also what happened to the UpNates?\n\u003C/p\u003E\n"},{"CreatedByName":"The_only_spaceace","CreatedById":214146,"CreatedDateTime":"2023-12-15T01:24:26Z","Content":"\n\u003Cp\u003E\nGreat work on the performance improvements, and I cant wait for science mode!\n\u003C/p\u003E\n"},{"CreatedByName":"rmaine","CreatedById":143945,"CreatedDateTime":"2023-12-15T17:59:59Z","Content":"\n\u003Cp\u003E\nGlad to see performance is getting work. I\u0027ll admit some of the nice-looking preview shots had me worried that those nice views might be hard on my poor 2080 (which was an expensive high-end card when I got it - $2k just for the GPU card). Two things have kept me from fiddling much with KSP2 so far. One was waiting for something like career mode; guess this release will be at least a start to that. The other is that although my system seems to run KSP 2, the noise of the GPU fans spinning up so fast tells me that the temps are getting higher than I want to inflict on my system (not to speak of the noise level being distracting). Looking forward to taking another peek at any rate, though my best guess is that it will still be a while before I\u0027m ready to play KSP 2 much. Doesn\u0027t seem like a great time for upgrading GPUs.\n\u003C/p\u003E\n"},{"CreatedByName":"pk9sp","CreatedById":229508,"CreatedDateTime":"2023-12-15T22:12:59Z","Content":"\n\u003Cp\u003E\nAwesome improvements! This will open up the game to a wider audience!\n\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2023-12-16T13:29:37Z","Content":"\n\u003Cp\u003E\nCare to explain why the benchmarks were performed in two different graphics card from two different brands?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy not test low and high specs on the same card? This is literally not informative at all.\n\u003C/p\u003E\n"},{"CreatedByName":"jebycheek","CreatedById":221190,"CreatedDateTime":"2023-12-16T14:02:21Z","Content":"\n\u003Cp\u003E\nThat is a big leap. but still the minimum spec still not looking good. keep it up guys.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2023-12-16T14:50:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224347733\u0022 data-ipsquote-contentid=\u0022221212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221702733377\u0022 data-ipsquote-userid=\u002257161\u0022 data-ipsquote-username=\u0022RockyTV\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, RockyTV said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCare to explain why the benchmarks were performed in two different graphics card from two different brands?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy not test low and high specs on the same card? This is literally not informative at all.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt shows a comparison between 0.1 and 0.2 pray tell what the “no information at all” part is,\n\u003C/p\u003E\n\u003Cp\u003E\nIf they test a single card the argument is that these tests are only relevant for \u003Ci\u003Ethat\u003C/i\u003E card. What they’re showing is that the performance increase is not limited to high-end or low-end setups, but on both ends (and reasonably, across the spectrum).\n\u003C/p\u003E\n\u003Cp\u003E\nOut of curiosity, what information would be derived from limiting the benchmark to a single card. And what would have prevented you in that case from complaining that the benchmark was limited to a single card?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-16T23:14:20Z\u0022 title=\u002212/16/2023 11:14  PM\u0022 data-short=\u0022Dec 16\u0022\u003EDecember 16, 2023\u003C/time\u003E by Kerbart\u003C/strong\u003E\n\u003Cbr\u003Efixed two tablet-induced typos\n\u003C/span\u003E\n"},{"CreatedByName":"Chilkoot","CreatedById":175911,"CreatedDateTime":"2023-12-17T17:38:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224347462\u0022 data-ipsquote-contentid=\u0022221212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221702663199\u0022 data-ipsquote-userid=\u0022143945\u0022 data-ipsquote-username=\u0022rmaine\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/15/2023 at 12:59 PM, rmaine said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne was waiting for something like career mode; guess this release will be at least a start to that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom what we\u0027ve heard, this is about as close as you\u0027re going to get to a career mode.  The missions (previously contracts) will reward science points toward progression, and currency as it was in KSP 1 is essentially gone from the game.\n\u003C/p\u003E\n\u003Cp\u003E\nThere will be other fungible resources that act as gating mechanisms - introduced later for colonies - but not a unified currency like we saw in KSP 1.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2023-12-19T01:00:29Z","Content":"\n\u003Cp\u003E\nGreat work \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/210281-intercept-games/?do=hovercard\u0022 data-mentionid=\u0022210281\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/210281-intercept-games/\u0022 rel=\u0022\u0022\u003E@Intercept Games\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\ndoes anyone know if this update brings it into range of running on the steam deck? \n\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2023-12-20T12:39:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224347746\u0022 data-ipsquote-contentid=\u0022221212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221702738256\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/16/2023 at 3:50 PM, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt shows a comparison between 0.1 and 0.2 pray tell what the “no information at all” part is,\n\u003C/p\u003E\n\u003Cp\u003E\nIf they test a single card the argument is that these tests are only relevant for \u003Ci\u003Ethat\u003C/i\u003E card. What they’re showing is that the performance increase is not limited to high-end or low-end setups, but on both ends (and reasonably, across the spectrum).\n\u003C/p\u003E\n\u003Cp\u003E\nOut of curiosity, what information would be derived from limiting the benchmark to a single card. And what would have prevented you in that case from complaining that the benchmark was limited to a single card?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey could\u0027ve tested both qualities in both cards. It shows to me and other skeptical players that they don\u0027t care at all and they are just continuing with deceiving players and constantly disappointing us.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-20T12:40:08Z\u0022 title=\u002212/20/2023 12:40  PM\u0022 data-short=\u0022Dec 20\u0022\u003EDecember 20, 2023\u003C/time\u003E by RockyTV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2023-12-20T12:55:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224349132\u0022 data-ipsquote-contentid=\u0022221212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703075969\u0022 data-ipsquote-userid=\u002257161\u0022 data-ipsquote-username=\u0022RockyTV\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, RockyTV said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey could\u0027ve tested both qualities in both cards. It shows to me and other skeptical players that they don\u0027t care at all and they are just continuing with deceiving players and constantly disappointing us.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCommunication is always a trade-off. Do you cater to the large crowd that wants to hear in a single-page update that performance has improved, with one or two graphs to substantiate that claim? Or do you spend the resources to create a detailed 75 page report covering every combination of GPU, CPU and memory to satisfy a few who want to see such details? Especially when those skeptics are likely to dismiss those charts as lies anyway?\n\u003C/p\u003E\n\u003Cp\u003E\nIf I had a deadline to meet and needed to make choices on what to have my people work on, I know what I would pick.\n\u003C/p\u003E\n"},{"CreatedByName":"aKaGorganZola","CreatedById":229295,"CreatedDateTime":"2023-12-21T16:21:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224349132\u0022 data-ipsquote-contentid=\u0022221212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703075969\u0022 data-ipsquote-userid=\u002257161\u0022 data-ipsquote-username=\u0022RockyTV\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/20/2023 at 7:39 AM, RockyTV said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey could\u0027ve tested both qualities in both cards. It shows to me and other skeptical players that they don\u0027t care at all and they are just continuing with deceiving players and constantly disappointing us.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat they\u0027re testing isn\u0027t the in game quality settings. It\u0027s the min and recommended system specs put out on the games product page. For only 2 pictures/tests it\u0027s probably the best way to show that the game is playable on the minimum specs at low settings and that the recommended specs can handle the max at playable fps. I agree they could\u0027ve done a few more tests and released say the recommended system at low, medium, and the high presets to give people an idea of the differences the in game settings make but for a quick check in I think it\u0027s well done.\n\u003C/p\u003E\n"},{"CreatedByName":"rmaine","CreatedById":143945,"CreatedDateTime":"2023-12-21T17:13:14Z","Content":"\n\u003Cp\u003E\nOne performance-related suggestion. The game runs fast enough on my system (with a GTX 2080). And the fan noise is down to a bit more than like instead of the fans blasting unacceptably at top speed as in earlier releases. I don\u0027t usually bother paying attention to FPS numbers as long as the game seems to be running smoothly enough. But I briefly turned on the option to show FPS and that gave me an idea. How about an option to limit FPS? This isn\u0027t a \u0022twitch\u0022 game (and I wouldn\u0027t be playing if it were). I bet my fan noise would largely go away if I could limit the FPS to, say, 30, which should still be fine for game play. I set a 30 limit in \u0022The Outer Worlds\u0022 and it helps greatly there. The only FPS limit thing I see in KSP 2 is the option for video sync, which essentially sets FPS to 60. Oddly, where I\u0027m currently seeing the highest FPS numbers, along with fan noise that would be unacceptable if it continued, is in the setup menu, which sure doesn\u0027t need diddly squat for FPS.\n\u003C/p\u003E\n"}]}