{"TopicId":22166,"ForumId":34,"TopicTitle":"Kethane Pack 0.9.2 - New cinematic trailer! - 1.0 compatibility update","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2012-10-14T12:08:20Z","PageNum":153,"Articles":[{"CreatedByName":"Artos_The_Great","CreatedById":98445,"CreatedDateTime":"2013-12-24T16:25:32Z","Content":"\n\u003Cp\u003EFor some reason The loading screen gets stuck on loading the Kethane_Generator part.\u003C/p\u003E\n"},{"CreatedByName":"team.leit","CreatedById":68347,"CreatedDateTime":"2013-12-24T16:41:19Z","Content":"\n\u003Cp\u003ECan the Kethane converter convert kethane into the resources used by \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/40667-0-23-WIP-TAC-Life-Support-0-8-22Dec\u0022 rel=\u0022external nofollow\u0022\u003ETAC Life Support\u003C/a\u003E or do I have to change the configs myself?\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T17:01:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022russkey\u0022 data-cite=\u0022russkey\u0022\u003E\u003Cdiv\u003EIt would enable Kerbal Engineer to make good delta-v predictions for a full mining craft. Or is that cheating too? Should I get my slide rule out?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are allowed a calculator for this exam.\u003C/p\u003E\n"},{"CreatedByName":"russkey","CreatedById":75757,"CreatedDateTime":"2013-12-24T17:30:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EYou are allowed a calculator for this exam.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh man, it\u0027s been years since I\u0027ve heard those words! I still think it would be wonderfully convenient to be able to tweak the Kethane volumes. You don\u0027t have to use it if you feel it is cheaty!\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T17:38:38Z","Content":"\n\u003Cp\u003EI would probably just throw in an equivalent weight using part clipping to figure out delta v.\u003C/p\u003E\n"},{"CreatedByName":"russkey","CreatedById":75757,"CreatedDateTime":"2013-12-24T17:57:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EI would probably just throw in an equivalent weight using part clipping to figure out delta v.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sounds like a hack.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T18:51:16Z","Content":"\n\u003Cp\u003EIt\u0027s the equivalent of just using lead weights. It won\u0027t be perfect, but it\u0027ll get you close. You can always break out the calculator or send up mission after mission until you succeed at your original goal.\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2013-12-24T19:00:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EThat would be cheating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would it be cheating? There\u0027s plenty of Kethane on Kerbin (and it\u0027s very easy to mine), so it should be readily available to the space program. Moreover, given that kethane has a worse delta-V to mass ratio than any other fuel, I can\u0027t imagine many scenario\u0027s in which it would be desirable to build rockets with full kethane tanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-24T19:09:01Z\u0022 title=\u002212/24/2013 07:09  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 24, 2013\u003C/time\u003E by Fraz86\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2013-12-24T19:05:11Z","Content":"\n\u003Cp\u003EJust a thought: with tweakables, the tanks could be toggled between empty and full in the VAB, but always load empty on the launchpad (with no tweakable option there).\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T19:06:21Z","Content":"\n\u003Cp\u003EKerbin doesn\u0027t even know it\u0027s there until you throw a satellite up to search for it.\u003C/p\u003E\n"},{"CreatedByName":"Farix","CreatedById":98315,"CreatedDateTime":"2013-12-24T19:15:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EKerbin doesn\u0027t even know it\u0027s there until you throw a satellite up to search for it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut how is wanting to know how the total weight of a full kethan tank will affect a vehicle\u0027s delta-v be \u0022cheating\u0022? You aren\u0027t making any sense.\u003C/p\u003E\n"},{"CreatedByName":"Gaius","CreatedById":66495,"CreatedDateTime":"2013-12-24T20:28:54Z","Content":"\n\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EYou\u0027re attempting to make logical arguments to someone who thinks it\u0027s possible to cheat in a single-player sandbox game. You\u0027re either feeding a troll or wasting your time. Just ignore \u0027em...\u003C/p\u003E\n"},{"CreatedByName":"CaelReader","CreatedById":2146,"CreatedDateTime":"2013-12-24T20:32:18Z","Content":"\n\u003Cp\u003EThe Kethane tanks have a \u0022Wet Mass\u0022 number if you right click on them in the parts list.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T21:53:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IrishBandit\u0022 data-cite=\u0022IrishBandit\u0022\u003E\u003Cdiv\u003EThe Kethane tanks have a \u0022Wet Mass\u0022 number if you right click on them in the parts list.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat doesn\u0027t help with MechJeb or Engineer\u0027s delta-v numbers, as far as I remember them. I don\u0027t remember what Engineer is capable of. Mechjeb won\u0027t use wet weight in VAB.\u003C/p\u003E\u003Cp\u003EThe Rockomax\u0027s are pretty close in weight.\u003C/p\u003E\u003Cp\u003EMy \u0022cheating\u0022 comment was more tongue in cheek than anything else. The spirit of kethane is to go out and find it and mine it yourself, which certainly isn\u0027t quite what russkey wanted. But yes, you can cheat in single player. There are built in rules in all games and breaking them is cheating. You\u0027re only cheating yourself out of what the programmer wanted you to experience, but still.\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2013-12-24T22:01:24Z","Content":"\n\u003Cp\u003EHello friend I installed the mod correctly but kerbin planet textures in the game menu adulterated me appear as hexagonal shapes you have any idea that causes this? Thank you.\u003C/p\u003E\n"},{"CreatedByName":"LordAldrich","CreatedById":75838,"CreatedDateTime":"2013-12-24T22:14:56Z","Content":"\n\u003Cp\u003EIf you mean that there are hexagons above Kerbin while in the game menu, that\u0027s a good thing! Load a normal game, open up the map and there should be a button to turn on the Kethane overlay. You will see the same grid, but all grey. The hexagons get filled in with green and white when you scan for Kethane.\u003C/p\u003E\u003Cp\u003EIs that what you meant?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HECHICERO100\u0022 data-cite=\u0022HECHICERO100\u0022\u003E\u003Cdiv\u003EHello friend I installed the mod correctly but kerbin planet textures in the game menu adulterated me appear as hexagonal shapes you have any idea that causes this? Thank you.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2013-12-24T22:14:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HECHICERO100\u0022 data-cite=\u0022HECHICERO100\u0022\u003E\u003Cdiv\u003EHello friend I installed the mod correctly but kerbin planet textures in the game menu adulterated me appear as hexagonal shapes you have any idea that causes this? Thank you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is meant to happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2013-12-24T22:31:49Z","Content":"\n\u003Cp\u003EIf it\u0027s in the game menu appears where kerbin where and textures are hexagonal. They mean that there is no way to fix it we are destined to play well? Because the truth is very ugly .......\u003C/p\u003E\n"},{"CreatedByName":"russkey","CreatedById":75757,"CreatedDateTime":"2013-12-24T22:32:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EThat doesn\u0027t help with MechJeb or Engineer\u0027s delta-v numbers, as far as I remember them. I don\u0027t remember what Engineer is capable of. Mechjeb won\u0027t use wet weight in VAB.\u003Cp\u003EThe Rockomax\u0027s are pretty close in weight.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA quick test shows that Engineer recalculates Dv when the volume of fuel in a normal tank is tweaked. Is there any other tweakable that would change the weight of the craft? Because Engineer might just be recalculating based on fuel change, not on fuel AND mass change.\u003C/p\u003E\n"},{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2013-12-24T23:12:27Z","Content":"\n\u003Cp\u003EI am interested in this mod, but I want to know the game logic before I install the mod\u003C/p\u003E\u003Cp\u003E1) Is kethane a renewable resource? Will kethane exhaust in a plant/ moon\u003C/p\u003E\u003Cp\u003E2) can I scan kethane by plane/ rover?\u003C/p\u003E\u003Cp\u003E3) If whole block of kethane store under the ocean, how can I extract it?\u003C/p\u003E\u003Cp\u003EThank you:)\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-12-24T23:48:06Z","Content":"\n\u003Cp\u003E1) no, kethane is not (currently) renewable.\u003C/p\u003E\u003Cp\u003E2) yes, but... ouch. Hexes on kerbin are about 30km across, iirc.\u003C/p\u003E\u003Cp\u003E3) depends on the depth, but either way needs mods. Less than 600m: Hooligan labs submersibles might do the trick. 600m to 2km: Kerbal attachment system (though getting your drill head to sink might be a challenge). (much) more than 2km: forget it, though you can combine the subs with KAS to get to about 2.5km.\u003C/p\u003E\u003Cp\u003EThe main thing to watch out for is that due to KSP mechanics, it is currently not possible to scan in the background (the scanning ship must be in physics range). This is a long standing wish-list item that depends on a lot of internal infrastructure, so I thought I\u0027d head it off at the pass \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-24T23:54:03Z","Content":"\n\u003Cp\u003EAny hex that touches another hex and has the same kethane deposit number is the same patch. You can draw from any of the connected hexes and you will take from all of the them. They are connected. Each hex is not an individual deposit.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-12-25T06:49:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Farix\u0022 data-cite=\u0022Farix\u0022\u003E\u003Cdiv\u003EBut how is wanting to know how the total weight of a full kethan tank will affect a vehicle\u0027s delta-v be \u0022cheating\u0022? You aren\u0027t making any sense.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find MFS indispensable for creating \u0022test masses.\u0022 These are basically configurable inert objects of the desired mass that won\u0027t be considered in any KER dV calculation. You get a simple fuel tank that\u0027s big enough (or even better a stretchy) and fill it full of some weird mass of fuel none of your engines use (e.g. Aerozine). Then by manipulating the fill or stretchy height you can make an exact test mass. Saving these test masses as sub assemblies allows them to be referenced later. I use them for reserved fuel quantities, landers, satellites, etc. Properly shaped test masses can be flight test articles. You can even use test masses to provide allowances for designs yet to be conceived (lander will be 7MT or less) and then build that assembly later to spec limit.\u003C/p\u003E\n"},{"CreatedByName":"scythist","CreatedById":98564,"CreatedDateTime":"2013-12-25T20:30:21Z","Content":"\n\u003Cp\u003Ewell i just joined the forum because i got a specific problem. I have tried searching threads for this issue to no avail, so if someone has posted about this please direct me to where i might go for a fix.\u003C/p\u003E\u003Cp\u003EMy issue: I was playing kerbal after the most recent update and upon doing a drill activity i realized it wasnt working. Of course this awesome mod was updated so i therefore grabbed the update and replaced the old kethane mod folder. Everything works correctly except for one issue i cant seem to hunt down. For some reason the grid overlay for kethane on both minmus and mun is just messed. It shows as if only a portion of the planet and enlarged and just impossible to do actual scans and land where a kerbal needs to land.\u003C/p\u003E\u003Cp\u003EBefore i had updated the kethane mod i had scanned minmus a little but NOT the mun and yet this issue affects both moons AND ONLY those two moons. I tried starting a new career and a new sandbox with the exact same issues.\u003C/p\u003E\u003Cp\u003EEdited in 5 min later: ALSO the grid overlays themselves for both mun and minmus dont even show up in the tracking center or the solar system map... i literally have to be at the mun or minmus to get the issue I\u0027m talking about otherwise there is no hex overlay whatsoever.\u003C/p\u003E\u003Cp\u003EIf anyone has a clue to what is going on i would love some input. \u003C/p\u003E\u003Cp\u003Ei have also updated all the mods i have that could be updated and other then kethane KAS and mechjeb the other few mods i have are parts only.\u003C/p\u003E\u003Cp\u003Eany input or thread redirect is much appreciated\u003C/p\u003E\u003Cp\u003Eand since this is my first time posting let me say thanks to the makers of Kethane mod and all the others, you folks do a great job\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-25T20:53:06Z\u0022 title=\u002212/25/2013 08:53  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 25, 2013\u003C/time\u003E by scythist\u003C/strong\u003E\n\u003Cbr\u003Eslightly stoned bad grammar and i forgot something\n\u003C/span\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-12-25T21:51:38Z","Content":"\n\u003Cp\u003EWhat other mods do you use? Read back 5-10 pages. There was a grid issue with another mod I forget the name of because I don\u0027t use that particular mod.\u003C/p\u003E\n"}]}