{"TopicId":22166,"ForumId":34,"TopicTitle":"Kethane Pack 0.9.2 - New cinematic trailer! - 1.0 compatibility update","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2012-10-14T12:08:20Z","PageNum":76,"Articles":[{"CreatedByName":"fractl","CreatedById":57519,"CreatedDateTime":"2013-07-17T08:01:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brecers\u0022 data-cite=\u0022brecers\u0022\u003E\u003Cdiv\u003EAdd a button that would disable the sound scan.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat button has been there as long as I can remember this mod existing so you must be missing something..\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-17T09:43:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EYeah, and I\u0027ve been meaning to change this. I still need to consolidate some of the extractor code since currently the two drills have fairly different logic.\u003Cp\u003EYes. This was requested long ago but the old scan format didn\u0027t facilitate exporting that kind of data. With the grid, it\u0027s a simple loop.\u003C/p\u003E\u003Cp\u003EIt\u0027s not. The 2D map is for export only.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure why some of you think a 2D map is more useful. I can see that it\u0027s useful in conjunction with other 2D maps like ISA, but imagine if those same maps were projected on a 3D surface. It\u0027s not so much a shortcoming of the 3D format as it is a shortcoming of ISA. The export function is there to help people out but I have no plans to return to a two-dimensional format, and the raw image export might not make it in depending on how the deposit and scanning revisions turn out. I do aim to support at least some kind of data export, and per-cell data might be the more appropriate way to do that. (Rendering an image is really a gigantic pain. Go support \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/37918-Lift-System-IO-and-System-Xml-bans-for-plugin-developers\u0022 rel=\u0022external nofollow\u0022\u003Ethis request\u003C/a\u003E if you want to make it a tad easier.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would be VERY happy just to have some way of getting the data exported out to some usable file. the center of the hex bin in lat, lon and some value for that bins kethane... Not asking for any additional rendering or work. Just like you stated, during loop for creation of the 2D map or somewhere, a simple dump out to some file kethane_mun.txt for example would be excellent.\u003C/p\u003E\u003Cp\u003Ethanks for all of your work.\u003C/p\u003E\u003Cp\u003EDrTedAstro.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-07-17T10:08:52Z","Content":"\n\u003Cp\u003EI prefer it not changes the game\u0027s map with Kethane. That is ugly on there!\u003C/p\u003E\n"},{"CreatedByName":"Berserker66","CreatedById":71379,"CreatedDateTime":"2013-07-17T11:42:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Climberfx\u0022 data-cite=\u0022Climberfx\u0022\u003E\u003Cdiv\u003EI prefer it not changes the game\u0027s map with Kethane. That is ugly on there!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethen turn if off in the kethane config.\u003C/p\u003E\n"},{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2013-07-17T11:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Berserker66\u0022 data-cite=\u0022Berserker66\u0022\u003E\u003Cdiv\u003Ethen turn if off in the kethane config.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I do that, is there a 2d map available as an alternative?\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2013-07-17T13:02:57Z","Content":"\n\u003Cp\u003ECan you make it so that running the mouse over the map when it isn\u0027t filled in doesn\u0027t lag the game?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-07-17T13:05:05Z","Content":"\n\u003Cp\u003ENo, it\u0027s 3d map or nothing, but the menu screen overlay is optional.\u003C/p\u003E\n"},{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2013-07-17T14:14:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003ENo, it\u0027s 3d map or nothing\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. I wish that people wouldn\u0027t remove features from things. Adding the 3d map is all well and good (well, except for increased system resource use), but I don\u0027t see why the 2d map was removed. Hidden unless you right click on the detector and show it is one thing, but simply removed is frustrating.\u003C/p\u003E\u003Cp\u003EThere are (many) times where I want to see an overview of the map while being able to look at other things.\u003C/p\u003E\n"},{"CreatedByName":"Delling","CreatedById":57123,"CreatedDateTime":"2013-07-17T14:21:11Z","Content":"\n\u003Cp\u003EI\u0027m an old GIS geek, and I\u0027d just like to pitch in some support for keeping any kind of 2D output to file of the information. I\u0027ve used separate mapping software to check ISA height data with an overlay of Kethane deposits to try to identify high-yield landing areas that are flat(-ish). As been said before, there is no night side and it\u0027s way easier to analyze the data outside of KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-17T14:22:49Z\u0022 title=\u002207/17/2013 02:22  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 17, 2013\u003C/time\u003E by Delling\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-07-17T17:32:05Z","Content":"\n\u003Cp\u003EData export (cell location, scanned status and resource quantity) will definitely make it in. A 2D map export \u003Cem\u003Emight\u003C/em\u003E make it in (I\u0027m leaning toward no, but we\u0027ll see, and in any event someone could write a renderer with the data export). The old 2D map will not return as an in-game feature because it had technical problems and the code was a pain to maintain. I\u0027m also working on opening up more of the Kethane API on the plugin itself. I worked last night with someone who was building a MechJeb module that automatically performs inclination changes to improve Kethane scanning. As posted earlier, I\u0027m also working on the grid shader so it can illuminate night-side terrain. (I need to work on this a bit because the shader alone isn\u0027t going to do the job.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Lone Wolfling\u0022 data-cite=\u0022The Lone Wolfling\u0022\u003E\u003Cdiv\u003EExactly. I wish that people wouldn\u0027t remove features from things. Adding the 3d map is all well and good (well, except for increased system resource use), but I don\u0027t see why the 2d map was removed. Hidden unless you right click on the detector and show it is one thing, but simply removed is frustrating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe new map uses more GPU and CPU time but less memory and disk space, the code is much easier to maintain, and the save format is much more portable and malleable. The GPU is only used when you\u0027re in the map view (which is a simpler scene anyway), and as of the 0.7.3 update, the CPU usage is quite light. In technical terms, the 3D map is a big improvement. Keeping the 2D map would be a big pain. It\u0027s \u003Cem\u003Emaybe kinda possible\u003C/em\u003E that a new 2D renderer could be built, but it would probably have to work in a similar way as the grid (rendering geometry instead of drawing pixels to a buffer). I\u0027d much rather support third-party utilities than clutter up the codebase. With a more open API, someone can write a plugin that interfaces with Kethane and draws the map itself. (Have fun getting it to work in real time!)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://xkcd.com/1172/\u0022 rel=\u0022external nofollow\u0022\u003EEvery change breaks someone\u0027s workflow\u003C/a\u003E, but I\u0027m very happy with the new map now that performance issues have been resolved, and the overwhelming response has been in agreement. I think you\u0027ll find the changes coming to be helpful, and I hope you\u0027ll embrace more innovative ideas too (like illuminating the night side or overlaying altitude data on the globe rather than trying to view Kethane on a rectangle).\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-07-17T18:39:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Berserker66\u0022 data-cite=\u0022Berserker66\u0022\u003E\u003Cdiv\u003Ethen turn if off in the kethane config.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think i wasn\u0027t clear. On start up screens. To not modify start up screens. In game on map mode, i love it!\u003C/p\u003E\n"},{"CreatedByName":"BloodyRain2k","CreatedById":50835,"CreatedDateTime":"2013-07-17T19:10:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Climberfx\u0022 data-cite=\u0022Climberfx\u0022\u003E\u003Cdiv\u003EI think i wasn\u0027t clear. On start up screens. To not modify start up screens. In game on map mode, i love it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022neurotoxin\u0022 data-cite=\u0022neurotoxin\u0022\u003E\u003Cdiv\u003ELooking into the source on Github it looks like the value you want to set is ShowInMenu.\u003Cp\u003EAfter some trial and error I figured it out. I placed ShowInMenu in the following location\u003C/p\u003E\u003Cp\u003EScanningSound = True\u003C/p\u003E\u003Cp\u003EShowInMenu = False\u003C/p\u003E\u003Cp\u003EShowOverlay = False\u003C/p\u003E\u003Cp\u003EFor some reason it kept reverting my changes when I placed it at the end although it might work for you there. So edit GameData/Kethane/settings.cfg and then start your game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas just mentioned on the previous page.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-17T20:00:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EEvery change breaks someone\u0027s workflow\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust look at how many people scream bloody murder every time Facebook gets an update....\u003C/p\u003E\u003Cp\u003EI personally would LOVE to see the proposed changes to the grid! (Altitude under mouse over, dark side lighting while grid is turned on)\u003C/p\u003E\u003Cp\u003EAs for third party interfacing with Kethane for the 2d map,, I know he\u0027s been super busy lately but perhaps we can knock in the ISA developers door for that one? Having those combined would be amazing too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2013-07-17T20:06:36Z","Content":"\n\u003Cp\u003EThe 2D map is better for mission planning (easier to take the image and lay them next to each other)\u003C/p\u003E\u003Cp\u003EHowever the 3D map is vital for those of us that are A) a few points away from legally blind without vision correction and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Have a small monitor because we are poor.\u003C/p\u003E\u003Cp\u003EAnd as he says, the way he did the 3D map is actually much better because it renders on the fly rather than being a static image that is updated to have the deposits revealed. Previously those 2D maps were basically a picture in your folder that was slowly updated. Now it is just a small file that says where the deposits are and the plugin renders it on the go. The difference in resource usage is actually pretty minimal.\u003C/p\u003E\u003Cp\u003EFrom an in-game perspective, it is also easier to use in my opinion. Ignoring the aforementioned eyesight problems, in my opinion it is much easier to see exactly where the gaps are and see where exactly a deposit is in relation to the world. The 2D map was always frustrating to me because it puts things in terms of coordinates that have a totally arbitrary origin. There is nothing on the surface of Kerbin that denotes a prime meridian. The Equator is easy enough, sure, but the meridians are totally arbitrary. And as a note, KSC is not at the prime meridian! So I would read these deposits at XX N and XX W, but that does not really tell me much when trying to land or see if the deposit is in the ocean.\u003C/p\u003E\n"},{"CreatedByName":"gerryrbd","CreatedById":66061,"CreatedDateTime":"2013-07-17T22:57:24Z","Content":"\n\u003Cp\u003EI love the grid and for me it has been a complete replacement of the 2d map. Not to mention linux \u003Cem\u003Estill\u003C/em\u003E has some issues with KSP\u0027s png files and the fewer we need the better.\u003C/p\u003E\u003Cp\u003EOn a side note, I would regard with unreserved and profuse gratification any further development of kethane catalytic reactors; such as radial engines, airospikes, and the like. *Profusely*\u003C/p\u003E\n"},{"CreatedByName":"Syrikzero","CreatedById":50994,"CreatedDateTime":"2013-07-18T00:09:02Z","Content":"\n\u003Cp\u003EYea I 2nd the above. More engines would be nice for kethane and maybe a converter that has a force drain to the engine to convert for say a kintake engine to a solid like engine (a booster perhaps)?\u003C/p\u003E\u003Cp\u003EPlus satellite styled kethane scanners? The design could look like the new 3d grid itself with green flashing lights maybe...I have a bunch of ideas for this project...would be nice if I could jump on the band wagon (I draw alot.....alot I used to study at the art institute of atlanta.) As far as 3d modeling I can do that as well just never attempted for ksp.\u003C/p\u003E\n"},{"CreatedByName":"Farnsworth","CreatedById":70315,"CreatedDateTime":"2013-07-18T00:17:16Z","Content":"\n\u003Cp\u003EYeah, the grid rocks, and 7.3 completely eliminated stuttering for me.\u003C/p\u003E\n"},{"CreatedByName":"robot256","CreatedById":67902,"CreatedDateTime":"2013-07-18T00:33:20Z","Content":"\n\u003Cp\u003EI have to say I love the new map too. But is there a way to get back the \u0022last deposit\u0022 indicator, or some facsimile of it? When my prospecting rover is driving over the ground, I can\u0027t tell when it crosses the deposit boundary because the entire map was already scanned from orbit, and the detector sound seems to be broken for me.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-18T00:34:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gerryrbd\u0022 data-cite=\u0022gerryrbd\u0022\u003E\u003Cdiv\u003EI love the grid and for me it has been a complete replacement of the 2d map. Not to mention linux \u003Cem\u003Estill\u003C/em\u003E has some issues with KSP\u0027s png files and the fewer we need the better.\u003Cp\u003EOn a side note, I would regard with unreserved and profuse gratification any further development of kethane catalytic reactors; such as radial engines, airospikes, and the like. *Profusely*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always thought there needed to be a kethane engine for use in space. I was working on one that uses kethane and oxi. It has issues with burn rate though, plus I kinda suck at making engine bells.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-07-18T00:42:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BloodyRain2k\u0022 data-cite=\u0022BloodyRain2k\u0022\u003E\u003Cdiv\u003EWas just mentioned on the previous page.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you BloodyRain2k. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did it!\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-07-18T01:27:18Z","Content":"\n\u003Cp\u003ERe. engine concepts, I\u0027ve written up a couple of my part concepts on the wiki: \u003Ca href=\u0022https://github.com/Majiir/Kethane/wiki/Future-Part-Concepts\u0022 rel=\u0022external nofollow\u0022\u003Efuture part concepts\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-18T01:46:04Z","Content":"\n\u003Cp\u003EMajiir, that pressure-fed engine concept sounds amazing. Bootstrapping it with RCS while in space is genius!\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-07-18T01:58:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dave4002000\u0022 data-cite=\u0022dave4002000\u0022\u003E\u003Cdiv\u003EMajiir, that pressure-fed engine concept sounds amazing. Bootstrapping it with RCS while in space is genius!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReal spacecraft do this because pressure-fed engines are very common for orbital engines. (I believe the Apollo spacecraft had to use RCS in order to push fuel toward the back for the transfer engine.) Larger pressure-fed engines don\u0027t need another engine for assistance because gravity does the job, and we haven\u0027t launched big pressure-fed boosters into orbit yet.\u003C/p\u003E\n"},{"CreatedByName":"PixeledGaming","CreatedById":69412,"CreatedDateTime":"2013-07-18T04:19:45Z","Content":"\n\u003Cp\u003EWondering if anyone has the same problem as me. When I launch a spacecraft into space after installing the mod, I can\u0027t end the flight or go to the space center via the space center button. Whenever I press those buttons they act like the resume game button, can anyone solve my problem?\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-07-18T04:36:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EReal spacecraft do this because pressure-fed engines are very common for orbital engines. (I believe the Apollo spacecraft had to use RCS in order to push fuel toward the back for the transfer engine.) Larger pressure-fed engines don\u0027t need another engine for assistance because gravity does the job, and we haven\u0027t launched big pressure-fed boosters into orbit yet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe larger apogee engines on Earth-orbiting satellites also use pressure-fed fuels. However, we keep the tank pressures high enough (and the flow rates are small enough) that we don\u0027t need to fire RCS thrusters to \u0022bootstrap\u0022 it first.\u003C/p\u003E\n"}]}