{"TopicId":22175,"ForumId":16,"TopicTitle":"Keeping G-Forces low for re-entry?","CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-10-14T15:00:28Z","PageNum":1,"Articles":[{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-10-14T15:00:28Z","Content":"\n\u003Cp\u003EWhat\u0027s the best way to re-enter Kerbin, keeping your G-forces under 12Gs? Recently got into the re-entry mod and it causes you to explode at 11.6Gs \u0026lt;-Is that realistic or could I bump that up to 12-12.5 Gs before you explode?\u003C/p\u003E\u003Cp\u003EAs an addition, is there an auto-rendezvous on MechJeb? There\u0027s a rendezvous button but it just gives more information, not automatic. I\u0027m learning how to rendezvous better but some automation would be helpful when I don\u0027t want to go through the tediousness myself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-14T15:05:25Z\u0022 title=\u002210/14/2012 03:05  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 14, 2012\u003C/time\u003E by Pingonaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UNSC","CreatedById":31653,"CreatedDateTime":"2012-10-14T15:01:44Z","Content":"\n\u003Cp\u003Ere-enter as slow as you can rather than just diving in.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-10-14T15:03:07Z","Content":"\n\u003Cp\u003EWell yeah but I\u0027m wanting a bit more than just go slowly. I\u0027d like just a general max altitude to come in from and best angle.\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-10-14T15:06:56Z","Content":"\n\u003Cp\u003EThe ideal descent profile would go smoothly from a low slope to a high slope, but the main problem is that the closer you get to the planet, the faster you will go (until you are actually slowed down by the atmosphere).\u003C/p\u003E\u003Cp\u003EIf you place your Pe somewhere around 30-35 km, it generally ensures that you will not get over 5G, but it really depends on what altitude you start your deorbit burn.\u003C/p\u003E\n"},{"CreatedByName":"dikkjo","CreatedById":32555,"CreatedDateTime":"2012-10-14T15:12:10Z","Content":"\n\u003Cp\u003EWell it always depend where you were coming from, i.e if you are getting back from Jool you will probably go much faster than if you get back from the moon. anyway not getting your periapsis below 30\u0027000 on reentry is a good starting point \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-10-14T15:18:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cykyrios\u0022 data-cite=\u0022Cykyrios\u0022\u003E\u003Cdiv\u003EThe ideal descent profile would go smoothly from a low slope to a high slope, but the main problem is that the closer you get to the planet, the faster you will go (until you are actually slowed down by the atmosphere).\u003Cp\u003EIf you place your Pe somewhere around 30-35 km, it generally ensures that you will not get over 5G, but it really depends on what altitude you start your deorbit burn.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat makes it hard for me, I like to land near KSC in the ocean next to it, so it makes it difficult to judge where I\u0027m going to land when I\u0027m not bringing my pe down low.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dikkjo\u0022 data-cite=\u0022dikkjo\u0022\u003E\u003Cdiv\u003EWell it always depend where you were coming from, i.e if you are getting back from Jool you will probably go much faster than if you get back from the moon. anyway not getting your periapsis below 30\u0027000 on reentry is a good starting point \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsually when I re-enter Kerbin I bring my apo to 100 and peri to whatever, so that doesn\u0027t vary for me.\u003C/p\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2012-10-14T17:43:01Z","Content":"\n\u003Cp\u003EFor context, max g-force for a real world space shuttle during re-entry is around 3 g, and around 7 g for a pod, according to wikipedia. Around 5 g, is the limit for an untrained human being before loosing conciousness, though with special training and suits, one can handle a lot more, with a risk of dying being around 25 g. However, these limits also depend on the duration of the effect and the limit for a machine is very specific.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-10-14T17:54:09Z","Content":"\n\u003Cp\u003EI do 18KM PE, and thats fine on kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-10-14T18:12:39Z","Content":"\n\u003Cp\u003EThanks for the info, I guess 11Gs is pretty bad, I guess I\u0027ll just have to get good at it!\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-10-14T19:37:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pingonaut\u0022 data-cite=\u0022pingonaut\u0022\u003E\u003Cdiv\u003EThat makes it hard for me, I like to land near KSC in the ocean next to it, so it makes it difficult to judge where I\u0027m going to land when I\u0027m not bringing my pe down low. \u003Cp\u003EUsually when I re-enter Kerbin I bring my apo to 100 and peri to whatever, so that doesn\u0027t vary for me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried to work within the game\u0027s existing UI when I set the limit for max G\u0027s in the re-entry heat module. You won\u0027t have any trouble re-entering if you keep the g indicator needle out of the red arc on the navball. The longer the needle stays in the red arc, the more damage your spacecraft will sustain. And the higher the g\u0027s you experience, the quicker the spacecraft will reach its damage tolerance threshold.\u003C/p\u003E\u003Cp\u003EIn playing with the re-entry heat module myself, I have found that shallower trajectories result in increased shield temperatures (lower heat flux but high maximum temperatures due to longer term exposure), while steep trajectories result in higher g\u0027s and lower shield temperatures (i.e. high heat flux but lower maximum temperatures due to shorter term exposure).\u003C/p\u003E\u003Cp\u003EI have also been working on the next release of the plugin already, in preparation for MrPwner\u0027s contribution to the project. His heat shield model will include a transparent bow shock effect that I will be able to display during re-entry as appropriate per the physics model. I have also added a \u0022hard-core\u0022 mode that will allow users of the re-entry heat module to enable a lift force in the part\u0027s configuration file. Playing with the module with the lift enabled, I\u0027ve found that it tends to reduce re-entry g\u0027s but increases heating due to longer term exposure to high temperatures. That result will probably require that slightly steeper trajectories be used when the \u0022hardcore\u0022 mode is active.\u003C/p\u003E\n"}]}