{"TopicId":222109,"ForumId":119,"TopicTitle":"Science is pretty much stupid. Just get rid of it.","CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2023-12-26T13:56:32Z","PageNum":11,"Articles":[{"CreatedByName":"SpazeGibbonz","CreatedById":232115,"CreatedDateTime":"2024-01-08T22:32:12Z","Content":"\n\u003Cp\u003E\nI hope this is not considered \u0022necro\u0022, but tbh i 100% share OPs sentiment.\u003Cbr\u003E\n\u003Cbr\u003E\nThis is actually the number 1 reason i just joined these forums and i\u0027m glad to see i\u0027m not the only one having a problem with the new science system - or the lack of it.\u003Cbr\u003E\n\u003Cbr\u003E\nThere\u0027s surely things i like, primarily the change in runtime and the accompanying need to be in a specific state (flying through atmosphere eg) for that timeframe.\u003Cbr\u003E\nAlso i don\u0027t mind the info about being in a biome i can perform experiments in, i\u0027m pretty neutral to the button itself.\u003Cbr\u003E\n\u003Cbr\u003E\nHowever i really do dislike the simplified \u0022one-click serves all\u0022 solution as it is currently implemented.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd quite frankly i don\u0027t care if NASA would spend 20bucks on a wire attached to a multi-million dollar probe. We\u0027re not talking NASA, we\u0027re talking Kerbals: The same creatures not attaching any safety to EVA pilots because \u0022a rigid beam is not flexible enough\u0022 - if that quote is not 100% correct it still is something paraphrased directly out of KSP2.\u003Cbr\u003E\n\u003Cbr\u003E\nWe need a reason to go EVA, like resetting experiments in order to re-do them without overwriting what\u0027s stored in there etc.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nI understand KSP1\u0027s system was too tedious for some people (albeit i liked it), but what we have in KSP2 feels like the complete opposite.\n\u003C/p\u003E\n"},{"CreatedByName":"Datau03","CreatedById":223270,"CreatedDateTime":"2024-01-09T00:02:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357255\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704752088\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EBasically, I want science in KSP2 to function as sensors that gather data about the environment, not as currency dispensers that unlock new parts as a reward for traveling someplace new with limited technology. I think the place for \u0022tech tree\u0022-like progression lies more in the missions and the player\u0027s own directive to perform increasingly complex missions around the destinations of their choice, with science acting as an influencing force on those directives and mission goals but not directly acting as the sole source of the currency for unlocking parts.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis would lose the design challenge of only having a specific set of parts completely though, which I think is quite important. What reason is there to use this not so great engine if I can use the best one in the game (Using my available resources) There is gonna be resources as one limiting factor and I hope better engines are gonna require rarer resources, but the Tech tree is still a very important part of progression and a limiting factor together with resources. \n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2024-01-09T00:05:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357293\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704758527\u0022 data-ipsquote-userid=\u0022223270\u0022 data-ipsquote-username=\u0022Datau03\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Datau03 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis would lose the design challenge of only having a specific set of parts completely though, which I think is quite important. What reason is there to use this not so great engine if I can use the best one in the game (Using my available resources) There is gonna be resources as one limiting factor and I hope better engines are gonna require rarer resources, but the Tech tree is still a very important part of progression and a limiting factor together with resources. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not saying the tech tree should be removed, I\u0027m saying that science should function differently than solely as a currency for the tech tree - which means that the way in which the tech tree is implemented would be different and interact with different aspects of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2024-01-09T01:14:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224355085\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704239466\u0022 data-ipsquote-userid=\u0022180308\u0022 data-ipsquote-username=\u0022Ahres\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/2/2024 at 5:51 PM, Ahres said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI see where you\u0027re coming from, especially with the Pilot role of KSP1. I wonder where you draw the line between QoL and purpose of gameplay, however. If we take engines for example, one could say bigger engines are just QoL. I don\u0027t need them, I can just use a larger number of smaller engines. Is gathering science for the sake of getting bigger engines considered gatekeeping? I don\u0027t think you\u0027d say that\u0027s the case. So if I\u0027m saying I don\u0027t want aero-capture data available to me until I\u0027ve sampled the atmosphere, I\u0027d say that\u0027s reasonable. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe line between QoL and a gameplay feature is actually quite simple.\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer the following question:\n\u003C/p\u003E\n\u003Cp\u003E\nDoes the feature add new game play elements, or does it just improve existing ones?\n\u003C/p\u003E\n\u003Cp\u003E\nIf the answer is the former then it is a gameplay element that would be reasonable to be unlocked by the player, found by the player,  bought by the player, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the answer is that it just improves an existing game play element, then there is a good chance that you are padding your game with uninteresting progression items.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA good analog for this is as follows:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Unlocking a new weapon in a shooting game.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Unlocking the on-screen crosshairs for weapons.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI\u0027ll leave it as an exercise to the reader figure out which 2 categories those would fall into, and why, and then consider the same for any KSP related features.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-09T01:16:54Z\u0022 title=\u002201/09/2024 01:16  AM\u0022 data-short=\u0022Jan 9\u0022\u003EJanuary 9\u003C/time\u003E by MechBFP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tweaked9107","CreatedById":231891,"CreatedDateTime":"2024-01-09T19:12:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357255\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704752088\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is the way I think science should be in KSP2. It should involve actual discovery and provide useful information for the player to plan their next steps. I wrote a whole long post in suggestions \u0026amp; development that I think is related to this discussion. It describes a very different version of science than what we have now: \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022150330\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed2413392737\u0022 src=\u0022https://forum.kerbalspaceprogram.com/topic/222637-how-can-ksp2-become-a-greater-space-program-simulator-than-ksp/?do=embed\u0022 style=\u0022height:197px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA few examples of my ideas for science:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nPlanet terrain and details would not be visible, at least to probes, until photos and RADAR/LIDAR surveys are performed over multiple orbits. The player chooses which sections to take images and scans of and must plan ahead if they want to scan a whole planet in detail.\n\u003C/li\u003E\n\u003Cli\u003E\nPerhaps there is a place for signal delay in this game, where the player records a sequence of commands to be sent to a probe instead of controlling it in real-time. If you haven\u0027t mapped the terrain of a planet, your probe will need to be able to measure its own height above the ground or be able to reach landing speed miles above the ground to ensure a good chance of a safe landing. Of course, things like terrain maps of planets at various levels of detail could be unlocked for easier difficulty modes or returning players already familiar with the planets who just want to fly around.\n\u003C/li\u003E\n\u003Cli\u003E\nMagnetometers orbiting bodies can map magnetic fields, and a network of solar observation satellites would be the only way to detect incoming solar storms ahead of arrival. Perhaps the \u0022monuments\u0022 would appear as anomalies in maps generated by surveys. They should NOT appear as a mission or text box appearing out of nowhere telling you to go visit them.\n\u003C/li\u003E\n\u003Cli\u003E\nThe relationship between the tech tree and the collection of science would be expanded beyond the simple currency system. The direction the player chooses to go in on the tech tree would be related to the missions they choose to perform, where they would create some sort of \u0022directive\u0022 for the space program. The science they collect would influence the directive of the space program, for instance discovering a water resource on Duna could provide incentive to increase development of resource extraction and long-term crewed mission technologies, or discovering an exoplanet could incentivize development of larger space telescopes and instruments that can characterize planetary atmospheres.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nBasically, I want science in KSP2 to function as sensors that gather data about the environment, not as currency dispensers that unlock new parts as a reward for traveling someplace new with limited technology. I think the place for \u0022tech tree\u0022-like progression lies more in the missions and the player\u0027s own directive to perform increasingly complex missions around the destinations of their choice, with science acting as an influencing force on those directives and mission goals but not directly acting as the sole source of the currency for unlocking parts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay so I haven\u0027t read this WHOLE thread so apologies if I\u0027m just re-stating what someone else said...\n\u003C/p\u003E\n\u003Cp\u003E\nI couldn\u0027t agree more with this. I\u0027m new to the game since the Science release just before Christmas, and as much as I\u0027m enjoying the challenge of building rockets to get me to certain places, the whole mission/science element isn\u0027t really working for me.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree with others that I don\u0027t just want everything handed to me in sandbox fashion though either. I like the challenge of being limited in some way to what I can build and rather than building a super do-all system that gets to most planets from the word go, I have to build within the confines of the technology available to me. I do also think this is why the financial system of the previous game would of been nice to see at least as an option in this one as well.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as how to tie in science, like Cubinator said, it should be related to the missions you\u0027ve been given/chosen. Made up fantasy alien race of Kerbals or not, it should mimic real life. You are offered a set of missions to choose from and a financial budget to go with it. So for example, land a Kerbal on the blue planet X - $10million budget. You accept the mission and get a nice healthy $10million budget to go along with whatever money you\u0027ve also made from other missions or contracts. You can then unlock certain parts using said budget, but only if you also have the science to back up the invention/design of these new parts. For example, I spend part of the budget to design and launch a rocket to send a probe into orbit around the blue planet-X to map the terrain. The probe maps the terrain and finds that the now named planet Aqua is blue because it is actually completely 100% water with no land. That then triggers the ability for me to now unlock a new flotation device designed for landing a heavy lander on water. I don\u0027t HAVE to unlock it, I can choose to attempt the mission without it, but the data is clear, I will need it, and therefore I spend part of the budget to have that part invented/designed or whatever you want to call it. Sometimes you will always need said part, other times not but it would definitely make it easier. That parts existence (unlock) is then tied to the fact that it was NEEDED and therefore someone had to invent/design it.\n\u003C/p\u003E\n\u003Cp\u003E\nThere would obviously be multiple examples of this for each part and sometimes you will find out the hard way (god bless Jeremiah who drowned on planet Aqua because we just went straight there and didn\u0027t realise it was all water), but at least there will then be a point to the science. At the moment, the way I find out planet Aqua is all water is by either A, landing there and going \u0022o excrements\u0022, or by doing what I do for all other planets in KSP2, google them and find out. Want the know the lowest safe orbiting altitude of Duna? Google. Want to know the phase angle for an Eeloo intercept? Google. Unless I\u0027m missing something, these should all be things the game is teaching you through the missions. And rather than have me land at a specific point on Duna because there is a special alien monument there that we somehow just KNOW about, why not have me find it through Terrain mapping, or how about I do terrain mapping and see there is only one viable landing spot on the planet and then I stumble across it naturally. \n\u003C/p\u003E\n\u003Cp\u003E\nI also wouldn\u0027t want the horror of failed rocket design and the learning by failing experience to bankrupt the agency and cause anyone to rage quit the game forever, so when you revert you get your money back, if you so choose. That then gives people the option of playing how they like. You can go all out hardcore and every failure costs you dearly, or you can revert and chalk it up to it being a GAME and the experience of learning.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, that\u0027s just my random two cents.\n\u003C/p\u003E\n"},{"CreatedByName":"Ahres","CreatedById":180308,"CreatedDateTime":"2024-01-09T23:46:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357328\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704762892\u0022 data-ipsquote-userid=\u0022184845\u0022 data-ipsquote-username=\u0022MechBFP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, MechBFP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe line between QoL and a gameplay feature is actually quite simple.\n\u003C/p\u003E\n\u003Cp\u003E\nAnswer the following question:\n\u003C/p\u003E\n\u003Cp\u003E\nDoes the feature add new game play elements, or does it just improve existing ones?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m happy to have my mind changed, Mech, so don\u0027t read this like I\u0027m trying to disagree with you. Instead read it like I\u0027m trying to widen my perspective.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m struggling to think it\u0027s as simple as you make it to be. In my opinion topo mapping, aero-capture data, resource scanning, etc. are both new gameplay elements and quality of life improvements. They\u0027re elements that can be ignored completely and yet you can still complete the mission you desire. But if you want a flat landing spot, or aero-breaking into orbit instead of full aero-capture and landing, or higher availability of a certain resource, you\u0027d use these elements if anything for the quality of life of escaping the need to spam F5 and F9. Correct? I welcome any extra understanding for my own sake. Plus, there\u0027s the additional benefits of teaching the player some extra scientific topics along the way, motivating the player to try orbital maneuvers that they would otherwise not be inclined (that\u0027s an orbit joke) to try, and any other benefits that I might\u0027ve mentioned before but have already forgotten about.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, if you say the features I listed above should be given at the onset of a new save I\u0027d say that\u0027s fine. But the frontier spirit within me would be disappointed in the fact that I\u0027ve got all this handy info gifted to me when I\u0027ve never even visited that planet. I recognize that\u0027s an opinion or an individual emotional response, and not a universal one within the player base either, but it is called \u0022Exploration\u0022 mode after all. Sadly, there just isn\u0027t much for exploring when you already know everything about the planet before you visit it.\n\u003C/p\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2024-01-10T01:08:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357622\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704843978\u0022 data-ipsquote-userid=\u0022180308\u0022 data-ipsquote-username=\u0022Ahres\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Ahres said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m happy to have my mind changed, Mech, so don\u0027t read this like I\u0027m trying to disagree with you. Instead read it like I\u0027m trying to widen my perspective.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m struggling to think it\u0027s as simple as you make it to be. In my opinion topo mapping, aero-capture data, resource scanning, etc. are both new gameplay elements and quality of life improvements. They\u0027re elements that can be ignored completely and yet you can still complete the mission you desire. But if you want a flat landing spot, or aero-breaking into orbit instead of full aero-capture and landing, or higher availability of a certain resource, you\u0027d use these elements if anything for the quality of life of escaping the need to spam F5 and F9. Correct? I welcome any extra understanding for my own sake. Plus, there\u0027s the additional benefits of teaching the player some extra scientific topics along the way, motivating the player to try orbital maneuvers that they would otherwise not be inclined (that\u0027s an orbit joke) to try, and any other benefits that I might\u0027ve mentioned before but have already forgotten about.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, if you say the features I listed above should be given at the onset of a new save I\u0027d say that\u0027s fine. But the frontier spirit within me would be disappointed in the fact that I\u0027ve got all this handy info gifted to me when I\u0027ve never even visited that planet. I recognize that\u0027s an opinion or an individual emotional response, and not a universal one within the player base either, but it is called \u0022Exploration\u0022 mode after all. Sadly, there just isn\u0027t much for exploring when you already know everything about the planet before you visit it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat it comes down to in the end is if gating a feature for game play purposes is worth the tradeoff from the negative impact it will have to your players playing the game before it is unlocked. I am sure someone could make an enticing argument for why unlocking crosshairs in a shooter is a really good game play feature after all.\n\u003C/p\u003E\n\u003Cp\u003E\nThe general opinion of the playerbase will decide if that was the right call or not.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-10T01:09:46Z\u0022 title=\u002201/10/2024 01:09  AM\u0022 data-short=\u0022Jan 10\u0022\u003EJanuary 10\u003C/time\u003E by MechBFP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2024-01-10T06:14:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357649\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704848905\u0022 data-ipsquote-userid=\u0022184845\u0022 data-ipsquote-username=\u0022MechBFP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, MechBFP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat it comes down to in the end is if gating a feature for game play purposes is worth the tradeoff from the negative impact it will have to your players playing the game before it is unlocked. I am sure someone could make an enticing argument for why unlocking crosshairs in a shooter is a really good game play feature after all.\n\u003C/p\u003E\n\u003Cp\u003E\nThe general opinion of the playerbase will decide if that was the right call or not.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think the loose answer is you should have and be deliberately introduced to features just before you need them. Many of these will come very, very early hence KSP1 frustration with locked maneuver nodes. You need this the minute you try to go to orbit, potentially your second launch, so there’s no reason to lock this at all. But when do you absolutely need biome maps? When do you need trajectory factoring drag? When do you need resource maps? Soon, but not immediately. These seem ripe for exploration-based reveals. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-10T06:14:49Z\u0022 title=\u002201/10/2024 06:14  AM\u0022 data-short=\u0022Jan 10\u0022\u003EJanuary 10\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mike S","CreatedById":224442,"CreatedDateTime":"2024-01-10T08:38:39Z","Content":"\n\u003Cp\u003E\nI don\u0027t get the bickering over the game features as seen right now.  The game is still a long way from complete...and I very much doubt that the science portion is complete...or even half complete for that matter.  They are building the trusses of the sky scraper and have yet to verify if those are going to do the job...and you guys are all being critical of the progress before you even see the finished product?  While the \u0022For Science\u0022 portion of the game is limited, it is a great starting point that can be easily expanded upon as the game development progresses.  Crying about the lettuce being so boring  as the chef brings out the various ingredients for his signature meal is...premature.  And let\u0027s face it...this game is NOT just for those already familiar with the game...it is also meant for millions more who may be completely unfamiliar with it and enjoy the progression to learning rocketry...because not everyone is a \u0022pro gamer\u0022 at rockery ya know...\u003Cbr\u003E\n\u003Cbr\u003E\nAs someone else rightfully points out...you have  SANDBOX MODE to satiate your need for speed.  You have several mods to expand the limited options to date, and can even get rid of Paige...and more.  You have a functional environment to play in now...and yet, you cry about a portion of the game that never existed before...weird...and annoying at the same time.  There are many things to nitpick this game as is right now...but alas, those issues are pointless blather in a forum where the developers are likely not paying much attention to...because it isn\u0027t in the form of a bug report or following their instructions for feature requests and changes.  Blowing hot air that goes nowhere here.  Over a game that still has a long way to go before it can claim 1.0 status instead of 0.2 currently.\u003Cbr\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2024-01-10T11:27:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\npremature\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nand yet, you cry about a portion of the game that never existed before [not counting KSP 1 which is over a decade old now]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\npointless blather\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBlowing hot air\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNoted and disregarded.\n\u003C/p\u003E\n\u003Cp\u003E\nOut of all the forums to ever exist on the Internet, this is probably the last one where you want to claim the developers are not reading up on criticism \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"saxappeal89129","CreatedById":160251,"CreatedDateTime":"2024-01-10T21:11:53Z","Content":"\n\u003Cp\u003E\nFigured I\u0027d throw my $.02 in here...\n\u003C/p\u003E\n\u003Cp\u003E\n(Short because... I have a job)\n\u003C/p\u003E\n\u003Cp\u003E\nI actually like the For Science path for the game, it allows for progression and role playing which I think is fun in this scenario. I\u0027m sure it will be fleshed out and bugs squashed etc. (I\u0027m usually not an advocate for the devs or the game... usually a detractor) So yeah, I\u0027m glad it\u0027s in the game, helps set goals, and keep progression moving along.\n\u003C/p\u003E\n"},{"CreatedByName":"Ahres","CreatedById":180308,"CreatedDateTime":"2024-01-11T16:47:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/10/2024 at 1:38 AM, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t get the bickering over the game features as seen right now.  The game is still a long way from complete...and I very much doubt that the science portion is complete...or even half complete for that matter.  They are building the trusses of the sky scraper and have yet to verify if those are going to do the job...and you guys are all being critical of the progress before you even see the finished product?  While the \u0022For Science\u0022 portion of the game is limited, it is a great starting point that can be easily expanded upon as the game development progresses.  Crying about the lettuce being so boring  as the chef brings out the various ingredients for his signature meal is...premature.  And let\u0027s face it...this game is NOT just for those already familiar with the game...it is also meant for millions more who may be completely unfamiliar with it and enjoy the progression to learning rocketry...because not everyone is a \u0022pro gamer\u0022 at rockery ya know...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI generally agree with the don\u0027t-judge-until-we-know-everything sentiment, so I don\u0027t fault you for saying this. The problem for me, I suppose, is that I\u0027m concerned this is all we\u0027re going to get for Science mode. The 0.2 Science Milestone is released and now we\u0027re on to 0.3 and Colonies (which I\u0027m so pumped for) with the stated exceptions of tuning the heating behavior and adding additional Science missions. There\u0027s nothing I\u0027m aware of that indicates there will be any major content/gameplay additions to the Science element of the game from now on. So, in case that is true, we want to make sure the dev team is aware that there\u0027s a desire from at least some of the player-base for Science to be improved further before it\u0027s too late.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224357740\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221704875919\u0022 data-ipsquote-userid=\u0022224442\u0022 data-ipsquote-username=\u0022Mike S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/10/2024 at 1:38 AM, Mike S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...but alas, those issues are pointless blather in a forum where the developers are likely not paying much attention to...because it isn\u0027t in the form of a bug report or following their instructions for feature requests and changes.  Blowing hot air that goes nowhere here.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBe careful to say things that you haven\u0027t fact-checked beforehand. You can check the UI/UX megathread for a reference. \n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-01-12T01:20:25Z","Content":"\n\u003Cp\u003E\nI feel the same way. I want science to be a great deal more important than it currently is. I hope more experiments will come out with updates. More reasons to investigate specific biomes.\u003Cbr\u003E\nI want the Kerbnet system with Anomaly detection to exist and broaden to include space... Gather science around a black hole.\u003Cbr\u003E\n\u003Cbr\u003E\nI also miss the aspect that procedurally generated content brought to the experience. Including more missions with each subsequent update... even allow community shared and driven content isn\u0027t the same as having random missions appear and getting to select which ones you want to pursue. It allowed MODs to lean into the contract aspect which ... Encourages a rich unique play through every time, I agree that those Missions that are core should be a part. Just makes sense that space companies would take contracts for payload delivery and Datuhz collections.\n\u003C/p\u003E\n"},{"CreatedByName":"WelshSteW","CreatedById":202966,"CreatedDateTime":"2024-01-12T08:07:34Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t read the whole thread, so apologies if I\u0027m rehashing ideas already given.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI like the science / exploration mode, it\u0027s how I played KSP1, and it\u0027s how I\u0027m playing KSP2. But it could, and should, be better than it is.\n\u003C/p\u003E\n\u003Cp\u003E\nScience needs to be more than a way to get points to unlock new bit for building things. It needs to actually be a way of finding things out in the game. I shouldn\u0027t start the game knowing exactly how much \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E I need to get somewhere. I shouldn\u0027t start the game and be able to go and look at every planet in the system, have high def pictures of them, know where the sphere of influence is etc etc etc. I should have to find all of that out.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I know not everyone will like that, so why not have difficulty options which let you choose how much knowledge you start the game with?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere needs to be a reason to do science, outside of getting points to unlock things.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-01-12T17:39:14Z","Content":"\n\u003Cp\u003E\nThis sums up *what* the spirit of exploration mode should entail. Thank you so much for the articulate comment\n\u003C/p\u003E\n"},{"CreatedByName":"hatterson","CreatedById":107383,"CreatedDateTime":"2024-01-12T17:59:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358329\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705046854\u0022 data-ipsquote-userid=\u0022202966\u0022 data-ipsquote-username=\u0022WelshSteW\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, WelshSteW said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t read the whole thread, so apologies if I\u0027m rehashing ideas already given.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI like the science / exploration mode, it\u0027s how I played KSP1, and it\u0027s how I\u0027m playing KSP2. But it could, and should, be better than it is.\n\u003C/p\u003E\n\u003Cp\u003E\nScience needs to be more than a way to get points to unlock new bit for building things. It needs to actually be a way of finding things out in the game. I shouldn\u0027t start the game knowing exactly how much \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E I need to get somewhere. I shouldn\u0027t start the game and be able to go and look at every planet in the system, have high def pictures of them, know where the sphere of influence is etc etc etc. I should have to find all of that out.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I know not everyone will like that, so why not have difficulty options which let you choose how much knowledge you start the game with?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere needs to be a reason to do science, outside of getting points to unlock things.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe high def pictures would depend heavily on telescope technology, which doesn\u0027t need to follow human technology. I understand limiting it, but I think that was more of a game engine/game technology decision as opposed to a true gameplay one.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E requirements and sphere of influence is basic mathematics and there\u0027s no reason for them to not be available from the start of a campaign.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-12T18:00:09Z\u0022 title=\u002201/12/2024 06:00  PM\u0022 data-short=\u0022Jan 12\u0022\u003EJanuary 12\u003C/time\u003E by hatterson\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2024-01-12T18:40:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358480\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705082361\u0022 data-ipsquote-userid=\u0022107383\u0022 data-ipsquote-username=\u0022hatterson\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, hatterson said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nsphere of influence is basic mathematics\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0027s are completely fictional and arbitrary to whatever game rules the Kerbal universe follows, which is more of a reason for them to not be hidden or repeating the mistake in 1 of hiding the orbital predictions behind tracking station levels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2024-01-12T19:06:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358329\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705046854\u0022 data-ipsquote-userid=\u0022202966\u0022 data-ipsquote-username=\u0022WelshSteW\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, WelshSteW said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nScience needs to be more than a way to get points to unlock new bit for building things. It needs to actually be a way of finding things out in the game. I shouldn\u0027t start the game knowing exactly how much \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E I need to get somewhere. I shouldn\u0027t start the game and be able to go and look at every planet in the system, have high def pictures of them, know where the sphere of influence is etc etc etc. I should have to find all of that out.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou have just described the issue with every RPG that exists.  In every RPG, you start with next to nothing, go adventuring and do stuff, earn XP, and then when you get a set amount of XP you unlock new abilities.  I\u0027m not saying I don\u0027t agree with you, but what other way is there to \u0022level up\u0022 or get better if not by locking new pieces behind points?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358490\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705084836\u0022 data-ipsquote-userid=\u002258026\u0022 data-ipsquote-username=\u0022PDCWolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, PDCWolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E\u0027s are completely fictional and arbitrary to whatever game rules the Kerbal universe follows, which is more of a reason for them to not be hidden or repeating the mistake in 1 of hiding the orbital predictions behind tracking station levels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is incorrect.  IRL, every body that exists has an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.  Astrodynamics entry in Wikipedia:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Sphere_of_influence_(astrodynamics)\u0022 rel=\u0022external nofollow\u0022\u003ESphere of influence (astrodynamics) - Wikipedia\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe literal first sentence:  \u003Cem\u003EA sphere of influence (\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E) in astrodynamics and astronomy is the oblate-spheroid-shaped region around a celestial body where the primary gravitational influence on an orbiting object is that body.  \u003C/em\u003ESo no, they are not fictional.  The game designers had to give them boundaries, the limits of which are probably arbitrary.  But RL \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0027s do exist, and they do have influence on the objects that they come near and/or have orbiting around them.  Without an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, our own planet wouldn\u0027t be held in its orbit around Sol.\n\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2024-01-12T19:58:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358496\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705086373\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe literal first sentence:  \u003Cem\u003EA sphere of influence (\u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E) in astrodynamics and astronomy is the oblate-spheroid-shaped region around a celestial body where the primary gravitational influence on an orbiting object is that body.  \u003C/em\u003ESo no, they are not fictional.  The game designers had to give them boundaries, the limits of which are probably arbitrary.  But RL \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E\u0027s do exist, and they do have influence on the objects that they come near and/or have orbiting around them.  Without an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E, our own planet wouldn\u0027t be held in its orbit around Sol.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd if you\u0027ve read the first paragraph you\u0027d realized the concept is limited to patched conics, which is not how the universe works, but rather a simplification used to calculate celestial motion faster. The real world works in what we approximate as n-body physics, which is straight up incompatible with the concept of sphere of influence.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2024-01-12T20:03:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358496\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705086373\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n54 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe literal first sentence:  \u003Cem\u003EA sphere of influence (\u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E) in astrodynamics and astronomy is the oblate-spheroid-shaped region around a celestial body where the primary gravitational influence on an orbiting object is that body.\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLiterally citing Wikipedia. I agree it\u0027s fun to read but uncited summaries from unknown editors do not constitute valid sources and that is why people are directed to use the sources used as points of research instead.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-01-12T20:31:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358508\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705089834\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLiterally citing Wikipedia. I agree it\u0027s fun to read but uncited summaries from unknown editors do not constitute valid sources and that is why people are directed to use the sources used as points of research instead.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure in a Thesis but this is a video game message board.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you doubt the claim the references are there.\n\u003C/p\u003E\n"},{"CreatedByName":"Aevitas","CreatedById":232127,"CreatedDateTime":"2024-01-12T20:33:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358329\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705046854\u0022 data-ipsquote-userid=\u0022202966\u0022 data-ipsquote-username=\u0022WelshSteW\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, WelshSteW said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nScience needs to be more than a way to get points to unlock new bit for building things. It needs to actually be a way of finding things out in the game. I shouldn\u0027t start the game knowing exactly how much \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E I need to get somewhere. I shouldn\u0027t start the game and be able to go and look at every planet in the system, have high def pictures of them, know where the sphere of influence is etc etc etc. I should have to find all of that out.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWith this game ultimately not centered around the Kerbol system, I don\u0027t think this is a practical addition without a different gamemode for such determined exploration, or an exceptional mod. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I believe that spending science at the tracking station to \u0022Scan\u0022 or something that \u003Cem\u003Ethen\u003C/em\u003E reveals a new planet system is fair and absolutely within KSP2\u0027s bounds for Interstellar space. I hope to see this happen with interstellar space. KSP 1 was all about Kerbol. KSP 2, is not\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2024-01-12T20:59:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358490\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705084836\u0022 data-ipsquote-userid=\u002258026\u0022 data-ipsquote-username=\u0022PDCWolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, PDCWolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E\u0027s are completely fictional and arbitrary to whatever game rules the Kerbal universe follows, which is more of a reason for them to not be hidden or repeating the mistake in 1 of hiding the orbital predictions behind tracking station levels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n“Completely fictional” is a bit harsh. \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0027s are central in patched conics, and used \u003Cem\u003Ea lot\u003C/em\u003E for initial interplanetary calculations (“good enough for practical purposes”) by NASA. Any model is just that, a model. N-body calculations are also fiction and even relativity might just be a model of what “really” goes on in our universe. So while reality doesn\u0027t behave like that, \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0027s do form a workable model for orbital mechanics where computational efficiency is preferred over multi-decimal accuracy.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re also not limited to patched conics. When calculating a trans lunar injection burn with n-body physics, no one is going to take the gravitational influence of Phobos and Deimos into account. \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u0027s are a useful tool to decide where the cut-offs for calculations lie.\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2024-01-12T22:17:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358507\u0022 data-ipsquote-contentid=\u0022222109\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705089509\u0022 data-ipsquote-userid=\u002258026\u0022 data-ipsquote-username=\u0022PDCWolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, PDCWolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd if you\u0027ve read the first paragraph you\u0027d realized the concept is limited to patched conics, which is not how the universe works, but rather a simplification used to calculate celestial motion faster. The real world works in what we approximate as n-body physics, which is straight up incompatible with the concept of sphere of influence.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, I was responding to your statement about them being completely fictional.  Which they aren\u0027t.  Which the wiki entry, and the scientific community, proves.  If you want to argue patched conics vs. n-body physics, that\u0027s an entirely different conversation than \u0022they are fictional\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"hatterson","CreatedById":107383,"CreatedDateTime":"2024-01-13T00:00:03Z","Content":"\n\u003Cp\u003E\nSoIs are a result of a system in which simplifying assumptions are made to reduce calculation load. So they\u0027re \u0022fictional\u0022 in the sense that they don\u0027t exist in the real world, but they\u0027re not \u0022fictional\u0022 in the sense that they\u0027re made up. They\u0027re a result of very clear and unambiguous calculations.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of that changes the fact that in the in-game universe in which Kerbals operate, they would be comparatively trivial to calculate.\n\u003C/p\u003E\n"}]}