{"TopicId":222520,"ForumId":136,"TopicTitle":"Is anyone else experiencing extreme RAM usage? Tips to manage?","CreatedByName":"bigwhitey95","CreatedById":230373,"CreatedDateTime":"2024-01-02T23:16:50Z","PageNum":1,"Articles":[{"CreatedByName":"bigwhitey95","CreatedById":230373,"CreatedDateTime":"2024-01-02T23:16:50Z","Content":"\n\u003Cp\u003E\nAs the title says. I have a 1-year old Windows 11 PC with 16GB of RAM. Since the For Science update I have noticed with increased frequency that KSP2 will crash my entire PC (ie other programs such as Spotify will crash first, then Windows itself hangs, forcing a hard restart). Inspecting task manager immediately before a crash shows KSP2 utilising 90% of available RAM.\n\u003C/p\u003E\n\u003Cp\u003E\nI am playing on Exploration mode. The crashes happen almost exclusively in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (but I have had it happen once on Duna’s surface). They first started when building larger interplanetary craft with multiple deployable satellites and landers in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. But now I am getting crashes even when assembling a simple craft such as just a recoverable booster - and these crashes happen after only 10 minutes in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI have already reduced the graphics settings to medium overall with AA turned off. I have deleted debris and unused crafts. I have deleted old workspaces so I only have 8 now. I have also almost-entirely cleared the saves folder (so just a handful of saves). These haven’t had a noticeable impact on frequency of crashes.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven’t tried restarting a new game as I am still playing through Exploration mode. I don’t think this is a singular identifiable bug so I haven’t posted this in the bugs subforum. Any tips to deal with this which don’t involve starting a game all over again? Thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2024-01-03T11:41:43Z","Content":"\n\u003Cp\u003E\nHi there, i have a similar issue since the update...\u003Cbr\u003E\n\u003Cbr\u003E\nFirst for reference i use an 1  1/2 year Windows 11pro PC with i7 11700F (2.5 gh base clock) and RTX 3060 with 16 gb ram and 20 gb vram.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen i start KSP2 offline from exe. it uses about 4 gb ram ( This goes up to max 8 gb) and 6 gb vram on the RTX with \u0022medium pc\u0022 setting. I noticed a performance decrease after the update in december, and i have not found any solution myself. My system throttles down the CPU speed and the framerates go down aswell, i updated every driver\u003Cu\u003E\u003Cem\u003E even intel chipset\u003C/em\u003E\u003C/u\u003E but nothing helps.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EI am suspecting an issue from the update along certain multicore cpus, because my cpu never surpasses overall 15% load while running the game. RTX has about 30% load which is due to the throttling of the CPU i guess...\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EBut i have also a somehow faulty Asus BIOS in the moment, i swear the armoury crate software is a hoax to the customer... \u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI used to run KSP2 overclocked with watercooling with 4.5 gh on the CPU and very high framerate (50-60fps), \u003Cs\u003Euntil the last update or something around this date broke something\u003C/s\u003E. I play now with 3.0 gh and lower framerate (20-25fps) but the performance is to low for my taste nontheless.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EI can also imagine a certain win11 update took the performance down.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EI appreciate any hint or help in this situation aswell. \u003C/s\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-03T15:37:10Z\u0022 title=\u002201/03/2024 03:37  PM\u0022 data-short=\u0022Jan 3\u0022\u003EJanuary 3\u003C/time\u003E by Mikki\u003C/strong\u003E\n\u003Cbr\u003Efound culprit, see below\n\u003C/span\u003E\n"},{"CreatedByName":"bigwhitey95","CreatedById":230373,"CreatedDateTime":"2024-01-03T12:42:00Z","Content":"\n\u003Cp\u003E\nGood note about the Armoury Crate software crashing - I also have an Asus computer and it’s that Asus software which also crashes immediately prior to KSP2 crashing. I have a similar computer except it has an RTX 3070. KSP2 has actually become so bad just in the past day that my computer will immediately crash upon loading into an autosave in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI don’t know whether it’s the For Science update itself which introduced these issues, or if they already existed but are exacerbated by a comprehensive playthrough of Exploration mode (which is kind of necessary, as opposed to Sandbox mode which has no progression penalty for restarting fresh whenever you want). But I have 300 hours in KSP2 so far and it hasn’t been this bad.\n\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2024-01-03T15:31:53Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/230373-bigwhitey95/?do=hovercard\u0022 data-mentionid=\u0022230373\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/230373-bigwhitey95/\u0022 rel=\u0022\u0022\u003E@bigwhitey95\u003C/a\u003E Hi again, i have swapped my watercooling with the intel OEM cooler and i have discovered that my watercooler runned faulty and evaporated quite alot coolant. However, i had aswell in october/november issues with ram overflow, this may have been the point where my system began to struggle with the CPU temperature...\n\u003C/p\u003E\n\u003Cp\u003E\nCheck your CPU temperature, install maybe \u0022ThrottleStop\u0022, a free software to observe ALL Mobo components and regulate cpu speed, i can very recommend this piece of software. You have the ram at the right place mounted? Check your mobo manual (online) for the correct slots...\n\u003C/p\u003E\n\u003Cp\u003E\nYou can run Throttlestop from the download folder, just open the exe.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope you get this fixed, greetings\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-03T15:39:15Z\u0022 title=\u002201/03/2024 03:39  PM\u0022 data-short=\u0022Jan 3\u0022\u003EJanuary 3\u003C/time\u003E by Mikki\u003C/strong\u003E\n\u003Cbr\u003Estuff, typo\n\u003C/span\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2024-01-04T01:27:26Z","Content":"\n\u003Cp\u003E\nMoved to KSP2 Technical Support.\n\u003C/p\u003E\n"}]}