{"TopicId":222761,"ForumId":126,"TopicTitle":"[Minmus] Fail to land due to Minmus rotation","CreatedByName":"goshiz","CreatedById":232082,"CreatedDateTime":"2024-01-07T15:56:02Z","PageNum":1,"Articles":[{"CreatedByName":"goshiz","CreatedById":232082,"CreatedDateTime":"2024-01-07T15:56:02Z","Content":"\n\u003Cp\u003E\nHi Everyone, I\u0027ve spend most of my day trying to land near the Monument of Minmus but fail to do so... \u003Cbr\u003E\n\u003Cbr\u003E\nEverytime I try to land using retrograde booster and/or anti-target (for the the final approach) I still have a relative velocity to the ground that make my ship to fall over and land on the side. I search accross google and did\u0027nt find anything interesting, a lot of topic saying it\u0027s easier than the Mun (where I can land pretty easily...) so I don\u0027t get why I fail to land on Minmus.\u003Cbr\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2024-01-07T21:03:11Z","Content":"\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/232082-goshiz/?do=hovercard\u0022 data-mentionid=\u0022232082\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/232082-goshiz/\u0022 rel=\u0022\u0022\u003E@goshiz\u003C/a\u003E, and welcome to the KSP Forums!\n\u003C/p\u003E\n\u003Cp\u003E\nI do have a couple of suggestions.\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend that your NavBall be in Surface mode.  In KSP2, in surface mode half the navball is brown/orange, and the other half is sky-blue.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen landing, you obviously want lateral (sideways) motion to be zero.  One technique to do that is with your navball in Surface Mode:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nDescend to 10 - 50 m above the ground- Just above the ground.\n\u003C/li\u003E\n\u003Cli\u003E\nStop your descent completely, so that the velocity reads zero.  You will be essentially hovering over your landing site.\n\u003C/li\u003E\n\u003Cli\u003E\nOnce you have a velocity of zero, begin a descent straight down.  If you are careful about your thrust direction, you should not pick up very much lateral motion in the last few meters of your descent.\n\u003C/li\u003E\n\u003Cli\u003E\nAt touchdown, try to have your velocity at or below 1.0 m/s.  Most parts can handle an impact of up to 6 m/s, but the faster you go the greater the odds of tipping over.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nTry to choose a flat landing surface.  Also, wide landers are more stable than really tall skinny landers.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!  Most likely you will succeed very quickly.\n\u003C/p\u003E\n"},{"CreatedByName":"Jeq","CreatedById":172375,"CreatedDateTime":"2024-01-11T10:27:59Z","Content":"\n\u003Cp\u003E\ndont go anti-target.\n\u003C/p\u003E\n\u003Cp\u003E\ngo retrograde of surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOlder KSP didn\u0027t allow targeting body when you were in its influence. In ksp2 when you enter orbit of Minmus, you should unselect target to make sure you wont use it as an reference.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-11T10:29:55Z\u0022 title=\u002201/11/2024 10:29  AM\u0022 data-short=\u0022Jan 11\u0022\u003EJanuary 11\u003C/time\u003E by Jeq\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Apotheosis69","CreatedById":232644,"CreatedDateTime":"2024-02-13T01:44:00Z","Content":"\n\u003Cp\u003E\nDid you find a fix to this bug? This happened to me as well. Seems hard to describe because other people aren\u0027t understanding what you are meaning. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen we are landing the moon (minmus) still spins.. This is making us have a sideways velocity. That makes it impossible to navigate with the navball/\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, If we tried to land with this bug we would have to have a velocity equal to the spin of minmus in the same direction. That would be ridiculous to try and do.  I just took 200t of rocket up to minmus and discovered this for the first time. EXTREMELY frustrating... Seems the game still thinks you are in orbit and changing navball doesnt work either.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-02-13T02:46:29Z","Content":"\n\u003Cp\u003E\nOn the left of the navball, it likely says \u0022orbit\u0022 and some velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nClick that part of the screen, and it will say \u0022surface\u0022 and some velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you then aim retrograde and slow down, you\u0027ll descend far closer to how you expect. If you slow down to 0, you\u0027ll be hovering over the ground (and then start to fall straight down).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224366210\u0022 data-ipsquote-contentid=\u0022222761\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221707788640\u0022 data-ipsquote-userid=\u0022232644\u0022 data-ipsquote-username=\u0022Apotheosis69\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Apotheosis69 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSeems the game still thinks you are in orbit and changing navball doesnt work either.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCould you post a set of screen shots where you are in SURFACE mode with almost 0 velocity, yet the screen shots are showing you obviously moving across the surface at a significant velocity?\n\u003C/p\u003E\n\u003Cp\u003E\nIf so, that may be enough for a bug report, especially if you can quicksave and quickload, and still be in that situation.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-13T02:56:13Z\u0022 title=\u002202/13/2024 02:56  AM\u0022 data-short=\u0022Feb 13\u0022\u003EFebruary 13\u003C/time\u003E by Superfluous J\u003C/strong\u003E\n\u003C/span\u003E\n"}]}