{"TopicId":222876,"ForumId":70,"TopicTitle":"Help! My parachute sizes got all messed up.","CreatedByName":"GTFreeFlyer","CreatedById":232136,"CreatedDateTime":"2024-01-10T05:20:27Z","PageNum":1,"Articles":[{"CreatedByName":"GTFreeFlyer","CreatedById":232136,"CreatedDateTime":"2024-01-10T05:20:27Z","Content":"\n\u003Cp\u003E\nHi, I briefly tried out RealChutes, then decided to delete it.  After that, my parachutes no longer seemed to produce drag, even though they would come out and inflate.  I restored the files through Steam\u0027s \u0022check integrity\u0022 feature and then all was good again.  However, I didn\u0027t notice that their sizes never restored.  I also have the Restock mod, but not sure if this is the culprit.  My drogue chute (Mk12-R) is much larger than before, and my main chute (Mk2-R) is much smaller...smaller than my drogue now.  It just looks terrible.  I can\u0027t seem to find the file to change it back.  I did go into the configs in ...Kerbal Space Program\\GameData\\Squad\\Parts\\Utility\\parachuteMk2-R (and the other chute too) and confirmed that the .cfg file is identical to the original non-modded file.   Perhaps it is in the .mu binary file that I\u0027m unable to edit?  I have never installed any other mod that will change the size of parts.  I think there\u0027s one called Tweakscale or something like that?  If so, that\u0027s definitely not the issue since it was never installed.  Also, the spread angle on the drogue still works, but not for the main chute.  I remember this being a thing after trying out RealChutes, so I think something was permanently changed with the chutes, even after removing the mod and then checking integrity thru Steam.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease help me restore my chutes back to stock so that my drogue is a small chute and the main is a big one.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, just curious if the change is global and will affect only new builds, or all existing builds as well.  I\u0027m not sure if the parachute config file and size info  is copied into each rocket separately or not.  It would not be convenient to have to change settings on each rocket, but if that\u0027s the case then I can deal with it.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you Kerbal community!\n\u003C/p\u003E\n\u003Cp\u003E\n-GT-\n\u003C/p\u003E\n"},{"CreatedByName":"GTFreeFlyer","CreatedById":232136,"CreatedDateTime":"2024-01-10T17:15:04Z","Content":"\n\u003Cp\u003E\nI mistakenly posted this in the KSP2 area.  My issue is in KSP1.  If a moderator sees this, please move this topic to the KSP1 mod forum.  Thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2024-01-10T21:20:38Z","Content":"\n\u003Cp\u003E\nMoved thread to KSP 1 modded technical support thread.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2024-01-12T14:29:06Z","Content":"\n\u003Cp\u003E\nIt may be worth uninstalling and reinstalling the whole game at this point.\n\u003C/p\u003E\n\u003Cp\u003E\nCopy your saves from KSP/saves/(your save name here) to your desktop, then use Steam to first disable cloud syncing, then uninstall KSP completely and then reinstall it.\n\u003C/p\u003E\n\u003Cp\u003E\nModding the Steam copy of KSP often causes weird issues, so in future if you want to use mods make a copy of KSP and put it outside Steam’s folders, then use \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E to make new copies from that copy and add your mods.\n\u003C/p\u003E\n"}]}