{"TopicId":222981,"ForumId":44,"TopicTitle":"Crewed Warships VS Drone Warships In Scifi...","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2024-01-14T05:06:46Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2024-01-14T05:06:46Z","Content":"\n\u003Cp\u003E\nIt goes without saying that a story is a lot more interesting if there are costs at stake. Thus the reason for crewed space warships being so common in scifi. On the other hand drone vessels operating under the command of one or just a few crewed vessels would seem to give the best of both worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it\u0027s not that simple since both designs have costs and advantages.\n\u003C/p\u003E\n\u003Cp\u003E\nCrewed Vessel Advantages: Can make judgement calls... especially when it goes beyond the scope of the original mission, something a robo-mind or machine would never do unless it thought like a human. Also humans can make minor ship repairs on the go (fix leaks or patch hull damage). Lower cost of ship construction, as it is understood crew will do regular maintenence on vessel to keep it in it\u0027s best operating condition.\n\u003C/p\u003E\n\u003Cp\u003E\nCrewed Vessel Disadvantages: Increased operating cost due to the crew being on board. Also crew can die.\n\u003C/p\u003E\n\u003Cp\u003E\nDrone/Robot Vessel Advantages: Decreased operating cost due to no living people aboard that you have to pay or risk losing.\n\u003C/p\u003E\n\u003Cp\u003E\nDrone/Robot Vessel Disadvantages: Increased ship building costs, as the ship will need to be built more reliable as it has no crew to do routine maintenence. This may lead to to a smaller automated fleet as opposed to a crewed one, or at the very least a less maintained one, since crewed vessels will be doing a lot more maintenence on their vessels than robot ships that either won\u0027t or only do the bare minimum. Meaning crewed vessels over multi-month missions would perform better than the robo-vessels that cannot do routine maintenence.\n\u003C/p\u003E\n\u003Cp\u003E\nOther Question: What kind of maintenence on a spaceship (especially a scifi kind or close) would having a crew be ideal for? My guess is for patching leaks and replacing mechanical parts BEFORE they totally fail and etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is for vessels that will spend months away from base without ressupply.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess the closest analog are navy nuclear powered USA warships. But the big difference with outer space is the environment.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only regular maintenence you need on a crewed space vessel is life support, propulsion, and weapons to make sure they still work or work properly. Probably less wear and tear since outer space is not like the ocean nor does it have waves crashing into the hull.\n\u003C/p\u003E\n\u003Cp\u003E\nA robot vessel has no life support, but any wear and tear done to any part of it\u0027s propulsion or weapon or sensor systems is unlikely to be repaired.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond Question: What parts on a robot vessel will wish they had a crew to maintain them over the months and begin to wear out faster than if they had a crew to do regular maintenence?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-14T05:13:17Z\u0022 title=\u002201/14/2024 05:13  AM\u0022 data-short=\u0022Jan 14\u0022\u003EJanuary 14\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2024-01-14T08:28:17Z","Content":"\n\u003Cp\u003E\nI think you put your finger on it within the first two sentences. Everything else is going to be situational, and highly dependent on available technology. Again, as you said yourself, having a crew in the loop for decision making is an advantage - unless you have a robo-mind capable of thinking like a human. Alternatively, FTL comms could remove the need to have a crew onboard for decision making purposes.\n\u003C/p\u003E\n\u003Cp\u003E\nTake maintenance for example? Is it easier to have repairable systems or redundant systems if you want reliability? Is there any reason why those repairs can\u0027t be done by robot? Even present day space vessels have robots to help with maintenance - see DEXTRE on the ISS for example.  Can the repairs be done \u0027in the field\u0027 at all? Fixing a busted nuclear reactor might be difficult, replacing a worn thruster nozzle less so - assuming that the nozzle was designed to be replaceable.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, life support systems and crew compartments have a fairly substantial mass penalty. If you do away with those, is your warship light enough that you can give it acceptable performance with a simpler, more reliable propulsion system? For that matter, is a repairable vessel worth the extra cost and complexity? Might it be more practical to have a swarm of drone vessels and just accept that you\u0027re going to lose some over time due to lack of maintenance?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat weapons are your ships using and defending against? How long do you expect the ship to need to last between engagements? Is battle damage likely to be survivable or not? If a single engagement is likely to damage a warship beyond repair then a) there may not be much point worrying about maintenance and b) you\u0027re probably not going to put a crew on it.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t get me wrong - you can absolutely have a setting with crewed, repairable warships if you like but it\u0027s difficult to say what the advantages or disadvantages of having a crew are without knowing more about the available technology in that setting - and the rest of the setting for that matter. There are  various \u0027soft\u0027 reasons for crewed warships that have been explored fairly thoroughly in science fiction. Are you writing in a setting where AI has been banned, such that any computer more advanced than a desk calculator is a dangerous heresy? Does your setting have a tradition of honourable combat aboard crewed warships?  (True warriors don\u0027t send machines to fight for them, even if the machines could probably do a better job.) Or maybe you\u0027re leaning \u003Cem\u003EStarship Trooper\u003C/em\u003E-wards, and service aboard a warship is  a necessary part of winning political privilege and influence back home,  assuming that you survive your tour of duty.\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2024-01-14T09:29:14Z","Content":"\n\u003Cp\u003E\nThe fact that high g maneuvers aren\u0027t mentioned reveals a huge assumption about available magic technology.\n\u003C/p\u003E\n\u003Cp\u003E\nUntil, if ever, the ability to nullify g forces happens, this is a big minus for crewed craft\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2024-01-14T14:14:46Z","Content":"\n\u003Cp\u003E\nWasn\u0027t this done in Marvel\u0027s Guardian movie?  The gold folks had drone ships, IIRC. \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2024-01-14T15:06:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358947\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705220897\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you put your finger on it within the first two sentences. Everything else is going to be situational, and highly dependent on available technology. Again, as you said yourself, having a crew in the loop for decision making is an advantage - unless you have a robo-mind capable of thinking like a human. Alternatively, FTL comms could remove the need to have a crew onboard for decision making purposes.\n\u003C/p\u003E\n\u003Cp\u003E\nTake maintenance for example? Is it easier to have repairable systems or redundant systems if you want reliability? Is there any reason why those repairs can\u0027t be done by robot? Even present day space vessels have robots to help with maintenance - see DEXTRE on the ISS for example.  Can the repairs be done \u0027in the field\u0027 at all? Fixing a busted nuclear reactor might be difficult, replacing a worn thruster nozzle less so - assuming that the nozzle was designed to be replaceable.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, life support systems and crew compartments have a fairly substantial mass penalty. If you do away with those, is your warship light enough that you can give it acceptable performance with a simpler, more reliable propulsion system? For that matter, is a repairable vessel worth the extra cost and complexity? Might it be more practical to have a swarm of drone vessels and just accept that you\u0027re going to lose some over time due to lack of maintenance?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat weapons are your ships using and defending against? How long do you expect the ship to need to last between engagements? Is battle damage likely to be survivable or not? If a single engagement is likely to damage a warship beyond repair then a) there may not be much point worrying about maintenance and b) you\u0027re probably not going to put a crew on it.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t get me wrong - you can absolutely have a setting with crewed, repairable warships if you like but it\u0027s difficult to say what the advantages or disadvantages of having a crew are without knowing more about the available technology in that setting - and the rest of the setting for that matter. There are  various \u0027soft\u0027 reasons for crewed warships that have been explored fairly thoroughly in science fiction. Are you writing in a setting where AI has been banned, such that any computer more advanced than a desk calculator is a dangerous heresy? Does your setting have a tradition of honourable combat aboard crewed warships?  (True warriors don\u0027t send machines to fight for them, even if the machines could probably do a better job.) Or maybe you\u0027re leaning \u003Cem\u003EStarship Trooper\u003C/em\u003E-wards, and service aboard a warship is  a necessary part of winning political privilege and influence back home,  assuming that you survive your tour of duty.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was discussing this with the author of an ongoing scifi space opera webcomic. In it the blue space babes have been at total war for about 28 years with space bugs. Either side winning is not desired by the other because the blue space babes are known for virtually wiping out two worlds prior they fought against, and the space bugs have made known their intent to wipe out the space babes, despite not having a history of trying to totally wipe out intelligent races they are making an exception for the blue space witches as they call them (because some have superpowers).\n\u003C/p\u003E\n\u003Cp\u003E\nThe blue space babes are losing so many trained personnel that they are having difficulty keeping up with pumping out trained space navy officers to replace the dying, and few old veterans exist (since most died in combat... even the empress and her flagship were blown up at one point).\n\u003C/p\u003E\n\u003Cp\u003E\nI opined that drone ships with a few crewed core vessels woukd solve this issue, and besides the author wanting to write.. indeed NEEDING to write a navy analog to make his story work at all, he said crewed vessels need regular maintenence as they are away for several months at a time (six months is not uncommon) and can do 30g max for 100 hours (more if they do lower g or spend time cruising on inertia) besides having interstellar jump drives.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2024-01-14T15:11:21Z","Content":"\n\u003Cp\u003E\nComplexity compounds. There’s a lot less maintenance required if there’s no crew and failures often can be mitigated with redundancy. Even to the point of sending multiple drones as was done with the Mariners and Voyagers.\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2024-01-14T15:46:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224358952\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705224554\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe fact that high g maneuvers aren\u0027t mentioned reveals a huge assumption about available magic technology.\n\u003C/p\u003E\n\u003Cp\u003E\nUntil, if ever, the ability to nullify g forces happens, this is a big minus for crewed craft\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSpacecraft capable of high G for any significant amount of time are only marginally less impossible than G-force nullification. For near-future settings we could probably assume this won\u0027t be a problem, especially if the crew compartment is close to \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2024-01-14T16:29:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359028\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705244795\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI opined that drone ships with a few crewed core vessels woukd solve this issue, and besides the author wanting to write.. indeed NEEDING to write a navy analog to make his story work at all, he said crewed vessels need regular maintenence as they are away for several months at a time (six months is not uncommon) and can do 30g max for 100 hours (more if they do lower g or spend time cruising on inertia) besides having interstellar jump drives.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy gut feeling is that journeys measured in months seem a bit short for needing regular maintenance but that\u0027s mostly because I\u0027m used to thinking in terms of present day probes and landers which, although fairly complex, aren\u0027t as complex as a warship. Any navy folks on here will have more relevant insights I would think. For that matter, anyone in the aviation business could probably help - how much maintenance, and what sort of maintenance, do airliners need in a month?\n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, if he needs a Space Navy to make the story work, that\u0027s all the justification required. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2024-01-14T17:16:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359041\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705247185\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSpacecraft capable of high G for any significant amount of time are only marginally less impossible than G-force nullification. For near-future settings we could probably assume this won\u0027t be a problem, especially if the crew compartment is close to \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, gee.  Ok.   \n\u003C/p\u003E\n\u003Cp\u003E\nBut seeing as how we already have drones and missiles that can generate g forces that would kill anyone onboard easily and we have zero clue how to \u0022nullify gravity\u0022 I have to take exception to the use of \u0022marginally less impossible\u0022.  If we had a grasp of the true nature of gravity then we might be able to evaluate what may be possible, and how marginally more difficult it may be, but we really don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile we do have a pretty good theoretical grasp of how a torch drive would work\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2024-01-14T18:24:34Z","Content":"\n\u003Cp\u003E\nDepends on the point, and like all scifi, depends entirely on the universe.\n\u003C/p\u003E\n\u003Cp\u003E\n1. With lots of space (har har), what\u0027s the incentive for warfare? Habitable worlds? That would probably be species-dependent, what\u0027s habitable to US, might be awful for some aliens. Resources? Loads of useful stuff in the universe, is any solar system that much better than another for rare Earths, water, carbon, etc?\n\u003C/p\u003E\n\u003Cp\u003E\n2. What is the goal of warfare (relates to #1)? Secure a world intact for colonization/resources? Secure a region of a solar system for resource extraction? Secure something else intact—say special regions that allow FTL (#3)? Genocide (who cares about resources, we want to wreck entire worlds, Death Star style (or just some object with high velocity relative to c thrown at a world)!\n\u003C/p\u003E\n\u003Cp\u003E\n3. What is the FTL in this universe (or is that not a thing)? This would presumably drive the nature of encounter battles (assuming some rationale in #1/2).\n\u003C/p\u003E\n\u003Cp\u003E\n3a. Continuous FTL (Star Trek, Known Space books (Niven))?\n\u003C/p\u003E\n\u003Cp\u003E\n3b. Stargates (2001, Babylon 5, etc)?\n\u003C/p\u003E\n\u003Cp\u003E\n3c. \u0022Jump\u0022 drives (traveller RPG, Star Wars, etc—enter hyperspace some time increment later you appear elsewhere)?\n\u003C/p\u003E\n\u003Cp\u003E\n3d. Something else?\n\u003C/p\u003E\n\u003Cp\u003E\n4. The methods above can have rules, like traveller does—FTL doesn\u0027t work where space is sufficiently curved (gravity wells), so ships exit FTL some distance from worlds, then travel in normal space. Same can be done with stargates—either they can\u0027t be built in certain places (because plot-device physics), or they might be a sort of quasi-natural thing, where \u0022hyperspace/subspace/whatever\u0022 is only accessible in discrete regions of space—making those chokepoints and hence valuable.\n\u003C/p\u003E\n\u003Cp\u003E\nAll the above relate to drones (or AI) vs crewed vehicles. If people (using this broadly to include all sentient races in the universe) need to get someplace—to and from places where people can live, etc—then those crewed vehicles are possible targets, and might have to have military capability. Of course they could carry drone ships to do that. I think most classic SF got computers very wrong, and while having people as crew creates drama, computers realistically control virtually all aspects of space combat. The extreme case might be the Culture series ship minds. People are always involved in the stories, but the nitty gritty space combat is done by ships/Minds, not manually by people—who are relegated in combat to man to man (man to mind or knife missiles, etc) in small scale actions.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a digression, but I always felt that the droids in Star Wars were a source of cool plot options vs the idiotic way the whole series of films in fact went. They are clearly AGI, and have full agency. No reason not to have the droids fly the starfighters, etc. A great place for plot there would be to have them revolt against their clear enslavement. Course I think the nw movies should have had the protagonists be normies, perhaps allied with the AI droids, fighting the magical class (force people) who seek to rule over everyone cause they are clearly a master race—2 different factions of totalitarian rule by wizards is still a dystopia, after all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-14T18:25:25Z\u0022 title=\u002201/14/2024 06:25  PM\u0022 data-short=\u0022Jan 14\u0022\u003EJanuary 14\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2024-01-14T18:26:25Z","Content":"\n\u003Cp\u003E\nTARS in cabin, R2D2 on top.\n\u003C/p\u003E\n\u003Cp\u003E\nC3PO as intercom.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2024-01-14T19:39:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359119\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705256674\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDepends on the point, and like all scifi, depends entirely on the universe.\n\u003C/p\u003E\n\u003Cp\u003E\n1. With lots of space (har har), what\u0027s the incentive for warfare? Habitable worlds? That would probably be species-dependent, what\u0027s habitable to US, might be awful for some aliens. Resources? Loads of useful stuff in the universe, is any solar system that much better than another for rare Earths, water, carbon, etc?\n\u003C/p\u003E\n\u003Cp\u003E\n2. What is the goal of warfare (relates to #1)? Secure a world intact for colonization/resources? Secure a region of a solar system for resource extraction? Secure something else intact—say special regions that allow FTL (#3)? Genocide (who cares about resources, we want to wreck entire worlds, Death Star style (or just some object with high velocity relative to c thrown at a world)!\n\u003C/p\u003E\n\u003Cp\u003E\n3. What is the FTL in this universe (or is that not a thing)? This would presumably drive the nature of encounter battles (assuming some rationale in #1/2).\n\u003C/p\u003E\n\u003Cp\u003E\n3a. Continuous FTL (Star Trek, Known Space books (Niven))?\n\u003C/p\u003E\n\u003Cp\u003E\n3b. Stargates (2001, Babylon 5, etc)?\n\u003C/p\u003E\n\u003Cp\u003E\n3c. \u0022Jump\u0022 drives (traveller RPG, Star Wars, etc—enter hyperspace some time increment later you appear elsewhere)?\n\u003C/p\u003E\n\u003Cp\u003E\n3d. Something else?\n\u003C/p\u003E\n\u003Cp\u003E\n4. The methods above can have rules, like traveller does—FTL doesn\u0027t work where space is sufficiently curved (gravity wells), so ships exit FTL some distance from worlds, then travel in normal space. Same can be done with stargates—either they can\u0027t be built in certain places (because plot-device physics), or they might be a sort of quasi-natural thing, where \u0022hyperspace/subspace/whatever\u0022 is only accessible in discrete regions of space—making those chokepoints and hence valuable.\n\u003C/p\u003E\n\u003Cp\u003E\nAll the above relate to drones (or AI) vs crewed vehicles. If people (using this broadly to include all sentient races in the universe) need to get someplace—to and from places where people can live, etc—then those crewed vehicles are possible targets, and might have to have military capability. Of course they could carry drone ships to do that. I think most classic SF got computers very wrong, and while having people as crew creates drama, computers realistically control virtually all aspects of space combat. The extreme case might be the Culture series ship minds. People are always involved in the stories, but the nitty gritty space combat is done by ships/Minds, not manually by people—who are relegated in combat to man to man (man to mind or knife missiles, etc) in small scale actions.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a digression, but I always felt that the droids in Star Wars were a source of cool plot options vs the idiotic way the whole series of films in fact went. They are clearly AGI, and have full agency. No reason not to have the droids fly the starfighters, etc. A great place for plot there would be to have them revolt against their clear enslavement. Course I think the nw movies should have had the protagonists be normies, perhaps allied with the AI droids, fighting the magical class (force people) who seek to rule over everyone cause they are clearly a master race—2 different factions of totalitarian rule by wizards is still a dystopia, after all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStarships in setting don\u0027t typically arrive close enough to planets to make a successful RKV shot right away. And if tried... weapon ranges are extreme.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBlue space babes have a kill beam that hits at a light second out, and the space bugs have beams that can kill at a little over half that.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth of which are particle beams that take mere seconds to cross such vast distances at most.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-14T19:39:53Z\u0022 title=\u002201/14/2024 07:39  PM\u0022 data-short=\u0022Jan 14\u0022\u003EJanuary 14\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2024-01-14T19:57:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359144\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705261168\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStarships in setting don\u0027t typically arrive close enough to planets to make a successful RKV shot right away. And if tried... weapon ranges are extreme.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRelativistic weapons fired from huge distances have to be detected. It\u0027s not like a planet moves unpredictably. And no reason for crew on weapon or the platform that fires it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359144\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705261168\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBlue space babes have a kill beam that hits at a light second out, and the space bugs have beams that can kill at a little over half that.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth of which are particle beams that take mere seconds to cross such vast distances at most.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis answers no questions related to drone vs not drone.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-01-14T21:41:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359085\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705252599\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, gee.  Ok.   \n\u003C/p\u003E\n\u003Cp\u003E\nBut seeing as how we already have drones and missiles that can generate g forces that would kill anyone onboard easily and we have zero clue how to \u0022nullify gravity\u0022 I have to take exception to the use of \u0022marginally less impossible\u0022.  If we had a grasp of the true nature of gravity then we might be able to evaluate what may be possible, and how marginally more difficult it may be, but we really don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile we do have a pretty good theoretical grasp of how a torch drive would work\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is true, however the missiles with high g rating has an very short burn time, anti air missiles can use the air to take high g turn but this don\u0027t work in space. \u003Cbr\u003E\n\u003Cbr\u003E\nOrion can do high g with pretty decent \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E. But an orion is an good sized ship and it get more efficient who larger it become, This is an general issue, good engines are large fusion engines have much higher \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E but less trust, you can dump mass into the exhaust for more trust but its not very efficient, you might be able to make an smaller fusion engines but think its limit on how well this scales down. \u003Cbr\u003E\nSo capital ships will have higher \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E and probably as high trust as small ships. \u003Cbr\u003E\n\u003Cbr\u003E\nNow you can make throwaway drone ships who is an mix of an arsenal ship and a ICBM carrying hundreds of ton of missiles and other payloads accelerating to high velocity while random walk as its not intended to brake and be reused, you probably blow it up at least part of the ship simply to make more radar returns.\u003Cbr\u003E\nIf you are fanatical enough you could do this with an manned ship. Japan sent Yamato on an suicide mission with thousands of sailors after all and this arsenal ship would have an pretty small crew. \n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2024-01-14T22:31:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359085\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705252599\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut seeing as how we already have drones and missiles that can generate g forces that would kill anyone onboard easily\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor a total of 5-10 seconds before the thruster burns out and/or at a scale too small to house a cat, let alone a human.\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2024-01-15T00:11:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359199\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705271460\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor a total of 5-10 seconds before the thruster burns out and/or at a scale too small to house a cat, let alone a human.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGranted, but a torch ship, which could permanently injure or kill with unbridled acceleration, is far more plausible than \u0022gravity nullification\u0022.   Might as well just teleport bombs where you want them using your mastery over the fabric of space and time and all things quantum, or just snap your fingers and have your enemy get swallowed (and disassembled) by the quantum foam around them like sinking in quicksand.  No bombs required.  The point being that mastery over gravity implies a helluva lot of mastery.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-15T00:13:39Z\u0022 title=\u002201/15/2024 12:13  AM\u0022 data-short=\u0022Jan 15\u0022\u003EJanuary 15\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2024-01-15T03:49:09Z","Content":"\n\u003Cp\u003E\nStrangelet shrapnel charges.\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2024-01-15T10:22:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359270\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705290549\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStrangelet shrapnel charges.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022Sir, we are finding scattered bits of oddness, I\u0027m trying not to jump to conclusions here, but...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022No, you are right Lt., were must face facts straight on.  The enemy, against all sanity, is sneaking strangelet shrapnel satchel snuffers into a silly and stupid struggle.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-01-17T16:31:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224359222\u0022 data-ipsquote-contentid=\u0022222981\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221705277506\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/15/2024 at 1:11 AM, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGranted, but a torch ship, which could permanently injure or kill with unbridled acceleration, is far more plausible than \u0022gravity nullification\u0022.   Might as well just teleport bombs where you want them using your mastery over the fabric of space and time and all things quantum, or just snap your fingers and have your enemy get swallowed (and disassembled) by the quantum foam around them like sinking in quicksand.  No bombs required.  The point being that mastery over gravity implies a helluva lot of mastery.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat you want here is an inertial dampener who cancel out the g forces from trust or rotation. Not something who block gravity. Still both could be used to create an perpetuum mobile, so it also solves the power requirement you have, just need more magic to remove heat who is probably easier. \n\u003C/p\u003E\n"}]}