{"TopicId":223403,"ForumId":120,"TopicTitle":"7 quality of life additions I would love to see ingame.","CreatedByName":"BechMeister","CreatedById":228007,"CreatedDateTime":"2024-01-31T19:05:58Z","PageNum":1,"Articles":[{"CreatedByName":"BechMeister","CreatedById":228007,"CreatedDateTime":"2024-01-31T19:05:58Z","Content":"\n\u003Cp\u003E\nGreetings. Over the last soon 800h I\u0027ve played/fought KSP2 I have come to grow a list of things I wish were in the game.\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E The Ability to double click on the NAV BALL and the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E pointing the ship in that direction.\u003C/strong\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nI feel I needed this more when the rockets were very wobbly - It could be very difficult to hit the wanted  heading and angle going into orbit. Also This may just be because I play at a very low framerate a lot of the time. But when setting up the vehicle for docking. It would be nice to double click on the NAV ball and the ship be like \u0022sure I can point 10­­­° away from target so you can move around it and still be near the target docking port.\u0022 without me having to manually point the ship. Any way.. small quality of life change for precise maneuvers.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ENight Vision:\u003C/strong\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nDon\u0027t get me wrong - I love that the night is actually dark. Right until I have to land a craft. You see I, like I assume a lot of other people, use landmarks to make sure I get the runway lined up or the landing pads. But I cannot see these landmarks when its night. Also on the way down it can be really hard to see where you\u0027re going. I placed little drones at the end of the runway and landing pads respectively.. but I would love to be able to toggle night vision at night for landings etc.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EThe ability to show atmospheric bands on the vehicle path.\u003C/b\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nI made a poor example of what I mean here: \u003Cem\u003Ecolour correspond to the atmosphere bands shown on the altitude indicator on the Navball \u003C/em\u003E\u003Cbr\u003E\n\u003Cimg alt=\u0022QG8UdCe.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QG8UdCe.jpeg\u0022\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nI have a second stage that drops like a stone once its through the dark blue part of the atmosphere ~32-17km - Which means I am most interested in knowing when I\u0027ll hit that part of the atmosphere, so I can aim that to be right above target. \u003Cbr\u003E\n\u003Cbr\u003E\nOther times I fly a glider, and I know that ~32-17km is the atmospheric band where I can extend or shorten the glide in accordance to what I am trying to hit by changing \u003Cabbr title=\u0022Angle of Attack\u0022\u003E\u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E\u003C/abbr\u003E and Bank angle.\u003Cbr\u003E\n\u003Cbr\u003E\nThe actual path is worthless once you hit the atmosphere. For instance I\u0027ve learned that aiming at those islands will consistently place me close enough to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E to land at the pads most of the time, and hit the runway everytime. But It would be nice not having to use landmarks.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EBodyflaps:\u003C/strong\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nI just had a glider that I would glide perfect in atmosphere, but would flip its ass as soon as it had a \u003Cabbr title=\u0022Angle of Attack\u0022\u003E\u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E\u003C/abbr\u003E on more than 0° going through it - Doing a lot of experimentation I decided to create a replica of a body flap. The only items I had that really fit the role, without re-wirering the wings (Oh we will get to that later) was the aerobreaks:\u003Cbr\u003E\n\u003Cimg alt=\u0022YlJmxNv.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YlJmxNv.jpeg\u0022\u003E\u003Cbr\u003E\nBy adding 2 Aerobreaks and fiddling with the deploy settings I found the spot were I can re-enter with a \u003Cabbr title=\u0022Angle of Attack\u0022\u003E\u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E\u003C/abbr\u003E of 40° and not having it flip over (25° if your curious). But I find the aerobreaks utterly ugly.. So It would be cool with dedicated body flaps. Like on the Shuttle, Star Rider, X37b etc.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EThe Ability to manually tell wings what way to pitch up/down.\u003C/strong\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nBecause I thought the Aerobreaks looked ugly, I tried to make the same effect with a wing:\u003Cbr\u003E\n\u003Cimg alt=\u0022z65nLrm.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z65nLrm.jpeg\u0022\u003E\u003Cbr\u003E\nHow ever - when doing that it ment the game automatically re-wired what the wings were doing. So my main lifting wing would pitch down when I asked it to pitch up etc. When I tried to invert it, it also inverted the roll. Which meant I have to give up testing using the wing as a bodyflap. Since I could not get it to fly staight.\u003Cbr\u003E\n\u003Cbr\u003E\nI sugguest the devs either:\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cstrong\u003EA. \u003C/strong\u003ESplit invert controls into roll and pitch/Jaw - So we can invert Pitch/Jaw without inverting roll.\u003Cbr\u003E\n\u003Cstrong\u003EB. \u003C/strong\u003EGive us full control over the wing, so we can tell it what to do.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EThat you can check how much the planet has rotated before you arrive at your destination.\u003C/b\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nThe amount of times I have thought I placed my maneuver node at the right spot. Only to realize that \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E has moved so far while going down to the highest atmosphere and missed the target is infuriating.  It would be nice with a tool were you could check \u0022how much have the planet rotated when I arrive here at my path\u0022.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EHave the distance in \u0022Target Mode\u0022 show the distance to target. \u003C/strong\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nThis is a small thing. I often only look at the navball when doing maneuvers for docking. Only look at the actual station and ship to change Pitch and Jaw angles so I hit the port propper. It would just be nice to have all the info on the nav ball.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is my top 6 most wanted features in the game. \n\u003C/p\u003E\n\u003Cp\u003E\nThank you for indulging me.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-01-31T19:20:07Z\u0022 title=\u002201/31/2024 07:20  PM\u0022 data-short=\u0022Jan 31\u0022\u003EJanuary 31\u003C/time\u003E by BechMeister\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lowi_Sace","CreatedById":224820,"CreatedDateTime":"2024-02-01T14:02:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224363462\u0022 data-ipsquote-contentid=\u0022223403\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221706727958\u0022 data-ipsquote-userid=\u0022228007\u0022 data-ipsquote-username=\u0022BechMeister\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, BechMeister said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe ability to show atmospheric bands on the vehicle path.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EI like that idea and the picture does also look good. It is\u003Cspan\u003E  \u003C/span\u003Every clear picture that shows the player the layers of the atmosphere there trajectory is crossing. Also an indicator on the trajectory line that shows your trajectory is entering an atmosphere would be nice. Maybe the trajectory line could have another color if in an atmosphere, so you know that from the line will not be accurate anymore\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MirageNL","CreatedById":227554,"CreatedDateTime":"2024-02-01T15:56:03Z","Content":"\n\u003Cp\u003E\n1. That\u0027s a fantastic suggestion. That would certainly help with docking, but also with landing adjustments. Too often that devolves into turning and toppling all over the place while continuously trying to make correction burns. Orientation is lost quickly and trying to regain control can be a nightmare. A point and click orientation isn\u0027t much different from creating a maneuver node in principle, but it would be a lot faster.\n\u003C/p\u003E\n\u003Cp\u003E\n2. I think the darkness is a good incentive to plan your landing on the bright side of planets/moons. Otherwise, bring lights. I do agree that some general orientation would be helpful, certainly on Kerbin. Maybe just showing the outlining of coastlines?\n\u003C/p\u003E\n\u003Cp\u003E\n6. This annoys me as well. Shallow angles make for the cheapest landings, so the optimal descent maneuver is at the other side of the planet/moon. Rotation makes it very hard to plan a precise landing this way though. There should be a surface collision indicator.\n\u003C/p\u003E\n\u003Cp\u003E\n7. That would be very useful too, instead of having to switch to map view.\n\u003C/p\u003E\n"},{"CreatedByName":"BechMeister","CreatedById":228007,"CreatedDateTime":"2024-02-01T18:26:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224363657\u0022 data-ipsquote-contentid=\u0022223403\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221706802963\u0022 data-ipsquote-userid=\u0022227554\u0022 data-ipsquote-username=\u0022MirageNL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, MirageNL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2. I think the darkness is a good incentive to plan your landing on the bright side of planets/moons. Otherwise, bring lights. I do agree that some general orientation would be helpful, certainly on Kerbin. Maybe just showing the outlining of coastlines?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think with how much the path changes going through the atmosphere - not being able to see the landmarks is what keeps me away from landing on Kerbin at night. Call me a perfectionist.. but I want to touch down on the runway. The landing pads at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E are especially hard to line up I think. Unless you spend a ridicules amount of Δv on your deorbit burn for a as steep as possible re-entry (where the path won\u0027t change a lot)\u003Cbr\u003E\n\u003Cbr\u003E\nI think if something like 3. was in the game. I would not need to see my landmarks, because then I wouldn\u0027t need landmarks to hit \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E x)\u003Cbr\u003E\n\u003Cbr\u003E\nI guess... in essence.. what I am missing. Is something to ensure consistent results when re-entering. Right now the path is not good enough, as it does not show how much the atmosphere affects you... But I don\u0027t think they will be able to propper program that into it without it taking a lot of computer power. Since.. depending on your pitch it would need to recalculate your path. Any way.. I digress.\n\u003C/p\u003E\n\u003Cp\u003E\nDoes any of my ramblings make sense?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224363632\u0022 data-ipsquote-contentid=\u0022223403\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221706796128\u0022 data-ipsquote-userid=\u0022224820\u0022 data-ipsquote-username=\u0022Lowi_Sace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Lowi_Sace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EI like that idea and the picture does also look good. It is\u003Cspan\u003E  \u003C/span\u003Every clear picture that shows the player the layers of the atmosphere there trajectory is crossing. Also an indicator on the trajectory line that shows your trajectory is entering an atmosphere would be nice. Maybe the trajectory line could have another color if in an atmosphere, so you know that from the line will not be accurate anymore\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis are also fantastic sugguestions. I actually think I like the coloured line with a dot, or line to indicate the change of atmosphere more than my original idea.. and it would be easier to implement.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-01T18:31:38Z\u0022 title=\u002202/01/2024 06:31  PM\u0022 data-short=\u0022Feb 1\u0022\u003EFebruary 1\u003C/time\u003E by BechMeister\u003C/strong\u003E\n\u003C/span\u003E\n"}]}