{"TopicId":223575,"ForumId":120,"TopicTitle":"Suggestion for SAS Control","CreatedByName":"RocketSon4","CreatedById":229542,"CreatedDateTime":"2024-02-08T17:03:02Z","PageNum":1,"Articles":[{"CreatedByName":"RocketSon4","CreatedById":229542,"CreatedDateTime":"2024-02-08T17:03:02Z","Content":"\n\u003Cp\u003E\nWhen a rocket, rover, etc, is landed, can the development team please allow us to set \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E control. For example, if you have a rocket that lands on a slight slope, and you are doing a kerbal rescue mission, the rocket tends to fall over once you swap to the kerbal, even with landing gear. The same goes for splashing down in an ocean. My suggestion is that once a rocket is landed or in water, allow us to set \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to up or down, EVEN WHEN VELOCITY SAYS  LESS THAN 1.0 m/s. Down in case someone is flying with their command module orientation inverted. I have had problems with this because of a kerbal rescue on Laythe. I splashed down completely vertical around 700 meters from a beached rocket. By the time I got one of the kerbals within 50 meters, the rocket was tipping over, and I had no way to reorient the rocket, except quickloading and redoing the entry and landing of the rescue rocket. If  we could set the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E control to up or down even when below 1.0 meters/sec, AND LANDED OR SPLASHED DOWN, then rockets tipping over would be much less of a problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Icegrx","CreatedById":232176,"CreatedDateTime":"2024-02-08T19:35:53Z","Content":"\n\u003Cp\u003E\nOne thing I do to sort of bypass this issue. When landed, and kerbal are still in craft. Ensure the body I am landed on is set as target. Then on my \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E wheel I lock orientation to “anti target” this works for some reason even when you cannot set your wheel to “up” \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nbut yes, I would like to skip doing all of that, and just set my wheel to “up” when landed. \n\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2024-02-08T21:33:37Z","Content":"\n\u003Cp\u003E\nThese are just due to bugs though. Once the bugs are fixed, there will be no need for \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E while landed. Better to devote the effort to fixing the bugs.\n\u003C/p\u003E\n"}]}