{"TopicId":223676,"ForumId":70,"TopicTitle":"KSP Keeps resetting my resolution and it\u0026#039;s driving me INSANE","CreatedByName":"PotatoPCuser1","CreatedById":192763,"CreatedDateTime":"2024-02-13T23:00:33Z","PageNum":1,"Articles":[{"CreatedByName":"PotatoPCuser1","CreatedById":192763,"CreatedDateTime":"2024-02-13T23:00:33Z","Content":"\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBefore commenting suggesting to use AnyRes, use command line arguments, or to set the settings.cfg to read-only, I\u0027ve tried it all and it does not work.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve run into a problem. My installation of Kerbal Space Program keeps resetting itself to 720p windowed. Whenever i try to set the resolution in the in-game settings menu, it works and even scales the ui correctly. However, whenever I click accept or cancel to go back to the main menu (and re-enable 3d rendering) it resets itself to 720p windowed. No matter what I try, no matter how many forum threads I search for, no one else has had this problem. Any and all help is gratefully appreciated.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditional context: settings.cfg shows the resolution as 1920x1080 fullscreen, but no matter what the game always launches as 1280x720 windowed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELink to my KSP.log:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://drive.google.com/file/d/1Q98nxKZPKZzlNfVyyJv2-w8245ZIZnZV/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/file/d/1Q98nxKZPKZzlNfVyyJv2-w8245ZIZnZV/view?usp=sharing\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFull modlist can be found within the log file. I have also since deleted the outdated version of ModuleManager, to no effect.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nRESOLVED:\u003Cbr\u003E\n\u003Cbr\u003E\nI hard restarted my pc after removing the outdated ModuleManager, changed the resolution in the main menu settings (to no immediate effect), then loaded into a save and entered the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Once in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, I used the AnyRes Menu to select the correct resolution, which finally worked.\n\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2024-02-14T17:49:43Z","Content":"\n\u003Cp\u003E\nI actually had the opposite issue on my last machine - no matter what resolution I set it to (usually 720p as I was trying to boost performance), it would inevitably reset to my native screen resolution (3000x2000). It never switched from fullscreen to windowed though, that\u0027s a new one...\n\u003C/p\u003E\n"}]}