{"TopicId":223838,"ForumId":119,"TopicTitle":"KSP2 suggestion: Caves.","CreatedByName":"SpaceWalker1870","CreatedById":231443,"CreatedDateTime":"2024-02-25T00:21:17Z","PageNum":1,"Articles":[{"CreatedByName":"SpaceWalker1870","CreatedById":231443,"CreatedDateTime":"2024-02-25T00:21:17Z","Content":"\n\u003Cp\u003E\nCaves in ksp2 would make a great addition. it would be some additional science locations, recource locations, or even lore locations. additionally, they could act like to shield kerbals from radiation, if radiation gets added to ksp2.\u003Cbr\u003E\n\u003Cbr\u003E\nBut, a main problem with this would be that ksp2 terrain system is like heightmap based, not allowing overhangs, arches, or caves in the terrain, like how ksp1 is. But if youve played ksp1 long enough, you mightve found the mun arches, which sort of break this terrain rule. this is done as the mun arch is a sort of feature, or like structure placed onto terrain, not part of the terrain itself. So, if this can be done with arches, it can probably be done with caves. Hey, even with Tylo, it has its cave. But, tylos cave, (havent explored it, but like generally as ive heard and seem with videos, im pretty sure its like just a general large structure, like a single room type cave. but, maybe caves could be more advanced than this, like have more advanced inside parts of cave, like tunnels, and different sections, and not be extruding from terrain, instead be like below the terrain.Like, there could be some section of terain of some planet have like some \u0022dip\u0022 like a basin basically, where its much lower than the surrounding terrain, and then have a science discoverable/placeable feature (like ksp1 mun arch) but instead of that, have it like some structure that fills in the basin, so it looks flat, but could also look like a hill. BUT, the advantage of doing this in a few locations around the planet, is that this reigon could have a cave network within it, imagine... the lore that could be in there, like imagine some ancient civilization, or could be like a lava tube at the mun. like the entire ksp2 \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E is like a structure like this, like its not part of natural terrain. OR, it could be a really large one, or really deep one, and have it that this cave go really deep, potentially there could be a special recourse you could extract from the bottom of this cave, also imagine like underground sciences, and it would make lights truly/even more useful, as usually you can just timewarp to day to use lights, but in caves you would need lights, and solar panels wouldnt work. it would be a challenge to explore these, and there would be so many gameplay opportunities from this addition.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, would be insane to see this like for interstellar planets, like imagine the lore behind this, like you find some small cave that requires construction of some really small rover, and then once you enter it you find like a large ancient artificial structure....\n\u003C/p\u003E\n"},{"CreatedByName":"Apogee-23","CreatedById":231499,"CreatedDateTime":"2024-02-26T22:32:45Z","Content":"\n\u003Cp\u003E\nKsp 2\u0027s decal system allows for a lot more unique surface features, such as the lake on Vall hanging rocks on Kerbin. I assume it wouldn\u0027t be too had to add below ground caves with that.\n\u003C/p\u003E\n"},{"CreatedByName":"Dakitess","CreatedById":89253,"CreatedDateTime":"2024-02-27T09:58:07Z","Content":"\n\u003Cp\u003E\nI\u0027m afraid it would look really bad and would only be some kind of very rare specific location, not a credible terrain feature that you\u0027ll try to find by yourself.\n\u003C/p\u003E\n\u003Cp\u003E\nI would love cave as well, but as something that I would randomly find or look for, not these very messy easter egg, very badly implemented, with different shaders, different lightning, different textures, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nTerrain tech in KSP2 is so deceiving, this is exactly what I was expecting the most and what actually bring the less \u003Cspan\u003E\u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Skorj","CreatedById":201273,"CreatedDateTime":"2024-02-28T23:53:59Z","Content":"\n\u003Cp\u003E\nAs far as implementation in a game where the surface is a height map, so overhangs or caves are hard to do, caves are best done using \u0022portals\u0022.  This works quite well for caves, but can be screwy for tunnels. \n\u003C/p\u003E\n\u003Cp\u003E\nGameplay wise, it would make sense for cave entrances to be targets for missions. Land near the cave, then explore inside with a rover.  It\u0027s a good reason to use a rover instead of just landing where you want to be.\n\u003C/p\u003E\n"},{"CreatedByName":"kdaviper","CreatedById":229094,"CreatedDateTime":"2024-02-29T03:58:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224369340\u0022 data-ipsquote-contentid=\u0022223838\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221709164439\u0022 data-ipsquote-userid=\u0022201273\u0022 data-ipsquote-username=\u0022Skorj\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Skorj said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs far as implementation in a game where the surface is a height map, so overhangs or caves are hard to do, caves are best done using \u0022portals\u0022.  This works quite well for caves, but can be screwy for tunnels. \n\u003C/p\u003E\n\u003Cp\u003E\nGameplay wise, it would make sense for cave entrances to be targets for missions. Land near the cave, then explore inside with a rover.  It\u0027s a good reason to use a rover instead of just landing where you want to be.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIirc, this is something they hope to be able to implement with the CBT system. It\u0027s been a while since I\u0027ve read that Dev log however so I may be wrong.\n\u003C/p\u003E\n"}]}