{"TopicId":223835,"ForumId":123,"TopicTitle":"Eve mission 1 while waiting for trip home.","CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-02-24T19:11:59Z","PageNum":1,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-02-24T19:11:59Z","Content":"\n\u003Cp\u003E\nJeb is happy mission has pretty much been an total success from the astronauts view. Enter Eve orbit then picked up Bill who sneak onboard the probe carrier and has 150 days in an rover seat was happy to get into the hitchhiker module and change underwear, he brought 5 K science. \u003Cbr\u003E\n\u003Cbr\u003E\nHere is the probe carrier at day 9. Designed to be very narrow as designed before medium fairings was unlocked. Just pushed the lander out a bit to let the Gilly lander drop off early.  \u003Cbr\u003E\nFirst mistake, should have gone 1\u002B6 medium tanks and two nuclear engines, then 6 rovers rather than 2 landers. we had the technology. \u003Cbr\u003E\nGilly lander worked well. \u003Cbr\u003E\n\u003Cimg alt=\u0022G4mH9BB.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.92\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/G4mH9BB.jpg\u0022\u003E\u003Cbr\u003E\nLook closely at the left lander and you can see Bill. \u003Cbr\u003E\n\u003Cbr\u003E\nIt was an luck that Bill went on an intentional unmanned mission as he could transmit more science home earlier. \u003Cbr\u003E\n\u003Cimg alt=\u00222QKApws.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.92\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2QKApws.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere he is on the Gilly lander who has no landing legs, an docking port would be more fitting. \u003Cbr\u003E\n\u003Cbr\u003E\nHe reported one problem outside of old underwear. \u003Cbr\u003E\n\u003Cimg alt=\u0022KznStEA.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.92\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KznStEA.jpg\u0022\u003E\u003Cbr\u003E\nYou can crash into space around Gilly, Bill has an theory that gravity is so weak it create the opposite of an event horizon. Jeb think Bill has smelled his dirty underwear for to long.\u003Cbr\u003E\nHe also had problems finding the Oblique Impact Site, Jeb yes that huge crater is so hard to find. \u003Cbr\u003E\n\u003Cbr\u003E\nAt the same time a probe landed on Eve\u003Cbr\u003E\n\u003Cimg alt=\u0022aHDZvRl.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.75\u0022 height=\u0022673\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aHDZvRl.jpg\u0022\u003E\u003Cbr\u003E\nThe rover seat is so an kerbal can collect atmospheric samples in low eve orbit. But the orbital module has no batteries just 5 charge from the small probe and I did not want to risk 6 K science getting 2.2 early. \u003Cbr\u003E\nLanded at Eve \u003Cbr\u003E\n\u003Cimg alt=\u0022efwumCI.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/efwumCI.jpg\u0022\u003E\u003Cbr\u003E\nEnvironmental science let you transmit 1000, material science data is 1200, missed olympus, shallows and sea who is also land biomes all giving 2200. 6600 Science missed \u002B the 600 atmospheric from Olympus. and the extra returned from Olympus. Not to talk about the discoverables. I say its plausible to uncover the big sperical tanks and fairings to cover them before reaching Duna. \u003Cbr\u003E\n\u003Cbr\u003E\nCollecting Bill\u003Cbr\u003E\n\u003Cimg alt=\u00220FjZhat.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.92\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0FjZhat.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd 6 K science\u003Cbr\u003E\n\u003Cimg alt=\u0022DqtKtyn.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.75\u0022 height=\u0022673\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/DqtKtyn.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the Eve manned ship.\u003Cbr\u003E\n\u003Cimg alt=\u0022Mbd3Fu0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.92\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Mbd3Fu0.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAn last note after picking up the science we docked with the now empty probe carrier to get some more hydrogen, getting the 11 k science home asap is obviously an priority. \u003Cbr\u003E\nIt had 5 K \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, grabbed half of it, wanted to use the probe carrier to aid in mapping Eve. As carrier was empty it should still have decent with \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E but it showed as 0 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for quite some time until it showed 3 k who make more sense. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-25T00:37:14Z\u0022 title=\u002202/25/2024 12:37  AM\u0022 data-short=\u0022Feb 25\u0022\u003EFebruary 25\u003C/time\u003E by magnemoe\u003C/strong\u003E\n\u003C/span\u003E\n"}]}