{"TopicId":224049,"ForumId":44,"TopicTitle":"How do lenses really work?","CreatedByName":"LHACK4142","CreatedById":208897,"CreatedDateTime":"2024-03-10T08:29:18Z","PageNum":1,"Articles":[{"CreatedByName":"LHACK4142","CreatedById":208897,"CreatedDateTime":"2024-03-10T08:29:18Z","Content":"\n\u003Cp\u003E\nI\u0027ve been investigating photography a little but am confused on how lenses, and focal lengths, really work.  This question has been with me since I was a little kid playing with magnifying glasses, actually.  So, many pictures show light entering a lens as straight lines:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022How Does a Camera Work? (Photography Basics Explained)\u0022 data-ratio=\u002266.57\u0022 width=\u0022700\u0022 src=\u0022https://expertphotography.b-cdn.net/wp-content/uploads/2019/10/how-does-a-camera-work-lens-1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut if only light rays parallel to the lens could enter, you would only be able to see an area equal to that of the lens, right?  Since you can see the entire sun, and not just a lens-sized portion of it (pictured), through a magnifying glass, this type of diagram must be incorrect.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022diagram.png?ex=65ffe537\u0026amp;is=65ed7037\u0026amp;hm=4\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002244.52\u0022 height=\u0022329\u0022 width=\u0022739\u0022 src=\u0022https://media.discordapp.net/attachments/1068843412331175967/1216302759641616485/diagram.png?ex=65ffe537\u0026amp;is=65ed7037\u0026amp;hm=4230c281fa1b812d0d2771a2bc664067948fd873f507583d5a52020318a8133d\u0026amp;=\u0026amp;format=webp\u0026amp;quality=lossless\u0026amp;width=923\u0026amp;height=411\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOther images (below) show straight lines through the lens, which kinda confuses me; don\u0027t lenses specifically bend light?  And what are the lenses in these pictures supposed to be doing?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022focal-length-of-a-lens-diagram.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002268.67\u0022 height=\u0022706\u0022 width=\u00221200\u0022 src=\u0022https://thedigitalprocess.com/wp-content/uploads/2017/03/focal-length-of-a-lens-diagram.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo, \u003Cem\u003Ewhat exactly is a lens doing\u003C/em\u003E, and where are the light rays coming from, how are they being manipulated, and how are they ended up?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-10T08:33:54Z\u0022 title=\u002203/10/2024 08:33  AM\u0022 data-short=\u0022Mar 10\u0022\u003EMarch 10\u003C/time\u003E by LHACK4142\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ryaja","CreatedById":221431,"CreatedDateTime":"2024-03-10T20:49:14Z","Content":"\n\u003Cp\u003E\nSo, light speed is not constant and light has a defined size. When a photon hits the glass at anangle one side slows down and therefore tilits it. Think hitting the water with one side of your \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E wing in KSP(this is the Kerbal forums ok!) so what is done with the lense is the parabolic/circular curve to make it all face the center point. And this essentially compresses the image coming in at the front to a point. You then go behind that and get a flipped but protected image. The further you move the lens away the smaller a portion of the total for your getting in zoom. The closer you get the more of said range you see. So a lens with a long focal length has less fov equalling zoomed in images while the opposite is also true, a lens with a short focal length has a wide fov, a zoomed out image. I hope that wasn\u0027t incoherent ramblings from my mind and others actually understand it!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224371577\u0022 data-ipsquote-contentid=\u0022224049\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221710103754\u0022 data-ipsquote-userid=\u0022221431\u0022 data-ipsquote-username=\u0022Ryaja\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Ryaja said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, light speed is not constant and light has a defined size. When a photon hits the glass at anangle one side slows down and therefore tilits it. Think hitting the water with one side of your \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E wing in KSP(this is the Kerbal forums ok!) so what is done with the lense is the parabolic/circular curve to make it all face the center point. And this essentially compresses the image coming in at the front to a point. You then go behind that and get a flipped but protected image. The further you move the lens away the smaller a portion of the total for your getting in zoom. The closer you get the more of said range you see. So a lens with a long focal length has less fov equalling zoomed in images while the opposite is also true, a lens with a short focal length has a wide fov, a zoomed out image. I hope that wasn\u0027t incoherent ramblings from my mind and others actually understand it!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is mostly my guesses from the shower knowing the basics.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-03-13T03:03:58Z","Content":"\n\u003Cp\u003E\nits all about wavefront propagation.\n\u003C/p\u003E\n\u003Cp\u003E\ncheck out \u003Ca href=\u0022https://www.youtube.com/@HuygensOptics\u0022 rel=\u0022external nofollow\u0022\u003Ehuygens optics\u003C/a\u003E channel on youtube. lot of really cool info about lenses, telescopes and everything. he even makes monolithic cassegrain scopes out of a single piece of glass.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-13T03:07:47Z\u0022 title=\u002203/13/2024 03:07  AM\u0022 data-short=\u0022Mar 13\u0022\u003EMarch 13\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2024-03-18T21:25:06Z","Content":"\n\u003Cp\u003E\nThread moved to the Science sub since there\u0027s actual sciencing being discussed. \n\u003C/p\u003E\n"},{"CreatedByName":"AckSed","CreatedById":224249,"CreatedDateTime":"2024-03-19T14:41:47Z","Content":"\n\u003Cp\u003E\nA read of xkcd\u0027s What if? on \u003Ca href=\u0022https://what-if.xkcd.com/145/\u0022 rel=\u0022external nofollow\u0022\u003EFire By Moonlight\u003C/a\u003E gives a reasonable explanation of how optics and light-gathering by a lens works in explaining why you can\u0027t set fire to anything with moonlight, no matter how large a lens: for one, you can\u0027t exceed the surface temperature of a heat/light-emitting black body, and the Moon\u0027s is ~100 deg. C; for another:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcept lenses \u003Cem\u003Edon\u0027t\u003C/em\u003E concentrate light down onto a point—not unless the light source is also a point. They concentrate light down onto an \u003Cem\u003Earea\u003C/em\u003E—a tiny image of the Sun [or Moon].\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo the diagrams are simplifying for illustration because you can\u0027t show \u003Cem\u003Eevery\u003C/em\u003E beam of light entering, but also lying in the process. Lenses do gather light from as many directions as possible to project an image. The \u0022point of sharp focus\u0022 is where the smallest image gathered by the main lens is. Focal length is how far behind the point of sharp focus the lens (or group of lenses) projects the now-inverted image. \u003Ca href=\u0022https://capturetheatlas.com/what-is-focal-length/\u0022 rel=\u0022external nofollow\u0022\u003EMore on focal length, field of view\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe double lenses are for reducing \u003Ca href=\u0022https://en.wikipedia.org/wiki/Chromatic_aberration\u0022 rel=\u0022external nofollow\u0022\u003Echromatic aberration\u003C/a\u003E (the rainbow at the edge of images), as different wavelengths of light are refracted differently to a greater or lesser degree by the same material, so (at least in the earliest achromatic doublet lenses) two different types of glass that form a single lens were used, the second type with a different refractive index to bend the light back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2024-03-19T14:49:20Z","Content":"\n\u003Cp\u003E\nStraight lines are used because they are easier to draw and visualize.\n\u003C/p\u003E\n\u003Cp\u003E\nActually the lense will bend all light that hits it.  This is part of why you generally have camera lenses in an opaque black tube: to minimize extraneous light that could interfere or obscure part or all of the image .\n\u003C/p\u003E\n\u003Cp\u003E\nMuch like friction-less inclines, those lines are a simplification to provide a clearer explanation, not a fully accurate reflection of reality.\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2024-03-19T16:22:15Z","Content":"\n\u003Cp\u003E\nThose lines and ideal lenses are oversimplifications (called geometrical optics). They can be used to understand very basic operation of single lense but real life is much more complicated and generally you have to solve Maxwell\u0027s equations with suitable boundary conditions, which are defined by lenses\u0027 geometry and material properties. Most lenses are for dispersion correction. Refractive indices of all real materials are dependent on wavelength which leads to chromatic aberration.   It is managed to acceptable levels by using suitable set of different lenses made from different materials which dispersions cancel each other. Then there are lenses for correcting geometric errors (often aspherical shapes). And all corrections should happen at all focal distances (and lengths in zoom lenses). There are usually 10-20 lenses in several groups in modern camera lens which acts as single \u0022ideal lens\u0022.\n\u003C/p\u003E\n"}]}