{"TopicId":224163,"ForumId":120,"TopicTitle":"Suggestion for Workspace/Vehicle Craft File Organization","CreatedByName":"Presto200","CreatedById":232857,"CreatedDateTime":"2024-03-18T04:27:41Z","PageNum":1,"Articles":[{"CreatedByName":"Presto200","CreatedById":232857,"CreatedDateTime":"2024-03-18T04:27:41Z","Content":"\n\u003Cp\u003E\nA lot of people have been frustrated with the way the game handles craft files, there is a lot of confusion around the differences between workspace save names and vehicle save names. The developers have talked about this and are not satisfied with the way it is coming across to players. \n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I have gathered from interviews and such is that the original idea was that vehicle name is the name you want it to be called, but workspace name is for you to be able to save versions of the same vehicle. So you can have different workspace saves for V1.0, V2.0, V3.0 ect... having a name for each can allow you to recognize what was added each time or what was changed. Anyways it was made to have a separate save for each time you need to improve your design.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is how the craft file saves work currently:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Capture.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002283.07\u0022 height=\u0022800\u0022 width=\u0022963\u0022 src=\u0022https://i.postimg.cc/G3TQr9Lr/Capture.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see if I had many more versions of this ship (I just made this craft to explain this post) the screen gets very cramped and seems wasteful. Also it isn\u0027t shown in the save but I named the vehicle name \u0022My Ship\u0022 for all of these but it just shows the workspace name. Another thing to point out, It puts them all in alphabetical order instead of order they were created, you can see the \u0022design process\u0022 throughout but they are placed randomly in the craft file folder. This could be done so much better.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow I think the idea behind the system is great but the implementation is lacking as stated by a lot of the community. My idea to improve this system is to instead of making a new save space for each implementation, it would be a drop down with the vehicle name as the base name and then the drop down will show each workspace. It would look something like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Capture1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002268.73\u0022 height=\u0022800\u0022 width=\u00221164\u0022 src=\u0022https://i.postimg.cc/GtYYw81p/Capture1.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know how to make something legitimate so please use your imagination.  It would pretty much be something that looks like a single craft file above that would have the vehicle name and image/date/time of the most recent (or selected default version) and then you could click a drop down on it to reveal all the workspace names/ versions of the craft in the drop down you could also set which workspace you want to be your default load. The idea would be if you click the large image vehicle name then it loads your default workspace.\n\u003C/p\u003E\n\u003Cp\u003E\nI think this would be the best way to go about organizing all the craft files while keeping the functionality of getting to save  multiple versions of a craft without changing its vehicle name\n\u003C/p\u003E\n\u003Cp\u003E\nIt should also let you rename your vehicle names and workspace names\n\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2024-03-18T20:58:29Z","Content":"\n\u003Cp\u003E\nI like this and wanted to add that it\u0027d really help clean up all of the autosave workspaces that get saved as separate copies that inevitably get saved over as the original, but not actually the original such that they get retained as permanent duplicate copies.\n\u003C/p\u003E\n"},{"CreatedByName":"Presto200","CreatedById":232857,"CreatedDateTime":"2024-03-18T22:27:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224373667\u0022 data-ipsquote-contentid=\u0022224163\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221710795509\u0022 data-ipsquote-userid=\u002264580\u0022 data-ipsquote-username=\u0022steveman0\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, steveman0 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like this and wanted to add that it\u0027d really help clean up all of the autosave workspaces that get saved as separate copies that inevitably get saved over as the original, but not actually the original such that they get retained as permanent duplicate copies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI completely forgot about autosave when making this post, thats a great point! I think this system is the best way to go about this issue but would be open to any other ideas, pretty much anything is better than saving everything separately\n\u003C/p\u003E\n"},{"CreatedByName":"Presto200","CreatedById":232857,"CreatedDateTime":"2024-03-21T15:12:07Z","Content":"\n\u003Cp\u003E\nI’m hoping others can give opinions or suggestions of other systems\n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-03-21T23:39:03Z","Content":"\n\u003Cp\u003E\nI think was well thought out. \n\u003C/p\u003E\n\u003Cp\u003E\nI use the workspace for \u0027in process\u0027 designs. \n\u003C/p\u003E\n\u003Cp\u003E\nPieces string out all over the place. Sub Assemblies I wanna add. Sometimes you have to pull the much of the rocket apart and your way would allow be to select the appropriate drop down (w/ preview).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe management system is not intuitive.  Vessel names should allow for iterations of the same name but workspace would require unique naming.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally I would like to say this structure is mirrored in the sub folder showing the .json, .meta, .png file for ships with folders by vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\nIf full redesign of system is too much.. your organizational idea could be done with folder / sub folder\n\u003C/p\u003E\n\u003Cp\u003E\nA vehicle parent with separate workspace could replace the current system without an overhaul.\n\u003C/p\u003E\n\u003Cp\u003E\nMenu A -- vehicle Names\n\u003C/p\u003E\n\u003Cp\u003E\nSub Menu (vehicle) -- Workspaces\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCurrently the system is very messy, is there a way to edit a .cfg and turn autosave off?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-21T23:40:24Z\u0022 title=\u002203/21/2024 11:40  PM\u0022 data-short=\u0022Mar 21\u0022\u003EMarch 21\u003C/time\u003E by Fizzlebop Smith\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2024-03-24T06:58:02Z","Content":"\n\u003Cp\u003E\nI think there\u0027s also a problem with having no subassembly tab like in KSP1 - currently, the workspace can basically serve for storing subassemblies, which is quite tedious compared to the ease of use of KSP1 subassembly tab.\u003Cbr\u003E\n(However, KSP1 Subassemblies were saved globally)\n\u003C/p\u003E\n\u003Cp\u003E\nit seems the Workspaces are currently supposed to try to tackle Folders,Versionning and subassemblies all in one.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat i thought about it \u003Cspan\u003E: \u003C/span\u003E\u003Cbr\u003E\nit could be nice to get back to 1 craft Workspace = 1 Ship, (however, custom Subfolders or custom Tagging would be needed for sorting ships), which would be less confusing i think.\n\u003C/p\u003E\n\u003Cp\u003E\nin this version, the current workspace menu would only be there to allow you to manage Versionning and / or subfolder/tagging.\u003Cspan\u003E: \u003C/span\u003E\u003Cbr\u003E\ni would say at least 1 or 2 autosaves (in case of game crash) and 3 manual saves back (so you could revert in case you saved your craft after you deleted something)\u003Cbr\u003E\nThe name of the workspace would be the name of the ship (like in ksp1)\u003Cbr\u003E\nThe workspace could also save the name and / or ID of the currently loaded \u0022world\u0022 (so you could easily hide rockets that have been created in other \u0022worlds\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nThen, return of the subassembly tabs in the assembly building, \u003Cspan\u003EHowever, you could have 2 subassembly tabs instead of 1 \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E:\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cbr\u003E\n- 1 Global subassembly tab (only subject to the whole game save - similar to the one in KSP1), (easy sharing of small parts, like custom \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E clusters between workspaces)\u003Cbr\u003E\n- 1 Per craft save subassembly tab (so you could store for exemple side boosters for a specific rocket, so you could customise the rocket by swapping boosters, like Ariane 4 or Delta IV)\u003Cbr\u003E\nSubfolders for subassemblies tabs could be a plus, but i don\u0027t think it would be that much needed. However, naming the subassemblies could be useful.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen Merging workspaces, you could be allowed to pick what you want to merge \u003Cspan\u003E: \u003C/span\u003E\u003Cbr\u003E\nCraft, per craft subassemblies, or both.\n\u003C/p\u003E\n"}]}