{"TopicId":224131,"ForumId":69,"TopicTitle":"Extreme lag when flying specific ship, not-as-bad lag when flying other ships in the save","CreatedByName":"Lyra","CreatedById":229405,"CreatedDateTime":"2024-03-16T00:49:45Z","PageNum":1,"Articles":[{"CreatedByName":"Lyra","CreatedById":229405,"CreatedDateTime":"2024-03-16T00:49:45Z","Content":"\n\u003Cp\u003E\nI\u0027m currently trying to get a base to the surface of Vall in a science save, along with a rover sent separately at the same window, but every time I load up the base the game\u0027s FPS drops massively, down to slideshow levels. I tried loading the rover, and it\u0027s a bit better (mostly smooth but with frequent frame drops). Everything else seems to be working fine. Both craft in question have under 100 parts as they are now, and I launched a 250\u002B part \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E earlier on a different save and it was nowhere near as laggy.\n\u003C/p\u003E\n\u003Cp\u003E\nIs this a known issue? My friend said it might be a memory leak or something, or it could just be the fact that I\u0027m on an older computer and it\u0027s acting up, but I don\u0027t know if that would affect one \u003Cem\u003Especific\u003C/em\u003E ship only.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Tried messing around with patched conic limit and setting it to 2 fixed it for some reason? My guess is that it was trying to calculate a bunch of future orbits at once, but was stuttering because I had that flickering orbit line bug\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-16T00:59:23Z\u0022 title=\u002203/16/2024 12:59  AM\u0022 data-short=\u0022Mar 16\u0022\u003EMarch 16\u003C/time\u003E by Lyra\u003C/strong\u003E\n\u003Cbr\u003Estatus update: fixed, maybe?\n\u003C/span\u003E\n"}]}