{"TopicId":22428,"ForumId":32,"TopicTitle":"My Kerbal Career: A Let\u0026#039;s Play","CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2012-10-17T21:42:04Z","PageNum":1,"Articles":[{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2012-10-17T21:42:04Z","Content":"\n\u003Cp\u003EI ran out of patience waiting for the career mode to come out, so I\u0027m doing it myself. I will be starting with 50,000 dollars and will take jobs as far as I can manage.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/vi0leiuJGQk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/kFJPNvyQ3HA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/0V6UWiNynPk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/LYUUyQWITZw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Hq9h3w01u3M?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EFor the first one, the contract was self-imposed. However, now I will open the floor to all offers.\u003C/p\u003E\u003Cp\u003EPost a feat you want accomplished (a comsat network, or maybe a personal space station) and how much you bid to get it done, and if it looks profitable, I\u0027ll tackle it.\u003C/p\u003E\u003Cp\u003EEDIT: Okay, that\u0027s a lot of contracts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-19T14:02:21Z\u0022 title=\u002210/19/2012 02:02  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 19, 2012\u003C/time\u003E by dahud\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kizarvexis","CreatedById":31775,"CreatedDateTime":"2012-10-18T01:23:16Z","Content":"\n\u003Cp\u003E(I have no skill at making videos, but I have always thought this would make an awesome trailer for KSP [more on that below].)\u003C/p\u003E\u003Cp\u003EJF Kerman standing in front of a large crowd of fellow Kerbals.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThese are extraordinary times. And we face an extraordinary challenge. Our strength as well as our convictions have imposed upon this nation the role of leader in freedom\u0027s cause. No role in history could be more difficult or more important. We stand for freedom. That is our conviction for ourselves-that is our only commitment to others. No friend, no neutral and no adversary should think otherwise. We are not against any kerbal-or any nation-or any system-except as it is hostile to freedom. Nor am I here to present a new military doctrine, bearing any one name or aimed at any one area. I am here to promote the freedom doctrine.\u003Cp\u003EYet the vows of this Nation can only be fulfilled if we in this Nation are first, and, therefore, we intend to be first. In short, our leadership in science and in industry, our hopes for peace and security, our obligations to ourselves as well as others, all require us to make this effort, to solve these mysteries, to solve them for the good of all kerbals, and to become the world\u0027s leading space-faring nation.\u003C/p\u003E\u003Cp\u003EWe set sail on this new sea because there is new knowledge to be gained, and new rights to be won, and they must be won and used for the progress of all people. For space science, like nuclear science and all technology, has no conscience of its own. Whether it will become a force for good or ill depends on kerbals, and only if this Nation occupies a position of pre-eminence can we help decide whether this new ocean will be a sea of peace or a new terrifying theater of war. I do not say the we should or will go unprotected against the hostile misuse of space any more than we go unprotected against the hostile use of land or sea, but I do say that space can be explored and mastered without feeding the fires of war, without repeating the mistakes that kerbals have made in extending their writ around this globe of ours.\u003C/p\u003E\u003Cp\u003EI believe that this nation should commit itself to achieving the goal, before this year is out, of landing a kerbal on the Mun and returning him safely to Kerbin. I have approved a budget from the Kerbal Aeronautics and Space Administration of 2.5M kerbucks for a series of missions in the hopes of eventually having a total of six Mun landings and returns to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E{I always thought it would be great to have all the crowd to start cheering wildly right after \u0027landing a kerbal on the Mun\u0027 and finally lower enough to hear JF Kerman say \u0027..ly to Kerbin.\u0027 at the end. Then have a compilation of fantastic failures set to appropriate music. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E } \u003C/p\u003E\u003Cp\u003EDetails:\u003C/p\u003E\u003Cp\u003EThe year is in game from the first mission.\u003C/p\u003E\u003Cp\u003EMunar landings are with a 3m capsule with eva.\u003C/p\u003E\u003Cp\u003EA minimum acceptable ramp up for a munar landing is the following.\u003C/p\u003E\u003Cp\u003E- Kerbal rated LKO flight (1m or 3m capsule)\u003C/p\u003E\u003Cp\u003E- Kerbal LKO eva (1m or 3m capsule, can be same as above)\u003C/p\u003E\u003Cp\u003E- Kerbal rated LKO flight in munar return craft\u003C/p\u003E\u003Cp\u003E- Kerbal rated LKO flight in final munar lander (ML {yes you can still call it the MEL, even though \u0027expedition\u0027 has been removed from the name}) testing all the lander systems\u003C/p\u003E\u003Cp\u003E- Orbit the Mun and return (minimum in munar return craft, but prefer ML)\u003C/p\u003E\u003Cp\u003E- Bring ML into close pass over Mun surface\u003C/p\u003E\u003Cp\u003E- Munar landings with return\u003C/p\u003E\u003Cp\u003EYou can do as many of each flight as needed and as many automated flights as needed to get a successful flight to count as kerbal rated.\u003C/p\u003E\u003Cp\u003EFunding schedule.\u003C/p\u003E\u003Cp\u003E$700k kerbucks up front.\u003C/p\u003E\u003Cp\u003E$300k kerbucks after each successful Mun landing and return\u003C/p\u003E\u003Cp\u003Ep.s. I shamelessly copied and pasted from JFK speeches in front of Congress and at Rice University with some word changes to make them Kerbal. I love the paragraphs above and thought that they would set the stage for the land a kerbal on the Mun and return him safely to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-18T02:06:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EKerbal rated LKO flight (1m or 3m capsule)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo if you becareful and test out your spacecraft by first sending a chimp called \u0022Kam\u0022 into orbit and as a result get beaten by the Kommunist for first Kerbal in space their premier will fly over, tour the country for a bit, visit a meat packing factory, eat some hotdogs and then proclaim \u0022We\u0027ve beaten you to space! But you\u0027ve beaten us in sausage making\u0022?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-18T02:09:04Z\u0022 title=\u002210/18/2012 02:09  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 18, 2012\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-18T02:14:19Z","Content":"\n\u003Cp\u003ERe-unite the Kerbal Henge with a network!\u003C/p\u003E\u003Cp\u003EThe mission: Land a device (similar to that of your comsat network) at each Monolith. Payment will be on a per Monolith basis.\u003C/p\u003E\u003Cp\u003E10,000 Kerbucks for the Kerbalith (you should know why by now).\u003C/p\u003E\u003Cp\u003E80,000 Kerbucks for each Munolith (there should be 3).\u003C/p\u003E\u003Cp\u003EI understand the final Monolith is... essentially impossible to find, and as such is not considered part of the mission. If you find and connect the final, you will be awarded 200,000 Kerbucks!\u003C/p\u003E\u003Cp\u003EFor the sake of making this a challenge (even though you have satmapper), I will not direct you to any of the Monoliths.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2012-10-18T02:43:17Z","Content":"\n\u003Cp\u003EKizarvexis: I just gave myself 100K for an Eve flyby, so your numbers are a bit generous. Halve them and you\u0027ve got a deal. Anyone here do a good JFK impression?\u003C/p\u003E\u003Cp\u003ETheHengeProphet: I just noticed your name while typing it. You\u0027re up to no good, but I\u0027ll tackle them after the Munshot. Maybe during.\u003C/p\u003E\n"},{"CreatedByName":"Tilion","CreatedById":37391,"CreatedDateTime":"2012-10-18T05:54:40Z","Content":"\n\u003Cp\u003EHi!\u003C/p\u003E\u003Cp\u003ELove your vids and your particular \u0027can\u0027t-wait\u0027 impementation of career mode...\u003C/p\u003E\u003Cp\u003EI\u0027ve not got the PC to do videos myself, and I\u0027m not too bothered about challenging myself with financial limitations; that said, I don\u0027t mind watching others who do, or offering up some mission suggestions.\u003C/p\u003E\u003Cp\u003EI\u0027ve just gone through my Vanguard Program yesterday, 20 flights or so that were my own take on Project Mercury and I found the rapid-cycle and development of a couple of common launch vehicles (and following the rough historic details too) to be very entertaining. That\u0027s just one program within my massive \u0027Mission List\u0027 to be done for 0.17. I\u0027ll include a small portion of the list below and give you a few prices for some of the more interesting (or at least, useful) ones:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c2Qwe.png\u0022 alt=\u0022c2Qwe.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d recommend the following:\u003C/p\u003E\u003Cp\u003EKeoSat Keopositioning Services\u003C/p\u003E\u003Cp\u003EOffers 125k Kerbucks to develop a multiple-satellite launcher vehicle and deploy 4 Keosynchronous KPS Sats (40k bonus for equal separation of satellites).\u003C/p\u003E\u003Cp\u003EKerbin Meteorological Office\u003C/p\u003E\u003Cp\u003EOffers 30k Kerbucks to launch the their Kerbin Ice Cap Examiner ICE satellite into a northern Tundra orbit. They will provide the ICE Sat.\u003C/p\u003E\u003Cp\u003EAstrophysical Academy of Kerbin\u003C/p\u003E\u003Cp\u003EOffers 400k Kerbucks for the development \u0026amp; delivery of \u0027Herald\u0027 Space Weather Observation \u0026amp; Warning Satellites to 0.9KAU and 1.1KAU orbits, (just in front of and behind Kerbin\u0027s orbit, sun facing).\u003C/p\u003E\u003Cp\u003EStanding Offer from Keep Kerbin Kleen Kampaign: \u003C/p\u003E\u003Cp\u003E5k regardless of mission for each spent stage to be de-orbited, impacted or sent into Kerbol / out of the system.\u003C/p\u003E\u003Cp\u003EIf those don\u0027t suit, by way of recommendation, the Kethane mod opens up a whole realm of new mission profiles \u0026amp; possible fun-to-be-had! My own Kethane missions (bar the first) are off-the-page on this partial list...\u003C/p\u003E\u003Cp\u003EWell, hope they help, or the list gives you an idea or two - I\u0027ll be watching!\u003C/p\u003E\n"},{"CreatedByName":"Kizarvexis","CreatedById":31775,"CreatedDateTime":"2012-10-18T09:12:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EKizarvexis: I just gave myself 100K for an Eve flyby, so your numbers are a bit generous. Halve them and you\u0027ve got a deal. Anyone here do a good JFK impression?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, but the ramp up flights have a minimum of 10 flights, with the automated flights for kerbal rating, before you get to a Mun landing if everything goes perfectly. So the revised funding schedule would be as follows; 350K up front and 150K per landing. Just in case you go over budget before the first Mun landing, you can take another 50k up front, by lowering the per landing funding by 10k. Would that work?\u003C/p\u003E\u003Cp\u003EBy the way, I don\u0027t expect you to read the speech if you don\u0027t want to, I just thought it would set the tone for my project. I also thought just doing the \u0027land a kerbal on the Mun\u0027 part with the cheering washing out the \u0027and return him safely to Kerbin\u0027 along with a montage of spectacular crashes would make a hilarious video. You\u0027re on a budget, my budget, so no crashes please. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-18T09:46:24Z","Content":"\n\u003Cp\u003ECareer mode gives some interesting spin on the game. I for one think Rockmax Mainsail is a shockingly bad engine. However one mainsail cost the same as most 1m engines despite giving 6 times the thrust. Thus it becomes economical to build inefficent \u0022big dumb boosters\u0022 that use more fuel to lift the same payload to orbit as smaller, more efficient, more cleverly engineered asparagus staging rockets with lots of aerospikes.\u003C/p\u003E\u003Cp\u003EThat\u0027s quite a cool aspect because it mimics the real life difference in design between NASA rockets vs Russian rockets. NASA tried to develop a launch vehicle that could deliver payload to LEO by using cutting edge technology and try to build an orbiter that is reusable and they end up with a vehicle that cost astronomical amount of money per kg to orbit and is quite fragile. Where as Russians design throw away rockets that are so robust they can be put together on the ground horizontally then lifted to vertical at launch and end up with much lower per kg to LEO cost despite not reusing any hardware.\u003C/p\u003E\u003Cp\u003EOne other thing I like to add after watching the first video: space junk. If I was paying for KSP to put up my satellite I would not be happy if they ditched a 2nd stage rocket engine right next to my satellite. After a few dozen orbit they might bump and that before you know that\u0027s 2 pieces of space junk we have in LKO. So I propose the following space junk rules:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHazardous orbital insertion penalty: -10,000 Kerbucks for releasing a payload within 2km of launch vehicle debris sharing the same orbit\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESpace littering fee: -5,000 Kerbucks for each piece of debris left in non-decaying orbit by launch vehicle\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOne up, one down bonus: \u002B4,000 Kerbucks for each piece of debris de-orbited, debris may include defunct satellites\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-18T10:22:47Z\u0022 title=\u002210/18/2012 10:22  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 18, 2012\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2012-10-18T17:19:38Z","Content":"\n\u003Cp\u003EYes, dahud, I am definitely up to no good!\u003C/p\u003E\u003Cp\u003EFortunately, my mission does not care how much space junk you throw up there. Pollute the skies for all I care! All that matters to me is that nothing kerman-made crashes into the relay stations, which are landbased, so that is a low probability.\u003C/p\u003E\n"}]}