{"TopicId":224225,"ForumId":46,"TopicTitle":"AI and Mission Reports","CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-03-23T00:58:14Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-03-23T00:58:14Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003ENote to mods: I thought this belonged here since it specifically talked about a subforum, but if you think it belongs in the lounge please put it there.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow, I already believe that AI shouldn\u0027t be used to replace human creativity. And with mission reports, the fun of every single one is the different voices and creative worlds people make. The game is played from their perspective, they should tell the story the way they saw it. AI cannot capture the way a person writes or experiences something, it just spits out facts with no emotion or flavor to the writing. It\u0027s boring, it\u0027s tiring to read, and it\u0027s just not engaging. The more and more people use AI to write mission reports for them, the less and less enticing they are to read. And the stories that the AI spits out is always the same. It\u0027s always a scrappy agency that will bring Kerbalkind to the stars, yada yada we\u0027ve heard it before. This hasn\u0027t become that big of an issue yet, but it could quickly become one in the future. Mission reports that all sound the same will pollute the forums, and it\u0027d be hard for anybody with an actual voice to be heard.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerb24","CreatedById":214340,"CreatedDateTime":"2024-06-20T19:08:58Z","Content":"\n\u003Cp\u003E\nI\u0027ve been planning my own mission report video series, and I already am committed to not use AI for script writing. However, I feel AI image/video generation has potential for actually improving mission reports. For reference see \u003Ca href=\u0022https://www.youtube.com/@Epentibi/videos\u0022 rel=\u0022external nofollow\u0022\u003Ethis channel\u003C/a\u003E (Might be too in-depth into the politics for the forums), which uses AI to generate realistic Alt-historical newscasts. Being able to quickly get realistic media for anything could improve the immersion of mission reports whilst not significantly increasing time cost.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-06-20T19:17:06Z\u0022 title=\u002206/20/2024 07:17  PM\u0022 data-short=\u0022Jun 20\u0022\u003EJune 20\u003C/time\u003E by Kerb24\u003C/strong\u003E\n\u003C/span\u003E\n"}]}