{"TopicId":224306,"ForumId":20,"TopicTitle":"More spawning points inside the same KSC?","CreatedByName":"SmugglingParts","CreatedById":226584,"CreatedDateTime":"2024-03-30T22:29:54Z","PageNum":1,"Articles":[{"CreatedByName":"SmugglingParts","CreatedById":226584,"CreatedDateTime":"2024-03-30T22:29:54Z","Content":"\n\u003Cp\u003E\nMorning kerbs \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Ei was looking for a solution that makes me access more spawning points inside the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E: \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Ei mean, no more launchsites, just more spawn points!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ECombined with Kerbal Konstructs, lets say i would love to spawn planes in the small hangar, parked on a side, trucks in a parking lot, etc... \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Ei just find boring to spawn wheeled vehicles on the runway or the launchpad, as well as other silly kerbalistic things i build for fun. I would love to have more options than just the classic two!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Eany ideas? What mod or combination of customized \u003C/span\u003E\u003Cspan\u003E.cfg editing black magic i can use?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003Ethanks!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-03-30T23:31:43Z","Content":"\n\u003Cp\u003E\nThe only thing i can immediately think of.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou can use the debug menu to \u0022spawn\u0022 something wherever you would like.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUse the Waypoint manager to create a waypoint in the spot you would like \u0026amp; use the chords.\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2024-03-31T16:59:51Z","Content":"\n\u003Cp\u003E\nI think you already answered your own question. Kerbal Konstructs is AFAIK the cleanest way to do it. Use KK to create new spawn points, then you can launch from \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E directly to those new spawn points. This is standard KK functionality that can all be done in-game without any cfg editing.\n\u003C/p\u003E\n\u003Cp\u003E\nHyperEdit. Spawn to the runway then re-land your vessel anywhere nearby. You can use the IJKL keys to shift your landing location.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a mod called Vessel Mover but I don\u0027t know whether that can do what you want.\n\u003C/p\u003E\n"},{"CreatedByName":"SmugglingParts","CreatedById":226584,"CreatedDateTime":"2024-04-01T08:44:13Z","Content":"\n\u003Cp\u003E\nHi DeadJohn, thank you for the reply! Indeed, i want to dig deeper into KK to achieve this little goal.\n\u003C/p\u003E\n\u003Cp\u003E\nI have installed Vessel Mover that is pretty useful to move precisely in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E,\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s say i want to create a spawn point just near the Administration Building, in order to spawn my grounded vehicles there; once reached the desired coordinates with Vessel Mover, how can i create the spawn point? I see that i can open the editor with Ctrl-K but then i\u0027m unable to find the set-spawn functionality, i only see a list of buildings.\n\u003C/p\u003E\n\u003Cp\u003E\nJust notice; im not looking to create new buildings or rocket pads, instead, i just would like to create new spawn location that are accessable from \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E menu, such as \u0027Hangar #1\u0027 or \u0027Vehicles Parking Lot\u0027 etc.. in the default \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the support!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}