{"TopicId":22459,"ForumId":15,"TopicTitle":"how is this looking?","CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T05:37:05Z","PageNum":1,"Articles":[{"CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T05:37:05Z","Content":"\n\u003Cp\u003EIve been playing with modding for about 2 weeks now, I started with cylinders that i called fuel tanks, and cubes that i called engines, then jumped into actual modeling, even tho its not the first time I use blender, I never did anything by myself, i just followed tutorials to learn the program, then i just quit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E , i still remember some stuff of those tutorials and manage to move around blender pretty ok, even tho i probably work in a relay inefficient way.\u003C/p\u003E\u003Cp\u003Eso after doing a couple of parts that looked decent, and capsules with working interiors I just was not satisfied with what i was doing, My parts felt somewhat random, and had no real direction; so I started from scratch, trying to plan something that would be functional and looks cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003Cp\u003Eso I got a very vague idea of what I what to do , but I know I want a bit of sci-fi , so I started to play with blender, just to try to figure something out on the run. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/KEuPp.png\u0022 alt=\u0022KEuPp.png\u0022\u003E\u003C/blockquote\u003E\u003Cblockquote\u003E \u003C/blockquote\u003E\u003Cp\u003Eits took a long time just to get to this point, and i still feel it needs to be polished but i wanted to see what you guys think XD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-18T05:49:10Z\u0022 title=\u002210/18/2012 05:49  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 18, 2012\u003C/time\u003E by Martonaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Punk","CreatedById":45205,"CreatedDateTime":"2012-10-18T06:54:35Z","Content":"\n\u003Cp\u003ELooks good, is it a pod?\u003C/p\u003E\n"},{"CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T07:07:48Z","Content":"\n\u003Cp\u003Ety \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E , yes its a pod, or maybe a pod and living modules, im not sure yet Xd\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-10-18T07:55:04Z","Content":"\n\u003Cp\u003Ebeen playing the new X-Com, looks like something those aliens might dream up.\u003C/p\u003E\u003Cp\u003ELooks like it would be a cool Habitat or crew module for interplanetary or longer in-system missions - with that bit towards the front and some sort of long strut leading back to some sort of nuclear engines.\u003C/p\u003E\n"},{"CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T10:51:36Z","Content":"\n\u003Cp\u003Eyes this is going nuclear all the way , still not sure how thou \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOFF topic-\u003C/p\u003E\u003Cp\u003Eis xcom anywere as good as civilization?\u003C/p\u003E\n"},{"CreatedByName":"dt890","CreatedById":8704,"CreatedDateTime":"2012-10-18T11:18:58Z","Content":"\n\u003Cp\u003Ei have some constructive critism (if its ok). i noticed you used smooth shading to hide the raw geometry of the craft. but it makes smaller details hard to see. the best way to do this without loosing detail is to use the modifier called edge split in blender. what it will do is to mark edges of certain degrees as \u0022sharp\u0022 and you can modify the values to what fits best to your model. By doing this will remove the black artifacts that occur when the normal\u0027s are in flipped in the wrong direction.\u003C/p\u003E\n"},{"CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T11:26:08Z","Content":"\n\u003Cp\u003Etyvm for the feedback!, im still a noob with blender, so I used the smooth shading cuz it looks more like it does when imported into KSP, and i was really wondering how to get rid of that black thingys, next session ill try your tip \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-10-18T17:26:31Z","Content":"\n\u003Cp\u003EX-com really isn\u0027t anything like civilization, its a tactical strategy game instead of an empire builder. You command a squad of 4 to 6 soldiers through various encounters with (extremely) hostile aliens, and you earn upgrades and research projects for better weapons, gear, and technology, as well as gaining new ranks(levels) with your squad.\u003C/p\u003E\u003Cp\u003EThe only real \u0022global\u0022 factor of the game is launching satellites over each continent so you can intercept any UFOs that threaten them, and if you do not protect a region for too long, they\u0027ll withdraw support for your squad, which means less resources.\u003C/p\u003E\u003Cp\u003EIts super fun!\u003C/p\u003E\n"},{"CreatedByName":"orson","CreatedById":31453,"CreatedDateTime":"2012-10-18T18:26:12Z","Content":"\n\u003Cp\u003EI like the design , is it going to be small like a fighter or bigger ?\u003C/p\u003E\n"},{"CreatedByName":"Martonaut","CreatedById":26366,"CreatedDateTime":"2012-10-18T21:14:15Z","Content":"\n\u003Cp\u003EI think it will be bigger, i was playing with the scale a bit , and if its big and I use it ALL as a command pod, well i could fit like 21 or more kerbals there jaja, maybe that\u0027s a bit 2 big \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E, Ill work on the body a bit and make a proper \u0022WIP\u0022 thread, since im having a lot of fun and i think i will finish this XD.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/omiV2.png\u0022 alt=\u0022omiV2.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E@dt890 I did not understand the Edge split modifier, i don\u0027t see the changes when I change the angle, i may be doing something wrong XD\u003C/p\u003E\u003Cp\u003E@Tiberion, its a shame my computer wont handle that game :\u0027(\u003C/p\u003E\n"},{"CreatedByName":"Rareden","CreatedById":57466,"CreatedDateTime":"2013-04-20T04:02:02Z","Content":"\n\u003Cp\u003Ei would suggest having seperate smoothing groups for the windows and any sharp corners, of around 70deg or more, also what program are you using to model this\u003C/p\u003E\n"},{"CreatedByName":"Xellith","CreatedById":35053,"CreatedDateTime":"2013-04-21T16:09:27Z","Content":"\n\u003Cp\u003ELooks like he is using Blender.\u003C/p\u003E\n"}]}