{"TopicId":22451,"ForumId":32,"TopicTitle":"Insane Collision Velocities","CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2012-10-18T03:24:17Z","PageNum":1,"Articles":[{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2012-10-18T03:24:17Z","Content":"\n\u003Cp\u003ESo, I\u0027m testing my VTOL plane, and it crashes. you know how when you crash a plane into the ocean, the wings sort of glide away for a bit? well, one of the control surfaces did that, but it was on steroids:\u003C/p\u003E\u003Cp\u003E[ATTACH=CONFIG]34962[/ATTACH]\u003C/p\u003E\u003Cp\u003E[ATTACH=CONFIG]34963[/ATTACH]\u003C/p\u003E\u003Cp\u003EPlease note that no mods were used.\u003C/p\u003E\u003Cp\u003E*EDIT: For some reason it decided to upload them in extremely low resolution. in the top picture, the control surface is traveling at over 2000 m/s. also, my plane was traveling no faster than 150 m/s on impact, so something freaky is going on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-18T03:27:06Z\u0022 title=\u002210/18/2012 03:27  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 18, 2012\u003C/time\u003E by spikeyhat09\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"royalkingofgames","CreatedById":23658,"CreatedDateTime":"2012-10-18T07:04:46Z","Content":"\n\u003Cp\u003Einfiniglide mabye\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2012-10-18T07:14:19Z","Content":"\n\u003Cp\u003EI have had this happen during crashes before. One winglet actually made it into orbit. It was hilarious.\u003C/p\u003E\u003Cp\u003E(to be fair though, the periapsis was about 10Km)\u003C/p\u003E\n"},{"CreatedByName":"Punk","CreatedById":45205,"CreatedDateTime":"2012-10-18T07:17:33Z","Content":"\n\u003Cp\u003EApparently sometimes when an object gets where its not supposed to because the computer forgets it for second and then picks the physics back up when it is halfway through a wall, the engine freaks out and gives it an unrealistic velocity. This was explained to me in relation to the giants in skyrim putting people in orbit. This might be why your wing is hypersonic.\u003C/p\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-10-18T07:30:05Z","Content":"\n\u003Cp\u003EI\u0027ve gotten a standard canard up to 260km before. Didn\u0027t quite reach orbital velocity, only made it to like 2100m/s. Drag model is horrible, but there\u0027s a mod for it.\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2012-10-18T07:30:12Z","Content":"\n\u003Cp\u003EThis is the infinite-glide glitch in action. I\u0027ve previously tested it and sent a canard nearly 400 kilometers up (this took quite a bit of work, mind). I suspect it has something to do with the way they seem to \u0027twitch\u0027 after they\u0027ve detached from a crashed aircraft. The canard starts off slow, then accelerates quickly up to about 2km/second (sometimes higher), then stays at that speed until it doesn\u0027t have any air for the glitch to push against.\u003C/p\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-10-18T07:36:15Z","Content":"\n\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/20451-0-17-Ferram-Aerospace-Research-v0-4-2-1-Aerodynamics-Fixes-For-Planes-Rockets\u0022 rel=\u0022external nofollow\u0022\u003EInfiniglide is dead, baby.\u003C/a\u003E\n"}]}