{"TopicId":224530,"ForumId":51,"TopicTitle":"Max-Q: A KSP Mission Report","CreatedByName":"TheKrakenHerder","CreatedById":211017,"CreatedDateTime":"2024-04-21T12:23:36Z","PageNum":1,"Articles":[{"CreatedByName":"TheKrakenHerder","CreatedById":211017,"CreatedDateTime":"2024-04-21T12:23:36Z","Content":"\n\u003Cp\u003E\nHello friends.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a good few failed attempts (due to my own lack of motivation) and a \u003Cem\u003Elot\u003C/em\u003E of messing around with mods, I think I\u0027m finally ready to make a long-form mission report about my current KSP save. I hope y\u0027all will have as much fun as I\u0027m having playing it.\n\u003C/p\u003E\n\u003Cp\u003E\nA few rules, first off:\u003Cbr\u003E\n-I\u0027m doing this in sandbox, because the idea is to actually have fun\n\u003C/p\u003E\n\u003Cp\u003E\n-I only really just had the idea to make this a mission report (in game I\u0027m up to the first crewed Munar landings) and so I do not have screenshots of every mission. Once we catch up to where I actually am ingame there\u0027ll be a lot more pictures\n\u003C/p\u003E\n\u003Cp\u003E\n-I\u0027m trying to do this in a pretty realistic fashion, e.g. builds must look realistic, gaps between missions, habitation space, ground testing, the works. That being said, I didn\u0027t want to use anything like part failure mods or KCT because my install is already bloated as is\n\u003C/p\u003E\n\u003Cp\u003E\nWithout further ado, please enjoy:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Space-Collage-Thingie.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u00221002\u0022 width=\u00221002\u0022 src=\u0022https://i.ibb.co/Y0WQv1k/Space-Collage-Thingie.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-04-23T13:38:41Z\u0022 title=\u002204/23/2024 01:38  PM\u0022 data-short=\u0022Apr 23\u0022\u003EApril 23\u003C/time\u003E by TheKrakenHerder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheKrakenHerder","CreatedById":211017,"CreatedDateTime":"2024-04-23T13:22:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003EChapter 1, Part 1: Project Polaris\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Writing this while rewatching The Martian to get me in the mood)\n\u003C/p\u003E\n\u003Cp\u003E\nWell, we have to start somewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nI kicked off this save with the start of the Kerbal Aeronautics and Space Administration (how original) and the launch of Valiant 1, the first satellite. No pictures, unsurprisingly, but it was basically Explorer I. Just a stick with a thermometer and some antennae. A little while later I launched Valiant 2 and 3 to higher orbits, this time with a BAROMETER!\n\u003C/p\u003E\n\u003Cp\u003E\nNext began the Polaris program, basically Mercury, with Polaris 1, 2, and 3. Jeb, Bill and Stedzon Kerman. made short suborbital hops on top of Minerva ballistic missiles and became the first kerbals in space. Again, no pictures due to \u003Cs\u003Emy own lack of foresight\u003C/s\u003E the launchpad cameras being destroyed (sorry \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E there will be more pictures in the future). \n\u003C/p\u003E\n\u003Cp\u003E\nPolaris 1, 2, and 3 were a complete success (despite a brief scare with the retropack on numero dos), and so I decided to scrap the planned fourth suborbital flight and instead move straight to orbital missions, starting with Val going up on Polaris 4. This I DO have pictures of, albeit only two*.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot-2023-09-04-at-18-01-12.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022150.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/tQf4VYz/Screenshot-2023-09-04-at-18-01-12.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EVal\u0027s Polaris-Hermes rocket ascending. I was quite proud of this rocket, especially the Atlas-style skirt.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nVal made it through the \u003Cs\u003Elethal\u003C/s\u003E mildly turbulent ascent on her \u003Cs\u003Edeath chariot\u003C/s\u003E Hermes rocket, transmitted her thoughts on the nature of the cosmos (which were promptly inserted into a burn bag), took a few temperature and pressure readings, then fired her retropack after five orbits and came home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot-2023-09-03-at-18-38-56.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022150.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.ibb.co/tmLjJDc/Screenshot-2023-09-03-at-18-38-56.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBathtime for Val Kerman\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(that is in fact all the pictures I have from the Polaris program)\n\u003C/p\u003E\n\u003Cp\u003E\nAfter another complete success, I decided to try squeeze a little more performance out of the Hermes in the hopes of getting data from higher orbits. Just small relatively unseen stuff, like outboard fuel tanks surrounding the turbopump, lightening the retropack, y\u0027know. And apparently, I tried my hand at messing with the staging. This had predictable results on Polaris 4, and resulted in Bob getting the 15G ride of his life on the \u003Cabbr title=\u0022Launch Escape System\u0022\u003E\u003Cabbr title=\u0022Launch Escape System\u0022\u003ELES\u003C/abbr\u003E\u003C/abbr\u003E tower after a very short mission before landing a few hundred yards from the beach. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d imagine he wasn\u0027t too happy with this. Sorry Bob. Back to the drawing board. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter fixing the staging, Polaris 5 went up with Agary. The non-staging-related improvements juiced the Hermes booster enough to get an apoapsis of over 300 kilometers. She tested out an early SCANsat scanner before coming back again. \n\u003C/p\u003E\n\u003Cp\u003E\nAt this stage, however, I was getting a little bored, and there wasn\u0027t much else I could do with Polaris. So, I decided that Polaris 6 with Bob again (yay compensation) would be the last mission in the program. Bob lifted off from the Tundra Missile Range on a Hermes. Once he was in orbit, he burned the upgraded Hermes core stage again to increase the apoapsis to higher than ever before. He got some high-above-Kerbin science before coming back down again.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd so ended the Polaris program. Coming up next: Probing the Mun and the Antares capsule!\n\u003C/p\u003E\n\u003Cp\u003E\n*Keen eyed readers will notice that these screenshots have been seen before in the What Did You Do in KSP Today thread.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-04-23T13:38:25Z\u0022 title=\u002204/23/2024 01:38  PM\u0022 data-short=\u0022Apr 23\u0022\u003EApril 23\u003C/time\u003E by TheKrakenHerder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheKrakenHerder","CreatedById":211017,"CreatedDateTime":"2024-06-21T12:59:43Z","Content":"\n\u003Cp\u003E\n(There is more coming I swear)\n\u003C/p\u003E\n"}]}