{"TopicId":22460,"ForumId":16,"TopicTitle":"A couple questions for a ksp noob","CreatedByName":"rikustrength","CreatedById":56813,"CreatedDateTime":"2012-10-18T06:54:40Z","PageNum":1,"Articles":[{"CreatedByName":"rikustrength","CreatedById":56813,"CreatedDateTime":"2012-10-18T06:54:40Z","Content":"\n\u003Cp\u003EHallo guys, I just got ksp about a week ago, and I\u0027ve been having loads of fun with my systematic genocide of the Kerbal population via expulsion into space. Strangely, there seems to be a sense of satisfaction in NOT killing them sometimes, and actually getting them to their destinations. That being said, it seems a lot of the tips and tricks involve using mod parts. I see how to install them and I see the list, but it\u0027s kind of... Daunting... Can anyone reccomend some good basic mods that will help with routine things? I don\u0027t need to build space stations (although that looks cool) or anything overly fancy, just looking to buff out my parts from whats stock and perhaps try my hand at building a rover. If anyone has any suggestions for most useful or commonly used mods I would be very grateful, and I\u0027de also appreciate any other tips of suggestions that might make my experience easier or more enjoyable. Thanks guys!\u003C/p\u003E\n"},{"CreatedByName":"Max Schram","CreatedById":37149,"CreatedDateTime":"2012-10-18T09:22:02Z","Content":"\n\u003Cp\u003EMech Jeb is a \u0027must have\u0027 for me:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/12384-PLUGIN-PART-0-17-Anatid-Robotics-MuMech-MechJeb-Autopilot-v1-9-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/12384-PLUGIN-PART-0-17-Anatid-Robotics-MuMech-MechJeb-Autopilot-v1-9-3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd Protractor for getting to other planets/moons:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/21544-17-Protractor-Rendez-Plugin-v-2-3-3-10-14-12\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/21544-17-Protractor-Rendez-Plugin-v-2-3-3-10-14-12\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Kethan pack is fun to use:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/23979-Kethane-Pack-0-2-Find-it-mine-it-burn-it!-Now-with-smarter-cartographers\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/23979-Kethane-Pack-0-2-Find-it-mine-it-burn-it!-Now-with-smarter-cartographers\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI also like to use the NovaPunch Remix Pack. But it adds alot of parts to the VAB, which can be quite confusing if you just started.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/3870-0-16-NovaPunch-Remix-Pack-1-3-Beta-%28Sept-7th%29-Compatible-with-0-17\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/3870-0-16-NovaPunch-Remix-Pack-1-3-Beta-%28Sept-7th%29-Compatible-with-0-17\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"EpsilonSigma","CreatedById":39610,"CreatedDateTime":"2012-10-18T09:52:13Z","Content":"\n\u003Cp\u003EIf you want to eventually learn how to get things to where you want them manually, then the best start would probably be MechJeb whilst continuing to use stock parts (default, non-modded parts). The autopilot shows you the stages you need to go through to do everything in the game, and then once you feel up to it you can attempt to replicate the actions yourself. That won\u0027t make the experience more enjoyable until you learn manual control, but it\u0027ll make it easier to explore the solar system and you still have to build the ships to begin with.\u003C/p\u003E\u003Cp\u003EIf you want to use mods, that\u0027s depends on what you want to do, and a quick browse of the mods/plugins section and reading the descriptions of the mods/plugins will pretty much tell you which one you want. It\u0027s probably also a good idea to check out the rest of this \u0022How to\u0022 section, the beginners section and even some of the creations by other people to see what kind of rockets you need (some require mods of course).\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-18T12:33:40Z","Content":"\n\u003Cp\u003EFor help building stuff Kerbal Engineer Redux takes out a lot of the guesswork from rockets.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2012-10-18T18:33:07Z","Content":"\n\u003Cp\u003EI have to agree with the Kerbal Engineer Redux, the delta V readout helps a lot. A good rule of thumb is you want to aim for around 4000 m/s delta V to get into orbit, and a launch thrust to weight ratio of two and a bit.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-10-18T18:37:27Z","Content":"\n\u003Cp\u003EI dont suggest Novapunch, as the memory leak bug can cause you to crash with lots o parts.\u003C/p\u003E\u003Cp\u003EI reccomend Mechjeb for BEGGINERS, but I find you can let it go after you know what to do.\u003C/p\u003E\u003Cp\u003EProtractor mod is good.\u003C/p\u003E\n"}]}