{"TopicId":22533,"ForumId":32,"TopicTitle":"How do you make a plane?","CreatedByName":"CkGordon","CreatedById":51332,"CreatedDateTime":"2012-10-19T11:23:14Z","PageNum":1,"Articles":[{"CreatedByName":"CkGordon","CreatedById":51332,"CreatedDateTime":"2012-10-19T11:23:14Z","Content":"\n\u003Cp\u003EMy space program is going fantastic but I thought a nice change of pace would be to dabble in the aerospace part of the game so I set about building a nice test plane and flying it and it can... fly... sorta... it just handles really really hard... \u003C/p\u003E\u003Cp\u003ECan someone who is a more experienced kerbal aircraft builder take a look at my plane and tell me what the problem is? Or if that\u0027s just how the physics engine handles flight? It seems really hard to make soft turns without ending up upside down. Are A,S,D,F, Q,E the right controls? Am I missing something? \u003C/p\u003E\u003Cp\u003E[ATTACH=CONFIG]34997[/ATTACH][ATTACH=CONFIG]34998[/ATTACH][ATTACH=CONFIG]34999[/ATTACH]\u003C/p\u003E\n"},{"CreatedByName":"Quasar","CreatedById":10730,"CreatedDateTime":"2012-10-19T11:45:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CkGordon\u0022 data-cite=\u0022CkGordon\u0022\u003E\u003Cdiv\u003EMy space program is going fantastic but I thought a nice change of pace would be to dabble in the aerospace part of the game so I set about building a nice test plane and flying it and it can... fly... sorta... it just handles really really hard... \u003Cp\u003ECan someone who is a more experienced kerbal aircraft builder take a look at my plane and tell me what the problem is? Or if that\u0027s just how the physics engine handles flight? It seems really hard to make soft turns without ending up upside down. Are A,S,D,F, Q,E the right controls? Am I missing something? \u003C/p\u003E\u003Cp\u003E[ATTACH=CONFIG]34997[/ATTACH][ATTACH=CONFIG]34998[/ATTACH][ATTACH=CONFIG]34999[/ATTACH]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHandling Sensitivity is dependant entirely on how you build your plane. The reason the plane you\u0027ve got there is twitchy comes down to several causes: \u003C/p\u003E\u003Cp\u003E- large control surfaces far from the centre of roll (For a plane that size, more than a single pair of control surfaces is overkill), \u003C/p\u003E\u003Cp\u003E- the lightweight nature of the plane (big, heavy planes will naturally turn slower), and...\u003C/p\u003E\u003Cp\u003E- too much thrust. The engines you\u0027re using reorient themselves to help you steer. For a plane that size, you only really need one engine, two if you\u0027re feeling like something faster.\u003C/p\u003E\u003Cp\u003EIt\u0027s a fine first attempt though. A lot better than my early attempts.\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2012-10-19T12:45:04Z","Content":"\n\u003Cp\u003ETypically, check your center of lift and center of mass. You want the center of mass infront of the center of lift. This will make the plane naturally want to nose down, making it speed up. To get the balance, tilt the \u0022elevator\u0022 control surfaces upward (as if the plane was trying to pull up)\u003C/p\u003E\u003Cp\u003EThis tends to make easy to fly planes. Theres lots of other tricks too, but they aren\u0027t relevant to a delta like you are flying here.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-19T12:54:10Z","Content":"\n\u003Cp\u003EDefault keys for flying are QWEASD for a QWERTY keyboard, the F key is the SAS temporary toggle.\u003C/p\u003E\u003Cp\u003ERemoving the engine bodies (which are currently only decorative) may help a little as it\u0027ll shift the centre of mass forward relative to the wings.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2012-10-19T14:41:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TouhouTorpedo\u0022 data-cite=\u0022TouhouTorpedo\u0022\u003E\u003Cdiv\u003ETo get the balance, tilt the \u0022elevator\u0022 control surfaces upward (as if the plane was trying to pull up)\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow do you do this?\u003C/p\u003E\n"}]}