{"TopicId":22561,"ForumId":69,"TopicTitle":"The Linux compatibility thread!","CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-04-18T21:29:24Z","PageNum":34,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-11T15:37:23Z","Content":"\n\u003Cp\u003EMake sure they are both up to date, and check the forums for any known issues between the two addons, if it continues you may have to make a choice between them :/\u003C/p\u003E\n"},{"CreatedByName":"JeramyM","CreatedById":71912,"CreatedDateTime":"2014-05-12T05:23:10Z","Content":"\n\u003Cp\u003EI will have to try all this again, I broke ubuntu trying to do something. So I decided to switch to mint. God I love free operating systems.\u003C/p\u003E\n"},{"CreatedByName":"AstroMuffins","CreatedById":110878,"CreatedDateTime":"2014-05-12T13:24:49Z","Content":"\n\u003Cp\u003EI\u0027m using Ubuntu 12.04 and my system runs the demo version great. But the full version gets to the very end of the loading screen and quickly and silently shuts down. It\u0027s a fresh install of 0.23 and it\u0027s never run. I\u0027m using the standard drivers for Intel graphics. I think the log file says a memory allocation failed. My 4GB is supposed to be enough. My son is very sad about this.\u003C/p\u003E\u003Cp\u003EKerbal Space Program - 0.23.0.0 (LinuxPlayer)\u003C/p\u003E\u003Cp\u003EOS: Linux 3.2.0-61-generic-pae Ubuntu 12.04 32bit\u003C/p\u003E\u003Cp\u003ECPU: Intel® Core i3-2100 CPU @ 3.10GHz (4)\u003C/p\u003E\u003Cp\u003ERAM: 3936\u003C/p\u003E\u003Cp\u003EGPU: Mesa DRI Intel® Sandybridge Desktop x86/MMX/SSE2 (256MB)\u003C/p\u003E\u003Cp\u003EUnity3D log: \u003Ca href=\u0022https://justpaste.it/ffgk\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://justpaste.it/ffgk\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EKSP log: \u003Ca href=\u0022https://justpaste.it/ffgn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://justpaste.it/ffgn\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHardinfo Report of my system: \u003Ca href=\u0022https://justpaste.it/ffgq\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://justpaste.it/ffgq\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks for any help anyone can give me.\u003C/p\u003E\n"},{"CreatedByName":"sploooshman","CreatedById":106583,"CreatedDateTime":"2014-05-12T13:37:01Z","Content":"\n\u003Cp\u003EAnyone know what the correct upper and lower case should be for procedural fairings , works fine in windows but the parts dont show up in my ubuntu install\u003C/p\u003E\n"},{"CreatedByName":"heikkik","CreatedById":40016,"CreatedDateTime":"2014-05-12T23:17:56Z","Content":"\n\u003Cp\u003EHi. A fresh Ubuntu user (Whoo!) here. Mainly installed it in dual boot to let KSP utilize more memory. I use a lot of mods. Not an IT expert here, so I\u0027m a bit stuck now. I\u0027ve gotten the ksp_installer but i just keep getting Permission denied when trying to run through console and \u0022Unable to locate the program\u0022 When trying to run from file manager. What am I doing wrong? HALP! Have I just installed a whole operating system for nothing?\u003C/p\u003E\u003Cp\u003EKSP running out of memory was a problem back in 0.19 for me and since then I haven\u0027t played at all. Reinstalled some time ago and now it\u0027s got me back in.\u003C/p\u003E\u003Cp\u003EI might need some support in using Ubuntu in the first place, but that can stay outside the KSP forums. I\u0027m just baffled why I cannot change settings by default.\u003C/p\u003E\n"},{"CreatedByName":"sirkillalot","CreatedById":27281,"CreatedDateTime":"2014-05-13T08:23:27Z","Content":"\n\u003Cp\u003EI don\u0027t know if it\u0027s been posted about in this thread before, but I ran into an issue the other day trying to run KSP on a computer lab machine at my university, on which I don\u0027t have root access. In particular, I was missing the Arial fonts. The information on that problem at the beginning of this thread seems to imply that KSP uses fontconfig to find installed fonts, so I installed them to ~/.fonts and ran fc-cache -fv, which found and cached them. However, this is not actually the case - running under strace reveals that in fact KSP only searches recursively under /usr/share/fonts regardless of fontconfig settings. This means that users like me, on public machines without root access, cannot install the fonts anywhere KSP will find them.\u003C/p\u003E\u003Cp\u003EI did come up with a workaround that let me use the fonts, but I would hesitate to recommend it to others as it involves patching the KSP binary. Please back up your install before you try this, and only proceed if you actually understand what all of the words in the following procedure mean and what you\u0027re doing at each step.\u003C/p\u003E\u003Cp\u003ETo do it, first make a font directory somewhere you can write to, and put in it the Arial fonts and a symlink back to /usr/share/fonts. The full path to this directory must be shorter in length than \u0022/usr/share/fonts\u0022 - I used \u0022/tmp/fontslol\u0022. It\u0027s likely possible to use relative paths from the location of the KSP binary but I haven\u0027t tried it - if you get it working please let me know!\u003C/p\u003E\u003Cp\u003ENext, use the command \u0022strings -t x KSP.x86(_64) | grep fonts\u0022 to find the offset in the binary of the directory name where it searches for fonts - I found that in the 64 bit 0.23.5 binary it\u0027s at offset 0xF1F168.\u003C/p\u003E\u003Cp\u003ENow, open the binary in your favorite hex editor and navigate to that offset. Write over the \u0022/usr/share/fonts\u0022 string with the name of your directory. Be sure to terminate the string with a null byte if it\u0027s shorter than the original string.\u003C/p\u003E\u003Cp\u003EThe patched binary will now search recursively under your new directory for fonts, finding the Arial fonts and searching through the symlink for whatever else it needs.\u003C/p\u003E\u003Cp\u003EThis is an ugly hack, but I thought I\u0027d post it here in case others are in the same situation - I\u0027m not sure if the font-loading code comes from KSP or Unity, but it\u0027d be nice if whichever team is responsible could address this issue in future versions.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-13T08:39:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heikkik\u0022 data-cite=\u0022heikkik\u0022\u003E\u003Cdiv\u003EHi. A fresh Ubuntu user (Whoo!) here. Mainly installed it in dual boot to let KSP utilize more memory. I use a lot of mods. Not an IT expert here, so I\u0027m a bit stuck now. I\u0027ve gotten the ksp_installer but i just keep getting Permission denied when trying to run through console and \u0022Unable to locate the program\u0022 When trying to run from file manager. What am I doing wrong? HALP! Have I just installed a whole operating system for nothing?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf what you\u0027ve got is an archive (can\u0027t remember if it\u0027s .zip or .tar.gz, but it doesn\u0027t really matter) just right click and \u0022extract here\u0022. Go into the folder it just created and right click on the KSP and/or Launcher executable and make sure the check box for \u0022allow executing file as a program\u0022 is checked. You should just be able to click on it and have it run.\u003C/p\u003E\n"},{"CreatedByName":"heikkik","CreatedById":40016,"CreatedDateTime":"2014-05-13T09:02:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EIf what you\u0027ve got is an archive (can\u0027t remember if it\u0027s .zip or .tar.gz, but it doesn\u0027t really matter) just right click and \u0022extract here\u0022. Go into the folder it just created and right click on the KSP and/or Launcher executable and make sure the check box for \u0022allow executing file as a program\u0022 is checked. You should just be able to click on it and have it run.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s kind of a problem. I can\u0027t check the box. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Voidi","CreatedById":86071,"CreatedDateTime":"2014-05-13T10:51:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heikkik\u0022 data-cite=\u0022heikkik\u0022\u003E\u003Cdiv\u003EHi. A fresh Ubuntu user (Whoo!) here. Mainly installed it in dual boot to let KSP utilize more memory. I use a lot of mods. Not an IT expert here, so I\u0027m a bit stuck now. I\u0027ve gotten the ksp_installer but i just keep getting Permission denied when trying to run through console and \u0022Unable to locate the program\u0022 When trying to run from file manager. What am I doing wrong? HALP! Have I just installed a whole operating system for nothing?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you referring to ksp_installer linked on the first page?\u003C/p\u003E\u003Cp\u003EHave you downloaded the Archive with the Game from the main Game site?\u003C/p\u003E\u003Cp\u003Eopen the Applikation \u0027Terminal\u0027 to run the following commands\u003C/p\u003E\u003Cp\u003Eif you haven\u0027t downloaded ksp_installer yet\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ewget https://raw.githubusercontent.com/Voidi/proprietary_installer/master/ksp_installer\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Emake the script executable, else the the shell won\u0027t execute it\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Echmod u\u002Bx ksp_installer\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMy installer script\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E./ksp_installer \u0026lt;Path to desired Game directory\u0026gt;\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf in the the path given as Argument, exist an KSP install the script only creates entry in your StartmenÃƒÂ¼ and a launcherscript to avoid some bugs.\u003C/p\u003E\u003Cp\u003EUse this when you extracted the archive manually before.\u003C/p\u003E\u003Cp\u003EIf in the the path given as Argument, is not a KSP install, then it will try to download the archive using your login and password for the \u0027kerbalspaceprogramm.com\u0027 store\u003C/p\u003E\u003Cp\u003EIf you have manually downloaded the archive from the store before, make sure it is in the same directory as \u0027ksp_installer\u0027; The installer script will skip downloading and use the existing one.\u003C/p\u003E\u003Cp\u003EHope this explanation understandable, my english skills are terrible.\u003C/p\u003E\u003Cp\u003EVoidi\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-13T11:38:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heikkik\u0022 data-cite=\u0022heikkik\u0022\u003E\u003Cdiv\u003EThat\u0027s kind of a problem. I can\u0027t check the box. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, presumably the file is owned by someone other than yourself. You can see that on the permissions tab. Normally anything you download through your browser and dump in your home folder is owned by you, so you can do what you like with it. Simplest way to take ownership is to open the terminal (Ctrl-T) and run:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Esudo chown username /path/to/file\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhere username is your username, obviously. You can hit TAB to autocomplete the file location instead of typing it all in. Once you own the file you can set it executable either by a right click or the chmod command Voidi gave.\u003C/p\u003E\u003Cp\u003EAre you sure you actually need this installer script though? If you just download KSP straight from the official site it works fine on Ubuntu in English.\u003C/p\u003E\n"},{"CreatedByName":"sploooshman","CreatedById":106583,"CreatedDateTime":"2014-05-13T23:20:14Z","Content":"\n\u003Cp\u003Eok so I have been ATI since the RTM build of vista lol , as ATI was the only card with drivers , I have always defended them but this is crunch time, I have still got the black screen on loading ksp , sp remove drivers back to open source and it all good again , so my question is this \u003C/p\u003E\u003Cp\u003EI am going to but a new card , this is about all I can stretch to , \u003Ca href=\u0022http://www.novatech.co.uk/products/components/nvidiageforcegraphicscards/nvidiagtx760series/n760tf2gd5oc.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.novatech.co.uk/products/components/nvidiageforcegraphicscards/nvidiagtx760series/n760tf2gd5oc.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am only buying this to play ksp on linux , so I need to know that it will f*%$^$%king work lol \u003C/p\u003E\u003Cp\u003Eanyone who is using nvidia cards with proprietry and have you had any issues ?\u003C/p\u003E\n"},{"CreatedByName":"heikkik","CreatedById":40016,"CreatedDateTime":"2014-05-14T09:34:32Z","Content":"\n\u003Cp\u003E@Seret If I\u0027m the only user on this system and ubuntu doesn\u0027t have other users even. I have no idea how it can be owned by someone other than me. Except for the fact that it\u0027s not on the same drive as ubuntu. Don\u0027t know if that affects things. No it doesn\u0027t work for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E@sploooshman well, before I managed to get the proprietary drivers, the screen wasn\u0027t actually properly refreshing. Was a bit of a pain to find out where I can get the drivers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T09:36:37Z\u0022 title=\u002205/14/2014 09:36  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by heikkik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-14T10:45:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heikkik\u0022 data-cite=\u0022heikkik\u0022\u003E\u003Cdiv\u003E@Seret If I\u0027m the only user on this system and ubuntu doesn\u0027t have other users even. I have no idea how it can be owned by someone other than me. Except for the fact that it\u0027s not on the same drive as ubuntu. Don\u0027t know if that affects things. No it doesn\u0027t work for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re not the only user. I use Ubuntu myself, and just because it doesn\u0027t have a root account by default doesn\u0027t mean it doesn\u0027t have other users. Linux was designed as a multi-user system right from the start. Your system has lots of \u0022users\u0022, you\u0027re just one of them.\u003C/p\u003E\u003Cp\u003EYou say you can\u0027t set the executable flag on the file, so it must be owned by someone other than yourself. What does it say when you right-click and check the permissions tab? Who is the owner? If it\u0027s a file you downloaded through your browser then it really should be owned by you and you should have no problem running it.\u003C/p\u003E\n"},{"CreatedByName":"heikkik","CreatedById":40016,"CreatedDateTime":"2014-05-14T11:37:49Z","Content":"\n\u003Cp\u003EI can\u0027t change the Access in any of the fields. I\u0027ve tried using chown -R and -hR on the folder, even as root from the console... I just can\u0027t change the access or anything \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E When I do everything as Voidi instructed, I get permission denied even when trying to run ksp_installer as root. Oh and the image is of KSP.exe but it\u0027s the same for all the files, even ksp_installer\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uvNPtWU.png\u0022 alt=\u0022uvNPtWU.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T11:42:14Z\u0022 title=\u002205/14/2014 11:42  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by heikkik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-14T11:49:42Z","Content":"\n\u003Cp\u003ESo where is this file currently? You said it\u0027s not on the same drive as Ubuntu? The problem might be more to do with the drive (ie: it\u0027s something mounted as read-only for some reason). Copy the file over to somewhere you know you can read and write to and try again?\u003C/p\u003E\n"},{"CreatedByName":"Voidi","CreatedById":86071,"CreatedDateTime":"2014-05-14T12:18:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heikkik\u0022 data-cite=\u0022heikkik\u0022\u003E\u003Cdiv\u003E I have no idea how it can be owned by someone other than me. Except for the fact that it\u0027s not on the same drive as ubuntu. Don\u0027t know if that affects things. No it doesn\u0027t work for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is the filesystem of the drive and how is it mounted? I know some filesystem don\u0027t implement execution rights\u003C/p\u003E\u003Cp\u003Eyou can get all mount informations if run run the \u0027mount\u0027 command in terminal as normal user\u003C/p\u003E\n"},{"CreatedByName":"heikkik","CreatedById":40016,"CreatedDateTime":"2014-05-14T13:21:38Z","Content":"\n\u003Cp\u003EOh yeah. So it might be because this is the older drive that I use to store my stuff on? It\u0027s NTFS. I installed Ubuntu on my SSD, where Windows is installed, too. I\u0027m moving it to the same drive later tonight. Need to take a break for now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BrutalRIP","CreatedById":59065,"CreatedDateTime":"2014-05-15T07:22:52Z","Content":"\n\u003Cp\u003Eim having problems with the patcher says its complete but when i run the launcher its asking me to update again and the version number is 23.5.0 any suggestions would be a great help \u003Ca href=\u0022http://pastebin.com/8nQM8jHj\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/8nQM8jHj\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jamie92","CreatedById":111101,"CreatedDateTime":"2014-05-15T15:33:34Z","Content":"\n\u003Cp\u003EHi there I\u0027v been having some issue\u0027s for the last two weeks I\u0027v read as much as I can and tried loads of difrent fix\u0027s now I have reinstalled my system tried again but still crashing all the time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E any help would be much appreciated thank you sooo much for an amazing game here\u0027s my log output \u003Ca href=\u0022http://pastebin.com/yjbEWpzk\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/yjbEWpzk\u003C/a\u003E I\u0027m on a lenovo thinkpad t420 with 64 bit kali linux\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-15T15:54:33Z","Content":"\n\u003Cp\u003EBrutalRIP, we\u0027re on 0.23.5, check your builtID.txt, it should say the following:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ebuild id = 464\u003Cp\u003E2014-04-01_17-04-22\u003C/p\u003E\u003Cp\u003EBranch: master\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJamie92, you have an Intel graphics card, while the latest ones are good the older ones, and laptop ones, tend to be lacking in feature support at the driver or hardware level, you can see a lot of features are disabled in the log.\u003C/p\u003E\u003Cp\u003ETry enabling the fallback part shaders and disabling the planet shader in the settings screen, also turn down the atmospheric effects slider.\u003C/p\u003E\n"},{"CreatedByName":"BrutalRIP","CreatedById":59065,"CreatedDateTime":"2014-05-15T16:20:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EBrutalRIP, we\u0027re on 0.23.5, check your builtID.txt, it should say the following:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks and Yeah you are right so why is the update button blue and press able in the launcher?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-15T16:24:06Z","Content":"\n\u003Cp\u003EProbably because the launcher still has a few issues, not just on Linux either, so ignore it until you see that 0.24 is released on the forums or other official Squad channels but that\u0027s going to be a while, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/content/279-0-24-Update-Update\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Echeck HarvesteR\u0027s latest article here\u003C/strong\u003E\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"trash0551","CreatedById":88568,"CreatedDateTime":"2014-05-15T16:29:16Z","Content":"\n\u003Cp\u003ESystem: Kubuntu 14.04 64 bit, Video: AMD 6770m with open-source drivers.\u003C/p\u003E\u003Cp\u003EProblem: There are no shadows of spacecrafts on the planets, and it\u0027s hard to perform precise landing. I got some mods previously, but I reinstalled the game from steam (I think, this should have reverted all configs?). Even if all video settings are at their maximum, there are no shadows (no shadows on terrain and no self-shadowing on the ships, should they be? However, flat shading is on it\u0027s place). The only fix I\u0027ve found on this forum is Intel-related and most likely won\u0027t help in my situation. What can I do to diagnose and fix my problem?\u003C/p\u003E\n"},{"CreatedByName":"jamie92","CreatedById":111101,"CreatedDateTime":"2014-05-15T16:30:04Z","Content":"\n\u003Cp\u003EThank you very much for the reply I tried the change\u0027s this is what I get \u003Ca href=\u0022http://pastebin.com/Ds3724vJ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/Ds3724vJ\u003C/a\u003E when I was using windows 8 it worked perfect I hate windows tho and really dont wana have to put it back on my laptop \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-15T16:33:20Z","Content":"\n\u003Cp\u003Etrash0551, you may have to reduce the render quality slider, it controls shadows amongst other things.\u003C/p\u003E\u003Cp\u003Ejamie92, I don\u0027t see a crash unfortunately, maybe it\u0027s not KSP directly, can you try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24529-The-Linux-compatibility-thread!?p=1100735#post1100735\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ethe install script here\u003C/strong\u003E\u003C/a\u003E and see if it helps?\u003C/p\u003E\n"}]}