{"TopicId":22583,"ForumId":34,"TopicTitle":"Firespitter propeller plane and helicopter parts v7.1 (May 5th) for KSP 1.0","CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-04-18T22:30:39Z","PageNum":15,"Articles":[{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-11T05:08:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003ESnjo, I found out about your excellent parts animation module through my use of the B9 Aerospace parts - it\u0027s definitely nice to see multiple persistent animations per component \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI\u0027ve been studying the documentation you\u0027ve written for FSanimateGeneric, and while for the most part it seems straightforward, I was wondering if you or anyone have used this module with deployable solar panels? I\u0027m asking because I\u0027m trying to retrofit another modder\u0027s solar panels, which have problems with multiple animations per part.\u003C/p\u003E\u003Cp\u003ESaid part is the Balka Solar Wings Block from CardboardBoxProcessor\u0027s Kosmos pack - it consists of two extendable/retractable solar \u0022wings\u0022 mounted on opposing sides of a rotating hub. The combined rotation of both the solar wings and the hub usually allows the Balka to track the sun effectively, but when switching between flights, the panels would revert to their default retracted state due to stock KSP being unable to handle multiple animations per part. The panels are *enormous* such that it takes literally minutes to fully re-extend each wing.\u003C/p\u003E\u003Cp\u003EBelow is a snippet from CBBP\u0027s original CFG file.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECBP just asked me the same thing, and I\u0027ve been thinking it over. The problem is in the handling of animation layers and finding animations in the stock module. The only way I see it working together is by creating some extra code, so the animations would be handled by my module, and the collection aspect would be handled by the solar panel collector code. However the collector would also need to be fed an animation with no content, and have their Events hidden by code. The extra code would have to handle the collector codes extend/retract, AND making sure those events don\u0027t fire at the same time ever, because of the animation layer issue.\u003C/p\u003E\u003Cp\u003EThe ideal solution would be a whole new collector code, but that requires handling the solar tracking and the actual energy production and delivery to the vessel, which I don\u0027t know how works.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t make new code , and use one set of blank animations for the collectors, and one set for FSanimateGeneric, you can get it working, but the collection aspect would be independent of the deployed state. Also you would need access to his model/unity project to put additional models in the part.\u003C/p\u003E\u003Cp\u003Eedit: If you are comfortable coding, you can retool my code as long as you change the class name to avoid plugin conflicts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-11T05:11:16Z\u0022 title=\u002207/11/2013 05:11  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 11, 2013\u003C/time\u003E by Snjo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-11T05:13:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ganymede\u0022 data-cite=\u0022Ganymede\u0022\u003E\u003Cdiv\u003EAre nose/wing guns a planned feature?\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/P-38L_nose.jpg/320px-P-38L_nose.jpg\u0022 alt=\u0022320px-P-38L_nose.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot at the moment, but I know InfiniteDice (Boat Parts Man) has some in the works. I\u0027ve tried them, and they promise to be quite deadly.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-07-11T05:43:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snjo\u0022 data-cite=\u0022Snjo\u0022\u003E\u003Cdiv\u003EI\u0027ve been thinking it over. The problem is in the handling of animation layers and finding animations in the stock module. The only way I see it working together is by creating some extra code, so the animations would be handled by my module, and the collection aspect would be handled by the solar panel collector code. However the collector would also need to be fed an animation with no content, and have their Events hidden by code. The extra code would have to handle the collector codes extend/retract, AND making sure those events don\u0027t fire at the same time ever, because of the animation layer issue.\u003Cp\u003EThe ideal solution would be a whole new collector code, but that requires handling the solar tracking and the actual energy production and delivery to the vessel, which I don\u0027t know how works.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t make new code , and use one set of blank animations for the collectors, and one set for FSanimateGeneric, you can get it working, but the collection aspect would be independent of the deployed state. Also you would need access to his model/unity project to put additional models in the part.\u003C/p\u003E\u003Cp\u003Eedit: If you are comfortable coding, you can retool my code as long as you change the class name to avoid plugin conflicts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see.\u003C/p\u003E\u003Cp\u003EOne of these days, I might attempt to rework (a copy) of FSanimateGeneric to handle multiple solar panels (FSsolarPanel?).\u003C/p\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-11T07:08:42Z","Content":"\n\u003Cp\u003EAs long as you don\u0027t use the prefix FS, that\u0027s mine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOriginally I didn\u0027t have prefixes for the plugin classes, but I figured there was a good possibility two people could end up creating modules called solarPanel for instance. That would create a conflict. In v5 I was finally able to get rid of the last modules without the FS prefix.\u003C/p\u003E\u003Cp\u003ESo when I\u0027ve co-created a plugin class with someone else, and both parties wanted to include a variant in their mod, I\u0027d name mine FSawesomeThing, and the other guy would name his IDawesomeThing, and then we\u0027d both be able to tweak bits of it without creating problems for people using both mods.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-07-11T08:25:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snjo\u0022 data-cite=\u0022Snjo\u0022\u003E\u003Cdiv\u003EAs long as you don\u0027t use the prefix FS, that\u0027s mine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EOriginally I didn\u0027t have prefixes for the plugin classes, but I figured there was a good possibility two people could end up creating modules called solarPanel for instance. That would create a conflict. In v5 I was finally able to get rid of the last modules without the FS prefix.\u003C/p\u003E\u003Cp\u003ESo when I\u0027ve co-created a plugin class with someone else, and both parties wanted to include a variant in their mod, I\u0027d name mine FSawesomeThing, and the other guy would name his IDawesomeThing, and then we\u0027d both be able to tweak bits of it without creating problems for people using both mods.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, makes sense.\u003C/p\u003E\n"},{"CreatedByName":"orileybomb01","CreatedById":46118,"CreatedDateTime":"2013-07-18T22:42:08Z","Content":"\n\u003Cp\u003Ei know this is a propeller mod pack but i found the nose air intake and im wondering if jet parts will ever be included in this pack\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-18T22:54:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022orileybomb01\u0022 data-cite=\u0022orileybomb01\u0022\u003E\u003Cdiv\u003Ei know this is a propeller mod pack but i found the nose air intake and im wondering if jet parts will ever be included in this pack\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a tail jet engine that kinda goes with that nose already in the pack. You probably over looked it because it does not look like an engine, but rather an aerodynamic part.\u003C/p\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-19T06:19:19Z","Content":"\n\u003Cp\u003EI\u0027ve created new functionality for the landing gears, scrapping the stock landing gear code, and creating similar stuff, but with a lot more functionality. Most importantly, the wheels now have motors on them, just like rover wheels, so it\u0027s much easier to taxi on the runway/carrier (especially since the wheels already have steering).\u003C/p\u003E\u003Cp\u003EThe stock code needs everything to be just exactly to its expectations, or it will break, disabling the wheel. This new code can skip stuff like the wheel mesh rotation, suspension and animation, and even the collider itself without freaking out, and most importantly, it supports any number of wheels in a single part, so those four wheeled jet liner gears, or even a single part car axle should be good to go.\u003C/p\u003E\u003Cp\u003EA problem with the stock rover wheels is that they lack enough friction to get up steep hills and ramps, so here you can also adjust any property of the wheel colliders friction and spring from the cfg file (Not that this module supports the rover wheel setups though, that\u0027s a whole different kind of crazy)\u003C/p\u003E\u003Cp\u003EIt only took half a year, but the tail wheel can finally roll when retracted again, since disabling the collider on gear retraction is an option, as well as different drag when deployed/stowed. The drag stuff is actually interesting. It\u0027s much harder to take off with lots of drag on the bottom of the plane, so I set it as low as any other part (which all weirdly have about 0.2 drag, even the Rocomax tanks and such), and it takes off OK, but with three deployed landing gears, it slows the plane down from 124m/s to 104m/s. It actually helps a bit as an air brake, even though it\u0027s no more draggy than any other part when deployed. (Stock gear code applies 0 drag in all situations)\u003C/p\u003E\u003Cp\u003EThe end result is that you will want to stow your landing gear when you are flying to go faster, which is a good thing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-19T13:14:30Z\u0022 title=\u002207/19/2013 01:14  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 19, 2013\u003C/time\u003E by Snjo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InfiniteDice","CreatedById":57451,"CreatedDateTime":"2013-07-19T13:53:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snjo\u0022 data-cite=\u0022Snjo\u0022\u003E\u003Cdiv\u003ELanding gear... \u0022drag when deployed/stowed. The drag stuff is actually interesting. It\u0027s much harder to take off with lots of drag on the bottom of the plane... The end result is that you will want to stow your landing gear when you are flying to go faster, which is a good thing.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHip Hip Hooray!\u003C/p\u003E\n"},{"CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2013-07-19T16:28:04Z","Content":"\n\u003Cp\u003ECan you do some F-86 Sabre styled parts?\u003C/p\u003E\n"},{"CreatedByName":"orileybomb01","CreatedById":46118,"CreatedDateTime":"2013-07-20T19:26:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EThere is a tail jet engine that kinda goes with that nose already in the pack. You probably over looked it because it does not look like an engine, but rather an aerodynamic part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei will have to look, that will make building a f-86 a lot easier\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-07-21T03:07:27Z","Content":"\n\u003Cp\u003EIf I scaled some of the parts down (mostly the electric helicopter blades) would it cause any unwanted complications?\u003C/p\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-21T21:00:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mushroomman\u0022 data-cite=\u0022mushroomman\u0022\u003E\u003Cdiv\u003EIf I scaled some of the parts down (mostly the electric helicopter blades) would it cause any unwanted complications?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, just change the rescaleFactor, and possibly the thrust output and fuel use.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gmpd2000\u0022 data-cite=\u0022gmpd2000\u0022\u003E\u003Cdiv\u003ECan you do some F-86 Sabre styled parts?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know I\u0027ve promised this long ago, so I \u0027m sorry I haven\u0027t done the rest of the parts yet. New f-86 textures for the texture switcher and some wings/tail is still on the old todo-list. Vacation starts in four days, so we\u0027ll see what happens then.\u003C/p\u003E\u003Cp\u003EFor now, I\u0027m just messing around with the wheels and the VTOL, adding advanced steering to them:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/6AtAZE3yKi8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-07-22T02:23:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snjo\u0022 data-cite=\u0022Snjo\u0022\u003E\u003Cdiv\u003ENo, just change the rescaleFactor, and possibly the thrust output and fuel use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. It seems to have worked just fine.\u003C/p\u003E\u003Cp\u003ESo I\u0027ve been trying to build a mini electric helicopter and it seems to work pretty well, but it\u0027s not great. And advice on how to make it better? It doesn\u0027t handle very well at high speed mostly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img577/5263/d9x5.png\u0022 alt=\u0022d9x5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img194/1594/5kp8.png\u0022 alt=\u00225kp8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote, I have made the tail longer since these pictures.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-07-22T03:27:15Z","Content":"\n\u003Cp\u003ELOL. Very nice. It would be great this working on Vtol from B9!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-07-23T20:03:10Z","Content":"\n\u003Cp\u003ESnjo, I hope you can toss this on the list of things to do somewhere:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/41226-Retractable-deployable-wings?p=536305#post536305\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/41226-Retractable-deployable-wings?p=536305#post536305\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-24T10:08:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPre-release v5.4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/22972712/FirespitterPre.zip\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Kxrnalj.png\u0022 alt=\u0022Kxrnalj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E-new landing gear functionality: motor, roll retracted, friction overrides, etc.\u003C/p\u003E\u003Cp\u003E-VTOL steering (pitch and yaw through engine rotation, roll through thrust variation)\u003C/p\u003E\u003Cp\u003E Different control modes:\u003C/p\u003E\u003Cp\u003E \u0022Single pair\u0022 uses rotation for pitch for regular VTOL setups when using additional tail surfaces for stabilization.\u003C/p\u003E\u003Cp\u003E \u0022Double pair\u0022 uses thrust variation for pitch for Quadrocopter setups.\u003C/p\u003E\u003Cp\u003E \u0022Custom\u0022 pops up a menu to set any control mode on or off, plus setting the forwards/aft assumptions for thrust pitch.\u003C/p\u003E\u003Cp\u003E \u0022Off\u0022 is the default. Just regular VTOL action, no steering.\u003C/p\u003E\u003Cp\u003E-Texture switcher module. Switch textures in the hangar for:\u003C/p\u003E\u003Cp\u003E Bomber nose art\u003C/p\u003E\u003Cp\u003E (More coming)\u003C/p\u003E\u003Cp\u003E-Support for arrays of values in cfg files through FSnodeLoader\u003C/p\u003E\u003Cp\u003E-Increased wing lift of the fighter wings a little bit to compensate for landing gear drag. (The old value is listed in the cfg)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBugs\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI think I got all the bugs, but I did see one odd thing where I loaded up a quad craft, clicked on the left engine in a pair, and both were deleted. Picking up the opposite engine did not cause both to be deleted. I have no idea how to nail it down though...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003Eedit: haha, silly me, adding the part to its own symmetry list\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIf there are any other bugs, it\u0027s likely to be GUI related, cause there have been a lot of odd edge cases with the menus and updating values and symmetry pairs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-24T10:18:04Z\u0022 title=\u002207/24/2013 10:18  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 24, 2013\u003C/time\u003E by Snjo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Daddy Cecil","CreatedById":59121,"CreatedDateTime":"2013-07-25T01:13:59Z","Content":"\n\u003Cp\u003EAnyone know if this will work with .21? If not, probably when I come back it will be updated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dilin","CreatedById":39058,"CreatedDateTime":"2013-07-25T01:26:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daddy Cecil\u0022 data-cite=\u0022Daddy Cecil\u0022\u003E\u003Cdiv\u003EAnyone know if this will work with .21? If not, probably when I come back it will be updated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIm using the version posted above and its working so far.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-25T01:28:21Z","Content":"\n\u003Cp\u003EEverything seems to be working, except the \u0027launch to water\u0027 unit.\u003C/p\u003E\n"},{"CreatedByName":"blueshark15","CreatedById":71004,"CreatedDateTime":"2013-07-25T02:06:15Z","Content":"\n\u003Cp\u003Ehello, after much use of the hooligan labs buoyant airship parts with your propellers, and I love your work. I do, However, have a suggestion. A new part, somewhat like a cross of the swamp engine, the helicopter tail rotor, and an rcs thruster block. You would mount one on each side of your craft (or more, you could do alot with these). When you used the docking controls, w would make both propellers push you forward, s would make both push you to the rear, a would make one spin forwards and one spin back making you spin on the spot to the left, and d would do the same thing in reverse. They would essentially be rcs blocks with only 2 ports, that would require intake air and either electricity or liquid fuel to run. Probably they could look a sideways swamp engine with a ring around the blade tips like the helicopter fenestron *not sure i spelled this right.\u003C/p\u003E\u003Cp\u003EAnyway, let me know of the feasibility of this. I shouldn\u0027t think it would be too difficult to do.\u003C/p\u003E\n"},{"CreatedByName":"InfiniteDice","CreatedById":57451,"CreatedDateTime":"2013-07-25T02:16:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EEverything seems to be working, except the \u0027launch to water\u0027 unit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe will have this fixed; they introduced new code to drop vessels to the ground on launch, it forces things that start over water down to the sea floor.\u003C/p\u003E\n"},{"CreatedByName":"GrizzlyJones","CreatedById":75892,"CreatedDateTime":"2013-07-25T13:25:31Z","Content":"\n\u003Cp\u003EI think it would be a good idea if you could add some parts that would help make something like a P-38 Lighting. \u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/b/bd/Lockheed_P-38_Lightning_USAF.JPG\u0022 alt=\u0022Lockheed_P-38_Lightning_USAF.JPG\u0022\u003E I had made one before, but it wasnt to stable, and i had to use Procedural Wings to make the part between the cockpit and the engines and for the tailpiece with two of them just sort of going through each other, and also some sort of small short tail piece for the cockpit, i had to use the air intake, and thats a good shape and size for what you already have, but a dedicated structural piece kind like that would be really nice.\u003C/p\u003E\u003Cp\u003ENote when i attached the taknes and the engines, i could only mount the tanks sideways, not upright and looks a bit strange, along with the tail piece, whic would be good if you had one like the one you already have, but that goes straight back, angled on each side rather than one side flat.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve already seen several posts of wanting F-86 Sabre Jet parts, just showing my support for that idea!!!\u003C/p\u003E\n"},{"CreatedByName":"Snjo","CreatedById":57198,"CreatedDateTime":"2013-07-25T23:10:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GrizzlyJones\u0022 data-cite=\u0022GrizzlyJones\u0022\u003E\u003Cdiv\u003E[...] Note when i attached the taknes and the engines, i could only mount the tanks sideways, not upright and looks a bit strange, along with the tail piece, whic would be good if you had one like the one you already have, but that goes straight back, angled on each side rather than one side flat.[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe surface attach points on the oblong fuselages are on the top or bottom, not on the flat side. I doubt anyone uses them surface attached much. Maybe I should move the attach point to the side instead... Does anyone else use them surface attached in a way the requires the attach pint to be on the top/bottom?for the small connectors, I guess smaller wing extender kind of bit could do. For now, you could take the huge wing extender and scale it down with rescalefactor, and edit/remove the lift.\u003C/p\u003E\u003Cp\u003EThere isn\u0027t really a good way to make the rear connected wing between the tails though.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-26T00:01:50Z","Content":"\n\u003Cp\u003EP-38 is ok I guess...\u003C/p\u003E\u003Cp\u003EIf there was a new plane in full parts added though I\u0027d vote for the GeeBee!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PRvRciq.jpg\u0022 alt=\u0022PRvRciq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eya cant say this gal aint the hotness!!\u003C/p\u003E\u003Cp\u003EAnd fast, they were basically GIANT engines with a cockpit slapped on the back.\u003C/p\u003E\n"}]}