{"TopicId":22681,"ForumId":35,"TopicTitle":"[Updated] Aerobraking Calculator","CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-04-19T01:15:20Z","PageNum":1,"Articles":[{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-04-19T01:15:20Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/lQ3fON9.png\u0022 alt=\u0022lQ3fON9.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alterbaron.github.io/ksp_aerocalc/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENew Updates!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E Fixed a bug that would screw up results for retrograde encounters with Jool.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Added circularization delta-V prediction.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdates (Aug. 5th)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E\u003Cstrong\u003ENow more accurate!\u003C/strong\u003E The calculator can now make use of orbit direction information to calculate a \u003Cstrong\u003Emuch\u003C/strong\u003E more accurate result.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUnit support! Enter your orbit data in \u003Cstrong\u003Ekm\u003C/strong\u003E or \u003Cstrong\u003EMm\u003C/strong\u003E for convenience. (Thanks to \u003Cem\u003Eretoo\u003C/em\u003E on GitHub for this feature.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMinor formatting changes.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESource Code\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/alterbaron/ksp_aerocalc\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/alterbaron/ksp_aerocalc\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPhoto Album\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/tB3H9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/tB3H9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EQuick Guide\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETo use the calculator, first drop your periapsis somewhere \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Ejust above the atmosphere\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E of the target body.\u003C/strong\u003E This helps the calculator find a better manouever. Then, enter your orbit data into the form, and the apoapsis you want to have. It will then calculate a constant-velocity manoeuver to get you there.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENote: I used to suggest dropping your periapsis all the way inside of the target body\u0027s atmosphere. This is not a good idea, as the calculator may have trouble finding a solution if you set it too low.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBy \u0022constant-velocity\u0022, what I mean is that your orbital velocity should not change (much) after the manoeuver. Instead, only the direction of your velocity will be different. To achieve this, the direction in which to thrust will be located exactly between the prograde and retrograde markers on your navball. On the calculator, this is given as an angle from the top of the navball.\u003C/p\u003E\u003Cp\u003EDon\u0027t worry if the orbital velocity is a bit off. What\u0027s much more important is to get your periapsis to the right altitude. Once that\u0027s set, just coast through the atmosphere.\u003C/p\u003E\u003Cp\u003ENote that sometimes, due to some buggy behaviour with orbits in the game, the periapsis will jump around as you approach the target body. If this happens to you, just re-run the calculator with the new orbit data to make a correction.\u003C/p\u003E\u003Cp\u003EIf you ever get the message \u0022No Solution!\u0022 using the calculator,try raising your periapsis height.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T22:40:49Z\u0022 title=\u002208/26/2013 10:40  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by alterbaron\u003C/strong\u003E\n\u003Cbr\u003ENew updates!\n\u003C/span\u003E\n"},{"CreatedByName":"Stelith61","CreatedById":58699,"CreatedDateTime":"2013-05-07T14:23:57Z","Content":"\n\u003Cp\u003EWow, this looks great! This will be extremely useful when I go to do large-scale Jool missions.\u003C/p\u003E\u003Cp\u003EGreat idea! This should solve the problem of having to go quicksave-setup-try-fail-load-setup-try-fail-load-setup-try-suceed a little.\u003C/p\u003E\n"},{"CreatedByName":"Nyksy","CreatedById":63698,"CreatedDateTime":"2013-05-10T15:20:50Z","Content":"\n\u003Cp\u003ENice! Somebody should implement this as a plugin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-06-01T14:35:19Z","Content":"\n\u003Cp\u003EHm... whatever I do, I come up with \u0022No solution\u0022\u003C/p\u003E\u003Cp\u003EIn this case, my altitude is 750624m above Kerbin, my velocity is 1291m/s, periapsis is at 48000, I want to get to 100000m Apoapsis... \u003C/p\u003E\u003Cp\u003EAm I doing something wrong?\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-06-02T22:41:29Z","Content":"\n\u003Cp\u003EFirst of all, thanks for the feedback! It\u0027s really easy to let bugs slipped by unnoticed, so your comments are appreciated.\u003C/p\u003E\u003Cp\u003EI just looked into this:\u003C/p\u003E\u003Cp\u003EI need to revise my instructions that say to put your periapsis inside the planet\u0027s atmosphere. It turns out that this advise is flawed: you should put your periapsis at least a little bit outside the planet\u0027s atmosphere, or else the calculator may have problems.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIf you put your periapsis at around 80,000m before running the calculator, you should be fine.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDetails:\u003C/p\u003E\u003Cp\u003EThe problem here is that the calculator looks for maneuvers that keep the magnitude of your velocity the same (this is an arbitrary constraint that makes searching for a solution easier).\u003C/p\u003E\u003Cp\u003EWhen your craft doesn\u0027t have a high enough velocity to get a PE high enough in the atmosphere without changing the magnitude of its velocity, then the calculator can\u0027t find a solution.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-02T22:47:32Z\u0022 title=\u002206/02/2013 10:47  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 2, 2013\u003C/time\u003E by alterbaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2013-06-02T23:57:02Z","Content":"\n\u003Cp\u003EI used to use the readings MechJeb gave, but this is great!\u003C/p\u003E\n"},{"CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-07-14T21:36:18Z","Content":"\n\u003Cp\u003EI must not be doing something right. I think my problem is finding the angle for the burn. I had a Kethane probe around Minmus and it was done so I thought I\u0027d send it back to map Kerbin (maybe a little backwords, should have started with Kerbin first). The probe is ion powered so fuel isn\u0027t that much of an issue, but thought I\u0027d get some aerobraking practice in, as I\u0027ve got a ton of kethane miner landing practice lately.\u003C/p\u003E\u003Cp\u003EI\u0027ve got my start PE at 77,740, orbital speed is 70m/s, altitude is ~30,353,843 (depending on the time obviously) and I want the probes AP to end up around 109,972m. The calculator tells me to put my pe at 34,167.24 with a thrust angle of -8.64 and a deltav of 14.49. Like I mentioned above I think my problem is figuring out where the -8.64 angle should be, and when I should start the burn (if it matters). So far every attempt my resulting AP is around 450,000m - 500,000m. \u003C/p\u003E\u003Cp\u003EAny help would be great. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I can provide screenshots if needed. I\u0027m sure it\u0027s something simple that I\u0027m not doing right. I\u0027ll keep at it though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn a side note, I\u0027ve left my solar panels out, the biggest stock ones, and have been surprised that they didn\u0027t break off during the aerobraking attempts. Makes for interesting re-entry effects though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdate:\u003C/strong\u003E Almost 24 hours later (not constantly playing obviously \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) I got it figured out. I set my PE to roughly 33,200m with roughly the same angle the calculator gave me and it worked. I got my desired AP to around 115,000. So I just hve to raise my PE to the 109,972m then lower my AP to that as well. I\u0027m gonna guess the calculator was made before .20, I think I remember hearing something about the atmosphere or something being changed but I could be wrong. Of course it could also be because I wasn\u0027t at the exact altitude I gave the calculator before I started my burn. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-15T22:11:59Z\u0022 title=\u002207/15/2013 10:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 15, 2013\u003C/time\u003E by Sma\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-07-16T06:42:22Z","Content":"\n\u003Cp\u003EAh, I\u0027m glad you were able to sort out your issue.\u003C/p\u003E\u003Cp\u003EAerobraking into an orbit with a large AP reliably can be quite tough, since the final AP is extremely sensitive to small changes in the aerobraking PE. This is a mathematical fact that comes out of the physics of aerobraking, so there\u0027s no real way around it (unless you use an in-game plugin that can gather perfect orbital info, of course, and even that won\u0027t be exact due to numerical stability issues.) The larger your final PE, the more careful you have to be when plugging in your numbers.\u003C/p\u003E\u003Cp\u003EThe whole angle thing is confusing, I\u0027ll agree. Pretty much, you want to draw an imaginary circle on the navball that passes through the prograde and retrograde markers. The direction to thrust at lies on that circle, and at the given angle away from the top of the navball. Really, what you\u0027re doing is thrusting at 90 degrees between the prograde and retrograde markers. I should update the info on the page to make this more clear.\u003C/p\u003E\n"},{"CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-07-17T12:16:59Z","Content":"\n\u003Cp\u003EYeah, that was my other thought, being further out means its more sensitive to small changes. At any rate, the calc was enough to get my close, I just had to figure out how to adjust it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It could all be because my high AP changed by 1000m or more between inputting the numbers and getting it all setup in the game, even with it paused (time between adjusting the angle and what not).\u003C/p\u003E\u003Cp\u003EAn update for the angle could help some more. Maybe an example using the navbal, saying \u0022calc gives an angle of 14.235 degrees, here it is on the navball\u0022 sort of thing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If that doesn\u0027t give away too much anyway. lol \u003C/p\u003E\u003Cp\u003EI\u0027ve pretty much got the angles figured out, i think, though it would be cool if I learned how to navigate more using the navball and heading with out looking at the map so much, similar to how they do, or did, in early aircraft. Though I guess it would also require a compass, which doesn\u0027t work as well in space depending on where you are/how far out you are. Meh...oh well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PatriotBob","CreatedById":76639,"CreatedDateTime":"2013-07-29T20:23:13Z","Content":"\n\u003Cp\u003EI\u0027d be really interested in the math behind this.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t mind sharing that is. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr would be so kind as to point me in the direction to work it out my self?\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-07-30T05:31:04Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EWarning: math post. Might be a bit long . . .\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EThe calculator works off of a simple principle: given the current orbital velocity, the current altitude, and the periapsis height, it is possible to figure out the shape of your orbit in the plane of orbit, along with a bunch of relevant orbital data.\u003C/p\u003E\u003Cp\u003EHere\u0027s a snippet of MATLAB code that does just that:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efunction [ ep ec a hmag rpe rap ] = get_orbit_params( r, v, mu )\u003Cbr\u003E% Get useful orbit parameters from position vector, velocity vector, and\u003Cbr\u003E% gravitational parameter.\u003Cbr\u003E\u003Cbr\u003E% specific orbital energy\u003Cbr\u003Eep = dot(v, v)/2 - mu/norm(r);\u003Cbr\u003E\u003Cbr\u003E%specific angular momentum\u003Cbr\u003Er3d = [r(1) r(2) 0];\u003Cbr\u003Ev3d = [v(1) v(2) 0];\u003Cbr\u003Ehmag = cross(r3d, v3d);\u003Cbr\u003Ehmag = hmag(3);\u003Cbr\u003E\u003Cbr\u003E%eccentricity\u003Cbr\u003Eec = sqrt(1\u002B2*ep*hmag.^2./(mu.^2));\u003Cbr\u003E\u003Cbr\u003E%semi-major axis\u003Cbr\u003Ea = -mu/(2*ep);\u003Cbr\u003E\u003Cbr\u003E%periapse distance\u003Cbr\u003Erpe = -a*(ec-1);\u003Cbr\u003E\u003Cbr\u003E% Apoapse distance (valid iff ec \u0026lt; 0)\u003Cbr\u003Erap = (1\u002Bec)*a;\u003Cbr\u003E\u003Cbr\u003Eend\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENote that r and v are vectors, and have X and Y components. Mu is the gravitational parameter for the body (taken from the wiki).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThere\u0027s an ambiguity in orientation\u003C/strong\u003E, so we can set the azimuthal (angular) position of r as we please.\u003C/p\u003E\u003Cp\u003EI use r = [orbit_altitude \u002B planet_radius, 0] for simplicity.\u003C/p\u003E\u003Cp\u003ESome quick geometry gives the following expressions for the x and y components of the velocity:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Evy = (rpe/r)*sqrt(v^2\u002B2*mu*(1/rpe-1/r));\u003Cbr\u003Evx = sqrt(v^2-vy^2);\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOf course, v = [vx, vy]. Now we can plug in r, v and mu into the earlier code to get all that other good stuff.\u003C/p\u003E\u003Cp\u003EUsing this data, we can figure out the magnitude and direction of the ship\u0027s velocity when we hit the planet\u0027s atmosphere:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E% Calculate vcontact and rcontact where the orbit intersects the\u003Cbr\u003E% atmosphere.\u003Cbr\u003E\u003Cbr\u003Ecos_theta_contact = (1/ec)*(a*(1-ec^2)/Ratm - 1);\u003Cbr\u003Etheta_contact = acos(cos_theta_contact);\u003Cbr\u003E\u003Cbr\u003Evcontact_mag = sqrt(2*(ep \u002B mu/Ratm));\u003Cbr\u003Etheta_1 = asin(hmag/(Ratm*vcontact_mag));\u003Cbr\u003E\u003Cbr\u003Evcontact = vcontact_mag * [-cos(theta_1\u002Btheta_contact), -sin(theta_1\u002Btheta_contact)];\u003Cbr\u003Ercontact = Ratm * [cos(theta_contact), sin(theta_contact)];\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhere Ratm is the maximum extent of the atmosphere of the body (including the radius of the planet). Theta_contact is the angle with respect to our arbitrary coordinate system where the ship hits the atmosphere. Theta1 is some other angle between the position and velocity vectors, which I use to figure out the x and y components of the velocity (some tricky geometry, you\u0027d need to try it on paper to see how it works).\u003C/p\u003E\u003Cp\u003EAnyhow, now that the ship is in the atmosphere, we can simulate its trajectory (affected by both drag and gravitational forces) until it either escapes the atmosphere, or crashes. This is done using a time-stepped method.\u003C/p\u003E\u003Cp\u003EPretty much, at a given point in time, we calculate the gravitational and drag forces affecting the ship. These forces are used to update the velocity of the ship, which is used to update its position. This process is repeated until the ship hits the ground (vector length of r \u0026lt;= the planet radius) or it escapes the atmosphere (||r|| \u0026gt;= Ratm). Here\u0027s the simplified model used for the ship:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efunction [ F ] = in_atmo_force( R0, P0, H0, d, mu, m, A )\u003Cbr\u003E% Returns a function which gives the total vector force in atmosphere\u003Cbr\u003E% as a function of position and velocity.\u003Cbr\u003E\u003Cbr\u003EKp = 1.2230948554874*0.008;\u003Cbr\u003E\u003Cbr\u003E% Total force = drag \u002B gravity\u003Cbr\u003EF = @(r,v) -0.5*Kp*P0*exp((R0-norm(r))/H0)*norm(v)*d*m*A*v - m*(mu/norm(r).^3)*r;\u003Cbr\u003E\u003Cbr\u003Eend\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EF is a function which takes the position and velocity vectors and returns the vector force due to both drag and gravitation.\u003C/p\u003E\u003Cp\u003E(Note that KSP uses an erroneous mass term in the drag part of the force which doesn\u0027t exist in real life.)\u003C/p\u003E\u003Cp\u003ETo step the ship forward in time, one could use a simple approach like \u003Ca href=\u0022https://en.wikipedia.org/wiki/Euler_method\u0022 rel=\u0022external nofollow\u0022\u003EEuler\u0027s method\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI used a variant of a method known as \u003Ca href=\u0022https://en.wikipedia.org/wiki/Velocity_Verlet#Velocity_Verlet\u0022 rel=\u0022external nofollow\u0022\u003EVelocity Verlet\u003C/a\u003E since it gives more accurate results with less computation time.\u003C/p\u003E\u003Cp\u003EHere\u0027s the code used to simulate the physics (Modified Velocity Verlet):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efunction [r v t] = integrate_path( F, m, r0, v0, dt, Rmin, Ratm )\u003Cbr\u003E% Integrate the equation of motion to find the path in atmosphere.\u003Cbr\u003E% Terminate on collision with surface (sea level) or atmosphere escape.\u003Cbr\u003E\u003Cbr\u003Et = 0;\u003Cbr\u003Er = r0;\u003Cbr\u003Ev = v0;\u003Cbr\u003E\u003Cbr\u003Ea = @(rin, vin) F(rin, vin)./m;\u003Cbr\u003E\u003Cbr\u003Efirstrun = true;\u003Cbr\u003E\u003Cbr\u003Ewhile firstrun || (norm(r) \u0026lt;= Ratm \u0026amp;\u0026amp; norm(r) \u0026gt;= Rmin)\u003Cbr\u003E    r_old = r;\u003Cbr\u003E    v_old = v;\u003Cbr\u003E    a_t = a(r_old, v_old);\u003Cbr\u003E    r = r_old \u002B v_old*dt \u002B 0.5*a_t*dt.^2;\u003Cbr\u003E    v_est = v_old \u002B 0.5*dt*(a_t \u002B a(r,v_old\u002Bdt*a_t));\u003Cbr\u003E    v = v_old \u002B 0.5*(a_t \u002B a(r,v_est))*dt;\u003Cbr\u003E    t = t \u002B dt;\u003Cbr\u003E    firstrun = false;\u003Cbr\u003Eend\u003Cbr\u003E\u003Cbr\u003Eend\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENote that F is our force function from before, which takes the position and velocity as arguments, and computes the vector force.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAlmost there!\u003C/strong\u003E Once we\u0027ve escaped the atmosphere, we simply take our final r and v vectors and plug them in to \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eget_orbit_params( r, v, mu )\u003C/pre\u003E\u003Cp\u003E to figure out the apoapsis of our final orbit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFinally\u003C/strong\u003E, we run all of this over and over again, varying the periapsis height that we plugged in way back at the start. We keep refining that PE value until the resulting AP is what we wanted.\u003C/p\u003E\u003Cp\u003EThat\u0027s it! Just a little convoluted. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EAnyway, if you want to learn more about orbital mechanics, I\u0027d check out the wonderful pages located \u003Ca href=\u0022http://www.braeunig.us/space/orbmech.htm\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI also have an (incomplete) \u003Ca href=\u0022https://docs.google.com/file/d/0B-tMHzw99mYJT2s3Uy1NSkE0TE0/edit\u0022 rel=\u0022external nofollow\u0022\u003EGuide to Orbital Mechanics for KSP\u003C/a\u003E in the wors which I really should get around to finishing. Might help with getting started with orbital mechanics stuff if you want / need to.\u003C/p\u003E\u003Cp\u003EI\u0027ve uploaded some similar code for computing atmospheric landings on \u003Ca href=\u0022https://gist.github.com/alterbaron/5643760\u0022 rel=\u0022external nofollow\u0022\u003EGithub Gist\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe (awful) source code of the live site is available \u003Ca href=\u0022https://github.com/alterbaron/ksp_aerocalc/tree/gh-pages\u0022 rel=\u0022external nofollow\u0022\u003EOn Github\u003C/a\u003E if you like reading Javascript more than MATLAB.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve made it this far, thanks for braving it through and reading!\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-08-05T04:44:06Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ENew updates!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EThe calculator can now make use of orbit direction information to calculate a \u003Cstrong\u003Emuch\u003C/strong\u003E more accurate result.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUnit support! Enter your orbit data in \u003Cstrong\u003Ekm\u003C/strong\u003E or \u003Cstrong\u003EMm\u003C/strong\u003E for convenience. (Thanks to retoo on GitHub for this feature.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMinor formatting improvements.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe new orbit direction feature increases the accuracy of the calculator substantially. In one of my tests, I was able to aerobrake from a hyperbolic Kerbin encounter to a 1000 km orbit to an accuracy of 8000m.\u003C/p\u003E\u003Cp\u003EThat\u0027s an error of only 0.8%!\u003C/p\u003E\u003Cp\u003EThe orbit direction info works best if you have a more-or-less equatorial encounter. If you\u0027re coming in with a polar encounter, you might get better results by choosing \u0022ignore\u0022.\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2013-08-05T04:50:56Z","Content":"\n\u003Cp\u003EPretty cool, any chance of an ingame plugin?\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-08-05T04:57:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deadshot462\u0022 data-cite=\u0022deadshot462\u0022\u003E\u003Cdiv\u003EPretty cool, any chance of an ingame plugin?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe someday, though Mechjeb already does aerobraking prediction, so I\u0027m not sure who the audience would be.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-08-05T05:58:02Z","Content":"\n\u003Cp\u003EReally? MJ does predictions? I\u0027ve never seen it. I did about 20 restarts last night because I wanted to aerocapture around Laythe but didn\u0027t know what to set my PE too. I found out that 10km was crash-and-burn material and 25km\u002B failed to capture without me burning extra retro dv. It turned out 22km was best and this would have saved me 20 resets!\u003C/p\u003E\n"},{"CreatedByName":"esinohio","CreatedById":57681,"CreatedDateTime":"2013-08-10T14:14:53Z","Content":"\n\u003Cp\u003EThank you so much for your efforts making this! I\u0027ve already used the site twice now and just wow. I\u0027ve always had issues with getting the aerobraking / aerocapture to work properly but having this calculator handy has made some of my mission planning so much more fun now.\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-08-10T20:36:41Z","Content":"\n\u003Cp\u003EThanks! I\u0027m glad to hear that people are having success using this tool.\u003C/p\u003E\n"},{"CreatedByName":"PatriotBob","CreatedById":76639,"CreatedDateTime":"2013-08-14T19:44:23Z","Content":"\n\u003Cp\u003EOh, maths!\u003C/p\u003E\u003Cp\u003EI know mech jeb does everything for you, and that\u0027s half the reason I don\u0027t like it. A fair amount of KSP\u0027s enjoyment comes from piloting things my self.\u003C/p\u003E\u003Cp\u003EThe most fun I\u0027ve had has been flying missions IVA. I\u0027ve seen people do it but most of them run the missions before hand and memorize burn times/target velocities. I\u0027d much rather have the tools in hand, in this case maths, to design the ship in VAB knowing each stage\u0027s delta v. (Thanks Kerbal Engineer) And have all the math I need on hand to plot my burns exactly.\u003C/p\u003E\u003Cp\u003EI really like the info that MechJeb provides and I think some of it should be available to us by default. But I think MechJeb goes a step too far in to having the game play it self.\u003C/p\u003E\u003Cp\u003EThanks again for the details, I\u0027ll likely add this to my collection.\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-08-26T22:43:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ENew Updates!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E Fixed a bug that would screw up results for retrograde encounters with Jool.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Added circularization delta-V prediction.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-04T22:13:06Z","Content":"\n\u003Cp\u003ESomething I can\u0027t believe I\u0027ve never suggested before:\u003C/p\u003E\u003Cp\u003EWould it be possible to implement a \u0022coasting mode\u0022 for the calculator? Sometimes I don\u0027t really have a specific final apoapsis in mind, but I have a trajectory that already intersects with the atmosphere, and I want to see whether or not that will get me an aerocapture without any input on my part.\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-09-04T23:41:47Z","Content":"\n\u003Cp\u003EThat\u0027s not a bad idea.\u003C/p\u003E\u003Cp\u003ESince the aerobraking code already exists, it\u0027s just a simple matter of throwing together an alternate interface.\u003C/p\u003E\u003Cp\u003EIt could also give out some other fun/useful stats, like time in atmosphere, max g-force, and final orbit parameters like eccentricity.\u003C/p\u003E\n"},{"CreatedByName":"alterbaron","CreatedById":57492,"CreatedDateTime":"2013-10-03T01:49:59Z","Content":"\n\u003Cp\u003EPreview of a new \u0022expert mode\u0022 interface:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/expert.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alterbaron.github.io/ksp_aerocalc/expert.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis alternate interface (when done) will tell you your final aerobraking AP or, if the ship crashes into the surface, some other stats like landing phase angle.\u003C/p\u003E\u003Cp\u003EI also want to add the ability to generate some simple plots (g-force comes to mind).\u003C/p\u003E\n"}]}