{"TopicId":22798,"ForumId":21,"TopicTitle":"[0.19.1] MOLAB - Heavy Manned Munar Rover","CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T11:26:50Z","PageNum":1,"Articles":[{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T11:26:50Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i47.tinypic.com/2412wxc.jpg\u0022 alt=\u00222412wxc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBack in the early days of the Apollo Program, each moon landing was suppose to take two Saturn-V launches. The one not carrying people was to carry a logistic vehicle known as \u0022Lunar Truck\u0022. This logistic vehicle was never meant to come back to Earth and is designed to carry heavy gear that the astronauts will recover on the surface and use for long duration exploration. One such payload is a large rover called \u0022MOLAB\u0022:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://falsesteps.files.wordpress.com/2012/10/molab2.jpg?w=584\u0022 alt=\u0022molab2.jpg?w=584\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeen as I\u0027ve already design an Apollo style lander (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/46202-0-19-Apokee-Munar-Sortie-%28Apollo-style-spacecraft-MEM-Mun-Buggies%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/46202-0-19-Apokee-Munar-Sortie-%28Apollo-style-spacecraft-MEM-Mun-Buggies%29\u003C/a\u003E), I thought I\u0027ll give a crack at MOLAB.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/9zt1df.jpg\u0022 alt=\u00229zt1df.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB features:\u003C/p\u003E\u003Cp\u003Esix man crew capacity\u003C/p\u003E\u003Cp\u003Eself powered landing/hovering engine\u003C/p\u003E\u003Cp\u003Efore and aft anti-roll bars, ASAS and RCS system for additional traction control on low gravity environment when necessary\u003C/p\u003E\u003Cp\u003Ehuge monopropellant capacity for use in refuelling AMRV\u003C/p\u003E\u003Cp\u003Etwo AMRV \u0022mosquito\u0022 and docking stations for multiple long range aerial sortie away from MOLAB\u003C/p\u003E\u003Cp\u003Erobust power system for night driving\u003C/p\u003E\u003Cp\u003Efull scientific package\u003C/p\u003E\u003Cp\u003Eeasy to use delivery system\u003C/p\u003E\u003Cp\u003ELet\u0027s have a look at that delivery system:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i47.tinypic.com/34hdyl4.jpg\u0022 alt=\u002234hdyl4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the MOLAB, perched on top of its descent stage which is itself on top of the booster rocket. To send this bad boy to the Mun I\u0027ve elected to use my trusty Nova SHLLV (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24787-0-19-1-Zenith-rocket-family\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24787-0-19-1-Zenith-rocket-family\u003C/a\u003E). MOLAB has two set of control - one for driving and one for rocket mode. To fly as a standard rocket it\u0027s essential to find the little probe core underneath (above the Munar Descent Stage) and set it to control.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i49.tinypic.com/2l8k7qh.jpg\u0022 alt=\u00222l8k7qh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/szyhhi.jpg\u0022 alt=\u0022szyhhi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI won\u0027t bore you with details on how to attend orbit with Nova as it\u0027s pretty user friendly and anyway you can see more details about this booster in it\u0027s own thread (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44345-0-18-4-Nova-SHLLV-100-tons-to-LKO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/44345-0-18-4-Nova-SHLLV-100-tons-to-LKO\u003C/a\u003E). Remember to switch on RCS for in space attitude control when main engines are not firing, you have plenty of RCS fuel for this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i47.tinypic.com/m7xoib.jpg\u0022 alt=\u0022m7xoib.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce you get MOLAB and attached Nova core into LKO things get a bit interesting. You see Nova was designed to carry 100ton payload to LKO. MOLAB and it\u0027s Munar Descent Stage is under 60 tons, so Nova will only use up about half of its fuel in the core stage to finish climb to LKO. The rest we will use for Trans-Munar Injection(above pic), Munar orbit insertion and powered descent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/biqg5c.jpg\u0022 alt=\u0022biqg5c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce around Mun, Nova\u0027s engines are fired again for Low Munar Orbit insertion. I generally find myself left with about 500L of combined fuel \u002B oxidiser once Munar orbit insertion is complete.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i45.tinypic.com/2u4ik2w.jpg\u0022 alt=\u00222u4ik2w.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i49.tinypic.com/ion1p5.jpg\u0022 alt=\u0022ion1p5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith a nice landing site picked out, fire up Nova for one last time for powered descent. By the time it runs out you should be on a suborbital trajectory. Cut the booster loose to let it crash onto the Munar surface and power up MOLAB\u0027s own descent stage to continue your powered descent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/20sftwp.jpg\u0022 alt=\u002220sftwp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i46.tinypic.com/10gwv3o.jpg\u0022 alt=\u002210gwv3o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPowered descent is much like your regular powered descent from a capsule. The descent stage is just about on the CoM of MOLAB with a tiny tendency to pitch down, but that\u0027s well within the ship\u0027s ability to compensate for. Once you\u0027re near the surface use action group 3 to cut loose the descent stage. This will shut down descent stage engine, decouple the stage, fire retrorocket and activate the MOLAB\u0027s own small descent engines. You can also use stage sequence for this but remember to cut throttle before cutting loose the descent stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/262w4et.jpg\u0022 alt=\u0022262w4et.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB shortly before touch down. Powered by six Rockomax 24-77 it has plenty of TWR and over 400m/s of delta-V for hovering. I generally only use a small amount of fuel before touch down, the remaining could be used later should I ever need to fly the MOLAB over rough terrain.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/mvg5g9.jpg\u0022 alt=\u0022mvg5g9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB on the ground, not yet deployed for surface operation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/246njeq.jpg\u0022 alt=\u0022246njeq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB deployed for driving. You can deploy it with action group 2. This extends all ladders, deploys anti-roll bars, switches on all scientific equipments and deploys antennas.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i47.tinypic.com/syo07t.jpg\u0022 alt=\u0022syo07t.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB with main solar panels deployed (action group 1). MOLAB is equipped with about 5000 electricity capacity, two RTGs (two more on AMRVs when they are docked) and four Giganator panels for day time charging. AMRVs also add two additional OX-STAT panels when they are docked. This gives MOLAB infinite day time range and very far night time cruise range. Note that in this screenshot the navball has changed, you can change to this mode by right clicking on the lander can and choose \u0022Control from Here\u0022. The odd solar panel position in this picture happened because I just happened to land on the Mun during a Kerbin-induced solar eclipse.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i45.tinypic.com/33ygpaf.jpg\u0022 alt=\u002233ygpaf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i48.tinypic.com/2ajt7gy.jpg\u0022 alt=\u00222ajt7gy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB can hit 10m/s on the Munar surface fairly easily, but sometimes that\u0027s just not fast enough. For those who wonder \u0022what\u0027s that flat top for\u0022 on top of MOLAB here is it\u0027s key feature - Advance Munar Roving Vehicles.\u003C/p\u003E\u003Cp\u003EThe two \u0022Mosquitos\u0022 carried by MOLAB are one man, high mobility rover/flyers designed for long range excursions away from the mobile base. They are RCS powered flying machines capable of seperating from MOLAB, flying considerable distance away to points of interest carrying a single pilot before returning to MOLAB and land on the \u0022flat top\u0022 landing area to redock with the base for refuelling. A fully stocked MOLAB can support 18 max range AMRV sorties. More on the Mosquitos on the following post.\u003C/p\u003E\u003Cp\u003ECraft files:\u003C/p\u003E\u003Cp\u003EMOLAB (without the rocket): \u003Ca href=\u0022http://www./download.php?gut4ywcv3ubpwyw\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download.php?gut4ywcv3ubpwyw\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPut this in the SPH\u003C/p\u003E\u003Cp\u003EMOLAB LV: \u003Ca href=\u0022http://www./download.php?h4hdgo9lg1pdgmy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download.php?h4hdgo9lg1pdgmy\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPut this in your VAB for full rover and rocket stack\u003C/p\u003E\u003Cp\u003EMOLAB Resupply Vessel: \u003Ca href=\u0022http://www./download/2bxnbxkr4zbe595/MOLAB_Resupply_Vessel.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/2bxnbxkr4zbe595/MOLAB_Resupply_Vessel.craft\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T21:35:13Z\u0022 title=\u002205/20/2013 09:35  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T11:28:30Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i48.tinypic.com/9i927b.jpg\u0022 alt=\u00229i927b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAMRV Mosquito\u003C/p\u003E\u003Cp\u003EThese small rovers pack a lot of features into a small physical package. Weighing over just one ton fully fuelled it has:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERTG for night time power\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Esmall solar panel for day time\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ehand and foot holds for one Kerbal\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERCS propulsion system with 80L max monopropellant capacity\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAvionics Package for stability during flight\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E105 electricity capacity\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EClamp-O-Tron Jr docking port for docking with MOLAB\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i50.tinypic.com/5u2tkz.jpg\u0022 alt=\u00225u2tkz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESome tips on flying the Mosquito:\u003C/p\u003E\u003Cp\u003EKeep ASAS on, you\u0027re going to need it for stability\u003C/p\u003E\u003Cp\u003EI recommend flying in staging mode and keep your hands on both WASD and IJKL controls for simultaneous control over all six axis\u003C/p\u003E\u003Cp\u003ERemember, by far the most powerful thrust direction is upwards, feel free to pitch and roll the Mosquito to use the bottom thrusters for manoeuvring like a helicopter instead of using translate control, it\u0027s quite effective.\u003C/p\u003E\u003Cp\u003EGo easy when coming to land, if you bump the top bars on the MOLAB you\u0027re likely to break the Giganator panels.\u003C/p\u003E\u003Cp\u003ESometimes you may find yourself out of RCS fuel and unable to get back onto the MOLAB to refuel, you can rescue the stranded Mosquito by using the other one:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i49.tinypic.com/16gzvw4.jpg\u0022 alt=\u002216gzvw4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESimply dock them together and transfer some RCS fuel over to the empty mosquito. Make sure to then also even out between the two tanks on board each for balance before attempting to get both up topside of MOLAB.\u003C/p\u003E\u003Cp\u003EIf you would like to try the AMRV Mosquito interdependent of MOLAB you can find the craft file here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download.php?24hk08jesbllbjg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download.php?24hk08jesbllbjg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMOLAB, Mosquito and Nova were assembled together using Subassembly Saver Loader (\u003Ca href=\u0022http://kerbalspaceprogram.com/subassembly-saver-loader/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/subassembly-saver-loader/\u003C/a\u003E)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-22T09:43:42Z\u0022 title=\u002204/22/2013 09:43  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 22, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T12:14:17Z","Content":"\n\u003Cp\u003ESo I decided to take MOLAB out for a night time cross country drive to test out its endurance, the whole trip is about 20km, the destination is one of the Mun archs where I will set up new base. \u003C/p\u003E\u003Cp\u003EI started here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://106.imagebam.com/download/W_D9t_Q9_Kwz_piyc-vtlg/24981/249802282/screenshot516.jpg\u0022 alt=\u0022screenshot516.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://101.imagebam.com/download/-dC7ruWK7TDrDpo6oqfzrg/24981/249802293/screenshot523.jpg\u0022 alt=\u0022screenshot523.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB hauling ass and getting some hang time across the Mun. I discover that over long distance it\u0027s more efficient to drive in what I call \u0022cruise mode\u0022. That is disable front and centre wheel motor and rely on only the rear two wheels for propulsion. On flat ground MOLAB is quite capable of accelerating to a breakneck 30m/s with just the rear two wheels. Going at 30m/s is dangerous as I discovered - I rolled MOLAB about 6 times during the trip, ever single time was due to me driving the rover too hard. Over flat ground I recommend staying under 25m/s and 20m/s if you\u0027re going over bumpy/uneven ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/-UJk3EAPHpBo29G9EYC2QA/24981/249802310/screenshot526.jpg\u0022 alt=\u0022screenshot526.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETarget in sight!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/ejCiT-cz6UQGbshgMhlxDA/24981/249802319/screenshot531.jpg\u0022 alt=\u0022screenshot531.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EArriving at destination. I had to stop about half a dozen time to recharge battery during the trip.\u003C/p\u003E\u003Cp\u003E******\u003C/p\u003E\u003Cp\u003EAs with any kind of space installation regular resupplies are essential for continue manned presence. On top of this analysis shows that Kerbals can\u0027t be trusted flying the Mosquito sensibly - soon as they get a handle on how to fly it they invariably start to attempt fancy aerobatic tricks with it and then it\u0027s a matter of time before they crash it. To rectify this problem I decided to develop a dedicated MOLAB Resupply Vessel for such situations:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://102.imagebam.com/download/VJv1mcCceJBrktTFmz2sZw/24981/249802331/screenshot537.jpg\u0022 alt=\u0022screenshot537.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe MOLAB RV at launch, perched on top of a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24787-0-19-1-Zenith-rocket-family\u0022 rel=\u0022external nofollow\u0022\u003EZenith IV launch vehicle\u003C/a\u003E. This spacecraft is designed with three things in mind:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eresupply of bipropellant\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eresupply of monopropellant\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ereplacement AMRV Mosquito\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecrew rotation\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/s7SiLlnCA8FTy3Df5wYE9w/24981/249802344/screenshot545.jpg\u0022 alt=\u0022screenshot545.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB RV waiting in LKO for trans-Munar injection with the core stage of the Zenith IV still attached. Zenith IV core stage in this case will provide the delta-V for trans-munar injection ala Apollo and Saturn V\u0027s third S-IVB stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/TKxtQF2ema9PtwmSgPNv0Q/24981/249802356/screenshot546.jpg\u0022 alt=\u0022screenshot546.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://102.imagebam.com/download/s7GE_e9C3EvI9M3S7V49Ww/24981/249802366/screenshot547.jpg\u0022 alt=\u0022screenshot547.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://103.imagebam.com/download/OF7riziEKW1nb2s0QnYCQA/24981/249802376/screenshot550.jpg\u0022 alt=\u0022screenshot550.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETrans-munar injection, separation from the booster and Mun surface impact experiment. I follow the Clean Space Act and so will not allow space junk. As with other members of the Zenith rocket family the Zenith IV\u0027s core stage is equipped with probe core, electrical system and RCS system for space loitering and orbit self-clean up. In this case after separation from payload I fire the engines prograde slightly to ensure booster will crash onto the Mun surface and thus leave no space junk. I suppose in real life a base like MOLAB will also be equipped with seismic monitors to detect Mun quakes. A manually caused Mun quake would allow mapping of the Mun interior via reflected seismic wave, just like NASA did with Saturn V\u0027s third stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/gp_0tejGxg8-IOZ17ti6xQ/24981/249802388/screenshot552.jpg\u0022 alt=\u0022screenshot552.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/J4mqodi31NDtBzUFZTH7SA/24981/249802409/screenshot559.jpg\u0022 alt=\u0022screenshot559.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDeorbit burn and pin point landing. MOLAB RV doesn\u0027t have that great of a thrust to weight ratio with its two nuke engines so I recommend doing you burns with plenty of lead time. However since you\u0027ll generally not want MOLAB to drive a long way to the resupply ship you will want to land as close as possible to the rover. MOLAB RV does have a lot of delta-V in the tank (3300m/s\u002B) so feel free to hover and fly around like a helicopter around your target to ensure a close landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://102.imagebam.com/download/vThpo7raQvqKkZIZiAHy4g/24981/249802417/screenshot561.jpg\u0022 alt=\u0022screenshot561.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/8qUvHatnF8viSHOO1weqgw/24981/249802430/screenshot562.jpg\u0022 alt=\u0022screenshot562.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://103.imagebam.com/download/eqVhPG7yKfxmK5nBtUNEzg/24981/249802443/screenshot563.jpg\u0022 alt=\u0022screenshot563.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking and refuelling. Surface docking is surprisingly hard, probably because those magnetic clamps are not designed to over come the grips of 4 heavy docking legs and six heavy rover wheels. The trick to surface docking is to make sure the docking ports line up perfectly from above - ideally you want to do this on flat ground as non-flat surfaces cause wheels to slide sideways ever so slightly, throwing off your dock. I bumped the RV\u0027s docking port many times before I finally got a hard dock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://104.imagebam.com/download/R0urbG--EnE2xbos1wb4ng/24981/249802456/screenshot567.jpg\u0022 alt=\u0022screenshot567.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne interesting feature is that if you retract the landing legs on MOLAB RV, MOLAB is actually steady enough to carry the RV around on its nose. It\u0027s not exactly a configuration I would recommend for cross country driving as the engines bells on the RV have very little clearance with the ground and MOLAB\u0027s balance is completely off. But it\u0027s still easy enough to move the RV around if you only need to move it a short distance.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://105.imagebam.com/download/fnyWgqhIza3h0kFUQ9LsGg/24981/249802473/screenshot570.jpg\u0022 alt=\u0022screenshot570.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://106.imagebam.com/download/14iTCe-T6t1un1gyGIsffg/24981/249802485/screenshot572.jpg\u0022 alt=\u0022screenshot572.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMosquito deployment with action group 9.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://102.imagebam.com/download/Um4VsBDNDvYZUUE5zufNFw/24981/249802500/screenshot576.jpg\u0022 alt=\u0022screenshot576.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://106.imagebam.com/download/c94eKEMTILueo3zuoFP9tw/24981/249802513/screenshot577.jpg\u0022 alt=\u0022screenshot577.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMOLAB Base. MOLAB RV is not designed for re-entry so if the mission is to rotate crew then you will need to dock it with a re-entry capable ship in either Mun or Kerbin orbit for crew transfer. This is intentional as I designed it for multiple resupply missions in mind where the RV will repeatedly shuttle between Mun orbit (where I have a propellant depot) and surface. Alternatively if you\u0027re not running resupplies for a while and MOLAB is setting up camp then MOLAB RV makes a pretty good base expansion for MOLAB so that it becomes an eight man surface base. Hell you could even use the ability to carry the RV around to dock TWO MOLAB RVs to MOLAB for max 10 crew.\u003C/p\u003E\u003Cp\u003EEdit: added craft file for MOLAB RV to first post\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T21:37:37Z\u0022 title=\u002205/20/2013 09:37  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-04-19T13:29:11Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EA giant Mun Rover, or a nice Mun Truck! I like it...\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-19T18:05:19Z\u0022 title=\u002204/19/2013 06:05  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 19, 2013\u003C/time\u003E by Climberfx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-19T14:04:45Z","Content":"\n\u003Cp\u003EPro tip: If you activate physical timewarp, and don\u0027t ask me why, your rover will stick to the ground like it\u0027s glued to it. Much higher speeds are achievable safely with x2 activated before you can tip it over.\u003C/p\u003E\u003Cp\u003ERune. I\u0027ll put that under features, not bugs. ;P\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-04-19T18:04:44Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ENice! With little rovers i already use 2x, but in the end i explode my rover, rsrsrsrs...\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-04-19T18:49:29Z","Content":"\n\u003Cp\u003ETemstar, great work again. You are quite inspiring. \u003C/p\u003E\u003Cp\u003E...I still haven\u0027t gotten the ten-wheel behemoth I was working on eariler to work correctly.\u003C/p\u003E\n"},{"CreatedByName":"Zanis","CreatedById":57177,"CreatedDateTime":"2013-04-19T20:40:47Z","Content":"\n\u003Cp\u003EIt reminds me of a Mommy rover and two baby rovers or a Giant monster truck that was sent to the Mun on a mission to destroy all Rovers!\u003C/p\u003E\u003Cp\u003Eeither way Keep up the Great work!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TooManyErrors","CreatedById":57113,"CreatedDateTime":"2013-04-19T20:55:31Z","Content":"\n\u003Cp\u003EVery impressive! I don\u0027t think I\u0027d ever be able to get something like that into orbit with my current launch vehicles.\u003C/p\u003E\n"},{"CreatedByName":"ReconXPanzer","CreatedById":58089,"CreatedDateTime":"2013-04-20T07:39:31Z","Content":"\n\u003Cp\u003EImpressive Rover, Well done! I love those tiny little rovers too! However I haven\u0027t yet managed to get any rover to the Mun or Minmus yet due to my rubbish computer and my launch vehicles aren\u0027t up to scratch for a rover of that size.\u003C/p\u003E\n"},{"CreatedByName":"georgTF","CreatedById":57397,"CreatedDateTime":"2013-04-20T09:45:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ReconXPanzer\u0022 data-cite=\u0022ReconXPanzer\u0022\u003E\u003Cdiv\u003EImpressive Rover, Well done! I love those tiny little rovers too! However I haven\u0027t yet managed to get any rover to the Mun or Minmus yet due to my rubbish computer and my launch vehicles aren\u0027t up to scratch for a rover of that size.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t be ashamed to study and copy the Nova 100\u002B t lifter design. I have built a slightly weaker lifter along those lines and it\u0027s the best behaved rocket design i have, and there\u0027s not a thing it can\u0027t lift (well there IS a limit but normally my payloads do not weigh too much). An excellent design, highly recommended. (Although when fully strutted up with a payload it can reach a high part count)\u003C/p\u003E\u003Cp\u003EThe MOLAB itself looks fantastic. Scary stuff if you hit 30 m/s with it i imagine...\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2013-04-20T10:53:40Z","Content":"\n\u003Cp\u003EImpressive work. I especially like the mossies.\u003C/p\u003E\u003Cp\u003EHow did you get the pair of nuclear engines INSIDE the resupply vehicle like that? I mean, even with part clipping... they don\u0027t look like there would be anything, surface or node, in the right position to attach them to.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T10:57:02Z\u0022 title=\u002204/20/2013 10:57  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Tallinu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-20T11:51:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tallinu\u0022 data-cite=\u0022Tallinu\u0022\u003E\u003Cdiv\u003EImpressive work. I especially like the mossies.\u003Cp\u003EHow did you get the pair of nuclear engines INSIDE the resupply vehicle like that? I mean, even with part clipping... they don\u0027t look like there would be anything, surface or node, in the right position to attach them to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome ingenious person came up with this method. Unfortunately that thread got eaten by the Great Forum Purge. So here it is again. It doesn\u0027t actually require no clip:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i33.tinypic.com/15q2rvd.jpg\u0022 alt=\u002215q2rvd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst we start with any spacecraft, put two (or whatever number you want to go for) of those new radial attachment point at the bottom.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i37.tinypic.com/kef5va.jpg\u0022 alt=\u0022kef5va.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow put the LV-Ns underneath\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i34.tinypic.com/2rw6jw6.jpg\u0022 alt=\u00222rw6jw6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow to do the trick we need access to the top surface of that fuel tank. I like to use the girder for this.\u003C/p\u003E\u003Cp\u003EOkay now hold on to your butts I\u0027m about to blow your mind:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i37.tinypic.com/11jxjmc.jpg\u0022 alt=\u002211jxjmc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGrab the radial decoupler, keep the symmetry tool on and attach it to the top surface of the tank\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i38.tinypic.com/2lm2y9u.jpg\u0022 alt=\u00222lm2y9u.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERotate 90 degrees...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i37.tinypic.com/2q1b3o5.jpg\u0022 alt=\u00222q1b3o5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERotate 90 degrees again and place the radial attachment point.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i36.tinypic.com/23tniia.jpg\u0022 alt=\u002223tniia.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere, now you have short profile nuke engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i36.tinypic.com/2wfmp92.jpg\u0022 alt=\u00222wfmp92.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI like to put a short adapter underneath, I feel that it\u0027s just the right length for a seamless look.\u003C/p\u003E\n"},{"CreatedByName":"sodopro","CreatedById":57593,"CreatedDateTime":"2013-04-20T13:50:35Z","Content":"\n\u003Cp\u003ENice Mun base. How long can it go for in the night, km wise?\u003C/p\u003E\u003Cp\u003ENever knew about that clipping trick.\u003C/p\u003E\n"},{"CreatedByName":"Ketil","CreatedById":58634,"CreatedDateTime":"2013-04-20T19:28:54Z","Content":"\n\u003Cp\u003EHi, I\u0027m new here and downloaded your MOLAB to learn about rover design from it, and when checking out your Mosquitoes I found a part I can\u0027t find in my library. It\u0027s the one connected to the nose cone of the Mosquito and is like a grey rod with 6 flat surfaces sticking out radially from it along its length, was just wondering where I can find it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-04-20T19:49:38Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ESome ingenious person came up with this method. Unfortunately that thread got eaten by the Great Forum Purge. So here it is again. It doesn\u0027t actually require no clip:\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EFirst we start with any spacecraft, put two (or whatever number you want to go for) of those new radial attachment point at the bottom.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ENow put the LV-Ns underneath\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ENow to do the trick we need access to the top surface of that fuel tank. I like to use the girder for this.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EOkay now hold on to your butts I\u0027m about to blow your mind:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EGrab the radial decoupler, keep the symmetry tool on and attach it to the top surface of the tank\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ERotate 90 degrees...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003ERotate 90 degrees again and place the radial attachment point.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EThere, now you have short profile nuke engines.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EI like to put a short adapter underneath, I feel that it\u0027s just the right length for a seamless look.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EMan, i\u0027m not a big fan of overlapping parts, but you did it so nicely!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003EGood job discovering new ways of superimposing...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-20T22:36:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ketil\u0022 data-cite=\u0022Ketil\u0022\u003E\u003Cdiv\u003EHi, I\u0027m new here and downloaded your MOLAB to learn about rover design from it, and when checking out your Mosquitoes I found a part I can\u0027t find in my library. It\u0027s the one connected to the nose cone of the Mosquito and is like a grey rod with 6 flat surfaces sticking out radially from it along its length, was just wondering where I can find it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Radioisotope_thermoelectric_generator\u0022 rel=\u0022external nofollow\u0022\u003ERadioisotope thermoelectric generator\u003C/a\u003E. It\u0027s a vital part for rover building as it provides some power day and night independent of the solar panels. It\u0027s under the utility tab:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i33.tinypic.com/sw48pg.jpg\u0022 alt=\u0022sw48pg.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Chruschtschow","CreatedById":57785,"CreatedDateTime":"2013-04-21T09:46:47Z","Content":"\n\u003Cp\u003EWow, I\u0027m really impressed about what you do with stock parts there. Your rover, the Zenith and Nova launchers, the supply craft, everything very polished. Awesome work.\u003C/p\u003E\u003Cp\u003EAnd thanks for that guide. I was wondering how to get multiple engines under a single tank. That will help to get more effective fuel usage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-21T12:06:38Z\u0022 title=\u002204/21/2013 12:06  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 21, 2013\u003C/time\u003E by Chruschtschow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheWanderer","CreatedById":57804,"CreatedDateTime":"2013-04-21T09:55:39Z","Content":"\n\u003Cp\u003Ewell done on getting this back up\u003C/p\u003E\n"},{"CreatedByName":"Nuprin Feelgood","CreatedById":59401,"CreatedDateTime":"2013-04-23T04:05:57Z","Content":"\n\u003Cp\u003ETemstar is an inspiration to all. \u003C/p\u003E\u003Cp\u003EThanks for all your hard work and for posting these incredible crafts.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-25T15:05:52Z","Content":"\n\u003Cp\u003EI wanted to do this for a while now, finally got around to it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i38.tinypic.com/1osl1c.jpg\u0022 alt=\u00221osl1c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOffloading the AMRV Mosquito\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i33.tinypic.com/nxopw2.jpg\u0022 alt=\u0022nxopw2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPilot climbing down MOLAB\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i37.tinypic.com/2z9gric.jpg\u0022 alt=\u00222z9gric.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELift off\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i33.tinypic.com/2nkm69g.jpg\u0022 alt=\u00222nkm69g.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EApproaching the peak\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i36.tinypic.com/kbeq0p.jpg\u0022 alt=\u0022kbeq0p.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EComing in for landing\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i37.tinypic.com/2yuylb5.jpg\u0022 alt=\u00222yuylb5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESuccessful landing\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-04-25T20:48:17Z","Content":"\n\u003Cp\u003ENice, but please, are us about the sheer amont of image in the tile.\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-04-30T02:33:08Z","Content":"\n\u003Cp\u003EThe Zenith Nova rocket you have shown is slightly different than the original. What dual boosters are those in the final stage? did you just mirror some across an I beam?\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-30T06:43:01Z","Content":"\n\u003Cp\u003EYou mean the stage with two LV-T30? That\u0027s MOLAB\u0027s descent stage, I consider it as part of the payload, everything from that stage downwards is a standard Nova. But yes there\u0027s equally valid to consider that stage as an upper stage for Nova. It\u0027s simply a 3200L tank with two LV-T30 clustered underneath it ala the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Centaur_%28rocket_stage%29\u0022 rel=\u0022external nofollow\u0022\u003ECentaur upper stage\u003C/a\u003E. the beam in the centre between the engines is just a way to connect the stage to the Nova core below.\u003C/p\u003E\n"},{"CreatedByName":"TheWanderer","CreatedById":57804,"CreatedDateTime":"2013-05-01T15:44:21Z","Content":"\n\u003Cp\u003EStill looking good, this deserves more attention\u003C/p\u003E\n"}]}