{"TopicId":22888,"ForumId":34,"TopicTitle":"[1.0.5] FASA 5.44","CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-04-19T17:33:17Z","PageNum":63,"Articles":[{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-01T06:48:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003EIf you want to be accurate, the time to jettison the Atlas boosters is at T\u002B2:05 (T\u002B125 seconds) for the standard Atlas, or T\u002B2:33 (T\u002B153 seconds) for a stretched Atlas representing one of the later models, regardless of altitude and speed. (Of course, you also shouldn\u0027t throttle it at all, since the Atlas had non-throttled engines.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMercury Atlas 9\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAt 8:04:13 a.m. EST, May 15, 1963,[1] Faith 7 was launched from Launch Complex 14. At T\u002B60 seconds, the Atlas started its pitch program. Shortly afterward, MA-9 passed through Max-Q. At T\u002B2 minutes 14 seconds Cooper felt BECO (Booster Engine Cutoff) and staging. The two Atlas booster engines had been left behind. The Launch Escape Tower was then jettisoned. At T\u002B3 minutes the cabin pressure sealed at 5.5 psi (38 kPa). Cooper reported, \u0022Faith 7 is all go.\u0022\u003Cp\u003EAt about T\u002B5 minutes was SECO (Sustainer Engine Cutoff) and Faith 7 entered orbit at 17,547 mile/h (7,844 m/s). After the spacecraft separated and turned around to orbit attitude, Cooper watched his Atlas booster lag behind and tumble for about eight minutes. Over Zanzibar on the first orbit, he learned that the orbital parameters were good enough for at least 20 orbits. As the spacecraft passed over Guaymas, Mexico still on the first orbit, capsule communicator Gus Grissom told Cooper the ground computers said he was \u0022go for seven orbits\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had been making everything at 64% since Kerbin is almost half the size of Earth that means you want to split the run times in half as well. So a little over half of 2:14, i just go for somewhere around 1:30, all of this depends on your load and your mission profile as well. Generally I keep my speed below 130m/s and when I get to the point where 1/3 throttle keeps my speed constant I dump the engines and throttle up.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-02-01T06:56:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EIs this bug with PF known?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol I tried that, and it was hilarious. It makes sense, PF is trying to.. fairingize the clamp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2014-02-01T13:08:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EIs this bug with PF known?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I saw that too. Stock clamps do the same thing, FWIW. I put in a request on the PF thread to ignore parts that have the launch clamp module, but it\u0027s not clear to me how active development on PF is.\u003C/p\u003E\n"},{"CreatedByName":"jpinard","CreatedById":89401,"CreatedDateTime":"2014-02-01T15:43:10Z","Content":"\n\u003Cp\u003EWhat does the indexing bar do?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-01T15:46:15Z","Content":"\n\u003Cp\u003EEnsures proper alignment when docking.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2014-02-01T15:53:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jpinard\u0022 data-cite=\u0022jpinard\u0022\u003E\u003Cdiv\u003EWhat does the indexing bar do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.wired.com/images_blogs/wiredscience/2012/10/geminiagena.jpg\u0022 alt=\u0022geminiagena.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENotice the V-shaped notch at the top of the Agena docking port? The Gemini\u0027s indexing bar slides into that, ensuring you dock at the proper rotational alignment.\u003C/p\u003E\n"},{"CreatedByName":"Woodstar","CreatedById":99637,"CreatedDateTime":"2014-02-01T19:37:38Z","Content":"\n\u003Cp\u003EGreat looking mod, is there a way I can use the probe parts (geigercounter, laser, camers) only without the rest of the mod?\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-02-01T19:48:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Woodstar\u0022 data-cite=\u0022Woodstar\u0022\u003E\u003Cdiv\u003EGreat looking mod, is there a way I can use the probe parts (geigercounter, laser, camers) only without the rest of the mod?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can the cam but, I haven\u0027t try\u0027ed the laser and geigercounter.\u003C/p\u003E\n"},{"CreatedByName":"Woodstar","CreatedById":99637,"CreatedDateTime":"2014-02-01T20:05:06Z","Content":"\n\u003Cp\u003EHow did you do it? because I have put the FASA_Probe_Parts folder in game data and the parts don\u0027t show, same if I put them in the parts folder just dont show. I dont want to install the rest of the mod just the probe parts.\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-02-01T20:15:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EIs this bug with PF known?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep. There\u0027s a workaround however. Take the launch clamps off first, set up your fairings how you want them, and then, press L on every fairing piece. What this does is lock the shape of that particular fairing so that it won\u0027t change no matter what you place within it or around it. Then you\u0027ll be able to place the launch clamps. The faring base will still show the fairing path being all wonky, but your actual fairings won\u0027t change.\u003C/p\u003E\u003Cp\u003ESee here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xOBMzEK.png\u0022 alt=\u0022xOBMzEK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWithout locking the fairings, my fairings would also have ended up all fat. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHow did you do it? because I have put the FASA_Probe_Parts folder in game data and the parts don\u0027t show, same if I put them in the parts folder just dont show. I dont want to install the rest of the mod just the probe parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInstall the mod, then delete all the part folders within the FASA folder that you don\u0027t want. You still have to maintain the structure of the whole folder, but you\u0027d just remove everything within it that you don\u0027t want.\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-02-01T20:19:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Woodstar\u0022 data-cite=\u0022Woodstar\u0022\u003E\u003Cdiv\u003EHow did you do it? because I have put the FASA_Probe_Parts folder in game data and the parts don\u0027t show, same if I put them in the parts folder just dont show. I dont want to install the rest of the mod just the probe parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe part path as to stay the same so you can make a fold in KSP/GameData/FASA/Probe\u003C/p\u003E\u003Cp\u003Ethen in side probe put your FASA_Probe_Parts folder.\u003C/p\u003E\u003Cp\u003EEDIT OR on a reinstall FASA delete what you don\u0027t want.\u003C/p\u003E\n"},{"CreatedByName":"Woodstar","CreatedById":99637,"CreatedDateTime":"2014-02-01T20:38:11Z","Content":"\n\u003Cp\u003EGreat thanks a bunch guys!!\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-01T20:57:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Woodstar\u0022 data-cite=\u0022Woodstar\u0022\u003E\u003Cdiv\u003EGreat looking mod, is there a way I can use the probe parts (geigercounter, laser, camers) only without the rest of the mod?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe easy way\u003C/p\u003E\u003Cp\u003EDownload the mod, and extract it to a temporary location.\u003C/p\u003E\u003Cp\u003EIn the FASA folder delete everything except \u0022Probes\u0022 and \u0022Resources\u0022-Resources has the definition for the Geiger counter.\u003C/p\u003E\u003Cp\u003EOpen up the \u0022Probes\u0022 folder. \u003C/p\u003E\u003Cp\u003EDelete the \u0022Explorer\u0022 folder.\u003C/p\u003E\u003Cp\u003EDrag the FASA folder into your GameData folder\u003C/p\u003E\u003Cp\u003E-Done..\u003C/p\u003E\n"},{"CreatedByName":"Cdodders","CreatedById":85280,"CreatedDateTime":"2014-02-01T21:05:02Z","Content":"\n\u003Cp\u003EWhat versions of the Saturn V are you doing?\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2014-02-01T21:09:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EYep. There\u0027s a workaround however. Take the launch clamps off first\u0027 date=\u0027 set up your fairings how you want them, and then, press L on every fairing piece. What this does is lock the shape of that particular fairing so that it won\u0027t change no matter what you place within it or around it. Then you\u0027ll be able to place the launch clamps. The faring base will still show the fairing path being all wonky, but your actual fairings won\u0027t change.[/quote\u0027]\u003Cp\u003EI didn\u0027t know about that. Hopefully I\u0027ll remember it next time I use the pfairings. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-01T21:16:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cdodders\u0022 data-cite=\u0022Cdodders\u0022\u003E\u003Cdiv\u003EWhat versions of the Saturn V are you doing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am doing the Apollo 11 version of the engines and fuel tanks, Denny is doing the CSM and the Lunar Module.\u003C/p\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2014-02-01T21:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EIs this bug with PF known?\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fwBIwRO.jpg?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/fwBIwRO.jpg?1\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe fairings looks like cheese wheels \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-02-02T07:36:45Z","Content":"\n\u003Cp\u003EHey frizzank, how do you fly the shuttle? Every time I do my gravity turn, it flips head over heels.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-02T08:13:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoldForest\u0022 data-cite=\u0022GoldForest\u0022\u003E\u003Cdiv\u003EHey frizzank, how do you fly the shuttle? Every time I do my gravity turn, it flips head over heels.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea that one is hard. I set up action groups to turn off some of the engines (#1-4) to help balance things out in the flight. If your pitching forward turn off some of the shuttle engines. Also try adjusting some of the thrust amount, there may be a better setup.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-02-02T13:14:56Z","Content":"\n\u003Cp\u003EReally like these parts, but I got a bit of a problem with the launch towers, they clip the ship as they detach somehow and makes the rocket wobble horribly (sometimes causing a RUD), would be nice if the arms at least became no-clip when they detach\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2014-02-02T13:43:24Z","Content":"\n\u003Cp\u003EHey, frizzank, a thought on the Saturn series. I know you don\u0027t plan on building a full Saturn I version, with the unique S-IV stage, but a thought occurred to me.\u003C/p\u003E\u003Cp\u003EThe RL-10 engines used in the S-IV ended up being some of the most commonly used American engines ever built (because they were WIDELY used in upper stages, including Centaur). If you were to include the RL-10 and a baseplate for the S-IVB that would give us six radial engine positions and a lowered central bottom node for attaching the interstage, we could not only do a reasonable facsimile of the full Saturn I stack, but we could also use the RL-10s for their many other upper-stage applications. (The RL-10 is still in production today as an Atlas V upper stage engine, after all.)\u003C/p\u003E\u003Cp\u003EAlso, this might be something you could toss into the flavor text for the H1 engines: I did the math, and for those who want to do an accurate reproduction of the original S-I stage from the Saturn I (as opposed to the Saturn IB\u0027s S-IB first stage), all that needs to be done, after checking astronautix.com, is to set the thrust limiter on the engine to 91.7%. (The Saturn IB technically used \u0022H1b\u0022 engines that had been uprated in thrust for the same specific impulse by simply increasing fuel flow; my calculator shows the H1\u0027s sea level thrust to be 91.59865% of the H1b that you\u0027ve simulated.) This would allow us to simulate the Saturn I first stage without any actual coding changes on your part...\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-02T13:52:45Z","Content":"\n\u003Cp\u003ENote, RL-10 had many different variants, and they look very different on Saturn I, Delta IV (much longer, extendable nozzle), Atlas V (shorter, extendable nozzles) and on early Atlases. Some kind of RL-10 would be nice for Centaurs, but because of Frizzank\u0027s timeframe, I\u0027d only expect a baseline version for early Centaurs.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-02T18:38:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ENote, RL-10 had many different variants, and they look very different on Saturn I, Delta IV (much longer, extendable nozzle), Atlas V (shorter, extendable nozzles) and on early Atlases. Some kind of RL-10 would be nice for Centaurs, but because of Frizzank\u0027s timeframe, I\u0027d only expect a baseline version for early Centaurs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t have time to finish variants or even the other launch vehicles that actually flew. So my scope of work is limited to what I can actually finish in my limited amount of time I have. Also I don\u0027t mind suggestions or tweaks but please no more requests until I am done with Apollo.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-02T18:52:58Z","Content":"\n\u003Cp\u003EI was more referring to the RL-10 variants with extending nozzles being from \u002790s, which is far from the timeframe you\u0027re working in. You\u0027ll most likely be making the Centaur-D. Oh, and BTW, there were plans to incorporate Centaur as the final stage of the original Saturn I, so it is related to the Apollo program, if only in a \u0022what if\u0022 way. But you\u0027re right, actual Apollo hardware first.\u003C/p\u003E\n"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2014-02-02T19:14:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EReally like these parts, but I got a bit of a problem with the launch towers, they clip the ship as they detach somehow and makes the rocket wobble horribly (sometimes causing a RUD), would be nice if the arms at least became no-clip when they detach\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimple solution is to stage them BEFORE you stage your bottom attachment points and start engines. I use 1 Tower, 4 Service gantries and then 4 of the Atlas 2.5m base restraints (if not more on an apsaragus launch) I Pop all the tower and tall gantries first. THEN I stage the engine start with the release of the rest of the restraints. BTW that is pretty close to real life.\u003C/p\u003E\n"}]}