{"TopicId":23052,"ForumId":15,"TopicTitle":"Unity to KSP: A Detailed Tutorial","CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-20T08:39:46Z","PageNum":1,"Articles":[{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-20T08:39:46Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003EBefore you start\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EThis tutorial is designed for those entirely new to Unity and its interface. There are some things to take into consideration before using Unity. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThe texturing on your models should look exactly how you want it to before you import into Unity.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EOBJ should be your model format of choice, as you may get different issues with different formats. But you are free to use any format Unity supports.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EExport models in the measurement of meters, size them appropriately.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EZero out your models XYZ coordinates in your modeling program before exporting. All coordinates and orientations carry over to Unity, but will be considered as 0,0,0 even if it\u0027s off center.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EA mesh collider is what the game world considers a solid object. Keep all parts you intend to use as colliders, under 255 polygons. You may need to split sections of your model to meet this criteria but you can have as many individual colliders as you want.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#66cc00;\u0022\u003EDownload\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou will need Unity and the KSP Part tools package. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUnity:\u003C/strong\u003E \u003Ca href=\u0022http://unity3d.com/unity/download/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://unity3d.com/unity/download/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPart Tools 18 package:\u003C/strong\u003E \u003Ca href=\u0022http://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ESetup \u0026amp; Configuration\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAfter you\u0027ve installed Unity, extract the file in the Part Tools zip to where you installed Unity. \u003C/p\u003E\u003Cp\u003EFor Example: \u003Cem\u003EC:\\Program Files\\Unity\\Editor\\Standard Packages\\\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOpen Unity. \u003C/p\u003E\u003Cp\u003EYou should get a prompt box with 2 tabs. If not, go to \u003Cstrong\u003EFile \u0026gt; New Project\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img22/320/createproject.png\u0022 alt=\u0022createproject.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESelect the \u003Cstrong\u003ECreate New Project\u003C/strong\u003E tab. Select the \u003Cem\u003EPartTools 18.unitypackage\u003C/em\u003E and click \u003Cstrong\u003ECreate\u003C/strong\u003E. There will be some loading bars as it prepares the project.\u003C/p\u003E\u003Cp\u003EOn the bottom left, there is a \u003Cstrong\u003E[Project]\u003C/strong\u003E tab with a list of some folders. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img839/3723/projectso.png\u0022 alt=\u0022projectso.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the file explorer for your project. To the right of that in the bottom center, is the area where you will see file listings of what is contained in each folder.\u003C/p\u003E\u003Cp\u003ERight click the \u003Cstrong\u003EAssets\u003C/strong\u003E folder then go to \u003Cstrong\u003ECreate \u0026gt; New Folder\u003C/strong\u003E. Name this folder whatever you want. This will be the folder you will drag and drop model and texture files into. It\u0027s best to have a separate folder for each mod you\u0027ll be making.\u003C/p\u003E\u003Cp\u003ENow go to the \u003Cstrong\u003EPlugins \u0026gt; KSP\u003C/strong\u003E folder. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img708/5314/parttools.png\u0022 alt=\u0022parttools.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn it there is a file named \u003Cstrong\u003EPartTools\u003C/strong\u003E. This contains the script that allows you to export models and textures from Unity to KSP properly. But we will cover the usage of that later. \u003C/p\u003E\u003Cp\u003ECreate a New Gameobject, either by going to the top menu bar; \u003Cstrong\u003EGameObject \u0026gt; Create Empty\u003C/strong\u003E, or pressing \u003Cstrong\u003Ectrl\u002Bshift\u002BN\u003C/strong\u003E. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img209/6748/newgameobject.png\u0022 alt=\u0022newgameobject.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis will create a new object in the \u003Cstrong\u003E[Hierarchy]\u003C/strong\u003E panel on the top left of Unity. Rename this object \u0022PartTools\u0022 for simplicity sake.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img6/8180/parttoolsobject.png\u0022 alt=\u0022parttoolsobject.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDrag the Part Tools file into the \u003Cstrong\u003E[Hierarchy]\u003C/strong\u003E panel on the upper left, drop it into the \u003Cstrong\u003EGameObject\u003C/strong\u003E you just created and renamed. \u003C/p\u003E\u003Cp\u003ENow That all of these steps have been completed, Unity is completely setup for KSP. This would be a good time to save the project. Go to \u003Cstrong\u003EFile \u0026gt; Save Project\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EGetting Started\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOpen the folder you created in the \u003Cstrong\u003EAssets\u003C/strong\u003E folder earlier. Drag and drop your model, .mtl (if applicable) and texture files into the bottom center panel (or directly on the folder). \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img22/6681/dropinparts.png\u0022 alt=\u0022dropinparts.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou should now see your model and textures in the file listing, along with a folder named \u003Cstrong\u003EMaterials\u003C/strong\u003E. \u003C/p\u003E\u003Cp\u003ESelect your model from the list then drag and drop it anywhere in the \u003Cstrong\u003E[Hierarchy]\u003C/strong\u003E panel. \u003C/p\u003E\u003Cp\u003EThe model will now show listed under your \u003Cstrong\u003EMain Camera\u003C/strong\u003E and be visible in the center window named \u003Cstrong\u003E[scene]\u003C/strong\u003E. There will be an arrow triangle next to the name. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img405/9206/textboxmodelselectpart.png\u0022 alt=\u0022textboxmodelselectpart.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis can be clicked and will show a named listing of the individual parts of your model, and selecting any of them will automatically select that specific part of the model for working with. Alternatively, you can select individual parts or groups of a model visually from the display in the \u003Cstrong\u003E[scene]\u003C/strong\u003E panel in the middle center of Unity.\u003C/p\u003E\u003Cp\u003EThere is a panel on the right side of Unity called the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img827/4430/inspector.png\u0022 alt=\u0022inspector.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny file or part you have selected, either from the \u003Cstrong\u003E[Hierarchy]\u003C/strong\u003E or \u003Cstrong\u003E[Project]\u003C/strong\u003E panels, will show options in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel. These options are referred to as \u003Cstrong\u003EComponents\u003C/strong\u003E. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EImport Settings\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESelect the model from the \u003Cstrong\u003E[Project]\u003C/strong\u003E panel\u0027s file explorer. This will reveal the \u003Cstrong\u003EImport Settings\u003C/strong\u003E options for your model in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img805/6310/importsettings.png\u0022 alt=\u0022importsettings.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESet \u003Cstrong\u003EScale factor\u003C/strong\u003E to 0.1 or 1.0. This setting depends on the scaling and sizing of your model when you exported from your modeling program. 0.1 is considered default. \u003C/p\u003E\u003Cp\u003ECheck \u003Cstrong\u003EGenerate colliders\u003C/strong\u003E and \u003Cstrong\u003EGenerate Lightmap UVs\u003C/strong\u003E. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAPPLY\u003C/strong\u003E the settings.\u003C/p\u003E\u003Cp\u003EThere are other options here, but we will not cover them. Not all of these options are necessary or the values can be changed, but it\u0027s best to keep them this way by default. You will have to apply these settings to every new model you import.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EMesh Colliders, Textures \u0026amp; Shaders\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENow we will go back to the\u003Cstrong\u003E [Hierarchy]\u003C/strong\u003E panel on the top left. From there we will select each part of our model individually, starting with the first one from the list. The part will indicate it is selected visually in the \u003Cstrong\u003E[scene]\u003C/strong\u003E panel in the top center of Unity. \u003C/p\u003E\u003Cp\u003EOn the Right, in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel, you will notice options appear once you\u0027ve selected the part. \u003C/p\u003E\u003Cp\u003EThe two basic Components we will be working with are the \u003Cstrong\u003EMesh Collider\u003C/strong\u003E and \u003Cstrong\u003EMaterials\u003C/strong\u003E. The mesh collider component can be found through the \u003Cstrong\u003EAdd Component\u003C/strong\u003E button at the bottom of the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel. Specifically under \u003Cstrong\u003EAdd Component \u0026gt; Physics \u0026gt; Mesh Collider\u003C/strong\u003E. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img829/3556/meshcolliderphysics.png\u0022 alt=\u0022meshcolliderphysics.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis will add the component options to the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel strictly for the part you have selected. \u003C/p\u003E\u003Cp\u003EThe \u003Cstrong\u003EMaterial\u003C/strong\u003E options should already be visible in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel without having to add it as a Component, as long as any part of your model is already selected.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img844/4686/materials.png\u0022 alt=\u0022materials.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst we will be working with the \u003Cstrong\u003EMaterials\u003C/strong\u003E options. At the top of the materials section of the panel, it will say \u003Cstrong\u003EShader:\u003C/strong\u003E with a drop down box. Browse through the drop down box and select \u003Cstrong\u003EKSP\u003C/strong\u003E. You must select and use one of the KSP shaders with your part, and can use different shaders with different parts of any given model as long as they can be selected individually.\u003C/p\u003E\u003Cp\u003EThere will be several different shader options to choose from. Specular for example, makes your model surface shiny. Diffuse makes your model surface dull. I will not go into detail explaining all of the other shaders and their different settings since this tutorial assumes you know what most of these terms mean.\u003C/p\u003E\u003Cp\u003ENote: You can also access an area to apply a texture with any of the colored sphere icons in the \u003Cstrong\u003EMaterials\u003C/strong\u003E folder, which will bring up the material options in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel.\u003C/p\u003E\u003Cp\u003ETo the right in the material options, you\u0027ll see a blank box with a \u003Cstrong\u003ESelect\u003C/strong\u003E button on the right. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img15/7880/selecttextures.png\u0022 alt=\u0022selecttextures.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EClicking \u003Cstrong\u003ESelect\u003C/strong\u003E will allow you to choose from any textures you dragged and drop into your project. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img35/2624/selecttexture.png\u0022 alt=\u0022selecttexture.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESelecting any texture will assign it to that specific part, which should be visually apparent immediately. You must repeat this process for each section you\u0027re adding textures to.\u003C/p\u003E\u003Cp\u003ENow we will cover the \u003Cstrong\u003EMesh Collider\u003C/strong\u003E. Go to \u003Cstrong\u003EAdd Component \u0026gt; Physics \u0026gt; Mesh Collider\u003C/strong\u003E if you haven\u0027t already. This will bring up a new set of options in the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img585/9189/convex.png\u0022 alt=\u0022convex.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere will be a few options to choose from, but we will only cover the basic options you need to set. There will be an option called \u003Cstrong\u003EConvex\u003C/strong\u003E. This option must be set on all parts with a mesh collider. Below that you will see a \u003Cstrong\u003EMesh\u003C/strong\u003E selection option, this is where you select the part of a model to assign the mesh collider to. \u003C/p\u003E\u003Cp\u003ETo bring up the mesh selection listing, click the circle on the right \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img843/8417/meshselection2.png\u0022 alt=\u0022meshselection2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESelect the part you are currently working with if it isn\u0027t already selected. Repeat this process for each part that needs a mesh collider.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img43/6217/meshselect.png\u0022 alt=\u0022meshselect.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EParts with a mesh collider will be visually wrapped in green lines along their vertices. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img546/2161/meshsquare2.png\u0022 alt=\u0022meshsquare2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EExport to KSP\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGo to the \u003Cstrong\u003E[Hierarchy]\u003C/strong\u003E and select the \u003Cstrong\u003EPart Tools\u003C/strong\u003E object we created earlier. In the \u003Cstrong\u003E[inspector]\u003C/strong\u003E panel you will see the \u003Cstrong\u003EPart Tools\u003C/strong\u003E script options. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img341/1069/witepart.png\u0022 alt=\u0022witepart.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESet \u003Cstrong\u003EPart Name\u003C/strong\u003E to whatever you wish, but try to make it unique so it doesn\u0027t conflict with other KSP parts. The \u003Cstrong\u003EFile Path\u003C/strong\u003E will be the name of the folder created, which is the folder that you will put into the \u0022Parts\u0022 directory of a KSP installation. \u003C/p\u003E\u003Cp\u003ELeave the \u003Cstrong\u003EFile name\u003C/strong\u003E and \u003Cstrong\u003EFile extension\u003C/strong\u003E as it is, never change these. Make sure \u003Cstrong\u003ECopy Textures\u003C/strong\u003E and \u003Cstrong\u003EConvert Texture\u003C/strong\u003E options are always checked just in case. \u003C/p\u003E\u003Cp\u003ESet your \u003Cstrong\u003ETexture Format\u003C/strong\u003E to either PNG OR MBM. Now Click \u003Cstrong\u003EWrite\u003C/strong\u003E. This will export your now KSP compatible model and textures to your Unity projects folder, which is in your \u0027My Documents\u0027 folder by default. Example: \u003Cem\u003EMy Documents\\New Unity Project\\Parts\\\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EYour project is now complete and you may copy the \u003Cstrong\u003EFile Path\u003C/strong\u003E folder into the KSP installations Parts folder through your operating systems file explorer. Add a suitable Parts.cfg file to the part folder. The part name you set in the config file should be the same as the one you used when writing your part. \u003C/p\u003E\u003Cp\u003EYour textured model should now be accessible in the game. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ENotes: \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-If something isn\u0027t done properly, you may get an error listing in the Console area (found right beside the Project panel) when trying to Write. Errors may cause a non functional model file that will not load in KSP or cause KSP to hang on loading. This tutorial however, does not cover error troubleshooting.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-Sometimes models may seem invisible within KSP. This is usually due to the model being scaled too large or too small, or if textures are either missing or not assigned properly. You can alter scale either in your modeling program, unity, or the part.cfg file.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-Part.cfg settings do not fall under the scope of this tutorial.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-The Part Tools script will export all parts in the Hierarchy; make sure to remove completed mods from the Hierarchy if working on new ones.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E-Make sure all XYZ coordinates in Unity are also zero\u0027d out before writing your part, since the coordinates will carry over to KSP and could cause everything to be off center, including attachment points.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T00:16:57Z\u0022 title=\u002205/02/2013 12:16  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ahappydude","CreatedById":458,"CreatedDateTime":"2013-04-20T10:09:50Z","Content":"\n\u003Cp\u003EThank you =) Alot of usefull infomation\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-04-20T12:28:19Z","Content":"\n\u003Cp\u003EI would replace the mediafire link to the part tools with the official one: \u003Ca href=\u0022http://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s probably not best practice to drop it onto the Main Camera object, KSP 0.19.1 renames it the root object to model and doesn\u0027t include camera components in the current version but there\u0027s no guarantee that won\u0027t change in future (even if it does seem unlikely).\u003C/p\u003E\u003Cp\u003EYou shouldn\u0027t be using a mesh collider for a cube, a box collider will give better performance.\u003C/p\u003E\u003Cp\u003EAs far as I know there\u0027s no reason to use MBM textures currently, and you can always convert later if there is. I\u0027d leave it on PNG.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2013-04-20T12:38:48Z","Content":"\n\u003Cp\u003EThanks. I\u0027ll read through this in due course. Are you happy if I use this for some video examples? I\u0027m planning to do the artwork myself mind...\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-20T12:43:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EndlessWaves\u0022 data-cite=\u0022EndlessWaves\u0022\u003E\u003Cdiv\u003EI would replace the mediafire link to the part tools with the official one: \u003Ca href=\u0022http://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/files/ksp-parttools-18.zip\u003C/a\u003E\u003Cp\u003EIt\u0027s probably not best practice to drop it onto the Main Camera object, KSP 0.19.1 renames it the root object to model and doesn\u0027t include camera components in the current version but there\u0027s no guarantee that won\u0027t change in future (even if it does seem unlikely).\u003C/p\u003E\u003Cp\u003EYou shouldn\u0027t be using a mesh collider for a cube, a box collider will give better performance.\u003C/p\u003E\u003Cp\u003EAs far as I know there\u0027s no reason to use MBM textures currently, and you can always convert later if there is. I\u0027d leave it on PNG.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks for the link. \u003C/p\u003E\u003Cp\u003EI put part tools in the main camera simply because it stays there. I used to just drag and drop it onto the model itself, but if you need to re-work the model in your modeling program and remove it from the camera then re-add it to the project, you must drop the part tools back into the model again.\u003C/p\u003E\u003Cp\u003Eto me, it\u0027s efficient to just let it sit in the camera view because it allows you to 1) not have to keep dragging and dropping it onto individual models 2) use it with any model you have in the main camera. Of course, It would probably be just as easy to create a new blank hierarchy object named \u0022part tools\u0022 and use it from there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T12:47:04Z\u0022 title=\u002204/20/2013 12:47  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-04-20T20:20:13Z","Content":"\n\u003Cp\u003ESince this tutorial is much better than the one I did, I\u0027ve changed the thread I had over into a modding-info collection point of sorts, and I\u0027ve put a link to this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25013\u0022 rel=\u0022external nofollow\u0022\u003Eover there\u003C/a\u003E. Whether people will use my thread I have no idea, at the very least I will.\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-04-20T22:17:32Z","Content":"\n\u003Cp\u003EYou don\u0027t explain the diff between convex mesh colliders and normal ones, thats handy.\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-20T22:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022devogen\u0022 data-cite=\u0022devogen\u0022\u003E\u003Cdiv\u003EYou don\u0027t explain the diff between convex mesh colliders and normal ones, thats handy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eit\u0027s not really necessary when the only thing you should set it is convex. it\u0027s one of those settings that doesn\u0027t hurt to be always checked, but can hurt if it isn\u0027t. I can\u0027t think of a reason why if someone even knew the difference, that they would want to use a non convex collider for unity and ksp at all anyways. now that I think about it, it would probably be bad practice for mod makers and users in general if non convex parts started flooding the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T23:22:30Z\u0022 title=\u002204/20/2013 11:22  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-04-20T22:57:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kerbtrek\u0022 data-cite=\u0022kerbtrek\u0022\u003E\u003Cdiv\u003Eit\u0027s not really necessary when the only thing you should set it is convex.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not a steadfast rule for me, Normal colliders can save you the pain of splitting up objects to make multiple convex colliders. I.e a cargo bay. You can\u0027t convex the bay can you? it will cover the opening,\u003C/p\u003E\u003Cp\u003Eso you either make all the walls and sides seperate convex colliders, or simply use a convex base and the rest normal colliders. All convex does for me is ensure things dont fall through it or it\u003C/p\u003E\u003Cp\u003Edoesnt fall through the floor, I use a combination of both. But good tutorial, ill let you carry on. I guess everyone has their own way of doing things.\u003C/p\u003E\u003Cp\u003ELike texturing for example.. you mention \u003C/p\u003E\u003Cp\u003E\u0022Paint your models with textures in your modeling application, using domains for the surfaces you\u0027re painting (UV mapping). The texturing should look exactly how you want it to before you import into Unity.\u003C/p\u003E\u003Cp\u003E\u0022\u003C/p\u003E\u003Cp\u003EDoesn;t really make any sense to me as I do my texturing in a completely different fashion, but I guess thats the beauty of blender and unity, 10 ways to achieve the same result! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-20T23:48:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022devogen\u0022 data-cite=\u0022devogen\u0022\u003E\u003Cdiv\u003EThat\u0027s not a steadfast rule for me, Normal colliders can save you the pain of splitting up objects to make multiple convex colliders. I.e a cargo bay. You can\u0027t convex the bay can you? it will cover the opening,\u003Cp\u003Eso you either make all the walls and sides seperate convex colliders, or simply use a convex base and the rest normal colliders. All convex does for me is ensure things dont fall through it or it\u003C/p\u003E\u003Cp\u003Edoesnt fall through the floor, I use a combination of both. But good tutorial, ill let you carry on. I guess everyone has their own way of doing things.\u003C/p\u003E\u003Cp\u003ELike texturing for example.. you mention \u003C/p\u003E\u003Cp\u003E\u0022Paint your models with textures in your modeling application, using domains for the surfaces you\u0027re painting (UV mapping). The texturing should look exactly how you want it to before you import into Unity.\u003C/p\u003E\u003Cp\u003E\u0022\u003C/p\u003E\u003Cp\u003EDoesn;t really make any sense to me as I do my texturing in a completely different fashion, but I guess thats the beauty of blender and unity, 10 ways to achieve the same result! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see what you mean now. of course this tutorial is meant to familiarize beginners with the unity interface more than anything, and get them started with the basics of transporting models to ksp, basics do\u0027s and don\u0027t, pre-requisites, etc. i wouldn\u0027t really expect a beginner to start off with something like moving cargo bay doors or something that is ok for other meshes to pass through, and there\u0027s plenty of easy access information if they did come across the problem of needing a part to ignore other mesh\u0027s. \u003C/p\u003E\u003Cp\u003Esometimes you gotta try not to get too detailed, for example I didn\u0027t explain the difference between PNG or MBM textures. I wouldn\u0027t consider that a gap, I\u0027d consider that efficiency. sometimes too much info, especially info that may not apply to most usage scenario\u0027s, can confuse and distract the novice with information overload. I know I\u0027ve had frustrations having to sort through information to get to the essential relevant bits. \u003C/p\u003E\u003Cp\u003EI personally don\u0027t use blender, but I\u0027m pretty sure face domains (without the single UV map texture file) are common to all modeling programs. I think there\u0027s really only two main ways to texture. domains are a form of uv mapping, without the actual single map of all the models textures in one file. You select faces to apply a texture to and it just keeps track of the orientation and alignment settings (i.e. parametric, box, cylindrical, etc) of the separate raw texture files, and the faces they apply to. there is no consolidated file with all the textures. typically unity will automatically show an imported model fully textured already if the domain\u0027d textures are included before or when the model is added.\u003C/p\u003E\u003Cp\u003Ethe added benefit of this is that you can change out textures in unity and still have them follow the alignment you set when you saved the model. so maybe something has a gold texture and I want to make it a silver texture, even in unity I can just easily swap them seamlessly rather than having to go back to the modeling program and create an entirely new uv map if I want to change one part of a models texturing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-21T00:12:25Z\u0022 title=\u002204/21/2013 12:12  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 21, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-04-20T23:51:47Z","Content":"\n\u003Cp\u003EI think what devo was referring to was that you said:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EPaint your models with textures in your modeling application\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can do it that way, or create the texture in an external program and then import that later.\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-21T00:15:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hoojiwana\u0022 data-cite=\u0022hoojiwana\u0022\u003E\u003Cdiv\u003EI think what devo was referring to was that you said:\u003Cp\u003EYou can do it that way, or create the texture in an external program and then import that later.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eah well that would be a simple re-wording fix. I just didn\u0027t want to give the impression that you can just import a blank model and expect to texture it properly from the ground up in unity, which is something I could see a novice attempting. \u003C/p\u003E\u003Cp\u003E personally, my modeler has robust UV mapping tools built-in. pretty sure blender does too. never saw the need for programs like uvmapper pro, little too old school \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-21T00:31:42Z\u0022 title=\u002204/21/2013 12:31  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 21, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ghost010","CreatedById":57302,"CreatedDateTime":"2013-04-21T00:57:11Z","Content":"\n\u003Cp\u003EMay i advice to change the\u0022part tools bit\u0022 as putin it on the main camera,will export the main camera...\u003C/p\u003E\u003Cp\u003Ei discovered this because it didnt export any textures and was done in 0.1 second if not faster.\u003C/p\u003E\u003Cp\u003E(i never put any objects inside the main camera,never should any one do so)\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-21T01:04:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghost010\u0022 data-cite=\u0022ghost010\u0022\u003E\u003Cdiv\u003EMay i advice to change the\u0022part tools bit\u0022 as putin it on the main camera,will export the main camera...\u003Cp\u003Ei discovered this because it didnt export any textures and was done in 0.1 second if not faster.\u003C/p\u003E\u003Cp\u003E(i never put any objects inside the main camera,never should any one do so)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehave never had a problem with it before. as endlesswave said, it\u0027s unlikely they will implement anything in future versions having anything to do with the main camera being a parent.\u003C/p\u003E\u003Cp\u003Eperhaps your issue was because of something else causing a bad model.mu to be produced? can you give me an example of what kind of problem this would cause? all of my released mods have main camera part tools, and they show up fine in the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-21T01:21:47Z\u0022 title=\u002204/21/2013 01:21  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 21, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-04-21T04:56:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kerbtrek\u0022 data-cite=\u0022kerbtrek\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ethe added benefit of this is that you can change out textures in unity and still have them follow the alignment you set when you saved the model. so maybe something has a gold texture and I want to make it a silver texture, even in unity I can just easily swap them seamlessly rather than having to go back to the modeling program and create an entirely new uv map if I want to change one part of a models texturing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I need to change out textures, I do that all in blender not in unity really, by that point everything is done and ready to go in there. All unity is used for for me is to drag and drop the assets onto the model. I never have to create a new UV map in blender for a texture change, that\u0027s where the \u0027replace image\u0027 feature comes i handy for me I guess. The models still follow the alignment of the texture and you can export to unity and simply import a new texture and apply it and it works fine.\u003C/p\u003E\n"},{"CreatedByName":"Zaeo","CreatedById":52597,"CreatedDateTime":"2013-04-21T04:59:15Z","Content":"\n\u003Cp\u003EYou also may want to note in for modules to be called, a \u0022create empty\u0022 with the name of the module is necessary.\u003C/p\u003E\u003Cp\u003EFor example, for a \u0022intake air\u0022 part I am designing, I had to add 4 \u0022empty\u0022 units in the position of the vents, and name them all \u0022Intake\u0022 This is within the GameObject, but on the same level as the model.\u003C/p\u003E\u003Cp\u003EAfter this has been done, KSP will recognize the \u0022intake transform\u0022 and function properly.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = ModuleResourceIntake\u003C/p\u003E\u003Cp\u003E resourceName = IntakeAir\u003C/p\u003E\u003Cp\u003E checkForOxygen = true\u003C/p\u003E\u003Cp\u003E area = 0.002\u003C/p\u003E\u003Cp\u003E intakeSpeed = 10\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E intakeTransformName = Intake\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003ERESOURCE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = IntakeAir\u003C/p\u003E\u003Cp\u003E amount = 0.2\u003C/p\u003E\u003Cp\u003E maxAmount = 0.2\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EYou can name \u0022Intake\u0022 Anything, but it has to be named the same as the one you chose in unity.\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-21T07:56:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022devogen\u0022 data-cite=\u0022devogen\u0022\u003E\u003Cdiv\u003EIf I need to change out textures, I do that all in blender not in unity really, by that point everything is done and ready to go in there. All unity is used for for me is to drag and drop the assets onto the model. I never have to create a new UV map in blender for a texture change, that\u0027s where the \u0027replace image\u0027 feature comes i handy for me I guess. The models still follow the alignment of the texture and you can export to unity and simply import a new texture and apply it and it works fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eok, other than what hooji was saying, what did you mean about texturing differently then?\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-04-21T08:02:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zaeo\u0022 data-cite=\u0022Zaeo\u0022\u003E\u003Cdiv\u003EYou also may want to note in for modules to be called, a \u0022create empty\u0022 with the name of the module is necessary.\u003Cp\u003EFor example, for a \u0022intake air\u0022 part I am designing, I had to add 4 \u0022empty\u0022 units in the position of the vents, and name them all \u0022Intake\u0022 This is within the GameObject, but on the same level as the model.\u003C/p\u003E\u003Cp\u003EAfter this has been done, KSP will recognize the \u0022intake transform\u0022 and function properly.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = ModuleResourceIntake\u003C/p\u003E\u003Cp\u003E resourceName = IntakeAir\u003C/p\u003E\u003Cp\u003E checkForOxygen = true\u003C/p\u003E\u003Cp\u003E area = 0.002\u003C/p\u003E\u003Cp\u003E intakeSpeed = 10\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E intakeTransformName = Intake\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003ERESOURCE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = IntakeAir\u003C/p\u003E\u003Cp\u003E amount = 0.2\u003C/p\u003E\u003Cp\u003E maxAmount = 0.2\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EYou can name \u0022Intake\u0022 Anything, but it has to be named the same as the one you chose in unity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eit\u0027s good info, but i don\u0027t think it belongs here. that\u0027s not really the scope of the tutorial....it\u0027s not a how to make every part tutorial. if i did that, then i\u0027d have to explain thrust transforms, and ladder boxes, part triggers, orientations, layer 21, tags, etc. the ksp wiki already has pages and pages devoted to that.\u003C/p\u003E\u003Cp\u003Ei however will probably alter to tutorial for the part tools to be put in an empty game object.\u003C/p\u003E\n"},{"CreatedByName":"ummwut","CreatedById":29846,"CreatedDateTime":"2013-04-23T21:07:16Z","Content":"\n\u003Cp\u003EThanks for the post, kerbtrek!\u003C/p\u003E\n"},{"CreatedByName":"ghost010","CreatedById":57302,"CreatedDateTime":"2013-04-25T16:42:43Z","Content":"\n\u003Cp\u003Ewell it exported fine when i added the part tools part to the mesh/object parent.\u003C/p\u003E\u003Cp\u003Ei never make my main camera as a parent.\u003C/p\u003E\u003Cp\u003EIts a workflow principle when using unity.\u003C/p\u003E\u003Cp\u003EMaybe it did not export with the camera because you used the main camera as parent object(putting objects inside main camera).\u003C/p\u003E\n"},{"CreatedByName":"Sardu","CreatedById":58570,"CreatedDateTime":"2013-04-29T08:11:51Z","Content":"\n\u003Cp\u003EAnyone have this working on a mac? When I get the parttools its just a normal zip and when I unzip the file it comes out as a normal folder and I\u0027m not able to get it installed in unity the way this tut has you do it.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-04-29T13:27:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sardu\u0022 data-cite=\u0022Sardu\u0022\u003E\u003Cdiv\u003EAnyone have this working on a mac? When I get the parttools its just a normal zip and when I unzip the file it comes out as a normal folder and I\u0027m not able to get it installed in unity the way this tut has you do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt sounds like your unzip utility is trying to be \u0027helpful\u0027 by doing stuff you didn\u0027t tell it to do and extracting the unitypackage. I would recommend switching to a decent one but if you don\u0027t want to do that then you can probably zip the folder up up and rename it to Partools.unitypackage\u003C/p\u003E\n"},{"CreatedByName":"Sardu","CreatedById":58570,"CreatedDateTime":"2013-04-30T08:54:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EndlessWaves\u0022 data-cite=\u0022EndlessWaves\u0022\u003E\u003Cdiv\u003EIt sounds like your unzip utility is trying to be \u0027helpful\u0027 by doing stuff you didn\u0027t tell it to do and extracting the unitypackage. I would recommend switching to a decent one but if you don\u0027t want to do that then you can probably zip the folder up up and rename it to Partools.unitypackage\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the tip, I downloaded iZip and it was as you said, the default archival app was trying to be \u0022helpful\u0022 thanks again\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-30T08:58:36Z\u0022 title=\u002204/30/2013 08:58  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 30, 2013\u003C/time\u003E by Sardu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-05-08T15:49:09Z","Content":"\n\u003Cp\u003Ebumpy bumpsterton\u003C/p\u003E\n"},{"CreatedByName":"RychschaX","CreatedById":65621,"CreatedDateTime":"2013-05-09T19:03:45Z","Content":"\n\u003Cp\u003EI am having some difficulties with exporting the model and textures for my new part (which is unlikely to ever be published, and is simply to help me master the workflow of developing parts for KSP).\u003C/p\u003E\u003Cp\u003Especifically, my textures refuse to export, and I am unsure as to exactly what I am supposed to do for the collision.\u003C/p\u003E\u003Cp\u003EI appear to have followed all of the required steps for the materials portion of the tutorial, though the tutorial is somewhat unclear as to what folder the textures themselves should be in (the root part folder, or the materials folder). nevertheless, I have applied the texture to the model in the hierarchy, but when i click \u0022write\u0022 in the part tools, it completes instantaneously and creates the parts folder in the project directory. however, there is only the model.mu file and nothing else. Any ideas? I can post a screen cap if you wish (just tell me what you want to be selected).\u003C/p\u003E\u003Cp\u003EI am also a bit confused regarding collision meshes. In accordance with the modeling guide on the wiki, I have my model, as well as a convex mesh I wish to use for collision named \u0022node_collider\u0022. here is what I am confused about: first, there was already a \u0022mesh collider\u0022 in the inspector for my main model. was this supposed to happen (perhaps due to the name of the collision mesh)? second, when selecting the mesh under the mesh collider section of the inspector for my main model, I should choose my node_collider object, correct? also, what should I do to my node_collide object?\u003C/p\u003E\n"}]}