{"TopicId":23132,"ForumId":32,"TopicTitle":"Whats the problem with DLCs?","CreatedByName":"Astronox","CreatedById":58028,"CreatedDateTime":"2013-04-20T17:24:28Z","PageNum":2,"Articles":[{"CreatedByName":"SecondGuessing","CreatedById":62686,"CreatedDateTime":"2013-05-02T14:56:59Z","Content":"\n\u003Cp\u003ESeems to me like you just need to do more research into games before you buy them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd indie developers trying to release DLC rarely works well, and given that KSP hasn\u0027t even been released yet isn\u0027t it a little previous to start discussing DLC?\u003C/p\u003E\n"},{"CreatedByName":"macbernick","CreatedById":57485,"CreatedDateTime":"2013-05-02T15:05:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SecondGuessing\u0022 data-cite=\u0022SecondGuessing\u0022\u003E\u003Cdiv\u003Egiven that KSP hasn\u0027t even been released yet isn\u0027t it a little previous to start discussing DLC?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI totally agree. For a lot of (most ?) games, DLC just mean \u0022we sell you full price an unfinished game, then you will have to pay more to get the whole stuff\u0022. I don\u0027t want that for KSP. As soon as Squad says \u0022ok, KSP is a finished product, let\u0027s see what we do now\u0022, It will be time to see if it deserves DLC or not. For now, finish the game as it is intended to be first.\u003C/p\u003E\n"},{"CreatedByName":"The Betpet","CreatedById":62622,"CreatedDateTime":"2013-05-02T15:08:49Z","Content":"\n\u003Cp\u003EI\u0027m happy to buy DLC that adds to the game but not stuff that could/should have been originally packaged - especially if it helps keep the game alive and allows the developers to continue.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-02T15:24:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003EDLC has a VERY bad name, in part because it is a meaningless term:\u003Cp\u003EWe have the \u0022famous\u0022 DLC of horse armour, pay 1 USD for something a free mod could add... and is comparable to the free content offered by prior games.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not the problem with the horse armour thing, though if I call it was quite a bit more than 1 USD which was why people thought it was overpriced. It certainly wasn\u0027t offered in prior games either. Morrowind didn\u0027t even have rideable creatures (actively I mean). Mods are just unnoficial DLC, with enough method, you could replicate practically any DLC with a free mod. The problem with horse armour, despite not being value for money, is that it was released right away. Therefore, it was already developed before the game\u0027s release and should have been included in the price instead of being an extra cost.\u003C/p\u003E\n"},{"CreatedByName":"Exal","CreatedById":57986,"CreatedDateTime":"2013-05-02T16:42:44Z","Content":"\n\u003Cp\u003EOk I don\u0027t know about anyone else but when I read the game description on steam and on the website before I bought this game. It didnt occur to me that the last part that said all future updates (or whatever) were free was dealing with dlcs. If u are a gamer or at least just a little bit of one and have played alphas before then u know what that statement ment because almost every description if an alpha has something like that in it(maybe not exact words but it was obvious what they ment). What company is going to just give out that kind of profit. I do not think that squad is going to try and cheat us on dlcs anyways, but even if they did I would happily pay for them cause as the op stated we are what supports this game and without us putting money in the game is going to die. And I would happily give donations if I could be pointed in the right direction.\u003C/p\u003E\n"},{"CreatedByName":"SecondGuessing","CreatedById":62686,"CreatedDateTime":"2013-05-02T17:43:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbface\u0022 data-cite=\u0022Kerbface\u0022\u003E\u003Cdiv\u003EThat\u0027s not the problem with the horse armour thing, though if I call it was quite a bit more than 1 USD which was why people thought it was overpriced. It certainly wasn\u0027t offered in prior games either. Morrowind didn\u0027t even have rideable creatures (actively I mean). Mods are just unnoficial DLC, with enough method, you could replicate practically any DLC with a free mod. The problem with horse armour, despite not being value for money, is that it was released right away. Therefore, it was already developed before the game\u0027s release and should have been included in the price instead of being an extra cost.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETypically \u0027day one\u0027 DLC isn\u0027t something that has been produced by the same team as those producing the game: it\u0027s typically an art team and early programmers who have nothing to do in the final few months before release. There\u0027s nothing in theory wrong with day one DLC, although I do miss the days when companies would release free expansion packs. Hell, I miss good ol\u0027 boxed expansion packs.\u003C/p\u003E\n"},{"CreatedByName":"Immortalis Vexx","CreatedById":60391,"CreatedDateTime":"2013-05-02T18:15:18Z","Content":"\n\u003Cp\u003Eo/ throw me in the boat with wanting a donation button on the website....\u003C/p\u003E\u003Cp\u003EThere is a line between what could/should be in a game and where to draw the line for what is in initial release and what is DLC is difficult to define. Personally I think Squad is awesome and I would gladly give them monies for expansion type content. I do not know how to define what this is, but I will gladly throw monies at it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EVexx\u003C/p\u003E\n"},{"CreatedByName":"Fyrem","CreatedById":57131,"CreatedDateTime":"2013-05-02T19:03:19Z","Content":"\n\u003Cp\u003EIMHO: DLC \u0026lt;\u0026gt; Expansions.\u003C/p\u003E\u003Cp\u003EDLC (common interpretation, not exact definition) : Horse armor, hats, blue robes, pets, ... in other words, meaningless crap that in no way effects actual game play)\u003C/p\u003E\u003Cp\u003EExpansions (common interpretation, not exact definition) : Truly new Programing, expanding the program into new areas \u0022additional solar systems\u0022, \u0022Multiplayer\u0022, or examples from other games : \u002B5 levels to level cap \u002Braid bosses, etc.)\u003C/p\u003E\u003Cp\u003EI will pay for Expansions, even if Squad tells me I \u0022get it for free\u0022, because I believe they deserve it.\u003C/p\u003E\u003Cp\u003Eas to paying for DLC, I don\u0027t have to worry about this EVER. From what I understand, Squad never intended to even HAVE pay-for-DLC.\u003C/p\u003E\u003Cp\u003E- I have other things to say on this topic, but due to the Moderators request to keep things civil, I will keep the rest to myself -\u003C/p\u003E\n"},{"CreatedByName":"Fox967","CreatedById":26496,"CreatedDateTime":"2013-05-02T19:08:38Z","Content":"\n\u003Cp\u003ETheres nothing wrong with DLC. Or expansion packs. And anyone who has played a game before knows the difference between free updates and expansion packs, so i don\u0027t see why they would confuse the two.\u003C/p\u003E\u003Cp\u003E The only problem is that people like EA have ruined the concept of DLC and Expansion packs, taking stuff out of the game in order to sell it to us later. This led to people here screaming and losing their tiny minds when Squad said they MAY plan expansion packs and DLC after the main game has been released.\u003C/p\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2013-05-02T19:21:01Z","Content":"\n\u003Cp\u003EI wouldn\u0027t mind DLC that actually add something to the game. Like another planetary system for 10 dollars. Or a celestial editor for 10 dollars.\u003C/p\u003E\n"},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2013-05-02T19:23:15Z","Content":"\n\u003Cp\u003EJust want to get out where I feel the line is with paid-for DLC.\u003C/p\u003E\u003Cp\u003EStar system creator, good.\u003C/p\u003E\u003Cp\u003EA single different star system to the current one, not good.\u003C/p\u003E\u003Cp\u003ENew types gameplay (such as a nice 4X colony management part of the game), good.\u003C/p\u003E\u003Cp\u003EA bunch of base structure parts, not good.\u003C/p\u003E\u003Cp\u003EMultiplayer, good.\u003C/p\u003E\u003Cp\u003EAutomatic Facebook updates, not good.\u003C/p\u003E\u003Cp\u003EPretty sure SQUAD have only ever been thinking on the good side of that line.\u003C/p\u003E\n"},{"CreatedByName":"planetx","CreatedById":57537,"CreatedDateTime":"2013-05-02T19:30:46Z","Content":"\n\u003Cp\u003EKSP is an extremely fun game that I can get lost in for hours on end and actually runs on my laptop. I would not at all mind paying more money to ensure continued development.\u003C/p\u003E\n"},{"CreatedByName":"oggylt","CreatedById":57214,"CreatedDateTime":"2013-05-02T19:34:03Z","Content":"\n\u003Cp\u003Eto keep myself out of topic look at the Fallout New Vegas DLC\u0027s, there are 5 i think.. they ad whole new map bunch of quests and items so DLC for me means Huge update, and for the topic... we have paid for KSP version 1 and no more it is early access to all updates until version 1, maybe ~1.0.1 so that\u0027s where DLC comes in in my humble onion...\u003C/p\u003E\u003Cp\u003EEdit: in this case you may call spaceport mods a DLC\u0027s and squad mods after version 1.0 and expansion packs as they had mentioned in a stream that they will integrate spaceport into the game itself so you could download them on the fly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T19:36:49Z\u0022 title=\u002205/02/2013 07:36  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by oggylt\u003C/strong\u003E\n\u003Cbr\u003Eadditional info\n\u003C/span\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-05-02T19:40:39Z","Content":"\n\u003Cp\u003EPerish the thought of me actually \u003Cem\u003E defending\u003C/em\u003E EA. But consider, I assuming people here are specifically referring to the Javik day one DLC for Mass Effect 3, the game goes gold, the game doesn\u0027t ship that day however, there is some interval between gold and release date, what do artists and game designers do in that interim period? Twiddle their thumbs? No, they start producing more content. Now it happens that they finish a discrete parcel of this post release content, let\u0027s us call it a DLC, but due to the developers hard work and industry the DLC is finished \u003Cem\u003Ebefore\u003C/em\u003E release. What do they do? Sit on it until some arbitrary amount of time needed for decency passes? Release it for free? Do the artist not deserve to be paid for their work? I can sympathize with Bioware\u0027s dilemma here.\u003C/p\u003E\u003Cp\u003EI for one would love to see lots more KSP. But as much as we would like to, we cannot squeeze blood from a stone (metaphorically of course). Similarly we cannot enjoy unlimited content with out paying for it. Squad is not a society of starving ascetics, begging bowls held tremblingly outstretched. They want to provide us an \u003Cem\u003Eawesome service\u003C/em\u003E, and we need to \u003Cstrong\u003E pay for it\u003C/strong\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T19:43:47Z\u0022 title=\u002205/02/2013 07:43  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by architeuthis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thiel","CreatedById":13126,"CreatedDateTime":"2013-05-02T20:03:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naiba\u0022 data-cite=\u0022Naiba\u0022\u003E\u003Cdiv\u003EJust want to get out where I feel the line is with paid-for DLC.\u003Cp\u003EStar system creator, good.\u003C/p\u003E\u003Cp\u003EA single different star system to the current one, not good.\u003C/p\u003E\u003Cp\u003ENew types gameplay (such as a nice 4X colony management part of the game), good.\u003C/p\u003E\u003Cp\u003EA bunch of base structure parts, not good.\u003C/p\u003E\u003Cp\u003EMultiplayer, good.\u003C/p\u003E\u003Cp\u003EAutomatic Facebook updates, not good.\u003C/p\u003E\u003Cp\u003EPretty sure SQUAD have only ever been thinking on the good side of that line.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept for that last one I would actually be okay with all of those. As long as they are priced accordingly.\u003C/p\u003E\u003Cp\u003ESure the \u0022not good\u0022 ones are basically just mods, but they are official mods and guaranteed to work and fit in with the existing parts etc. \u003C/p\u003E\u003Cp\u003EAnd frankly, give the level of work involved in making a planet I\u0027d actually rather pay for a single hand crafted solar system than an editor that would inevitably just shoot out generic billiard balls.\u003C/p\u003E\n"},{"CreatedByName":"Spleenslitta","CreatedById":62191,"CreatedDateTime":"2013-05-02T20:16:14Z","Content":"\n\u003Cp\u003EI would pay in order to keep the game alive. Imagine what it would be like if they made a career mode with a few more parts and then ran out of money.\u003C/p\u003E\u003Cp\u003EThen they would have to stop doing anything besides bugsquashing and eventually even that would stop.\u003C/p\u003E\u003Cp\u003ENow that would be a real tragedy. They might be able to make a new game we for us to enjoy then but will it get anywhere near KSP?\u003C/p\u003E\u003Cp\u003EWith all due respect Squad....that would take three quarters proportions of a miracle because KSP is the best game released for the last 2-3 years when you look at how many hours you get for your money.\u003C/p\u003E\u003Cp\u003EThat ain\u0027t some random praise either....i mean it.\u003C/p\u003E\n"},{"CreatedByName":"Xellith","CreatedById":35053,"CreatedDateTime":"2013-05-02T20:19:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022architeuthis\u0022 data-cite=\u0022architeuthis\u0022\u003E\u003Cdiv\u003EPerish the thought of me actually \u003Cem\u003E defending\u003C/em\u003E EA. But consider, I assuming people here are specifically referring to the Javik day one DLC for Mass Effect 3, the game goes gold, the game doesn\u0027t ship that day however, there is some interval between gold and release date, what do artists and game designers do in that interim period? Twiddle their thumbs? No, they start producing more content. Now it happens that they finish a discrete parcel of this post release content, let\u0027s us call it a DLC, but due to the developers hard work and industry the DLC is finished \u003Cem\u003Ebefore\u003C/em\u003E release. What do they do? Sit on it until some arbitrary amount of time needed for decency passes? Release it for free? Do the artist not deserve to be paid for their work? I can sympathize with Bioware\u0027s dilemma here.\u003Cp\u003EI for one would love to see lots more KSP. But as much as we would like to, we cannot squeeze blood from a stone (metaphorically of course). Similarly we cannot enjoy unlimited content with out paying for it. Squad is not a society of starving ascetics, begging bowls held tremblingly outstretched. They want to provide us an \u003Cem\u003Eawesome service\u003C/em\u003E, and we need to \u003Cstrong\u003E pay for it\u003C/strong\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow about releasing it for free but still paying the people that worked on it?\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-05-02T20:24:25Z","Content":"\n\u003Cp\u003EIf it\u0027s done right, i\u0027m OK with it.\u003C/p\u003E\u003Cp\u003EBut really, I\u0027d pay $100 for the base game!\u003C/p\u003E\n"},{"CreatedByName":"lobsterbark","CreatedById":57253,"CreatedDateTime":"2013-05-02T20:32:13Z","Content":"\n\u003Cp\u003EWell, I disagree with some of the games you said you wasted money on,( I liked RO2, definitely worth the 5 bucks. It wasn\u0027t even remotely like COD.) but all the rest is true. Hopefully Squad never reaches that critical mass that makes it continually put out ****ty games, that somehow, people manage to enjoy.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-05-02T20:33:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003EIf it\u0027s done right, i\u0027m OK with it.\u003Cp\u003EBut really, I\u0027d pay $100 for the base game!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThankfully KSP won\u0027t be that much, I will guess a final price of $25 to $30, but that \u003Cem\u003Eis\u003C/em\u003E just my guess.\u003C/p\u003E\u003Cp\u003EThe expansions will be much more than a few parts, they will be more like whole new gameplay elements such as base management or terraforming, but again, the actual expansions are unknown.\u003C/p\u003E\u003Cp\u003ESquad know that anything they make after KSP is complete will have to compete with what the addon community are able to produce, and they can make some \u003Cem\u003Every\u003C/em\u003E impressive stuff, so whatever we eventually see in the expansions will have to be stuff that can\u0027t be added through the parts and plugin system.\u003C/p\u003E\u003Cp\u003EThey will most likely be core changes to the code \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-02T20:58:41Z","Content":"\n\u003Cp\u003EI think that whole DLC/Expansions debate is very premature - this game aren\u0027t made yet and people talking about sequels/add-ons (!?).\u003C/p\u003E\u003Cp\u003EFortunately, KSP will be finished product at some point (unlike few other indie games, witch completion ETA is similar to medieval cathedrals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E) and I\u0027m very glad of that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EIf hypothetically expansion would came in future, I would expect rather, new project - \u0022KSP II\u0022 priced like the separate game (and I will be willing to pay $$) with new features and improvements of old ones, not just small pack of parts or such ,especially with still increasing amount of parts and plug-ins made by community.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T21:06:24Z\u0022 title=\u002205/02/2013 09:06  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hasegawa","CreatedById":317,"CreatedDateTime":"2013-05-03T10:10:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SecondGuessing\u0022 data-cite=\u0022SecondGuessing\u0022\u003E\u003Cdiv\u003ESeems to me like you just need to do more research into games before you buy them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003Cp\u003EAnd indie developers trying to release DLC rarely works well, and given that KSP hasn\u0027t even been released yet isn\u0027t it a little previous to start discussing DLC?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EI think that whole DLC/Expansions debate is very premature - this game aren\u0027t made yet and people talking about sequels/add-ons (!?).\u003Cp\u003EFortunately, KSP will be finished product at some point (unlike few other indie games, witch completion ETA is similar to medieval cathedrals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E) and I\u0027m very glad of that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhen will the game be complete then? Because there are a lot of features a space game like this could implement.\u003Cp\u003EPersonally, I feel it can be considered complete when it fulfills it\u0027s scope--even if it leaves out interesting mechanics that aren\u0027t quite in the planned scope. Those would be suitable fodder for expansions, to me.\u003C/p\u003E\u003Cp\u003EI was watching the live stream when Harvester said the comments that kicked off the whole \u0027DLC panic\u0027. And while they made me sad (because they mentioned a feature I want as being a potential for being out-of-scope), I recognized the point, that they\u0027d neglected a core feature of the game in, career mode, whilst they were starting work on less core features like in-situ resource utilization. And not being able to post in the chat that I understood, unlike the people who were chanting \u0022No DLC, No DLC!\u0022, was deeply frustrating.\u003C/p\u003E\u003Cp\u003EAnd that prehaps we need to refresh our minds on what KSP\u0027s scope actually is, as stated \u003Ca href=\u0022https://www.kerbalspaceprogram.com/about.php\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EIf hypothetically expansion would came in future, I would expect rather, new project - \u0022KSP II\u0022 priced like the separate game (and I will be willing to pay $$) with new features and improvements of old ones, not just small pack of parts or such ,especially with still increasing amount of parts and plug-ins made by community.\u003C/div\u003E\u003C/blockquote\u003EIndeed. I expect SQUAD to do nothing less if they end up releasing an expansion, or KSP II. Both because of their comments on DRM and my experience of them since version 0.8\n"},{"CreatedByName":"erkha343","CreatedById":1957,"CreatedDateTime":"2013-05-03T10:31:39Z","Content":"\n\u003Cp\u003EI wish that .20 would have been the aerodynamic update, and then career and more polishing in .21. And left resources as an expansion pack.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-03T10:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EI think that whole DLC/Expansions debate is very premature - this game aren\u0027t made yet and people talking about sequels/add-ons (!?).\u003Cp\u003EFortunately, KSP will be finished product at some point (unlike few other indie games, witch completion ETA is similar to medieval cathedrals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E) and I\u0027m very glad of that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EIf hypothetically expansion would came in future, I would expect rather, new project - \u0022KSP II\u0022 priced like the separate game (and I will be willing to pay $$) with new features and improvements of old ones, not just small pack of parts or such ,especially with still increasing amount of parts and plug-ins made by community.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThink this is part of the problem, at the game is not done some people suspect Squad will cut the game in two. \u003C/p\u003E\u003Cp\u003ESay we get resources, reentry heat and an good drag models, an new gas giant with moons and some extra planets and asteroids. Career mod and plenty of other features and cosmetic updates. Everybody is happy.\u003C/p\u003E\u003Cp\u003EHowever three months later they release an expansion who let you go interstellar and explore other solar systems. Many will think that this was cut from the base game and it would be hard to prove its not. \u003C/p\u003E\u003Cp\u003EIts not like the dawnguard for skyrim who is not related to the rest of the game, in an sandbox game that is pretty much impossible unlike you make another game.\u003C/p\u003E\n"},{"CreatedByName":"Shuttle","CreatedById":5225,"CreatedDateTime":"2013-05-03T12:06:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EThe expansions will be much more than a few parts, they will be more like whole new gameplay elements such as base management or terraforming, but again, the actual expansions are unknown.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt seems to be a good decision! I personally want to see engine construction in KSP. Now we can only increase the payload by adding more fuel tank/engines to the rocket but imagine how interesting it would be to construct a powerful rocket engine!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EIf hypothetically expansion would came in future, I would expect rather, new project - \u0022KSP II\u0022 priced like the separate game (and I will be willing to pay $$) with new features and improvements of old ones, not just small pack of parts or such ,especially with still increasing amount of parts and plug-ins made by community.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP2 with new physical engine and graphics like this: \u003Ca href=\u0022http://i.imgur.com/RaGb3Ke.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/RaGb3Ke.jpg\u003C/a\u003E I can\u0027t wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}