{"TopicId":23152,"ForumId":44,"TopicTitle":"Internet Catastrophes, Then and Now","CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-04-20T18:46:16Z","PageNum":1,"Articles":[{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-04-20T18:46:16Z","Content":"\n\u003Cp\u003ESome of you (like me) have survived the April 2013 Internet Forum Catastrophe (as in, your account didn\u0027t got deleted, regardless of the loss of threads and posts). I was wondering how could the catastrophe be possible, by hackers, maybe? Or by viruses?\u003C/p\u003E\u003Cp\u003EThis thread is pretty much discussing about the internet catastrophes, like the October 2006 Panda Virus Pandemic (It\u0027s an internet catastrophe!), which spread through China\u0027s internet, hacking and damaging softwares. The pandemic came to an end in January 2007, when someone named Li Jun and his accomplices were captured and taken to custody. Discuss the internet catastrophes and relate them to now.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E(Not sure this is the right forum. Should this be in Off-Topic or the Science Lab?) (multiple choice question)\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-22T23:01:34Z\u0022 title=\u002204/22/2013 11:01  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 22, 2013\u003C/time\u003E by Designer225\u003C/strong\u003E\n\u003Cbr\u003EGrammar\n\u003C/span\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-20T21:18:45Z","Content":"\n\u003Cp\u003EThe most serious one I can think of instantly is the Melissa worm.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-04-21T20:32:16Z","Content":"\n\u003Cp\u003EIn this instance, it was a wider attack on a large group of webpages across the net. That said, the hacking group Anonymous is attempting, they said, to cripple all of the internet to protest... something... I can\u0027t seem to remember what it was.\u003C/p\u003E\u003Cp\u003EI always wondered what type of enjoyment hackers and virus creators \u003Cstrong\u003Eget out\u003C/strong\u003E of their hobby. Unlike other troll-centric or malicious activities, hackers and virus makers\u003Cstrong\u003E never\u003C/strong\u003E get to see the surprised/depressed/angry faces of their victims. They never get to hear the conversations made about their hours of hard work. Really, it seems to me like these guys spend countless hours every day writing malicious code or attacking countless websites to never see what happens next. Sure, a hacker can go to a website they brought down and see a big \u0022ERROR\u0022 message pop up - but is that really gratification? They could just as easily see that same message by typing in a web address that doesn\u0027t exist. It\u0027s surely not rewarding in any way for hours of hard work. I\u0027ll never understand this breed of people, and personally, I view them in the same category as thugs and criminals who have no idea what empathy, altruism, or being human really means.\u003C/p\u003E\u003Cp\u003EAs an aside, my account got nuked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Too lazy to rebuild my old signature/avatar. Going to stay empty. \u003C/p\u003E\u003Cp\u003E/end rant\u003C/p\u003E\n"},{"CreatedByName":"lump","CreatedById":30092,"CreatedDateTime":"2013-04-21T22:46:38Z","Content":"\n\u003Cp\u003Eyo e honest when it comes to hackers i think its the feeling off releasing something ad waiting to see what becomes of it, like gossip.\u003C/p\u003E\u003Cp\u003Eon a semi related note i was thigh of creating a website where hackers ad virus creates test their abilities, both create a non damaging virus that pigs its location back to you, the virus creaters see whose spreads the most or the farthest, gives them something to do that isn\u0027t ruing our lives ad they might meet friends who share their passio\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-22T06:03:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022westair\u0022 data-cite=\u0022westair\u0022\u003E\u003Cdiv\u003EIn this instance, it was a wider attack on a large group of webpages across the net. That said, the hacking group Anonymous is attempting, they said, to cripple all of the internet to protest... something... I can\u0027t seem to remember what it was.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was an argument with a webhost provider, so it was probably targeted at them. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022westair\u0022 data-cite=\u0022westair\u0022\u003E\u003Cdiv\u003EI always wondered what type of enjoyment hackers and virus creators \u003Cstrong\u003Eget out\u003C/strong\u003E of their hobby. Unlike other troll-centric or malicious activities, hackers and virus makers\u003Cstrong\u003E never\u003C/strong\u003E get to see the surprised/depressed/angry faces of their victims. They never get to hear the conversations made about their hours of hard work. Really, it seems to me like these guys spend countless hours every day writing malicious code or attacking countless websites to never see what happens next.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s called the online aspergers syndrome. The regular aspergers syndrome means that the sufferer cannot understand the current body language of another person, leading them to occasionally do something weird or hurtful, without them knowing it was weird or hurtful, because they have no way of knowing. The variant is exactly the same. People online do not know what the other person is feeling. Right now, I don\u0027t know if you are ecstatic or in misery because you haven\u0027t told me. It especially applies to trolls, as they don\u0027t know how far they are going, so they don\u0027t know when to stop. This applies to anyone on the internet.\u003C/p\u003E\n"},{"CreatedByName":"EchoLima","CreatedById":61992,"CreatedDateTime":"2013-06-21T18:19:40Z","Content":"\n\u003Cp\u003EI lost my account\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-06-21T18:29:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ROFLCopter64bit\u0022 data-cite=\u0022ROFLCopter64bit\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s called the online aspergers syndrome. The regular aspergers syndrome means that the sufferer cannot understand the current body language of another person, leading them to occasionally do something weird or hurtful, without them knowing it was weird or hurtful, because they have no way of knowing. The variant is exactly the same. People online do not know what the other person is feeling. Right now, I don\u0027t know if you are ecstatic or in misery because you haven\u0027t told me. It especially applies to trolls, as they don\u0027t know how far they are going, so they don\u0027t know when to stop. This applies to anyone on the internet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a very broad stereotype you have made. From what you are saying, it could be argued that all bomber pilots have Asperger\u0027s syndrome, since they do not know the misery and anguish of the people they hurt/kill. Hackers simply like the challenge of getting into someones things. It\u0027s like pickpocketing, you might never see the victims\u0027 reaction, and you don\u0027t care, you\u0027ve got money, and the satisfaction that you got into somebodies pocket, and stole their wallet without anyone seeing.\u003C/p\u003E\n"},{"CreatedByName":"GJames","CreatedById":58866,"CreatedDateTime":"2013-06-21T19:11:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003E It\u0027s like pickpocketing, you might never see the victims\u0027 reaction, and you don\u0027t care, you\u0027ve got money, and the satisfaction that you got into somebodies pocket, and stole their wallet without anyone seeing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut with pick pocketing you have a result, a reward if you will. Most hackers seem to attack websites or networks simply to see if they can, only a few have goals of stealing data or money.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-06-21T19:14:09Z","Content":"\n\u003Cp\u003EComcast and TWC are Internet catastrophies.\u003C/p\u003E\n"},{"CreatedByName":"Razor235","CreatedById":16436,"CreatedDateTime":"2013-06-21T22:22:50Z","Content":"\n\u003Cp\u003ESome hackers (like Kevin Mitnick) just do it for the thrill. Heck, Mitnick never took anything, he was just in it for the exhilaration of getting past security systems, both in cyber- and meatspace.\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-06-22T20:21:27Z","Content":"\n\u003Cp\u003EThere are also hackers hacking for a good cause. (like finding a bloophole of a software or a system)\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2013-06-23T01:03:32Z","Content":"\n\u003Cp\u003EThe first one I remember is the 2000 \u0022ILOVEYOU\u0022 virus that was a pic/text file attached to emails. Got everyone scared off the internet and appeared on the news every week.\u003C/p\u003E\u003Cp\u003EWikipedia: To protect themselves, The Pentagon, CIA, the British Parliament and most large corporations decided to completely shut down their mail systems.This virus affected over 45 million computers and was one of the world\u0027s most dangerous computer related disasters.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-23T01:05:46Z\u0022 title=\u002206/23/2013 01:05  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 23, 2013\u003C/time\u003E by deadshot462\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-06-25T02:44:52Z","Content":"\n\u003Cp\u003EI (being a Playstation user) remeber a 6 month outage of Playstation Network after a group of hackers hacked it. Good guy Sony gave all PSN users free games/dlc as an \u0022apology\u0022 for the incident. I belive Anonymous preformed the attack.\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-06-25T19:19:34Z","Content":"\n\u003Cp\u003EWhat about the mid 2008 ish SpamHaus DDoS that shut down most of Europe\u0027s Internet for 3 hours\u003C/p\u003E\n"},{"CreatedByName":"Jones-250","CreatedById":24123,"CreatedDateTime":"2013-07-04T11:55:52Z","Content":"\n\u003Cp\u003EHere, have some memories: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24901-Memories-from-before-the-Purge\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24901-Memories-from-before-the-Purge\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-17T02:35:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bioman222\u0022 data-cite=\u0022Bioman222\u0022\u003E\u003Cdiv\u003EI (being a Playstation user) remeber a 6 month outage of Playstation Network after a group of hackers hacked it. Good guy Sony gave all PSN users free games/dlc as an \u0022apology\u0022 for the incident. I belive Anonymous preformed the attack.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, a hacker group called \u0022LulzSec\u0022 did it.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-07-17T03:20:53Z","Content":"\n\u003Cp\u003ESome attacks are for the thrill, some for ideological reasons but there are quite a large number that are just fishing for access to valuable data.\u003C/p\u003E\u003Cp\u003EDDoS became a tool for blackmail for a while, no clue how successful it was but I assume it worked or it wouldn\u0027t have happened so often.\u003C/p\u003E\u003Cp\u003EMost virus payloads these days are aimed at either zombifying a machine, gathering bank details, personal details, passwords or proprietary information. \u003C/p\u003E\u003Cp\u003EIt\u0027s all about the money. That or sabotaging centrifuges.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-17T03:23:01Z\u0022 title=\u002207/17/2013 03:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 17, 2013\u003C/time\u003E by falofonos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-07-17T03:57:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GJames\u0022 data-cite=\u0022GJames\u0022\u003E\u003Cdiv\u003EBut with pick pocketing you have a result, a reward if you will. Most hackers seem to attack websites or networks simply to see if they can, only a few have goals of stealing data or money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust as in my pickpocketing analogy, the person doing the crime is satisfied with the fact that they succeeded.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-07-17T05:05:05Z","Content":"\n\u003Cp\u003EBe nice if one of the devs was a white collar hacker. For those of you that haven\u0027t herd of them (anyone) they hack into systems to find out where they are weakest. Take the movie \u0022Shooter\u0022 as an example.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-07-17T08:53:45Z","Content":"\n\u003Cp\u003Emost serious internet catastrophe was the say AOL went life.\u003C/p\u003E\n"}]}