{"TopicId":23241,"ForumId":34,"TopicTitle":"[0.22] B9 Aerospace Pack / R4.0c / New pods, IVAs, engines, fuselages \u0026amp; structures","CreatedByName":"bac9","CreatedById":57757,"CreatedDateTime":"2013-04-21T03:07:12Z","PageNum":58,"Articles":[{"CreatedByName":"Subcidal","CreatedById":20751,"CreatedDateTime":"2013-06-04T03:54:30Z","Content":"\n\u003Cp\u003ESo you don\u0027t have to do anything at all for FAR compatability? I LOVE how easy modding KSP is starting to become.\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2013-06-04T04:16:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jeff_9219\u0022 data-cite=\u0022jeff_9219\u0022\u003E\u003Cdiv\u003EYeah as said previously ModuleManager an Exsurgent Engineer Conflict, (in fact any modulemanager mod will have issues) If you don\u0027t mind giving up the thrust vectored jet and the Sabres, you can (but not suggested) remove Exsurgent Engineer) or very time consuming you can remove module manager and hand merge the config files (took me an hour or so))\u003Cp\u003EI think the Module Manager author said something about fixing EE but I haven\u0027t seen further\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, removing ExsurgentEngineering.dll will cause the SABRE M to not work? Or will removing it cause it to work? I don\u0027t have anything that uses Exsurgent Engineering, so I\u0027m leaning towards deleting the plugin, but just the same, what\u0027s the fix for the part files?\u003C/p\u003E\n"},{"CreatedByName":"Digestif","CreatedById":60376,"CreatedDateTime":"2013-06-04T06:00:34Z","Content":"\n\u003Cp\u003EWith the help of this pack, I built a \u003Ca href=\u0022http://i.imgur.com/PZvWAeE.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESpace-Diner\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-04T06:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Digestif\u0022 data-cite=\u0022Digestif\u0022\u003E\u003Cdiv\u003EWith the help of this pack, I built a \u003Ca href=\u0022http://i.imgur.com/PZvWAeE.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESpace-Diner\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eummm...WOW!\u003C/p\u003E\u003Cp\u003Ekinda off the wall use of part, but that\u0027s amazing and very well done sir!\u003C/p\u003E\u003Cp\u003Ealso what kinda food they got there?...I could go for some chicken strips n gravy..\u003C/p\u003E\n"},{"CreatedByName":"not-a-cylon","CreatedById":63398,"CreatedDateTime":"2013-06-04T06:17:27Z","Content":"\n\u003Cp\u003EIs there any way to make the Aerobrakes behave like a control surface either through part.cfg tweaking or keybinding wizardry? ie, when I press yaw left, the aerobrakes on the right side will engage as long as I am yawing left. combined with the awesome smarter thrust vectoring in the pack, I would be able to make an extremely maneuverable craft.\u003C/p\u003E\u003Cp\u003EThanks for the great mod!\u003C/p\u003E\n"},{"CreatedByName":"Digestif","CreatedById":60376,"CreatedDateTime":"2013-06-04T06:23:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003Eummm...WOW!\u003Cp\u003Ekinda off the wall use of part, but that\u0027s amazing and very well done sir!\u003C/p\u003E\u003Cp\u003Ealso what kinda food they got there?...I could go for some chicken strips n gravy..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I\u0027m sad to say the Diner might be the fastest there is, but it simply lacks atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"EnterElysium","CreatedById":61981,"CreatedDateTime":"2013-06-04T10:20:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bac9\u0022 data-cite=\u0022bac9\u0022\u003E\u003Cdiv\u003EFor n-th time, KSP is a 32-bit executable and whether you have 8 or 128 Gb RAM makes zero difference. It can\u0027t use more than 4gb. You also won\u0027t free much memory by getting rid of B9. Try removing KW Rocketry instead, which is five times bigger (400mb vs 73mb).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t worry, I\u0027m in act fully aware KSP is a 32bit exe, I just mentioned that because every time someone mentions load/performance issues the default response from people seems to have been to blame lack of ram etc.\u003C/p\u003E\u003Cp\u003EIt does seem to be keeling over much much less now, however I suspect there may have been some system instability on that load for some bizarre reason... my folders renamed themselves on next load. I might try and re-introducing and test to see if it was just a dodgy boot. 400mb for KW? Jesus. I hope that gets nailed with the new method asap, I\u0027d quite enjoy not being able to spend the entire loading screen cooking half my food for the week in the kitchen...\u003C/p\u003E\n"},{"CreatedByName":"Alguien","CreatedById":1623,"CreatedDateTime":"2013-06-04T11:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Huelander\u0022 data-cite=\u0022Huelander\u0022\u003E\u003Cdiv\u003ESomething seem wrong with the flow value in those \u0022RBM Variable Geometry Intake\u0022, the flow value is around 10 times as much as any other similar sized intake, bug or intended?\u003Cp\u003E-pic-\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Etaking into account they have 40 times the mass of the vainilla intake i assume is intended\u003C/p\u003E\n"},{"CreatedByName":"moxzot","CreatedById":25497,"CreatedDateTime":"2013-06-04T12:24:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Firov\u0022 data-cite=\u0022Firov\u0022\u003E\u003Cdiv\u003EI hate to admit it, since I\u0027m finding them so useful, but these intakes do seem... well, for lack of a better word, overpowered. A single intake can power the low-bypass non-thrust vectoring turbojet engine up to between 25 to 30k at ~mach 4 before I have to start thinking about cutting the engines. For a single intake, that might be a bit much. It\u0027s nice, since I don\u0027t have to stack intakes or anything like that, but still... \u003Cp\u003EOh, also, I\u0027m running FAR. Taverius, are they supposed to be this effective? Your own mod hardly goes out of its way to make things easier, so I have to assume there\u0027s a reason for this. If there is, I\u0027d be interested to know what it is. If it\u0027s realistic, then I\u0027ll accept it as the order of things.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewell if you guys havent noticed it controls air flow automatically at higher atmosphere it starts to close it just takes the jet engines a bit longer to spool down so they still provide a little thrust but they only really work between 0-20k after that your plane just skips in the atmosphere cause 2 much lift something like that, the only reason you think its overpowered is because you cant control your airflow like the mod intake can\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-06-04T13:10:26Z","Content":"\n\u003Cp\u003EI felt like sharing this. It\u0027s ID is C-Corp EX-3350, or company-known as the \u0022Mogul\u0022. Came around as a variation of my crew-transport SSTO, the C-Corp EX-2400, aka \u0022Phoenix\u0022, after I realized my space station needed docking port adapters for FusTek CBMs to stock ports... It\u0027s now become my workhorse SSTO capable of lifting quite a bit, with it\u0027s excessive TWR (6.85 with no cargo). At least until the C-Corp EX-9000 \u0022Gatsby\u0022 gets finished, which would be for larger payloads.\u003C/p\u003E\u003Cp\u003EUses mostly B9 parts for it\u0027s frame and fuselage, though orbital engines are from KW rocketry, while the atmospherics are C-Corp\u0027s own Wraith MkII, which currently use stock models. There\u0027s other parts here and there from other mods I use, like TT\u0027s Modular MultiWheels, Romfarer\u0027s Lazors, etc... \u003C/p\u003E\u003Cp\u003EFirst flight of the \u0022Mogul\u0022. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://fc05.deviantart.net/fs71/f/2013/155/b/3/c_corp_mogul_by_akutou-d67rsgl.jpg\u0022 alt=\u0022c_corp_mogul_by_akutou-d67rsgl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://fc09.deviantart.net/fs71/f/2013/155/e/b/mogul_open_by_akutou-d67rsgn.jpg\u0022 alt=\u0022mogul_open_by_akutou-d67rsgn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E Unfortunately, shortly after meeting up with the new Hades Station, the pilots discovered that the High-Versatility Tug (the one with the extra ports) had become stuck inside the cargo bay and there was no way of getting it out. Therefore Mission Control determined the rest of the objectives a no-go and directed the crew of the \u0022Mogul\u0022 to head back to KSC. All members of the engineering team were given looks of dis-contempt and were sent on a \u0022Attaching Things Properly 101\u0022 seminar.\u003C/p\u003E\u003Cp\u003EEnzon and Munfry (wat?) Kerman in front of the \u0022Mogul\u0022 before it\u0027s second mission take off.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://fc08.deviantart.net/fs71/i/2013/155/8/1/2013_06_04_00003_by_akutou-d67rto0.jpg\u0022 alt=\u00222013_06_04_00003_by_akutou-d67rto0.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"isador","CreatedById":35526,"CreatedDateTime":"2013-06-04T13:53:42Z","Content":"\n\u003Cp\u003EWhat landing gears are you using? I\u0027ve never seen these one before, looks nice.\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-06-04T14:06:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022isador\u0022 data-cite=\u0022isador\u0022\u003E\u003Cdiv\u003EWhat landing gears are you using? I\u0027ve never seen these one before, looks nice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re from TT\u0027s Modular MultiWheels.\u003C/p\u003E\u003Cp\u003EP.S: To the devs of B9, there appears to be some weirdness with the shielded docking port... Whenever I try to deploy it, all parts round it start jumping around all crazy like. It gets deployed and everything comes back in place (most of the times, mostly), but only with Unbreakable Joints on, you don\u0027t wanna know what happens if it\u0027s off... Suffice it to say, Munfry won\u0027t be going to the Mun any time soon...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T14:11:12Z\u0022 title=\u002206/04/2013 02:11  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by BananaDealer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Quorthon","CreatedById":25181,"CreatedDateTime":"2013-06-04T14:20:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BananaDealer\u0022 data-cite=\u0022BananaDealer\u0022\u003E\u003Cdiv\u003ETo the devs of B9, there appears to be some weirdness with the shielded docking port... Whenever I try to deploy it, all parts round it start jumping around all crazy like. It gets deployed and everything comes back in place (most of the times, mostly), but only with Unbreakable Joints on, you don\u0027t wanna know what happens if it\u0027s off... Suffice it to say, Munfry won\u0027t be going to the Mun any time soon...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was experiencing the same. Then I discovered that the RCS tanks were in the way of the port doors.\u003C/p\u003E\u003Cp\u003EFrom your screenshot above I see that you designed it the same way.\u003C/p\u003E\u003Cp\u003EPlace your RCS tanks somewhere else and there wont be any more selfdisassembly. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-06-04T15:06:15Z","Content":"\n\u003Cp\u003EI\u0027ve been having a bit of an issue and I\u0027m not sure what to pin it on.\u003C/p\u003E\u003Cp\u003EI installed B9 and before that I\u0027ve been using an updated version of KSPX and the Tri-Hexagonal struts pack.\u003C/p\u003E\u003Cp\u003EI ended up removing quite a few B9 parts (including those belonging to every fuselage form factor other than S2 and S2 wide) because A) stability issues, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E because thats a whole lot more parts than I\u0027ll ever use\u003C/p\u003E\u003Cp\u003EAnyway, after that, everything seemed to run fine, until I brought my Super Heavy Lander in close to the Mun. Now, whenever I try to fly that one particular ship, or any craft close to it, the game crashes. I\u0027m only having this issue when the B9 parts are installed.\u003C/p\u003E\u003Cp\u003EAdmittedly though, its somewhat of a high part count craft\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/594753342792985158/27587DC6031EDD429A9098E08D57F4A8C6DD29E9/\u0022 alt=\u002227587DC6031EDD429A9098E08D57F4A8C6DD29E9\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/594753342792991374/7895884369188EA50786255A27546074FCE72008/\u0022 alt=\u00227895884369188EA50786255A27546074FCE72008\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I don\u0027t think thats the issue\u003C/p\u003E\n"},{"CreatedByName":"Mantis Toboggan","CreatedById":61379,"CreatedDateTime":"2013-06-04T15:13:02Z","Content":"\n\u003Cp\u003EWill we be seeing more rocket/space oriented parts next time rather than SSTO planes and jets?\u003C/p\u003E\n"},{"CreatedByName":"viperwolf","CreatedById":66190,"CreatedDateTime":"2013-06-04T16:06:36Z","Content":"\n\u003Cp\u003EOK i have a easy question for you guys. I noticed when using the prebuilt planes, ( using the A \u0026amp; D Keys )the ailerons,elevators work with the rudders. How are they doing this? I searched in the control area .And is there way to keep the Ailerons,rudders,elevators and flaps from going spastic with ASAS on? thanks for your help\u003C/p\u003E\u003Cp\u003E ((((((((((((( palihog ))))))))))))\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T18:11:14Z\u0022 title=\u002206/04/2013 06:11  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by viperwolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Digestif","CreatedById":60376,"CreatedDateTime":"2013-06-04T16:15:47Z","Content":"\n\u003Cp\u003EThe \u003Ca href=\u0022http://imgur.com/a/DnCPO\u0022 rel=\u0022external nofollow\u0022\u003EX-Wing\u003C/a\u003E, fully LKO capable.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-06-04T16:18:44Z","Content":"\n\u003Cp\u003EDigestif- post the craft file.\u003C/p\u003E\n"},{"CreatedByName":"Digestif","CreatedById":60376,"CreatedDateTime":"2013-06-04T16:22:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mekan1k\u0022 data-cite=\u0022Mekan1k\u0022\u003E\u003Cdiv\u003EDigestif- post the craft file.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry not to \u003Ca href=\u0022http://pastebin.com/RRpddHdu\u0022 rel=\u0022external nofollow\u0022\u003Ebreak\u003C/a\u003E it too often. It flies like a barn.\u003C/p\u003E\n"},{"CreatedByName":"bac9","CreatedById":57757,"CreatedDateTime":"2013-06-04T16:41:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unikraken\u0022 data-cite=\u0022Unikraken\u0022\u003E\u003Cdiv\u003EAre there plans to do any rocket stuff next? Like Orion type command pods or anything like that?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, not anytime soon.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Castun\u0022 data-cite=\u0022Castun\u0022\u003E\u003Cdiv\u003EAre the VTOL engines meant to be manually vectored at all? Was a little confused how you\u0027re supposed to control them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReading info popup on example VTOL that was included with the pack might help. Action groups.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00229911MU51C\u0022 data-cite=\u00229911MU51C\u0022\u003E\u003Cdiv\u003Ethink you could break this up into separate packs, I\u0027m here for the spaceplane parts and even when optimized, I don\u0027t think my computer can handle 170 new parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it will never be split into several mods since that would be a support and maintenance nightmare. Also, amount of parts has no relation to performance effect, amount of textures and meshes does, and it\u0027s quite low here. This mod won\u0027t push your memory usage higher by any significant margin. Pocket change in comparison with 400mb KW Rocketry.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003ESo, removing ExsurgentEngineering.dll will cause the SABRE M to not work? Or will removing it cause it to work? I don\u0027t have anything that uses Exsurgent Engineering, so I\u0027m leaning towards deleting the plugin, but just the same, what\u0027s the fix for the part files?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou will lose all SABRE features and all thrust vectoring functionality. Not recommended at all.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022not-a-cylon\u0022 data-cite=\u0022not-a-cylon\u0022\u003E\u003Cdiv\u003EIs there any way to make the Aerobrakes behave like a control surface either through part.cfg tweaking or keybinding wizardry? ie, when I press yaw left, the aerobrakes on the right side will engage as long as I am yawing left. combined with the awesome smarter thrust vectoring in the pack, I would be able to make an extremely maneuverable craft.!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENone that I know of.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BananaDealer\u0022 data-cite=\u0022BananaDealer\u0022\u003E\u003Cdiv\u003ETo the devs of B9, there appears to be some weirdness with the shielded docking port... Whenever I try to deploy it, all parts round it start jumping around all crazy like. It gets deployed and everything comes back in place (most of the times, mostly), but only with Unbreakable Joints on, you don\u0027t wanna know what happens if it\u0027s off... Suffice it to say, Munfry won\u0027t be going to the Mun any time soon...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook at the animation of the doors and look where you have placed RCS tanks. You are ramming the doors right into them.\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-06-04T16:51:48Z","Content":"\n\u003Cp\u003E@Bac9\u003C/p\u003E\u003Cp\u003EI know... Figured it out...\u003C/p\u003E\u003Cp\u003EAlso... If you guys start making space-orientated parts, Cabana Corp might as well just stop existing... I too have plans, you know!\u003C/p\u003E\u003Cp\u003EAlso, have you considered making a hollow fuselage section for use between your HL cargo bay and tail sections? Having something without doors that open to strut wings and engines to would be nice...\u003C/p\u003E\n"},{"CreatedByName":"Netris","CreatedById":28791,"CreatedDateTime":"2013-06-04T17:24:24Z","Content":"\n\u003Cp\u003EShould I add a module to the .cfg of a non-B9 engine in order to make it works with the thrust vectoring mod which I don\u0027t remember the name ?\u003C/p\u003E\n"},{"CreatedByName":"bac9","CreatedById":57757,"CreatedDateTime":"2013-06-04T17:25:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Netris\u0022 data-cite=\u0022Netris\u0022\u003E\u003Cdiv\u003EShould I add a module to the .cfg of a non-B9 engine in order to make it works with the thrust vectoring mod which I don\u0027t remember the name ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, change the name of thrust vectoring module to one used in F119 engine and configure it.\u003C/p\u003E\n"},{"CreatedByName":"rditto48801","CreatedById":50497,"CreatedDateTime":"2013-06-04T18:45:45Z","Content":"\n\u003Cp\u003E@ bac9\u003C/p\u003E\u003Cp\u003EWhile I love this mod, I don\u0027t use it now.\u003C/p\u003E\u003Cp\u003EI hate to say it, but ever since KSP 0.20.x, I have to use KW Rocketry because it uses up \u0027less\u0027 RAM than this mod.\u003C/p\u003E\u003Cp\u003EYes, I just said KW Rocketry is less RAM intensive.\u003C/p\u003E\u003Cp\u003EMy KSP (0.20.2, Windows version, probably faulty for some reason) seems to think any mod with lots of png textures needs to have RAM usage blown so ridiculously out of proportion that I cannot even use B9 Aerospace in KSP 0.20.x without removing lots of other mods.\u003C/p\u003E\u003Cp\u003EWith KSP set for default rendering/textures, B9 Aerospace will use up about as much RAM as KW Rocketry. Minimum rendering and 1/8 res textures, B9 Aerospace uses up a good bit more RAM than KW rocketry.\u003C/p\u003E\u003Cp\u003EOther \u0027big\u0027 mods with mostly png textures, like Lack\u0027s mod, Nukemod, or CORE Anvil, also end up causing KSP to use up many times more RAM than the mods take up HDD space in general, with CORE Anvil being the \u0027least\u0027 at \u0027only\u0027 taking up 4-5x more RAM than the mod is size wise (even at minimal rendering/textures). This unusual issue makes even the monstrously huge KW Rocketry suddenly be more memory friendly for me to use with other mods.\u003C/p\u003E\u003Cp\u003EThis was figured out using many tests of KSP \u002B a single mod, at default and minimal graphics.\u003C/p\u003E\u003Cp\u003EI made a support topic, but after posting some \u0027test results\u0027, KasperVld said this stuff is \u0027normal\u0027 of KSP... (which makes my brain want to break...)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33694-Updated-to-0-20-2-from-0-20-0-noticed-mods-w-png-has-KSP-RAM-usage-get-excessive\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33694-Updated-to-0-20-2-from-0-20-0-noticed-mods-w-png-has-KSP-RAM-usage-get-excessive\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI figured since B9 Aerospace is one of the \u0027main offender\u0027 mods I have the problem with (and has the apparently second worst memory bloating issue), I might as well post the stuff here, so see if you have any ideas.\u003C/p\u003E\u003Cp\u003EI already reinstalled KSP 0.20.2 once, and it was a clean install in the first place.\u003C/p\u003E\n"},{"CreatedByName":"Netris","CreatedById":28791,"CreatedDateTime":"2013-06-04T19:09:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bac9\u0022 data-cite=\u0022bac9\u0022\u003E\u003Cdiv\u003EYes, change the name of thrust vectoring module to one used in F119 engine and configure it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}