{"TopicId":23250,"ForumId":44,"TopicTitle":"Bermuda Triangle might be natural","CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-04-21T04:31:03Z","PageNum":1,"Articles":[{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-04-21T04:31:03Z","Content":"\n\u003Cp\u003EFirst off, I\u0027m not sure if this is right at all, but from a vid I saw in 6th grade and after some thinking recently I think the Bermuda Triangle might be natural\u003C/p\u003E\u003Cp\u003ESo according to a video I saw in 6th grade, the earths magnetic poles flip every few hundred thousand years or something, and as it flips little \u0022bubbles\u0022 of north or south would appear at the opposite side, like a north bubble would appear near the South Pole, and so the Bermuda Triangle might be one of these bubbles, (presumably a north bubble, because isnt the bermuda triangle in the southern hemisphere?) which in theory would explain compass needles spinning in circles (like if you went and stood at the North or south Pole) so basicly we have part of one of the poles right off the coast of Florida.\u003C/p\u003E\u003Cp\u003ECorrect me if im wrong\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-04-21T04:48:28Z","Content":"\n\u003Cp\u003EWouldn\u0027t such anomaly be easily detectable? We have satellites in orbit mapping Earth for such things, because magnetic anomalies might be indicators of ancient impact sites etc.\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-04-21T04:52:13Z","Content":"\n\u003Cp\u003EI don\u0027t know how an impact would cause that, otherwise mexico would be pretty much the North Pole (massive crater there, probably from the asteroid that wiped out the dinosaurs)\u003C/p\u003E\n"},{"CreatedByName":"Zaeo","CreatedById":52597,"CreatedDateTime":"2013-04-21T05:27:38Z","Content":"\n\u003Cp\u003EImpacts from asteroids that have a different magnetic property than that of earth leave \u0022anomoly\u0022 scars on the planet.\u003C/p\u003E\u003Cp\u003EFor example, an asteroid that impacted earth may have brushed against jupiter, propeling it into us, but that brush with jupiter set its magnetic orientation to be different from earth\u0027s.\u003C/p\u003E\u003Cp\u003EAlso, not all asteroids are hunks of metal. Some are clumps of rock and dust, and even ice, though ice asteroids are rare.\u003C/p\u003E\u003Cp\u003EComets and ice asteroids are two different things btw. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-04-21T14:30:46Z","Content":"\n\u003Cp\u003EWell idk, but how come I saw something on tv show about how there\u0027s something like the Bermuda Triangle off the coast of Japan??\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-21T14:55:43Z","Content":"\n\u003Cp\u003ENo magnetic anomaly would bring down a plane, or sink a boat. I\u0027m dead certain about that. However, a massive methane buildup and release produced by, say, algae, might (by greatly lowering the density of an area of the sea and the air above it). And in fact, I seem to remember I once read that there is an area somewhere in the pacific where this kind of thing happens relatively often, thus providing a natural explanation to the Bermuda Triangle legends.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-04-21T15:05:46Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bangui_Magnetic_Anomaly\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Bangui_Magnetic_Anomaly\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s article about magnetic anomaly in Africa probably being caused by ancient asteroid impact.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2013-04-21T15:11:36Z","Content":"\n\u003Cp\u003EActually, the main cause it put down to not compass error, but pilot error. The Bermuda triangle is featureless to many. Or even with islands, they all look similar. So the main cause is thought to be pilots thinking the plane is heading, for example, north and not trusting the compass when it says south. Or when they see an island in front, expecting a different one behind, they assume their compass flipped, when really they read the maps wrong.\u003C/p\u003E\u003Cp\u003EAdd to this bad weather, and a pilot could end up with their craft (or a sailor with a ship) drifting off course. When this happens, the compass bearing reflects this. So the assumption that the compass is spinning/pointing wrong, is usually just the plane/ship having trouble keeping on course.\u003C/p\u003E\u003Cp\u003EAs a good example of this try it in KSP. Go into orbit or the middle of the sea (anywhere you cannot see much for reference). Then try to fly in a direction or a course change. While flying, look at a book, or somewhere else to imitate a pilot looking at his map. Or \u0022panic\u0022 and close your eyes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E . Then, look back up and try to keep the craft straight and not loose control. This is even harder if the craft is spinning (or in real life being blown off course by winds etc). Another example is trying to dock without SAS, correcting a spin is very difficult, even with reference. While a boat for example has only 1 degree of rotation, and space 3, it\u0027s still 1 degree that a sailor can get confused with.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-04-21T18:09:23Z","Content":"\n\u003Cp\u003EThe Bermuda triangle does not exist.\u003C/p\u003E\n"},{"CreatedByName":"ComradeCatfud","CreatedById":59720,"CreatedDateTime":"2013-04-22T08:49:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe Bermuda triangle does not exist.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo expand on this: Why does anyone believe the Bermuda Triangle has any statistical significance? For me, I see no reason to think the Bermuda Triangle is significant at all. I don\u0027t think it\u0027s special in any way.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-04-22T09:07:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeCatfud\u0022 data-cite=\u0022ComradeCatfud\u0022\u003E\u003Cdiv\u003ETo expand on this: Why does anyone believe the Bermuda Triangle has any statistical significance? For me, I see no reason to think the Bermuda Triangle is significant at all. I don\u0027t think it\u0027s special in any way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither does the US Navy or the US Coast Guard or the Lloyds Insurance Company. Statistically, the number of incidents in that zone is actually below average considering its an area that has a lot of traffic. Millions of people fly or sail through it every year without anyone disappearing mysteriously.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Bermuda_Triangle#History\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Bermuda_Triangle#History\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadpangod3\u0022 data-cite=\u0022Deadpangod3\u0022\u003E\u003Cdiv\u003EWell idk, but how come I saw something on tv show about how there\u0027s something like the Bermuda Triangle off the coast of Japan??\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t believe everything you see on TV.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-22T09:14:30Z\u0022 title=\u002204/22/2013 09:14  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 22, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-22T09:34:45Z","Content":"\n\u003Cp\u003EThe only reason it is significant is because of Ben\u0027s argument. People get confused alot, waste alot of fuel, run out of fuel, and crash. There have been multiple theories to back this up (even aliens), and it is these theories that made it famous.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-04-22T10:35:32Z","Content":"\n\u003Cp\u003EEven that isn\u0027t true. People don\u0027t get more confused in Caribbean than in other places. The Bermuda Triangle is a myth that has no evidence behind it.\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-22T10:42:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EEven that isn\u0027t true. People don\u0027t get more confused in Caribbean than in other places. The Bermuda Triangle is a \u003Cstrong\u003Emyth\u003C/strong\u003E that has no evidence behind it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe myth is what made it famous.\u003C/p\u003E\n"},{"CreatedByName":"GalaxiesFinestToday","CreatedById":60035,"CreatedDateTime":"2013-04-23T00:14:19Z","Content":"\n\u003Cp\u003EMaybe it is a message, telling us to think, just look hundreds of planes and ships dissapear out of the blue. Doesn\u0027t that seem like something or someone is tryng to tell us something?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-04-23T07:29:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GalaxiesFinestToday\u0022 data-cite=\u0022GalaxiesFinestToday\u0022\u003E\u003Cdiv\u003EMaybe it is a message, telling us to think, just look hundreds of planes and ships dissapear out of the blue. Doesn\u0027t that seem like something or someone is tryng to tell us something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*sigh* Please stop spewing misinformation. This forum is supposed to be *\u003Cstrong\u003EThe Science Lab\u003C/strong\u003E* not *\u003Cstrong\u003EThe Crazy Alien Hoax and Conspiracy Theory Labs\u003C/strong\u003E*.\u003C/p\u003E\u003Cp\u003EDo you have any references for these \u0022hundreds of planes and ships disappear out of the blue\u0022? Any statistics that might suggest that there are more incidents on one the highest traffic navigation lanes in the World compared to other places? \u003C/p\u003E\u003Cp\u003EDid you even read the Wikipedia article before posting here?\u003C/p\u003E\n"},{"CreatedByName":"Grove","CreatedById":5188,"CreatedDateTime":"2013-04-23T12:17:57Z","Content":"\n\u003Cp\u003EYeah, Bermuda triangle is just a part of the ocean. Deadpangod, the other thing that you were thinking about was \u0027\u0027Devil\u0027s Sea/ Dragon Triangle\u0027\u0027. Also, this thread is really silly.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-04-23T12:35:15Z","Content":"\n\u003Cp\u003EMaybe a better question would be: Why is the Bermuda triangle such a \u003Cstrong\u003Esafe\u003C/strong\u003E place to travel? Why do less planes and ships disappear in the Bermuda triangle than would statistically be expected? \u003C/p\u003E\u003Cp\u003E- Do methane bubbles from the sea surface create better aerodynamic conditions? \u003C/p\u003E\u003Cp\u003E- Do angels from heaven guide lost travelers to their destinations? Or are it the ghosts of dead sailors who died after living a long and prosperous life financed by their travels through the Bermuda triangle?\u003C/p\u003E\u003Cp\u003E- Or are it aliens who noticed the significance of the Bermuda triangle for our economy and want to support our development as a species by protecting it from disasters?\u003C/p\u003E\u003Cp\u003EThere is clearly something there we are not supposed to know...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-23T12:40:39Z\u0022 title=\u002204/23/2013 12:40  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 23, 2013\u003C/time\u003E by Crush\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ghost010","CreatedById":57302,"CreatedDateTime":"2013-04-23T13:35:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe Bermuda triangle does not exist.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eoh it does exist,its real. it just doesnt do ****.\u003C/p\u003E\u003Cp\u003Eits just a place on the map called The Bermuda triangle.its a tourist attraction.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-23T21:45:24Z","Content":"\n\u003Cp\u003ELet\u0027s say this. The Bermuda Triangle is the busiest waterway in the world. Every second, hundreds of thousands of people are fishing, sailing, patrolling, whatever in the Triangle. The rae of dissaperences and such are completly normal, as it, after all, is the most used waterway in the world, and so, proportionally, the losses and dissaperences are totally normal.\u003C/p\u003E\n"},{"CreatedByName":"lump","CreatedById":30092,"CreatedDateTime":"2013-04-23T22:14:55Z","Content":"\n\u003Cp\u003EI remember when i was kid and i read a book on the Bermuda Triangle, it was like the large hadron collier to me, i was scared (my dad caused the LHC fear through a news article about it potentially creating black holes, now i understand black holes i actually want them to create one) of it as it seemed dangerous, but just like everyone SHOULD do is i looked it up and found it a tame little area. The myth is probably still alive due to it being fuel to attract tourists.\u003C/p\u003E\u003Cp\u003EAs for people that believe it are the same kind of people that believe the moon landings were faked, i don\u0027t even mind it if you think they\u0027re faked but when you use the same argument that has been disproved many times, it just seems like you wasn\u0027t it to be fake, every shred of evidence possible has been used by these kinds of people to prove their ideas, every time someone disprove the claim, few months later BAM! the same evidence pops up.\u003C/p\u003E\u003Cp\u003EThe Only thing the Bermuda Triangle causes is humiliation.\u003C/p\u003E\n"},{"CreatedByName":"ramses","CreatedById":26418,"CreatedDateTime":"2013-04-26T00:12:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe Bermuda triangle does not exist.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas getting worried there for a minute. Do people still believe in these things? \u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m off to find the Loch Ness monster.\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-04-26T00:32:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeCatfud\u0022 data-cite=\u0022ComradeCatfud\u0022\u003E\u003Cdiv\u003ETo expand on this: Why does anyone believe the Bermuda Triangle has any statistical significance? For me, I see no reason to think the Bermuda Triangle is significant at all. I don\u0027t think it\u0027s special in any way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOver the last 25 years alone more than 75 airplanes and a thousand yachts and commercial ships with their passengers and crews disappeared without trace. I\u0027m not a big believer in these sorts of things, but I\u0027m not religious and have a fairly open mind when it comes to unexplained mysteries, but that is one hell of a list of people to vanish into thin air. No black boxes, no wreckage found. \u003C/p\u003E\u003Cp\u003EThere\u0027s your statistical significance.\u003C/p\u003E\n"},{"CreatedByName":"Malaugrym","CreatedById":57689,"CreatedDateTime":"2013-04-26T01:45:28Z","Content":"\n\u003Cp\u003EBermuda Triangle? Disappearances?\u003C/p\u003E\u003Cp\u003EOh...that would be caused by little green things with black hair. No idea what they\u0027re called, saw them while flying over some islands once.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-26T02:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022devogen\u0022 data-cite=\u0022devogen\u0022\u003E\u003Cdiv\u003EOver the last 25 years alone more than 75 airplanes and a thousand yachts and commercial ships with their passengers and crews disappeared without trace. I\u0027m not a big believer in these sorts of things, but I\u0027m not religious and have a fairly open mind when it comes to unexplained mysteries, but that is one hell of a list of people to vanish into thin air. No black boxes, no wreckage found. \u003Cp\u003EThere\u0027s your statistical significance.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOver the last 75 years, more than 1,000,000 aircraft and 10,000,000 craft from skiffs to battlecruisers have went into the area. That\u0027s totally normal.\u003C/p\u003E\n"}]}