{"TopicId":23340,"ForumId":16,"TopicTitle":"Ship spinning wildly for no reason","CreatedByName":"IriathZhul","CreatedById":58927,"CreatedDateTime":"2013-04-21T16:58:35Z","PageNum":1,"Articles":[{"CreatedByName":"IriathZhul","CreatedById":58927,"CreatedDateTime":"2013-04-21T16:58:35Z","Content":"\n\u003Cp\u003EI have a small launcher I\u0027m using to get a rover into orbit before sending it to Duna. Everything goes fine, until...\u003C/p\u003E\u003Cp\u003EOnce I disconnect from the launcher stage, the main section starts to spin Q-E like a maniac. If I turn on ASAS, it will eventually slow down and stop. If I take off ASAS, and tap A or D at ALL, it suddenly begins to spin Q-E again, and gets increasingly fast. I can\u0027t imagine why it\u0027s doing this...I used the exact same model an hour ago and I only added one part: a landing strut. No amount of manual control can stabilize it, but using ASAS is no help because I can\u0027t even orient this thing toward the bearings I want.\u003C/p\u003E\u003Cp\u003EIs this a glitch or did I do something wrong? I have exited and reentered the craft multiple times to see if it was something that needed flushing out, but to no avail.\u003C/p\u003E\u003Cp\u003E*edit* Tried it again. I don\u0027t even have to do anything. I can jump in and out of control of the craft to force a complete stop. Left alone, it will start to nudge A-D...and then stop...and then suddenly starts spinning Q-E, just absolutely flaming crazy. I\u0027m not touching anything. My ship is possessed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-21T17:03:36Z\u0022 title=\u002204/21/2013 05:03  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 21, 2013\u003C/time\u003E by IriathZhul\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-04-21T17:51:30Z","Content":"\n\u003Cp\u003EThis is usually caused by animated parts colliding. It can also happen with non-animated parts where the VAB lets you put them too close together and then they try to stop overlapping when the physics engine starts. Finally, I\u0027ve seen this happen with standard EA-4 struts that don\u0027t collide with anything.\u003C/p\u003E\u003Cp\u003EGiven that the only thing you changed was the landing strut, I\u0027d take a close look at anything near the landing strut to see if something might be coming in contact with the landing strut.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-21T18:05:25Z","Content":"\n\u003Cp\u003EHave you been going in and out of warp with SAS mode engaged? Sometimes the ASAS comes out of warp still trying like hell to make some adjustment it was making just as you went into warp. Try leaving the ship and going back to KSC for a moment, and then resume the flight.\u003C/p\u003E\n"},{"CreatedByName":"Malaugrym","CreatedById":57689,"CreatedDateTime":"2013-04-21T19:48:39Z","Content":"\n\u003Cp\u003EI get this kind of behavior whenever I have two parts touching in an unhealthy manner. Try to get some more space between small parts. It may all look correct, but the collision meshes may still be overlapping.\u003C/p\u003E\n"},{"CreatedByName":"Neodyme","CreatedById":57481,"CreatedDateTime":"2013-04-21T19:56:12Z","Content":"\n\u003Cp\u003EI had a similar issue with my spaceplane, it started veering left slightky, and couldnt figure out why, I literally tore the ship apart symmetrical piece by symmetrical piece. Turns out I had ONE rcs thruster positioned one unit to the left, even if not active at speeds of like 100m.s it pulled it.\u003C/p\u003E\u003Cp\u003E Also get this on my module rocket, I think kine is due more to the fact I put tail fins on the central booster, and there are 6 other boosters attached, wheni drop them, they may rip off a fin, and as they are in a quad formation, it goes to tri but not in the correct orientation, and it just starts spinning, thankfully im able to control it for me though, when I get into orbital range anyway. Good kuck fixing it, I ended up started my spaceplane again with something like this :/\u003C/p\u003E\n"},{"CreatedByName":"Procyon","CreatedById":57510,"CreatedDateTime":"2013-04-21T22:03:03Z","Content":"\n\u003Cp\u003EI also notice you can get rotation if you have a couple tanks with engines side by side that are not physically connected, say on the three way adapter, one pushes one way while the other pushes the other. a strut to connect them together and make them move in the same direction stabilizes it.\u003C/p\u003E\n"},{"CreatedByName":"Scottiths","CreatedById":57116,"CreatedDateTime":"2013-04-21T22:21:26Z","Content":"\n\u003Cp\u003ENot exactly the same thing but related. I have noticed that if you are using MechJeb or equivalents that they will keep trying to affect a ship you dock to. IE: I docked to a lander that I told Jeb to keep on a 180 degree heading. As soon as the ships docked the mechjeb of the lander started trying to tear it off the other ship in an attempt to keep it aligned.\u003C/p\u003E\u003Cp\u003ELong story short, be careful what you tell mechjeb to do when docking 2 ships together or you will get torque applied in crazy ways.\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-04-21T22:42:13Z","Content":"\n\u003Cp\u003ETry not to have multiple gimbaling engines doing their exhaust vectoring thing simultaneously. I once had 4 in a square, and as the rocket got more top heavy as fuel was burnt, it started gyrating out of control as described. They seem to fight each others\u0027 vectoring. They\u0027re best used alone or in the center of non-vectoring engines.\u003C/p\u003E\n"}]}