{"TopicId":23381,"ForumId":16,"TopicTitle":"I\u0026#039;m a docking disaster","CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-04-21T20:45:46Z","PageNum":1,"Articles":[{"CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-04-21T20:45:46Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003EI\u0027ve been trying to dock in orbit for two days now, but without any success yet; I must admit, I\u0027m getting a little frustrated by now. I\u0027ve repeatedly watched a couple docking tutorials on youtube (I use mechjeb), but I can\u0027t seem to apply this knowledge in the game. Clearly I must be doing something wrong, so maybe one of you guys can help me. Here is what I do:\u003C/p\u003E\u003Cp\u003EI bring two ships into orbit. From ship one, I make an approach to the second ship by setting it as a target and burn towards it at a relatively slow velocity. As soon as there is a 500 meters distance, I kill the relative velocity to 1 m/s. Then I position the ship 1 docking port towards the second ship and turn on ASAS. From here, I switch to the second ship and select the first (aligned) ship as my target. I set the control mode to the docking port (control from here) and slowly I burn towards my target. When I get really close, I use docking controls and always make sure to keep the velocity under 2 m/s. This all works well, but for some reason the two docking ports aren\u0027t aligned any more and I always end up by doing a very close fly by (10 to 1 meters), or I even bump in to my target. \u003C/p\u003E\u003Cp\u003EI guess my question is, how do I keep those ports aligned? When I switch from ship 1 to 2, my guess is that ship 1 (not under control by mechjeb anymore, but ASAS turned on) is slightly deviating, hence I miss my target. (over and over again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E ) All help is appreciated.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-04-21T20:49:44Z","Content":"\n\u003Cp\u003EI\u0027d start by slowing down once you\u0027re within 100 meters. Get down to something like 0.5 m/s or so. Once it looks like you\u0027re aligned, turn towards your target; do this on torque only, don\u0027t use RCS or you\u0027ll drift. Line it up and thrust forward.\u003C/p\u003E\u003Cp\u003EAnd be glad you aren\u0027t trying to do the docking sideways...\u003C/p\u003E\n"},{"CreatedByName":"Malaugrym","CreatedById":57689,"CreatedDateTime":"2013-04-21T20:56:36Z","Content":"\n\u003Cp\u003ETry choosing a \u0022universal facing\u0022 for all your craft. I prefer east/west, but any point on the nav-ball works. Face the thing you want to dock with east and turn on ASAS, time accelerate for a second, decelerate to normal, switch to your first ship. Face that east as well. Choose and set your target docking port. While still facing east, make your approach speed 1 m/s. Using RCS, manipulate your velocity until your prograde marker is on top of your target marker. Hold this position, approach target, dock. \u003C/p\u003E\u003Cp\u003ENote: At all times, both craft must continue to face east. This becomes more difficult the larger the craft in question. Never point toward your target while doing this, as that destroys the methods dependent conditions. All things must face east(or any agreed direction) at all times.\u003C/p\u003E\n"},{"CreatedByName":"Tophir","CreatedById":58841,"CreatedDateTime":"2013-04-21T22:09:01Z","Content":"\n\u003Cp\u003EWhen really close (within 10 meters or so) kill all relative velocity so that you are aproching your target at 0.0 mps. Next switch over to your other ship and hit control from here on the docking port you want to dock with. Aim the docking port at the target reticle. The switch over to the other ship and do the same then begin going towards the target at 0.1 to 0.2 mps so if you doo miss you dont break anything of your ship. Good luck!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-21T23:54:07Z","Content":"\n\u003Cp\u003EDon\u0027t forget that while your ships appear to be not moving much relative to each other, they are both moving in a circle around the planet while in orbit. Consider the following spectacular bit of MS Paint art. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JMTnYQi.png\u0022 alt=\u0022JMTnYQi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlthough they are actually not rotating in alignment, the ships are rotating around each other in position, and may no longer be pointing at each other\u0027s docking ports by the time you get there. I would recommend closing the last 500m a little faster, say at 20m/s, and then come to a stop at around 50m and be prepared to do some final adjusting with RCS.\u003C/p\u003E\n"},{"CreatedByName":"mcbmaestro","CreatedById":59577,"CreatedDateTime":"2013-04-21T23:54:15Z","Content":"\n\u003Cp\u003EThe way I read that, I didn\u0027t see you targeting the target ship\u0027s docking port. Make sure you target the actual docking port of your target not just the ship. Could be why it\u0027s not lining up right.\u003C/p\u003E\u003Cp\u003EPersonally, I dock mostly visually which takes a long time and is pretty inconsistent and unscientific but I can always dock. Can even dock dual radial mounted ports which is trickier.\u003C/p\u003E\u003Cp\u003ELastly, remember the closer you get, the smaller your corrections should be. Once the ports are less than a few meters, you should be making extremely fine, minute adjustments. If it feels like there\u0027s not enuf time, you\u0027re coming in too fast.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-22T00:03:39Z\u0022 title=\u002204/22/2013 12:03  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 22, 2013\u003C/time\u003E by mcbmaestro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-22T03:11:43Z","Content":"\n\u003Cp\u003EOkay, so I rebuilt my old post (lost in the forum collapse) where you can practice docking with a ship that is already close to its target. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u003C/a\u003E Maybe you could try docking, releasing, re-docking from increasingly large distances.\u003C/p\u003E\n"},{"CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-04-22T03:15:02Z","Content":"\n\u003Cp\u003EIÃ‚Â´m proud to announce that the (manual) docking of the Kerbal SDI missile platform finally is a success. At last I can shoot down all that debris that is cluttering my orbit. Thanks for the help guys! Now that IÃ‚Â´ve done it, IÃ‚Â´m hoping it wasnÃ‚Â´t a lucky shot; hopefully I can reproduce this and get a little better at it. I think the main problem was my speed; I was simply going to fast to make any last corrections, but tonight I merged the two platforms with a velocity of 0.1 m/s in a near perfect angle.\u003C/p\u003E\u003Cp\u003EAgain, thanks for all your thoughts and suggestions!\u003C/p\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2013-04-22T04:19:03Z","Content":"\n\u003Cp\u003Eone thing that helps is to place the docking ports perpendicular to your orbit, this way the craft spins with the docking port as it\u0027s axis.\u003C/p\u003E\u003Cp\u003EThe second thing is to target the docking port itself.\u003C/p\u003E\n"},{"CreatedByName":"PolecatEZ","CreatedById":58008,"CreatedDateTime":"2013-04-22T04:40:31Z","Content":"\n\u003Cp\u003EI beat my head against the wall because of the navball bug.\u003C/p\u003E\u003Cp\u003EBasically, make sure the docking port you are flying is in line with the primary cockpit. If it is not, like the off-center ones or the neck-clamp thingy, for example, they won\u0027t match up to what you\u0027re seeing on the navball.\u003C/p\u003E\u003Cp\u003EOnce I figured this out, I redesigned all my craft to more properly align and everything is peachy now.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-04-22T06:34:19Z","Content":"\n\u003Cp\u003EI find its helpful to align your craft at the same moment, then lock ASAS and concentrate on lining up the prograde and target vectors. If you are in front of the target, moving in its direction, and pointed the right way, then you will dock, guaranteed.\u003C/p\u003E\n"},{"CreatedByName":"rockbloodystar","CreatedById":59828,"CreatedDateTime":"2013-04-22T16:42:42Z","Content":"\n\u003Cp\u003EMe too!\u003C/p\u003E\u003Cp\u003EI\u0027ve smashed many satellites, or wiped out the solar panels with misjudged docking.\u003C/p\u003E\u003Cp\u003EAll hail Mechanical Jeb!\u003C/p\u003E\n"}]}