{"TopicId":23555,"ForumId":34,"TopicTitle":"[0.21.1] KAS v0.4.3 - Struts, pipes, part storage, containers, merged winches \u0026amp; more","CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2013-04-22T19:15:03Z","PageNum":45,"Articles":[{"CreatedByName":"nismobg","CreatedById":83892,"CreatedDateTime":"2013-10-04T00:45:50Z","Content":"\n\u003Cp\u003EBug : on Minmus winch \u002B magnet , magnetize = universe big bang everywhere. The force is strong with this magnet. Lol\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-10-04T00:48:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reddot99\u0022 data-cite=\u0022Reddot99\u0022\u003E\u003Cdiv\u003EThe fuel pipes should work for that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut then I\u0027m left with fuel pipes stuck to my pieces? See that\u0027s why I don\u0027t want to use docking ports, so I don\u0027t have extra PART{}\u0027s stuck to my station. Though with the docking ports then there\u0027s all those modules too.\u003C/p\u003E\u003Cp\u003EOr is there some way I could remove the pipes afterwards that leaves my parts stuck together? How does it work exactly?\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-10-04T02:37:18Z","Content":"\n\u003Cp\u003EQuestion: were the standard, fixed attachment points (Radial Connector Ports) changed at all from the last version? I have a couple of rovers with winches, etc, but they\u0027re fairly easily deleted and replaced; but if a craft has nothing but one or more of the regular \u0022sockets\u0022, will it be affected (fail to load, explode, etc)?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T06:39:25Z\u0022 title=\u002210/04/2013 06:39  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Commander Zoom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NNYGamer","CreatedById":57725,"CreatedDateTime":"2013-10-04T03:53:45Z","Content":"\n\u003Cp\u003EI\u0027ve got some checking to do but so far only one problem. Exploding kerbals. There might be some interference from another mod so I\u0027ll put it on my stock game and test tomorrow. Every time I hit the ground a little hard my guy exploded. The last one he had just picked up the large container and was moving it and I may have run into the rover wheel. I was only practicing building on Kerbin so nothing was messed up.\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-10-04T06:24:06Z","Content":"\n\u003Cp\u003EI tried to use those pipes, Looks awsome bytheway, but after i switch to space center or another wessel, and then switch back to place where i tested them, they are all gone even the storage containers that Jeb put on ground are gone.\u003C/p\u003E\u003Cp\u003E Only Jeb and his truck stayed there, and parts directly atached to the truck stayed there everithing else disappeared.\u003C/p\u003E\u003Cp\u003E Also Jeb tends to fall to the ground and play dead near those pipes and pylons.\u003C/p\u003E\n"},{"CreatedByName":"ChrisF0001","CreatedById":78375,"CreatedDateTime":"2013-10-04T07:27:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EWith some further thinking and experimenting, the bottom line is:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEverything that relied on a winch being a winch, i.e. retractable and having an actuator on the end, is impractical to upgrade and is better off rebuilt. That includes hanging bases, cranes, towing arrangements of whatever kind, airships with anchors, etc. I don\u0027t think making a winch attachable from EVA will work well, and more importantly, it won\u0027t be attachable exactly where you want it to be anyway.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAnything that relied on a winch for transfer of resources and merging modules into a single vessel is better off done with pipes instead.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, yes. I\u0027ve tried some experiments with modifying the save files, clinging to the theory that surely, logically, it \u003Cem\u003Emust\u003C/em\u003E be possible to do it like that, before discovering for myself just how difficult it is to remove even one part from a ship using only a text editor. With any more than perhaps a couple of dozen parts involved it\u0027s evidently just not happening. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, I haven\u0027t yet given up on the possibility of converting old winches with no connectors into new winches by copying the module blocks across. With the vertical winch, I have some hope of that working. It doesn\u0027t with the horizontal winch, but that seems broken for me anyway even on newly built ships, and it fights back all my attempts to fix it.\u003C/p\u003E\u003Cp\u003ESo, my next experiment will be to unplug and retract all the winches, then use the Lazor EVA weld/decouple feature to cut off all the connectors, then attempt the upgrade.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo a somewhat simplified upgrade cycle, tested in vitro, is like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EBackup everything. At the very least, back up your entire GameData and saves directories. This should be obvious, but for some people it isn\u0027t.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInstall container parts from 0.4 separately, removing all part modules from their config files. Start the game. Using your existing base setup, you can now build containers and place one wherever pipes will be needed. Just put it on wheels and drive it off the launchpad if you use them, deliver one by rocket if you don\u0027t. Disconnect and reel in all winches everywhere, dispose of craft that rely on winches being winches as appropriate. Once that is done, exit.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemove all part modules from 0.3 parts, adding a copy KasModuleGrab from a grabbable part like electromagnet instead where one isn\u0027t present. Now they don\u0027t work as winches and connectors, but you can detach them from the craft. Load the game and get rid of every winch, connector and connector port you have. The bases are inoperative at this point, but you have empty containers in place already.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDelete 0.3 (including the container parts you have edited) and install 0.4, (which will include the container parts in their original form) start the game. If you left any connectors lying around as debris, they will now vanish, as will anything that you forgot to remove a connector from. Switch to every craft that contains a container and open it for a good measure to check if they\u0027re okay. That will make containers operable, they are now empty. Build a vessel that is just a container full of pipe endpoints and junctions, launch it and exit the game. Now you can edit the save file to fill containers with as many pipe endpoints as you need to restore everything, and you can look at the container you just launched in the savefile to see how to edit your containers that are at your remote bases to match. Look for \u0022CONTENT\u0022 section for the contents of the container, the format is trivial. You can edit in more pipe endpoints than the container would otherwise be able to hold, by the way.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELoad again and reconnect the bases with pipes taken from your containers, you\u0027re done. Now you can build a new crane or whatever it is that would need explicit winches to work.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EQuite a hassle, but still easier than rebuilding bases from scratch.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks again. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I haven\u0027t yet tried messing with the containers, but I suspect that may be the missing step - The big flaw in my plan (or at least the one I\u0027m currently aware of) being that the launchpad is currently attached to the rest of my base by means of a horizontal stack winch that won\u0027t survive the conversion...\u003C/p\u003E\n"},{"CreatedByName":"tzink","CreatedById":83305,"CreatedDateTime":"2013-10-04T08:33:46Z","Content":"\n\u003Cp\u003EI can\u0027t figure this out. Using the radial connector port, I want to bring one up to another stranded craft, attach it to the stranded craft, and then attach the winch connector to it and haul it in. Seems like what KAS is made for, practically.\u003C/p\u003E\u003Cp\u003EI\u0027ve tested my design on the ground using simple parts--ejecting a Stay Putnik from the top of a craft, going to EVA, attaching the radial connector port to the satellite bit and hauling it in. No problem.\u003C/p\u003E\u003Cp\u003EExcept when I\u0027m in orbit, none of this works. I can detach the radial connector port and Mac happily carries it around on his back, but I can\u0027t reattach it anywhere. What works perfectly on Kerbin, using the H key or selecting the button and then clicking a destination, doesn\u0027t work at all in orbit. It simply won\u0027t let me reattach. Here\u0027s some screenshots:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/lRA1Qln,yMMZqGp#0\u0022 alt=\u0022lRA1Qln,yMMZqGp#0\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/lRA1Qln,yMMZqGp#1\u0022 alt=\u0022lRA1Qln,yMMZqGp#1\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat\u0027s going wrong here?\u003C/p\u003E\n"},{"CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2013-10-04T09:57:14Z","Content":"\n\u003Cp\u003ENew version released (0.4.1)\u003C/p\u003E\u003Cp\u003E#####Bug Fixes \u003C/p\u003E\u003Cp\u003E- Container mass are now correctly calculated\u003C/p\u003E\u003Cp\u003E- Hopefully fixed under ground part spawning bug after warping/loading\u003C/p\u003E\u003Cp\u003E- Universe will no more vanish when the coupled vessel was the active vessel (can happen with winches)\u003C/p\u003E\u003Cp\u003E- Universe will no more vanish sometimes after loading\u003C/p\u003E\u003Cp\u003E- Ground attached object now re-attach correctly to the ground after save/load\u003C/p\u003E\u003Cp\u003E- Added a warning message in log if heightFromTerrain get negative (just in case, related to under ground part spawning) \u003C/p\u003E\u003Cp\u003E- Fixed winch connector which disconnects after a save/load\u003C/p\u003E\u003Cp\u003E- Removed pipe and strut tube renderer from attach pointer\u003C/p\u003E\u003Cp\u003E- Attaching a pipe or strut linked now unlink automatically\u003C/p\u003E\u003Cp\u003E- Struts now use the correct texture\u003C/p\u003E\u003Cp\u003E- Adjusted the coupling behaviour\u003C/p\u003E\u003Cp\u003EHopefully all major issues are fixed. Under ground part spawning was prertty tricky to find. It was related to the stock function \u0022GetHeightFromTerrain\u0022 that seemed to collide with the tube renderer of the pipe when linking :0\u003C/p\u003E\u003Cp\u003EFor an unknow reason it mess up all the vessel height. Removed the collider of tubes did the job for fixing that issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, I added debug logging when height of the current vessel get negative, so if the problem happen again, please check your log, (alt\u002BF2 in game) and report it here.\u003C/p\u003E\n"},{"CreatedByName":"Gnipu","CreatedById":83417,"CreatedDateTime":"2013-10-04T10:26:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KospY\u0022 data-cite=\u0022KospY\u0022\u003E\u003Cdiv\u003ENew version released (0.4.1)\u003Cp\u003E#####Bug Fixes \u003C/p\u003E\u003Cp\u003E- Container mass are now correctly calculated\u003C/p\u003E\u003Cp\u003E- Hopefully fixed under ground part spawning bug after warping/loading\u003C/p\u003E\u003Cp\u003E- Universe will no more vanish when the coupled vessel was the active vessel (can happen with winches)\u003C/p\u003E\u003Cp\u003E- Universe will no more vanish sometimes after loading\u003C/p\u003E\u003Cp\u003E- Ground attached object now re-attach correctly to the ground after save/load\u003C/p\u003E\u003Cp\u003E- Added a warning message in log if heightFromTerrain get negative (just in case, related to under ground part spawning) \u003C/p\u003E\u003Cp\u003E- Fixed winch connector which disconnects after a save/load\u003C/p\u003E\u003Cp\u003E- Removed pipe and strut tube renderer from attach pointer\u003C/p\u003E\u003Cp\u003E- Attaching a pipe or strut linked now unlink automatically\u003C/p\u003E\u003Cp\u003E- Struts now use the correct texture\u003C/p\u003E\u003Cp\u003E- Adjusted the coupling behaviour\u003C/p\u003E\u003Cp\u003EHopefully all major issues are fixed. Under ground part spawning was prertty tricky to find. It was related to the stock function \u0022GetHeightFromTerrain\u0022 that seemed to collide with the tube renderer of the pipe when linking :0\u003C/p\u003E\u003Cp\u003EFor an unknow reason it mess up all the vessel height. Removed the collider of tubes did the job for fixing that issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, I added debug logging when height of the current vessel get negative, so if the problem happen again, please check your log, (alt\u002BF2 in game) and report it here.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFantastic, man. So this also negates explosion upon loading? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-10-04T10:39:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChrisF0001\u0022 data-cite=\u0022ChrisF0001\u0022\u003E\u003Cdiv\u003EHmm, yes. I\u0027ve tried some experiments with modifying the save files, clinging to the theory that surely, logically, it \u003Cem\u003Emust\u003C/em\u003E be possible to do it like that, before discovering for myself just how difficult it is to remove even one part from a ship using only a text editor. With any more than perhaps a couple of dozen parts involved it\u0027s evidently just not happening. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is possible, but due to all the part cross-referencing, it\u0027s just annoyingly difficult to do manually without screwing everything up. Using the KAS grab module to just tear them off in EVA -- or Lazors, for that matter -- and letting KSP itself take care of all the linkage is much preferable. There\u0027s also that method with destruction by overheating mentioned higher up in the thread in response to my comments, which also works, but is harder to control.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChrisF0001\u0022 data-cite=\u0022ChrisF0001\u0022\u003E\u003Cdiv\u003EHowever, I haven\u0027t yet given up on the possibility of converting old winches with no connectors into new winches by copying the module blocks across.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlease write up the procedure if you succeed.\u003C/p\u003E\n"},{"CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2013-10-04T12:32:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nismobg\u0022 data-cite=\u0022nismobg\u0022\u003E\u003Cdiv\u003EBug : on Minmus winch \u002B magnet , magnetize = universe big bang everywhere. The force is strong with this magnet. Lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI must say that I didn\u0027t test magnet on Minmus as I only have a Mun base for now. Did it happen everytime ? and only on that planet ?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EIt is possible, but due to all the part cross-referencing, it\u0027s just annoyingly difficult to do manually without screwing everything up. Using the KAS grab module to just tear them off in EVA -- or Lazors, for that matter -- and letting KSP itself take care of all the linkage is much preferable. There\u0027s also that method with destruction by overheating mentioned higher up in the thread in response to my comments, which also works, but is harder to control.\u003Cp\u003EPlease write up the procedure if you succeed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso interested, I can add it to the main page if there is a working solution.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazingAngel665\u0022 data-cite=\u0022BlazingAngel665\u0022\u003E\u003Cdiv\u003EFeel free to display the video where ever you want if you think it show the feature better. When you update the mod I will redo the video.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will maybe wait that you redo the video when KAS 0.4 will be confirmed stable. A video with bugs like this are not really reassuring for users \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI hope that with the latest bugfixes the situation will change. As I released 0.4.1 today, I guess I just need to wait the feedback now. (for me the game is running fine so far)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T12:48:12Z\u0022 title=\u002210/04/2013 12:48  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by KospY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rottielover","CreatedById":73403,"CreatedDateTime":"2013-10-04T12:38:51Z","Content":"\n\u003Cp\u003Etrying the 4.1 update now. So far very promising.\u003C/p\u003E\n"},{"CreatedByName":"CERVERUS","CreatedById":15589,"CreatedDateTime":"2013-10-04T13:43:33Z","Content":"\n\u003Cp\u003EWho can tell me wich plugin is this,you can transfer fuel like this way?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DdaObWk.png\u0022 alt=\u0022DdaObWk.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"futrtrubl","CreatedById":77310,"CreatedDateTime":"2013-10-04T13:50:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CERVERUS\u0022 data-cite=\u0022CERVERUS\u0022\u003E\u003Cdiv\u003EWho can tell me wich plugin is this,you can transfer fuel like this way?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would be this plugin. Specifically the pylons and pipes.\u003C/p\u003E\n"},{"CreatedByName":"Exposure","CreatedById":188,"CreatedDateTime":"2013-10-04T13:50:08Z","Content":"\n\u003Cp\u003EAlt \u002B right click if you\u0027re wondering exactly how to transfer fuels after connecting them with KAS.\u003C/p\u003E\u003Cp\u003EOtherwise what the guy above me said.\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-10-04T13:55:24Z","Content":"\n\u003Cp\u003EYes, I think he was asking how to transfer the fuel with the popup boxes. It\u0027s in the stock game, just alt-rightclick on both tanks, like Exposure said.\u003C/p\u003E\n"},{"CreatedByName":"futrtrubl","CreatedById":77310,"CreatedDateTime":"2013-10-04T14:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exposure\u0022 data-cite=\u0022Exposure\u0022\u003E\u003Cdiv\u003EAlt \u002B right click if you\u0027re wondering exactly how to transfer fuels after connecting them with KAS.\u003Cp\u003EOtherwise what the guy above me said.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh, that part yeah ;\u0027]\u003C/p\u003E\u003Cp\u003EIn other news behold the KAS based \u0022Rat King\u0022 MROC ( Maintenance, Repair and Overhaul Craft). I completely ignored the look of the craft and focused on function and by happy coincidence it actually resembled something ;\u0027]\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://edowner.net/files/Rat-King-MRO-module.jpg\u0022 alt=\u0022Rat-King-MRO-module.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u0022crown\u0022 is a FesTek parts expansion IACBM (aka a docking port) for docking with my station.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T14:07:10Z\u0022 title=\u002210/04/2013 02:07  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by futrtrubl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CERVERUS","CreatedById":15589,"CreatedDateTime":"2013-10-04T14:02:33Z","Content":"\n\u003Cp\u003EThanks a lot my friends,both of you(wasmic,Exposure),about your respond!\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T14:07:30Z","Content":"\n\u003Cp\u003EAway from my home computer so I can test right now, but is there any comprehensive documentation for this mod anywhere?\u003C/p\u003E\u003Cp\u003EFor example, are the pipes structural or only allow fuel transfer? Do pipes allow other resources to transfer as well? \u003C/p\u003E\u003Cp\u003EIf I join 2 craft with a pipe does that have the same effect as docking them? Are pipes stronger/weaker than struts?\u003C/p\u003E\n"},{"CreatedByName":"flexix11","CreatedById":41274,"CreatedDateTime":"2013-10-04T15:38:29Z","Content":"\n\u003Cp\u003Eyes the pipes dock it together\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T15:41:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022flexix11\u0022 data-cite=\u0022flexix11\u0022\u003E\u003Cdiv\u003Eyes the pipes dock it together\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcellent, thank you. I\u0027m planning out a small refueling rig for my reusable lifter and slapping pipes on the side makes it a lot easier.\u003C/p\u003E\n"},{"CreatedByName":"tzink","CreatedById":83305,"CreatedDateTime":"2013-10-04T16:40:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tzink\u0022 data-cite=\u0022tzink\u0022\u003E\u003Cdiv\u003EI can\u0027t figure this out. Using the radial connector port, I want to bring one up to another stranded craft, attach it to the stranded craft, and then attach the winch connector to it and haul it in. Seems like what KAS is made for, practically.\u003Cp\u003EI\u0027ve tested my design on the ground using simple parts--ejecting a Stay Putnik from the top of a craft, going to EVA, attaching the radial connector port to the satellite bit and hauling it in. No problem.\u003C/p\u003E\u003Cp\u003EExcept when I\u0027m in orbit, none of this works. I can detach the radial connector port and Mac happily carries it around on his back, but I can\u0027t reattach it anywhere. What works perfectly on Kerbin, using the H key or selecting the button and then clicking a destination, doesn\u0027t work at all in orbit. It simply won\u0027t let me reattach. Here\u0027s some screenshots:\u003C/p\u003E\u003Cp\u003EWhat\u0027s going wrong here?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like my screenshots didn\u0027t work the first time. See them here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lRA1Qln.png\u0022 alt=\u0022lRA1Qln.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yMMZqGp.png\u0022 alt=\u0022yMMZqGp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny ideas?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T19:01:58Z\u0022 title=\u002210/04/2013 07:01  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by tzink\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-10-04T17:09:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EExcellent, thank you. I\u0027m planning out a small refueling rig for my reusable lifter and slapping pipes on the side makes it a lot easier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe pipes are mostly rigid (assuming removing the collider didn\u0027t break that, but I doubt it did.) There\u0027s SOME flex but you expect that. They work in docked-mode ONLY.\u003C/p\u003E\u003Cp\u003EStruts only work between parts of a single craft, but use the same model (scaled down) for the pipes. There\u0027s a very satisfying metallic TINK when they engage too.\u003C/p\u003E\u003Cp\u003EBoth work similarly to how docking struts do, only with ExternalToEVAOnly turned on (so only an EVA Kerbal can make the connections.)\u003C/p\u003E\n"},{"CreatedByName":"Jasmir","CreatedById":76744,"CreatedDateTime":"2013-10-04T17:10:12Z","Content":"\n\u003Cp\u003EHi KospY,\u003C/p\u003E\u003Cp\u003Esorry to say, but the pipes cause still nice explosions by making things spawn into the underground on loading.\u003C/p\u003E\u003Cp\u003EFacts:\u003C/p\u003E\u003Cp\u003E - _all_ Vessels in this scence are spawning into underground. Even the not connected ones.\u003C/p\u003E\u003Cp\u003E -\u0026gt; in this scene, 2 vessels are connected via pipe, 4 are independant.\u003C/p\u003E\u003Cp\u003E - the EVA there spawn at the right place (and get not bounced)\u003C/p\u003E\u003Cp\u003EHere is my safe:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.file-upload.net/download-8142363/persistent.sfs.html\u0022 rel=\u0022external nofollow\u0022\u003Epersistent.sfs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Emy Plugin-Dir:\u003C/p\u003E\u003Cp\u003E14.09.2013 14:29 \u0026lt;DIR\u0026gt; DeadlyReentry\u003C/p\u003E\u003Cp\u003E06.08.2013 18:45 \u0026lt;DIR\u0026gt; EditorExtensions\u003C/p\u003E\u003Cp\u003E06.09.2013 09:57 \u0026lt;DIR\u0026gt; FerramAerospaceResearch\u003C/p\u003E\u003Cp\u003E04.10.2013 14:53 \u0026lt;DIR\u0026gt; KAS\u003C/p\u003E\u003Cp\u003E22.08.2013 16:30 \u0026lt;DIR\u0026gt; Keramzit -\u0026gt; ProceduralFairings\u003C/p\u003E\u003Cp\u003E13.08.2013 17:21 \u0026lt;DIR\u0026gt; Kethane\u003C/p\u003E\u003Cp\u003E29.09.2013 22:26 \u0026lt;DIR\u0026gt; kOS\u003C/p\u003E\u003Cp\u003E30.09.2013 13:27 \u0026lt;DIR\u0026gt; KOSMOS\u003C/p\u003E\u003Cp\u003E05.08.2013 17:58 \u0026lt;DIR\u0026gt; KSPX\u003C/p\u003E\u003Cp\u003E12.09.2013 00:03 \u0026lt;DIR\u0026gt; MagicSmokeIndustries -\u0026gt; Infernal Robotics\u003C/p\u003E\u003Cp\u003E25.07.2013 10:24 \u0026lt;DIR\u0026gt; MechJeb2\u003C/p\u003E\u003Cp\u003E05.09.2013 16:28 \u0026lt;DIR\u0026gt; ModsByTal -\u0026gt; Spherical Fuel Tanks\u003C/p\u003E\u003Cp\u003E21.08.2013 14:50 7.168 ModuleManager.dll\u003C/p\u003E\u003Cp\u003E06.09.2013 20:32 \u0026lt;DIR\u0026gt; NavyFish -\u0026gt; DockingPortAlignment\u003C/p\u003E\u003Cp\u003E19.09.2013 19:59 \u0026lt;DIR\u0026gt; PartCatalog\u003C/p\u003E\u003Cp\u003E22.08.2013 16:30 \u0026lt;DIR\u0026gt; RCSBuildAid\u003C/p\u003E\u003Cp\u003E13.08.2013 17:20 \u0026lt;DIR\u0026gt; SelectRoot\u003C/p\u003E\u003Cp\u003E03.07.2013 15:25 \u0026lt;DIR\u0026gt; Squad\u003C/p\u003E\u003Cp\u003E29.08.2013 23:15 \u0026lt;DIR\u0026gt; StretchyTanks\u003C/p\u003E\u003Cp\u003E09.07.2013 18:51 \u0026lt;DIR\u0026gt; SubassemblyManager\u003C/p\u003E\u003Cp\u003E29.07.2013 22:41 \u0026lt;DIR\u0026gt; TacFuelBalancer\u003C/p\u003E\u003Cp\u003E15.09.2013 15:14 \u0026lt;DIR\u0026gt; Telemachus\u003C/p\u003E\u003Cp\u003E29.07.2013 22:39 \u0026lt;DIR\u0026gt; TriggerTech -\u0026gt; KerbalAlarmClock\u003C/p\u003E\u003Cp\u003E04.10.2013 14:55 \u0026lt;DIR\u0026gt; WarpPlugin\u003C/p\u003E\u003Cp\u003EThe scene in on Mun, try to load the EVA there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T17:26:12Z\u0022 title=\u002210/04/2013 05:26  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Jasmir\u003C/strong\u003E\n\u003Cbr\u003Eadded mod information\n\u003C/span\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-10-04T17:12:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jasmir\u0022 data-cite=\u0022Jasmir\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Emy Plugin-Dir:\u003C/p\u003E\u003Cp\u003E14.09.2013 14:29 \u0026lt;DIR\u0026gt; DeadlyReentry\u003C/p\u003E\u003Cp\u003E06.08.2013 18:45 \u0026lt;DIR\u0026gt; EditorExtensions\u003C/p\u003E\u003Cp\u003E06.09.2013 09:57 \u0026lt;DIR\u0026gt; FerramAerospaceResearch\u003C/p\u003E\u003Cp\u003E04.10.2013 14:53 \u0026lt;DIR\u0026gt; KAS\u003C/p\u003E\u003Cp\u003E22.08.2013 16:30 \u0026lt;DIR\u0026gt; Keramzit\u003C/p\u003E\u003Cp\u003E13.08.2013 17:21 \u0026lt;DIR\u0026gt; Kethane\u003C/p\u003E\u003Cp\u003E29.09.2013 22:26 \u0026lt;DIR\u0026gt; kOS\u003C/p\u003E\u003Cp\u003E30.09.2013 13:27 \u0026lt;DIR\u0026gt; KOSMOS\u003C/p\u003E\u003Cp\u003E05.08.2013 17:58 \u0026lt;DIR\u0026gt; KSPX\u003C/p\u003E\u003Cp\u003E12.09.2013 00:03 \u0026lt;DIR\u0026gt; MagicSmokeIndustries\u003C/p\u003E\u003Cp\u003E25.07.2013 10:24 \u0026lt;DIR\u0026gt; MechJeb2\u003C/p\u003E\u003Cp\u003E05.09.2013 16:28 \u0026lt;DIR\u0026gt; ModsByTal\u003C/p\u003E\u003Cp\u003E21.08.2013 14:50 7.168 ModuleManager.dll\u003C/p\u003E\u003Cp\u003E06.09.2013 20:32 \u0026lt;DIR\u0026gt; NavyFish\u003C/p\u003E\u003Cp\u003E19.09.2013 19:59 \u0026lt;DIR\u0026gt; PartCatalog\u003C/p\u003E\u003Cp\u003E22.08.2013 16:30 \u0026lt;DIR\u0026gt; RCSBuildAid\u003C/p\u003E\u003Cp\u003E13.08.2013 17:20 \u0026lt;DIR\u0026gt; SelectRoot\u003C/p\u003E\u003Cp\u003E03.07.2013 15:25 \u0026lt;DIR\u0026gt; Squad\u003C/p\u003E\u003Cp\u003E29.08.2013 23:15 \u0026lt;DIR\u0026gt; StretchyTanks\u003C/p\u003E\u003Cp\u003E09.07.2013 18:51 \u0026lt;DIR\u0026gt; SubassemblyManager\u003C/p\u003E\u003Cp\u003E29.07.2013 22:41 \u0026lt;DIR\u0026gt; TacFuelBalancer\u003C/p\u003E\u003Cp\u003E15.09.2013 15:14 \u0026lt;DIR\u0026gt; Telemachus\u003C/p\u003E\u003Cp\u003E29.07.2013 22:39 \u0026lt;DIR\u0026gt; TriggerTech\u003C/p\u003E\u003Cp\u003E04.10.2013 14:55 \u0026lt;DIR\u0026gt; WarpPlugin\u003C/p\u003E\u003Cp\u003EThe scene in on Mun, try to load the EVA there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately some of those things can encompass multiple mods. MagicSmokeIndustries for example, I have two from: Reflaginator and Infernal Robotics. We need to know which mods are being used in those.\u003C/p\u003E\n"}]}