{"TopicId":23555,"ForumId":34,"TopicTitle":"[0.21.1] KAS v0.4.3 - Struts, pipes, part storage, containers, merged winches \u0026amp; more","CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2013-04-22T19:15:03Z","PageNum":21,"Articles":[{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-30T06:06:51Z","Content":"\n\u003Cp\u003ESome things I\u0027ve talked about using KAS for:\u003C/p\u003E\u003Cp\u003EResource Pipelines, Airship servicing and docking, bridging multiple landers to make sprawling bases, off-shore resource drilling, and last but certainly not least.....SPACE NUNCHUKS!!!...that last one actually happened, it was not intentional though...\u003C/p\u003E\u003Cp\u003EKAS is also the gateway for other fun stuff via modules. I have a small ssto shuttle with a space station repair kit, also working on a set of replaceable JTOL boosters for getting bigger planes of my carrier on kerbin.\u003C/p\u003E\u003Cp\u003EAlso for your little science rover....pop that sucker in a fairing cap ontop a small lander, put small LF/O tank and a few ant engines on the rover so you can hop it off the lander.\u003C/p\u003E\n"},{"CreatedByName":"GarrettFox","CreatedById":72821,"CreatedDateTime":"2013-06-30T08:47:04Z","Content":"\n\u003Cp\u003EI just wanted to say thanks for this. Some of the mods I find functionally very useful, but none seem to fundamentally alter my ship design, always in an entertaining fashion, quite so much as this one. So thanks for such an awesome mod.\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2013-07-02T03:51:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003EHey guys. Anyone of you have an idea to get a small rover (using the default body) to say like, Duna, that uses KAS?\u003Cp\u003EI\u0027m looking for one that can be strapped to a small rocket \u002B skycrane with parachutes. This is what I made, but I think it\u0027ll be a tad too heavy. It has a fixed arm with a vertical winch \u002B magnet, for RP purposes, can scan the planet surface.\u003C/p\u003E\u003Cp\u003E[!IMG]\u003Ca href=\u0022http://i41.tinypic.com/2z7k0b5.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i41.tinypic.com/2z7k0b5.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFrom what I\u0027ve read in this thread so far, KAS is best used for space stations. But I haven\u0027t really seen anyone talk about getting one to another planet, to serve something like this. Either it being a tow rover to tow damaged rovers back to a base on another planet, or what I want to use it for.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGrab the Firespitter mod. The \u0027bomb bay\u0027 in there also works wonderfully as a cargo bay. Bolt a winch to the ceiling and stick your rover to it. When you\u0027re at your destination, open the doors and gently lower your rover to the ground, tear around for however long you want, then re-attach, winch it back up, close up the bay and off you go again.\u003C/p\u003E\u003Cp\u003EWorks even better if you pair that up with the Hooligan Labs airships. Throw out some grappling hooks to lock your airship down and you can winch stuff down to the surface. I\u0027d actually experimented with little ultralight planes with detachable wings that could fit within those bays... they worked to an extent, but the lack of any ability to properly align wings and body while attaching annoyed me too much to pursue it much further.\u003C/p\u003E\n"},{"CreatedByName":"waffleface","CreatedById":39935,"CreatedDateTime":"2013-07-02T18:43:30Z","Content":"\n\u003Cp\u003ECould you make the \u0027Detach\u0027 function on grappling hooks a toggle mode? Right now it seems like \u0027detach\u0027 only works for a while, but after that the hooks will still attach to any surface. \u003C/p\u003E\u003Cp\u003EAs a practical example I have a rover that uses radial winches with grappling hooks to stabilize itself as its a construction rover. I have action groups set up to first detach all hooks, and then retract cable. What happens is that one set will do it properly, because it\u0027s closer to the ground, but retracting the other set takes longer, and the hooks will re-attach to the ground, literally pulling the rover underground into destruction. Since action groups don\u0027t allow repeated commands, this is kind of a downer.\u003C/p\u003E\u003Cp\u003ETo test: Put a KAS winch on any body, and put another at a higher altitude on some struts. Set both to the same action group for \u0027eject\u0027, and another action group for \u0027detach\u0027 and \u0027retract cable\u0027. The lower ones will work fine, the higher altitude ones will detach, start to retract, and at some point the hooks will re-attach to the ground.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-05T00:27:33Z","Content":"\n\u003Cp\u003EOk. Got another thing here.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/2nvyws8.jpg\u0022 alt=\u00222nvyws8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI need the winch to grab my rover and connect it to the lander and not let go. This is basically to replace the need for Docking Clamps. \u003C/p\u003E\u003Cp\u003EIt actually does this, but it\u0027s not exactly what I want, as the picture shows.\u003C/p\u003E\u003Cp\u003ELet\u0027s say there\u0027s like an invisible spring between the Mini-ASAS module and the strut that allows the module to be there, to my rover. The module is from KSPX.\u003C/p\u003E\u003Cp\u003EI tried using Quantum Struts to secure my rover to the lander, but it keeps my lander from turning when in flight. This isn\u0027t what I want.\u003C/p\u003E\u003Cp\u003EI also tried moving the Micro-ASAS somewhere else, and just have the Radial Connector there. But, I can\u0027t really find a place that looks good, and also doesn\u0027t cause the rover to be weighed down on the front or the back.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T00:32:08Z\u0022 title=\u002207/05/2013 12:32  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-05T00:42:05Z","Content":"\n\u003Cp\u003EYour problem is the small cubic strut you used to attach the micro asas. Those parts when mixed with quantum struts break physics. Your best bet is to put a radially mounted hard point there instead so your winch can connect to it directly.\u003C/p\u003E\u003Cp\u003EQuantum struts are the solution just need to take that little cubic strut out of the equation.\u003C/p\u003E\u003Cp\u003EIt also looks like fuel might be an issue too lol.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T00:44:31Z\u0022 title=\u002207/05/2013 12:44  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-05T00:48:27Z","Content":"\n\u003Cp\u003EI\u0027d love to be able to remove this strut, but the ASAS won\u0027t connect to the rover without it.\u003C/p\u003E\u003Cp\u003EYou mentioned a \u0022radially mounted hard point\u0022. Where is it in the stock parts?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-05T00:52:31Z","Content":"\n\u003Cp\u003EIt\u0027s the KAS radially mounted connector, under Utility. \u003C/p\u003E\u003Cp\u003EYou can hide that ASAS unit inside the rover with part clipping if you actually need asas on a rover (??) there\u0027s also a rover specific asas bring developed with the TT multiwheels pack you might want to look at\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-05T00:59:06Z","Content":"\n\u003Cp\u003EI need ASAS, to keep my rover on a heading. I also prefer the stock wheels. I did check out that mod, and like I said, I prefer the stock wheels.\u003C/p\u003E\u003Cp\u003EAlso I cannot connect the ASAS unit to the connector. I can only connect it to the ASAS unit, which requires the strut to connect the ASAS unit.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-05T01:07:32Z","Content":"\n\u003Cp\u003ETurn on part clipping, place the asas unit inside the rover on the back of the command pod, it\u0027s invisible and still does the job\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-05T01:17:13Z","Content":"\n\u003Cp\u003EThanks. That got it. Finally some good news for once. Now what about the Quantum Struts? With them, the lander won\u0027t turn but the rover doesn\u0027t move.\u003C/p\u003E\u003Cp\u003EWithout them, the lander turns, but so does the rover, which causes the rocket to behave erratically.\u003C/p\u003E\u003Cp\u003EI tried to use the Stack connector port and attach a small Docking Port, and one to replace the Radial connector port of the rover. This works, but again, the rover wiggles back and forth that causes the lander to do the same.\u003C/p\u003E\u003Cp\u003EEdit: Yes!! Ohh hell yes! After two days, I finally got this damn thing into orbit! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Thank you, HoY. That strut was definitely the root of my grief.\u003C/p\u003E\u003Cp\u003EI re-added Quantum Struts to my rover, putting them close to the docking port then wheeling it under the lander, I clamped down and the quantum struts activated and I launched the lander.\u003C/p\u003E\u003Cp\u003EThis time, the lander turned! I was so full of happy that I wasn\u0027t watching where I was doing and it crashed back on Kerbin. Trying it again, I finally managed to achieve orbit. This is an achievement.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T02:49:02Z\u0022 title=\u002207/05/2013 02:49  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003Cbr\u003EIssue solved. Continue with your merry way\n\u003C/span\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-05T05:36:26Z","Content":"\n\u003Cp\u003EMmk.. another problem. Sorry. So I finally got my Rover/Lander to Duna and landed it safely. In the picture, I have that nose and a decoupler to get it off. This was so the docking port wouldn\u0027t be damaged by the accent.\u003C/p\u003E\u003Cp\u003EI accidentally forgot to decouple the thing before I left Kerbin, and did it when I was making my rendezvous with my Space Station orbiting the planet. It caused two debris entities.\u003C/p\u003E\u003Cp\u003EEven though I have the option of how much debris is seen to 0, I was seeing it even when I landed, and it was pretty far away. Like 1.6km or more away.\u003C/p\u003E\u003Cp\u003ESo after I de-clamped my rover to free it, I went to the Space Center, went to the Tracking Station to see if it would reset and get rid of the debris, which it did, I went back to my Lander, the Stack connector port and the Jr Docking Port are gone, leaving only the winch and the connector.\u003C/p\u003E\u003Cp\u003EI looked around to see if I could find them, but it\u0027s like they disappeared.\u003C/p\u003E\u003Cp\u003EHow can I get them back? I spent too much time on this to now have problems, miles away from Kerbin.\u003C/p\u003E\u003Cp\u003E-----------------\u003C/p\u003E\u003Cp\u003EOne other thing, has nothing to do with this. Been thinking about making a base on Duna to launch ships from, using Sphere Launchpads.\u003C/p\u003E\u003Cp\u003ENow for my question. What kind of rover would it take to pick up the largest RocketPart container with a vertical winch \u002B magnet, with the container fully loaded? I want to have one payload that has a bunch of empty, large RocketParts containers strapped to it.\u003C/p\u003E\u003Cp\u003EThen upon reaching Duna and getting this thing where needed, I\u0027ll decouple the parts so they\u0027ll fall to the ground, then use another rover to wheel it over to where I may or may not make something to get RocketParts, then get them and have the rover haul it back.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T08:22:20Z\u0022 title=\u002207/05/2013 08:22  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"_Zee","CreatedById":71167,"CreatedDateTime":"2013-07-07T23:01:31Z","Content":"\n\u003Cp\u003EI\u0027m trying to use this mod in conjunction with EL to establish a working Minmus Base. The way I have my base currently set up, is with 3 separate modules. The Launchpad Module, The Storage Module, And the Kethane Module. The Storage Module stores all the Ore, Metal, and Rocketparts needed for construction. The Kethane Module mines the kethane and converts and stores the fuel. And the Launchpad Module does the actual constructing of the new ship.\u003C/p\u003E\u003Cp\u003EThese are all completely independent modules, that can only communicate with each other using KAS connectors. So first I connect/dock the storage module to the launchpad so the launchpad has the materials needed to spawn the new ship. Once the new ship is spawned, it then needs LiquidFuel/Oxidizer/Mono, etc. So I undock and disconnect the storage module from the launchpad, and then connect/dock the Kethane Module with all the stored fuel directly to the newly spawned ship.\u003C/p\u003E\u003Cp\u003EHere\u0027s where the problem arises. For some reason, as soon as I dock the Kethane Module with the new ship, the 2 start behaving very strangely. Several different things have happened. The Kethane Module will begin tilting and leaning on its landing legs towards the new craft, parts of the new ship will begin leaning and breaking off of the craft, the 2 modules will both begin drifting across the ground. And when I disconnect them, they are permanently stuck in their new orientation. As if a new center of mass has been determined. Instead of sitting upright with all 8 landing legs firmly on the ground, it will instead teeter-totter on 1 or 2 legs almost completely on its side, but in a fairly stable way, as if its supposed to be sitting that way.\u003C/p\u003E\u003Cp\u003EIt\u0027s very frustrating and I\u0027ve tried everything I can think of to stop it from happening. And this all occurs before anything has even left the ground, and all before any fuel has even begun to transfer, mind you.\u003C/p\u003E\u003Cp\u003EDoes anyone have any idea of what I am talking about or what the solution is?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-07T23:08:35Z\u0022 title=\u002207/07/2013 11:08  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 7, 2013\u003C/time\u003E by _Zee\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-07T23:25:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Zee\u0022 data-cite=\u0022_Zee\u0022\u003E\u003Cdiv\u003E~snip~\u003Cp\u003EDoes anyone have any idea of what I am talking about or what the solution is?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, a couple things could be going on here. First of all are you running LazorSystems(or any part of it)? I know the lazor thread says its been fixed to work with KAS, but I have still had issues with ships that have KAS and kethane parts with lazors installed. As far as I know there is no work around for this, and it in fact does not happen all the time.\u003C/p\u003E\u003Cp\u003EAlso another thing to consider. When you connect a plug to a connection port in \u0027docked mode\u0027 as far as the game is concerned its just like two ships connected with clamp-o-trons. So when you said it seems like a new CoM is established you are correct, since once pluged the 2 ships become a single vessle. One thing that helps (sometimes) in situations like this is to plug up in \u0027undocked mode\u0027 and then change it to docked afterwards.\u003C/p\u003E\u003Cp\u003Ereason i suggested you post here is that mod devs dont really like their threads getting hi-jacked to solve issues with other mods, esp ones with active threads =)\u003C/p\u003E\n"},{"CreatedByName":"HalfdeadKiller","CreatedById":71079,"CreatedDateTime":"2013-07-08T00:41:53Z","Content":"\n\u003Cp\u003EDoes anyone have trouble placing KAS stuff in Munar Orbit? The ghost just stays yellow even after editing placement distance.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-07-08T00:48:50Z","Content":"\n\u003Cp\u003ESo has anyone heard from KospY in a while? Is development of KAS still continuing?\u003C/p\u003E\n"},{"CreatedByName":"_Zee","CreatedById":71167,"CreatedDateTime":"2013-07-08T07:08:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EOk, a couple things could be going on here. First of all are you running LazorSystems(or any part of it)? I know the lazor thread says its been fixed to work with KAS, but I have still had issues with ships that have KAS and kethane parts with lazors installed. As far as I know there is no work around for this, and it in fact does not happen all the time.\u003Cp\u003EAlso another thing to consider. When you connect a plug to a connection port in \u0027docked mode\u0027 as far as the game is concerned its just like two ships connected with clamp-o-trons. So when you said it seems like a new CoM is established you are correct, since once pluged the 2 ships become a single vessle. One thing that helps (sometimes) in situations like this is to plug up in \u0027undocked mode\u0027 and then change it to docked afterwards.\u003C/p\u003E\u003Cp\u003Ereason i suggested you post here is that mod devs dont really like their threads getting hi-jacked to solve issues with other mods, esp ones with active threads =)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I\u0027ve never used the Lazor mod. And I know about the hijacking thing. My post on the EL thread was an inquiry about EL. Mentioning KAS was just sharing relevant information. No hijacking took place.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-08T12:50:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EYour problem is the small cubic strut you used to attach the micro asas. Those parts when mixed with quantum struts break physics. Your best bet is to put a radially mounted hard point there instead so your winch can connect to it directly.\u003Cp\u003EQuantum struts are the solution just need to take that little cubic strut out of the equation.\u003C/p\u003E\u003Cp\u003EIt also looks like fuel might be an issue too lol.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the small cubic strut dangerous all the time? or just then used for the structural part? \u003C/p\u003E\u003Cp\u003EIf the asas was mounted on the side would it still cause an problem?\u003C/p\u003E\n"},{"CreatedByName":"T-Pilot395","CreatedById":42189,"CreatedDateTime":"2013-07-08T13:31:55Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fgEaUCs.png\u0022 alt=\u0022fgEaUCs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI thank you for making such a mod. My scrap deorbiter can haul debris in with minimal effort.\u003C/p\u003E\u003Cp\u003EAlso, it sucks fuel from the debris using the Lazor System. Talk about taking the leftovers.\u003C/p\u003E\u003Cp\u003ENote you can\u0027t see the cable, but it\u0027s attached to a piece of debris and isin the process of drawing fuel from it.\u003C/p\u003E\u003Cp\u003EAnd thanks for giving me the idea of compact engineering. The amount of stuff squeezed there onto the small tank is a new technique I learned.\u003C/p\u003E\n"},{"CreatedByName":"robot256","CreatedById":67902,"CreatedDateTime":"2013-07-09T14:57:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Zee\u0022 data-cite=\u0022_Zee\u0022\u003E\u003Cdiv\u003Esnip\u003Cp\u003EDoes anyone have any idea of what I am talking about or what the solution is?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E_Zee, I have the same problem with my refueling bases. Occasionally, usually shortly after plugging (docked) but also after unplugging or sometimes spontaneously, my landers will start slowly rotating, and stop responding to external torque. Linear force and collisions are still applied. Sometimes when I unplug the connector and retract, the connector starts spinning around the winch and seems to jack the ship up when it hits the ground. It happens almost exclusively to craft with winches--my miners and tankers have only connectors and have never given me trouble.\u003C/p\u003E\u003Cp\u003EMy solution is to quickly return to spaceport, go to tracking station, and fly craft, so it reloads the craft, restarts the physics, and flops back down. Do this as soon as it starts to tilt so it doesn\u0027t fall too far. After that, it generally behaves for a while, at least until I unplug the connectors again. This is with Mechjeb, Kethane, KAS, and RemoteTech but no Lazor system. \u003C/p\u003E\u003Cp\u003EI don\u0027t remember if I\u0027ve seen it happen in orbit, but I got tired of winches breaking off and buggy connector unplug operations exploding my Kerbals off into space and reverted to docking ports for most of my refueling operations. It doesn\u0027t seem to happen unless I\u0027m actively using the winch on a craft.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-09T15:00:49Z\u0022 title=\u002207/09/2013 03:00  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 9, 2013\u003C/time\u003E by robot256\u003C/strong\u003E\n\u003Cbr\u003Eclarified symptoms\n\u003C/span\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-09T19:41:47Z","Content":"\n\u003Cp\u003EQuestion: How can I recharge a ship\u0027s power with KAS? I tried connecting a standard connector with a detatchable Connector Port to a module designed for power, and tried to right click on the winch for that, then hit ALT on the connector, and it does nothing.\u003C/p\u003E\u003Cp\u003EAny ideas? This is for a base I\u0027m setting up on Duna. I need to have a staging area for my rovers to refuel and recharge.\u003C/p\u003E\n"},{"CreatedByName":"Gristle","CreatedById":60589,"CreatedDateTime":"2013-07-09T19:55:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003EQuestion: How can I recharge a ship\u0027s power with KAS? I tried connecting a standard connector with a detatchable Connector Port to a module designed for power, and tried to right click on the winch for that, then hit ALT on the connector, and it does nothing.\u003Cp\u003EAny ideas? This is for a base I\u0027m setting up on Duna. I need to have a staging area for my rovers to refuel and recharge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to use \u0022Docked\u0022 mode to transfer resources.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-09T20:12:05Z","Content":"\n\u003Cp\u003EAh, thanks. I will try this. I was confused on the difference between Docked and Undocked.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-09T21:08:58Z\u0022 title=\u002207/09/2013 09:08  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 9, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-15T00:14:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022robot256\u0022 data-cite=\u0022robot256\u0022\u003E\u003Cdiv\u003E_Zee, I have the same problem with my refueling bases. Occasionally, usually shortly after plugging (docked) but also after unplugging or sometimes spontaneously, my landers will start slowly rotating, and stop responding to external torque. Linear force and collisions are still applied. Sometimes when I unplug the connector and retract, the connector starts spinning around the winch and seems to jack the ship up when it hits the ground. It happens almost exclusively to craft with winches--my miners and tankers have only connectors and have never given me trouble.\u003Cp\u003EMy solution is to quickly return to spaceport, go to tracking station, and fly craft, so it reloads the craft, restarts the physics, and flops back down. Do this as soon as it starts to tilt so it doesn\u0027t fall too far. After that, it generally behaves for a while, at least until I unplug the connectors again. This is with Mechjeb, Kethane, KAS, and RemoteTech but no Lazor system. \u003C/p\u003E\u003Cp\u003EI don\u0027t remember if I\u0027ve seen it happen in orbit, but I got tired of winches breaking off and buggy connector unplug operations exploding my Kerbals off into space and reverted to docking ports for most of my refueling operations. It doesn\u0027t seem to happen unless I\u0027m actively using the winch on a craft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the same issue, but you don\u0027t even need to go through all that hassle to fix. Just hit F5 to do a quick save, then hit F9 to load the quicksave. Only takes about 5 seconds and it resets everything back to normal. I don\u0027t know what causes it, but i\u0027ve just gotten into the habit of hitting F5 immediately after i either connect or disconnect the winch.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-16T02:13:29Z","Content":"\n\u003Cp\u003EIs it possible to disable key control by default of Winches? I don\u0027t see an option anywhere in the KAS folder, and I\u0027m tired of having to tell it to turn it off when I\u0027m not using it.\u003C/p\u003E\u003Cp\u003EI have Numpad 2 bound to my ship\u0027s controls.\u003C/p\u003E\u003Cp\u003EAlso, this has been mentioned before, but I use a Winch to reel in ships that have no docking port to my space station. Unfortunately, the speed the winch pulls is a bit excessive. And when the ship hits the station... it\u0027s not pretty. I had it shake itself apart. \u003C/p\u003E\u003Cp\u003EAn option to set the speed of the winch (especially in space) would be nice.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T09:09:44Z\u0022 title=\u002207/16/2013 09:09  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"}]}