{"TopicId":24037,"ForumId":32,"TopicTitle":"Coming In For A Perfect Landing When... OOPS!","CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-04-25T14:21:57Z","PageNum":1,"Articles":[{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-04-25T14:21:57Z","Content":"\n\u003Cp\u003EI was slowing down for a perfect landing at ground level but didn\u0027t watch where I was going (so used to having a sparse landscape). The lander was designed for low gravity moons so landing on Kerbin was a stress test. It should JUST make a decent landing under parachute and nuke rocket.... but the height of the VAB screwed it up. Was amazed the whole thing didn\u0027t blow up tbh.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uabAHah.jpg\u0022 alt=\u0022uabAHah.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-04-25T15:38:56Z","Content":"\n\u003Cp\u003ENice Job landing on the VAB! Sure, you lost a few things, but it looks awesome.\u003C/p\u003E\n"},{"CreatedByName":"SollyK","CreatedById":57504,"CreatedDateTime":"2013-04-25T15:42:50Z","Content":"\n\u003Cp\u003ENow your gonna have to build a rescue crane to get that thing of there. Sounds like fun. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-04-25T18:07:43Z","Content":"\n\u003Cp\u003EActually I got them off by hitting the abort button because the top part is a mini lander hehe. You can see the legs I had just extended when I thought to take the screenshot. Hit the abort and those sepatrons fire and blew me right off the roof. Nearly screwed up though as I had forgotten that I had already used the parachutes and then had to land on the retro thrusters and I was a little late and slammed into the ground and smashed the rest of the ship to bits but Jeb and Bill crawled out of the wreckage lol.\u003C/p\u003E\u003Cp\u003EOh and landing on the VAB would have been more impressive if I had done it on purpose. When I hit the roof I think I jumped a mile because I wasn\u0027t expecting it heh.\u003C/p\u003E\n"}]}