{"TopicId":24403,"ForumId":39,"TopicTitle":"Live Stream: The Kerbin Mission, Kerbin Academy...and other stuff !","CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-04-27T21:36:31Z","PageNum":1,"Articles":[{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-04-27T21:36:31Z","Content":"\n\u003Cp\u003E\nGreetings,\n\u003C/p\u003E\n\u003Cp\u003E\nI will be updating my active live stream times and dates here, and whenever I am running the \u0027REAL\u0027 Kerbin Mission where Kerbals actually can, become paydirt...but we hope that dont happen and make every effort to prevent this - we still have yet to work on the safety mission training !!!!!!!\n\u003C/p\u003E\n\u003Cp\u003E\nI have started the \u0027Kerbin Mission\u0027 fan-works thread where I will be posting the mission story...and nice to say that music is part of it ! In fact, have you ever seen that Penguin movie (?)...what happy feet ... I have one Kerbal who is kind of a nut case, and I misplaced him...can you guess who it mite be?\n\u003C/p\u003E\n\u003Cp\u003E\nWell he wrote a suggestion to me, then promptly dissappeared...perhaps more info is in my fan-works thread...?\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes I play guitar and jam with some youtube toonz before going to Academy and running simulations; one of my ways to relax and have fun; sometimes I dont get to work on KSP (!); but it\u0027s all good and that\u0027s what counts!\n\u003C/p\u003E\n\u003Cp\u003E\nUpdating - I will be doing up a stream to give a recap on the Kerbin Mission, what exactly Kerbin Academy is, and continuing on with...Safety Protocols tonite (!); along with more rocket building later probly:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI will be on a little bit later; when I am ready I will be posting an update in the fan area !...I had great success with my roket designs so far, so progress is being made and I am really wanting to get some kind of a space station built in the real mission !\n\u003C/p\u003E\n\u003Cp\u003E\nCheck out my \u0027fan\u0027 posts for more information.\n\u003C/p\u003E\n\u003Cp\u003E\n(PS - I redid this thread cause I made a typo in the other one\u0027s title - ugh !\n\u003C/p\u003E\n\u003Cp\u003E\nCdr Zeta\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-07T15:04:19Z\u0022 title=\u002205/07/2016 03:04  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 7, 2016\u003C/time\u003E by Cdr_Zeta\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-02T00:27:57Z","Content":"\n\u003Cp\u003EIn a few minutes when I get settled, I will be going over the Asparagus Fuel system, problems with fuel deployment, and a stage sequence I use for all my main payload lifting to orbit.\u003C/p\u003E\u003Cp\u003EI havnt figured out the proper weight yet for best results, nor have I figured out the most efficient system.\u003C/p\u003E\u003Cp\u003EThere is a major time element in KSP, and the efficiency versus time is an expense we may not be happy with.\u003C/p\u003E\u003Cp\u003ELets get in to the game, get into space, cause in the end, the fuel we have left may not be fuel we need (!); but the time lost in playing...well...we cant replace that.\u003C/p\u003E\u003Cp\u003EI am going to demonstrate this tonite !\u003C/p\u003E\u003Cp\u003Ecdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-03T01:20:04Z","Content":"\n\u003Cp\u003EGreetings !\u003C/p\u003E\u003Cp\u003EAfter some problematic, problems earlier I deleted the pre-launch stream...hopefully I get it right this time ! I ended up with an almost exploded rescue plane and Bill and Jeb in the middle of an ocean !\u003C/p\u003E\u003Cp\u003EBlamed on file confusion and Kerbin Academy Simulator glitches !\u003C/p\u003E\u003Cp\u003ESo tonite I am tryin again to get it right! If all goes well there will be about 2 or 3 parts, then all SIMULATED activities are design and test, probly with probes; any future design, build, and test will be in the real mission!\u003C/p\u003E\u003Cp\u003EWhenever this gets going, I will post the updates in my fan section thread!\u003C/p\u003E\u003Cp\u003EI kinda like the roleplay of it all...just a little creativeness comin out !\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-05T02:01:55Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EWe had some interesting \u0027sim\u0027 flights lately (!); I will report in the fan-works in a few days I been kinda busy an lazy - wait busy at bein lazy?...\u003C/p\u003E\u003Cp\u003EI am still going over my lifter rocket designs and have been setting on one main design idea - hop on over and check it out I will be building 2 of the main designs tonite - this isnt for the squimish !\u003C/p\u003E\u003Cp\u003EThere may be a few failed (somewhat) launches, but they are meant to be a leanring process for me as well - learn by practicing (in the \u0027SIMULATOR\u0027 !); someday soon the launches will be for real !\u003C/p\u003E\u003Cp\u003EI have made a few simulated trips out to DUNA, and am working up storylines (roleplay I guess !) to add to the motivational aspects of making the game more enjoyable, for how I seem to like to play it. (I guess this is meant for some people who seem to be bored and dont know what else to to do; some mind you as there arent many who roleplay).\u003C/p\u003E\u003Cp\u003EI did some roleplay last nite quite ad-lib and lo a story is happening all on it\u0027s own...partly due to my space experiences (ya know movies, books, etc).\u003C/p\u003E\u003Cp\u003ETonite it is mostly testing and building and demo of my main designs; re-building from scratch again cause I like to start over a lot...\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-08T00:35:01Z","Content":"\n\u003Cp\u003EHowdi,\u003C/p\u003E\u003Cp\u003ELets give this baby a whirl shall we....: (!)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.blender.org/download/get-blender/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.blender.org/download/get-blender/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI read where it can export to .dae which is a Unity file for the game objects...ugh!\u003C/p\u003E\u003Cp\u003ELucky I got some brains...just some (!)...I started with animation and doin some things with the program but gave up on it...!\u003C/p\u003E\u003Cp\u003EHop on over and watch me botch this one up ! Ya never know tho....\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHopefully I will do a relaunch SIM of my Mir project and will go over the Mir.\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-08T15:28:56Z","Content":"\n\u003Cp\u003EHowdi,\u003C/p\u003E\u003Cp\u003EI gonna be lookin for a tutorial, maybe building some parts...\u003C/p\u003E\u003Cp\u003ENot sure how long I will be on...then hopefully workin on KSP\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-08T23:19:40Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003ECheck out Twitch if yer not busy - I am sure you will find us streamers out here...including me !\u003C/p\u003E\u003Cp\u003EThanks for all the views !\u003C/p\u003E\u003Cp\u003EI ran a few Blender streams today - quite boring and difficult for me but I got thru about 1/4 of it ! I can build stuff now; sort of ! \u003C/p\u003E\u003Cp\u003EI am lookin to build a mission control center mod for planet, moon, and space station bases; and we are gettin seats for our Kerbies (!); how kool is that !\u003C/p\u003E\u003Cp\u003ETonite I am workin on the Mir project SIM, doin reliability and safety emergency escape testing; I am almost done with the SIM portion after a week and a half!\u003C/p\u003E\u003Cp\u003EI will be workin on payload designs later I hope, and do some dock attempts; all in the SIM Academy though.\u003C/p\u003E\u003Cp\u003EAll I have left is a few smaller rocket launches for reliability tests, some orbital stuff...I am almost doen with the majority of my SIM work and ready to send these Kerbals to their fates !\u003C/p\u003E\u003Cp\u003ECdr Zeta \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-10T02:48:46Z","Content":"\n\u003Cp\u003EHowdi,\u003C/p\u003E\u003Cp\u003EI will be streaming a radio broadcast interview with Commander Zeta and KSP Radio, as well as running the SIM to test new materials and try to setup basic pod design.\u003C/p\u003E\u003Cp\u003EThe Mir project is nearly completed and ready for the mission and live launches; it will be the first space station per our Space Engineers\u0027 requests; dont ask me why we are doing difficult things first...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESee ya there...\u003C/p\u003E\u003Cp\u003EOh I may also load up Blender first and try to build some simple items...\u003C/p\u003E\u003Cp\u003EA notice has been written up in my fan-works thread !\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-10T22:57:38Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003ETime to create things...?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am building an active Mission Control Center for KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E !\u003C/p\u003E\u003Cp\u003EAll music is freely available on youtube case anyone is curious; I pool all my music from there.\u003C/p\u003E\u003Cp\u003EMy streams only last a few days; I finaly figured out how to save them too!!\u003C/p\u003E\u003Cp\u003ECheck out the streams at Twitch TV - KSP Streams that is !!\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-12T03:27:15Z","Content":"\n\u003Cp\u003EGreetings...\u003C/p\u003E\u003Cp\u003ERoll call ... ?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EActive streamin a few moments...there may be multiple parts thru-out the weekend...last report will be entered when the roll call (etc) has been completed...\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-13T01:37:29Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EWorking on finalizing my payload lifters...\u003C/p\u003E\u003Cp\u003EHop on over... !\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-14T19:04:30Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI havnt streamed for a few nites, cause... I been workin on the Kerbin Mission Roleplay !\u003C/p\u003E\u003Cp\u003ESome ideas started poppin into my head - I was workin this roleplay idea anyways, but suddenly a few thigs took off into space - literally (!); well almost literally but not yet really - but will soon !!!\u003C/p\u003E\u003Cp\u003EAs you know I been runnin the SIMULATOR at Kerbin Academy alot; gettin to know the game mechanics, building, designing etc...and testing my designs.\u003C/p\u003E\u003Cp\u003EMost of which have been my own. I have taken some ideas from out there in space, but some of them really didnt seem to work well, so I modded them (not literally!).\u003C/p\u003E\u003Cp\u003EThen I scaled down alot realizing about the lagg issues.\u003C/p\u003E\u003Cp\u003EI wont spoil anything here - you will just have to check out my Fan Works thread for the updates!\u003C/p\u003E\u003Cp\u003EKeep tabs there cause I think it will be alot of fun !\u003C/p\u003E\u003Cp\u003EYes I have seen some \u0027videos\u0027 to get ideas, but I have also seen a trend which I am not, well, excited about, and dont generally incorporate it into my \u0027roleplay theme\u0027; you all will figure that out soon enuf.\u003C/p\u003E\u003Cp\u003EMy Fan Works Thread is at:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI found a way to save Twitch files forever - so that is a good thing; now I can start the Kerbin Mission - as I am sure oyu all have been waiting so anxiously to see (!) - and can save the streams - I hope.\u003C/p\u003E\u003Cp\u003EI will try to do a major recap of designing, building, and flying in the beginning; everything I have learnt in a nutshell once I get ready.\u003C/p\u003E\u003Cp\u003EThe journey will be all about discovery, improving relationships, and gaining senses of accomplishment in a really big universe out there !\u003C/p\u003E\u003Cp\u003EWish me luck - The Kerbin Mission Roleplay is on a roll ...\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-18T23:19:22Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI gonna take it easy for abit; I have laid down the tracks (lol) for the mini-ARG in place...tonite I am gonna play Blender, mess about with my modelling programs; run a few tutorials and try to follow them maybe.\u003C/p\u003E\u003Cp\u003EI dont know if I am up for a live \u0027real\u0027 mission yet. I told Bill (or Bob? I forget now) and Jeb to take a few weeks off and go camping; once the missions begin...woohoo th docking fun begins...ugh.\u003C/p\u003E\u003Cp\u003EHop on over to TwitchTV and check out the streams folks !\u003C/p\u003E\u003Cp\u003EI havnt felt all that great...I need to look at rendering vids too.\u003C/p\u003E\u003Cp\u003EAfter thats all done I may go back and rerun the SIM for our lifter rockets; I till need to iron out a few things.\u003C/p\u003E\u003Cp\u003EI havnt been happy with the ASP system; I may end up goin full out on fuel as safety is paramount; I would defintely pay more for a safer mission.\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-20T02:37:43Z","Content":"\n\u003Cp\u003EHowdi, \u003C/p\u003E\u003Cp\u003EWow lots of posts a day I cant get thru them all...\u003C/p\u003E\u003Cp\u003EI was gonna run my \u0027REAL\u0027 Kerbin Mission tonite then somethin came up and now I am like not motivated to even move let alone type.\u003C/p\u003E\u003Cp\u003ESukks when things in life get you down and some things kinda well you cant control them; you are somewhat forced at the whim of others if you want to preserve what little dignity you have - sorry I am ranting abit - I know ther been some threads here about people havin a tough time with KSP - ME TOO so yer not alone !\u003C/p\u003E\u003Cp\u003EI am glad I have found this new challenge of KSP, having added the Kerbin Mission ARG to the action (still hoping for some activity in there dont be shy !!!) - I will be advertizing the ARG elsewhere as well.\u003C/p\u003E\u003Cp\u003EAs for tonite; well as you have read my motivation just dropped alot - watchin a few SCI FY movies helps - dreamin about how I need to make my man cave bigger to support my bigger tv screen ! Arghhh...what\u0027s a KSP\u0027er to do...stream I guess...\u003C/p\u003E\u003Cp\u003EI have been thru my final lifter designs in the Kerbin Space Academy SIM; playing with Blender on occasion and that is getting better (!); playing my getar once in awhile; so now I dunno I need to take care of some personal stuff now my mind is buggered all up; tijme for movies I guess...\u003C/p\u003E\u003Cp\u003EAnd yes \u0027DO\u0027 go over to TwitchTV and watch other peoples\u0027 streams; I do; I may just end up doing that over my own tonite; I dunno.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EC Ya\u0027s around the galaxies...\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-21T02:58:25Z","Content":"\n\u003Cp\u003EHowdi,\u003C/p\u003E\u003Cp\u003EI will be goin thru a bit of a slow down this week - however I am wokring on designing and building stuff in modelling programs; although this isnt KSP directly, people who make vids and streams etc use this stuff - oh yeah and MODS too! And of course there is the ARG\u0026lt;\u0026lt;\u0026lt;\u0026lt;\u0026lt;\u0026lt;\u003C/p\u003E\u003Cp\u003EIf you want to learn more about this and get involved:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29273-ARG-Alternate-Reality-Game-The-Kerbin-Mission-Cdr-Zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/29273-ARG-Alternate-Reality-Game-The-Kerbin-Mission-Cdr-Zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you have any questions to ask me regarding the ARG that is the place to ask! ^^^^^\u003C/p\u003E\u003Cp\u003EThe actual ARG portion of \u0022The Kerbin Mission\u0022 is located here: (This is where the KSP community and others get involved in the discussion to solve the various mysteries presented in the ARG; I forgot; I need to organize it better and provide names for each mini-mystery!)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29276-The-Kerbin-Mission-ARG\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/29276-The-Kerbin-Mission-ARG\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022The Kerbin Mission\u0022 main storyline (where people DO NOT WRITE IN POSTS !!!) is located here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt is here where the story takes place...I have made a major update there (^^^^^)so check it out!\u003C/p\u003E\u003Cp\u003EIn all cases there may or may not be mention of current LIVE STREAMS. Much of the ARG is behind the scenes; you have to research everything from A to Z; sometimes the ARG can be difficult towards the end depending on the mystery. There are websites involved as well.\u003C/p\u003E\u003Cp\u003EI am working on building buildings (lol), learnin how to render vids, workin in Blender...I gonna be doin this alot this week; if anyone is interested:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEvery so often I may make a short live stream and leave clues; or post on the website; clues can be found anywhere; even in OOC posts; anything and anyplace is fair game. The only thing I dont do is get involved in other games to find clues; most everything will be public on the web.\u003C/p\u003E\u003Cp\u003EGood Luck!\u003C/p\u003E\u003Cp\u003Efor your enjoyment\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/YVt5mTkO_VY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u002B\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/odOonolh_ws?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E = ?\u003Cp\u003ECdr Zeta \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-21T03:03:54Z\u0022 title=\u002205/21/2013 03:03  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 21, 2013\u003C/time\u003E by Cdr_Zeta\u003C/strong\u003E\n\u003Cbr\u003Etypos\n\u003C/span\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-21T14:28:54Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EWho is one of our just favorite l\u0027il cartoon characters?\u003C/p\u003E\u003Cp\u003EWell as I was thinkin to get back on \u0027Blender\u0027 today, after having built up some scawny lookin chairs and a conference table, I thought it is time to build a character; I think \u0027Blender\u0027 can do that and even animate it.\u003C/p\u003E\u003Cp\u003EI am clueless about animation...but I also want to operate as third person and other programs may add that for me.\u003C/p\u003E\u003Cp\u003EI figure if I build up this particular \u0027toon\u0027 character (in 3D of course!), and make a few mistakes on him (haha) he wont mind. This character is pretty resilient I think...and would you believe now I just thought why not build a 4-legged critter - they wont care if I mess them up either!\u003C/p\u003E\u003Cp\u003EHave patience though I am a slow learner - but feel free to hop on over; and if anyone is fluent in these areas feel free to chime in !\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-21T14:31:14Z","Content":"\n\u003Cp\u003EMy thread got moved out of General !\u003C/p\u003E\u003Cp\u003ESweet ! We have our own production threades people ! NICE !\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-22T14:36:56Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EAll this week I will be working on...\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003C/p\u003E\u003Cp\u003EStatic Displays, Parade Route Setup and Parade Vehicles, Building Layout and Design, and Ground Cutting Ceremonies (or somethin like that HAHA).\u003C/p\u003E\u003Cp\u003EThere may be fireworks; there may be an actual Parade...\u003C/p\u003E\u003Cp\u003EAll of this is to welcome back Jeb and Bill from their first orbit around Kerbin.\u003C/p\u003E\u003Cp\u003EActivities around the launch center are booming - literally ! Well ya sort of -we do have a cleanup crew thankfully - they been workin overtime !\u003C/p\u003E\u003Cp\u003EI will be streaming, but mostly music for me to listen to while I work on the displays for the air show - oh yeah did I mention - there will be an airshow, games, rides for the kerbal kiddies and more...\u003C/p\u003E\u003Cp\u003EI will keep you all posted..oh and also - this event does not coincide with any Earthly event - we want to get Jeb and Bill back ASAP so we can get our exploration missions underway.\u003C/p\u003E\u003Cp\u003EBut before we do that we need to have ground-breaking ceremonies ! We will be building a new Mission Control Center, the Kerbin Astronomical Observatory, a Comms Center, a DATA Center, and whatever else we can think of...all of these buildings will be fully operational and accessible.\u003C/p\u003E\u003Cp\u003EWish us luck and see you around the streams...you never know what may pop up there !\u003C/p\u003E\u003Cp\u003ECommander Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-23T19:54:54Z","Content":"\n\u003Cp\u003EGreetings,\u003C/p\u003E\u003Cp\u003EThere has been an update on the DATA Center.\u003C/p\u003E\u003Cp\u003EThe main site link is below in the SIG; plans are being made to move the site; the SIG will be changed when this is done.\u003C/p\u003E\u003Cp\u003EThe DATA Center link is on the menu.\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-24T00:41:13Z","Content":"\n\u003Cp\u003EGreetings !\u003C/p\u003E\u003Cp\u003EThis is a busy week for the Kerbal Space Engineers ! The crews have been working day and night to get ready for the first annual Kerbin Days celebrations.\u003C/p\u003E\u003Cp\u003EKerbin Days are where people from Earth and KSP Engineers are recognized for their various duties in the KSP.\u003C/p\u003E\u003Cp\u003EWho knows who will be spotlighted - or roasted ! This was an idea proposed by Bill Kerman, our oldest KSC member and founder of KSC.\u003C/p\u003E\u003Cp\u003EGenerally, Kerbin Days will follow some various Earth Day Holidays:\u003C/p\u003E\u003Cp\u003ENew Years - Earth and Kerbin (?!)\u003C/p\u003E\u003Cp\u003EMemorial Day(s)\u003C/p\u003E\u003Cp\u003EFlag(s) Day (!?)\u003C/p\u003E\u003Cp\u003EIndependance Day(s)\u003C/p\u003E\u003Cp\u003ERussia Day\u003C/p\u003E\u003Cp\u003EVeterans Day\u003C/p\u003E\u003Cp\u003Eand some other of the various esoteric holidays.....\u003C/p\u003E\u003Cp\u003ELinks appropriate for the holidays will be located on the main website (located in the SIG here as always).\u003C/p\u003E\u003Cp\u003EThis weekend will be the first Kerbin Days celebration...we look to recognize some astronauts who have given their lives in the pursuit of great dreams - to explore space. We celebrate their lives and what they have given us and contributed to the various space programs.\u003C/p\u003E\u003Cp\u003EWe are looking at either Saturday or Sunday afternoon for the event; preparations are underway !\u003C/p\u003E\u003Cp\u003EUpdates will appear here and on the website when they are ready; we are revamping the website(s) !\u003C/p\u003E\u003Cp\u003EWish us luck !\u003C/p\u003E\u003Cp\u003EThe Kerbin Mission begins ... Jeb and Bill need to be rescued and they will be recognized in the celebrations on their successful first time orbits around Kerbin.\u003C/p\u003E\u003Cp\u003ECommander Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-25T17:11:03Z","Content":"\n\u003Cp\u003EGreetings From Commander Zeta on Planet Earth\u003C/p\u003E\u003Cp\u003EThe prelaunch activities for Kerbin Days has officially begun. Unfortunately I am still back on Earth tidying up some minor details prior to my hyperjump to Kerbin.\u003C/p\u003E\u003Cp\u003EI may be releasing some of my flight activities here on Earth for your review; details are sketchy.\u003C/p\u003E\u003Cp\u003EMy fellow Kerbal Space Engineers assure me that all is going well for the static displays setup... Rescue Ops are underway for Jeb and Bill; we hope for their safe return.\u003C/p\u003E\u003Cp\u003EI hope to be pleasantly surprised when I return...I have many personal issues to attend to, but I am on my way back.\u003C/p\u003E\u003Cp\u003EThe most important issue at hand is the remembrance of our fellow astronauts; I hope to get this done today.\u003C/p\u003E\u003Cp\u003EThe stream is up; however there may be several breaks both intentional and unintentional as the program proceeds...\u003C/p\u003E\u003Cp\u003EUntil then....Please visit for mission updates:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/26149-The-Kerbin-Mission-Commander-Zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe stream is at:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOfficial Kerbin Days Begins This Day May 25 2013 13:13 Hours ...\u003C/p\u003E\u003Cp\u003ECdr Zeta Signing Off.\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-26T00:38:32Z","Content":"\n\u003Cp\u003EGreetings:\u003C/p\u003E\u003Cp\u003EI will be flying (in FSX !) over a few areas over our wonderful planet tonite for about 1 hour or so; long enough to obtain certain \u0027clandestine\u0027 communications data to be taken to Kerbin.\u003C/p\u003E\u003Cp\u003EThis is a collection of data retrived by the various organizations studying anamolies in outer space on Earth; recent events have made the data ready to be collected by special equipment on board the T45 I will be flying.\u003C/p\u003E\u003Cp\u003ESpecial transportation devices brought here by the GSC allow me to travel instantly to anyplace on the planet in an instant; this in part fue to my cryo features I must employ to allow the reorganization of my molecules!\u003C/p\u003E\u003Cp\u003ESo far I only have 2 or 3 areas I am aware of; I get information on the data retrieval after every flight to insure security.\u003C/p\u003E\u003Cp\u003ELet the flightsbegin...(You will be seeing me research data on the web to gain info as to where I need to go; I cannot communicate any data across chat!)...if there are any technical issues; they will be explained in chat.\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-26T18:07:34Z","Content":"\n\u003Cp\u003EGreetings:\u003C/p\u003E\u003Cp\u003EKerbin Days is now officially open ! There\u0027s food, games, static displays, fun for the kerby-kiddies....\u003C/p\u003E\u003Cp\u003EUnfortunately....the game and my whole computer system is laggin quite abit....\u003C/p\u003E\u003Cp\u003EC\u0027Mon over...the ceremonies will last about an hour due to game lagg...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI will wait for a few people....\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E After 5 or so show up the show begins...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-26T18:14:57Z\u0022 title=\u002205/26/2013 06:14  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 26, 2013\u003C/time\u003E by Cdr_Zeta\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-26T19:53:14Z","Content":"\n\u003Cp\u003EGreetings:\u003C/p\u003E\u003Cp\u003EKerbin Days Opening Celebrations Are Completed - Sorry you missed the show !\u003C/p\u003E\u003Cp\u003EIt was very difficult to get thru because of game lagg I finally experienced; I was not able to load the heavy statics; I will try to load them tonite and run the games tonite; be there or be square !\u003C/p\u003E\u003Cp\u003EHere is the link for the Ceremonies !!!\u003C/p\u003E\u003Cp\u003EWe have yet to do ground breaking as well...I will try to get that done too...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/cdr_zeta/c/2336011\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/cdr_zeta/c/2336011\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Kerbin Mission Begins !\u003C/p\u003E\u003Cp\u003EDont forget the ARG (!)...\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-27T03:45:33Z","Content":"\n\u003Cp\u003EGreetings,\u003C/p\u003E\u003Cp\u003EWhile the cat\u0027s away the mice will play or so they say .... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhile commander zeta is still back on earth messin with data collection, we here on Kerbin want to play a few games.......i wonder wat these kerbal kiddies are up to anyways......\u003C/p\u003E\u003Cp\u003Enot from the desk of commander zeta \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe session will last about an hour...\u003C/p\u003E\n"}]}