{"TopicId":24420,"ForumId":44,"TopicTitle":"Orbital Fighting [Star wars is a good example]","CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-04-27T23:22:03Z","PageNum":4,"Articles":[{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-25T11:18:27Z","Content":"\n\u003Cp\u003EThis is basically one of the reasons I pretty much hate Star Wars. It\u0027s a movie which real purpose was to sell toys from a new franchise. There are some cool things from it, but it\u0027s nothing about space. It\u0027s about politics and wars. Just because the scenario is situated in another galaxy and features space ships doesn\u0027t mean it\u0027s about space.\u003C/p\u003E\u003Cp\u003EThe influence of this movie on popular culture was considerable, but the stupidity it contains is the core reason why the Star Wars fan base is not very similar to Star Trek base. Star Trek was mainly about discoveries and featured a lot of philosophical issues.\u003C/p\u003E\u003Cp\u003EIt\u0027s mindless fun (not for everyone, though), because it doesn\u0027t even try to be consistent with facts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EI dont think that the ban would matter in a war like scenario but you are right they are not as effective as in the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would matter, because of mutually assured destruction. There\u0027s no point of nuclear fighting if the winner lives in the contaminated world.\u003C/p\u003E\u003Cp\u003EThey are very effective in space if we consider the electronics. Blast a huge bomb in the orbit and you fry most of the LEO satellites on that side of Earth. The blast effect would be negligible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T11:22:55Z\u0022 title=\u002208/25/2013 11:22  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-08-25T11:33:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIt would matter, because of mutually assured destruction. There\u0027s no point of nuclear fighting if the winner lives in the contaminated world.\u003Cp\u003EThey are very effective in space if we consider the electronics. Blast a huge bomb in the orbit and you fry most of the LEO satellites on that side of Earth. The blast effect would be negligible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhat i meant with effective was the destructive side of the nuclear bomb. And yes i think they would be build and even used in space for the exact purpose you mentioned, to disable electronics.\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-08-25T15:45:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFirst of all, dogfighting is a thing of the past. Nowadays, jet fighters launch their missiles from 50 to 100km from their target. The winner is usually the plane that has the best radar system. Also, the F-22/F-35 are probably the last generation of manned fighter aircraft. Why would you risk a pilot by putting him in a plane, when you can put him in a control room and remote control a drone? Drones are becoming more capable than manned aircraft, with a longer range, longer loiter times, and they can take higher G loads in manoeuvers.\u003C/p\u003E\u003Cp\u003EWe are a LONG way from making UAVs a viable replacement for manned combat aircraft. They are good at reconnaissance and precision strike, but they lack when compared to manned aircraft. The reason is because we have not yet made a computer that can match the computing power of the human brain, meaning that any enemy pilot would be flying against something flying with a relatively simple AI. The other option for the UAV is remote control from a ground station. The problem here is the ever so small amount of lag between control input on the ground and any noticeable reaction by the UAV. In a dogfight, where fractions of a second matter, this lag could mean the difference between victory and defeat. There was a case a few years ago in the middle east in which a mig-21 (I forgot which nation) shot down a 21st century UAV from Israel. As far as the actual \u0022dog fighting,\u0022 look no further than the success, or lack there of, of U.S aircraft in Vietnam. The upper echelons of the Air Force and Navy determined that dog fighting was obsolete and that missiles could do the job just as well. The result, a kill ratio that dropped from 12:1 in WWII to 1:1. When you think about this, this got more people killed, obviously.\u003C/p\u003E\u003Cp\u003EAs far as the OP\u0027s question, I think it would all be relative. I have watched the movies, but not in a while. That being said, I did not try to estimate orbital altitude. Maybe its all relative; a short impulse creates enough of a velocity difference that the other fighter overtakes the other, ect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-08-25T18:31:16Z","Content":"\n\u003Cp\u003EFunny how this thread has been brought back from the dead...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rpayne88\u0022 data-cite=\u0022rpayne88\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn a dogfight, where fractions of a second matter, this lag could mean the difference between victory and defeat. There was a case a few years ago in the middle east in which a mig-21 (I forgot which nation) shot down a 21st century UAV from Israel. As far as the actual \u0022dog fighting,\u0022 look no further than the success, or lack there of, of U.S aircraft in Vietnam. The upper echelons of the Air Force and Navy determined that dog fighting was obsolete and that missiles could do the job just as well. The result, a kill ratio that dropped from 12:1 in WWII to 1:1. When you think about this, this got more people killed, obviously.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen was the last actual dogfight between two fighter planes? Missile, radar and communication technology has come a long way since Vietnam.\u003C/p\u003E\u003Cp\u003EModern air superiority fighters like the F22 are really weapons platforms. Although they are highly manouverable and the pilots are highly trained, in a real world interception scenario, they will typically fire their missiles from 200 km away, without even making visual contact, based on intelligence from an AWACS aircraft or from the rest of the air group. Interception nowadays is about being the first to fire your missiles and being able to evade the enemy\u0027s missiles.\u003C/p\u003E\u003Cp\u003EIf you can make some sort of hybrid between a UAV and a long range anti-aircraft missile, you no longer need air superiority fighters. A swarm of UAVs loiters over the theater, or fly in formation with an F22, and when a hostile aircraft is detected, the F22 or an AWACS sends the kill command, which switches the UAV to missile mode and goes in for the kill. \u003C/p\u003E\u003Cp\u003ESpace combat would be similar. There is no point in using a manned spacecraft to launch a missile. The unmanned spacecraft would be the missile. It would manoeuver to intercept the target and neutralise it when it gets close enough.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T18:37:18Z\u0022 title=\u002208/25/2013 06:37  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gloowa","CreatedById":22683,"CreatedDateTime":"2013-08-25T22:57:26Z","Content":"\n\u003Cp\u003EIf you want \u0022realistic\u0022 space combat i urge you to read two series:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Lost_Fleet\u0022 rel=\u0022external nofollow\u0022\u003ELost Fleet\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Honorverse\u0022 rel=\u0022external nofollow\u0022\u003EHonor Harrington\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThey have very different approach to space combat, but both concepts are well crafted. Also, they are a good read regardless of combat.\u003C/p\u003E\u003Cp\u003EPersonally, Lost Fleet has more plausible combat, but Honor Harrington has better plot and atmosphere. Also, several pages long descriptions of battle damage including rather gory effects an explosion and then decompression has on crew.\u003C/p\u003E\n"},{"CreatedByName":"fenderzilla","CreatedById":70047,"CreatedDateTime":"2013-08-26T00:33:13Z","Content":"\n\u003Cp\u003EI think you\u0027ll find a lot of sci-fi battles take place in deep space instead of orbit. huge battleships like battlestars or dreadnoughts can\u0027t really maneuver in a gravity field that well, they\u0027re just too big. gloowa mentioned the honor harrington series, which I agree is a great example of these. also, in sci-fi, there are always more advanced weapons and propulsion systems. in the honor series there are things like gravity warp drives that let ships and missiles exceed the speed of light, as well as super lasers and gravity lances, all of which have ungodly range for deep space fighting.\u003C/p\u003E\u003Cp\u003Estar wars is, as has been mentioned, a terrible example. other than the ignoring physics, it\u0027s just not likely tiny ships like the x-wing and tie-fighter would actually come across each other. real space battles would be fought with ships more star destroyer size.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-08-26T03:38:50Z","Content":"\n\u003Cp\u003EFirst off the aim-120c that most fighters carry only have a range of between 100 and 30km depending on which way the target is moving and can be easily avoided at longer ranges so there is room for a little dog fighting.\u003C/p\u003E\u003Cp\u003EThere would probably not be fighters in space combat. I also don\u0027t see lasers being of much use in ship to ship combat.\u003C/p\u003E\u003Cp\u003EO and nukes don\u0027t create a emp in space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T03:52:33Z\u0022 title=\u002208/26/2013 03:52  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by DaveofDefeat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-08-26T05:35:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EFunny how this thread has been brought back from the dead...\u003Cp\u003EWhen was the last actual dogfight between two fighter planes? Missile, radar and communication technology has come a long way since Vietnam.\u003C/p\u003E\u003Cp\u003EModern air superiority fighters like the F22 are really weapons platforms. Although they are highly manouverable and the pilots are highly trained, in a real world interception scenario, they will typically fire their missiles from 200 km away, without even making visual contact, based on intelligence from an AWACS aircraft or from the rest of the air group. Interception nowadays is about being the first to fire your missiles and being able to evade the enemy\u0027s missiles.\u003C/p\u003E\u003Cp\u003EIf you can make some sort of hybrid between a UAV and a long range anti-aircraft missile, you no longer need air superiority fighters. A swarm of UAVs loiters over the theater, or fly in formation with an F22, and when a hostile aircraft is detected, the F22 or an AWACS sends the kill command, which switches the UAV to missile mode and goes in for the kill. \u003C/p\u003E\u003Cp\u003ESpace combat would be similar. There is no point in using a manned spacecraft to launch a missile. The unmanned spacecraft would be the missile. It would manoeuver to intercept the target and neutralise it when it gets close enough.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhile you are right about space combat, dogfights still take place in air combat. While everyone hopes for long distance engagement, AMRAAM\u0027s have been proven to be less reliable than thought so fighters are likely to meet at closer range.\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-08-26T06:57:12Z","Content":"\n\u003Cp\u003EThere will be no spacewarfare with battleships or fighters ever! Why? cause its pointless. Why wasting time and resources on battleships if you just can use that resources to build interplanetary missiles, and bomb the enemy planets or stations directly? \u003C/p\u003E\u003Cp\u003EYoul just fire a huge salvo of missiles to collision trajectory with enemy planet/station/moon/asteroid mine. They maybe able to shoot some of them down with some kind of planetary defence, but hardly all of them. And if they dont evaporate the missiles, the debris from them will still do the job.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-08-26T13:39:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EWhile you are right about space combat, dogfights still take place in air combat.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, modern fighter pilots still train hard at dogfighting, and recent conflicts have shown that short-range kills still happen regularly. There can be a lot of reasons why a long-range kill isn\u0027t always possible, a lot of the things you\u0027d want to kill tend to lurk down in the terrain, such as helicopters and strike aircraft, and sometimes your RoE are going to dictate you need a visual ID before you can waste them. Sometimes you don\u0027t have the option of a BVR kill, strike aircraft that don\u0027t have radar-guided missiles still go in for the kill on threats they encounter using IR missiles and guns. I used to work on a strike squadron with crusty old A-4s, and our guys used to regularly get kills on fancy-pants fighters like F-18s at about a 1:1 ratio. Clever pilots can find ways to mitigate any long-range advantage their enemy might have, such as terrain masking and the good old fashioned \u0022cheat like hell\u0022 tactic. We used to find that US pilots in particular were particularly prone to making bad assumptions about where their enemy would be coming at them from, that allowed our knucks to get the bounce on them and get into close range without them tagging ours on radar.\u003C/p\u003E\u003Cp\u003EBesides, fighter pilots LOVE the gun(s). In some of the Arab-Israeli wars where the IDF had air supremacy it was not unknown for their pilots to deliberately close into dogfighting range and take down their enemy using guns, just because it was more satisfying. In one squadron I worked on there was a big poster on the wall that said: \u0022No kill like a guns kill\u0022. To get a guns kill you have to outfly the other guy, and fighter knucks are massive egotists.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2013-11-11T17:50:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fenderzilla\u0022 data-cite=\u0022fenderzilla\u0022\u003E\u003Cdiv\u003Estar wars is, as has been mentioned, a terrible example. other than the ignoring physics, it\u0027s just not likely tiny ships like the x-wing and tie-fighter would actually come across each other. real space battles would be fought with ships more star destroyer size.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is exactly what the Empire thought, leading to a lack of point defense systems on the Death Star I, and leaving a an unarmored small thermal exhaust port, right below the main port. Perfect for a well aimed torpedo...\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-11-11T19:22:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Soda Popinski\u0022 data-cite=\u0022Soda Popinski\u0022\u003E\u003Cdiv\u003EWhich is exactly what the Empire thought, leading to a lack of point defense systems on the Death Star I, and leaving a an unarmored small thermal exhaust port, right below the main port. Perfect for a well aimed torpedo...\u003C/div\u003E\u003C/blockquote\u003EI guess that the empire perfectly knew about \u0022space fighters\u0022 when building the death stars. But its just Star Wars nonsence anyway.\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-11-11T19:41:41Z","Content":"\n\u003Cp\u003EInterplanetary wars will be fought by single-shot rocks or missiles hurled at incredible, mind-numbing speeds. No armies, no battleships, no glamorous war heroes - just a planet killing rock about the size of your neighborhood and mathematicians smart enough to know when to sling-shot it.\u003C/p\u003E\u003Cp\u003EThe same can be said for the future of intercontinental hot-wars. Technology makes destruction so absolute it becomes unusable.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-11T19:54:01Z","Content":"\n\u003Cp\u003EMy personal view is, if there were to be space battles by whatever against whatever else.\u003C/p\u003E\u003Cp\u003EI doubt the battles would take place in orbit or in space. I mean, with what we know about physics and the technology we currently posses. What would be the point in fighting in space? The strategic target you want to capture is likely on earth (or whatever planetary body u see fit)\u003C/p\u003E\u003Cp\u003EThe only use an orbital ship has is to carry ground troops and to launch space to surface weapons. A big hulking ship such as this is probably easy to spt or detect from the ground. As there isnt really anything in space worth fighting over, it makes sense that you wouldnt bother putting all that debris out there. \u003C/p\u003E\u003Cp\u003EI just dont feel like space combat is really ever going to happen. At least humans wont be the ones doing it. All that money to put a ship into space...and then load it full of weapons and troops etc...sounds like alot of effort.\u003C/p\u003E\u003Cp\u003EWhen watching sci-fi films i just assume there is (As someone said in an earlier post) that there is some sort of majical propulsion system that allows ships to keep stationary whilst in a gravity well with some sort of crazy inertia destabilser-mo-bob so they can do all dem acrobatics. \u003C/p\u003E\u003Cp\u003EThis game has ruined all my favourite sci fi games and movies. I have to make up crazy magical things to make them believable!\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-11T19:55:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Soda Popinski\u0022 data-cite=\u0022Soda Popinski\u0022\u003E\u003Cdiv\u003EWhich is exactly what the Empire thought, leading to a lack of point defense systems on the Death Star I, and leaving a an unarmored small thermal exhaust port, right below the main port. Perfect for a well aimed torpedo...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought they did have point defense systems? They were just...you know...completley useless in every single way.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2013-11-11T20:17:06Z","Content":"\n\u003Cp\u003EMe and a friend are writing a Hard(ish) Sci-Fi book that will involve a lot of this kind of thing, and seeing this thread is like torture, because all of my ideas for fighting end up being like this, where you need high thrust and high ISP to do anything of the sort. However, if the Gyroscopes were powerful enough, and you had a REEEAAAAAALLLLY high ISP engine, then it wold easily be possible. Thankfully, in the novel humanity (after its original collapse in an all out nuclear war) have been given technology by a benevolent race of aliens, including Hydrogen Fusion thrusters (ISP typically around 60000s, Engines vary in size and the largest can produce up to a TN of thrust {TeraNewton}) aswell as a possibly physics breaking instantaneous transportation system, simply because that kind of thing is necessary for the scale of the story (encompasses most of the galaxy)\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-11T20:28:08Z","Content":"\n\u003Cp\u003EThere might be a reason for in-space fighting if we develop a warp drive. If it\u0027s anything like Alcubierre Drive, we\u0027ll have to pre-program a target location. A ship in transit would be virtually impossible to intercept, but equally, a ship in transit will be incapable of maneuvering except in a pre-determined way.\u003C/p\u003E\u003Cp\u003EThis leads to some very interesting tactics. If a ship is heading straight at you under warp bubble, it will not be detectable until it comes out. This means that rather than engaging enemy in BVR combat, it will be far more beneficial to warp right in and attack the enemy at short range before they realize what\u0027s going on.\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of attacking something in space? Well, the primary target would be any stations in orbit. Even if we stay mostly planet-bound, interplanetary ships will remain topside. This means lots of transfer stations, both for military and civilians. Secondary are any ships protecting \u0022fixed\u0022 targets or docked for resupply, and these will also be plentiful. That means lots targets. Any rock hurled at a station from BVR can be shot down. A ship warping in at beam weapons range is far more effective. Lasers and particle beams can hit the hull of the target literally at the same time as the signal announcing arrival of the enemy is received disabling a lot of defenses. This means that even automated defense systems would have no time to react. Once defenses are down, railguns and missiles can pound the target to scrap at a more leisurely pace.\u003C/p\u003E\u003Cp\u003EThis also leads to fighters/drones to being a more viable defense. Any exposed weapons are likely to be fried in the first seconds of battle. Beam weapons aren\u0027t going to penetrate hulls worth crap, however, so launching something well armed and maneuverable from hangars might be the only chance a station or a large ship have in case of an ambush like this.\u003C/p\u003E\u003Cp\u003EThe rest is going to be about early detection and tactics. If a ship under warp is detected by a remote station, a courier ship can beat it to the destination and allow for early warning. One of the features of Alcubierre Drive is that it\u0027s not terribly flexible in terms of trajectory. If you observe a warp bubble in transit, you can make a pretty good estimate on destination and arrival time, but still within a certain error. Intelligence and tactics might let you engage an attacking ship the moment it exits. Just start firing at it at the ETA. You\u0027d only score lucky hits, but it can be more than enough to tip the balance.\u003C/p\u003E\u003Cp\u003EAt any rate, engaging targets from BVR robs either side of any advantage. You want ships close so that the speed-of-light delays don\u0027t mess with your targeting, and you want to engage enemy any time they are not ready. So you are going to get a lot of exciting space combat.\u003C/p\u003E\u003Cp\u003EOf course, all of this assumes that we get warp figured out, and right now, there are some very significant puzzles with it. Unfortunately, the math and theory are far ahead of engineering on this. We know space-time configurations that can do it. We even have some guesses on how to get the curvature right. We do have some experiments running to confirm warp field works the way we think it does. But getting it strong enough requires more energy than we can produce right now. On the plus side, what we\u0027ve thought was the minimum required energy for interplanetary drive has been reduced from equivalent of supermassive black hole to a few hundred kg. This is a step from absolutely impossible to potentially remotely feasible. And the warp drive physics has only been around less than two decades.\u003C/p\u003E\u003Cp\u003EI\u0027m not going to promise warp travel in near future, there are many challenges and even philosophical puzzles, but I would not be surprised if we have some basic prototypes within century. And then, who knows?\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-11T20:45:37Z","Content":"\n\u003Cp\u003EHey, what about that burst of high-energy Hawking radiation warpships are supposed to emit when they drop the bubble? That would be a heck of a weapon, frying everything in front of starship literally the moment it drops out of FTL.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-11-11T21:19:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI doubt the battles would take place in orbit or in space. I mean, with what we know about physics and the technology we currently posses. What would be the point in fighting in space? The strategic target you want to capture is likely on earth (or whatever planetary body u see fit)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. Fighting doesn\u0027t happen for the sake of fighting. There is always an objective to control, whether that\u0027s a population, a resource, strategically important terrain, etc. There\u0027s nothing worth fighting over in deep space, but we already strive to control the airspace above the area of interest through aircraft. Air power is decisive in certain types of warfare (naval, desert, etc), once we have combat aerospacecraft the battlespace will simply extend even further upwards into the orbital realm. Strike aircraft capable of orbit are already on the USAF\u0027s wishlist, as they\u0027d allow the US to bomb any point in the globe from bases in the US without air-to-air refuelling. This will probably happen some time in the next few decades. It seems reasonable that the other major powers will develop their own systems to address that threat.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2013-11-11T21:38:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003ETake a look at this site: \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/spacewarintro.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/spacewarintro.php\u003C/a\u003E It\u0027s pretty interesting to read.\u003Cp\u003EAnd this is a nice video:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/fXeUkrlxQ98?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E The ships are far too close and lasers wouldn\u0027t be visible but it\u0027s still a good video.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYa, both of those are pretty good.\u003C/p\u003E\u003Cp\u003E(Atrocious music otherwise.)\u003C/p\u003E\u003Cp\u003EWould battles just be medival jousting like Nibb said, or would some ships want to match vectors(for lasers or something.)\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2013-11-11T21:52:24Z","Content":"\n\u003Cp\u003EThey just had anti-capital ship \u0022turbolasers.\u0022 No good against snub fighters. In their defense, who would think a 1 meter wide port could be hit? For the Emperor\u0027s sake, it\u0027s only the size of a womp rat!\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-11-11T22:21:27Z","Content":"\n\u003Cp\u003EDo a bit of retronaut exploring. See how \u0022airwarfare\u0022 was perceived in the 19th century. Ideas of floating fortresses, slow lumbering beasts loaded to the gills with guns. Even in the 1930s we thought that was the way to go. The B17 was a succes despite it\u0027s design; the original concept of a heavily armed bomber being able to fend of fighters all by itself turned out the be completely wrong.\u003C/p\u003E\u003Cp\u003EDiscussing combat in a mode you\u0027re not familiar with means you\u0027ll end up thinking wrongly about it. What do you know about medieval fighting? What the movies are showing is generally wrong. In the time of the crusades fighting in general was fast and brutal. Knight to knight encounters didn\u0027t last minutes, most encounters were decided in seconds with the loser left laying on the ground screaming in anguish as he bled to death.\u003C/p\u003E\u003Cp\u003EI don\u0027t know what space combat will look like, but probably nothing like we imagine right now. Certain weapons (guns, missiles) might be useless. Lasers sound good but require huge amounts of power. Stealth seems easy in space (look at how hard it is to spot rogue asteroids on a collision course with earth) so the initial space cruiser would probably basically be a nuclear reactor to provide power, lots of capacitors for multiple shots and one big ass laser to provide a deadly punch. And maybe a handful of nuclear weapons for orbital bombardment.\u003C/p\u003E\u003Cp\u003EDefense would consist of many tiny little probes (impossible to spot at a distance) that would communicate with laser pulses or tight radio beams to prevent detection. Information will be key to both sides. I doubt there\u0027s any dogfighting. Detect, locate, kill; it\u0027ll be as simple as that. You know you\u0027ve been spotted by the enemy, as you ships starts to heat up rapidly. You also know that your life will be over in the next half second, in that case.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-11-11T22:24:55Z","Content":"\n\u003Cp\u003EMeh, the tactics of space combat will be born from the blood of men as usual.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-11-11T23:03:11Z","Content":"\n\u003Cp\u003EI think MassEffect takes a very interesting approach to the \u0022instant D/v\u0022 ships as I like to call scifi vehicles. A drive that simply takes away the mass of an object and accelerates it. But again when it comes to all scifi \u0022instant d/v\u0022 is the norm. Ships that can accelerate to 300k/s in a few seconds and then decelerate in the same time. All the while being supported by a \u0022kinetic barrier\u0022 if you will. \u003C/p\u003E\u003Cp\u003EThe majority of society thinks this is how real life craft work. And that\u0027s just my way of illuminating the ignorant.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-11-11T23:08:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EStealth seems easy in space (look at how hard it is to spot rogue asteroids on a collision course with earth) so the initial space cruiser would probably basically be a nuclear reactor to provide power, lots of capacitors for multiple shots and one big ass laser to provide a deadly punch.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually stealth in space is really hard, particularly if you have enough hardware to put something serious into deep space. Asteroids are hard to spot because we\u0027re not really investing much in looking for them and because they\u0027re only a couple of degrees above ambient temperature. A nuclear reactor is a \u003Cem\u003Elot\u003C/em\u003E hotter than an asteroid and much easier to spot in infrared. Space combat won\u0027t resemble sub-hunting, or dogfights, or galleon broadsides... I\u0027m not certain what form it\u0027ll take, but it won\u0027t resemble any other form of combat.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"}]}