{"TopicId":24489,"ForumId":21,"TopicTitle":"[Rocket Builder] Wyvern Spaceflight \u0026amp; Aeronautics","CreatedByName":"Stelith61","CreatedById":58699,"CreatedDateTime":"2013-04-28T09:37:52Z","PageNum":1,"Articles":[{"CreatedByName":"Stelith61","CreatedById":58699,"CreatedDateTime":"2013-04-28T09:37:52Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EWelcome to Wyvern Spaceflight \u0026amp; Aeronautics!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EWSA - Ushering in a new era of spaceflight* with minimum explosions! \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E*Warning: new era may contain many large explosions\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWyvern Spaceflight is a relatively new private firm in the field of Aerospace Engineering and Rocketry, boasting excellent rates of Kerbal survival (Over 12%!), successful probe deployments and explosion-to-part ratios, we\u0027re sure to have your kerbonauts into orbit as safely as possible. With many of our ships able to de-orbit launch stacks using remaining fuel, you can be sure that Kerbin won\u0027t succumb to Kessler Syndrome, and comply with the Clean Space Act (2011-13). Despite recent \u003C/strong\u003E\u003Ca href=\u0022https://webcache.googleusercontent.com/search?q=cache:G6JtrBt5vfIJ:forum.kerbalspaceprogram.com/showthread.php/50115-Wyvern-Spaceflight-Engineering\u002B\u0026amp;cd=1\u0026amp;hl=en\u0026amp;ct=clnk\u0026amp;gl=au\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ecutbacks\u003C/strong\u003E\u003C/a\u003E\u003Cstrong\u003E, we continue to manufacture and develop craft for the growing spaceflight market.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#696969;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EAll craft are STOCK PARTS ONLY\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ECREWED ROCKET VEHICLES\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EFalcon 12 Shuttle [F-12]\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe Falcon 12 Shuttle is a Single-Stage-to-orbit LKO Shuttle for crewing space stations in low kerbin orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0xNDNvUl.jpg\u0022 alt=\u00220xNDNvUl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 1:\u003C/span\u003E Beginning Ascent.\u003C/p\u003E\u003Cp\u003EBegin ascent as normal, with gravity turn around 9.8-11km. Fuel may seem low, but more is used in the first 15-20km than in the rest of the flight, and so it is able to achieve orbit at 71-80km. Probably 100km.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 2:\u003C/span\u003E Continue to orbital insertion. Decouple Launch stack when in orbit. You can use Physics Warp to turn, just don\u0027t throttle up with it on. The probe core in the launch \u003C/p\u003E\u003Cp\u003Estack is inverted, so pointing prograde along the navball and burning will lower orbit.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 3:\u003C/span\u003E Use RCS Tranlation to rendezvous and dock. It has thrusters to make forward/back translation easier. RCS is balanced. !WARNING! When decoupling from stack, the ship spins out of control for no apparent reason. Have the solar panels retracted.\u003C/p\u003E\u003Cp\u003E150 Parts, 172.8 tons launch mass, and staging is setup to decouple from the launch tower \u002B Activate engines, then decouple shuttle from launch stack, then decouple pod from shuttle, then open chutes. Action group 1 opens and closes solar panels. Use RCS to deorbit when wanted. You should have plenty of RCS Monoproppellant.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/s/pvvi8tnasbblgs2/Falcon%2012%20Shuttle.craft?token_hash=AAGX163GHt5yfSlWP7b3_jKfFIhL8pSNTkg3zjcPYNrKQQ\u0026amp;dl=1\u0022 rel=\u0022external nofollow\u0022\u003E.craft file Dropbox download\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003EFalcon 16 Shuttle [F-16]\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Falcon 16 Shuttle is a Kerbin-Mun-Minmus (all in one go!) Shuttle that launches in three stages. It has the capability to get to Duna, but nowhere else once there.\u003C/p\u003E\u003Cp\u003E(It\u0027s also a modified Falcon 12, and please don\u0027t say I could upgrade the F-12 to make it more than just LKO becasue thats what this is)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UN5s9Vz.jpg\u0022 alt=\u0022UN5s9Vz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 1:\u003C/span\u003E Beginning Ascent.\u003C/p\u003E\u003Cp\u003EBegin ascent as normal, with gravity turn around 10-12km. Drop boosters when they run out, their positioning and sepratrons should ensure a smooth detach.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 2:\u003C/span\u003E Continuted Ascent.\u003C/p\u003E\u003Cp\u003EContinue normal ascent. Make sure you turn carefully, as this ship is large, and turns only on gymbal. Use the RCS Systems if needed for helping turns.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage 3\u003C/span\u003E: Orbital Insertion.\u003C/p\u003E\u003Cp\u003EContinue insertion to orbit as usual, burning just before/at apoapsis. Stop engines when periapsis raises to 25km. Drop the main ascent stage. 25km is inside the \u003C/p\u003E\u003Cp\u003Eatmosphere enough for the game to delete the stack. It is equipped with a probe core, but the navball is inverted, so you an deorbit it later, but it is agonizingly unmaneuverable without the engines running.\u003C/p\u003E\u003Cp\u003EUse the Poodle engine to complete the orbital insertion.\u003C/p\u003E\u003Cp\u003EThe ship is left with enough fuel and RCS to orbit either Kerbin, Mun or Minmus and rendezvous, then return. It has been tested successfuly as a Duna shuttle, but one way only, and uses most, if not all its fuel getting into a low circular orbit (with reasonably good aerobraking) Any rendezvous would have to be RCS only, and RCS can be used to deorbit the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ecapsule only\u003C/span\u003E for crewing a ground base.\u003C/p\u003E\u003Cp\u003EAn Ike orbit could possibly be acheived if done well.\u003C/p\u003E\u003Cp\u003E195 Parts, 220.5 tons launch mass, and staging is setup as said above. Action group 1 opens and closes solar panels.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/s/lvef5nfvpvlahz3/Falcon%2016%20Shuttle.craft?token_hash=AAHqlVObXHPGmEJMo2Z8P_3jfHAiNS7O7Bh5UWT2HgXgsQ\u0026amp;dl=1\u0022 rel=\u0022external nofollow\u0022\u003E.craft file Dropbox download\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMore ships coming \u0027soon\u0027\u003Csup\u003Etm\u003C/sup\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-30T14:30:05Z\u0022 title=\u002204/30/2013 02:30  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 30, 2013\u003C/time\u003E by Stelith61\u003C/strong\u003E\n\u003Cbr\u003EEditing\n\u003C/span\u003E\n"}]}