{"TopicId":24485,"ForumId":32,"TopicTitle":"[HELP] Structural Failure with Ship","CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2013-04-28T09:24:31Z","PageNum":1,"Articles":[{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2013-04-28T09:24:31Z","Content":"\n\u003Cp\u003EI have a ship that I am launching that just refuses to stay together after warping. The nose just seems to fall off. \u003C/p\u003E\u003Cp\u003EI\u0027m using the B9 Aerospace mod and Nova\u0027s struts from his mod. \u003C/p\u003E\u003Cp\u003EHere is the .craft file \u003Ca href=\u0022http://www./?w6fu7bs24c20549\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?w6fu7bs24c20549\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBefore warp:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iYMymoM.png\u0022 alt=\u0022iYMymoM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter warp:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sOneIl5.png\u0022 alt=\u0022sOneIl5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHappens when I save as well. No one else appears to have this issue with B9 stuff and I am finding it incredibly frustrating because I really like the cargo bay. If anyone has any advice that\u0027d be great.\u003C/p\u003E\u003Cp\u003ENote: this also happens with the debug options on too.\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-04-28T09:31:39Z","Content":"\n\u003Cp\u003EIs the attachment point of the cockpit indeed mated to the attachment point of the cargo bay, and not those side nacelle things? Maybe the torque from the cockpit\u0027s stabilization is pulling it off, or the density (weight/volume ratio) difference of the parts is. Try strutting it to the cargo bay if it isn\u0027t already.\u003C/p\u003E\u003Cp\u003EYou also might have an older B9, the spaceport version is outdated. Get it from its \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25241-0-19-1-B9-Aerospace-Pack-R2-New-pods-IVAs-fuselage-systems-structural-parts\u0022 rel=\u0022external nofollow\u0022\u003Eforum post\u003C/a\u003E. You might get more help if you post your problem there as well.\u003C/p\u003E\u003Cp\u003EEDIT Scratch that, as of today it\u0027s been updated there. Never mind.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-04-28T10:00:10Z","Content":"\n\u003Cp\u003EThe B9 thread has several people having the same issue, it\u0027s not just you. I don\u0027t know if it has been fixed but as ThatBum has said, try removing the side pieces from the tank before you attach the tank to the command module, to ensure that\u0027s where the connection is made. Then reattach the sides. Also, struts. Stitch it to the tank.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-04-28T10:32:40Z","Content":"\n\u003Cp\u003ENova\u0027s struts are tough. How many have you got there?\u003C/p\u003E\n"}]}