{"TopicId":2460,"ForumId":18,"TopicTitle":"Lego Gear Ratio Help","CreatedByName":"Phoxtane","CreatedById":6626,"CreatedDateTime":"2011-09-21T01:41:17Z","PageNum":1,"Articles":[{"CreatedByName":"Phoxtane","CreatedById":6626,"CreatedDateTime":"2011-09-21T01:41:17Z","Content":"\n\u003Cp\u003EI\\\u0027m working on a project in Lego, but I need a 13:1 gear ratio to do so. That is, turn the output shaft once every time I turn the input shaft 13 times.\u003C/p\u003E\u003Cp\u003EWhoever can help me will get a mention in some video credits, \u003Cstrong\u003Eif I make a video.\u003C/strong\u003E I may end up not making one right away, or at all.\u003C/p\u003E\u003Cp\u003EOff-Topic: Never use the official Lego message boards for specific help like this. Evidently, nobody knows what I\\\u0027m talking about, because I have zero replies as opposed to some other threads up for less time than mine with poorly-worded questions.\u003C/p\u003E\u003Cp\u003EIf you want to help me in the Lego message boards, my profile name is Starfox5678, and the thread should be in the Technic section near the top of the first page.\u003C/p\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2011-09-21T04:36:06Z","Content":"\n\u003Cp\u003EWell, this is kinda hard without knowing the sizes of the gears in relation to one another... If I recall correctly, the big gear (about 1 inch in diameter) had a ratio of about 3:1 to the small gear (the ~1cm diameter one)... but I can\\\u0027t say that\\\u0027s accurate...\u003C/p\u003E\u003Cp\u003EI would suggest you take a marker, and put a small dot on two gears of different sizes. Place them against each other so that both dots are aligned, and turn one of them fully around the other, counting how many times the dot on the gear that\\\u0027s going around passes nearest the other gear. When you return to where you started (the dot on the other gear), you\\\u0027ll know more or less the ratio of their circumferences.\u003C/p\u003E\u003Cp\u003EOr, if you can measure the gears accurately enough, circumference = 2 * PI * radius. \u003C/p\u003E\u003Cp\u003EAnother idea would be to count the number of teeth in the gears... assuming they\\\u0027re equally spaced so they mesh, you could get a rough estimate from the ratio of teeth between 2 gears.\u003C/p\u003E\u003Cp\u003EFrom there you\\\u0027ll have to do some math and/or trials... If the ratio of a big gear to a small one is, say, 3:1, you can connect a third, small gear to the same axle as the large gear, and mesh that with a big gear on yet another axle. That already puts you at 9:1... to get to 13:1 you\\\u0027ll probably need a large-ish combination of upshifts and downshifts, but that will depend very much on the ratio of the gears themselves, so I don\\\u0027t think I can be any more specific.\u003C/p\u003E\u003Cp\u003Ebest of luck with your project! \u003C/p\u003E\u003Cp\u003E(I really miss having my LEGOs around)\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"ronnyfire","CreatedById":4854,"CreatedDateTime":"2011-09-21T06:06:22Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://myweb.cwpost.liu.edu/magot/classes/csc/RobotFundamentals/downloads/gears_drivetrain.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://myweb.cwpost.liu.edu/magot/classes/csc/RobotFundamentals/downloads/gears_drivetrain.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat has a few images showing the gear ratios, ill see if i can find a combo for 13:1\u003C/p\u003E\u003Cp\u003EHow close to 13:1 does it have to be? xD\u003C/p\u003E\n"},{"CreatedByName":"Sordid","CreatedById":535,"CreatedDateTime":"2011-09-21T06:48:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ronnyfire\u0022 data-cite=\u0022ronnyfire\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022http://myweb.cwpost.liu.edu/magot/classes/csc/RobotFundamentals/downloads/gears_drivetrain.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://myweb.cwpost.liu.edu/magot/classes/csc/RobotFundamentals/downloads/gears_drivetrain.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat has a few images showing the gear ratios\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBetter: \u003Ca href=\u0022http://gears.sariel.pl/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gears.sariel.pl/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOn a tangentially related note: \u003Ca href=\u0022http://www.ted.com/talks/arthur_ganson_makes_moving_sculpture.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ted.com/talks/arthur_ganson_makes_moving_sculpture.html\u003C/a\u003E (skip to 8:20 if you\\\u0027re not interested in various non-gear-related contraptions)\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-09-21T10:07:59Z","Content":"\n\u003Cp\u003Eusing the calculator ( \u003Ca href=\u0022http://gears.sariel.pl/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gears.sariel.pl/\u003C/a\u003E )\u003C/p\u003E\u003Cp\u003Eand an idea I\\\u0027ve read from the internet (it was used for replicating a clock of sort):\u003C/p\u003E\u003Cp\u003Ecreate a combo giving a 6:1 ratio.\u003C/p\u003E\u003Cp\u003Ecreate a combo giving a 20:1 ratio.\u003C/p\u003E\u003Cp\u003E(I did it but I cannot link them, I\\\u0027ll attach some screenshot)\u003C/p\u003E\u003Cp\u003Epick a differential: one axle input of the differential should be driven the 20:1 combo; the other axle should be driven from the 6:1 combo. both of those should start from the same axle.\u003C/p\u003E\u003Cp\u003Egiven all the constraint, the differential could only spin at an average of the given axle inputs, that is, 13:1\u003C/p\u003E\u003Cp\u003EI repeat so to make it clear: I was not the originator of this idea, I deserve no credits. place your credits where it\\\u0027s due (a mix of google and the internets, probably)\u003C/p\u003E\n"},{"CreatedByName":"Phoxtane","CreatedById":6626,"CreatedDateTime":"2011-09-21T12:28:11Z","Content":"\n\u003Cp\u003EGreat work!\u003C/p\u003E\u003Cp\u003EYeah, I found the calculator online, but it doesn\\\u0027t tell you how to get to a 13:1, it just tells you what the current ratio in your train is. I\\\u0027ve also contacted Sariel himself on this matter also.\u003C/p\u003E\u003Cp\u003EThe differential idea seems the most likely solution. I\\\u0027ll give it a try after school today.\u003C/p\u003E\u003Cp\u003EUPDATE: How it\\\u0027s going to work, hopefully...\u003C/p\u003E\u003Cp\u003EThe 6:1 ratio and the 20:1 ratio will use the same input shaft, and will use a differential to average out the rotations to get 13:1.\u003C/p\u003E\u003Cp\u003EI need another 20:1 ratio for the other part of the Tzolkin, so I\\\u0027ll just reuse the 20:1 ratio, and perhaps even use the same shafts.\u003C/p\u003E\n"}]}