{"TopicId":2467,"ForumId":21,"TopicTitle":"Sounding Rockets","CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-21T15:34:18Z","PageNum":1,"Articles":[{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-21T15:34:18Z","Content":"\n\u003Cp\u003EI recently made a suggestion in the KSP Development forum about Sounding Rockets, and rdfox and I decided to try and make some of our own. My result was this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i51.tinypic.com/24318d0.png\u0022 alt=\u002224318d0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe HSSR Merlin I. (High speed sounding rocket.) It uses two clusters of 7 MiniBoosters along with 6 initial acceleration Radial solid boosters and can carry the currently oversized command pod to escape velocity easily. Seriously. It really is ridiculous:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i53.tinypic.com/i4k8c5.png\u0022 alt=\u0022i4k8c5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you fire the first stage and manage to decouple it safely while going straight up and flip over to 90 degrees, then control it long enough, it can reach over 800m/s straight across at \u0026lt;10,000 feet!\u003C/p\u003E\u003Cp\u003ESo, I put a challenge to my fellow Kerbonauts: Create your own \\\u0027sounding\\\u0027 rockets, using just 0.5m parts and radial attachments (you will have to graft the pod on top using struts and mini decouplers for now) and post some pictures here of it in the VAB and in flight.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERecommended Mods:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMiniBoosters, Mini Winglets\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHelp! I can\\\u0027t find or remember the mods for these parts! Anyone got any input/links? If you have the mini winglets, recommend you mod the lift back down to 1 or 0.5 deflection lift. They start at 4 - far too overpowered.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ENovasilisko\\\u0027s SIDR\u0026amp;SD\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=1109.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=1109.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think most of us already have this pack, but all the same here it is. This pack contains a 0.5m decoupler which is very valuable for those of you who are too faint-hearted for fire in the hole. Or if you feel sorry for Bob and Bill.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMini-Winglets\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=2205.msg20594#msg20594\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=2205.msg20594#msg20594\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAmazing for stabilisation when their lift coefficient is quartered from default. They\\\u0027re also fantastic for things like Air-to-ground missiles mounted under spaceplanes. I\\\u0027ve achieved extremely precise hits with these winglets and miniboosters.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWARNING: When you get the part, go into the \\\u0027part\\\u0027 file and change DeflectionLift to 1.0 or lower! Don\\\u0027t say I didn\\\u0027t warn you!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ECaptainSlug\\\u0027s Radial Boosters.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=1460.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=1460.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDamn useful pieces of kit for this purpose. Can add a bit of extra BANG to your crash. Ahem, I meant thrust to your rocket.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EQuabits Parts\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=537.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=537.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EContains a useful mini-liquid engine and mini-fuel tank kit. Don\\\u0027t ask me how to use the Advanced Decoupler.\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2011-09-22T02:35:46Z","Content":"\n\u003Cp\u003EUsually souding rockets have some sort of equipment or instrument on them for expirements. On the top, try using two CaptainSlug\\\u0027s 1.75 Bulkhead parts, with something in the middle. I love these because you can attach things to the side of this wonder ring!\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-22T15:00:40Z","Content":"\n\u003Cp\u003EIt would be rather difficult to launch anything that size on this kind of rocket and not have a major tumble almost immediately.\u003C/p\u003E\u003Cp\u003EAlso, see here: \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Black_Brant.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Black_Brant.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEven just the Command Pod is already wider than a standard sounding rocket. In fact, my craft is over size in terms of width as it is. But they most definitely don\\\u0027t have 1.75m ugly circle things carrying all their equipment. Miniaturization is one of the beauties of Aerospace technology.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-09-22T16:06:05Z","Content":"\n\u003Cp\u003EYeah, sounding rockets are *tiny* little suckers. Though really, they\\\u0027re not intended for great downrange distances; their primary goal was getting up through the upper atmosphere and back. Here\\\u0027s the results (so far) of my sounding rocket program...\u003C/p\u003E\u003Cp\u003EAfter my first two tries (involving my \u0027command pod as launch pad\u0027 concept) failed in various entertaining manners, I switched and put the command pod on top to allow manual flying.\u003C/p\u003E\u003Cp\u003EThe results were dramatic... and I think I managed to crack one of the mysteries of KSP! Specifically... what makes Bill happy? (Warning, MANY images behind spoiler tag, for those of you on dialup!)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThe VK Sounding Rocket Mark 3 on the launch pad:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TMLIy.png\u0022 alt=\u0022TMLIy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELaunch was nominal, with the kickers on the pad holddown arms giving a good burst of initial acceleration to clear the flame pit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eGFpe.png\u0022 alt=\u0022eGFpe.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBecause I was concentrating on flight photography and letting Jeb and the SAS do most of the steering, we did have a *slight* attitude problem at first-stage burnout...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QkyxV.png\u0022 alt=\u0022QkyxV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut after second stage ignition using \u0027fire in the hole\u0027 staging, the guidance corrected nicely and started returning the rocket to its planned vertical attitude.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/we1ag.png\u0022 alt=\u0022we1ag.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond stage burnout occurred at a slightly lower than planned altitude, due to the first-stage guidance error, but a slightly higher velocity.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cgZ3N.png\u0022 alt=\u0022cgZ3N.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStaging and third stage ignition (again, \u0027fire in the hole\u0027 style) proceeded nominally.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gyBZM.png\u0022 alt=\u0022gyBZM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThird stage burnout occured at about 57km altitude and a peak velocity of just under 1200 m/s.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WhBA1.png\u0022 alt=\u0022WhBA1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was promptly followed by jettison of the third stage and the now-superfluous SAS module.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kNlJH.png\u0022 alt=\u0022kNlJH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first hint to my mystery: Bill started smiling the instant the first stage crashed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1k0H3.png\u0022 alt=\u00221k0H3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYet he was screaming in terror again well before apokee.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lKqcA.png\u0022 alt=\u0022lKqcA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHint #2: Bill grins after the second stage crashes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cajhd.png\u0022 alt=\u0022cajhd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile I didn\\\u0027t get a shot of it, he started screaming again just before apokee. However, immediately after apokee, he\\\u0027s grinning again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ra2HM.png\u0022 alt=\u0022Ra2HM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EApokee for this mission was 158,197 meters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hOsnU.png\u0022 alt=\u0022hOsnU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EG-loadings were also acceptable, at a peak of 4.1 during boost.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mYlXM.png\u0022 alt=\u0022mYlXM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPeak G-loadings during entry were 8.9\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r8tfv.png\u0022 alt=\u0022r8tfv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo what do I get from this experiment? My guess is that Bill is smiling when A) G-loading is in the green arc, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E all non-destroyed parts of the vehicle listed in the staging diagram are traveling in the same vertical direction. Notice how he was grinning when all the parts were still heading up, but screaming when a spent stage started to fall back to Kerbin.\u003C/p\u003E\u003Cp\u003EI then flew a second mission, not trying to get boost photography, instead concentrating on manual control to fly as vertically as possible. The results were pretty good:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI acheived a higher apokee and top speed...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TYR4b.png\u0022 alt=\u0022TYR4b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlbeit with entry G-loading spiking even higher, and still being above 2 when I deployed the parachute at 3000m altitude...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RJeP3.png\u0022 alt=\u0022RJeP3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd the \u0027probe\u0027 landing within sight of the launch pad, for easy recovery.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p4cu6.jpg\u0022 alt=\u0022p4cu6.jpg\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf it\\\u0027s technically feasible (gonna check the Wiki and maybe the SDK about this) and I can get permission to use the mesh and texture, I may convert Oniontrain\\\u0027s \u0027suspicious-looking object\u0027 into a half-meter command pod for these, so we can have a nose \u0027instrument pack\u0027 that *looks* correct on top, too.\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-22T16:40:52Z","Content":"\n\u003Cp\u003EIndeed, if you can manage to make that work that would be great for our little hobby. The only real reason I used the two-seven cluster layout here, which has turned out to be rather overpowered, was because it had much more pretty-looking provisions for stability boosting. I reckon if I cut baggage, parachute, etc. and removed some struts it could probably leave the atmosphere on first/early second-stage.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-09-22T21:15:18Z","Content":"\n\u003Cp\u003EHm. Can\\\u0027t find anything in the SDK or the Wiki that says the command pod has to be 1m base diameter, so I\\\u0027ll give it a whirl. I wonder if we could get Sunday Punch or NovaSilisko to make us a 0.5m-1m shroud decoupler, so we could use a 1m SRB as our first stage instead of a 0.5m cluster? (I seem to recall at least one sounding rocket having a fat first stage...)\u003C/p\u003E\n"},{"CreatedByName":"AstroAndrew","CreatedById":7741,"CreatedDateTime":"2011-09-22T21:31:16Z","Content":"\n\u003Cp\u003EHah just got vert burnout at 125,000m and over 3,700m/s Straight up! ;P Is it legal to mount SRB on side of SRB for sounding rocket?\u003C/p\u003E\u003Cp\u003EAnyways .craft below! Uses Nova/Winston parts, and uhh I think its TOO OVERPOWERED for sounding role, it catapulted them to like freakin 1570 KM from that vertical launch, their still slowing down 10 minutes into flight.\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2011-09-22T21:36:09Z","Content":"\n\u003Cp\u003EI used \u0027sounding rockets\u0027 to cover my initial, dead-simple, stock-parts-only designs - pod \u002B one SRB or tank-plus-engine. These weren\\\u0027t really supposed to be kermanned or to scale or anything; they were just so that I and/or the KSP could get a feel for launching stuff.\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-22T22:01:19Z","Content":"\n\u003Cp\u003E@AstroAndrew when I first testing my two-seven design, as I said in the OP, it propelled itself into deep space. Twice. I\\\u0027m thinking of changing it from two-seven to one-seven with a five- or four-piece cluster on top just to reduce the dV enough to keep it within Kearth\\\u0027s gravitational pull. Once we have the Micro CM, if we can have one, I\\\u0027ll also add more SAS nosecones to make the ascent more optimal. At the moment I can\\\u0027t really even consider a single stage burn because it only gets up to about 9-10km due to the weight of stage 2 including parachute and 1m pod.\u003C/p\u003E\u003Cp\u003E@rdfox IIRC Wobbly Rockets currently has a funny-looking curved fillet nosecone thingy that goes from 1 to 0.5. Problem is, well, it\\\u0027s... wobbly. Wobbly as in it oscillates under any kind of G-forces especially the 10\u002B at ignition. This, I have experienced, causes my model to lose control and snap at the centre, resulting in chunky guacamole. Anyone that could develop a little baby decoupler for that purpose that doesn\\\u0027t destroy rockets would receive a Jeb.\u003C/p\u003E\u003Cp\u003E@Anyone I would still be very grateful for a nudge in the right direction as to the mods and links for Mini-Winglets, MiniBoosters and Mini-Decoupler. I have a sneaky suspicion that the booster and decoupler are SIDR\u0026amp;SD.\u003C/p\u003E\n"},{"CreatedByName":"AstroAndrew","CreatedById":7741,"CreatedDateTime":"2011-09-22T22:03:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHm. Can\\\u0027t find anything in the SDK or the Wiki that says the command pod has to be 1m base diameter, so I\\\u0027ll give it a whirl. I wonder if we could get Sunday Punch or NovaSilisko to make us a 0.5m-1m shroud decoupler, so we could use a 1m SRB as our first stage instead of a 0.5m cluster? (I seem to recall at least one sounding rocket having a fat first stage...)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHAH A .5-1m part is already made, it\\\u0027s Nova\\\u0027s GSH-30 nosecap, might need to tweak mass to make it useable and stable! GL! now we need 1m-.5 part and perferable a shroud... Also I believe sunday pack has a short fat 1m low burntime SRB.\u003C/p\u003E\n"},{"CreatedByName":"TimothyC","CreatedById":8329,"CreatedDateTime":"2011-09-24T06:47:14Z","Content":"\n\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=2205.msg20594#msg20594\u0022 rel=\u0022external nofollow\u0022\u003EMini-Winglets\u003C/a\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-09-24T08:25:29Z","Content":"\n\u003Cp\u003EThank you very much good sir.\u003C/p\u003E\u003Cp\u003ETo everyone: Use these wherever you can - they\\\u0027re a much better stabiliser enatmos than SAS. They\\\u0027re also beautiful when you symmetry-place three of them in spaceplane AGM\\\u0027s.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=2205.msg20594#msg20594\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=2205.msg20594#msg20594\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-10-02T12:13:47Z","Content":"\n\u003Cp\u003ESnippy snippy, I suck. \u0026gt;\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2011-10-02T12:23:29Z","Content":"\n\u003Cp\u003EIt looks more like he\\\u0027s scaled up the launch tower-which means it should get in the way less, at least.\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2011-10-02T13:28:32Z","Content":"\n\u003Cp\u003EBalls, you\\\u0027re right. I got excited then. :\\\u0027(\u003C/p\u003E\n"}]}