{"TopicId":24761,"ForumId":16,"TopicTitle":"Duna space-planes","CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T00:17:49Z","PageNum":1,"Articles":[{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T00:17:49Z","Content":"\n\u003Cp\u003ESo I\u0027ve been preparing my Duna program, I have 4 ships in orbit ready to go, and I want to add a space-plane to the mix. The problem is, I have no idea how the planes will react to lower gravity and thinner atmosphere. I have a plane built that flies pretty well on Kerbin (rocket powered, of course) but I don\u0027t know if it\u0027ll get enough lift to fly properly on Duna.\u003C/p\u003E\u003Cp\u003EIs there a good rule of thumb for designing planes and testing them on Kerbin? Or more helpfully, how does the atmospheric thickness contribute to lift?\u003C/p\u003E\n"},{"CreatedByName":"SGT_RIZZO300","CreatedById":58229,"CreatedDateTime":"2013-04-30T00:26:05Z","Content":"\n\u003Cp\u003EI am not sure however I \u003Cstrong\u003Ethink\u003C/strong\u003E that the lower atmosphere (less lift) is made up for by the lower gravity. I have only tested it with a tiny RC jet so far.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-04-30T00:36:35Z","Content":"\n\u003Cp\u003EI tried with a little RC jet and it worked on kerbin but failed on Duna. Now from what i see the lower gravity does not make up for the lack of lift, so expect high landing speeds (100 m/s). \u003C/p\u003E\u003Cp\u003EPersonally, I think landing at Duna is a waste of fuel. What i do is use a space plane to orbit the planet (and rendezvous with a station/refuel depot) and then use smaller (vertical) shuttles to take men and supples to and from the surface. It saves fuel and is a lot easier than landing a large spaceplane....\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-04-30T01:37:49Z","Content":"\n\u003Cp\u003EYeah, I made an electric UAV for the heck of it. It flies great on Kerbin, is in the air before it hits 20 m/s. Has to hit about 80 m/s to get airborne on Duna. I have yet to manage to land it without damaging it on Duna. Think I\u0027m replacing the UAV I was planning on sending with either a tethered balloon, or a probe lander sitting on Ike, either way with a telescope pointing at the colony.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-04-30T09:30:10Z","Content":"\n\u003Cp\u003EIf you are just interested in getting to the surface and back to orbit, then you can try using legs...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8097/8469498311_2243838dbb_c.jpg\u0022 alt=\u00228469498311_2243838dbb_c.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-30T13:22:31Z","Content":"\n\u003Cp\u003EThe surface pressure at the datum on Duna is roughly the same as that on Kerbin 10km above sealevel. So, if your plane flies well at 15km or higher in testing out of KSC, you\u0027ve got a usable Duna Flyer. If you can only ascend to 12-14km, you can fly above the lowlands but will need to dodge the mountains and avoid the highlands.\u003C/p\u003E\u003Cp\u003EI prefer airships for Duna. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MBSxL.jpg\u0022 alt=\u0022MBSxL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/x1IEy.jpg\u0022 alt=\u0022x1IEy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P546WsC.jpg\u0022 alt=\u0022P546WsC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X0pbvRm.jpg\u0022 alt=\u0022X0pbvRm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESlower, yes, but much safer than planes and even safer than rovers. Faster than rovers, too. If you\u0027re building a permanent Duna base, check out the Hooligan Labs Airships mod.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-30T13:31:10Z\u0022 title=\u002204/30/2013 01:31  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 30, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T13:29:44Z","Content":"\n\u003Cp\u003ERelated question: what is the comparison between parachuting on Kerbin and Duna? I want to air-drop in a bunch of rovers, and I\u0027m not sure how slow they need to descend on Kerbin to correspond to a safe descent on Duna. I don\u0027t want to bomb the surface, I want to explore it.\u003C/p\u003E\u003Cp\u003EEDIT: Even better, if anyone knows the equations they use to model air resistance in terms of atmospheric density, I could just figure it all out myself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-30T13:37:07Z\u0022 title=\u002204/30/2013 01:37  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 30, 2013\u003C/time\u003E by Nuclear_Wizard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-30T13:42:40Z","Content":"\n\u003Cp\u003EYou can\u0027t test parachutes on Kerbin because the unreefing is controlled automatically by height above the surface.\u003C/p\u003E\u003Cp\u003EYou\u0027ll want \u003Cstrong\u003Ea lot of parachutes\u003C/strong\u003E for landing on Duna, though. Here\u0027s an example of me landing a heavier rover there...\u003C/p\u003E\u003Cp\u003EI slowed down a lot with retrorockets before the parachutes opened, and still used a little rocket thrust a few meters above the surface to cushion the landing more.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FJsJIan.jpg\u0022 alt=\u0022FJsJIan.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M5m0d5V.jpg\u0022 alt=\u0022M5m0d5V.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GVFbD6u.jpg\u0022 alt=\u0022GVFbD6u.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TLw6gez.jpg\u0022 alt=\u0022TLw6gez.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QOR9Z9Y.jpg\u0022 alt=\u0022QOR9Z9Y.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/evEbyj3.jpg\u0022 alt=\u0022evEbyj3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TjbxWJy.jpg\u0022 alt=\u0022TjbxWJy.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T13:47:42Z","Content":"\n\u003Cp\u003ERobotRay, that is a cool truck and landing.\u003C/p\u003E\u003Cp\u003EMy question is, more specifically, if my rovers are currently landing at around 5 m/s (assuming they are adequately slowed from orbit) what speed will they land on Duna? What is the rule of thumb, and is there some equation I can use?\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-30T13:51:36Z","Content":"\n\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EI don\u0027t really know a correlation between landing speeds from parachutes on Kerbin to Duna. I\u0027ve got a gut feeling that 5m/sec may not be enough, though.\u003C/p\u003E\u003Cp\u003EI rarely attempt parachute-only landings on Duna; I usually go for parachute-assisted powered landings, letting the \u0027chutes do most of the work and hold the craft upright while I throttle the landing engines to hit the target descent speed.\u003C/p\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T13:54:13Z","Content":"\n\u003Cp\u003EYeah, that\u0027s looking more and more like the best option here. I wanted to have a ship in low orbit with 8 or so mini rovers on it that are just fire and forget, so they auto parachute and land themselves. Might need to get more involved with the landings now.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-30T13:57:40Z","Content":"\n\u003Cp\u003EThere\u0027s a mod for inflatable airbags, but I can\u0027t recall the name. You could always do a bouncy Mars-rover-style landing with them to cushion the jolts from the parachute descent. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://spaceflightnow.com/news/n0005/13mars2003/mpfedl.jpg\u0022 alt=\u0022mpfedl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat might work well for small, lightweight mini-rovers.\u003C/p\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-04-30T14:00:15Z","Content":"\n\u003Cp\u003EThanks, I\u0027ll look it up.\u003C/p\u003E\u003Cp\u003EWorst case scenario is I manually land them, and a few of them crash. Expensive but no lives lost.\u003C/p\u003E\n"},{"CreatedByName":"mewp","CreatedById":40351,"CreatedDateTime":"2013-04-30T14:36:01Z","Content":"\n\u003Cp\u003EIf you\u0027re looking to fly on Duna, it should be relatively similar to Kerbin. The handling characteristics of your plane should be similar to when you\u0027re in the upper atmosphere of Kerbin - you will have a little less dynamic control authority from your flaps / canards / movable wings (that is to say if you wanted to up and turn your plane around using your controls, it would take a little longer), and you should have nearly identical static stability of the plane (the natural tendency to your plane - does it flip over itself when you let go of the controls? or does it glide nicely?).\u003C/p\u003E\u003Cp\u003EThe one thing to keep in mind is if you\u0027re burning fuel from your plane to get to Duna, of course your center of gravity can shift significantly. So although you\u0027ve tested your plane out and it fly\u0027s fine on Kerbin on a full tank of gas, it may not be stable or as stable on Duna with a half a tank of gas.\u003C/p\u003E\u003Cp\u003EIf you\u0027re interested I did a quick video on aircraft stability (and rocket stability - they\u0027re similar topics):\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/TUTr3sFvB9I?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-05-01T00:18:35Z","Content":"\n\u003Cp\u003EThat was a good video, mewp, I didn\u0027t actually know that about planes. I assumed I needed the COM on top of the COL.\u003C/p\u003E\n"},{"CreatedByName":"Rockhem","CreatedById":57141,"CreatedDateTime":"2013-05-01T00:23:04Z","Content":"\n\u003Cp\u003ETo simulate flying at a regular duna altitude say, 3km. that should be around 13km or so to simulate that. although the lower gravity cant be simulated but this could be close!\u003C/p\u003E\n"},{"CreatedByName":"mewp","CreatedById":40351,"CreatedDateTime":"2013-05-01T03:44:09Z","Content":"\n\u003Cp\u003EThanks! And you bring up another good point about stability of things while they\u0027re flying through air. The placement of the COM and the COL laterally along the plane (in the direction of \u003Cem\u003Eintended\u003C/em\u003E travel) matters significantly in how well the plane fly\u0027s (really how well the plane controls its pitch), however the COM and COL placement along the height of the plane does matter as well. The height-wise placement of the COM and the COL dictate your roll stability - having the COM above your COL would act in the reverse pendulum effect, and the reverse for having the COL above the COM.\u003C/p\u003E\u003Cp\u003EThe physics behind a plane being more stable in roll with the COL above the COM is a bit complicated, as well, the height-wise placement of the two points affects other stability parameters. That being said there are some interested examples to note - significantly is what is called \u0022wing dihedral\u0022, which is how much the wings are rotated up or down with respect to the long axis of the plane. Planes with a positive dihedral are trying to bring the COL up, and the planes with negative dihedral are trying to bring the COL down. A good illustration of a positive dihedral plane, as well as a quick preview of how the physics make the plane more stable in roll can be summed up simply by this image \u003Ca href=\u0022http://history.nasa.gov/SP-367/fig144.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://history.nasa.gov/SP-367/fig144.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHope this hasn\u0027t put you to sleep!\u003C/p\u003E\n"},{"CreatedByName":"Tristavius","CreatedById":60879,"CreatedDateTime":"2013-05-01T10:23:40Z","Content":"\n\u003Cp\u003EI\u0027ve been doing a lot of Duna landings with various sized craft recently. My first few designs used lots of parachutes, but that was the only source of descent and all but the tiniest designs failed to land.\u003C/p\u003E\u003Cp\u003EFor landing any kind of size, you really want a bit of engine power as well... doesn\u0027t need to be much at all, almost a token effort. Last night I was dropping about 30 tons on 4 high atmosphere and 4 radial parachutes. They were able to brake effectively from whatever speed I was doing on insertion with no structural failure and between them would bring my decent to about 30-40m/s reaching the surface. From there it really is just a few puffs from a liquid engine during the last 300m or so to bring it down at a safe 5-10m/s.\u003C/p\u003E\u003Cp\u003EMay try and do some experiments with different weight and parachute combinations and what speed they should bring you down to.\u003C/p\u003E\n"},{"CreatedByName":"Nuclear_Wizard","CreatedById":20145,"CreatedDateTime":"2013-05-01T11:49:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mewp\u0022 data-cite=\u0022mewp\u0022\u003E\u003Cdiv\u003EHope this hasn\u0027t put you to sleep!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs a physics student, I find this all quite interesting. Maybe I\u0027ll read up on the physics of planes on the weekend, when I have some time. The COM/COL height thing makes sense, I can see it effecting the stability in ways I can\u0027t imagine.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tristavius\u0022 data-cite=\u0022Tristavius\u0022\u003E\u003Cdiv\u003EThey were able to brake effectively from whatever speed I was doing on insertion with no structural failure and between them would bring my decent to about 30-40m/s reaching the surface. From there it really is just a few puffs from a liquid engine during the last 300m or so to bring it down at a safe 5-10m/s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is good to know. As long as I don\u0027t have to slow down from orbital velocities with engines, it should all be pretty easy to upgrade the rover landers.\u003C/p\u003E\n"},{"CreatedByName":"xzxvrx","CreatedById":57321,"CreatedDateTime":"2013-05-01T12:22:21Z","Content":"\n\u003Cp\u003EDid you mean this mod?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/cp-airbag-system/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/cp-airbag-system/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-01T12:59:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xzxvrx\u0022 data-cite=\u0022xzxvrx\u0022\u003E\u003Cdiv\u003EDid you mean this mod?\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/cp-airbag-system/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/cp-airbag-system/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s the one I played around with a while back. I think there\u0027s another one out there with bigger bags, but that one should work.\u003C/p\u003E\n"}]}