{"TopicId":24773,"ForumId":24,"TopicTitle":"Hello from a new kerbonaut","CreatedByName":"ArkaelDren","CreatedById":57992,"CreatedDateTime":"2013-04-30T02:20:29Z","PageNum":1,"Articles":[{"CreatedByName":"ArkaelDren","CreatedById":57992,"CreatedDateTime":"2013-04-30T02:20:29Z","Content":"\n\u003Cp\u003EJust thought I would drop a line even though I have been playing for 3 months. I Love this community, and I cant believe their is an incredible game out here, that is not being plundered and destroyed by little disrespectful children. I fear for our beloved KSP as it is gaining momentum and will likely be over run by these horrible creatures in no time. \u003C/p\u003E\u003Cp\u003ENote: 1) Please Dev\u0027s, make use of multiple cores.\u003C/p\u003E\u003Cp\u003E 2) Please make a 64 bit version so I can have fun loading every damn great part I can find with out killing my KSP.\u003C/p\u003E\u003Cp\u003ELove to all, I have \u0022never\u0022 played a game that has what KSP has. Again, great community and INCREDIBLE GAME....keep up the great work Dev\u0027s/Mod\u0027s.\u003C/p\u003E\u003Cp\u003EDren\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-04-30T06:45:00Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"RawChicken","CreatedById":57199,"CreatedDateTime":"2013-04-30T11:24:44Z","Content":"\n\u003Cp\u003EHi! Welcome to the forum and good luck on your launchings!\u003C/p\u003E\u003Cp\u003EYes, the devs said they were going to make the code more efficient and I guess, they will also implement multiple core management.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-04-30T18:57:15Z","Content":"\n\u003Cp\u003EWelcome to the community ArkaelDren \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKSP does use multiple cores, but it can only use \u003Cem\u003Eone\u003C/em\u003E core per thread, it cannot spread them out and this is a Unity3D limitation, not part of the KSP code.\u003C/p\u003E\u003Cp\u003EAlso, some of our more mature and respected members are kids, one shining example is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/member.php/41772-mustwinfull\u0022 rel=\u0022external nofollow\u0022\u003EMustwinfull\u003C/a\u003E who despite being one of the major names here on the KSP forums, is only 13 years old.\u003C/p\u003E\u003Cp\u003EIt just shows that kids aren\u0027t bad, if you treat them like\u003Cem\u003E people\u003C/em\u003E and not like kids, and KSP tends to attract the more thoughtful individuals as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AceGamer","CreatedById":61925,"CreatedDateTime":"2013-04-30T19:51:19Z","Content":"\n\u003Cp\u003EI do hope the make the game a little less laggy and efficient but its still a great game!\u003C/p\u003E\u003Cp\u003EFly Safe\u003C/p\u003E\n"},{"CreatedByName":"ArkaelDren","CreatedById":57992,"CreatedDateTime":"2013-05-02T11:56:47Z","Content":"\n\u003Cp\u003ESorry if I seemed to include \u0022all\u0022 kids in that type or category. I have 4 great kids of my own, I am simply pointing out a majority on almost every forum I have been on in the last few years. I did say, \u0022the little disrespectful ones\u0022... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E So I am uneducated in regards to computers/coding/ anything that has to do with them in general. You had mentioned that KSP does utilize multicore cpu\u0027s. Why does KSP seem to drag down my Comp so easily? Its not top of the line, but it is up their.\u003C/p\u003E\u003Cp\u003EThx again Salvager\u003C/p\u003E\u003Cp\u003EDren\u003C/p\u003E\n"}]}