{"TopicId":24958,"ForumId":32,"TopicTitle":"How to fix part not being anywhere near cursor","CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T10:04:39Z","PageNum":1,"Articles":[{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T10:04:39Z","Content":"\n\u003Cp\u003EI\u0027m sure everyone would love to know how to fix this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r20JTCx.jpg\u0022 alt=\u0022r20JTCx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NDV2a7W.jpg\u0022 alt=\u0022NDV2a7W.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uU80Ey1.jpg\u0022 alt=\u0022uU80Ey1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo does ANYBODY know how? Don\u0027t say \u0022oh attach the green dots to one another\u0022 since that doesn\u0027t work as the part isn\u0027t even in the buildable area after I pick it from the list.\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-05-01T10:09:35Z","Content":"\n\u003Cp\u003EIs it lag? Lag between mouse updates can delay the positioning of parts.\u003C/p\u003E\u003Cp\u003EOther than that, I\u0027m stumped.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T10:11:10Z","Content":"\n\u003Cp\u003ENope. Smooth as can be. I have to save the ship and restart ksp to be able to put any more parts on.\u003C/p\u003E\n"},{"CreatedByName":"electronicfox","CreatedById":43373,"CreatedDateTime":"2013-05-01T10:26:21Z","Content":"\n\u003Cp\u003EIt looks like some kind of boundaries issue going on whenever this happens, like the entire building area has shifted relative to the mouse position for whatever reason.\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-05-01T10:49:09Z","Content":"\n\u003Cp\u003ETry hovering your mouse over the vessel. The part might try to connect to the plane and not be stuck to the floor.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T10:55:13Z","Content":"\n\u003Cp\u003EI do that and the plane turns green like its going to place it, and then i click only to find the part either under the plane or outside the hangar.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-01T11:11:22Z","Content":"\n\u003Cp\u003EUsually I delete the part and pick another one and it seems to work okay after that.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-05-01T11:13:35Z","Content":"\n\u003Cp\u003EI get that happening too, thou I\u0027m not 100% sure what I do to fix it. I think I change the camera position so the craft is between me and the pesky part and then try to radially attach it to anywhere. Once attached I then re-pos camera and try it again, but I often find once they start doing that, they keep doing it. So I consider that part dead, send it back and grab a new copy from the list. I never have to restart KSP (for that) thou.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T11:20:21Z","Content":"\n\u003Cp\u003EWhile we\u0027re at it what about the center of lift being off to one side for no reason?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Dqa6S49h.jpg\u0022 alt=\u0022Dqa6S49h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eZ5B2t7h.jpg\u0022 alt=\u0022eZ5B2t7h.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-05-01T12:13:20Z","Content":"\n\u003Cp\u003Ehmmm, that looks odd, looks symmetrical, or at least symmetrical enough to not have the COL so far over to one side.\u003C/p\u003E\u003Cp\u003EWhen building the wing sections on planes I work just on one side (with symmetry obv, but it less important this way), then I remove one whole side from a branching point, (in your case the tank just after the 1-to-2 adapter), make sure symmetry is on and put it back on. That way I know that the whole side has been mirrored and any cases of me forgetting to have symmetry when I placed something gets take care off. \u003C/p\u003E\u003Cp\u003EOh, one thought, you don\u0027t have two wings merged into one, just on one side do you?\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-01T13:04:06Z","Content":"\n\u003Cp\u003EThey are perfectly mirrored. So I don\u0027t get it.\u003C/p\u003E\n"},{"CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2013-05-01T13:22:49Z","Content":"\n\u003Cp\u003EDid you resize your screen? I used to have this problem when I changed the size of the screen after the game started, I think. Once I either restarted the game or returned to original window size, the part stayed on top of the mouse.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027d think that for some reason the wing piece you\u0027re using only provides lift when it is held one way and not upside down. Since KSP does not mirror-image parts so much as rotate them around (even when using horizontal symmetry in the SPH), the problem may be that the wing is placed with symmetry. I expect a plugin like FAR could also play merry hell with the aerodynamic properties of the wing. The issue may be only graphical, though: Be sure to give the wings a flight test to test the lift of either wing.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-05-01T13:57:12Z","Content":"\n\u003Cp\u003EUsually when making parts this is caused by not having the part in the centre of the scene on export but as this is in general instead of add-ons I guess you\u0027re using someone else\u0027s parts rather than making you own?\u003C/p\u003E\n"}]}