{"TopicId":24997,"ForumId":32,"TopicTitle":"Protractor, Kerbal Engineer, Kerbal Alarm Clock, MechJeb and navigation...","CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2013-05-01T17:27:27Z","PageNum":1,"Articles":[{"CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2013-05-01T17:27:27Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI\u0027m fairly new to KSP (been playing about a month now) and am still learning some things. One thing I am particularly struggling with is navigation... in practice at least. Having watched Scott Manley\u0027s video on navigating between planets I felt like I\u0027ve got a good grasp on it. Using the online calculator and manoeuvre nodes I managed to get a distant encounter, but it took a lot of effort. So I started trying mods (Protractor, Kerbal Engineer Redux, MechJeb and Kerbal Alarm Clock) that will make it easier, but after many tests over the last few weeks, I\u0027ve been left with more questions than answers...\u003C/p\u003E\u003Cp\u003E1) The Protractor mod gives two angles that are \u0022countdowns\u0022 and as in Scott\u0027s videos this makes sense. One is the angle of Kerbin relevant to the target planet, the other is the angle during my orbit that I need to begin the burn to escape and basically I ideally wait for them to both be 0\u0027. I have used this in conjunction with the manoeuvre nodes and can get an encounter (albeit not a close one, but I could correct it during the journey). So today I gave Kerbal Engineer a go after noticing that it seems to show the same information, plus loads more. In Kerbal Engineer, I can see the \u0022Intercept Angle\u0022 nearly matches up with the first value in Protractor (it is out by a degree). However, I can\u0027t see any angle that \u0022matches\u0022 with the second angle in Protractor, including the one labelled \u0022Ejection Angle\u0022. Why are these values different? What am I not understanding? And what are the other angles displayed in Kerbal Engineer used for?\u003C/p\u003E\u003Cp\u003E2) Kerbal Alarm Clock has a feature for adding alarms for transfer windows, which I used in a game a week ago. When the alarm eventually went off, Protractor was showing that I was 2\u0027\u002B past the point at which I should transfer (even with several hours advance warning set on the alarm). Why was there such a difference? And does it matter?\u003C/p\u003E\u003Cp\u003E3) Is there a way to find out how much TWR or Delta-V I\u0027ll \u003Cem\u003Eneed\u003C/em\u003E at various stages of a mission other than trial and error? Or is that like asking how long a piece of string is? Loads of mods can tell me what those values currently are (and what they\u0027d be on other planets), but nothing tells me what I need to get into orbit, or get from Kerbin to the Mun, or perform a transfer from Kerbin to Eve. Trial and error doesn\u0027t bother me so much with the short hops I\u0027ve been doing so far, but I\u0027d hate to do a mission to Jool, only to get swallowed up because I under-guesstimated the amount of fuel required to achieve orbit.\u003C/p\u003E\u003Cp\u003E4) In MechJeb 2 is there a way to get it to display the angles needed for navigation in the same way that Protractor/Kerbal Engineer do (counting down)?\u003C/p\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-01T17:58:20Z","Content":"\n\u003Cp\u003E1. With the advent of maneuver nodes, the omega provided by Protractor is a lot less useful than it once was. You can just muck about with maneuver nodes to find the correct ejection angle.\u003C/p\u003E\u003Cp\u003E2. The only real impact of being a few degrees off of optimal timing is that you burn a bit more fuel to \u0022catch up\u0022 with your target time. It\u0027s pretty similar in principle to how there\u0027s about a billion intercepts possible of the Mun from Kerbin orbit, but some of them are more fuel-efficient than others for getting you where you want to go.\u003C/p\u003E\u003Cp\u003E3. There is: consult a system map. Here\u0027s one I cooked up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.skyrender.net/lp/ksp/system_map.png\u0022 alt=\u0022system_map.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E Keep in mind that those are average values displayed. There is no absolute dV requirement for anything, since your starting conditions, TWR, piloting skills, and a number of other factors are what determine your required dV. When in doubt, have a fudge factor of 10% for your fuel margins at minimum.\u003C/p\u003E\u003Cp\u003E4. No idea; never used MechJeb.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-01T18:02:41Z\u0022 title=\u002205/01/2013 06:02  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 1, 2013\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-05-01T18:01:14Z","Content":"\n\u003Cp\u003ESadly, i\u0027m not an expert in interplanetary astrogation. I can easily get to both moons and Duna, but thats about all for now. Missions to Eve and Jool are a series of trials and errors involving a lot of eyeballing, and Dres frankly scares me with it\u0027s huge inclination \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But as for point 3: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.skyrender.net/lp/ksp/system_map.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.skyrender.net/lp/ksp/system_map.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETry to use this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EWow. I\u0027ve been ninja\u0027ed by the very author. Now you have it straight from the source.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-01T18:03:28Z\u0022 title=\u002205/01/2013 06:03  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 1, 2013\u003C/time\u003E by Scotius\u003C/strong\u003E\n\u003Cbr\u003EBeing too late.\n\u003C/span\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2013-05-01T18:10:52Z","Content":"\n\u003Cp\u003EBasically, both protractor and kerbal alarm clock give countdowns by by assuming that all the planets move in equatorial, circular orbits at constant velocities. Only Kerbin actually does. If you want an alarm that is closer to what Protractor is eventually going to show, you may want to set an alarm that hits a week or two ahead of the prediction, and then set a new alarm that may produce a more accurate number when the alarm hits zero.\u003C/p\u003E\u003Cp\u003EIs it that big of a deal? My feeling is \u0022Not really,\u0022 as SkyRender mentions. If you were measuring phase angles by putting an actual plastic protractor on the screen, you\u0027d probably wind up being off by more, and ultimately, the mod is intended to help get you close to your target, the rest is your piloting.\u003C/p\u003E\n"},{"CreatedByName":"Noticeably FAT","CreatedById":43401,"CreatedDateTime":"2013-05-01T18:30:21Z","Content":"\n\u003Cp\u003EI use:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003EThis calculator\u003C/a\u003E to get an optimum phase/ejection angle, and approximate dV requirement.\u003C/p\u003E\u003Cp\u003EMechJeb to find my current phase angle\u003C/p\u003E\u003Cp\u003EThe equation in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26727-How-often-Kerbin-is-in-phase-with-other-planets\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E to find the time to the next optimum phase angle\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock to let me know when that phase angle is coming up (I started using KAC before it had phase angle alarms, I still don\u0027t use them because it\u0027s more fun to break out the slide rule and calculate the time manually)\u003C/p\u003E\u003Cp\u003EAll that gets me close to the required phase angle, and close to the required dV. At that point I eyeball the ejection angle and set up a maneuver node. I start out with the dV value Olex\u0027s calculator gave me, and futz with it from there. I\u0027ve gotten an intercept within ~200m/s each of the half dozen or so times I\u0027ve tried it. The only times I\u0027ve had to to mid-course corrections is when I tried periapsis kicks (I didn\u0027t do them well) and once when I wasn\u0027t paying close attention and was going to end up in a highly inclined orbit that I didn\u0027t want (though I still would have ended up in an orbit).\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-01T19:52:36Z","Content":"\n\u003Cp\u003ESkyRender, do you have a single central thread for your system map? Some of your numbers need revision. Dres takes closer to 600 m/s more than Kerbin escape to transfer to, and about 1500 m/s to capture at. And if you can capture into a circular low Mun orbit for only 210 m/s from a LKO Hohmann transfer, I\u0027d like to see how. It\u0027s usually closer to 260-280 for me.\u003C/p\u003E\u003Cp\u003EProtractor and alarm clock might be using different methods to calculate the windows, not sure.\u003C/p\u003E\u003Cp\u003EI think the phase angles were added to MechJeb2 somewhat recently, you might have to select the target planet first and make a custom info window. The numbers there aren\u0027t in countdown form, but you can easily determine the number you\u0027re waiting for from ksp.olex.biz.\u003C/p\u003E\u003Cp\u003EAll of these methods are really only good for near-circular and low-inclination planets. For Moho, Dres, and Eeloo especially, phase angles are going to be a ways off. In the MechJeb2 maneuver planner, select the planet as a target then make maneuvers for \u0022transfer to another planet\u0022 then \u0022fine-tune closest approach\u0022 and you should get much closer, as it\u0027s using the actual elliptic trajectory, the real minimum distance, and a real Lambert solver for the fine-tune option.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-01T21:41:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maltesh\u0022 data-cite=\u0022maltesh\u0022\u003E\u003Cdiv\u003EBasically, both protractor and kerbal alarm clock give countdowns by by assuming that all the planets move in equatorial, circular orbits at constant velocities. Only Kerbin actually does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery true. Last time I went to Duna, I botched the estimate for how much delta-V I\u0027d need, so needed an almost perfect return transfer. Checking on the transfer when protractor said to would have resulted in a required course correction that was more than just minor. However, I noticed that most of the course correction came down to hitting Kerbin\u0027s orbit at the same time kerbin was there. By waiting a while, I was able to almost eliminate the need for a course correction. And by a while, I\u0027m talking a good 15 or 20 degrees worth of phase angle. Those numbers that come out of those two are estimates only because of this.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-01T21:46:46Z","Content":"\n\u003Cp\u003EThe thread for my system map was eaten by the unintended forum purge, unfortunately. Also, you have to remember some important facts about that map. One: the values are all averages; as I noted, there are no absolute values there, and your results can and will vary depending on your parameters. Two: no planet save Kerbin has a perfectly circular orbit, ergo you are not guaranteed to need the average dV it takes to get to it (Dres in particular can be pretty wildly off-base if you start from a phase angle that puts it on the far end of its orbit from the sun). And three: the values are meant as a guideline only. You should never base your entire flight plan off of averages.\u003C/p\u003E\u003Cp\u003E As for Munar circularizing, it does take close to 260m/s if you\u0027re coming in very low. If you come in high, it can take barely 150m/s (but your landing will take a lot more). Similarly, coming in from a low orbit, you can land on the Mun at a meaningful discount on that 640m/s (and return to that low orbit for a similarly discounted amount). In those cases, you\u0027re just trading off when you expend the dV, for the most part.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-01T22:15:25Z","Content":"\n\u003Cp\u003EAverages based on what though? It\u0027d be nice if you could make a spreadsheet or something that showed based on orbital parameters where you were getting these numbers from.\u003C/p\u003E\u003Cp\u003EI like to time my transfers so I get to my target near its AN or DN, so I need very little if any inclination correction. I guess I should compare the 1-burn transfer that goes a longer distance to a 2-burn transfer when the target\u0027s closer. What I\u0027d really love to see (and have been considering putting together) would be a proper Lambert-based almanac of transfer windows. Could maybe even do a comparison of 1-burn transfer delta-V to 2-burn solutions that use the ecliptic projection then an inclination correction.\u003C/p\u003E\u003Cp\u003EThere\u0027s no point to ever circularizing at a higher altitude than the lowest stable orbit if your mission plan involves transferring in and out of SoI and/or landing, as potential energy is pretty much useless... IMO it would be more useful for transfer data to be relative to the lowest stable orbit. Raising and lowering orbits within a single SoI is a much easier calculation than ejections to real Lambert-solution transfers.\u003C/p\u003E\u003Cp\u003EFor those of us doing challenges to take minimalist ships as far as possible, it\u0027s nice having an accurate guideline for doing our design, and an unpleasant surprise when that guideline ends up way off the mark.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-01T23:57:12Z","Content":"\n\u003Cp\u003EWhat you\u0027re asking for is technically feasible, but not as a single comprehensive chart. Rather, it would require a series of separate charts for each planet-to-planet/moon interaction. That\u0027s pretty far outside the scope of a delta-V map, which is meant to give a general idea of what sorts of expenditures you\u0027ll be looking at so you can design something powerful enough to complete your desired mission. There are others better-suited to such a task than myself, particularly in regards to the sort of time it would take.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-02T00:40:03Z","Content":"\n\u003Cp\u003EThere was one thing I was asking for, which was can you share how you got your numbers. What I\u0027m musing about possibly working on would be a much more complicated transfer almanac. Someone had been working on a fancy porkchop plotter for KSP around the 0.16 timeframe which would be a good place to start, but I don\u0027t think he kept working on it and I\u0027m not sure whether the post or what he accomplished so far are now victims of the purge...\u003C/p\u003E\n"},{"CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2013-05-02T09:45:12Z","Content":"\n\u003Cp\u003EThanks for the help everyone. That map in particular is going to be really useful.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-05-02T10:13:34Z","Content":"\n\u003Cp\u003EDoint the pork chop chart and working out the delta-vs for non-Hohmann transfers looks pretty hard, but calculating the numbers shown on charts isn\u0027t too bad. I typed it up but decided it deserved a thread of it\u0027s own.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27171-Calculating-interplanetary-delta-v\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/27171-Calculating-interplanetary-delta-v\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-05-02T10:29:54Z","Content":"\n\u003Cp\u003EPure stock player here! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EPractice makes perfect, i\u0027ve gone through a dozen saves or so and the only way (i to be good at it is without help from mods!\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-02T11:11:24Z","Content":"\n\u003Cp\u003EI always use the phase angle for burn in protractor as an hint of where to put my maneuverer node and nudge it until I get an intercept or at least an close pass. \u003C/p\u003E\u003Cp\u003EAlso remember you can add an second node along the projected path this is very useful for target out of orbital plane like Moho or Eeloo\u003C/p\u003E\n"}]}