{"TopicId":25172,"ForumId":32,"TopicTitle":"Tryin to build aweome but tryin 2 avoid the lag monster","CreatedByName":"Dudeman1420","CreatedById":60107,"CreatedDateTime":"2013-05-02T19:56:01Z","PageNum":1,"Articles":[{"CreatedByName":"Dudeman1420","CreatedById":60107,"CreatedDateTime":"2013-05-02T19:56:01Z","Content":"\n\u003Cp\u003Ehowdy hooooo fellow space pilots!So i am stuck between a rock and a hard place and need some help figuring it out.So Below is my third station around mun.Why 3rd you ask?Because the other two are to big/lagg to much to try to even get within 2.5k of them.So i set of to build an awesome looking and efficient station that doesn\u0027t create a lagg monster when trying to dock or approach it.As you can see its not even complete,it only has a hab module ,keth tanks, and docking rack along the bottom, i still need to add atleast one keth converter with liquid fuel tanks attached, but im already approaching 400 parts.AT this point i think my only options are to stop building until optimization in hopes it reduces lag on somewhat \u0022bigger\u0022 builds. Or add the two liquid fuel tanks laggin to crap.So that\u0027s why i am here to get ideas from the awesome community genius \u0022design\u0022 engineers !Or anyone for that matter that could possibly help me with this predicament! Thanks a bunch~the dude abides.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ujHdQHt.jpg\u0022 alt=\u0022ujHdQHt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eso above is the hab module and keth tanks u can see clearly, i want to put the converters and liquid fuel tanks vertically in the same area as the kethtanks.And on the oppisite side i can see some of the ports is the docking rack\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xellith","CreatedById":35053,"CreatedDateTime":"2013-05-02T20:11:19Z","Content":"\n\u003Cp\u003EI actually created a bunch of pieces that are large and have simplistic colliders. This leads to little to no lag while still allowing you to have a lot of resources in orbit. \u003C/p\u003E\u003Cp\u003EYou can try my parts by clicking here: \u003Ca href=\u0022http://kerbalspaceprogram.com/sizedd-part-pack-0-1/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/sizedd-part-pack-0-1/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI must warn you though that they arnt uber looking or anything like that. But they get the job done. The screenshots on that page gave me a very small amount of lag. If you try the parts out then I hope it helps. If you dont then okie dokie lol. (btw ima use your screenshot for my next station part lol)\u003C/p\u003E\n"},{"CreatedByName":"Dudeman1420","CreatedById":60107,"CreatedDateTime":"2013-05-02T20:18:52Z","Content":"\n\u003Cp\u003EFor sure ,i\u0027ll take a look.And i have more pics different angles if you\u0027d like too.I\u0027d like to add to this instead of building a fourth base around MUN,atleast for now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}