{"TopicId":25464,"ForumId":51,"TopicTitle":"Long-term Laythe Mission (pic heavy) - ^_^ With Part 45 ^_^","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-04T20:31:45Z","PageNum":33,"Articles":[{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-09T04:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003E...Your misshapen Birddogs remind me somewhat of the SR-71. The Blackbird was built for flight tolerances, where its shell and airframe expanded considerably from the heat. As a result certain seams and seals just didn\u0027t match up on the ground... deliberately... and the poor things leaked fuel (and who knows what else) when not flying. Even the one at the Air \u0026amp; Space has some odd looking gaps here and there. So maybe the Bird Dog is just jealous? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe JP-7 fuel used by the Blackbird had a very low flash point, so it wasn\u0027t dangerous when it leaked out of the SR-71\u0027s gaps and onto the runway. If you threw a lit match in a puddle of JP-7, the match would go out. The coolest story (some museum guy told us) was that a tanker plane carrying JP-7 crashed on a runway, and that plane\u0027s fuel burst into flame...until the JP-7 tank spilled its contents all over the fire...and put it out!\u003C/p\u003E\u003Cp\u003EBecause of the low flash point of the fuel, the SR-71 had to use triethylborane (nasty stuff) injected into the combustion chamber to ignite the engine.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-09T04:46:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003ENot sure what\u0027s going on with the fuselages, I haven\u0027t noticed that myself. (Don\u0027t like that new part much though.)\u003Cp\u003EPerhaps you could \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/1517-A-very-quick-guide-moving-parts-by-Persistent-file-editing\u0022 rel=\u0022external nofollow\u0022\u003Eedit the position of the fins and flaps manually\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003EIf the changes are consistent across all of them, you should be able to find an adjustment that works, then repeat it on all the planes. \u003C/p\u003E\u003Cp\u003EIt seems the old and new ones determine where and how they attach differently.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027ve done part position editing before, so I\u0027m not afraid of that. In fact, here I replaced the tiny SAS with the standard size one on the RASSTO:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JxBQofp.jpg\u0022 alt=\u0022JxBQofp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and here I\u0027ve moved the small control surface closer to the vertical stabilizer:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cTEueig.jpg\u0022 alt=\u0022cTEueig.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I\u0027m not sure what I can do about the shrunken fuselage tank. Comparing BirdDog 1 (which does not have the problem) with BirdDog 4 (which does), I see that whereas BirdDog 1 starts with the cockpit part, BirdDog 4 starts with the shrunken Mk1 Fuselage as its root part. I assume this came about because I initially built the BirdDog 1 as a plane and then stuck a rocket under it...but the later incarnations were made by adding/changing parts of a BirdDog that was already part of a launch vehicle. Because the BirdDog is attached to the rocket via a decoupler that attaches the rear tank to the supports on the main vehicle, it must have gotten made into the root part when the later BirdDogs separated from their rockets. Or something like that. \u003C/p\u003E\u003Cp\u003EIn any case, I don\u0027t know how to edit the parts in the sfs file to change the root part (since it\u0027s all a long, messy tree about what connects to what).\u003C/p\u003E\u003Cp\u003ENone of this explains why a ship that starts with a Mk1 Fuselage part as its root worked fine back in 0.23.5, but does the shrunken part thing in 0.25.\u003C/p\u003E\u003Cp\u003EAnd the big question is: Do I want to bother going through and changing all those parts? Or do I just finish up what I\u0027m doing in 0.23.5 and call it a day for the original Save game file?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T20:55:43Z\u0022 title=\u002210/09/2014 08:55  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-10-09T06:07:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut I\u0027m not sure what I can do about the shrunken fuselage tank. Comparing BirdDog 1 (which does not have the problem) with BirdDog 4 (which does), I see that whereas BirdDog 1 starts with the cockpit part, BirdDog 4 starts with the shrunken Mk1 Fuselage as its root part. \u003C/p\u003E\u003Cp\u003EIn any case, I don\u0027t know how to edit the parts in the sfs file to change the root part (since it\u0027s all a long, messy tree about what connects to what).\u003C/p\u003E\u003Cp\u003ENone of this explains why a ship that starts with a Mk1 Fuselage part as its root worked fine back in 0.23.5, but does the shrunken part thing in 0.25.\u003C/p\u003E\u003Cp\u003EAnd the big question is: Do I want to bother going through and changing all those parts? Or do I just finish up what I\u0027m doing in 0.23.5 and call it a day for the original Save game file?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s interesting, it reminds me of a similar bug that once affected the spherical tanks mod. On mobile, so can\u0027t add pics now, but there\u0027s something about it in my. Minmus base thread. It was fixed with an update to the model. \u003C/p\u003E\u003Cp\u003EI think manually changing the root would be nigh impossible due to all the things that would have to change.\u003C/p\u003E\u003Cp\u003EPerhaps you could join me in switching back to the older model- if you don\u0027t want to replace them.\u003C/p\u003E\u003Cp\u003EIf you do decide to wrap this up- your call, most things end eventually- better make sure they get a nice ending.\u003C/p\u003E\n"},{"CreatedByName":"billbobjebkirk","CreatedById":104713,"CreatedDateTime":"2014-10-09T12:02:37Z","Content":"\n\u003Cp\u003EIt looks like there might be a rescale factor issue with the fueselage.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-10-10T04:50:28Z","Content":"\n\u003Cp\u003ELooks like saves did indeed take a hard hit in .25. I\u0027m not sure if you should start a new save yet. What you have here is the oldest save possible in KSP, as .18 was the last save breaking update, so I guess it has been through a lot a wear and tear from all the little things that updates can do like .25...\u003C/p\u003E\u003Cp\u003EMy old career save from .22 probably has similar issues (I haven\u0027t really tried it yet). Thing is this really isn\u0027t the time that I wanted to restart. I was waiting until career got more things to do around Kerbin, like space stations and satellite contracts, and of course bases too.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerballianDummy","CreatedById":32428,"CreatedDateTime":"2014-10-10T14:02:44Z","Content":"\n\u003Cp\u003EBrotoro, a possible solution would be to recreate the affect ships in 0.25, then use Hyperedit to get them to Laythe. With some config file tweaks, they\u0027d all have the same crew, fuel and other resources that they do now. Think this might work?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T16:15:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerballianDummy\u0022 data-cite=\u0022KerballianDummy\u0022\u003E\u003Cdiv\u003EBrotoro, a possible solution would be to recreate the affect ships in 0.25, then use Hyperedit to get them to Laythe. With some config file tweaks, they\u0027d all have the same crew, fuel and other resources that they do now. Think this might work?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s an option. But my concern is that a BirdDog rebuilt with new wing parts might not have the cubic octagonal struts \u002B rear landing gear attach to them in the same positions as the old wings did (since the new wings are thicker and seem to obey different attachment rules). This could result in the BirdDog no longer having the correct height to fit the docking ports of the older GasStations deployed at various places around Laythe. (The BirdDogs that now have the newer, thicker wing replacing the older wing when converted to 0.25 are still at the same height because the original spacing numbers are still in the craft files despite having the newer parts dropped in.) So The new BirdDogs would require lots of docking testing. The tolerances on that docking method are pretty tight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T16:18:44Z\u0022 title=\u002210/10/2014 04:18  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-10-10T17:56:24Z","Content":"\n\u003Cp\u003EAlso, to fix the tiny SAS issue you just need to replace the name of the tiny SAs with the \u0022advanced\u0022 one right? So cant you use notepad\u0027s find and replace all function (or something similar) to fix all the SASs in one go?\u003C/p\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-10-10T18:11:22Z","Content":"\n\u003Cp\u003EWhy not copy the parts missing from .25 that are in .24.2 into .25\u003C/p\u003E\u003Cp\u003EThen change the names of the new modelled parts it\u0027s what I\u0027m gonna do. If you want I can do it for you?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T18:26:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EAlso, to fix the tiny SAS issue you just need to replace the name of the tiny SAs with the \u0022advanced\u0022 one right? So cant you use notepad\u0027s find and replace all function (or something similar) to fix all the SASs in one go?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, you are correct. I have changed all of the old SAS units (which got changed to tiny size) into the new medium size units (the old ASAS units).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T06:33:11Z\u0022 title=\u002210/11/2014 06:33  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T18:34:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Jebidiah\u0022 data-cite=\u0022Commander Jebidiah\u0022\u003E\u003Cdiv\u003EWhy not copy the parts missing from .25 that are in .24.2 into .25\u003Cp\u003EThen change the names of the new modelled parts it\u0027s what I\u0027m gonna do. If you want I can do it for you?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve seen where people are doing that, yes. But then you end up with a game that essentially has modded parts in it (even though the modded parts are old stock parts). I try to keep things as stock as possible with regard to parts, so I\u0027d rather replace the now-smaller reaction wheel units with the standard medium sized one (what was the old ASAS unit). But I may go with just installing the old parts.\u003C/p\u003E\u003Cp\u003EMy bigger concern right now is the shrunken rear fuselage tank on my BirdDogs.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T18:44:41Z","Content":"\n\u003Cp\u003EOK, I\u0027ve been doing some testing with the BirdDogs in 0.25 to try and figure out why I\u0027m getting the shrunken rear fuselage (see earlier messages).\u003C/p\u003E\u003Cp\u003EI launched a BirdDog3\u002Brocket into orbit, then separated the BirdDog from the rocket. Its tank looked fine. Hmmmm. So I spent some time comparing the ship data in the persistent.sfs files and couldn\u0027t see any important differences between that test BirdDog and the ones having problems on Laythe. They all were starting with the rear Mk1 Fuselage as the root of the plane (since that\u0027s the part that was attached to the rocket via radial decoupler). Weird.\u003C/p\u003E\u003Cp\u003EBut when I restarted the game and returned to that test BirdDog in orbit...its rear fuselage was now shrunken. Ah. So you won\u0027t see the problem until you restart the game.\u003C/p\u003E\u003Cp\u003ENext I did the same test in a clean install of KSP 0.25 (to see if any of my installed mods were causing the problem). I copied the craft file of the test BirdDog \u002B rocket into the fresh Save game, and then launched it into orbit. After separating the BirdDog, its fuselage looked fine. But after restarting the game and returning to the BirdDog, it had a shrunken rear fuselage. \u003C/p\u003E\u003Cp\u003EOK...So this is a bug in 0.25 and not some problem with my old Save file or any of the mods I have installed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T18:52:13Z\u0022 title=\u002210/10/2014 06:52  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T18:49:52Z","Content":"\n\u003Cp\u003EBefore restart of game (fuselage normal):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/haiUWW8.png\u0022 alt=\u0022haiUWW8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter restart of game (rear fuselage shrunken):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KaqFbk1.png\u0022 alt=\u0022KaqFbk1.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2014-10-10T18:52:38Z","Content":"\n\u003Cp\u003EHuh. That\u0027s... different.\u003C/p\u003E\u003Cp\u003EMaybe rebuild the BirdDog entirely with the new .25 parts and do some careful save-file-switcheroos? Or do .25-built BDs have this issue too?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T18:55:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Error\u0022 data-cite=\u0022The Error\u0022\u003E\u003Cdiv\u003EHuh. That\u0027s... different.\u003Cp\u003EMaybe rebuild the BirdDog entirely with the new .25 parts and do some careful save-file-switcheroos? Or do .25-built BDs have this issue too?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t built any BordDogs new in 0.25 (since, as mentioned earlier, it would be difficult to get it to be the exact same height -- which is necessary if it\u0027s going to dock to its GasStations).\u003C/p\u003E\u003Cp\u003EBut my next step is to see if I can build a simple craft in 0.25 that demonstrates this bug.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T20:05:13Z","Content":"\n\u003Cp\u003EOK... Here\u0027s the bug demonstrated in a clean install of 0.25 with a ship built in 0.25. My original BirdDog is attached to the main ship by a radial decoupler in such a way that the main part of the radial decoupler stays on the main ship...but it\u0027s not easy to build a ship this way (I originally built the ship in the SPH, then brought it over to the VAB as a subassembly and stuck it on the ship...and I may have fiddled with the SelectNode mod at some point to get that ship built) ...so I used a docking port to separate the parts of this new bug-test ship instead.\u003C/p\u003E\u003Cp\u003EThe ship on the pad:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OHn5RH0.jpg\u0022 alt=\u0022OHn5RH0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDecouple from the docking port. Rear Mk1 Fuselage is fine:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y5oahli.jpg\u0022 alt=\u0022y5oahli.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESwitch away from the ship to the KSC, then switch back to the ship...the rear Mk1 Fuselage has shrunk:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k8e1laP.jpg\u0022 alt=\u0022k8e1laP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother view with the shrunken Mk1 Fuselage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WCiMuac.jpg\u0022 alt=\u0022WCiMuac.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Ca href=\u0022http://www.mindspring.com/~sportrocketry/ksp/TestBug2.craft\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file of the bug-test ship is here.\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T20:08:40Z\u0022 title=\u002210/10/2014 08:08  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jaxal1","CreatedById":85315,"CreatedDateTime":"2014-10-10T20:26:08Z","Content":"\n\u003Cp\u003EThat\u0027s certainly a bug that Squad needs to fix, but are GasStations still a big deal now that you have the refueling Fido?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-10T20:28:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jaxal1\u0022 data-cite=\u0022Jaxal1\u0022\u003E\u003Cdiv\u003EThat\u0027s certainly a bug that Squad needs to fix, but are GasStations still a big deal now that you have the refueling Fido?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are GasStations on some of the other islands where the Fuel Fido is not available.\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2014-10-10T21:23:08Z","Content":"\n\u003Cp\u003EA thought; while they tend to be meh aerodynamically and iffy ln range, a VTOL (jet or rocket) might be handy on Laythe, as runways or flat land aren\u0027t a requirement for a vertical-landing craft.\u003C/p\u003E\u003Cp\u003EYou said in a previous LToL that you hadn\u0027t really built any before, so maybe a chance to give it a shot?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-11T00:23:12Z","Content":"\n\u003Cp\u003ESlumpie supplied me with a cfg file edit that fixes the shrunken Mk1 Fuselage. Thanks!!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/96339-0-25-StockScalingBugFix-Simple-config-fix-for-scaling-issues?p=1468199#post1468199\u0022 rel=\u0022external nofollow\u0022\u003EDetails here.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHopefully SQUAD will fix their cfg files so I don\u0027t have to remember to install this fix in the future.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-10-12T15:07:11Z","Content":"\n\u003Cp\u003EBrotoro, have you considered using TextureReplacer to save you of constantly having to photoshop the girls\u0027 hairs into the pictures and having to play the \u0027Make-believe\u0027 game regarding their hairs while you\u0027re playing? You\u0027d also be able to give the guys unique hairstyles as well, although this part is mostly optional.\u003C/p\u003E\n"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2014-10-12T16:57:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commissioner Tadpole\u0022 data-cite=\u0022Commissioner Tadpole\u0022\u003E\u003Cdiv\u003EBrotoro, have you considered using TextureReplacer to save you of constantly having to photoshop the girls\u0027 hairs into the pictures and having to play the \u0027Make-believe\u0027 game regarding their hairs while you\u0027re playing? You\u0027d also be able to give the guys unique hairstyles as well, although this part is mostly optional.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would require someone turning those hairstyles into textures.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-12T19:04:21Z","Content":"\n\u003Cp\u003EMy kerbals exhibit sexual dimorphism in that the females have a more gracile jaw. Also, the hair on my female kerbals is 3-dimensional, so it wouldn\u0027t look the same just painted on the standard kerbal cylinder head as a texture.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-10-12T20:37:04Z","Content":"\n\u003Cp\u003EAh, I see. Oh well, whatever floats your boat.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022macdjord\u0022 data-cite=\u0022macdjord\u0022\u003E\u003Cdiv\u003EThat would require someone turning those hairstyles into textures.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are alterady some textures that look similar, I myself use some of them.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-10-13T15:25:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003ESlumpie supplied me with a cfg file edit that fixes the shrunken Mk1 Fuselage. Thanks!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the tip, too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EAnyway, best of luck getting this show on the road again in 0.25. I really enjoy reading it.\u003C/p\u003E\n"}]}