{"TopicId":25464,"ForumId":51,"TopicTitle":"Long-term Laythe Mission (pic heavy) - ^_^ With Part 45 ^_^","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-04T20:31:45Z","PageNum":20,"Articles":[{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2014-01-16T15:18:11Z","Content":"\n\u003Cp\u003EAwesome new stuff Bro! \u003C/p\u003E\u003Cp\u003EAnd I am impressed that your current set of missions is maintaining continuity with previous missions through characters and situations. That\u0027s tough to do across multiple game upgrade versions! I often just start over completely every couple of game upgrades. Much respect and rep for you, sir!\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-16T16:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003EBrotoro, what are the cords for the peninsula on which your main laythe base is? I want to land my new Apollo style lander at it as the start of a science base in career mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMechJeb\u0027s surface info panel says that Laythe Base #1 is at:\u003C/p\u003E\u003Cp\u003E0Ã‚Â° 55\u0027 21\u0022 N\u003C/p\u003E\u003Cp\u003E167Ã‚Â° 00\u0027 54\u0022 W\u003C/p\u003E\u003Cp\u003EOr if you want that in decimal degrees:\u003C/p\u003E\u003Cp\u003E0.9225 N\u003C/p\u003E\u003Cp\u003E167.015 W\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-01-16T16:39:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EHmm. No. I knew that I could do that in the Tracking Station view (use Tab and Shift-Tab to move forward and backwards through the planets), but it never occurred to me to do it in Map view.\u003Cp\u003EThanks for the tip. I give unto you a pile of reputation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can press backspace to go back to your ship as well.\u003C/p\u003E\u003Cp\u003EI was a little late viewing this chapter and I think it\u0027s one of my favourites (the goo singing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2014-01-17T00:38:50Z","Content":"\n\u003Cp\u003ENew update! These make my day worthwhile.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-17T00:54:52Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ELong-term Laythe - Part 24.5\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ETweaking Tugs\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s a short episode on the upgrading of the Nuclear Tugs that are used by the Laythe expedition. As mentioned before, there are some things I\u0027d like to see incorporated into Kerbal Space Program because they would make the game more fun. One of those things is giving kerbals the ability to do some limited construction in space by being able to add struts to a ship, or cut loose parts of a ship. Yes, I understand that the KAS mod apparently allows this, but I try to run with a few mods as possible (for various reasons, such as ease of upgrading over version changes, fewer bugs, working from a more common and understood baseline of parts, etc.). But I still mention things I\u0027d like to see included in KSP just in case SQUAD is paying attention and might be persuaded to do so.\u003C/p\u003E\u003Cp\u003ESo here\u0027s a little imaginary mission of space construction showing what I\u0027d like to be able to do. Below, Jebediah Kerman lifts off on a Reusable Rocket in the capsule of the Tug Refurbisher payload.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/no6owSM.jpg\u0022 alt=\u0022no6owSM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Tug Refurbisher mainly consists of two Rockomax X200-32 fuel tanks (one of which will become part of the finished Tug) to refuel the Tug. I also figured that allowing the kerbals to attach struts should probably require that there be raw materials available. Lacking a Standard Strut Parts Pack part, I\u0027ve represented the raw materials by struts that I have attached to the Refurbisher -- several attached to small cubic octagonal struts on the top tank, and several attached to small cubic octagonal struts attached to the inside of the radiation shields (those 2x2 plates) at the back of the Refurbisher.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zqznfg5.jpg\u0022 alt=\u0022Zqznfg5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe mass of the Tug Refurbisher is such that the Reusable Rocket can get it into a 110 km orbit (where Nuclear Tug 8 awaits) and still have enough fuel in the sustainer (about 220 units of fuel) to allow the sustainer to return to KSC and land on its engine flame.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qTmsTaJ.jpg\u0022 alt=\u0022qTmsTaJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nuclear Tug 8 moves in to dock with the bottom end of the Refurbisher (both are equipped with standard docking ports there). I had the Nuclear Tug perform the rendezvous and docking because it is much lighter (no need to waste fuel moving all that heavy fuel around; the Tug\u0027s tanks are mostly empty after its return from Laythe).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iUCShMX.jpg\u0022 alt=\u0022iUCShMX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the Refurbisher was docked, I decoupled the rear tank and then turned the Tug around so that the remainder of the Refurbisher could dock to the forward end of the Tug (everything is upside-down by the third part of the image below). Again, two regular docking ports are docking at this point.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JEJaUrq.jpg\u0022 alt=\u0022JEJaUrq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext, Jebediah got out and EVA\u0027d over to connect struts between the main tank of the Tug and the new Senior docking port there. The 2x2 structural plates represent radiation shielding. Remember, those LV-N nuclear engines have previously been used to take this Tug to Jool and back to Kerbin, so they will be \u0027hot\u0027...and I wanted Jeb to be happy working near them. These shields were attached to the tank using cubic octagonal struts, and we\u0027ll have Jeb remove them at the end of the procedure. You can see Jeb getting a strut from the bunch mounted on the inside of the radiation shield.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NKV2DTR.jpg\u0022 alt=\u0022NKV2DTR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe see that Jeb has a new strut in place (isn\u0027t Photoshop wonderful?).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vm2t4kU.jpg\u0022 alt=\u0022vm2t4kU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Jeb finished all the struts between the two tanks (well, between the main tank and the new Senior docking port there). He then moveed up (I\u0027ve flipped the ship over to point the other direction now) and got to work on the forward structure. (What I\u0027ve done here is cheat a new version of the ship into place...since although I don\u0027t have the ability to install struts, I DO have HyperEdit to help me tell my story).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a4TBqdH.jpg\u0022 alt=\u0022a4TBqdH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext, Jeb installed the struts between the main tank and the new Senior docking port that became the new front port of the Tug. Struts for that operation were attached to the sides of the Refurbisher\u0027s main tank.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RTj5U4d.jpg\u0022 alt=\u0022RTj5U4d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile Jeb was working on those forward struts, I also imagined him using his cutting torch to chop through most of the cubic octagonal strut legs that were holding the stacks of probe cores in place (but not yet completely detaching them). You may recall that I added all these probe cores to my standard Tug design a couple versions back when pointing our ships using RCS was very wasteful of monopropellant. These 18 probe cores were added to provide torque to help point the Tug so the RCS fuel could be saved for doing translation-only maneuvers. The need for this technique was rendered unnecessary when SQUAD finally gave us non-capsule/probe parts that produced torque. There is an ASAS unit in the middle of all those probe cores that will nowadays provide this Tug with all the torque it needs. Sometimes I do get what I wish for.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7uVRAO8.jpg\u0022 alt=\u00227uVRAO8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce all the struts were in place, it was time to dump the garbage. So Jeb did a couple burns to raise the apoapsis of the Tug, and lower its periapsis a little way down into the atmosphere of Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qGyIWEV.jpg\u0022 alt=\u0022qGyIWEV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen Jeb hopped out and quickly cut loose the cubic octagonal struts that were holding the stacks of probe cores and the radiation shielding plates to the Tug. He was working against the clock here, because after a couple aerobraking passes, the ship would reenter Kerbin\u0027s atmosphere. But after the parts were quickly cut loose, Jeb returned to his capsule and went through the first aerobraking pass (which lowered the apoapsis back to 110 km), and then did a maneuver to circularize the orbit. All the discarded parts should, of course, eventually enter Kerbin\u0027s atmosphere and burn up (so I deleted them).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rF1Hu5V.jpg\u0022 alt=\u0022rF1Hu5V.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the refurbishment completed, Jeb transferred all but about 20 units of fuel from the remaining tank of the Refurbisher into the Tug\u0027s forward tank, and then separated the remainder of the Refurbisher. The Tug now has stronly-strutted Senior docking ports at both ends, and is almost fully fueled.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hOxa3Ah.jpg\u0022 alt=\u0022hOxa3Ah.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb then used the remaining fuel in the Refurbisher (assisted by RCS...there was plenty of RCS fuel left) to deorbit the Refurbisher and target it for a landing at KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A441P3A.jpg\u0022 alt=\u0022A441P3A.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TUSyLHB.jpg\u0022 alt=\u0022TUSyLHB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EOther Option\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe advantage of the procedure above is that it involves fun space construction, and has better continuity of storyline (I like the idea of having Tugs that have made the trip to Jool and back again multiple times). The disadvantage, or course, is that I don\u0027t have the tools in vanilla KSP to do this, and that the Tug is somewhat clunkier with a couple extra docking ports in its structure.\u003C/p\u003E\u003Cp\u003EThe alternative, of course, is to just deorbit the Tug and return it to KSC for refurbishment, and then claim that a new Tug I launch is that refurbished Tug. All of the used Laythe Tugs I have in Kerbin orbit (except for the oldest, Laythe Tug #3) include parachutes on their nuclear engine nacelles (in case of the need to recover the reactors during a launch failure). These parachutes are sufficient for recovering the whole Tug if one is careful. It starts with a deorbiting burn (below).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jKAbKON.jpg\u0022 alt=\u0022jKAbKON.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aLwde0A.jpg\u0022 alt=\u0022aLwde0A.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe potential problem is that the shock of the parachutes opening can be strong enough that a nuclear engine could snap loose from the ship and crash onto the surface of Kerbin. If the Tug had enough fuel, engine firings could be used to decrease the shock of the parachute deployments...but these Tugs don\u0027t have that much excess fuel. I originally worked up a procedure for deploying the chutes in opposing pairs so that the ship needed to survive the shock of only two chutes opening at once.\u003C/p\u003E\u003Cp\u003EBut now that we have tweakable parachutes, I have one opposing pair set to fully deploy at 600 meters, and the other two set to deploy fully at 500 meters. So, just wait until the Tug gets slowed to below 400 m/s after entry, then pop all four chutes. That way all four chutes get to help slow down the ship when they are reefed, and then first one set fully opens, and then the other set. This prevents any environmental embarrassment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FBMRWrE.jpg\u0022 alt=\u0022FBMRWrE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo for now, I\u0027ll land my obsolete Nuclear Tugs west of the KSC where they can be picked up and refurbished for re-launch. Not as much fun as construction in space, but maybe I\u0027ll get that some day in vanilla KSP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wNid4i8.jpg\u0022 alt=\u0022wNid4i8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8J3cnEx.jpg\u0022 alt=\u00228J3cnEx.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2014-01-17T01:06:14Z","Content":"\n\u003Cp\u003EWait. ERROR. ERROR. ERROR IN PART 24.\u003C/p\u003E\u003Cp\u003E\u0022I wonder if the KSC bigwigs will let us return to \u003Cstrong\u003ELaythe\u003C/strong\u003E once they are convinced the sun will behave itself.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-01-17T01:10:00Z","Content":"\n\u003Cp\u003EMaintenance day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Lots of work, but it\u0027s worth the hassle - Senior docking ports work much better on interplanetary ships.\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2014-01-17T01:15:19Z","Content":"\n\u003Cp\u003ENow that would be a really cool feature. Also, I know that you play with as little mods as possible, but the RealChute mod is really a great help. It really helped me when I was having trouble with my rovers snapping in half when trying to land on Duna, so you may want to give it a look (if you haven\u0027t already). Can\u0027t wait for the next entry though!\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-17T01:19:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SuperWeegee4000\u0022 data-cite=\u0022SuperWeegee4000\u0022\u003E\u003Cdiv\u003EWait. ERROR. ERROR. ERROR IN PART 24.\u003Cp\u003E\u0022I wonder if the KSC bigwigs will let us return to \u003Cstrong\u003ELaythe\u003C/strong\u003E once they are convinced the sun will behave itself.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFixed now. Thank you. Have some kerbal snacks.\u003C/p\u003E\n"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2014-01-17T05:16:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EFixed now. Thank you. Have some kerbal snacks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the \u0027snacks intended for kerbals\u0027 sense, or in the green mush sense~?\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-01-17T23:19:23Z","Content":"\n\u003Cp\u003EYellow! Go for the Yellow Mush!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-01-18T11:20:13Z","Content":"\n\u003Cp\u003EJust wondering, what technique are you using for the female kerbals\u0027 hair? It looks like some distorts around the mouth, but not sure about the hair.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m going to echo all the others and highly recommend KAS. You can change that attach list, and enable your kerbals to pull around any part you like.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThen it was a case of moving all the attached legs into the right spots.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/3wlLAZ1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3wlLAZ1l.png\u0022 alt=\u00223wlLAZ1l.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could\u0027ve refurbished the tugs by having a kerbal lug the large clampotron from a delivery ship, and attach it. Though you\u0027d want to be very careful as you place, as there isn\u0027t any auto alignment function like there is in the VAB.\u003C/p\u003E\n"},{"CreatedByName":"Somethingfake","CreatedById":82418,"CreatedDateTime":"2014-01-18T12:32:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EJust wondering, what technique are you using for the female kerbals\u0027 hair?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s Photoshop\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-01-18T12:59:10Z","Content":"\n\u003Cp\u003EIndeed. Gimp is another image manipulation program that is commonly used. In case it\u0027s unclear, I\u0027m asking for something a little more specific. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Also, welcome to the KSP forums!)\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-18T16:30:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EJust wondering, what technique are you using for the female kerbals\u0027 hair? It looks like some distorts around the mouth, but not sure about the hair.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn Photoshop, I use the Liquify filter to reshape the jawline to make it less square. Then in another layer, I paint on the hair with the paint brush tool...generally starting with a 3-pixel brush size and ending with a 1-pixel brush using various shades. For Hellou, I use a variety of shades, then either blur the strokes or smudge them together with the finger-smudge-thingie tool. Emilynn is easier with black hair, to which I add highlights using 1-pixel white strokes, smudged. I\u0027ll change the brightness of Hellou\u0027s hair (and to a lesser extent, Emi\u0027s hair) to match the 3D shading of the face by selecting areas of the hair layer with the lasso tool, feathering the edges of the selection various distances, and then adjusting brightness and contrast. Similarly for areas that may need to be lightened or get some color overlay where reflections on the helmet visor are located, or where brightness from helmet lights made need to be overlaid. I have no idea if these are good techniques or not, since my Photoshop skills are all self-taught from fiddling around in the program.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-01-18T19:06:40Z","Content":"\n\u003Cp\u003EMe, I just get fed up trying to draw with a mouse. Sooner or later I\u0027ll get myself a touchpad for drawing, but always wanted to wait till the ones with LCD screens imbedded became cheap enough. Even got an Android Tablet because I thought I could draw on that. HAH! Funny. Even got the precise Jot pen to improve matters... didn\u0027t work. I think unless you have those specialized tablets with sensors behind the screen and the special pens (IE the Galaxy Note series) accuracy with a pen sucks with current capacative screens.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-01-19T13:47:45Z","Content":"\n\u003Cp\u003ESounds like a pretty decent approach to me, and no obvious flaws are apparent in the results.\u003C/p\u003E\u003Cp\u003EThe only other way I can think of would be to save a bunch of pre-made hair layers, then adjusting them a bit each time, but the fiddling around probably would end up taking the same time anyway, and at the risk of worse results.\u003C/p\u003E\n"},{"CreatedByName":"tuckjohn","CreatedById":91927,"CreatedDateTime":"2014-01-20T01:17:17Z","Content":"\n\u003Cp\u003EBrotoro, do you have any plans for a \u0022series\u0022 where you do carrear mode? Or are you going to wait until it is mostly compleate?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-20T07:37:27Z","Content":"\n\u003Cp\u003EI am in no hurry to play career mode.\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2014-01-20T15:11:06Z","Content":"\n\u003Cp\u003EI\u0027m not sure if you can assign textures to specific Kerbals, but \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60961-0-23-TextureReplacer-0-18-1-%2819-Jan%29-No-helmets-on-Kerbin!\u0022 rel=\u0022external nofollow\u0022\u003ETexture Replacer\u003C/a\u003E might work for you, instead of fiddly stuff with Photoshop.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2014-01-20T20:30:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EBelow is the flight data I plotted from the Ladyhawk\u0027s ascent. I had MechJeb\u0027s surface and orbit data displays showing during the ascent, and I just plotted the data I captured in screen shots made along the way. I assume there must be a KSP Flight Data Recorder mod...maybe I\u0027ll look into that. \u0026lt;snip\u0026gt; ...I love graphs.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nr2iCux.png\u0022 alt=\u0022Nr2iCux.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure enough, there is a very nice flight data recorder mod. I suggest you check out Rich\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24594-0-23-Telemachus-%E2%80%93-Telemetry-and-Flight-Control-in-the-Web-Browser-%282014-1-11%29?p=302775\u0026amp;viewfull=1#post302775\u0022 rel=\u0022external nofollow\u0022\u003ETelemachus\u003C/a\u003E. It collects several types of data, automatically plotting and scaling them in an external browser window. It even integrates with MechJeb and KerbalMaps.\u003C/p\u003E\n"},{"CreatedByName":"acrain116","CreatedById":101088,"CreatedDateTime":"2014-01-20T20:34:32Z","Content":"\n\u003Cp\u003ETruly an exhilarating series. Makes me excited for my own in-depth interplanetary misisons \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheGamingNoobster","CreatedById":94887,"CreatedDateTime":"2014-01-21T03:48:00Z","Content":"\n\u003Cp\u003EWow. You have inspired me to do something very similar. I have landed 2 ships in the same location as your main base. If you try a VTOL try a 3 engine one as you can have a stable triangular base of thrust.\u003C/p\u003E\n"},{"CreatedByName":"tuckjohn","CreatedById":91927,"CreatedDateTime":"2014-01-22T01:47:09Z","Content":"\n\u003Cp\u003EBrotoro, have you ever given any thought to becomeing a \u0022youtuber\u0022? (Such as kurt j mac or even Scott Manley) I know that you aren\u0027t 100% percent \u0027playing\u0027 the game when you are rovering(you do other things), but you can easily do post-comentary. Your chanel would also have quite a few folowers because of your forum posts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cobalt60","CreatedById":101465,"CreatedDateTime":"2014-01-22T02:39:31Z","Content":"\n\u003Cp\u003E@tuckjohn\u003C/p\u003E\u003Cp\u003EWhen I saw your post, I realized something. Kurt Kerman\u0027s call name is Jaymack, and if you put Kurt with Jaymack, you get....\u003C/p\u003E\u003Cp\u003EKurtjaymack, or rather, kurtjmac!\u003C/p\u003E\u003Cp\u003EAm i the first to notice this?\u003C/p\u003E\u003Cp\u003EI\u0027m Cobalt60, and I approve this message.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}