{"TopicId":25464,"ForumId":51,"TopicTitle":"Long-term Laythe Mission (pic heavy) - ^_^ With Part 45 ^_^","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-04T20:31:45Z","PageNum":45,"Articles":[{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-02-26T18:22:23Z","Content":"\n\u003Cp\u003E\nIncorporate it into the story just to have some bug fix take it away later?\n\u003C/p\u003E\n\u003Cp\u003E\nBesides...the surface is all dark and dreary in the duseased areas.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-02-26T21:11:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222431009\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456510943\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIncorporate it into the story just to have some bug fix take it away later?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat\u0027s the difference between that and the laws of physics or engine stats changing, so that old ships no longer work and you have to design new ones?  A transient environmental effect is a lot easier to live with than ship that no longer works despite having made several trips there and back already.  Maybe you\u0027re just witnessing a stage in the life cycle of some Laythe microbes that only happens every few centuries.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBesides...the surface is all dark and dreary in the duseased areas.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nInstead of brown and dreary?  Laythe is a pretty drab place in normal times, just 2 colors, dull blue and dull tan.  Not even a palm tree, let alone bar selling Corona.  But now the land has a 2-tone effect.  I\u0027d call that an improvement \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kelidoskoped","CreatedById":157153,"CreatedDateTime":"2016-03-22T14:23:32Z","Content":"\n\u003Cp\u003E\nGet extraplanetary launch pads, put them on Laythe.\n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-24T07:36:36Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cstrong\u003ELong-term Laythe - Part 45 \u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003EOne Point One Woes\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI finally got a chance to try out KSP version 1.1 this week (I was not able to try out the pre-release versions because I\u0027m a KSP Store kind of guy). So...How did my old Save game fare in the new universe?\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I last looked at Laythe in version 1.0.5, I was seeing a weird discoloration of some areas of the surface (see below). I wouldn\u0027t mind a two-tone Laythe, but this discoloration made those surface areas vey dark and dreary. Some people were saying this was due to a bug in 1.0.5, but I was only seeing it when I had E.V.E. installed, and did not see it in the stock game. In any case, with KSP 1.1 and the newest version of E.V.E., I no longer see this effect.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HQUIWyi.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HQUIWyi.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI started off my survey of 1.1 by checking out my hardware on Duna and Laythe, beginning on Laythe with the Base area on Dansen Island.\n\u003C/p\u003E\n\u003Cp\u003E\nBelow we can see what happened to Laythe Base 2 when it loaded up and Physics kicked in. It kicked hard. The landing legs on the Base are supposed to lift it up off of the wheels (for a firm foundation once it has been rolled into position), but the legs apparently collapsed down far enough to allow the wheels to touch the ground...and the wheels and landing legs did a buggy dance to shake and shimmy the modules around. The parachutes popping out is a result of a bug from the 1.0 update, which seems to cause some packed parachutes on landed ships to be armed...and sufficient motion sets them off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022saclqWm.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://imgur.com/saclqWm.gif\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIn the aftermath of the 1.1 Bug Boogie, the Base appeared intact. I did not take the time to find out if the wheels could be fixed, because I\u0027m not sure if a future update might come along to fix this violent shimmy when loading a Save game (if so, I\u0027ll just reload a fresh copy and go from there). So for now, nothing is \u0022official\u0022...I\u0027m just testing. It\u0027s odd that only the parachutes from half of the Base were triggered...but those two halves are from different landings (which were then docked together), and the different history obviously affects how that bug bites.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AXsfL7D.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://imgur.com/AXsfL7D.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, in the image above you can see that the flag has fallen down. At first I thought that it got knocked over during the Base\u0027s epileptic fit, but it turns out that ALL of the flags in my old Save game fall over when I go visit them.\n\u003C/p\u003E\n\u003Cp\u003E\nChecking out the Laythe \u0022Air Force\u0022 revealed that the rover wheels on almost all of the BirdDog rover/planes are no longer functional because they are apparently too close to the air intakes. Why would I have put them so crazy close to the air intake in the first place? Well, I didn\u0027t...but the size of the Ram Air Intake grew a lot during a recent upgrade.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220IJSjHu.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0IJSjHu.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nYou can also see above that all my old planes are still equipped with the old version of the Mk1 cockpit. This was done by installing parts from the Kerbal Historical Institute mod (and doing a manual find \u0026amp; replace in the Save file before updating). This was necessary because the \u0022upgraded\u0022 version of the Mk1 cockpit changed the location of the entry hatch to the side where it is blocked by canards or other structures in all my old planes and rovers.\n\u003C/p\u003E\n\u003Cp\u003E\nHappily, the original BirdDog 1 that Aldner landed on Laythe is different in that its air intakes are mounted higher up (I changed this later so that the drag on the intakes would be along the centerline of thrust). This meant that BirdDog 1 could actually move, so that I could test out the roving ability under version 1.1...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227Igu0a1.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7Igu0a1.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAlas, just driving over to the GasStation drained the batteries dry. The output from the solar panels was nerfed in 1.0, so the BirdDog is not really effective as a rover anymore without very frequent breaks. But the worse news came when I tried to dock the plane to the GasStation...and found that it no longer fits. The landing legs in 1.1 allow the GasStation to sink lower into the ground, so the BirdDog no longer fits under the boom. And, no...messing with the leg settings did not help.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002293FhXSi.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/93FhXSi.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI did try a short flight, and the BirdDog can still fly under version 1.1 aerodynamics, but it does seem to require a lot more up-elevator, especially when landing. The landing gear were up to the task of supporting the plane for the take off and landing, however.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I switched over to the nearby area around Laythe Base 1, the vehicles settled to the surface, maybe bouncing a couple times, but without any disasters. But I was surprised to see that the Laythe SSTO rocket (which had landed most of the original crew) was now at the water\u0027s edge of Fido Bay inlet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aNuqvUt.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/aNuqvUt.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nMuch worse, it turned out that the newer RAPIER-powered SSTO rocket was now awash in the water of the inlet, tipping over (with that motion triggering the buggily-armed chutes).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y0GZDSO.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/y0GZDSO.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe RAPIER SSTO is now gently bobbing in the inlet, useless. I already knew that the original SSTO would be useless in 1.0\u002B because the jet engines that powered it are now far too weak to get the ship up to speed to reach orbit. But some testing I had done with the RAPIER version had showed that it was possibly still marginally workable...but not if it starts out floating sideways in the water.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vjwnaDI.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/vjwnaDI.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nWhen I switched to the ancient Fido Pup rover (the first probe that I had landed on Laythe), it looked fine at first...until I realized that it was now under water in the inlet. The Fido Pup used to float (see my previous mission logs), but I\u0027m not surprised that it no longer floats under the new Physics... but how did it get out into the water? What in the world happened? \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PQFXvSe.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/PQFXvSe.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI had read something in a 1.1 pre-release forum thread where somebody said that some of their old vehicles had shifted position from where they were in his old save, so at first I thought that might be it... But an overview of the Base area shows that the inlet has spread further south in 1.1... which is odd, since I hadn\u0027t heard that there was going to be any landscape tweaking in this version.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022o6zc7j8.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/o6zc7j8.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nBelow is a side-by-side comparison of the inlet (being overflown by Aldner after the previous tsunami...from a previous episode), and the current state of affairs in version 1.1.  The inlet has certainly flooded into the prime real estate of my Base 1 area. Note that the additional dark splotches in the right image are cloud shadows. Also note that the trademark dune features don\u0027t seem to be as visible in 1.1 from altitude as they used to be. I don\u0027t know what\u0027s causing this.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oIsyVg0.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oIsyVg0.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI made a quick check on the ShoreLab vehicle that was parked near the shore west of the Base area, and it is still on dry land (although I don\u0027t think I left it parked that close to the water...but I may not be remembering correctly).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wPPPRQM.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wPPPRQM.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nBut let\u0027s get back to the Base area. I wanted to try docking the FuelFido to the Mallard seaplane (not to be confused with the later KSP stock plane of the same name). All of the wheels of the FuelFido are unblocked...but they don\u0027t seem to turn properly to steer the vehicle anymore (below).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wW0tvBe.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wW0tvBe.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nDespite the screwed-up steering, I was able to shift the FuelFido back and forth, and I was able to dock the claw to the rear of the Mallard. Huzzah! Immediately after docking, the FuelFido had an epileptic fit that blew a few of its tires (you can see one in the image below), but it was otherwise intact. Later, after I un-docked the FuelFido, the steering directions of the wheels were working properly. Freaky.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FDfqjeF.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/FDfqjeF.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe situation with the newer Claw-based GasStation was not so rosy. Below you can see where a BirdDog was left after it had just refueled from that GasStation. The Claw on the side is supposed to be at wing level of the plane...but the landing legs are allowing the GasStation to sink lower into the surface, so the Claw will no longer align with the ships it was meant to service.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IO4Sfa0.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IO4Sfa0.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe way that Claw GasStation was designed to work (if you recall) was that its Claw was to be armed, and then the plane was to be maneuvered up against it to dock. Alas, it turned out that this was the kind of thing that could cause world-destroying problems...so I was hoping that this defect would be fixed in 1.1. Unfortunately it seems that Squad\u0027s idea of a \u0022fix\u0022 was to make all Claws on inactive vessels inactive...so this technique for docking will never work. What can work (I assume...I could not test it because this BirdDog\u0027s wheels are blocked by its air intakes) is the workaround that I previously used: Get the plane rolling toward the GasStation, then quickly switch to the GasStation to make it the active vehicle before they touch (which can be difficult in a Base area filled with many ships that you may need to switch through). Well, yes, that won\u0027t work HERE because the landing legs now let the GasStation sink too low (maybe that Claw on the other side is the correct height now?).\n\u003C/p\u003E\n\u003Cp\u003E\nSo here is the part where Brotoro once again begs Squad for some refueling hoses. Please. Pretty please. Give the kerbals hoses. It\u0027s only reasonable that they would have hose technology. And it would give kerbals a great thing to do on EVA. If you don\u0027t want to make a cool animation (but how cool would that be!), just give us a box labeled \u0022Refueling hoses\u0022 that I can right-click on to link my ship to any close-by ship to allow right-click transfer of fuel (assuming I have a kerbal present to do the EVA). Pretty pretty please?\n\u003C/p\u003E\n\u003Cp\u003E\nI did a quick test flight of the Mallard and tried a sea landing. I was not surprised that the clusters of air intakes (which used to be magically hydrophobic and made great flotation pontoons) no longer worked in 1.1, causing the Mallard to land hard and destroy its air intakes. The plane now floats as shown below.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223N2rbV0.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3N2rbV0.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIn 1.1 you can easily pan below the water level to see the rest of the plane. Undo. Undooooo.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rsvcXkI.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rsvcXkI.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI switched to one of my network of eight Laythe Ocean Probes...and I was quite surprised to see it was still floating...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FCx5Ir3.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/FCx5Ir3.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n...oops. Spoke too soon. I was not surprised to see it sink out of sight. I guess it was a wonder those things ever floated to begin with.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J8y1slv.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/J8y1slv.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe probe ended up on the bottom of the sea (after several minutes of sinking) at a depth of 1219 meters (the altimeter does not display a minus sign for depths). Alas...this leaves our intrepid explorers without their network of tsunami alert sensors.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YcBJVBp.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/YcBJVBp.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAh, but what about the DogFish, I hear you DogFish fans asking (you know who you are). The DogFish is still afloat, rather nose heavy. I did not test out its mobility.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CjQ2bdL.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CjQ2bdL.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nA quick check around Laythe showed that the other GasStations were in place (you can see the Manley Base station below), unfortunately with their landing legs allowing them to sink low enough into the surface that they are useless as BirdDog refueling points. You can also see that Aldner\u0027s special flag has fallen to the ground. I think of this as version 1.1\u0027s way of laughing at all my hard-earned accomplishments, which it has brought low with one mighty blow.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ynJyNRG.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ynJyNRG.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI saw a KSP 1.1 pre-release thread in which somebody reported that Laythe\u0027s ice caps were gone... so I went to the flag that Nelemy planted at Laythe\u0027s south pole (watching it fall over with 1.1\u0027s mocking laughter ringing in my ears), and the ice is still there. I zoomed out to get the picture of the edge of the ice cap shown below (which has been brightened up considerable, since it was quite dark there).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hqRHYvL.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/hqRHYvL.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nA quick look showed that Laythe Space Station was still there, with no shaking or fits going on...although I didn\u0027t try to see what would happen if I undocked various parts. All those nuclear tugs are old-style, which will now be poor performers because the nukes can now only use liquid fuel. They also don\u0027t meet the design requirements of ridiculously overheating NERV engines...so their burns will need to be made at lower thrust with cooldown phases. If I ever use them at all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zP5r1rs.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zP5r1rs.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAh, but perhaps I should despair not, since maybe an update will fix various issues with the legs and wheels and whatnot, you say? Perhaps you are right. So for now, I decided to do something else in KSP 1.1...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003EBringing Back BirdDog\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I decided to do was test out the rover wheels and airplane landing gear that many people have reported having problems with in version 1.1. And to do this, I asked myself the question, \u003Cem\u003E\u0022How would you design a BirdDog for the 1.1 universe?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe BirdDog is supposed to explore Laythe by being part airplane and part rover...so that it can fly to all the interesting islands, and then drive around on them to see the sights. The original BirdDog was a one-kerbal ship, but it soon became apparent that being able to carry around passengers, specifically a scientist and science gear, was an important feature...so the new BirdDog would have the capability to carry passengers.\n\u003C/p\u003E\n\u003Cp\u003E\nBelow, you can see my result:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i16jBor.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/i16jBor.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe new 1.1 BirdDog uses the Mk1 Inline Cockpit (with its wonderful view) and the Mk1 Crew cabin (which could be outfitted, I imagine, to carry two passengers or one passenger with more spacious living quarters and research equipment). The Mk1 Liquid Fuel Fuselage holds 400 units of fuel in half the volume that the original BirdDog tanks needed to hold 300 units. On the back is a Weasley jet engine (although I tested versions with the Panther and Whiplash). On the front is the inelegant-looking Advanced Grabbig Unit \u0022Claw\u0022, which I would gladly give up if Squad gives us refueling hoses (pretty please with sugar on top??). There is also a battery pack, RC-001S Remote Guidance Unit (so that the plane can be flown by remote control), and a Service Bay in the back. The single air intake was positioned on top with the thought that the BirdDog might be able to handle water landings (which would be a very useful capability on Laythe). The delta-wing-and-canard arrangement of the original BirdDog was retained.\n\u003C/p\u003E\n\u003Cp\u003E\nBelow, you can see the new BirdDog in roving mode. The nose gear only is retracted to lower the two rover wheels onto the ground. I went with the TR-2L Ruggedized Vehicular Wheels instead of the traditional wheels for better traction and because they have lighter weight and less drag (which surprised me). The wheels are mounted on Small Hardpoints (which have their separation function disabled) to reach the ground and not get blocked by the fuselage. The wheels are powered by a bank of six PB-NUK Radioisotope Thermoelectric Generators that are stuffed into the lower half of the Service Bay...no solar panels needed (since solar panels are now crap on Laythe, and covering the plane\u0027s surface with solar panels would be extremely draggy anyway nowadays). A high gain antenna for long range communication sits on top, and the upper half of the Service Bay has all the SCIENCE instruments that can fit, including a Goo and a Resources surface scanner.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227a9t69V.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7a9t69V.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe Whiplash version below shows off the retro pack that can be used to deorbit the BirdDog, located at the center of gravity. This will also bee the connection point for attaching the BirdDog to the side of its launch vehicle (they would be sent up in balanced pairs using the method I use for launching DunaDog planes in my \u0022Developing Duna\u0022 thread). I have tested the ability of the BirdDog to land from Kerbin orbit. Just keep the nose up 30 degrees during entry...the plane bleeds off speed quickly and has no overheating problems.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sTDwd36.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/sTDwd36.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe Whiplash-engine version above also shows off the access ladder location. A kerbal can climb up to the top of that ladder, then \u0022climb out\u0022 up onto the top of the plane and walk over to the cockpit canopy to get in. When exiting the cockpit, the kerbal can drop onto the canard, then walk aft and Grab the ladder to descend.\n\u003C/p\u003E\n\u003Cp\u003E\nThe technique for refueling the new BirdDog is shown below. GasStations will be simple barrels of fuel (dropped from orbit with retro engines and parachutes as needed) that the BirdDog will nuzzle up to a poke with its Claw. No more worries about finicky landing legs changing the heights of things. It\u0027s foolproof!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mH86jIC.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/mH86jIC.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, leave it to 1.1 to try to make a fool out of me anyway: When I did a test docking to make sure the method worked, the plane started jittering continuously after docking like an excited puppy on amphetamines. BUT...it can still get its gas. And we can all hope that the issues with the wheels and landing gear get sorted out soon.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B2a61kP.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/B2a61kP.gif\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nROVING TEST RESULTS: I tested the new BirdDog in rover mode in the hills west of KSC. It can\u0027t handle inclines of 10 degrees head-on with its wheels, but you can attack them at an angle to switchback up the hill. If you are impatient, a burst of jet engine power can push the BirdDog up a steep incline. What you can NOT do is run the rover using Physics Warp... the wheels and landing gear get extremely jittery and will cause the plane to flip out, spin out, or otherwise crash and often explosively disassemble. My only thought about people who claim that the wheel problems are \u0022not so bad\u0022 is that they haven\u0027t tried them using physics warp. And anybody who has done a lot of roving knows that you NEED to be able to drive at physics warp if you want to get things done in a reasonable amount of time. So there\u0027s your test case, Squad.\n\u003C/p\u003E\n\u003Cp\u003E\nFLYING TEST RESULTS: The plane lifts off quickly with a short run, and can land at slow speeds, just like the original BirdDog (and I was able to get in and out of a lot of tricky places all around Laythe with that ol\u0027 plane).\n\u003C/p\u003E\n\u003Cp\u003E\nTo test the range the plane could fly, I performed a set of identical flights (made as similar as possible by having MechJeb\u0027s autopilot keep the plane at the target altitude and heading), each test using 200 units of fuel. This was done at 4x physics warp...which the plane handles admirably in flight (except sometimes with the Whiplash). The plane was flown to the cruise altitude at full throttle, and then the throttle was set to the cruise setting for the remainder of the flight.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the Weasley using full throttle for cruise:\n\u003C/p\u003E\n\u003Cp\u003E\nAt 6,000 meters, the plane covered 499 km (speed was 274 m/s at the end)\u003Cbr\u003E\nAt 7,000 meters, the plane covered 530 km (speed was 263 m/s at the end)\u003Cbr\u003E\nAt 8,000 meters, the plane covered 569 km (speed was 255 m/s at the end)\u003Cbr\u003E\nAt 10,000 meters, the plane covered 670 km (speed was 232 m/s at the end)\u003Cbr\u003E\nAt 11,000 meters, the plane covered 695 km (speed was 207 m/s at the end)\u003Cbr\u003E\nAt 12,000 meters, things got difficult because the Weasley could not keep the plane going fast enough to keep it aloft in the thin air.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the Weasley using 2/3 throttle for cruise:\n\u003C/p\u003E\n\u003Cp\u003E\nAt 8,000 meters, the plane covered 653 km (speed was 192 m/s at the end)\u003Cbr\u003E\nAt 9,000 meters, the plane covered 671 km (speed was 178 m/s at the end)\u003Cbr\u003E\nAt 10,000 meters, the Weasley could not keep the plane going fast enough to stay aloft at 2/3 throttle.\n\u003C/p\u003E\n\u003Cp\u003E\nNotes: I list the \u0022speed at the end\u0022 because the cruise speed was slowly increasing during the cruise as the plane got lighter because of fuel burnoff. Cruise speed started a little slower than this speed. I would expect the range to be better for the remaining 200 units of fuel in the tank, so I expect a range of more than double the values shown above. Also, in Laythe\u0027s 0.8G gravity, I expect that the plane will do better at staying aloft at slower speeds in thin air. For reference, the circumference of Laythe is about 3,140 km, so the new BirdDog might be able get get almost halfway around Laythe without refueling.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the Panther using full throttle for cruise:\n\u003C/p\u003E\n\u003Cp\u003E\nAt 6,000 meters, the plane covered 457 km (speed was 240 m/s at the end)\u003Cbr\u003E\nAt 7,000 meters, the plane covered 493 km (speed was 230 m/s at the end)\u003Cbr\u003E\nAt 8,000 meters, the plane covered 530 km (speed was 222 m/s at the end)\u003Cbr\u003E\nAt 9,000 meters, the plane covered 566 km (speed was 210 m/s at the end)\u003Cbr\u003E\nAt 10,000 meters, things got difficult because the Weasley could not keep the plane going fast enough to keep it aloft in the thin air. These were my first tests, so I learned more about getting the plane up to cruise at the higher altitudes later, so I could probably get it to work at 10km...but the results were worse than the Weasley, anyway, so I didn\u0027t bother to go back and try.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the Panther using 2/3 throttle for cruise:\n\u003C/p\u003E\n\u003Cp\u003E\nAt 6,000 meters, the plane covered 532 km (speed was 177 m/s at the end)\u003Cbr\u003E\nAt 7,000 meters, the plane covered 559 km (speed was 168 m/s at the end)\n\u003C/p\u003E\n\u003Cp\u003E\nSO: The best results were from the Weasley, and for full-throttle cruise. The only advantage I see for the Panther is its afterburner mode, which might help you take off in a shorter distance.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the Whiplash...well, this was an entirely different beastie. Trying to climb to cruise altitude at full throttle was terribly fuel-wasteful. I got my best result climbing at 200-something m/s to about 10 km, then leveling off and blasting through the sound barrier at full throttle, and then rising to between 20 and 22 km to cruise. Still, at best I only got 429 km on 200 units of fuel (going 870 m/s at the end). I extended the test to use a full 400 units of fuel (since so much is wasted in the climb), but that still only got me to 1000 km (plus 55 km more during the glide down)...but that\u0027s still not as good as the Weasley could do with 400 units of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe one of you 1.1 spaceplane jockeys could tell me how to do this better... but the Turboramjet is not the magic it was in 0.90 (where it could easily boost my Mallard all the way around Laythe). And the Whiplash has a much more finicky flight profile (although it\u0027s faster, of course).\n\u003C/p\u003E\n\u003Cp\u003E\nI gather that the Weasley got a buff with version 1.1, so maybe these results shouldn\u0027t surprise me. But the Weasley was my final choice for the BirdDog engine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELiquid Landings\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSir Bedevere: \u0022But what else floats on water?\u0022\u003Cbr\u003E\nKing Arthur: \u0022A BirdDog!\u0022\u003Cbr\u003E\nSir Bedevere: \u0022Exactly!...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, I had to try landing the new BirdDog in the water (hey...that could easily happen on Laythe, you know). The result...it floats! And nothing breaks if you ease it in at under 65 m/s or so, which the Doggie does well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GH8UMN6.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/GH8UMN6.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nSadly, trying to take off again was a no-go. The plane could only make it up to about 26.5 m/s and would not lift off. The culprit: All of that drag from the rover wheels under the water.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221jy5XEj.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1jy5XEj.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nSo...let\u0027s try it WITHOUT the rover wheels. After all, we need a replacement for the Laythe Mallard and its pontoon goodness. Below: The new Mallard. Plus...dat new interior view option. So cool. I left the Claw on the front because with careful piloting, the not-rover-capable Mallard can be aimed at a refueling barrel, too. And the Claw has way better impact tolerance than a any aerodynamic nose cap that I could put on the front of the Mk1 inline cockpit...which might help it survive water landings.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UTNsv0z.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UTNsv0z.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nBelow, the new Mallard lands in the water offshore from the KSC with only a few splashes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qjWjtrB.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qjWjtrB.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, an early test shown below revealed a problem: The swimming kerbal could not get back onto the plane. He could Grab the ladder and climb up...but there was no \u0022climb out\u0022 option available while the BirdDog was floating in water (looks like a bug to me). Climbing up off the top of the ladder simply dropped him back into the drink, with no way to scramble on top. Grrr.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uRqrsRu.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/uRqrsRu.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe solution was to add a couple ladder rung segments on the side of the plane (see below). The kerbal could swim over, grab the rungs, the climb up and scramble out on top of the plane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fzwP0Ia.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fzwP0Ia.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dA7iPtd.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dA7iPtd.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nTo take off from the water, just give the Mallard full throttle while hold full-up elevator. At about 45 m/s you start getting all sorts of exhaust cloud spraying around effects. At less than 50 m/s, the Mallard lifts off into the air.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TcCLU0r.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/TcCLU0r.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SqtQzaR.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/SqtQzaR.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KYuOIft.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KYuOIft.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, I did discover a way to the the new BirdDog to take off from the water, even with its draggy wheels (see below). Start by skimming along horizontally at full throttle...this will get you to around 26 m/s. Then briefly give full DOWN elevator. The plane will submerge. Then give it full UP elevator, and the plane will porpoise out of the water and into the air. Fly, Big D! It\u0027s going pretty slow when it breaches, but it does make it into the air and up to flight speed. Of course, many might consider this cheating unless you can provide them with the snorkle intake design your engineers came up with to briefly close the intake during the plunge.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KAN9W5S.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KAN9W5S.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nLet me end by pointing out that you should look closely at how low the plane floats in the water in various pictures here. The exact same plane can end up floating at different depths in the water on different flights. What he heck? This is like all those pictures I took of my kerbals floating in the water at various places on Laythe...floating at different depths all the time. Why? Nobody ever explained this to me. Well, whatever causes this doesn\u0027t appear to have gone away with the new buoyancy physics.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P0pavfa.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/P0pavfa.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo... There are some initial experiments in 1.1. Maybe some of the bugs will be fixed in upcoming updates...but for now, the Laythe mission continues to lie dormant.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T08:28:41Z\u0022 title=\u002204/24/2016 08:28  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2016-04-24T08:25:24Z","Content":"\n\u003Cp\u003E\nYES! It\u0027s back!\n\u003C/p\u003E\n\u003Cp\u003E\nMy prayers have been heard! This is incredible.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it\u0027s also a bit sad to see how 1.1 wrecked all that stuff. I would say retreat to Laythe Station (if possible) and set up a new base somewhere flat. The poles are promising, but I also think there are a few sites at the equator. If not, I wish you luck.\n\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2016-04-24T09:01:37Z","Content":"\n\u003Cp\u003E\nUgh... No its not back, it\u0027s dormant.\n\u003C/p\u003E\n\u003Cp\u003E\nRegardless, I continue to bow in Brototo\u0027s general direction - still remaining an inspiration to all!\n\u003C/p\u003E\n\u003Cp\u003E\nWell done Sir!\n\u003C/p\u003E\n\u003Cp\u003E\nLet us hope the Devs take the necessary time and attention so as to take your findings onboard.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m considering a mission to Duna. Not sure if I will document it to the level of care you always do. But curious as to how 1.1 will treat me.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-04-24T12:33:04Z","Content":"\n\u003Cp\u003E\nArgh. Looks like Big Tsunami of 1.1. hit your Laythe assets really hard. Hopefully Duna Expedition will be less affected - less water there after all \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E BTW, how does your rig handle framerate around Laythe Station? I remeber it being quite laggy in previous versions.\n\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2016-04-24T15:32:08Z","Content":"\n\u003Cp\u003E\nI feel like the Laythe Base crew are having a (series of) moment(s) of \u0022What have I done, what have I done, what have I done to deserve this.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-24T17:32:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222535947\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461501184\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nArgh. Looks like Big Tsunami of 1.1. hit your Laythe assets really hard. Hopefully Duna Expedition will be less affected - less water there after all \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E BTW, how does your rig handle framerate around Laythe Station? I remeber it being quite laggy in previous versions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA lot of the hit is from problems with the wheels, landing gear, and landing legs... which will hopefully get sorted out soon (or, more accurately, I hope it gets sorted out WELL, even if that means it\u0027s not going to be Real Soon... The release of version 1.1 certainly felt very rushed at the end). I\u0027m not sure why the wheels are having problems colliding with other parts of the ship -- I thought that the general rule in KSP was that parts of a ship don\u0027t collide with each other (to avoid the ship damaging itself as parts shift and flex around), so why does this not apply to the wheels?\n\u003C/p\u003E\n\u003Cp\u003E\nEven when the wheels get sorted out, a lot of the Laythe vehicles are not going to be particularly viable in the new universe simply because they were not designed with the new Physics in mind (especially the changes in solar panel output that will severly limit the rovers\u0027 usage, and the changes to the aerodynamics that makes the planes harder to fly and more dangerous to land). But the expectation here is not that these ships will last forever or continue to work...the fun is in trying to see what can be done to carry on with what they have to work with (using whatever tips and tricks and workarounds are needed to keep the Save limping along). I\u0027m surprised at the amount of hardware that has survived the journey from version 0.18 to version 1.1.\n\u003C/p\u003E\n\u003Cp\u003E\nThe frame rate around Laythe Space Station seemed to be excellent, but I really didn\u0027t do much there except look at it. The frame rate around the Laythe Base area is MUCH better than it was the last time I was there messing with it. True, I have a newer computer now, so I can\u0027t compare that directly, but version 1.1 certainly delivers on its promise to run faster and smoother. Squad has done very well there. And finally being able to run the 64-bit version on my Mac is great! It was always frustrating to have the program crash every half hour because it was running out of RAM even though I had huge amounts of RAM available in my machine. I\u0027ve only had one case of the program freezing up on me in version 1.1...but I also haven\u0027t played as many multi-hour sessions as I typically did in the past. Being able to run at higher quality graphics settings is also wonderful (somebody likened the change in 1.1\u0027s graphics to switching from standard quality TV to HD quality video, and I feel like that as well). A lot of this maybe isn\u0027t impressive to many of you, since I\u0027m only finally getting to experience what you have had all along with your 64-bits and full-quality graphics...but I\u0027m pleased to finally get there.\n\u003C/p\u003E\n\u003Cp\u003E\nA lot of people seem to be complaining about the size of the nav ball, but I\u0027ve always made my nav ball larger in the past, so that new default happens to match my personal preferences.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T17:37:06Z\u0022 title=\u002204/24/2016 05:37  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-04-24T17:41:34Z","Content":"\n\u003Cp\u003E\nAppatently it\u0027s the price of the progress. Devs from the get-to warned us, that shift to new Unity version will likely break ships and saves. Some of my own tried and reliable designs didn\u0027t make the transition unscathed too. But still, it\u0027s good to hear that your venerable save survived and is doggedly plodding ahead.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-04-24T19:30:37Z","Content":"\n\u003Cp\u003E\nAs for Laythe and the surfaces of planets generally being a bit \u0022different\u0022 - I\u0027m guessing they had to re-render or re-generate the planets for this new version of Unity. While they obviously used the same seeds to libnoise (\u0026amp; etc), the output would be ever so slightly different, resulting in the slightly deformed terrain. I\u0027ve observed similar deformations at the same detail level.\n\u003C/p\u003E\n\u003Cp\u003E\nThe flags falling over thing is annoying, and I\u0027m going to see if I can fix my save(s) using vim, sed, or somesuch once I\u0027m ready to move forward. The flags are probably just missing a value, like the \u0022suddenly explosive\u0022 structural pylons were in 1.0.5.\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting that several of your probes and craft have sunk. I wonder if and of the junk I\u0027ve left floating around the solar system have done the same.....\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-04-24T20:29:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222535586\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461483396\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo... There are some initial experiments in 1.1. Maybe some of the bugs will be fixed in upcoming updates...but for now, the Laythe mission continues to lie dormant.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDisappointing.....\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing you didn\u0027t mention, which has serious implications for all your new Duna stuff, is that the EC consumption of all wheels has increased by about 5x in 1.1.  This basically means that rovers of any useful size now simply must have a large fuelcell array and associated tankage.  Solar (where available) is simply no longer an option except for tiny things using the baby wheels, and while you can spam RTGs if you want, you\u0027ll need 5 per wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother major problem with wheels is that they\u0027re now total poison to Kerbals.  The slightest contact with a wheel will make a Kerbal ragdoll instantly and if he happens to fall so as to still be touching the wheel, he\u0027s stuck that way indefinitely.  Also, sometimes the wheel also toss the Kerbal high enough in the air to kill him when he impacts.  Fun.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, yes, wheels are totally hosed in all the ways you describe.  Particularly annoying are the inability to minor slopes, let alone actual hills, and the way nearby parts can render wheels ineffective without any visual clue in the design/construction phase, and clearly part being in the way of where the wheel can move.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not going to get serious with 1.1.  Maybe not even 1.1.5.  There are a lot of fundamental problems, especially with wheels and legs, that make more than very simple flags-and-footprints missions impractical, and I want them fixed before I invest a lot of time and effort into a mission.\n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-24T22:01:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222536619\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461519694\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...Devs from the get-to warned us, that shift to new Unity version will likely break ships and saves...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey specifically said they were trying to NOT break old saves (being that we are beyond 1.0 and all), and I think they did OK on that for the most part (at least all the legs that I had extended were still extended so that all my landers and bases didn\u0027t end up falling to the ground as they had during a previous update). Lettings the flags get through un-fixed (or whatever happened that is making them fall over) is not good, but I would hope there is a simple fix for that. Of course, I don\u0027t expect that they have MY Save in mind when they are talking about maintaining compatibility (who knows what fuel feed or docking glitches or whatever have accumulated in my stuff through the various versions).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sad when the \u0022upgrade\u0022 parts to make them prettier without regard to how people have been using them, specifically the Mk1 cockpit. We have been accessing that thing through the canopy since forever... so why not allow the remade version to also allow access through the canopy? Sure, you can also add your pretty side door if you want, but don\u0027t take away the canopy access. You can even make the side hatch the primary exit (where the kerbal appears if you tell her to EVA from her picture), but you could still allow me to click on the canopy as an alternate exit to choose to remove the kerbal.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222536871\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461526237\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for Laythe and the surfaces of planets generally being a bit \u0022different\u0022 - I\u0027m guessing they had to re-render or re-generate the planets for this new version of Unity. While they obviously used the same seeds to libnoise (\u0026amp; etc), the output would be ever so slightly different, resulting in the slightly deformed terrain. I\u0027ve observed similar deformations at the same detail level.\n\u003C/p\u003E\n\u003Cp\u003E\nThe flags falling over thing is annoying, and I\u0027m going to see if I can fix my save(s) using vim, sed, or somesuch once I\u0027m ready to move forward. The flags are probably just missing a value, like the \u0022suddenly explosive\u0022 structural pylons were in 1.0.5.\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting that several of your probes and craft have sunk. I wonder if and of the junk I\u0027ve left floating around the solar system have done the same.....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you must be right about the terrain thing. The slope there is very shallow (that\u0027s why it makes such a nice flat landing area), so even a small change in water level could make a big change in how far the shore extends.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you do figure out how to fix it so that the flags will survive an update standing up, please let me know.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T22:07:17Z\u0022 title=\u002204/24/2016 10:07  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-24T22:22:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537011\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461529776\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...One thing you didn\u0027t mention, which has serious implications for all your new Duna stuff, is that the EC consumption of all wheels has increased by about 5x in 1.1.  This basically means that rovers of any useful size now simply must have a large fuelcell array and associated tankage...\n\u003C/p\u003E\n\u003Cp\u003E\nAnother major problem with wheels is that they\u0027re now total poison to Kerbals.  The slightest contact with a wheel will make a Kerbal ragdoll instantly and if he happens to fall so as to still be touching the wheel, he\u0027s stuck that way indefinitely...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did not realize that the energy consumption of the wheels was drastically increased. This will indeed make it hard to rover around in the ways we have become accustomed to. I suppose people will tell us that what we have been getting away with has been totally unrealistic, and the reality police have simply finally caught up with us...but, yes, that change will make things harder. Having to power rovers with fuel cells is not goofy, but it also increases the need for a convenient way to refuel surface vessels (like...maybe...refueling hoses??). Or if they hate the idea of refueling hoses, how about a tiny version of the Claw that isn\u0027t designed to be strong enough to push around Class E asteroids, but is just for easily docking surface ships to allow fuel transfer? Just poke another ship anywhere handy, and we can assume that your kerbal has run the hoses and wires needed to the proper connectors. The connector wouldn\u0027t need to handle megaNewtons of forces.\n\u003C/p\u003E\n\u003Cp\u003E\nI also did not realize that the wheels now paralyze kerbals. Maybe all that extra electricity is going to keeping the wheels charged up so that they can electrocute unwary kerbals. In regard to a kerbal getting stuck rag dolled in contact with a wheel...I have remote guidance on all my rovers...so I assume that the nice mission control people will drive the rover off of the afflicted kerbal eventually.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T22:24:15Z\u0022 title=\u002204/24/2016 10:24  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-04-24T23:20:32Z","Content":"\n\u003Cp\u003E\nWHOOOO!!! LONG TERM LAYTHE 1.1!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-04-24T23:37:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537226\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461535312\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n49 minutes ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you do figure out how to fix it so that the flags will survive an update standing up, please let me know.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA quick check of flags placed in 1.0.5 and 1.1.0 shows only a few small differences between the two. First being the inclusion of a new VESSELMODULES node at the end of the VESSEL. Loading the save in 1.1.0 adds this node, so not the issue. \n\u003C/p\u003E\n\u003Cp\u003E\nThen there\u0027s the elevation difference. I placed test flags in the recess to the West of the launchpad but North of the crawlerway. In 1.0.5 this spot was 63m above sea level. In 1.1.0 this area is 2 meters higher. Same terrain detail levels. Copying the elevation (and related parameters) from the flag placed in 1.1.0 to the flag planted in 1.0.5 did not fix the issue. The flag fell over as before when physics loaded.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only other obvious difference was the Mean Anomaly in the ORBIT node for the Flag\u0027s vessel. The flag placed in 1.1.0 has an MNA of Infinity, while the one imported from 1.0.5 has an MNA of -Infinity. Changing this also did not fix the issue. The flag still fell over when physics loaded. \n\u003C/p\u003E\n\u003Cp\u003E\nObvious differences exhausted, I ran diff on both VESSELs. The ONLY OTHER DIFFERENCE was the flag planted in 1.0.5 had its landing gear deployed (by the action group). Setting this action group entry to FALSE had the same effect as the above. The flag still fell over when physics loaded.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m at a complete loss to explain this one. Voodoo.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-04-24T23:37:23Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57674-brotoro/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57674-brotoro/\u0022 rel=\u0022\u0022\u003E@Brotoro\u003C/a\u003E I\u0027m sorry to hear that your save is broken (at least it\u0027s not corrupted or anything). I have a bit of a suggestion. If you went back to a 1.0.5 install, then change all of the legs\u0027 suspensions to \u0022locked.\u0022 Then, transfer the save back to 1.1 and your bases \u003Cem\u003Eshould\u003C/em\u003E stay at their current altitude. As for the bouncing/jittering, you could try messing with the wheel settings. As for the flags, I don\u0027t know what you can do.\n\u003C/p\u003E\n\u003Cp\u003E\nActually, thanks for reminding me: I need to check my Minmus/Mun bases in 1.1. I hope that the problems get fixed!\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, on an unrelated note, do you have any ISRU stations on Laythe? Or, maybe you could make a giant ISRU plane that can refuel itself and fly indefinitely.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-04-25T00:26:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537281\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461536559\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHaving to power rovers with fuel cells is not goofy, but it also increases the need for a convenient way to refuel surface vessels (like...maybe...refueling hoses??). Or if they hate the idea of refueling hoses, how about a tiny version of the Claw that isn\u0027t designed to be strong enough to push around Class E asteroids, but is just for easily docking surface ships to allow fuel transfer? Just poke another ship anywhere handy, and we can assume that your kerbal has run the hoses and wires needed to the proper connectors. The connector wouldn\u0027t need to handle megaNewtons of forces.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, you do have to refuel fuelcell rovers.  But OTOH, they get very good mpg.  So provided you don\u0027t forget and leave parked rovers idling for months, you should be able to go a very long way on 1 tank of gas.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the subject of the Claw, you can try 2 things to stop the jiggles while attached.  Wheels now have the ability to lock suspension same as has been the case with lander legs for some time.  That might help.  Also, did you free the pivot?\n\u003C/p\u003E\n\u003Cp\u003E\nThere are, of course, mods like KAS/KIS that do have fuel hoses, and TweakScale that can shrink the stock Claw down to a more rover-friendly size.  But you don\u0027t do mods so I\u0027ll refrain from mentioning them \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI also did not realize that the wheels now paralyze kerbals. Maybe all that extra electricity is going to keeping the wheels charged up so that they can electrocute unwary kerbals. In regard to a kerbal getting stuck rag dolled in contact with a wheel...I have remote guidance on all my rovers...so I assume that the nice mission control people will drive the rover off of the afflicted kerbal eventually.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo deal with this, you definitely need to position hatches and ladders so Kerbals stay well clear of wheels in normal operations.  But there\u0027s no avoiding getting close to them when fixing flats.  Used to be Kerbals could fix flats from a couple meters away but in 1.1 this got reduced to practically in contact.  I asked for this distance to be increased but I\u0027m not sure it was (haven\u0027t tried to fix a flat since 1.1 went public).\n\u003C/p\u003E\n\u003Cp\u003E\nProbe cores don\u0027t always solve the ragdoll-in-contact problem, either.  Rovers with flats tend to become immobilized these days unless they\u0027ve got more than 4 wheels.  And this presents a new problem.  If you have 2 wheels very close together, it could be that in the course of trying to fix 1 flat, the Kerbal gets ragdolled by 1 wheel and falls on the other next to it.  When this happens, the Kerbal is usually thrown violently away, thankfully horizontally, and no harm done.  But sometimes they get thrown upwards for 100m or more, and then usually pop when they come back down.\n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-25T00:57:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537435\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461541043\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57674-brotoro/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57674-brotoro/\u0022 rel=\u0022\u0022\u003E@Brotoro\u003C/a\u003E I\u0027m sorry to hear that your save is broken (at least it\u0027s not corrupted or anything). I have a bit of a suggestion. If you went back to a 1.0.5 install, then change all of the legs\u0027 suspensions to \u0022locked.\u0022 Then, transfer the save back to 1.1 and your bases \u003Cem\u003Eshould\u003C/em\u003E stay at their current altitude. As for the bouncing/jittering, you could try messing with the wheel settings. As for the flags, I don\u0027t know what you can do.\n\u003C/p\u003E\n\u003Cp\u003E\nActually, thanks for reminding me: I need to check my Minmus/Mun bases in 1.1. I hope that the problems get fixed!\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, on an unrelated note, do you have any ISRU stations on Laythe? Or, maybe you could make a giant ISRU plane that can refuel itself and fly indefinitely.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA good thought, but those landing legs WERE locked. They still sink in to a different level than before.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537518\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461544009\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...To deal with this, you definitely need to position hatches and ladders so Kerbals stay well clear of wheels in normal operations.  But there\u0027s no avoiding getting close to them when fixing flats.  Used to be Kerbals could fix flats from a couple meters away but in 1.1 this got reduced to practically in contact.  I asked for this distance to be increased but I\u0027m not sure it was (haven\u0027t tried to fix a flat since 1.1 went public)...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI fixed some flats on the new BirdDog just be getting out of the cockpit... so maybe your wish to have the distance increased was fulfilled. \n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2016-04-25T01:52:50Z","Content":"\n\u003Cp\u003E\nBro, you know I love you, and I know you want to stay rigorously stock, but every single time you lament the lack of fueling hoses, I want to shout \u0022so get KAS/KIS already!\u0022 (or imagine \u003Cem\u003Eyou\u003C/em\u003E shouting, \u0022so make KAS/KIS stock already!\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nThe solution \u003Cem\u003Eexists\u003C/em\u003E, it has for \u003Cem\u003Eyears\u003C/em\u003E now, you simply refuse to use it.\n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-25T02:10:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537657\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461549170\u0022 data-ipsquote-userid=\u00228333\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, Commander Zoom said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBro, you know I love you, and I know you want to stay rigorously stock, but every single time you lament the lack of fueling hoses, I want to shout \u0022so get KAS/KIS already!\u0022 (or imagine \u003Cem\u003Eyou\u003C/em\u003E shouting, \u0022so make KAS/KIS stock already!\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nThe solution \u003Cem\u003Eexists\u003C/em\u003E, it has for \u003Cem\u003Eyears\u003C/em\u003E now, you simply refuse to use it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, I know. But some things are so important that they NEED to be in the stock game. Squad should encourage people to do cool things on planets by giving them the necessary tools (as they did with resources). \n\u003C/p\u003E\n\u003Cp\u003E\nMy hope is that everybody will get so tired of me asking for stock refueling hoses that they\u0027ll start a giant petition to send to Squad: \u0022Please give the kerbals refueling hoses so Brotoro will shut up!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n...And my new profile picture is in honor of Commander Zoom!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Yilwz2t.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Yilwz2t.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-25T02:47:10Z\u0022 title=\u002204/25/2016 02:47  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 25, 2016\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-04-26T00:40:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222537699\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461550234\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Yilwz2t.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Yilwz2t.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMind if I start using that myself?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, after some experimentation, if you want rovers to climb hills, drop the :Traction Control sliders of their wheels to zero.  Then they climb like back in the day.  I have yet to discover a downside to this despite significant abuse of rovers.  The other variables you can control are a bit trickier.  There\u0027s a 1.1 Wheels thread or 3 in the general forum, assuming they haven\u0027t gotten locked yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2016-04-26T04:26:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222540043\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461631200\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMind if I start using that myself?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, after some experimentation, if you want rovers to climb hills, drop the :Traction Control sliders of their wheels to zero.  Then they climb like back in the day.  I have yet to discover a downside to this despite significant abuse of rovers.  The other variables you can control are a bit trickier.  There\u0027s a 1.1 Wheels thread or 3 in the general forum, assuming they haven\u0027t gotten locked yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou want to use my profile picture? Might be confusing.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s one with Geschosskopf flag color overlay:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226LWHqkZ.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6LWHqkZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou want to set Traction Control sliders to ZERO to climb hills? That seems goofy.\n\u003C/p\u003E\n\u003Cp\u003E\nI found that my rover was sliding down inclines, so I maxed out the Friction setting, and then the rover was able to stick on a slope.\n\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2016-04-26T06:04:17Z","Content":"\n\u003Cp\u003E\nI haven\u0027t used wheels (or anyhing else) much yet in 1.1, but I have a car with four-wheel drive in real life, and in very slippery situations like mud and snow it performs better without traction control. Could be similar to what you are experiencing, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E?\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-04-26T10:58:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222540374\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461644819\u0022 data-ipsquote-userid=\u002257674\u0022 data-ipsquote-username=\u0022Brotoro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou want to use my profile picture? Might be confusing.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s one with Geschosskopf flag color overlay:\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcellent!  Thanks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Brotoro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou want to set Traction Control sliders to ZERO to climb hills? That seems goofy.\n\u003C/p\u003E\n\u003Cp\u003E\nI found that my rover was sliding down inclines, so I maxed out the Friction setting, and then the rover was able to stick on a slope.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222540447\u0022 data-ipsquote-contentid=\u002225464\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461650657\u0022 data-ipsquote-userid=\u002262955\u0022 data-ipsquote-username=\u0022Deddly\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Deddly said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI haven\u0027t used wheels (or anyhing else) much yet in 1.1, but I have a car with four-wheel drive in real life, and in very slippery situations like mud and snow it performs better without traction control. Could be similar to what you are experiencing, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have a car with \u0022automatic traction control\u0022.  What this does is decrease the power going to the wheel when it detects wheel slip. I\u0027m thinking that KSP traction control is trying (and failing) to do the same sort of thing.  I don\u0027t think the wheels are spinning on the hill, but the traction ccontrol is reducing power to the wheels, as evidenced by the rover\u0027s inability to climb hills with it on.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}