{"TopicId":25567,"ForumId":32,"TopicTitle":"Kethane Help","CreatedByName":"VV2K","CreatedById":64231,"CreatedDateTime":"2013-05-05T15:07:13Z","PageNum":1,"Articles":[{"CreatedByName":"VV2K","CreatedById":64231,"CreatedDateTime":"2013-05-05T15:07:13Z","Content":"\n\u003Cp\u003EI seem to have a problem with the kethane mod.\u003C/p\u003E\u003Cp\u003EI have a lander with kethane fuel tanks and drills on top of a gas patch (0,-127 on the mun) and the drills aren\u0027t extracting any gas. I have tried attaching the drills directly to the tanks, lowering the drills so that they are ridiculously low to to the ground, I have even tried to extract on Minmus. But nothing has worked. I have the latest version of KSP and Kethane Pack 0.4.3. I would appreciate any help.\u003C/p\u003E\n"},{"CreatedByName":"Uncle Mort","CreatedById":57933,"CreatedDateTime":"2013-05-05T15:36:11Z","Content":"\n\u003Cp\u003EI know this sounds a bit condescending but did you activate the drills?\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-05T15:39:49Z","Content":"\n\u003Cp\u003EA few things to make sure of.\u003C/p\u003E\u003Cp\u003E1.) You must have at least one Kethane tank on your ship (anywhere is fine).\u003C/p\u003E\u003Cp\u003E2.) The drills must have enough power to operate. 8 power per second is a very demanding output level that will drain most batteries dry in seconds.\u003C/p\u003E\u003Cp\u003E3.) The drills also have to actually be over the Kethane patch. Make sure you\u0027re actually on it by checking the detector for your current location.\u003C/p\u003E\u003Cp\u003E4.) The Kethane deposit needs to still have Kethane. Kinda a no-brainer, and I\u0027m thinking not your problem here.\u003C/p\u003E\u003Cp\u003E5.) This isn\u0027t related to drilling, but important: make sure the converter is either directly attached to a fuel tank or has a fuel line leading INTO it from a fuel tank. If it isn\u0027t, you\u0027re going to have a bad time.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-05T16:34:23Z","Content":"\n\u003Cp\u003EDrills can stand everywhere, does not need to be connected to the kethane tanks, not sure how deep they have to go but if you put them near the bottom of tanks they should reach ground, you will see an drill effect. However you get this even if you don\u0027t have kethane, to check if you have kethane underground and did not overfly the deposit, go to another ship or tracking center and back, start up the detector and look at the map for deposit size. If you overfly it will show the size of the last deposit until you exit and enter.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-05T16:38:52Z","Content":"\n\u003Cp\u003EI would troubleshoot it by using the kethane debug tool lol. That way your sure to be on a deposit!!\u003C/p\u003E\n"},{"CreatedByName":"VV2K","CreatedById":64231,"CreatedDateTime":"2013-05-05T16:57:30Z","Content":"\n\u003Cp\u003EI\u0027m an idiot. As I was putting together a screenshot I noticed that my landing location was 0, 127 not 0, -127. A simple omission of a character caused hours of frustration. *facepalm*\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-05T18:07:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VV2K\u0022 data-cite=\u0022VV2K\u0022\u003E\u003Cdiv\u003EI\u0027m an idiot. As I was putting together a screenshot I noticed that my landing location was 0, 127 not 0, -127. A simple omission of a character caused hours of frustration. *facepalm*\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E And that right there is the number one justification for bringing a Kethane scanner along with your mining rig. It lets you double-check to make sure that you\u0027ve got the right site.\u003C/p\u003E\n"},{"CreatedByName":"bad2boneb1","CreatedById":64724,"CreatedDateTime":"2013-05-07T09:40:41Z","Content":"\n\u003Cp\u003EI\u0027m new to the Kethane mod, and having a similar issue. I have Kethane 0.4.3 and latest version of kerbal. My mining rig has tanks, drills and a detector, but i\u0027m still not getting any kethane, is the converter neccissary to be on the rig to extract the resource? My plan was to mine with my mobile rigs, transfer the kethane to a processing plant and convert it there... Please help\u003C/p\u003E\n"},{"CreatedByName":"bad2boneb1","CreatedById":64724,"CreatedDateTime":"2013-05-07T09:48:49Z","Content":"\n\u003Cp\u003EI\u0027m new to the Kethane mod and having a similar problem. My mining rig consists of a scanner, tanks and drills. I have confirmed i\u0027m over a deposit, activated the drills but i get nothing. Is it neccissary to have a converter on the rig as well, or is there maybe something else i\u0027m missing?\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-05-07T12:36:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bad2boneb1\u0022 data-cite=\u0022bad2boneb1\u0022\u003E\u003Cdiv\u003EI\u0027m new to the Kethane mod and having a similar problem. My mining rig consists of a scanner, tanks and drills. I have confirmed i\u0027m over a deposit, activated the drills but i get nothing. Is it neccissary to have a converter on the rig as well, or is there maybe something else i\u0027m missing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPost a good pic or two of your ship at different angles. we\u0027ll try to find errors, also includ in one of the pics the kethane map.\u003C/p\u003E\n"}]}