{"TopicId":25577,"ForumId":32,"TopicTitle":"Can anyone help me with mechjeb 1.9.8 plz?","CreatedByName":"Beanz","CreatedById":64251,"CreatedDateTime":"2013-05-05T16:43:13Z","PageNum":1,"Articles":[{"CreatedByName":"Beanz","CreatedById":64251,"CreatedDateTime":"2013-05-05T16:43:13Z","Content":"\n\u003Cp\u003EOK I love the game but im a gamer not a scientist lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E,ive had loads off probs aligning orbits etc we need a simple navigation system for peeps like me lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ESo anyway I found mecjeb and installed that but im still having problems.\u003C/p\u003E\u003Cp\u003ESo anyways I launch into orbit at between 100k and 150k depending on the ship,i then set mun as the target and use mechjeb to align my orbit with mun,next I use the map to make an intercept course for mun to within 2000m approx.,now this is where the frustration comes in,i have mun set as the target,im close to mun but no matter which function I use on the autolanding feature off mechjeb it always takes me back to kerbain or whatever its called.\u003C/p\u003E\u003Cp\u003EWhy is it doing that im close to mun,my target is set for mun but it wont land on mun,its driving me mad,the navigation side off this game is to hard for a general gamer like myself and its ruining the game for me,whenever I try to look for a solution on youtube etc all I hears physics babble etc.\u003C/p\u003E\u003Cp\u003ESo what am I doing wrong,and why is it I cant set orbits around other planets or mun and also how do I stop the auto pilots and landing assistance from going back to korb all the time?\u003C/p\u003E\u003Cp\u003EAny help would be appreciated as im really enjoying this game and just want to land somewhere lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"thes50","CreatedById":13495,"CreatedDateTime":"2013-05-05T17:32:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beanz\u0022 data-cite=\u0022Beanz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo what am I doing wrong\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot listening and trying to understand all that \u0022physics babble\u0022 as you put it is what you\u0027re doing wrong.\u003C/p\u003E\u003Cp\u003EAnyway; you mentioned getting a 2km intercept with the Mun. By the sounds of it the problem you\u0027re having is that you aren\u0027t actually putting yourself into an orbit around the Mun. You must have an orbit before you use the landing autopilot.\u003C/p\u003E\u003Cp\u003EWhat you need to do is when you\u0027re at your periapsis (lowest point) on the mun intercept you need to burn retrograde (opposite to the direction of travel, on the navball this is the yellow-circle with the cross through it). Watch the map-view, you\u0027ll notice that your orbit (the line your craft is on) will now be around the Mun. From here you can use the landing autopilot if you wish.\u003C/p\u003E\n"},{"CreatedByName":"Joe_Bender","CreatedById":60838,"CreatedDateTime":"2013-05-05T17:45:18Z","Content":"\n\u003Cp\u003EK, first off, lets do this with \u0027easy button\u0027 mechjeb the whole way.\u003C/p\u003E\u003Cp\u003E1. Launch into a circular orbit around Kerbal...I use an altitude that doesnt have anything flying on it. This is why I use 100km and 200km for my space stations.\u003C/p\u003E\u003Cp\u003E2. switch to map, and choose Mun as target, the planet and the orbit of it should turn bright green.\u003C/p\u003E\u003Cp\u003E3. switch back to ship, use the \u0027maneuver planner\u0027 module on mechjeb, click through until you get \u0027match plane with target\u0027. Turn off any SAS you may have on. Open SmartASS and make sure you click \u0027off\u0027 on it as well. Now click on \u0027autopilot\u0027 on the Maneuver module. SmartASS should click to \u0027auto\u0027 mode. Pick nose while Mechjeb fixes your inclination.\u003C/p\u003E\u003Cp\u003E4. Now choose \u0027Hohmann transfer to target\u0027. Hit the \u0027go\u0027 button for MJ to calculate the maneuver. Click \u0027execute\u0027 with \u0027time warp\u0027. Pick nose some more.\u003C/p\u003E\u003Cp\u003E5. After the burn, MJ will turn itself off and SmartASS will go back to normal. Time warp until you come into the SOI of Mun. Choose \u0027fine tune closet approach to target\u0027. Pick a altitude for the PE. I wont tell you cuz...well, you pick your nose. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E You shouldve been looking at what altitude to be aiming for instead of mining for gold. Hit \u0027execute next node\u0027.\u003C/p\u003E\u003Cp\u003E6. Now to land on the planet, you use \u0027landing guide\u0027. On the module, there is a button called \u0027pick target\u0027 or \u0027pick landing zone\u0027 or something like that. I cant recall atm, I dont have KSP up and running right now. You now left click somewhere on the planet and the yellow cross will change to a red cross. Start the autopilot and hope for the best.\u003C/p\u003E\u003Cp\u003ERemember Im not a rocket scientist but I do play EvE alot. lolz\u003C/p\u003E\n"},{"CreatedByName":"Beanz","CreatedById":64251,"CreatedDateTime":"2013-05-05T19:03:55Z","Content":"\n\u003Cp\u003Eno offense meant thes50,and cheers joe for the info \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E,BTW I beta tested eve when it first came out many moons ago \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"thes50","CreatedById":13495,"CreatedDateTime":"2013-05-05T22:43:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beanz\u0022 data-cite=\u0022Beanz\u0022\u003E\u003Cdiv\u003Eno offense meant thes50,and cheers joe for the info \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E,BTW I beta tested eve when it first came out many moons ago \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo offence taken, don\u0027t worry. You might find it very beneficial to try to learn the science behind it, you may be more interested and find it easier than you think. :-)\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-05-05T23:26:22Z","Content":"\n\u003Cp\u003EYou might want to try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12384-PLUGIN-PART-0-19-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-0-7\u0022 rel=\u0022external nofollow\u0022\u003EMechJeb 2\u003C/a\u003E. It\u0027s still in development but already much more capable than original recipe MechJeb. It integrates with the maneuver node system so you can see exactly what it\u0027s doing and learn from it.\u003C/p\u003E\n"}]}