{"TopicId":25733,"ForumId":44,"TopicTitle":"What causes the Oberth effect","CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-05-06T14:36:26Z","PageNum":1,"Articles":[{"CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-05-06T14:36:26Z","Content":"\n\u003Cp\u003EIf you perform a prograde burn at the periapsis of your orbit you get a Delta-v \u0022bonus\u0022 seemingly out of nowhere. That\u0027s called the Oberth effect. But does anyone know how it actually happens?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-05-06T16:30:57Z","Content":"\n\u003Cp\u003EYou don\u0027t get any extra delta-V. Delta-V is fixed by engine and fuel. You get extra energy, however. You get extra energy because the power output of a rocket engine is Thrust * Velocity. The faster you go, the higher your delta-E becomes.\u003C/p\u003E\n"},{"CreatedByName":"jebbe","CreatedById":16329,"CreatedDateTime":"2013-05-06T16:59:05Z","Content":"\n\u003Cp\u003EI like to think of it this way: The total energy of the system rocket\u002Bfuel\u002Bexhaust has to be conserved (basic physics, conservation of energy). Now if you dump your fuel somewhere near a planet, your exhaust gas has a very small potential energy, because it\u0027s deep inside the gravity well. Therefore, you must get a lot of kinetic energy for the rocket. On the other hand, burning far away from a planet leaves your exhaust gas with quite some potential energy, which you in return will not have available for your vessel.\u003C/p\u003E\u003Cp\u003EThis is also why we usually use delta-v to measure a rockets performance and not energy: delta-v is constant, but the kinetic energy you can get out of this delta-v depends on where you burn.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-06T21:41:52Z","Content":"\n\u003Cp\u003EK^2 is correct, though when I try to explain it to someone without a physics background, I simplify it to \u0022you gain velocity as you enter a gravity well. If you then speed up before you leave, gravity has less time to reduce your velocity, so you don\u0027t lose as much as you gained on the way in.\u0022 The actual math though, has to do with the non 1:1 relationship of delta-V and kinetic energy.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-05-06T23:58:17Z","Content":"\n\u003Cp\u003EThat sounds like a bunch of tom-foolery. Obviously Jeb is on the surface sending you positive booster vibes and the closer you are the faster you go.\u003C/p\u003E\n"},{"CreatedByName":"Banbite","CreatedById":5170,"CreatedDateTime":"2013-05-07T16:58:40Z","Content":"\n\u003Cp\u003EIt\u0027s a consequence of how kinetic energy and rockets work. Since kinetic energy is proportional to velocity^2 and rockets work by giving a set amount of delta-v regardless of your initial velocity it\u0027s kind of easy to see that the total increase in kinetic energy will be higher if your initial velocity is higher. A graph to demonstrate this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N514YTN.png\u0022 alt=\u0022N514YTN.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"iRommel","CreatedById":63519,"CreatedDateTime":"2013-05-07T19:10:43Z","Content":"\n\u003Cp\u003Ebut what is the velocity based on? the body the vessel is currently orbiting?\u003C/p\u003E\u003Cp\u003Ewhat about Oberthing while prograde around the earth AND prograde around the sun? (burning while periapsis is on the dark side of the earth) earth orbit speed plus sun orbit speed\u003C/p\u003E\u003Cp\u003Ewould that have less of an oberth effect than if you burned while prograde around the earth but retrograde around the sun? (burning while on the bright side of the earth) sun orbit speed minus earth orbit speed\u003C/p\u003E\n"},{"CreatedByName":"jason0735","CreatedById":54774,"CreatedDateTime":"2013-05-07T19:12:39Z","Content":"\n\u003Cp\u003EYes but you also have to take into consideration that as your mass decreases (Burning fuel) your kinetic energy wont have the maximum amount of increase in kinetic energy as the equation for Kinetic energy is .5*Mass*velocity(squared) meaning if you increase your velocity 5 m/s then you would lose an equal amount of fuel that decreases your mass.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-07T19:57:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iRommel\u0022 data-cite=\u0022iRommel\u0022\u003E\u003Cdiv\u003Ebut what is the velocity based on? the body the vessel is currently orbiting?\u003Cp\u003Ewhat about Oberthing while prograde around the earth AND prograde around the sun? (burning while periapsis is on the dark side of the earth) earth orbit speed plus sun orbit speed\u003C/p\u003E\u003Cp\u003Ewould that have less of an oberth effect than if you burned while prograde around the earth but retrograde around the sun? (burning while on the bright side of the earth) sun orbit speed minus earth orbit speed\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you only consider the gravitational forces from a single body at a time like KSP does, then Oberth effect in different positions around the orbit is the same. The potential energy of your solar orbit is almost the same on the day side versus the night side of a planet, so there\u0027s not much solar Oberth difference. But ejecting from a planetary orbit in the planet\u0027s prograde direction is the best way to transfer to planets further out, and ejecting in the planet\u0027s retrograde direction is the best way to transfer to planets closer in.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-05-07T20:06:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iRommel\u0022 data-cite=\u0022iRommel\u0022\u003E\u003Cdiv\u003Ebut what is the velocity based on? the body the vessel is currently orbiting?\u003Cp\u003Ewhat about Oberthing while prograde around the earth AND prograde around the sun? (burning while periapsis is on the dark side of the earth) earth orbit speed plus sun orbit speed\u003C/p\u003E\u003Cp\u003Ewould that have less of an oberth effect than if you burned while prograde around the earth but retrograde around the sun? (burning while on the bright side of the earth) sun orbit speed minus earth orbit speed\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOberth effect is described purely in terms of kinetic energy, and kinetic energy is a frame-dependent quantity. In other words, it all depends on what you are trying to do. For operations around Earth, all you care about is kinetic energy with respect to Earth\u0027s center of mass. In which case, it doesn\u0027t matter where you are in relation to the Sun. If, in contrast, your final destination is elsewhere in the Solar system, and you\u0027ll be fighting the Solar gravitational well, then it is motion relative to the Sun that\u0027s most relevant.\u003C/p\u003E\u003Cp\u003EFrame-dependence of energy is something you have to always be very careful with. If you pick accelerated frame of reference, you even lose the conservation of energy as a principle. It\u0027s a big part of why Oberth effect exists in the first place, and why you shouldn\u0027t be just taking it for granted. You shoudl work out the entire problem as a whole, and not just be trying to find the \u0022fastest\u0022 place to burn. Because fastest relative to what?\u003C/p\u003E\n"}]}