{"TopicId":25922,"ForumId":36,"TopicTitle":"[WIP] [Plugin] KerbCom Avionics - Analytical engine and RCS thrust balancing","CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-05-07T19:55:38Z","PageNum":5,"Articles":[{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-07-30T16:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022japa\u0022 data-cite=\u0022japa\u0022\u003E\u003Cdiv\u003ERight now it\u0027s a DLL that gets attached to most of the stock command pods. probably a better solution would be to make a dedicated part for it, but that\u0027s not there yet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really like adding dedicated parts for features that are purely computational - i.e. no additional physical effects. Hence I am quite happy with the recent integration of SAS into command pods.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022helldiver\u0022 data-cite=\u0022helldiver\u0022\u003E\u003Cdiv\u003EThis MOD is absolutely necessary for the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/40761-Kerbin-Mini-Shuttle\u0022 rel=\u0022external nofollow\u0022\u003EKerbin Orbiter\u003C/a\u003E I\u0027m working on.\u003Cp\u003EI\u0027d been wanting an FCS (Flight Control System) like the real shuttles have for a while. SAS, ASAS, Avionics haven\u0027t really worked too well. Your mod seems to be exactly what I needed.\u003C/p\u003E\u003Cp\u003EWould it be alright if I incorporated into the Avionics part of the Kerbin Shuttle?\u003C/p\u003E\u003Cp\u003EHow does your mod work? Is it loaded on a part? Or is it a DLL, or?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShuttles are actually one of the key reasons I am developing this mod, and may I say, your shuttle looks very Kerbal, which is a good thing.\u003C/p\u003E\u003Cp\u003EYou can integrate it quite easily. You just need to add\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = ModuleKCAvionics\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eto the config for the cockpit part (or a different part if you wish). Make sure to list KerbCom Avionics as a dependency. Also be aware that the (hopefully soon) next release will improve performance, reliability and functionality greatly, so bear that in mind while evaluating KCA. The current version also has some known issues if RCS or engines are on the same part as the one ModuleKCAvionics is installed on, so if that is the case in your shuttle you may want to wait.\u003C/p\u003E\u003Cp\u003EOf course you could use KCA as an optional dependency, using a Module Manager script.\u003C/p\u003E\u003Cp\u003EEdit: Also note that the current version does not support SRBs. This will change in the next version.\u003C/p\u003E\u003Cp\u003EEdit: Gimbaling/thrust vectoring is also coming in the next version.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T16:43:24Z\u0022 title=\u002207/30/2013 04:43  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by ZRM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-07-30T16:48:10Z","Content":"\n\u003Cp\u003E[This post is just to notify any readers subscribed by email about the several edits I made to the last post]\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-03T11:45:46Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EProgress Update:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe combined control mode is now working really well. It uses main engines, gimbals, reaction wheels and RCS ports to maintain the vessel\u0027s heading under thrust, and when the throttle is at zero it then uses purely RCS ports and reaction wheels to control translation and rotation exactly for docking. This should mean that you hardly ever need to change settings during a flight. I am now going to add a few utility features, like the ability to disable gimbal control if you so desire, and clean up the interface. Then it should be just bugfixing and SRB support to add before the release. The bugs I know of are related mainly to docking control logic (i.e. which avionics module gets control when undocking/docking) and engine state (sometimes engines fool themselves into thinking that they have run out of fuel).\u003C/p\u003E\n"},{"CreatedByName":"japa","CreatedById":9777,"CreatedDateTime":"2013-08-03T12:25:51Z","Content":"\n\u003Cp\u003EAwesome. Can\u0027t wait to try it out.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-03T15:40:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022japa\u0022 data-cite=\u0022japa\u0022\u003E\u003Cdiv\u003EAwesome. Can\u0027t wait to try it out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI also really can\u0027t wait to play with it properly, instead of coding and debugging it. I should really make some screenshots of what this is capable of. With some recent changes to the solver logic the control is much more stable than it ever was. The new SAS in 0.21 is a great complement to it as well. The new \u0022combined\u0022 mode can cope with pretty much every conventional design I can throw at it - single engine rocket, multi-engine rocket, mun lander, space station, VTOL, spaceplane, even a \u003Cstrong\u003Epiggy-backed shuttle\u003C/strong\u003E. All this at even better performance than the last release, with engine gimbal and reaction wheel support. The non-conventional designs I can think of that would need some tweaks to the logic would be VTOLs with dedicated VTOL engines and main thrust engines, and crazy massive stations/vessels that need to use combustion engines for RCS control. I am considering making the combined mode turned on by default.\u003C/p\u003E\u003Cp\u003EThe main downside right now is that it will be Windows only until I figure out how to get P/Invoke working robustly on Linux and Mac. The other downsides (which I am in the process of fixing), which are holding me back from release, are the lack of SRB support and the bugs I mentioned in my previous post.\u003C/p\u003E\n"},{"CreatedByName":"mizo","CreatedById":75837,"CreatedDateTime":"2013-08-04T00:23:04Z","Content":"\n\u003Cp\u003EIs it possible to just ignore the SRBs for now, and let it have the stock engine control?\u003C/p\u003E\u003Cp\u003EI think it would still be very usable if it only did that.\u003C/p\u003E\n"},{"CreatedByName":"aquilux","CreatedById":23859,"CreatedDateTime":"2013-08-04T00:27:03Z","Content":"\n\u003Cp\u003EI think what ZRM is trying to do is to have the code be aware of SRB thrust and to include that into the calculation without having the code try to throttle the unthrottleable. Though I wonder, how would the code react to an engine that can\u0027t throttle down past a certain point without shutting off like real engines do?\u003C/p\u003E\n"},{"CreatedByName":"mizo","CreatedById":75837,"CreatedDateTime":"2013-08-04T01:04:19Z","Content":"\n\u003Cp\u003EWell, what he probably needs to do is to include control for the SRB gimbals, but what I am saying is, the plugin would still probably be useful if it only ignored SRBs for now. Most designs only include them as boosters for the early part of the flight.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-04T10:03:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mizo\u0022 data-cite=\u0022mizo\u0022\u003E\u003Cdiv\u003EIs it possible to just ignore the SRBs for now, and let it have the stock engine control?\u003Cp\u003EI think it would still be very usable if it only did that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny space shuttle replica with SRBs would be not able to use my plugin. If I release the current development version (minus the work I have so far put towards SRB support), a space shuttle would likely crash and burn if my plugin was enabled at any point where the SRBs were active, as it would be trying to use them as regular throttleable engines. However I am considering releasing without SRB support, as I have realised it is not a small amount of work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aquilux\u0022 data-cite=\u0022aquilux\u0022\u003E\u003Cdiv\u003EI think what ZRM is trying to do is to have the code be aware of SRB thrust and to include that into the calculation without having the code try to throttle the unthrottleable. Though I wonder, how would the code react to an engine that can\u0027t throttle down past a certain point without shutting off like real engines do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re exactly right about the SRBs. Engines with cut-offs is a related feature that is not yet implemented (such engines are treated as regular engines right now), and it would require approximately as much work as with SRBs, though quite a few of the changes to be made to accommodate SRBs would be the same as with engines with cut-offs, so the work is shared. The main change is the reorganisation of the logic and additional solver calls to cope with the possibility of there being a minimum thrust that the vessel must be subjected to. Previously I relied on that being zero. One thing to note is that engines with cut-offs would be handled as engines that cannot go below a certain thrust at all, not even to zero (unless disabled or out of fuel). It is definitely possible to add support for zero thrust on engines with cut-offs, but that would require a considerable change to the solver interface to allow integer variables.\u003C/p\u003E\u003Cp\u003ESo, I think I may well release this after I have done a bit more testing and made the GUI a bit nicer. For example, there is not really a need anymore for \u0022Enable RCS control\u0022, \u0022Enable Engine control\u0022, \u0022Enable Reaction Wheel control\u0022 buttons or actions. These things should just activate when a mode requiring them is active. I should get time to do that today. I would also like to test the plugin on Mac and Linux at some point.\u003C/p\u003E\n"},{"CreatedByName":"japa","CreatedById":9777,"CreatedDateTime":"2013-08-04T15:50:50Z","Content":"\n\u003Cp\u003EPersonally, I never use SRBs, so I wouldn\u0027t miss them.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-04T18:31:44Z","Content":"\n\u003Cp\u003EJust a quick \u003Cstrong\u003EProgress Update:\u003C/strong\u003E I think I have now finally squashed the RCS FX glitch, once and for all. So the woraround is no longer required. You will want to revert any config changes you made to RCS parts for the new version.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-05T14:55:46Z","Content":"\n\u003Cp\u003ERight, everything \u003Cem\u003Eseems\u003C/em\u003E to be in working order, so now I will see if I can get this to work on my Mac as well. Then I will release version 0.3.\u003C/p\u003E\u003Cp\u003EBTW, from the download statistics apparently 93% of users downloaded the previous versions on Windows, 4% on Mac and 1.8% on Linux, with the rest presumably using unusual download methods.\u003C/p\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-08-06T01:43:08Z","Content":"\n\u003Cp\u003EOops, reposting this from the release thread. I think you wanted bug reports in this thread...\u003C/p\u003E\u003Cp\u003ESo is there a way to disable certain control methods? Say I wanted to disable differential thrust control and rcs and use only reaction wheels and gimbals... Is this possible? Because it would be super useful to have. In combined mode it seems to tinker with the thrust levels more than I would like. Also, I disabled reaction wheels on the pod but the craft was still able to turn on its own with engines and RCS off, depending on whether or not I had the combined control menu open. The behaviour seemed inconsistent so I\u0027m not sure exactly what was happening.\u003C/p\u003E\u003Cp\u003EE: I\u0027m a bit confused about the logic of the interface as well. Is kerbcom active whenever the menu is open, regardless of the submenues? Because I seem to have gimbal roll control even when none of the modes are active, and reaction wheels seem to be still running even when I disable them on the pod. Also, kerbcom seems to interfere with mechjeb\u0027s smart a.s.s. (mechjeb does not respond to pressing prograde or retrograde buttons for example), but inconsistently.\u003C/p\u003E\u003Cp\u003EE2: Even when I take mechjeb off my ship (I only have the mechjeb config installed, so kerbcom should disappear), I still have always-on reaction wheels and gimbal roll authority. I then made a whole new craft and never put mechjeb on it and I still get the same behaviour.\u003C/p\u003E\u003Cp\u003EE3: Restarted KSP, started a new save file, made a craft without mechjeb case. Still have always-on reaction wheels and gimbal roll. Plus I noticed the extra bonus of zero electricity usage whether pod torque is enabled or disabled.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-06T02:41:31Z\u0022 title=\u002208/06/2013 02:41  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 6, 2013\u003C/time\u003E by pina_coladas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-06T13:55:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pina_coladas\u0022 data-cite=\u0022pina_coladas\u0022\u003E\u003Cdiv\u003EOops, reposting this from the release thread. I think you wanted bug reports in this thread...\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have replied to your bug report in the release thread, as it seems others are reporting there regardless, so I might as well try to keep the discussion in one place.\u003C/p\u003E\u003Cp\u003ERegarding the differential thrust and RCS usage, if you lower the guidance torque strength enough the solver will be able to stop using differential torque and RCS to control your heading/attitude. This should then behave as you expect, as long as the craft is capable of relying purely on gimbals and reaction wheels. The solver always finds the most efficient solution, so with lower torque requirements it can rely purely on reaction wheels and gimbals to do so, and so save RCS fuel.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-06T15:23:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ENew bugfix release - see the release thread for details.\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"japa","CreatedById":9777,"CreatedDateTime":"2013-08-06T15:51:07Z","Content":"\n\u003Cp\u003ETested the latest one with Mechjeb, still very shaky using Smart ASS. Fiddling with attitude adjustment settings helped a little, but not much.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-06T15:53:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022japa\u0022 data-cite=\u0022japa\u0022\u003E\u003Cdiv\u003ETested the latest one with Mechjeb, still very shaky using Smart ASS. Fiddling with attitude adjustment settings helped a little, but not much.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor MechJeb you will want to decrease the torque strength settings in KCA for it to work well. Hopefully MechJeb\u0027s Smart ASS will get \u0022smarter\u0022 at some point so that you don\u0027t have to do this.\u003C/p\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-08-06T16:35:00Z","Content":"\n\u003Cp\u003EThanks for the reply. This plugin seems pretty vital to KSP so I\u0060m happy to do a bit of testing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZRM\u0022 data-cite=\u0022ZRM\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ERegarding the differential thrust and RCS usage, if you lower the guidance torque strength enough the solver will be able to stop using differential torque and RCS to control your heading/attitude. This should then behave as you expect, as long as the craft is capable of relying purely on gimbals and reaction wheels. The solver always finds the most efficient solution, so with lower torque requirements it can rely purely on reaction wheels and gimbals to do so, and so save RCS fuel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELast night when I was testing, combined mode loved to flutter the engine thrust pretty much whatever strength the slider was on, even when I edited some engines to have 10 degrees of gimbal. I had a rocket lander thing with four radial engines, and even without touching the controls the engines would be pulsing very rapidly (which seemed to cause a bit of lag). When throttled up fully and without touching the controls, two engines would be at full thrust and the other two would be jittering around at a few percent below full thrust. \u003C/p\u003E\u003Cp\u003EEven with improvements that lower the priority of differential thrust, I would still really appreciate being able to turn it off entirely on a craft-by-craft basis.\u003C/p\u003E\u003Cp\u003EAlso, I second the request for more detailed descriptions of the different modes. What exactly does simple engine mode do for example?\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-06T16:38:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pina_coladas\u0022 data-cite=\u0022pina_coladas\u0022\u003E\u003Cdiv\u003EThanks for the reply. This plugin seems pretty vital to KSP so I\u0060m happy to do a bit of testing.\u003Cp\u003ELast night when I was testing, combined mode loved to flutter the engine thrust pretty much whatever strength \u003Cstrong\u003Ethe slider\u003C/strong\u003E was on, even when I edited some engines to have 10 degrees of gimbal. I had a rocket lander thing with four radial engines, and even without touching the controls the engines would be pulsing very rapidly (which seemed to cause a bit of lag). When throttled up fully and without touching the controls, two engines would be at full thrust and the other two would be jittering around at a few percent below full thrust. \u003C/p\u003E\u003Cp\u003EEven with improvements that lower the priority of differential thrust, I would still really appreciate being able to turn it off entirely on a craft-by-craft basis.\u003C/p\u003E\u003Cp\u003EAlso, I second the request for more detailed descriptions of the different modes. What exactly does simple engine mode do for example?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are 3 sliders for torque strength - pitch, roll and yaw. Did you try lowering all of them? Was SAS turned on? All of my test cases tend to not jitter very much. Could you post a picture of the craft with the problem, along with the KCA settings you are using?\u003C/p\u003E\u003Cp\u003EEdit: Sorry for not replying to everything. Here\u0027s a fuller response:\u003C/p\u003E\u003Cp\u003EI could add the ability to disable differential thrust, however it may take quite a bit of time to implement. I will see how easy it would be to add.\u003C/p\u003E\u003Cp\u003ESimple engine mode? Do you mean stock engine mode? There is a description in the help mode for it. Here is the description from the in-game help:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EStock engine control:\u003Cp\u003EThis mode behaves identically to normal engine control, with each engine following the master throttle. The exception is that this mode also provides a strength multiplier. This is useful for avoiding overheating, for example.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-06T16:48:29Z\u0022 title=\u002208/06/2013 04:48  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 6, 2013\u003C/time\u003E by ZRM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Maeyanie","CreatedById":81897,"CreatedDateTime":"2013-10-08T09:35:17Z","Content":"\n\u003Cp\u003EBug report video for you, in a few hours when it finishes uploading:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/Qs49pu112Eg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/Qs49pu112Eg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis actually is showing several problems.\u003C/p\u003E\u003Cp\u003E- Despite being only at a tiny amount of throttle, KCA goes wild with engine pulsing, gimbles, and reaction wheels, and drains my battery in seconds.\u003C/p\u003E\u003Cp\u003E- When the battery runs flat, it doesn\u0027t seem to notice, and the ship starts to spin.\u003C/p\u003E\u003Cp\u003E- The ship spins in the direction where it\u0027s completely symmetrical and balanced. So KCA is actually creating an imbalance in that direction which would not exist otherwise.\u003C/p\u003E\u003Cp\u003EI recorded this with a test setup with only KCA, LLL, and MechJeb installed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T16:13:36Z\u0022 title=\u002210/08/2013 04:13  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by Maeyanie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spartan125","CreatedById":79494,"CreatedDateTime":"2013-10-31T09:55:53Z","Content":"\n\u003Cp\u003EFor some reason the GUI doesn\u0027t show up in the game even with mechjeb for me. I am using 0.22 but I used it in 0.21 as well and it had the same problem. Though I am probably being stupid as I usually do when trying to find things.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-10-31T12:07:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maeyanie\u0022 data-cite=\u0022Maeyanie\u0022\u003E\u003Cdiv\u003EBug report video for you, in a few hours when it finishes uploading:\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/Qs49pu112Eg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/Qs49pu112Eg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis actually is showing several problems.\u003C/p\u003E\u003Cp\u003E- Despite being only at a tiny amount of throttle, KCA goes wild with engine pulsing, gimbles, and reaction wheels, and drains my battery in seconds.\u003C/p\u003E\u003Cp\u003E- When the battery runs flat, it doesn\u0027t seem to notice, and the ship starts to spin.\u003C/p\u003E\u003Cp\u003E- The ship spins in the direction where it\u0027s completely symmetrical and balanced. So KCA is actually creating an imbalance in that direction which would not exist otherwise.\u003C/p\u003E\u003Cp\u003EI recorded this with a test setup with only KCA, LLL, and MechJeb installed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought I had dealt with that issue in a previous bugfix. You\u0027re definitely using the latest version? Regardless, I am not in a position to work on this project right now so bug fixing will have to wait for the time being.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartan125\u0022 data-cite=\u0022Spartan125\u0022\u003E\u003Cdiv\u003EFor some reason the GUI doesn\u0027t show up in the game even with mechjeb for me. I am using 0.22 but I used it in 0.21 as well and it had the same problem. Though I am probably being stupid as I usually do when trying to find things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you follow the installation instructions in the README to the letter? I haven\u0027t tested it in 0.22 yet (or even played 0.22 for that matter), but it should work in 0.21.\u003C/p\u003E\n"},{"CreatedByName":"Spartan125","CreatedById":79494,"CreatedDateTime":"2013-10-31T14:12:33Z","Content":"\n\u003Cp\u003EThank you! I always seem to overlook these things.\u003C/p\u003E\n"},{"CreatedByName":"Exposure","CreatedById":188,"CreatedDateTime":"2013-10-31T16:49:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZRM\u0022 data-cite=\u0022ZRM\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDid you follow the installation instructions in the README to the letter? I haven\u0027t tested it in 0.22 yet (or even played 0.22 for that matter), but it should work in 0.21.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust in case you want some reports of how KCA fares in 0.22, it seems to work just as fine as it did in 0.21. Although it apparently has some issues with the latest MechJeb\u0027s automatic docking function:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FellipeC\u0022 data-cite=\u0022FellipeC\u0022\u003E\u003Cdiv\u003EFor some reason when activate dock auto pilot here, the ship just aling with the docking port but don\u0027t fire the RCS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FellipeC\u0022 data-cite=\u0022FellipeC\u0022\u003E\u003Cdiv\u003EFound the problem: Kerbcom Avionics. Removed that and worked as before.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Maeyanie","CreatedById":81897,"CreatedDateTime":"2013-11-04T08:06:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZRM\u0022 data-cite=\u0022ZRM\u0022\u003E\u003Cdiv\u003EI thought I had dealt with that issue in a previous bugfix. You\u0027re definitely using the latest version? Regardless, I am not in a position to work on this project right now so bug fixing will have to wait for the time being.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFairly certain it\u0027s the latest. It was definitely no earlier than 0.3.0.5 as that seems to be the oldest version I have downloaded, but pretty sure it was 0.3.0.6.\u003C/p\u003E\u003Cp\u003EFrom your Bitbucket, it looks like the ReactionWheelController.cs was last changed for 0.3.0.1, so it\u0027s definitely newer than that. I don\u0027t see any reason the power check in there wouldn\u0027t work, though.\u003C/p\u003E\u003Cp\u003EIs there a minimum thrust for rockets? Possibly it\u0027s just when the battery is dead, it can\u0027t keep things balanced, so it starts to spin. I don\u0027t see anything in your code suggesting that, but I don\u0027t know KSP\u0027s code well enough.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-04T08:22:59Z\u0022 title=\u002211/04/2013 08:22  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 4, 2013\u003C/time\u003E by Maeyanie\u003C/strong\u003E\n\u003Cbr\u003EMore thoughts...\n\u003C/span\u003E\n"}]}