{"TopicId":25990,"ForumId":16,"TopicTitle":"From Space Plane to Rocket?","CreatedByName":"Frostbite","CreatedById":65199,"CreatedDateTime":"2013-05-08T04:43:12Z","PageNum":1,"Articles":[{"CreatedByName":"Frostbite","CreatedById":65199,"CreatedDateTime":"2013-05-08T04:43:12Z","Content":"\n\u003Cp\u003ESo I have completed my 4 days worth of work on a massive frigate, I had to use the space hanger in order to get the length of the ship. After about 30 or so tries using different staging methods and such I FINALLY got this beast into orbit, But as i started to play around with the controls and attempting to get a 300,000 orbit I noticed that A/D rolled and E Yawed left and Q yawed right, in this state it is impossible to hit nodes because the ship is almost constantly inverted and in awkward positions, its size just doesn\u0027t work well with its controls. I tried to cope but even the nav-ball doesn\u0027t work when I try to use yaw to turn left/right, i have to roll! I was wondering if there was any way to edit the file in order to switch its classification from space plane to rocket whilst its still in orbit. I am quite a nooby when it comes to file editing so i would need an in-depth explanation.\u003C/p\u003E\u003Cp\u003EP.S. - I have considered moving the file into the other hanger but then i realized that i would never get a launch like the one i got. So i need to edit its files while its in orbit.\u003C/p\u003E\u003Cp\u003EHere are some pictures of my prized possession (The reason i made this is because my brother and I are going to have turn based space battles. I.E. torpedo for torpedo or retreat or w/e)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/MHv5A#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/MHv5A#0\u003C/a\u003E \u0026lt;-- Just in case images dont work (Im really new)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/a/MHv5A#0\u0022 alt=\u0022MHv5A#0\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/a/MHv5A#1\u0022 alt=\u0022MHv5A#1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/a/MHv5A#2\u0022 alt=\u0022MHv5A#2\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-05-08T11:17:54Z","Content":"\n\u003Cp\u003EIf you\u0027ve got any control pods or docking ports pointing in the correct direction then you can right click them and choose \u0027control from here\u0027.\u003C/p\u003E\n"}]}