{"TopicId":26020,"ForumId":21,"TopicTitle":"1st successful SSTO Space Plane","CreatedByName":"Tobmaster","CreatedById":57953,"CreatedDateTime":"2013-05-08T13:58:40Z","PageNum":1,"Articles":[{"CreatedByName":"Tobmaster","CreatedById":57953,"CreatedDateTime":"2013-05-08T13:58:40Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003EI\u0027ve been dabbling in spaceplane design here and there while launching larger and larger rockets to other planets. Of course I\u0027ve had many troubles along the way. Most designs would get to 18,000m and either have pitch problems, spiral out of control, flameout or was just too darn heavy to get up to a good speed for orbital insertion. Well, after stepping away from playing ksp for a couple weeks, I sat down and, with a clear mind, realized the flaws in my designs and knocked out this spaceplane. I have to say that I really like this one. It could easily be made with stock parts, but I used 3 of the longer fuel tanks from the KW rocketry pack for cleanliness.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1117.photobucket.com/albums/k599/tobmasterp/KSP/Multiplay/screenshot213_zps31cc2ab5.png\u0022 alt=\u0022screenshot213_zps31cc2ab5.png\u0022\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESix Turbojets and seven intakes manhandle this plane to 1200m/s and 18,000m in about 4 minutes. The dead weight at the back is the trusty LV-N for long distance space travel. Unfortunately, since it is a LV-N it takes a long time to make the orbital insertion and will burn a good amount of fuel doing so. I realized that the extra altitude achieved by killing off pairs of the turbojets at a time to allow the others more air to breathe higher up was the key for transitioning from jets to rockets.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i1117.photobucket.com/albums/k599/tobmasterp/KSP/Multiplay/screenshot214_zps76832262.png\u0022 alt=\u0022screenshot214_zps76832262.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA couple lights and solar panels keep things operational and visible for the second part of my design: Mirror docking.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i1117.photobucket.com/albums/k599/tobmasterp/KSP/Multiplay/screenshot216_zpsefacad42.png\u0022 alt=\u0022screenshot216_zpsefacad42.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAt the bottom of the craft are two docking ports and luckily they extend from the bottom as much as the retracted landing gear does, making this possible.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i1117.photobucket.com/albums/k599/tobmasterp/KSP/Multiplay/screenshot217_zps606330df.png\u0022 alt=\u0022screenshot217_zps606330df.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFinally the twin docked spaceplanes fuel up for a mission to laythe to see how they perform there.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B6KZsZJJEGptQUlWZjNuWXNtdjg/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EDownload here to give it a try.\u003C/a\u003E\u003C/p\u003E\n"}]}