{"TopicId":26035,"ForumId":32,"TopicTitle":"Orbiter dV?","CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-08T15:48:06Z","PageNum":1,"Articles":[{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-08T15:48:06Z","Content":"\n\u003Cp\u003EWhat is a good amount of dV for a orbiter?\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-08T15:59:02Z","Content":"\n\u003Cp\u003EYou mean a Kerbin orbiter? Well ideally it would have just enough delta-v to deorbit once placed at its desired orbit. This reduces the load on the launch vehicle. The Space Shuttle Orbiter could only reach Low Earth Orbit, and had to use RCS to deorbit itself.\u003C/p\u003E\u003Cp\u003EIf you\u0027re interested in rendezvousing with another target in orbit, or want to be able to change orbits, you will want to include more delta-v than that. I don\u0027t think there\u0027s any set benchmark of delta-v for orbital maneuvers, but it all depends on the mission. A satellite delivery system requires more delta-v than an orbiter that simply docks with a station and then renters. \u003C/p\u003E\u003Cp\u003EThat last scenario also means that you are able to dock with the station and refuel (assuming the station is carrying fuel) to replenish your delta-v, requiring much less in total. But it is better to include more delta-v than less, so maybe try benchmarks of 1000m/s? 1500? It all depends on the mission.\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-08T16:03:10Z","Content":"\n\u003Cp\u003EI\u0027m assuming to use that Orbiter principally from 70 to 1000 km orbit and yes it have to do rendezvous and docking but it don\u0027t need to transport payload like probe or anything else. \u003C/p\u003E\u003Cp\u003EIt should serve as a Soyuz basically \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-05-08T16:12:50Z","Content":"\n\u003Cp\u003EMy shuttle thing that takes satellites to a kerbosynchronous transfer orbit has about 7000m/s.\u003C/p\u003E\u003Cp\u003E(The satellite circularises with its own fuel, and the orbiter uses its leftover delta V to aim for KSC or KSC2)\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-08T16:24:49Z","Content":"\n\u003Cp\u003EHow much dV do you have after the landing?\u003C/p\u003E\n"}]}