{"TopicId":26119,"ForumId":32,"TopicTitle":"Is asparagus the best staging system? (might contain science)","CreatedByName":"Pbhead","CreatedById":64465,"CreatedDateTime":"2013-05-09T04:45:35Z","PageNum":5,"Articles":[{"CreatedByName":"Pbhead","CreatedById":64465,"CreatedDateTime":"2014-01-17T19:32:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CleverClothe\u0022 data-cite=\u0022CleverClothe\u0022\u003E\u003Cdiv\u003EFirst, don\u0027t necro. It is bad form.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrankly, I kinda like occasionally reading what my past self had to say.\u003C/p\u003E\u003Cp\u003Ebut yall did break my photobucket account by ressing this thread.\u003C/p\u003E\u003Cp\u003E\u0026lt;3 \u0026lt;3 \u0026lt;3\u003C/p\u003E\u003Cp\u003ERecently, I have been putting liquid fuel tanks ontop of solid rocket boosters, which are fuel lined to the mainsails. This way, I use the boosters to get up to speed, while my main fuel tanks are still full when the boosters stage.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-01-17T19:32:29Z","Content":"\n\u003Cp\u003ETalking about asparagus in real life and why NASA doesn\u0027t use it, has anyone given any thought to the physics needed to pump fuel the the very bottom of one tank, to the top of the other, all while continually accelerating? I\u0027m not sure the physics of gravity would allow the liquid to be pumped in that fashion. It\u0027s like trying to lean forward in a car as it is accelerating. Now do it vertically. Just a thought. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"SDEngineer","CreatedById":101148,"CreatedDateTime":"2014-01-17T19:55:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003ETalking about asparagus in real life and why NASA doesn\u0027t use it, has anyone given any thought to the physics needed to pump fuel the the very bottom of one tank, to the top of the other, all while continually accelerating? I\u0027m not sure the physics of gravity would allow the liquid to be pumped in that fashion. It\u0027s like trying to lean forward in a car as it is accelerating. Now do it vertically. Just a thought. Any ideas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll it takes is a sufficiently powerful pump to do it. It\u0027s really no different than pumping a liquid up a steep hill. I\u0027d think that for most of the ascent, probably enough to avoid needing much of a pump, gravity would actually help more than hurt you, since the mass of the fuel itself will provide a LOT of the necessary \u0022push\u0022 to overcome gravity (remember, while the rocket might be accelerating at, say 2.5g, and needs to push the liquid up that 2.5g gradient to the top of the next fuel tank, at the very same time, that 2.5g is pushing DOWN on the entire mass of fuel remaining in the \u0022donor\u0022 fuel tank, thus providing an enormous amount of hydraulic pressure.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-01-17T19:59:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003ETalking about asparagus in real life and why NASA doesn\u0027t use it, has anyone given any thought to the physics needed to pump fuel the the very bottom of one tank, to the top of the other, all while continually accelerating? I\u0027m not sure the physics of gravity would allow the liquid to be pumped in that fashion. It\u0027s like trying to lean forward in a car as it is accelerating. Now do it vertically. Just a thought. Any ideas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn real life you\u0027re not constrained by KSP\u0027s \u0022furthest tank first\u0022 logic, so you\u0027d probably have all of the tanks draining from their bottom ends into the one engine, and you\u0027d switch between them as you jettisoned empty tanks\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-01-17T20:10:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wilt57\u0022 data-cite=\u0022wilt57\u0022\u003E\u003Cdiv\u003EUnless I have misidentified the engines, Plur303 was using Mainsails. For each Mainsail he/she had two X200-32s and the payload wasn\u0027t very much. This is way too small of a ship for asparagusing Mainsails, they can lift way more than that. I saw that MechJeb was using auto-throttle, and 6 Mainsails provide plenty of thrust through most (actually all) of the ascent, let alone a seventh fed through cross-feeding. There was really no benefit to cross-feeding the center engine unless that extra thrust was actually needed. The two-stage saved what? Eight units of fuel, I think? Yes, the \u0022onion\u0022 staged should have out performed it, but it is really close all told because it should be for this particular situation. Get a situation where that 7th engine is needed to maintain enough TWR over the entire life (or the vast majority) of that first stage, and you\u0027ll see the cross-feeding advantages more clearly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, in the given case where all 7 engines are identical and there is more than enough thrust from 6 of them, then the onion staged version can\u0027t possibly out perform the serial stage. best case scenario would be break even.\u003C/p\u003E\u003Cp\u003EOnion staging would only be an advantage if the boosters didn\u0027t have enough thrust to maintain terminal velocity on their own, or if the core stage had a more efficient engine than the boosters.\u003C/p\u003E\n"},{"CreatedByName":"wilt57","CreatedById":64653,"CreatedDateTime":"2014-01-17T20:32:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003EActually, in the given case where all 7 engines are identical and there is more than enough thrust from 6 of them, then the onion staged version can\u0027t possibly out perform the serial stage. best case scenario would be break even.\u003Cp\u003EOnion staging would only be an advantage if the boosters didn\u0027t have enough thrust to maintain terminal velocity on their own, or if the core stage had a more efficient engine than the boosters.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I essentially said that, didn\u0027t I? In theory, the cross-feed could accelerate \u003Cem\u003Eto\u003C/em\u003E terminal velocity faster, at the cost of increased fuel usage during that brief increase in acceleration, which happens to take place at a lower altitude where the engines have less Isp. After reaching terminal velocity, if six engines can do it the seventh isn\u0027t helping. Whether or not it is worth it? That particular test proved it wasn\u0027t.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003ETalking about asparagus in real life and why NASA doesn\u0027t use it, has anyone given any thought to the physics needed to pump fuel the the very bottom of one tank, to the top of the other, all while continually accelerating? I\u0027m not sure the physics of gravity would allow the liquid to be pumped in that fashion. It\u0027s like trying to lean forward in a car as it is accelerating. Now do it vertically. Just a thought. Any ideas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless I\u0027m mistaken, fuel doesn\u0027t \u0022fall\u0022 out the bottom of the tank into the engine, it is still pumped from the tank to the engine. In the case of cross feed, we KSP players attach from tank to tank. In possible real-world applications, I think they\u0027d still pump from tank to engine, it\u0027s just that they\u0027re pumping from one tank to an engine in a different stack. So there should be no reason to pump that fuel \u0022up\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-01-17T21:14:35Z","Content":"\n\u003Cp\u003EIf you all want the not-so-quick and simple explanation as why asparagus staging doesn\u0027t show up in the real world, it is a mixture of reasons. One of the main reasons would be its hard enough to pump that fuel from a tank directly above an engine, much less move that much from a bunch of side tanks. You have to remember fuel crossfeeding is a capability that does not exist on any currently or formerly used rocket and will not until at least later this year when the Falcon Heavy is supposed to launch. Another big issue that would appear is that it would really increase drag to absurd proportions in some of the more extreme examples of asparagus staging. Also, I should point out that in real life, we aren\u0027t constrained by tanks with set sizes as we are in KSP. This means that adding a number of smaller tanks just uses extra material as opposed to just throwing all the fuels into one large tank. With the smaller tanks you have to cap the ends of the tanks and separate the fuels and whatnot, making it easier and more weight and cost effective to use the one tank design. Then we find the issue for some rockets, specifically those with cryogenic fuels, that would be much harder to cool before launch than a single or stacked tank vehicle. Also, I\u0027m not entirely convinced that the margins used in real life would really need the relatively small boost to delta-v that asparagus staging gives you. Lastly, doing this increases the complexity significantly and the more complicated your vehicle is, the easier it is for something to go wrong.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-17T21:56:49Z\u0022 title=\u002201/17/2014 09:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 17, 2014\u003C/time\u003E by Rokker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-01-17T21:34:39Z","Content":"\n\u003Cp\u003E@Rokker:\u003C/p\u003E\u003Cp\u003EThe Space Shuttle used crossfeeding from the external tank.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-01-17T22:01:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E@Rokker:\u003Cp\u003EThe Space Shuttle used crossfeeding from the external tank.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. Crossfeed implies an ability for fuel to flow freely. The Space Shuttle\u0027s orbiter-ET system could only flow one way. That being said, I guess the Kerbal fuel ducts are similar to the umbilicals for the orbiter-ET system on the Space Shuttle. Without the instantaneous fuel transfer of course.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-17T22:06:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rokker\u0022 data-cite=\u0022Rokker\u0022\u003E\u003Cdiv\u003EThat being said, I guess the Kerbal fuel ducts are similar to the umbilicals for the orbiter-ET system on the Space Shuttle. Without the instantaneous fuel transfer of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP fuel lines do not transfer any fuel.\u003C/p\u003E\u003Cp\u003EFuel is teleported to engines by a logistic unit present in each engine which searches the ship for fuel whenever any is needed and uses fuel lines as clues.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-01-17T22:11:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EKSP fuel lines do not transfer any fuel.\u003Cp\u003EFuel is teleported to engines by a logistic unit present in each engine which searches the ship for fuel whenever any is needed and uses fuel lines as clues.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E-.- you disgust me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-17T22:34:29Z\u0022 title=\u002201/17/2014 10:34  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 17, 2014\u003C/time\u003E by Rokker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CleverClothe","CreatedById":60997,"CreatedDateTime":"2014-01-17T22:42:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rokker\u0022 data-cite=\u0022Rokker\u0022\u003E\u003Cdiv\u003ENope. Crossfeed implies an ability for fuel to flow freely. The Space Shuttle\u0027s orbiter-ET system could only flow one way. That being said, I guess the Kerbal fuel ducts are similar to the umbilicals for the orbiter-ET system on the Space Shuttle. Without the instantaneous fuel transfer of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot flow freely.\u003C/p\u003E\u003Cp\u003ECross-feed is probably a bad term because it isn\u0027t the exact same concept as in aviation. But for rockets, the Space Shuttle, KSP fuel lines and the proposed Falcon Heavy are all the same concept.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-01-17T23:54:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CleverClothe\u0022 data-cite=\u0022CleverClothe\u0022\u003E\u003Cdiv\u003ENot flow freely.\u003Cp\u003ECross-feed is probably a bad term because it isn\u0027t the exact same concept as in aviation. But for rockets, the Space Shuttle, KSP fuel lines and the proposed Falcon Heavy are all the same concept.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo... feeding would be a more proper term than cross feeding. I believe that was the term more often used when referencing the orbiter-ET configuration. Hell, come to think of it, the KSP, SpaceX and general aviation terms \u0022crossfeeding\u0022 are all different actually. Aviation means being able to move fuel around between tanks in an aircraft, SpaceX is... I think its allowing fuel to flow from the sides to the center in a \u0022sort-of\u0022 asparagus style(?) and KSP\u0027s use just means that fuel can flow through that part to an engine if I\u0027m not mistaken.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-18T02:32:53Z","Content":"\n\u003Cp\u003EUsing KW Rocketry, 2.5m tanks and Griffon engines, this will lift about 300t to orbit in one go.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=5790ae4c964cae4687c396f609b5ab0a\u0026amp;download\u0022 alt=\u0022public.php?service=files\u0026amp;t=5790ae4c964cae4687c396f609b5ab0a\u0026amp;download\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kzauner","CreatedById":83769,"CreatedDateTime":"2014-01-18T15:03:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003ETalking about asparagus in real life and why NASA doesn\u0027t use it, has anyone given any thought to the physics needed to pump fuel the the very bottom of one tank, to the top of the other, all while continually accelerating? I\u0027m not sure the physics of gravity would allow the liquid to be pumped in that fashion. It\u0027s like trying to lean forward in a car as it is accelerating. Now do it vertically. Just a thought. Any ideas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Pump sits on the engine; The fuel-line(s) have \u0027only\u0027 to have valves, so that the fuel is sucked from the fuel-line part as long as its there, sparing the Tank. Image of such a pump: \u003Cimg src=\u0022http://ia600200.us.archive.org/23/items/NIX-94-434-8/94-434-8.jpg\u0022 alt=\u002294-434-8.jpg\u0022\u003E.\u003C/p\u003E\u003Cp\u003EThe Valves are smaller: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.nasaspaceflight.com/wp-content/uploads/2011/06/A415.jpg\u0022 alt=\u0022A415.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFrom an engeneering standpoint it isn\u0027t impossible, to include such a device (valve) into a Tank.\u003C/p\u003E\u003Cp\u003EWhy it isn\u0027t currently done in real world (IMO): First, the dry-mass to wet-mass ratio is better in RL, so drop-tanks weren\u0027t worth the Effort (until now). Second: Aerodynamics and structural reasons. Third: Rocket design. IRL all parts are designed to meet the rockets requirements. As SpaceX tries to use \u0027stock\u0027 parts its no wonder that they come (maybe) up with such an alternative staging method (as well as they are using engine-clusters) - even though its for sure more work to build it, than just a few clicks like in KSP. Given their business concept and design principles it seems that it will be cheaper for them to go asparagus for heavier lifters than going the usual way (designing new engines and this stuff). As they are profit-oriented, I\u0027m pretty sure they are not doing it only FOR SCIENCE.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-01-18T17:54:53Z","Content":"\n\u003Cp\u003ESo the problem isn\u0027t quite like in KSP where the fuel has to go into another tank first. I would assume there would be a valve switching between the two tanks and when the outer tank is dry, the valve switches to the inner tank? That makes much more sense than trying to pump fuel out of one tank and into the other just to pump it back into the engine. Lol.\u003C/p\u003E\n"},{"CreatedByName":"kzauner","CreatedById":83769,"CreatedDateTime":"2014-01-18T23:48:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003ESo the problem isn\u0027t quite like in KSP where the fuel has to go into another tank first. I would assume there would be a valve switching between the two tanks and when the outer tank is dry, the valve switches to the inner tank? That makes much more sense than trying to pump fuel out of one tank and into the other just to pump it back into the engine. Lol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI personally imagine all the tanks in KSP having the valves installed (which makes sense, if you consider you can disable fuel consumption per tank) and having fuel lines running through them. And by constructing there is a preset valve-opening sequence, from top (read: farthest) to bottom). It would be pretty neat if final version gives one the option to tweak the consumption order, as i sometimes run into balancing issues (as COM shifts). I know, that the game doesn\u0027t handle it this way - it\u0027s just the way I look on what we got as a model, as it helps me when designing the craft as I need a rational explanation for what I observe.\u003C/p\u003E\u003Cp\u003ESo when i\u0027m adding fuel lines, I treat them mentally as tank-external fuelducts, which give me some control about the order in which tanks are consumed. To come back to the subject: I rarely do asparagus-staging, as such designs often produce aerodynamic madness (I\u0027m playing without FAR, but I try to build Rockets which would fly given a more accurate stock aerodynamic model). The first asparagus I build was btw. for the BSC-Kerbal-X challenge. Later I tried some more - and now I can do simple designs that way which don\u0027t handle awkwardly during ascend.\u003C/p\u003E\n"},{"CreatedByName":"CleverClothe","CreatedById":60997,"CreatedDateTime":"2014-01-19T05:17:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rokker\u0022 data-cite=\u0022Rokker\u0022\u003E\u003Cdiv\u003EAviation means being able to move fuel around between tanks in an aircraft, SpaceX is... I think its allowing fuel to flow from the sides to the center in a \u0022sort-of\u0022 asparagus style(?) and KSP\u0027s use just means that fuel can flow through that part to an engine if I\u0027m not mistaken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn aviation it means that engines can pull from tanks on both sides of a plane. Not between tanks.\u003C/p\u003E\u003Cp\u003ESpaceX is planning true asparagus.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-19T15:04:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EUsing KW Rocketry, 2.5m tanks and Griffon engines, this will lift about 300t to orbit in one go.\u003Cp\u003E\u003Ca href=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=5790ae4c964cae4687c396f609b5ab0a\u0026amp;download\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=5790ae4c964cae4687c396f609b5ab0a\u0026amp;download\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince it uses 4-symmetry it\u0027s onion staging though, isn\u0027t it. What does it perform like using (asparagus) 2-symmetry?\u003C/p\u003E\n"},{"CreatedByName":"rockbloodystar","CreatedById":59828,"CreatedDateTime":"2014-01-19T17:48:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003E... Temstars excellent analysis...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m trying to work out if this can be applied to planning the payload.\u003C/p\u003E\u003Cp\u003EThis analysis seems to work out the most efficient way to deliver 4.5km/s delta-v needed to get to LKO. Yet i can see nowhere that the 4550m/s, or the 9.8m/ss is used.\u003C/p\u003E\u003Cp\u003EI assume therefore that the 15% figure encapsulates the unique scenario of getting from launchpad to LKO.\u003C/p\u003E\u003Cp\u003EI also assume that there would be a similar set of calculations for take off from munar surface or eve\u0027s surface.\u003C/p\u003E\u003Cp\u003EI also assume that there would be a similar set of calculations for delivering the 15km/s delta-v needed for a Joolian tour from LKO.\u003C/p\u003E\u003Cp\u003ECan anyone assist here?\u003C/p\u003E\u003Cp\u003EThanks in advance RBS.\u003C/p\u003E\n"},{"CreatedByName":"DaRocketCat","CreatedById":32377,"CreatedDateTime":"2014-01-19T17:58:12Z","Content":"\n\u003Cp\u003EThis thread was 4 and a half months old when it got revived...\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-20T16:39:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rockbloodystar\u0022 data-cite=\u0022rockbloodystar\u0022\u003E\u003Cdiv\u003E...Yet i can see nowhere that the 4550m/s, or the 9.8m/ss is used....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETemstar\u0027s step 2 multiplies the expected total mass (given that ony 15% of it will be the payload) by the required TWR and \u00279.81\u0027. You can see how you would adjust for different strengths of gravity. You wouldn\u0027t need such a high TWR for launching from most other places but changing for different deltaV requirements is a bit harder anyway since the \u002715%\u0027 payload ratio wouldn\u0027t apply, so the total mass would be wrong.\u003C/p\u003E\u003Cp\u003EIncidentally, my own testing and designs, using Temstar\u0027s and Blizzy\u0027s work as a starting point, generally result in payload ratios around 17%, rather than 15%, although Temstar did include RCS in his launch vehicles, which I don\u0027t. (v 0.22, tweakables in 0.23 improve things even more but it\u0027s too laggy for me to test with much).\u003C/p\u003E\n"},{"CreatedByName":"Mtshaw113","CreatedById":115693,"CreatedDateTime":"2014-10-05T17:13:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003EAssuming we\u0027re talking about taking off from surface or Kerbin to reach orbit, and without resorting to jet engines - yes, asparagus staging booster is \u003Cstrong\u003EALWAYS\u003C/strong\u003E the best staging system.\u003Cp\u003ESee this is the issue here. If all the stacks (most importantly the centre core stack) are the same size then the TWR will progressively go down and this is a potential problem area that messes up people\u0027s asparagus staging rocket. The solution then is simple: have a centre stack that\u0027s more powerful than the boosters.\u003C/p\u003E\u003Cp\u003ELet\u0027s look at the TWR for this craft:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i43.tinypic.com/a9s0ig.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i43.tinypic.com/a9s0ig.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor a payload of over 110 tons a 593 ton rocket underneath manages to deliver it to a 75km x 75km LKO with an relative consistent TWR for all stages, how do I manage this? With a very powerful core stage:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i43.tinypic.com/64qrft.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i43.tinypic.com/64qrft.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere we see the powerful double cluster of the core stage. It\u0027s powered by eight LV-T30 and four LV-T45 for a total of 2520kN of thrust, compared to the 1500kN of each of the rocket\u0027s mainsail boosters.\u003C/p\u003E\u003Cp\u003EBasically when it comes to working out TWR for an asparagus, we have to balance a number of factors. Let\u0027s see how we go about designing a well balanced and efficient asparagus staging rocket to illustrate what I\u0027m talking about.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E First is payload fraction. An exceptionally well engineered asparagus staging rocket can manage over 16% payload fraction, far higher than any other type of staging and thus making it unquestionably the most efficient type of staging. When efficiency is the goal you should aim for at least a payload fraction of 15%. And so given a known payload - say 44 tons. You already know how big that rocket is:\u003C/p\u003E\u003Cp\u003E44 * 100/15 = 293 tons\u003C/p\u003E\u003Cp\u003ESo for a payload of 44 tons, you should be able to lift that into orbit with a rocket weighing 249 tons for a total stack of 293 tons.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.\u003C/strong\u003E Second, now that we know how big of a rocket we are designing we can figure out how to engine this rocket. The number that\u0027s important here is TWR at lift off. Given that the ideal ascent profile calls for a TWR of 2 before Max Q, you want lift off TWR to be below 2 so that by the time of first staging event your rocket\u0027s TWR goes above 2 and the two ends balance each other out. I find that the ideal TWR at lift off for an asparagus is between 1.6 - 1.7. The Nova rocket above as we can see have a lift off TWR of 1.67\u003C/p\u003E\u003Cp\u003ESo, given 293 tons:\u003C/p\u003E\u003Cp\u003E293 * 1.6 * 9.81 = 4599 kN\u003C/p\u003E\u003Cp\u003E293 * 1.7 * 9.81 = 4886 kN\u003C/p\u003E\u003Cp\u003EThus, we know that our rocket that can lift 44 tons need to have enough engines at the bottom for a lift off thrust of 4599kN - 4886kN\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3.\u003C/strong\u003E Last, we need to figure out exactly how we can engine this rocket to give us 4599kN - 4886kN and using an asparagus design. As we discussed above for a more consistent thrust we need the centre stage to be more powerful than the boosters. But exactly what ratio of core stage thrust vs total thrust should we use? There is no clear answer here but my own experience tells me the ideal ratio is somewhere around 22%. That is 22% of the rocket\u0027s thrust should come from its final stage while 78% comes from the asparagus staged boosters around it.\u003C/p\u003E\u003Cp\u003ESo given our 4599kN - 4886kN thrust what engines should that be? well 22% of that thrust is 1012kN - 1075kN. This number clearly shows us what engine we should use:\u003C/p\u003E\u003Cp\u003E4 x LV-T30 = 860kN\u003C/p\u003E\u003Cp\u003E1 x LV-T45 = 200kN\u003C/p\u003E\u003Cp\u003EFor a total of 1060kN which falls in our range. Thus we know for our 44 ton payload rocket, we should use a core stage powered by a five engine cluster of four LV-T30 and a centre LV-T45, which also gives us a good steering authority via vectored thrust.\u003C/p\u003E\u003Cp\u003ESo now that we know our core stage, that leaves 3539kN - 3826kN of thrust that must come from the asparagus boosters around it. Exactly how many boosters is up to personal choice - the more you have the smoother your TWR curve and the closer you approach the \u0022ideal staging rocket\u0022 that never carries any dead weight in terms of empty tanks or excess engine. On the other hand the more boosters you have the more complex the rocket becomes to engineer. I find that the ideal number for 2.5m core stage with 2.5m boosters is six. Six is the maximum number of 2.5m boosters you can cluster around a 2.5m core using standard long decouples, if you want more you have to resort to much more complex engineering for diminishing return which I find is not worth it.\u003C/p\u003E\u003Cp\u003ESo say we settle on 6 boosters around our 1060kN core. This gives us 590kn - 638kN per booster. Again the choice is clear:\u003C/p\u003E\u003Cp\u003E2 x LV-T30 = 430kN\u003C/p\u003E\u003Cp\u003E1 x LV-T45 = 200kN\u003C/p\u003E\u003Cp\u003EFor a total of 630kN per booster. Thus we now know the engine configuration of our 44ton payload rocket:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ea core stage of 4 LV-T30 and 1 LV-T45 for a 1060kN\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Esix boosters of 2 LV-T30 and 1 LV-T45 to give 630kN per booster\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe total thrust at lift off is thus 4840kN. These engines weigh a total of 30.5 tons. Our payload is 44 tons, so according to the 293 ton number we worked out in section 2 this leaves us with 218.5 tons for mostly fuel \u002B other hardware for the rocket. Your job then as a designer is then simply work out how to distribute that 218.5 tons of mostly fuel so that each stage has reasonable TWR. The end result will look something like this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i41.tinypic.com/352g2zp.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i41.tinypic.com/352g2zp.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs it turned out asparagus staging is so good we didn\u0027t actually need 218.5 tons of fuel to lift 44 tons of payload into orbit. The final rocket turns out to be 234 tons including the engines for a payload fraction of 15.89%. Better than the 15% target we were aiming for and far better than what\u0027s possible with other types of staging.\u003C/p\u003E\u003Cp\u003EThe above process is what I followed when I designed the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24787-0-19-1-Zenith-rocket-family\u0022 rel=\u0022external nofollow\u0022\u003EZenith rocket family\u003C/a\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i48.tinypic.com/mcdi03.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i48.tinypic.com/mcdi03.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey, what are those white slanted engines in the second picture?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-10-05T18:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mtshaw113\u0022 data-cite=\u0022Mtshaw113\u0022\u003E\u003Cdiv\u003EHey, what are those white slanted engines in the second picture?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re either T30s or 45s mounted on tail connectors.\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-10-06T00:13:48Z","Content":"\n\u003Cp\u003EI can\u0027t be hecked reading through all the pages so\u003C/p\u003E\u003Cp\u003Eyeah\u003C/p\u003E\u003Cp\u003EBasically Asparagus staging, when you release it one \u0022petal\u0022 at a time (symmetric tank detachment, 2 tanks at a time) ensures you have more DeltaV the higher you go. It may seem inefficient because of how quickly you drop the first tanks, but by the end your core stage should be fully fuelled. It\u0027s what allows me to make transfers to Duna in a 4 stage rocket and still have enough fuel to get an equatorial circularized orbit and return.\u003C/p\u003E\u003Cp\u003Etl;dr yes, asparagussing is much better.\u003C/p\u003E\n"}]}