{"TopicId":26277,"ForumId":36,"TopicTitle":"Orion aka \u0026quot;Ol\u0026#039; Boom-boom\u0026quot;","CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-10T17:17:02Z","PageNum":3,"Articles":[{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-15T16:17:56Z","Content":"\n\u003Cp\u003EThis could maybe help you:\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27587-WIP-KASPAR-Standardized-Cargo-Rack-System-for-modders\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/27587-WIP-KASPAR-Standardized-Cargo-Rack-System-for-modders\u003C/a\u003E He is developing a cargo system that uses individual crates. Maybe its possible to use this as magazines with a different model. you would have to \u0022refuel\u0022 your craft by attaching new magazines.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-17T02:33:56Z","Content":"\n\u003Cp\u003EMaking the individual magazines jettison-able is taking too much time. Heck with it, I\u0027ll do that in the future, when I\u0027ve gained more skill at mod making. \u003C/p\u003E\u003Cp\u003EFor now I\u0027ll just make a single \u0022fuel tank\u0022.\u003C/p\u003E\u003Cp\u003EI may have to scale this down, I\u0027m not sure it will fit in the VAB.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/USAFOrion012.jpg\u0022 alt=\u0022USAFOrion012.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/USAFOrion013.jpg\u0022 alt=\u0022USAFOrion013.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/USAFOrion014.jpg\u0022 alt=\u0022USAFOrion014.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/USAFOrion015.jpg\u0022 alt=\u0022USAFOrion015.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-05-17T02:45:11Z","Content":"\n\u003Cp\u003ELooks great! Have you got pictures of the engine working?\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-17T13:33:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mekan1k\u0022 data-cite=\u0022Mekan1k\u0022\u003E\u003Cdiv\u003ELooks great! Have you got pictures of the engine working?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlas, no. First I have to hack together a .dll to implement the explosions, the pusher animation, and the nuclear bomb magazines.\u003C/p\u003E\n"},{"CreatedByName":"Psyckosama","CreatedById":325,"CreatedDateTime":"2013-05-17T16:43:20Z","Content":"\n\u003Cp\u003EOh my god, the 10m is just awesome. GO WITH IT!\u003C/p\u003E\u003Cp\u003EReally this thing is just awesome\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-17T16:53:37Z\u0022 title=\u002205/17/2013 04:53  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 17, 2013\u003C/time\u003E by Psyckosama\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-17T18:15:05Z","Content":"\n\u003Cp\u003E{ Marvin the Martian voice } Dee-lays, dee-lays. All these tiny little problems keep cropping up. As Londo Molari would say, it is like being nibbled to death by cats.\u003C/p\u003E\u003Cp\u003EI\u0027ve spent several hours trying to troubleshoot a Blender into Unity import problem. Fixed it but it took too long. If your Blender file has too many images stored in the UV cache, when you import into Unity you\u0027ll have a phantom extra material that will make parts of your rocket transparent.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve just discovered that my rudimentary part.cfg file for the atomic bomb magazines will only attach to the cockpit part, it refuses to link to the crew capsule. \u003C/p\u003E\u003Cp\u003EAll these little things are keeping me from hacking the .dll for the motor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB09.jpg\u0022 alt=\u0022orionVAB09.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB06.jpg\u0022 alt=\u0022orionVAB06.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB08.jpg\u0022 alt=\u0022orionVAB08.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB07.jpg\u0022 alt=\u0022orionVAB07.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB04.jpg\u0022 alt=\u0022orionVAB04.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB05.jpg\u0022 alt=\u0022orionVAB05.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-17T18:18:12Z","Content":"\n\u003Cp\u003EThis is amazing! The first thing i\u0027m going to do with it will be a massive mission to the Joolian moons.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2013-05-17T19:59:18Z","Content":"\n\u003Cp\u003Eoh man, can\u0027t wait for it to come out.\u003C/p\u003E\n"},{"CreatedByName":"DasMike","CreatedById":60358,"CreatedDateTime":"2013-05-17T22:40:51Z","Content":"\n\u003Cp\u003EFirst, thanks so much for working on this, I\u0027ve been waiting for a Project Orion style propulsion system for such a long time! Quick question though, are the textures you\u0027re using going to be the ones that come with the first release? I like how intricate they look, but the textures on the engine itself seem a little stretched out - - If you have the time, would you consider maybe releasing the textures so we can edit them perhaps? I\u0027d like to make a texture that gives the engine a \u0022stock\u0022 part look to it.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-18T12:52:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DasMike\u0022 data-cite=\u0022DasMike\u0022\u003E\u003Cdiv\u003EQuick question though, are the textures you\u0027re using going to be the ones that come with the first release? I like how intricate they look, but the textures on the engine itself seem a little stretched out - - If you have the time, would you consider maybe releasing the textures so we can edit them perhaps? I\u0027d like to make a texture that gives the engine a \u0022stock\u0022 part look to it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, I\u0027ll release the textures as well. I\u0027ll try to remember to release the the sketchy UV map diagram that Blender makes.\u003C/p\u003E\u003Cp\u003EThe textures on the engine are stretched out because if I made the UV map with equal spacing the engine textures look fine but the yellow radiation trefoil is stretched out the other way.\u003C/p\u003E\u003Cp\u003EI used intricate textures to give a visual impression that this thing is incredibly huge, because it is. But I can see it does not look very \u0022stock\u0022 like.\u003C/p\u003E\u003Cp\u003EMeanwhile I\u0027m plowing my way through the Plug-In section of the forum to try and get up to speed. I did finally stumble over \u003Cem\u003Epart.FindModelAnimators()\u003C/em\u003E which was a big help.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-05-18T17:32:57Z","Content":"\n\u003Cp\u003EImpressive! My only issue with it is that you need to apply an edge split to you model to get rid of the awkward shadows.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-18T21:54:31Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/oopsie.png\u0022 alt=\u0022oopsie.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, things are progressing in a typically Kerbal fashion.\u003C/p\u003E\u003Cp\u003EAfter lots of skull sweat, I managed to comprehend the code that NovaSilisko so generously supplied to me. I did note a couple of places I\u0027d rearrange the code, the big one was that I\u0027d store the defining values of the nuclear pulse units (sounds so much more reassuring than \u0022atom bomb\u0022) in the magazine code, not the engine code. Reason being that various Orion designs use different yields on their bombs, which is easier to accommodate by swapping types of bomb magazines instead of swapping engine modules. And other various things.\u003C/p\u003E\u003Cp\u003EThen I was a few hours in MonoDevelop, trying to get the code to compile. As it turns out Unity\u0027s API changed slightly so NovaSilisko\u0027s code suddenly had syntax errors. But I finally got it to compile.\u003C/p\u003E\u003Cp\u003EI slipped the mods into KSP. I fired up the VAB, stacked a control module on top of a bomb magazine, on top of an Orion engine, then sent it to the launch pad.\u003C/p\u003E\u003Cp\u003EWhere it blew up before I could launch it. The magazine went kaboom, the poor control module flew up a couple of meters then fell onto the top of the engine, and I was left staring at the engine module standing on the launch pad. Second launch attempt did the same thing. Third is pictured above, this time the engine blew first, the magazine fell and exploded, but the capsule survived.\u003C/p\u003E\u003Cp\u003EThe astronaut\u0027s face is rather calm and cool, I would not look so calm if I knew I was on top of a stack of 3,600 atom bombs that was falling to the ground.\u003C/p\u003E\u003Cp\u003EMission report said:\u003C/p\u003E\u003Cp\u003E[00:00:00]: Structural failure on linkage between UKAF Nuclear Pulse Motor and UKAF Nuclear Pulse Fuel Tank\u003C/p\u003E\u003Cp\u003E[00:00:00]: UKAF Nuclear Pulse Fuel Tank collided into UKAF Nuclear Pulse Motor\u003C/p\u003E\u003Cp\u003E[00:00:01]: Fredory Kerman was killed\u003C/p\u003E\u003Cp\u003E[00:00:01]: Mk 1 Cockpit collided into UKAF Nuclear Pulse Motor\u003C/p\u003E\u003Cp\u003EMaybe I should not have set the explosionPotential to 1.0 in the part.cfg file.\u003C/p\u003E\u003Cp\u003EBack to the drawing board.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-18T21:58:54Z\u0022 title=\u002205/18/2013 09:58  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 18, 2013\u003C/time\u003E by nyrath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-05-18T21:55:48Z","Content":"\n\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EVery Kerbal indeed.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-18T22:44:15Z","Content":"\n\u003Cp\u003ELooks like the .dll doesn\u0027t want to activate.\u003C/p\u003E\u003Cp\u003EI tried using support towers. At least when I use them, the rocket does not instantly explode.\u003C/p\u003E\u003Cp\u003ENow, if the engines are the first stage, hitting the space bar does not apparently activate the rocket. It is supposed to use the \u0027z\u0027 key to start launching bombs. But nothing happens.\u003C/p\u003E\u003Cp\u003EIf the supports are the first stage, they let go, the rocket falls, and blows up.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-05-18T23:29:50Z","Content":"\n\u003Cp\u003Eneeds point away from face decal and it would be perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-19T01:14:17Z","Content":"\n\u003Cp\u003EYeah, null reference error.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E    private Transform pusherPlate;\u003Cbr\u003E\u003Cbr\u003E    //=======\u003Cbr\u003E    protected override void onFlightStart()\u003Cbr\u003E    {\u003Cbr\u003E        this.pusherPlate = base.transform.FindChild(\u0022model\u0022).FindChild(\u0022obj_pusherplate\u0022);\u003Cbr\u003E\t\tif (this.pusherPlate == null)\u003Cbr\u003E\t\t{\u003Cbr\u003E\t\t\tMonoBehaviour.print(\u0022onFlightStart() ***ERROR: failure to retrieve pusher plate transform\u0022);\u003Cbr\u003E\t\t}\u003Cbr\u003E    }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe error message is printing. According to Unity, the engine does indeed contain a component named obj_pusherplate. Looking more closely...\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-19T22:56:40Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB04-1.jpg\u0022 alt=\u0022orionVAB04-1.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB05-1.jpg\u0022 alt=\u0022orionVAB05-1.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB06-1.jpg\u0022 alt=\u0022orionVAB06-1.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionVAB07-1.jpg\u0022 alt=\u0022orionVAB07-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t get all excited, the blasted thing still doesn\u0027t work. The lack of documentation for the API is driving me crazy. And every day I learn something new and weird about the 3D engine.\u003C/p\u003E\u003Cp\u003EDid you know if you have a part with a mass of 280 tons, it will spontaneously detach from the part it is sitting on, then collide with it because the orbits are slightly different. \u003Cem\u003EWhile they are sitting on the launch pad?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI tried adding struts to hold them together. Then they started jiggling so hard that the capsule on top fell off. While sitting on the launch pad.\u003C/p\u003E\u003Cp\u003EUntil I can figure this out, I\u0027ve hard-coded the fuel tank\u0027s mass at 50 tons.\u003C/p\u003E\u003Cp\u003EThe code to animate the pusher plate not only does not work, it apparently crashes the .dll. I\u0027m sure it is due to something clumsy on my part. It uses a Transform to move the plate, but it is having trouble finding the transform.\u003C/p\u003E\u003Cp\u003EThe sound code works, but the explosions do not. The FXGroup \u0022explosionGroup\u0022 is not cooperating. I tried using FXMonger.Explode(this, new Vector3d(0f, -12.6133f, 0f), 1f); and again it seemed to crash the .dll.\u003C/p\u003E\u003Cp\u003EAnd I still have to figure out how to create and update a fuel indicator.\u003C/p\u003E\u003Cp\u003EAt least the heat animation works. \u003C/p\u003E\u003Cp\u003EI\u0027ll try to figure out more tomorrow, I\u0027m just spinning my wheels now.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-20T07:36:40Z","Content":"\n\u003Cp\u003EI hope you figure it out. I\u0027m so excited for this mod!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-20T18:30:59Z","Content":"\n\u003Cp\u003EA wee bit of progress.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure, but I think I kludged my way out of the \u0022ship snapping in two on the launch pad\u0022 problem. I edited the Orion engine and Orion magazine config files, and set their breakingForce and breakingTorque to 15000. \u003C/p\u003E\u003Cp\u003EThe good news is that I finally got the pusher plate to animate moving back and forth. The bad news is that broke the glowing heat animation. This is not surprising since both the motion and the heat are animations on the same part, just one alters part position, the other alters the color balance of the part texture. Arrgh.\u003C/p\u003E\u003Cp\u003EI still cannot get the blasted explosions to appear.\u003C/p\u003E\u003Cp\u003EThen I\u0027ll have to play with the pulse unit parameters. Right now they do 1000 kiloNewtons per pulse, which means you can launch and get into Kerbal escape orbit in no time at all. But there is no fine control, it is all or nothing. The impulse also makes the acceleration indicator jerk perilously close to the red zone, poor Kerbalnaut!\u003C/p\u003E\u003Cp\u003EAnd there are dozens of fine details I have not yet tackled. Like currently it ignores the thrust setting. Instead it sets off pulse units one per second as long as you manually hold down the \u0022Z\u0022 key. That is not going to work in time warp.\u003C/p\u003E\u003Cp\u003EThe bomb inventory indicator also refuses to show up.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Elater edit\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E{facepalm}\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENow \u003C/strong\u003EI see what the problem is with the explosions. As the rocket climbs into the air, the explosions are occuring on the launch pad, instead of behind the pusher plate as they should. Boy do I feel stupid.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T18:47:36Z\u0022 title=\u002205/20/2013 06:47  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by nyrath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fyrem","CreatedById":57131,"CreatedDateTime":"2013-05-20T19:04:22Z","Content":"\n\u003Cp\u003ENyrath, your development story is just a fun to read as the mod will be to play with!\u003C/p\u003E\u003Cp\u003EKeep up the good work.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-20T21:15:54Z","Content":"\n\u003Cp\u003EAs I suspected, it was a local-to-global coordinate problem.\u003C/p\u003E\u003Cp\u003EAgain, don\u0027t get excited, this thing is still full of bugs and needs lots of work.\u003C/p\u003E\u003Cp\u003EI\u0027m also going to try and move the parameters for the nuclear pulse units into the part.cfg file, so it will be easy to make a family of propulsion systems. And also so end-users can play with things.\u003C/p\u003E\u003Cp\u003EI did notice something a little odd. The explosions occur, and ball of debris streaks rapidly backwards. Until you reach the limits of the atmosphere, then suddenly the debris travels with you.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionBoom01.jpg\u0022 alt=\u0022orionBoom01.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionBoom03.jpg\u0022 alt=\u0022orionBoom03.jpg\u0022\u003E\u003Cimg src=\u0022http://i816.photobucket.com/albums/zz85/winchellchung/orionBoom02.jpg\u0022 alt=\u0022orionBoom02.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lord_Stimpy","CreatedById":15849,"CreatedDateTime":"2013-05-20T23:25:47Z","Content":"\n\u003Cp\u003EThis is looking to be pretty awesome.\u003C/p\u003E\u003Cp\u003EGreat website too, i remember reading through it a few years back, found the link on a sci-fi modelling forum.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-05-21T00:17:11Z","Content":"\n\u003Cp\u003EThis will be a fun mod to play with.\u003C/p\u003E\u003Cp\u003ECan you actually land with it and will it destroy anything too close to it on takeoffs and landings?\u003C/p\u003E\u003Cp\u003EIt makes me think of Fallout and the Brotherhood of Steal every time I see it.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-05-21T00:26:29Z","Content":"\n\u003Cp\u003EI see those pictures, and I think only one thing: Those Geiger counters are singing now.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-21T00:28:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EThis will be a fun mod to play with.\u003Cp\u003ECan you actually land with it and will it destroy anything too close to it on takeoffs and landings?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurrently I\u0027m not sure how to make it devastate the area it lands in. So in theory you can land.\u003C/p\u003E\u003Cp\u003EIn practice, every time I land the blasted thing, it blows up.\u003C/p\u003E\u003Cp\u003EI\u0027m going to need help figuring out appropriate values for the parts.cfg files. I can make it semi-realistic, but I do not want something that will \u0022break the game\u0022 (that is, be so disgustingly over-powered that it is no fun to play). But first I have to track down and kill some programming bugs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mekan1k\u0022 data-cite=\u0022Mekan1k\u0022\u003E\u003Cdiv\u003EI see those pictures, and I think only one thing: Those Geiger counters are singing now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo kidding. Like it says in the catalog: \u003Cem\u003EIt has a remarkable specific impulse, but will drastically decrease the property values downwind of the launch site\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EHaving said that, Kerbals seem to be immune to radiation, so they just have to worry about being vaporized.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-21T00:30:18Z\u0022 title=\u002205/21/2013 12:30  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 21, 2013\u003C/time\u003E by nyrath\u003C/strong\u003E\n\u003C/span\u003E\n"}]}