{"TopicId":26453,"ForumId":39,"TopicTitle":"[AAR] Going Somewhere, Everywhere.","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-05-11T23:25:31Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-05-11T23:25:31Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U4Qyruv.png\u0022 alt=\u0022U4Qyruv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EOrder No.141, KSC, Head Director, Issued 11/22/2039\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIn regards to your concerns for the manned human spaceflight program due to stagnating interest and decreasing popularity due to the popular conception \u0022We have done it all\u0022 after the consruction and commisioning of the first inter-planetary base on Ike earlier this year, the entire human-spaceflight program is now directed to construct massive inter-planetary cruisers, for research and colonization purposes. The craft will take years of work, and will be massively expensive. To counter this, the President has passed Bill No.1211, which will increase your budget for the FY2040 to $75 Billion dollars, one percent of the Federal Budget.\u003C/p\u003E\u003Cp\u003EThe goverment has proposed to send the craft onto an expedtion to the Joolian System. The proposal passed Congress 534-1. You are to begin construction of an inter-planetary ship, immedialty. \u003C/p\u003E\u003Cp\u003E--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003ENedbob Kerman picked up the paper, read it, drinking a cup of coffee as he did. The order was another one of its kind, sumitted by political idiots who had no experince in running and space program. Scanning the page for notable subjects, he saw the deadline, and the cost. Cost ; $60 Billion. Deadline ; Next Month. \u003C/p\u003E\u003Cp\u003EPicking up the phone, he frantically dialed a number.\u003C/p\u003E\u003Cp\u003E\u0022This is Nedbob, can you get the Head Engineer on the line?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Scramble a big team of workers, we got a tight deadline and small budget, GO!\u0022\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ETen Weeks Later (Skipped the In-Orbit Assembly, its a tedious, and yes, to keep with tradition, its behind schedule)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u0022So, the craft is in orbit, awaiting crew.\u0022\u003C/p\u003E\u003Cp\u003EThe small probe circled the large ship, providing its creators an nice view of the craft.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/00h6L7h.png\u0022 alt=\u002200h6L7h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022When we going to launch the crew?\u0022\u003C/p\u003E\u003Cp\u003E\u0022What crew, we have\u0027nt chosen a crew yet.\u0022\u003C/p\u003E\u003Cp\u003ENedbob quickly picked up the loudspeaker.\u003C/p\u003E\u003Cp\u003E\u0022All astronauts, report to the Control room.\u0022\u003C/p\u003E\u003Cp\u003ESeveral astronauts quickly lined up. \u003C/p\u003E\u003Cp\u003E\u0022Get into that rocket on the pad!\u0022\u003C/p\u003E\u003Cp\u003E\u0022So, we have the crew now.\u0022\u003C/p\u003E\u003Cp\u003E\u0022We don\u0027t. Yu just threw in our most experinced astronaut without any training. Thats a waste.\u0022\u003C/p\u003E\u003Cp\u003ENedbob sighed, then went back to his game of \u0022Human Space Program\u0022. Quite a fun pastime for bored mission controllers...\u003C/p\u003E\u003Cp\u003EMore to come, my KSP crashed so I have to restart a ton of stuff.....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T21:19:34Z\u0022 title=\u002205/12/2013 09:19  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2013-05-12T03:21:58Z","Content":"\n\u003Cp\u003EHuman space program, oh that cracked me up. And not bad overall.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2013-05-12T14:08:11Z","Content":"\n\u003Cp\u003EYou were looking for a mission patch, were you not? Take a look:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/wim0abN\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EMission Patch\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you like it, then feel free to use it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course, if you don\u0027t like it, then ask around. I\u0027m sure someone else wouldn\u0027t mind trying for you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, whichever that ship is (Galantea or Dawn) in the picture, it looks pretty interesting indeed. Best of luck to the mission, Jool is a challenge. I should know, I\u0027ve had many thwarted attempts to visit it up until my first Laythe landing...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T19:17:59Z\u0022 title=\u002205/12/2013 07:17  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by RogueMason\u003C/strong\u003E\n\u003C/span\u003E\n"}]}