{"TopicId":26462,"ForumId":32,"TopicTitle":"Question","CreatedByName":"Dasemay","CreatedById":57491,"CreatedDateTime":"2013-05-12T00:50:44Z","PageNum":1,"Articles":[{"CreatedByName":"Dasemay","CreatedById":57491,"CreatedDateTime":"2013-05-12T00:50:44Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027;\u0022\u003Equestion. Do video cards improve performance? or is it all about the cpu? \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"cristof12","CreatedById":42036,"CreatedDateTime":"2013-05-12T00:52:01Z","Content":"\n\u003Cp\u003ESwitched from 4870 to 7850, saw no improvement. Overclocked my Phenom II X4 920 from 2.8GHz to 3.5GHz, saw no improvement. Switched from 4GB to 8GB of RAM, saw no improvement.\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2013-05-12T00:55:33Z","Content":"\n\u003Cp\u003EI think the problem is you can turn the graphics/resolution up or down to suit the hardware you have but you can\u0027t turn down the games physics which is on one thread on the CPU. You can get away with a much lower GPU than CPU.\u003C/p\u003E\n"},{"CreatedByName":"KAO","CreatedById":30795,"CreatedDateTime":"2013-05-12T00:58:05Z","Content":"\n\u003Cp\u003Eswitched to a 6870 I think it was and now game is seamless\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-05-12T01:07:32Z","Content":"\n\u003Cp\u003EGpu only limits the game if it along the range of 620(nvidia) or 6450(Radeon). those are realy low end and might get lag if too high graphics but mostly cpu\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-12T01:10:11Z","Content":"\n\u003Cp\u003EOnce we get proper GPU acceleration and PhysX support it will make a difference.\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2013-05-12T01:15:09Z","Content":"\n\u003Cp\u003EDepends... what are you going from and what the new card is, and what you\u0027re settings and screen resolution is. If you\u0027re going from a GeForce to an actual GTX series card and trying to play on max settings, then yeah, gonna see a major improvement. Going from a GTX 460 to GTX 550Ti, yeah, not really gonna notice anything with KSP. Also, trying to run KSP on a Sempron (are those still around?) from 4 years ago with a GTX 460... yeah, its about the chip...\u003C/p\u003E\u003Cp\u003EThe thing to note about KSP right now. It really doesn\u0027t require much out of a GPU, and its more about how fast your CPU can crank out calculations, and how that chip handles single thread games. Right now (and for a while now), Intel chips are vastly superior to AMD chips in single threaded applications. Has to do with how the chip works, and very little (if any) depends on it s clock speed. AMD Proved this back during the days of the Socket 939 and LGA 775 battle. AMDs Athlon 64 chips were either equal or better than Intel\u0027s Pentium 4 offerings that ran on faster clock speeds and higher temps.\u003C/p\u003E\u003Cp\u003ETo Cristof12. The 4870 was a pretty solid card back a few years ago, and more than enough for KSP (Lets face it, not too advanced in 3D graphics), the Bottleneck however, is probably that PII. Overclocking has never shown visible improvements, add to the fact it isnt too good in the single thread department.. yeah.\u003C/p\u003E\n"},{"CreatedByName":"Dasemay","CreatedById":57491,"CreatedDateTime":"2013-05-12T02:39:33Z","Content":"\n\u003Cp\u003Ei just switched from integrated graphics to a GTX 650 ti 2gb. it was a big jump for me, and thanks for the help.\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2013-05-12T02:54:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dasemay\u0022 data-cite=\u0022Dasemay\u0022\u003E\u003Cdiv\u003Ei just switched from integrated graphics to a GTX 650 ti 2gb. it was a big jump for me, and thanks for the help.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah, forgot to mention, IGPs are really a poor choice for just about anything... including wanting to watch a DVD, so going from an IGP to a dedicated GPU (even a very low end GPU) will see a large jump.\u003C/p\u003E\n"},{"CreatedByName":"Reavermyst","CreatedById":65325,"CreatedDateTime":"2013-05-12T03:10:45Z","Content":"\n\u003Cp\u003ESorta. The complicating side of it all is that your GPU relies on your CPU to reach it\u0027s full potential and vice versa. Which means pairing a Single Core with a pair of GTX Titans would really get you no where because your CPU would bottle-neck the GPU\u0027s potential. Same goes if you get an i7 hexa-core processor and pair it up with a Radeon HD 3850. So you need to try to match the capabilities of both parts together to get the best results.\u003C/p\u003E\u003Cp\u003EAs for the game, it\u0027s barely close to reaching v.20 Which to my knowledge means it\u0027s about 20% into active development. so from here until the big day of v1.0 we\u0027ll surely see a slew of performance enhancements! v.20 is said to contain a few performance tweaks that should help some!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T03:14:20Z\u0022 title=\u002205/12/2013 03:14  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Reavermyst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tom1499","CreatedById":38308,"CreatedDateTime":"2013-05-12T07:32:32Z","Content":"\n\u003Cp\u003EPfft, I play on my I7\u0027s integrated graphics all the time. A fault with my laptops motherboard rendered its graphics card useless, so I adapted to using the integrated graphics. Once you turn off shadows and AA, it works fine.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-12T07:50:39Z","Content":"\n\u003Cp\u003EI switched from 4GB to 12GB and saw a big improvement on loading times... especially as I am a mod whore.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-05-12T08:23:27Z","Content":"\n\u003Cp\u003EThis week i will get my new laptop. I can\u0027t wait to see what 6 giga RAM, i5 CPU and GTX card will do to KSP\u0027s performance. On my old, trusty Toshiba it was abysmal since 0.18 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tristavius","CreatedById":60879,"CreatedDateTime":"2013-05-12T10:17:44Z","Content":"\n\u003Cp\u003EAgree with the above having tried on a few system setups...\u003C/p\u003E\u003Cp\u003EGraphics card will effect how high you can ramp the graphic details level up. On my laptop, 2x ATI HD-4870s (approx 4 years old) will only allow bare minimum settings. On my desktop 3x Nvidia 690\u0027s... well... they\u0027re overkill for just about anything.\u003C/p\u003E\u003Cp\u003EThe actual physics however seem limited to processor only so no matter how great your graphics card, on huge craft it\u0027s going to be the CPU lagging behind. The Core2 Duo in my laptop actually does really quite well considering it\u0027s age, though the i7 in the desktop was unarguably better.\u003C/p\u003E\u003Cp\u003EHave noticed problems on some test systems with very low RAM, but any reasonable amount on a modern machine won\u0027t cause issues.\u003C/p\u003E\n"},{"CreatedByName":"Tristavius","CreatedById":60879,"CreatedDateTime":"2013-05-12T10:20:51Z","Content":"\n\u003Cp\u003EOn the laptop, the 6GB of RAM has started to really drag starting the game with a few mods installed, although was lightning fast before. Can\u0027t even remember how much is in the desktop back home (away travelling for a few months at the moment) but it was a ridiculously large amount (a totally pointless amount in fact) and I barely remember seeing a loading screen.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-05-12T10:27:38Z","Content":"\n\u003Cp\u003ELet\u0027s hope optimisation of RAM usage announced for 0.20 will fix it. Otherwise i will have to shell out more money for RAM upgrade \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Trivial on desktop, but i would hesitate from doing this on brand new laptop.\u003C/p\u003E\n"},{"CreatedByName":"Dasemay","CreatedById":57491,"CreatedDateTime":"2013-05-12T14:19:45Z","Content":"\n\u003Cp\u003EI have 8gb of ram, and i could play without getting so much lag that things turned into a slide show. i always got decent frames but never amazing ones, so that is what i hoped a new vpu could do and man it did.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-05-12T15:13:50Z","Content":"\n\u003Cp\u003EI have 8GB Ram, AMD A8 3870K, and an AMD Radeon HD 6570, not running in dual graphics mode since it only works well with some games. KSP works perfectly fine most of the time. I do get some crashes now and then though.\u003C/p\u003E\n"}]}