{"TopicId":26523,"ForumId":16,"TopicTitle":"Deadly Reentry Mod","CreatedByName":"Henri von Braun","CreatedById":65895,"CreatedDateTime":"2013-05-12T13:02:50Z","PageNum":1,"Articles":[{"CreatedByName":"Henri von Braun","CreatedById":65895,"CreatedDateTime":"2013-05-12T13:02:50Z","Content":"\n\u003Cp\u003EHello everyone, \u003C/p\u003E\u003Cp\u003EI have recently downloaded the Deadly Reentry mod, and I would like to permit my ship to reenter without blowing up. I have used the heat shields provided, bu they keep passing the 10 000 degree benchmark. I have checked out that real spacecraft have a specific angle to reenter. I would like to know what angle do I need to reenter , and if possible, how to measure them. \u003C/p\u003E\u003Cp\u003EThank you very much !\u003C/p\u003E\u003Cp\u003EHenri von Braun\u003C/p\u003E\n"},{"CreatedByName":"chaosplacer","CreatedById":64901,"CreatedDateTime":"2013-05-12T15:05:26Z","Content":"\n\u003Cp\u003EYou want a re-entry angle as shallow as possible. In reality, if you go too shallow, you kind of bounce of the atmosphere, that\u0027s why you need a specific angle that lies between bouncing and burning.\u003C/p\u003E\u003Cp\u003EFor KSP at the moment, just go as shallow as possible. Set your periapsis slightly below 60 km and you should be fine.\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2013-05-12T16:19:41Z","Content":"\n\u003Cp\u003ETry a Pe of about 26 km. I\u0027ve found that this gives a g force very close to what the original apollo missions experienced during re-entry. This in turn, should allow you you to re-enter with the heat shield.\u003C/p\u003E\n"},{"CreatedByName":"Wavelength","CreatedById":65408,"CreatedDateTime":"2013-05-12T18:50:06Z","Content":"\n\u003Cp\u003EHey Henri, I too have been running the Deadly Reentry mod and in my experience have found between 25km and 30km to be shallow enough to, A: not burn up and B: not go back out into orbit. I rarely see temps over 4k. Another problem i have is the inflatable heat shield flipping me over when the drag gets high enough. By reentering between the 25 - 30 km range, ive found that yes, i do still flip over, but only after i have slowed down enough not to torch my kerbals. At that point i cut the thing loose and get the chutes out.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-12T20:08:33Z","Content":"\n\u003Cp\u003EThe \u0022skipping back into space\u0022 concern exists in real life because most capsules only have a limited amount of time that their life support systems will keep the crew alive. The capsule itself would eventually return to Earth; it\u0027s just that, by the time it did, the crew would likely have been smothered by its own carbon dioxide (or starved, or dehydrated, or... well, let\u0027s just say it\u0027s not a pretty picture). In KSP that\u0027s not as much of a concern, unless you\u0027re playing with other mods like Ioncross Crew Support.\u003C/p\u003E\n"},{"CreatedByName":"Henri von Braun","CreatedById":65895,"CreatedDateTime":"2013-05-13T09:37:06Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EThank you everyone for your answers ! After quite a few tries, Bob finally made it through!\u003C/p\u003E\u003Cp\u003EThanks again for the help, \u003C/p\u003E\u003Cp\u003E Henri von Braun\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-05-13T15:35:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EThe \u0022skipping back into space\u0022 concern exists in real life because most capsules only have a limited amount of time that their life support systems will keep the crew alive. The capsule itself would eventually return to Earth\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo wait, when this effect is described as \u0022skipping back into space\u0022 by the popular press, they\u0027re lying then? Because if all that\u0027s really happening is \u0022the air slowed it down some, but not enough to completely kill the orbit\u0022 in no way is that even close to the act of \u0022skipping\u0022 a stone on water. When skipping a stone, the stone would not have bounced up entirely on its own without the water being present. It still would have fallen and hit the ground of the water was missing. Therefore the water\u0027s presence is in fact *causing* the stone to bounce upward, imparting a force upward on the stone (and not just drag in the retrograde direction, but in fact a force that is actually upward). This is a terrible, terrible analogy if what\u0027s actually happening in shallow re-entries is that the air exerted no upward force whatsoever on the craft and instead exerted entirely retrograde force only on the craft (drag), and the air is not the slightest bit responsible for making the craft go back up into orbit at all, but rather the craft would have done that anyway and the air just failed to prevent it.\u003C/p\u003E\u003Cp\u003EWater *causes* a skipping stone to bounce upward. That\u0027s not the same thing as air failing to STOP a craft from the going upward it normally would have done anyway on its own.\u003C/p\u003E\u003Cp\u003EIs this another case where, when science is dumbed down for public consumption, it becomes incorrect?\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-05-13T15:43:17Z","Content":"\n\u003Cp\u003Emuch science much science but nobody thought that a deadly reentry will never happen in kerbin?\u003C/p\u003E\u003Cp\u003EThe speed to leave kerbinÃ‚Â´s orbit is 2000 m/s, in earth is 8000 m/s.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-05-13T16:34:05Z","Content":"\n\u003Cp\u003EIn most cases, if the re-entry is too shallow, you would shoot through the upper atmosphere without losing enough velocity to totally deorbit. However, it would lower your Ap and you would definitely deorbit several orbits later.\u003C/p\u003E\u003Cp\u003EHowever, in real-life, capsules have a positive lift/drag ratio, depending on their angle of attack, therefore they can hypothetically raise their altitude if they are oriented in a specific way. This would be like a skipping stone effect. Again, you won\u0027t just bounce off into escape velocity. Any lift would be gained at the expense of velocity and the effect would be pretty much the same. You would reenter a few orbits later.\u003C/p\u003E\u003Cp\u003EIn the case of Apollo, once the Service Module was separated, the capsule wasn\u0027t designed to maintain power and life support for more than a few hours, so if something like this did happen, the CM would land in a random location with 3 dead astronauts (and probably no parachutes, which would be messy).\u003C/p\u003E\n"},{"CreatedByName":"Spectre211286","CreatedById":58865,"CreatedDateTime":"2013-05-14T19:08:58Z","Content":"\n\u003Cp\u003Eif you have fuel left use your engines to slow you down i always click the retrograde button in mechjeb and take that angle and then slow down as much as possible. if no fuel left use an aerobraking maneuver and as many orbits as required to slow down enough to survive. i have used a fusion engine mod that gave me enough fuel to slow down sufficiently that i survived reentry without a heatshield.\u003C/p\u003E\n"},{"CreatedByName":"Sleipnir","CreatedById":58380,"CreatedDateTime":"2013-05-14T20:48:35Z","Content":"\n\u003Cp\u003ESo what is the best approach angle then? I have tried setting my periapsis at 60km and it worked fine for my test probe, but once i tried it with a 1 man pod it didn\u0027t work and Bob died \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E. So the 60km thing is not the final solution. I am guessing the mass difference had an effect on it. Can anyone help?\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-05-16T05:43:10Z","Content":"\n\u003Cp\u003EI used to use a reentry mod that had an expendable ablative shield that would deteriorate depending on heat and time. If you were too hot for too long it would deplete the material and it would fail. If you entered too steeply the peak temperature or peak G would be too high and it would fail. The goal became to use the shield material up to spread out the energy of the interface over a long time without using it all.\u003C/p\u003E\u003Cp\u003EDeadly Reentry seems a lot more simplistic. As far as I can tell it just has a temperature and no durability so the goal is to keep the stress on the shield low and make the duration as long as possible. With D.E. you want shallow angles (~5 degrees) at the atmo interface with minimal orbital energy (100x40km for example). There\u0027s no such thing as too shallow here.\u003C/p\u003E\u003Cp\u003EApollo also had lift created by the shape of the capsule so the attitude of the craft affected its path. The lift kept the craft from plunging too rapidly into thicker layers below and maintaining a desired deceleration for longer.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-05-16T06:01:37Z","Content":"\n\u003Cp\u003ETo all those that have issues with burning up on reentry even when setting the PE to 60km - If you have the ferram aerospace mod installed, it seems to make reentries much less survivable.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-16T12:35:52Z","Content":"\n\u003Cp\u003EDR is somewhat unrealistic in that the shallower your entry angle, the more survivable it will be. In reality, being too shallow is what leads to burning up (because you\u0027re exposed to the high temps for a longer period of time) while being too steep leads to structural failures from gee-loading.\u003C/p\u003E\u003Cp\u003EIf you are burning up with a Kerbin Pe of 60km, you have other mods installed that are messing up DR.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-05-17T03:04:37Z","Content":"\n\u003Cp\u003EYeah I have Ferram but if it\u0027s DR or Ferram, FAR stays. I can still reenter safely just with a smaller margin. I also think FAR makes mechjeb not be able to calculate ship drag.\u003C/p\u003E\n"},{"CreatedByName":"N_Molson","CreatedById":63688,"CreatedDateTime":"2013-11-15T23:32:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo wait, when this effect is described as \u0022skipping back into space\u0022 by the popular press, they\u0027re lying then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen returning from the Moon, no. The Earth \u0022slingshot\u0022 effect can send the spacecraft on an escape trajectory. Or in an orbit so elliptic it will take months for it to come back. Also don\u0027t forget that KSP physics model don\u0027t take gravity perturbations into account. Sun/Moon/Earth interactions can send the spacecraft in an elliptic orbit around Earth that never crosses atmosphere again.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Eterrible analogy if what\u0027s actually happening in shallow re-entries is that the air exerted no upward force whatsoever on the craft and instead exerted entirely retrograde force only on the craft (drag)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou forget something that isn\u0027t (AFAIK) implemented in KSP : conical (Apollo) or headlight-shaped (Soyuz) capsules produce \u003Cstrong\u003Elift\u003C/strong\u003E, like any shuttles or aircrafts. They are designed to produce lift when re-entering, and while they are designed to fly at their best at very high ultra-sonic speeds, they completely stall only slightly above Mach 1 (at trans-sonic speeds). When the capsule is tilted in the right direction (thanks to RCS thrusters), it acts as a wing : air pressure is higher on the heatshield, and lower above the top.\u003C/p\u003E\u003Cp\u003EFrom Wikipedia :\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn practice, capsules do create a significant and useful amount of lift. This lift is used to control the trajectory of the capsule. This controls allows for reduced g-forces for the crew, as well as reducing the peak heat transfer into the capsule. The longer the vehicle spends at high altitude, the thinner the air is and the less heat is conducted. For example the Apollo capsule had a lift to drag ratio of about 0.35. In the absence of any lift the Apollo capsule would be subjected to about 20g deceleration (8g for low-earth-orbiting spacecraft), but with lift the trajectory can be kept to around 4g.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, when the capsule \u0022skips\u0022 the atmosphere, lift is produced, and not only drag. Of course nothing can produce more lift than drag (else we wouldn\u0027t need engines !), but the effect is significant enough to greatly bend the trajectory of the spacecraft. This, combined with the slingshot effect, can be a one-way ticket when re-entering from lunar velocities (roughly 10,500 m/s vs \u0022only\u0022 7,500 m/s for a LEO return). And to escape Earth SOI, you don\u0027t need to go much faster than 11,000 m/s.\u003C/p\u003E\u003Cp\u003EA spherical capsule (like Vostok) produces no lift at all, and only drag, typically getting 8-9g on re-entry. There is also a safety mode on the Soyuz that, if the other controls fail, make the capsule automatically spin on itself at a fast rate, which nullifies lift. This is called a \u0022ballistic reentry\u0022, and the spacecraft decelerates exactly like a spherical capsule in that case. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Soyuz_TMA-11\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESoyuz TMA-11\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E re-entered that way, and was nearly 500 kilometers off-target, because of the lack of lift.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T23:44:19Z\u0022 title=\u002211/15/2013 11:44  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by N_Molson\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-16T00:02:27Z","Content":"\n\u003Cp\u003EAlso with Deadly re-entry you have to take re-entry speed into account. If you are hitting atmo at over 2.5km/s you are going to get much hotter much faster. Best I\u0027ve found is to have an apoapsis about 40km up and pray for the best. (It\u0027s usually keep the pod intact, but kiss your solar panel goodbye)\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-16T01:09:33Z","Content":"\n\u003Cp\u003EKnowing how old this thread is, I can guarantee that it\u0027s highly likely that none of the information is relevant to Deadly Reentry in its current release. If you want to continue the discussion on atmospheric skipping in the real world, then I\u0027d highly recommend starting a new thread over in the Science Lab.\u003C/p\u003E\u003Cp\u003EThread closed. Have a nice day, everyone, and don\u0027t forget to check the posting dates \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}