{"TopicId":26562,"ForumId":16,"TopicTitle":"SSTO Fuel Issues","CreatedByName":"The Wall","CreatedById":63972,"CreatedDateTime":"2013-05-12T18:24:58Z","PageNum":1,"Articles":[{"CreatedByName":"The Wall","CreatedById":63972,"CreatedDateTime":"2013-05-12T18:24:58Z","Content":"\n\u003Cp\u003EI\u0027ve managed to make a SSTO spaceplane, but I\u0027m rapidly discovering that it\u0027s extremely tight on fuel; the most I\u0027ve been able to squeeze spare from it after getting to a stable 75km orbit is about 75-80 units. This isn\u0027t a problem in itself, since I can always refuel it before taking it elsewhere -- the issue is that after a complete refill of the tanks it \u003Cem\u003Ejust\u003C/em\u003E has enough fuel to pull off a Mun landing and nothing more, running out completely around 20m above the Munar surface. At the moment I have one FL-T800 and three FL-T400s supplying an aerospike, with two fuselages for the turbojets. I\u0027m stuck for ways to make it either more fuel efficient or to sneak a higher carrying capacity onto it; does anyone have any ideas?\u003C/p\u003E\u003Cp\u003EPlane in SPH: \u003Ca href=\u0022http://i.imgur.com/jVGs74c.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/jVGs74c.jpg\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T21:19:18Z\u0022 title=\u002205/12/2013 09:19  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by The Wall\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-05-12T19:55:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Wall\u0022 data-cite=\u0022The Wall\u0022\u003E\u003Cdiv\u003EI\u0027ve managed to make a SSTO spaceplane, but I\u0027m rapidly discovering that it\u0027s extremely tight on fuel; the most I\u0027ve been able to squeeze spare from it after getting to a stable 75km orbit is about 75-80 units. This isn\u0027t a problem in itself, since I can always refuel it before taking it elsewhere -- the issue is that after a complete refill of the tanks it \u003Cem\u003Ejust\u003C/em\u003E has enough fuel to pull off a Mun landing and nothing more, running out completely around 20m above the Munar surface. At the moment I have one FL-T800 and three FL-T400s supplying an aerospike, with two fuselages for the turbojets. I\u0027m stuck for ways to make it either more fuel efficient or to sneak a higher carrying capacity onto it; does anyone have any ideas?\u003Cp\u003EPlane in SPH: \u003Ca href=\u0022http://i.imgur.com/Mwp6S19.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Mwp6S19.gif\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi there:)\u003C/p\u003E\u003Cp\u003EFirst of all your imgur link shows some kind of differential equation, [it looks kind of like some polar coordinates version of the wave equation? (are you a physics student?)] not a SSTO in the VAB. But the problem you describe is a common one. Basically the mass ratios of SSTOs are awful, so it is tricky to get much delta-v out of them. Assuming we\u0027re talking about a SSTO spaceplane, try to pare off any extraneous wings or structural mass that you can. And try to build up as much speed as you can with turbojets before engaging your rocket engines in the upper atmosphere (hopefully at least 1200-1400m/s). Resist the temptation to go big if you can, balancing the center of lift/center of mass tends to get more difficult as the spacecraft scales up.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2013-05-12T20:45:16Z","Content":"\n\u003Cp\u003EOne thing that helped me was to make an action group to close all the intakes when the engines shut down. Those few critical seconds when the rockets first fire and you\u0027re climbing up out of the soup is when every bit of drag makes a huge difference. But really, your technique during those few seconds is what matters.\u003C/p\u003E\n"},{"CreatedByName":"ThePsuedoMonkey","CreatedById":58589,"CreatedDateTime":"2013-05-12T20:48:23Z","Content":"\n\u003Cp\u003EI\u0027d reconsider use of the aerospike. By the time you\u0027re high enough to switch from jets to rockets, the atmosphere is so thin that you are pretty much in space anyway, so you lose its primary benefit. I made \u003Ca href=\u0022http://imgur.com/a/okuO4\u0022 rel=\u0022external nofollow\u0022\u003Ethese quick and dirty charts\u003C/a\u003E while learning to make spaceplanes, so they may help you as well.\u003C/p\u003E\n"},{"CreatedByName":"The Wall","CreatedById":63972,"CreatedDateTime":"2013-05-12T21:18:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022architeuthis\u0022 data-cite=\u0022architeuthis\u0022\u003E\u003Cdiv\u003EHi there:)\u003Cp\u003EFirst of all your imgur link shows some kind of differential equation, [it looks kind of like some polar coordinates version of the wave equation? (are you a physics student?)] not a SSTO in the VAB.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, wow, embarassing! Yeah, I am; I had that URL on the clipboard for some reason and must have forgotten to clear it. Just fixed it. Since the angle\u0027s a bit awkward and I can\u0027t load KSP right now to take more, it\u0027s exactly symmetrical barring the ladders leading down from the cockpit to the bottom (to allow vertical landings); down the central body it goes inline docking port-\u0026gt;FL-T800-\u0026gt;FL-T400-\u0026gt;aerospike.\u003C/p\u003E\u003Cp\u003EOn ascent, I only have one pair of intakes open and open the next two pairs individually as I need them to minimise drag, and have an action key bound to close the intakes and kill the jet engines. I suppose I could try and snip off things like that extra cockpit at the front (the Mk.2 is the root part), but I originally hoped this plane would be able to fly by and pick up stranded Kerbals. \u003C/p\u003E\u003Cp\u003EI could try and clip down the parts, but increasingly a Munar SSTO seems unfeasible without at least swapping the aerospike for a NERVA in orbit, or even adding a couple more tanks once I reach orbit?\u003C/p\u003E\u003Cp\u003EI suppose that could add an extra challenge too, though; a spaceplane chopshop in low Kerbin orbit to refuel them and rearrange their engine blocks as needed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SecondGuessing","CreatedById":62686,"CreatedDateTime":"2013-05-12T22:59:33Z","Content":"\n\u003Cp\u003EMy advice would be to download Kerbal engineer and fit a flight computer to the craft for a little while. Test different turning altitudes and degrees to get to the same circular altitude and see which one gives you the most delta-v at the end. I just got my SSTO from 606d/v at an 80,000 circular orbit to 892 at an 80,000 circular orbit. That\u0027s a difference big enough to mean I can now comfortably do a Munar fly-by rather than just sit in orbit, and that was in just three runs. Having those exact figures really helps you squeeze everything out of your aircraft, which is needed for an SSTO.\u003C/p\u003E\u003Cp\u003EI do love the idea of having exchangeable engines, though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-12T23:26:43Z","Content":"\n\u003Cp\u003Emoar intakes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/ssto3.jpg\u0022 alt=\u0022ssto3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-05-13T04:04:29Z","Content":"\n\u003Cp\u003EYou don\u0027t need two engines. Two jets, that is. I would recommend, for something relatively small to an approaching-medium-sized plane, to use a single Turbo Jet engine. The launch may require a bit of extra lift that you currently don\u0027t have, but here\u0027s the upsides:\u003C/p\u003E\u003Cp\u003E-You suck down fuel half as fast. This means you\u0027re able to have a bit more for return, OR, you could possibly strap on a small KSPX oxidizer tank and use it as rocket fuel. Either way, you\u0027re sucking down fuel half as fast.\u003C/p\u003E\u003Cp\u003E-Leaving the amount of intakes on your craft constant, you\u0027re able to intake spam without making it horribly ugly..\u003C/p\u003E\u003Cp\u003E-This means, if you keep that number of intakes constant, you\u0027ll be able to go MUCH higher without any issues..\u003C/p\u003E\u003Cp\u003EObserve this craft that made it to within about 100-200 m/s of orbital velocity on a single jet engine alone. Though making an SSTO version of this would be slightly different looking, it\u0027s a sound base, this craft is able to circumnavigate with plenty of fuel left over.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DUmsUeH.png\u0022 alt=\u0022DUmsUeH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving two rocket engines on an SSTO (It\u0027s really hard to mount one rocket and one jet.. I know..) would make your TWR very high when you need it most (You want to lose as little velocity as possible as you transition to rockets after your jet push.)\u003C/p\u003E\u003Cp\u003EAlso consider lowering your throttle as your IntakeAir gets lower and lower, you should still be able to get some thrust so that your velocity can increase, but since you require less air because of the lower throttle, you won\u0027t flame out. \u003C/p\u003E\u003Cp\u003EAnother advantage to single-engine SSTO Spaceplanes is that if and when you flame out (Everyone flames out accidentally every once in a while) you won\u0027t asymmetrically flame out, so your craft won\u0027t go into a horrible spin. It\u0027ll just spark and continue to eat up fuel until you throttle down and get back in control. My above craft spent about 60-70% of its journey around Kerbin with the engines either entirely off or at about 5-10% throttle.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-13T06:05:22Z","Content":"\n\u003Cp\u003ESpaceplanes are great for one thing: SSTO. They\u0027re light, re-useable, and they consume very little fuel on the ascent to orbit. However, because so much of their design is dependent on atmosphere for them to benefit at the cost of other things like weight, they are not great for landing on and returning from the mun, sorry. It doesn\u0027t mean it can\u0027t be done--it can, but it would be very very difficult and inefficient.\u003C/p\u003E\u003Cp\u003EThe bets tips I can suggest are to think light, shed all unnecessary weight, minimize your engine count--you\u0027ll want 3 for best symmetry--, use a lot of air intakes (2 per engine is a good start, no need to spam them), and use rocket fuel instead of jet fuel (jet engines can burn it, leaving only some leftover oxidizer. this saves the weight of carrying a jet fuel tank, and also means you won\u0027t have extra jet fuel left over you can\u0027t use in orbit)\u003C/p\u003E\u003Cp\u003EFor very small spaceplanes, 1 jet engine and 2 small rockets will do. For large ones, I might suggest 2 jet engines and 1 big rocket, or a nuclear one if you can swing it for those long trips.\u003C/p\u003E\u003Cp\u003EI recommend only using enough wings to land your plane safely. More adds weight and you don\u0027t need it for powered ascent with an SSTO capable engine configuration, but too little means you can\u0027t slow down enough to land safely without dropping out of the sky.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-05-13T06:14:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003Emoar intakes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a tradeoff. More intakes means more speed at high altitude, but it asymptotes. Meanwhile, more intakes means more mass to haul all the way to the Mun and back. You can calculate how much extra speed you can build on jets by adding an intake, versus how much deltaV you lose to needing to carry the intake. I haven\u0027t, but in practice I find it barely matters at all whether I have more than 6 intakes per jet, and 4 is sufficient to reach orbit.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-05-13T10:03:31Z","Content":"\n\u003Cp\u003ERemember for an SSTO, the only way to increase the dV once in space is a higher wet:dry ratio or better Isp on the engine(s).\u003C/p\u003E\u003Cp\u003ELooking at your pic, I think it\u0027s a big ask to go from LKO on full rocket fuel to Mun surface then orbit again. It\u0027s small and you have a lot of dead weight in 2 cockpits, and some heavy-ish girders. My suggestions would be...\u003C/p\u003E\u003Cp\u003E* Add more rocket tanks, as much as the jets can carry\u003C/p\u003E\u003Cp\u003E* Possibly switch to a single LT-N, using Rockomax 24-77s to augment TWR on ascent as needed.\u003C/p\u003E\u003Cp\u003E* Get rid of the intakes on the girders. Fit them to the backs of the tank there that I see has nothing on it, but facing forward.\u003C/p\u003E\u003Cp\u003E* You may want to ditch a cockpit, but i think with persistence you can keep it a 2 seater\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePsuedoMonkey\u0022 data-cite=\u0022ThePsuedoMonkey\u0022\u003E\u003Cdiv\u003EI\u0027d reconsider use of the aerospike.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, no. You might want to check the math on that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003Emoar intakes\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes that helps. But not everyone is down with that.\u003C/p\u003E\u003Cp\u003EEDIT....\u003C/p\u003E\u003Cp\u003EJust thought i\u0027d add this, it\u0027s an example of mixing Rockomax 24-77s with higher efficiency engines. This is a Stock\u002BMJ VTOL SSTO i built not long ago. For balance reasons it uses 2 LV-909s, but I added 4 24-77s to give it the TWR needed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8388/8679646721_9653eae845_c.jpg\u0022 alt=\u00228679646721_9653eae845_c.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-13T10:09:57Z\u0022 title=\u002205/13/2013 10:09  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 13, 2013\u003C/time\u003E by bsalis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-13T11:24:36Z","Content":"\n\u003Cp\u003EI know a lot of people prefer not to clip that many intakes onto a single ship, but I can get that 130 tonne tanker to orbit still weighing 123 tonnes only using 150m/s of rocket fuel first to kick the apoapsis out then kick the periapsis out after you\u0027ve used up the last scrap of intake air at 69,100m altitude. And since its a sandbox game and its for my own space program, I\u0027m more than happy to do that lol. Although it does take about 45 mins to get all the way to orbit due to air hogging and lags bane for the part count. But,, super efficient and completely reusable !\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-05-13T11:46:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EI know a lot of people prefer not to clip that many intakes onto a single ship, but I can get that 130 tonne tanker to orbit still weighing 123 tonnes only using 150m/s of rocket fuel first to kick the apoapsis out then kick the periapsis out after you\u0027ve used up the last scrap of intake air at 69,100m altitude. And since its a sandbox game and its for my own space program, I\u0027m more than happy to do that lol. Although it does take about 45 mins to get all the way to orbit due to air hogging and lags bane for the part count. But,, super efficient and completely reusable !\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEach to their own. Just be mindful that...\u003C/p\u003E\u003Cp\u003Ea) I highly doubt that using excessive intakes will work so well after the aerodynamic rewrite.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E It\u0027s just not needed. Case in point, Duna return, no refueling, no clipping...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7457/8724946847_57178ec4a0_c.jpg\u0022 alt=\u00228724946847_57178ec4a0_c.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePsuedoMonkey","CreatedById":58589,"CreatedDateTime":"2013-05-13T12:23:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003E-snip-\u003Cp\u003EHmm, no. You might want to check the math on that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy not? A mass ratio of two and only using \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002By%3D390*9.8*ln%28%282*x%2B1.5%29%2F%28x%2B1.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10%2C\u002Bplot\u002By%3D390*9.8*ln%28%282*x%2B0.5%29%2F%28x%2B0.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10\u0022 rel=\u0022external nofollow\u0022\u003Eeither the aerospike or an LV909\u003C/a\u003E, or \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002By%3D390*9.8*ln%28%282*x%2B1.5%29%2F%28x%2B1.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10%2C\u002Bplot\u002By%3D800*9.8*ln%28%282*x%2B2.25%29%2F%28x%2B2.25%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10\u0022 rel=\u0022external nofollow\u0022\u003Eeven an LVN\u003C/a\u003E in space (to go to the Mun, for example) gives a much greater dV. The aerospike does give a better TWR (and of course it\u0027s Isp in atmo) than those two, but I say it\u0027s always worth reconsidering your engines. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-13T12:26:39Z\u0022 title=\u002205/13/2013 12:26  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 13, 2013\u003C/time\u003E by ThePsuedoMonkey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-13T12:35:26Z","Content":"\n\u003Cp\u003EIn that particular instance, in case you didn\u0027t look at the picture, it\u0027s a tanker, so every drop of fuel burned getting to orbit is fuel ill need to bring up in a subsequent launch. (The ship in orbit will already need 8 orange tanks to refuel once it arrives at Laythe)\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-05-13T15:52:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePsuedoMonkey\u0022 data-cite=\u0022ThePsuedoMonkey\u0022\u003E\u003Cdiv\u003EWhy not? A mass ratio of two and only using \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002By%3D390*9.8*ln%28%282*x%2B1.5%29%2F%28x%2B1.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10%2C\u002Bplot\u002By%3D390*9.8*ln%28%282*x%2B0.5%29%2F%28x%2B0.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10\u0022 rel=\u0022external nofollow\u0022\u003Eeither the aerospike or an LV909\u003C/a\u003E, or \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002By%3D390*9.8*ln%28%282*x%2B1.5%29%2F%28x%2B1.5%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10%2C\u002Bplot\u002By%3D800*9.8*ln%28%282*x%2B2.25%29%2F%28x%2B2.25%29%29\u002Bfor\u002Bx%3D0.1\u002Bto\u002Bx%3D10\u0022 rel=\u0022external nofollow\u0022\u003Eeven an LVN\u003C/a\u003E in space (to go to the Mun, for example) gives a much greater dV. The aerospike does give a better TWR (and of course it\u0027s Isp in atmo) than those two, but I say it\u0027s always worth reconsidering your engines. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooking at the aerospike compared to the bell engines only, the better isp in space, still makes the\u003C/p\u003E\u003Cp\u003Eaerospike a better engine for all but the smallest of craft.\u003C/p\u003E\u003Cp\u003E(big pics linked)\u003C/p\u003E\u003Cp\u003EExample 1\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm8.staticflickr.com/7311/8735826688_98f480d943_h.jpg\u0022 rel=\u0022external nofollow\u0022\u003ELV-T30 VAC 4672 m/s\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm8.staticflickr.com/7293/8734706757_6fa53cb493_h.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESpike VAC 4709 m/s\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EExample 2\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm8.staticflickr.com/7282/8735831196_070a4f1bfb_h.jpg\u0022 rel=\u0022external nofollow\u0022\u003ELV-T30 VAC 915 m/s\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm8.staticflickr.com/7293/8734710459_ca22f2eff4_h.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESpike VAC 934 m/s\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo basically the aerospike is still king. Even after the nerf. The next step up is the LT-N if you have an SSTO suiting the weight.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-13T15:57:18Z","Content":"\n\u003Cp\u003EI believe someone else posted in another thread that if you have less than 5 tonnes of fuel per LFO engine the LVN is less efficient than the spike, but more than that and LVN wins out\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-05-13T16:03:12Z","Content":"\n\u003Cp\u003EIf you use a system that abuses air intakes, you can get a stable orbit at ~40km while still having enough air to run your engines at low speeds (I use only 1 to prevent flameout). I managed to, at 55km, have a pe of 55km and an ap of 128 km. I managed to get into orbit using about 20 units of oxidizer after burning at ap. I ended up having more than 2/3 my fuel left.\u003C/p\u003E\n"},{"CreatedByName":"kodack","CreatedById":63937,"CreatedDateTime":"2013-05-13T16:41:45Z","Content":"\n\u003Cp\u003EYour SSTO has un-needed bulk and weight. With SSTO, weight and fuel economy (specific impulse) are your two worst enemies. In my craft I have 2 small rocket fuel tanks into aerospikes, and 1 mk1 fuselage giving fuel to a turbojet engine, and 3 ram air intakes. \u003C/p\u003E\u003Cp\u003EThis is enough for 130km circular orbit with about 1/4 fuel left over. \u003C/p\u003E\u003Cp\u003EYou will need to make the most of your jet assisted boost by making a very shallow climb so that you prioritize speed over altitude. You need that air hitting you fast so the ram air can do it\u0027s job and keep your engine going. You should be able to make it to 21,000 meters and 1400m/s speed at which point you engage the aerospikes to insert into LEO, before your apoapsis you do a stablization burn to insert yourself into orbit and at that point you can do an altitude burn to get up to 130km or so.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lYRWKrMjkQk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-13T16:45:47Z\u0022 title=\u002205/13/2013 04:45  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 13, 2013\u003C/time\u003E by kodack\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-13T16:57:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kodack\u0022 data-cite=\u0022kodack\u0022\u003E\u003Cdiv\u003EYour SSTO has un-needed bulk and weight. With SSTO, weight and fuel economy (specific impulse) are your two worst enemies. In my craft I have 2 small rocket fuel tanks into aerospikes, and 1 mk1 fuselage giving fuel to a turbojet engine, and 3 ram air intakes. \u003Cp\u003EThis is enough for 130km circular orbit with about 1/4 fuel left over. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewith a plane that light you would get more DV with 2 LV909\u0027s rather than aerospikes\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-05-13T18:46:48Z","Content":"\n\u003Cp\u003EFor long distance craft I typically do pairs of jets, and an LV-N for interplanetary maneuvers. The single LV-N should also be able to land you on the Mun if you don\u0027t carry too much else. If your craft is too heavy, you can top off the nuke with some 24-77s for the landing and takeoff.\u003C/p\u003E\u003Cp\u003EThe aerospike is no panacea for spaceplanes. The jets will get your apoapsis up to space. In space, thrust matters little. That means a single LV-909 is better than a single aerospike: same Isp, but lower mass. If you\u0027re going a long way, the extra mass of the LV-N is paid for by its improved Isp. If you\u0027re just circularizing, the 24-77 might be good enough: the Isp sucks, but the mass is miniscule.\u003C/p\u003E\u003Cp\u003EYou don\u0027t need much thrust to land on the Mun: the LV-N should be sufficient for your plane, maybe topped off with a couple of 24-77s in the last 5 seconds of landing and first 5 seconds of liftoff.\u003C/p\u003E\n"},{"CreatedByName":"kodack","CreatedById":63937,"CreatedDateTime":"2013-05-13T20:31:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003Ewith a plane that light you would get more DV with 2 LV909\u0027s rather than aerospikes\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUndoubtedly. I tried a few different rocket engines in designing this and went with aerospikes as much for their average efficiency as their compact proportions which didn\u0027t put my CG too far aft.\u003C/p\u003E\u003Cp\u003EPairs of rockets are the way to go imho. Pairs of jets can be problematic due to the tendency to get into unrecoverable flat spins when one engine cuts out from the other due to low oxygen. I am able to push longer and more reliably with a single jet engine, as a flameout has little impact on my mission, I just switch to aerospikes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-13T20:34:50Z\u0022 title=\u002205/13/2013 08:34  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 13, 2013\u003C/time\u003E by kodack\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-05-13T22:08:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kodack\u0022 data-cite=\u0022kodack\u0022\u003E\u003Cdiv\u003EUndoubtedly. I tried a few different rocket engines in designing this and went with aerospikes as much for their average efficiency as their compact proportions which didn\u0027t put my CG too far aft.\u003Cp\u003EPairs of rockets are the way to go imho. Pairs of jets can be problematic due to the tendency to get into unrecoverable flat spins when one engine cuts out from the other due to low oxygen. I am able to push longer and more reliably with a single jet engine, as a flameout has little impact on my mission, I just switch to aerospikes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why the LV-909 is honestly pretty much my favorite engine in the game..\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-14T02:20:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EEach to their own. Just be mindful that...\u003Cp\u003Ea) I highly doubt that using excessive intakes will work so well after the aerodynamic rewrite.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E It\u0027s just not needed. Case in point, Duna return, no refueling, no clipping...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7457/8724946847_57178ec4a0_c.jpg\u0022 alt=\u00228724946847_57178ec4a0_c.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly hell that\u0027s goddamn impressive. .craft file? I\u0027d really love to get a chance to pick at that ship.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EIn that particular instance, in case you didn\u0027t look at the picture, it\u0027s a tanker, so every drop of fuel burned getting to orbit is fuel ill need to bring up in a subsequent launch. (The ship in orbit will already need 8 orange tanks to refuel once it arrives at Laythe)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t see a link anywhere, but this sounds interesting. more details please? I really like the idea of using air breathing engines to deploy large tankers.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003Ewith a plane that light you would get more DV with 2 LV909\u0027s rather than aerospikes\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELV-909 is superb for light duty, but I honestly rarely find myself using it outside of things like OKVs and ICBMs. Because its thrust is so low, using it to get into orbit or circularize is a real trick, and if I\u0027m not going to be using a stage at all until I get into orbit, I\u0027d just as soon make it an LVN.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027ve never had luck with long-range SSTO unless it involved orbital refueling. In my experience getting anything with that much fuel up high enough requires more than 1 or 2 jet engines, or it lacks the TWR and lift to make it up off the runway. More jet engines means more problems with fuel consumption, air consumption, and flame-outs, not to mention more weight to lug around once you get into space. You can give it more wing, but that also increases dead weight in space. It\u0027s a very difficult balance to strike. Does anyone have any tips for building really big spaceplanes in an efficient manner?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-14T03:01:13Z","Content":"\n\u003Cp\u003EIn this instance, stage the turbojets, double tap G to drop the gear and turn on the landing lights, Stage again to break docking clamps. it launches from the ground as a rule to be able to do it from laythe surface.\u003C/p\u003E\u003Cp\u003Ethrottle to max, fly vertical till 10k, then 45Ã‚Âº right away. follow nav ball marker till your at 30km, then keep your vertical speed at around 40-50m/s. 30-35km is where you pick up most of your speed with this one. once you pass 33km press 2 to shut down 8 of the engines. Again, keeping your vertical speed to a minimum. you want more surface speed still than altitude. Once you pass 38km press 3 to shut down another 8 engine then press 4 or stage to activate the 8 LVN\u0027s. the center jet engine is still active. Only burn the LVN\u0027s until your apoapsis hits 80km (should only take a few moments) then shut them off and keep the center jet on. It will keep giving thrust all the way to 69,100m(cuts out still producing 4.2kN), keeping your apoapsis from dipping and raising your periapsis to approximately 22-25km. As soon as you clear the atmosphere press 1 to shut down the jet engine, circularize with the LVN\u0027s. they will only have burned 1/4 of their available fuel leaving you with 900m/s of dV for orbital maneuvers and de-orbiting.\u003C/p\u003E\u003Cp\u003Ethere should be half a tank on each of the 4 pairs of tanks of jet fuel remaining(300 l out of 1200), and with an empty payload when you de-orbit thats enough to circumnavigate practically if you only run on 8 engines.\u003C/p\u003E\u003Cp\u003EIt fly\u0027s very much like a spaceplane, except its launched vertically. that was by design for precise landings on potentially small islands on Laythe\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/marauder1.jpg\u0022 alt=\u0022marauder1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/marauder2.jpg\u0022 alt=\u0022marauder2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Emods used are KSPX, quantum struts, and MechJeb (i can remove the first two but it really needs mechjeb for the prevent flameout feature)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-14T03:08:23Z\u0022 title=\u002205/14/2013 03:08  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 14, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"}]}