{"TopicId":26594,"ForumId":32,"TopicTitle":"Accidentally ended flight.....I think I lost my space station! Possible to retrieve?","CreatedByName":"Elsig","CreatedById":62731,"CreatedDateTime":"2013-05-12T22:01:50Z","PageNum":1,"Articles":[{"CreatedByName":"Elsig","CreatedById":62731,"CreatedDateTime":"2013-05-12T22:01:50Z","Content":"\n\u003Cp\u003EI\u0027m still fairly new to Kerbal and perhaps this is one of it\u0027s nuisances but I think I just lost my space station! I wondered if it\u0027s possible somehow to retrieve it? (stored in save, cache or anywhere!)\u003C/p\u003E\u003Cp\u003EIn a moment of not thinking I clicked \u0022End Flight\u0022 and then the vehicle assembly building. Now my Space Station is gone! It was in perfect orbit and I\u0027d spent a long time building it. Numerous trips to fill up it\u0027s large fuel tank for future flights to far flung places, a few modules etc.\u003C/p\u003E\u003Cp\u003EI\u0027m very annoyed right now, I guess I have myself to blame but there aren\u0027t too many warnings that you\u0027re flight will be lost....grr....\u003C/p\u003E\u003Cp\u003EHere\u0027s a pic...if you find it please return to me!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i39.tinypic.com/20giaol.png\u0022 alt=\u002220giaol.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SmallChange","CreatedById":3519,"CreatedDateTime":"2013-05-12T22:25:49Z","Content":"\n\u003Cp\u003EBring your game back up and try holding down F9. Since you said it\u0027s a multipart station, I\u0027m sure you have an autosave somewhere along the lines of creating it. I just hope it wasn\u0027t overwritten by another autosave.\u003C/p\u003E\u003Cp\u003EI manually back up my save periodically. You can just copy the save\u0027s folder somewhere else, and copy it back to restore.\u003C/p\u003E\u003Cp\u003E*Edit: PS, I think one of your docking ports is on upside down \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elsig","CreatedById":62731,"CreatedDateTime":"2013-05-12T22:26:25Z","Content":"\n\u003Cp\u003EPanic over!! I had a quick save from a few minutes before i ended the flight. I reloaded that and my space station was back! Pheeeeew!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Didn\u0027t want to start all over again so this was good news.\u003C/p\u003E\n"},{"CreatedByName":"Elsig","CreatedById":62731,"CreatedDateTime":"2013-05-12T22:28:49Z","Content":"\n\u003Cp\u003EThanks SmallChange. Right after I posted this I realized that the autosave might still be there. And it was.....\u003C/p\u003E\u003Cp\u003EPS! Why does my post have to be approved all the time?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-12T22:37:11Z","Content":"\n\u003Cp\u003EDo you have backup copies of your persistent.sfs file? My computer automatically makes backups of files every hour, and there have been occasions where I have saved my ships after some weird physics glitch in KSP by going back to that saved persistence file.\u003C/p\u003E\n"},{"CreatedByName":"Deaf3279","CreatedById":59456,"CreatedDateTime":"2013-05-12T23:11:27Z","Content":"\n\u003Cp\u003EHopeful you didnt F5 since then. Press F9 it should load what you lost. It work for me\u003C/p\u003E\n"},{"CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2013-05-12T23:18:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Elsig\u0022 data-cite=\u0022Elsig\u0022\u003E\u003Cdiv\u003EPS! Why does my post have to be approved all the time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApologies for that, it\u0027s simply an anti-spam measure that we employ. It should cease once you have 3 posts or greater.\u003C/p\u003E\u003Cp\u003ECongrats on recovering your station, by the way.\u003C/p\u003E\n"}]}