{"TopicId":26602,"ForumId":16,"TopicTitle":"RCS Thruster Positioning Tips?","CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-12T22:40:18Z","PageNum":1,"Articles":[{"CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-12T22:40:18Z","Content":"\n\u003Cp\u003EI just had a hell of a time docking one of my pick-up/retrieval/transport vehicles. It\u0027s just a central piece with 3 legs coming off of it with engines on each leg. Docking ports on either side to pick up a piece of a station or piece of equipment etc.\u003C/p\u003E\u003Cp\u003EApparently my thrusters were in a bad spot or something. I have no problem docking it by itself. But I picked up my probe and tried to dock at my space station. When in docking mode whenever I thrust in any direction it basically swung my nose around.\u003C/p\u003E\u003Cp\u003EDo I need to put thrusters on everything, so that if/when I happen to pick it up the game will even out the docking thrust?\u003C/p\u003E\u003Cp\u003EI ended up having to take a couple runs at my station using my main engines, then rotate the station to meet up with it. Took me like 30 minutes for what should have been pretty simple.\u003C/p\u003E\u003Cp\u003ESo any tips on thruster placement?\u003C/p\u003E\n"},{"CreatedByName":"The Wall","CreatedById":63972,"CreatedDateTime":"2013-05-12T22:44:07Z","Content":"\n\u003Cp\u003EYou\u0027ll want your thrusters evenly spaced around your centre of mass for translational movement without causing the craft to spin. This can be thrown out if you burn fuel (and I don\u0027t know a way to make the VAB shift the centre of mass to simulate burned fuel) from the stage you want to dock, or if you dock something with it before going on the dock it with something else. (Since both of these can shift your centre of mass; losing fuel from a high up fuel tank shifts it down, and docking something shifts it towards whatever was just attached.)\u003C/p\u003E\u003Cp\u003EBeyond eyeballing or making sure that stage is full of fuel before needing to dock, I don\u0027t know how to avoid it; the second \u003Cem\u003Ecan\u003C/em\u003E be avoided by finding the centre of mass of the paired units in the VAB and spacing the thrusters around that, if you know they\u0027ll be joined. If you don\u0027t, the only way I know of is to have the thrusters around the centres of mass of each individual craft prior to docking.\u003C/p\u003E\n"},{"CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-12T22:53:34Z","Content":"\n\u003Cp\u003ESo every piece of equipment or vehicle should have thrusters either in the center or evenly spaced on each end?\u003C/p\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2013-05-12T23:09:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dortmunder\u0022 data-cite=\u0022Dortmunder\u0022\u003E\u003Cdiv\u003ESo every piece of equipment or vehicle should have thrusters either in the center or evenly spaced on each end?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but keep in mind that when you dock on to something, the center of mass will change, and so the you want the RCS thrusters positioned that it will be on the opposite side of the vehicle you are docking to, so they are evenly spaced. Find a way to disable the RCS thrusters at the new center after docking to save fuel.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-12T23:28:40Z","Content":"\n\u003Cp\u003EJust keep ASAS on while translating. The ASAS will fight the tendency to pitch/roll/yaw via a combination of reaction wheel \u002B RCS so you can just translate without giving a damn about RCS block placement.\u003C/p\u003E\u003Cp\u003EI always use ASAS for docking, particularly for assembling highly unbalanced bits in space station construction:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://106.imagebam.com/download/r3bFCKKl1ay5NAI9_jj8kg/25278/252771527/screenshot965.jpg\u0022 alt=\u0022screenshot965.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-13T05:48:07Z","Content":"\n\u003Cp\u003EI\u0027m actually planning on working on and submitting a youtube tutorial that covers this subject, probably up in next few days. In the meantime, use these tips:\u003C/p\u003E\u003Cp\u003E1) if your craft is intended for docking (the dock-er, rather than the dock-ee) you should keep that in mind in its overall construction, not just in placement of RCS thrusters.\u003C/p\u003E\u003Cp\u003E2) you want all of your expendable resources (fuel) of each type centered at the ship\u0027s overall center of gravity, or as close to it as possible. This ensures that as you deplete your fuel, the ship\u0027s center of gravity does not shift, and therefore its handlign will not be thrown off. For a cylindrical ship for example, try to place a single fuel tank at the center with an RCS tank on either side, and pick an engine that counterbalances the weight of your command pod and other accessories at the other end. \u003C/p\u003E\u003Cp\u003E3) don\u0027t use 4-way RCS thruster blocks for translation. They give too much spin torque and your SAS system will tend to oversteer, and so will you, resulting ina lot of wobbling and thrashing.\u003C/p\u003E\u003Cp\u003E4) place linear RCS ports in quad symmetry at the ship\u0027s center of gravity (use the center of gravity display option in the VAB) for translation, and more in quad symmetry equidistant from the center above and below for rotation \u002B translation. Place small girder blocks around the center of gravity and use them to mount more RCS ports facing to the front and rear, so you have forward/back translation. For very massive ships you may want to use a couple 4-way RCS thruster blocks around the middle for extra spin torque if you don\u0027t have enough.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003EJust keep ASAS on while translating. The ASAS will fight the tendency to pitch/roll/yaw via a combination of reaction wheel \u002B RCS so you can just translate without giving a damn about RCS block placement\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat or cause it to wobble uncontrollably\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-13T12:31:37Z","Content":"\n\u003Cp\u003EI usualy try to place the RCS-Thrusters at each end of the craft and then disable unnessecary Thrusters once the craft is docked. For smaler crafts that may be unneccessary, but for larger crafts you should do this (unless you donÃ‚Â´t have a problem with burning 2-3 units per second of RCS-Fuel while manuvering) Also do not use ASAS to stabalize larger crafts, as this will create a lot of wobble, burning high amounts of RCS-Fuel, rther try to stop the movment manualy and then let the SAS do the rest.\u003C/p\u003E\n"},{"CreatedByName":"wilt57","CreatedById":64653,"CreatedDateTime":"2013-05-13T13:42:47Z","Content":"\n\u003Cp\u003EI see a lot of people putting multiple sets of four RCS thrusters on their ships. While I\u0027m not docking anything more massive than 44-ish tons (yet) I\u0027ve found that one set of four over the CoM is not only sufficient, but uses less RCS fuel, which means your ships are lighter, which means they requires less thrust to launch, and so on. The trick is to balance your ship. Put the CoM indicator right over your center of fuel, in other words, put the same amount of mass in front of your fuel tank as you do behind. This way, as you use fuel your CoM doesn\u0027t change and your RCS thrusters remain balanced. I take my time though too, so I suppose that\u0027s a factor.\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-13T14:32:51Z","Content":"\n\u003Cp\u003EYes, placing the Thrusters this way is the most efficient way, but placing them at the end of the craft ( I usualy place them in pairs of 2, setting the second pair 90Ã‚Â° off) is a save bet and is more then enough for most medium crafts. For larger crafts I place 4 at each end, and for extreemly large crafts (lÃƒÂ­ke the engine array for my interplanetary spacestation) I place 4 addidtional thrusters in the COM, and only activate the outer ones for docking. For small Crafts like landers I always try to place them in the COM, since it usualy wonÃ‚Â´t change enough to affect your manuverablity.\u003C/p\u003E\n"},{"CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-13T22:48:20Z","Content":"\n\u003Cp\u003EGreat, thanks for the help all.\u003C/p\u003E\u003Cp\u003ETemstar , when you refer to ASAS do you just mean the default ASAS stuff you put on ships? Or do you mean the MechJeb thing? Because whenever I am having trouble docking and I do enable the SAS it pretty much continuously burns fuel, rocking the ship back and forth perpetually.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-13T23:21:57Z","Content":"\n\u003Cp\u003EYes I mean the stock ASAS, yes when you turn it on it will continuously burn fuel. But I never found the consumption in monopropellant to be much of a worry. You should use your main propulsion to get yourself within say 100m of the target before you start translating with RCS, don\u0027t try to close in on your target using RCS from 10km away.\u003C/p\u003E\u003Cp\u003EAlso how much RCS ASAS uses when on depends a lot on the stiffness of the craft. The more wobbly the craft is the more ASAS will use the RCS system to try to counteract the wobble. It\u0027s going to fail horribly and induce harmonic oscillation. So whenever possible you want to stiffen up your spacecraft with struts.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-14T06:44:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dortmunder\u0022 data-cite=\u0022Dortmunder\u0022\u003E\u003Cdiv\u003EGreat, thanks for the help all.\u003Cp\u003ETemstar , when you refer to ASAS do you just mean the default ASAS stuff you put on ships? Or do you mean the MechJeb thing? Because whenever I am having trouble docking and I do enable the SAS it pretty much continuously burns fuel, rocking the ship back and forth perpetually.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can get around this by following my tips above. ASAS wobbling your ship with RCS on (also mechjeb does it too) happens because one of two things:\u003C/p\u003E\u003Cp\u003E1) your ship is way too wobbly, and you\u0027re controlling it from near one end, so the navball flails when the ship wobbles.\u003C/p\u003E\u003Cp\u003E2) your RCS thruster placement is uneven around the ship\u0027s center of gravity, and mechjeb/ASAS is oversteering. This issue is compounded by ship wobble.\u003C/p\u003E\u003Cp\u003EIn either case, if you correct the second problem, the effect will be dramatically reduced. By having linear RCS thrusters placed in perfect balance around the ship, your translation maneuvers won\u0027t cause the ship to turn or wobble, which in turn won\u0027t cause the ASAS to kick into overdrive to try and correct it.\u003C/p\u003E\u003Cp\u003EThe biggest problem in balancing RCS thrusters is that as your fuel depletes, the center of gravity will shift away from the fuel tank and toward the overall center of gravity of the rest of the ship, which means permanently placed RCS thrusters can\u0027t be in the right place all of the time if you\u0027re using them at different levels of fuel.\u003C/p\u003E\u003Cp\u003Eexcept they can: if you design your ship so that the center of gravity of the fuel tank, and the overall center of gravity of the rest of the ship is in the same place, no matter how your fuel changes, you\u0027ll always have your RCS thrusters spot-on and wobble-free.\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-05-14T07:53:49Z","Content":"\n\u003Cp\u003EYou generally need two sets of 4 four-way thruster blocks. this should have at least 4 thrusters fire during any given attitude/translation adjustment. If you have less, you\u0027re likely to encounter dead spots.\u003C/p\u003E\u003Cp\u003EExceptions are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWhen you intend to undock or decouple the ship into two or more ships with independent RCS systems at some point, in which case you should disable all but the outermost thrusters until you separate, to save fuel. Use action groups to do this quickly.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf your ship is a weird shape like a spaceplane. What\u0027s commonly done for spaceplanes is to put one four-way block and one linear port on either wingtip, and four linears around the nose. It should provide two thrusters for yaw, two for roll, three for pitch, two for left/right, two for forwards/backwards, three for up/down.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf you need more RCS power than usual, like an RCS only lander, or a hovering rover. You should use linear ports if they fit in the design, as they have a bit more thrust.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt may be possible to get a full range of motion with one set of 4 four-way thrusters directly in line with the Center of Mass (CoM), such as an Apollo style CSM, but this is difficult.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETry to place the ports as far away from CoM as possible, to maximize torque and therefore efficiency for attitude changes.\u003C/p\u003E\u003Cp\u003EThe two sets of 4 blocks should also be equidistant from your CoM. If not, one side will push more than the other and the attitude will drift. This also causes the ASAS spazzing out when RCS is on. It\u0027s possible to get the alignment exactly right in the VAB, but your CoM will gradually change in-flight as fuel is burned. This could theoretically be fixed with an RCS balancer, a system that would vary the thrust to each thruster to prevent drift, but an official one is not implemented (yet). \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12384-PLUGIN-PART-0-19-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-0-1\u0022 rel=\u0022external nofollow\u0022\u003EMechJeb 2\u003C/a\u003E has an experimental one, however, if you want to try that.\u003C/p\u003E\u003Cp\u003EIf you\u0027re not sure if it will have dead spots or not, put it on the launchpad, hit each adjustment, and see if thrusters are firing as intended.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-14T07:57:42Z\u0022 title=\u002205/14/2013 07:57  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 14, 2013\u003C/time\u003E by ThatBum\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-14T08:26:15Z","Content":"\n\u003Cp\u003EI think he refers to the Stock ASAS. The larger and more \u0022wobbly\u0022 your ship is, the less useful ASAS becomes for docking. Most of the time it will just try to compensate for the wobble of your ship and do nothing usefull for docking. If this is the case, I usualy leave it of, only using it to align myself properly.\u003C/p\u003E\u003Cp\u003EEdit: didnÃ‚Â´t see the second page *facepalm*\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-14T08:32:11Z","Content":"\n\u003Cp\u003EI find that a lot of the \u0022Shove the pods around the center\u0022 does work but it\u0027s not that efficient when docking. I tend to put a ring of the Place anywhere thrusters around the Centre of Mass for translation and then a single ring off centre for rotation and make that ring of quads toggle so that when I use the translation thrusters it doesn\u0027t push me off my line. Check out my tutorial at \u003Ca href=\u0022How-To-Balance-RCS-On-Your-Payload\u0022 rel=\u0022external nofollow\u0022\u003EHow-To-Balance-RCS-On-Your-Payload\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003EI wish there was a dedicated RCS balancing tool but that is the closest I got...\u003C/p\u003E\n"},{"CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-20T00:32:03Z","Content":"\n\u003Cp\u003EThanks for the posts all.\u003C/p\u003E\u003Cp\u003ENeo, your link doesn\u0027t work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-20T04:34:54Z","Content":"\n\u003Cp\u003EAlso see this thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29766-video-guide-to-RCS-design-maneuvering-and-orbital-rendezvous\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/29766-video-guide-to-RCS-design-maneuvering-and-orbital-rendezvous\u003C/a\u003E since I uploaded my video guide the other night.\u003C/p\u003E\n"}]}