{"TopicId":26651,"ForumId":16,"TopicTitle":"Mechjeb: Geostationary Orbit at Different Longitudes","CreatedByName":"Dacker","CreatedById":65530,"CreatedDateTime":"2013-05-13T08:16:07Z","PageNum":1,"Articles":[{"CreatedByName":"Dacker","CreatedById":65530,"CreatedDateTime":"2013-05-13T08:16:07Z","Content":"\n\u003Cp\u003EEither my Google skills are weakening, or I\u0027m missing something blindingly obvious...but how do I put satellites in geostationary orbits at different longitudes using Mechjeb?\u003C/p\u003E\u003Cp\u003EI\u0027d like to put four satellites in geostationary orbit, at 90 degrees from one another. I launched the first one and it is parked directly above KSC. How do I put the other ones at different longitudes?\u003C/p\u003E\u003Cp\u003EAfter I do it with Mechjeb I am going to practice doing it without it, too, but for now I just can\u0027t figure out how to do it in Mechjeb.\u003C/p\u003E\u003Cp\u003E-Dacker\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-13T15:11:17Z","Content":"\n\u003Cp\u003EIf you go straight to geostationary from KSC with the same rocket and ascent trajectory, you\u0027ll always end up in GSO at the same \u0022launch phase angle\u0022 relative to KSC. To end up at different longitudes, the easiest way is probably to launch to a lower-altitude parking orbit first. Then plan out the transfer from parking orbit to GSO after waiting a bit in the parking orbit. If you set your first satellite as target, then the \u0022target position at intercept\u0022 markers might help you figure out the difference in angle when you get to GSO altitude. This is pretty much a manual process, I can\u0027t think of any great way to do it with MechJeb. You could do some math to figure out a specific target parking orbit altitude that would give you some convenient number of orbits before doing the transfer, but any intermediate altitude will work for some fractional number of parking orbits...\u003C/p\u003E\n"},{"CreatedByName":"Read have Read","CreatedById":60863,"CreatedDateTime":"2013-05-13T22:13:43Z","Content":"\n\u003Cp\u003EYou want to do something similar to a rendezvous but going away from the target instead. So pick an orbit that isnt 2,868Km and your surface speed will change: you\u0027ll slide it back relative to the surface if you are at 3Mm and you\u0027ll slide it along the equator at 2Mn, or 2,800, ect.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-13T22:20:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Read have Read\u0022 data-cite=\u0022Read have Read\u0022\u003E\u003Cdiv\u003EYou want to do something similar to a rendezvous but going away from the target instead. So pick an orbit that isnt 2,868Km and your surface speed will change: you\u0027ll slide it back relative to the surface if you are at 3Mm and you\u0027ll slide it along the equator at 2Mn, or 2,800, ect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically this. You\u0027ll want to perform a \u0022rendezvous\u0022 with the orbit of the first craft at a point where it will be 90 degrees away from the second one. You can use the targeting system and the maneuver nodes to set this up just like you would for a docking approach, but instead of getting the two encounter arrows lined up, you\u0027ll want them at the appropriate angle (or \u0022right angle\u0022 -- excuse the bad pun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ) relative to one another.\u003C/p\u003E\n"},{"CreatedByName":"Silicon014","CreatedById":39039,"CreatedDateTime":"2013-05-13T23:11:05Z","Content":"\n\u003Cp\u003EIf you take the period of the geostationary orbit, then multiply it by either 3/4 or 1 and 1/4, it will progress or digress your orbit by 90 degrees. How to do this is for you to get into a 2868km circular orbit, then burn prograde until the period is 7.5 hours or retrograde until the period is 4.5 hours\u003C/p\u003E\n"},{"CreatedByName":"lodestar","CreatedById":101720,"CreatedDateTime":"2014-01-26T18:47:18Z","Content":"\n\u003Cp\u003EI got to this topic and others while searching for a method. I found the manual methods outlined here quite time consuming and error prone, so eventually I figured a method for placing multiple satellites at different longitudes of the same orbit using Mechjeb, with no manual corrections or timing.\u003C/p\u003E\u003Cp\u003E1. Launch your first satellite and get it to the desired orbit. For example, let\u0027s use the the geostationary orbit, 2868.75. km\u003C/p\u003E\u003Cp\u003E2. After you get your orbit right, go to the Mechjeb maneuver planner and create a maneuver node to reduce your orbital period by 1/n, where n is the number of satellites you need. So, if you\u0027re launching 3 satellites, use 2/3; 4 satellites, 3/4; etc. \u003Cstrong\u003EDon\u0027t execute the maneuver!\u003C/strong\u003E Just create it. Take note of the final periapsis of the planned maneuver. In our example, let\u0027s say we\u0027re launching 3 satellites, so it\u0027s 1225.5 km.\u003C/p\u003E\u003Cp\u003E3. Get your second satellite on the launching pad, target your first satellite and launch to orbit you took note, with the matching planes option. Wait for the circularization burn to finish and activate Mechjeb rendezvous autopilot. Wait until it performs the Hohmman transfer and disengage. At this point, your apoapsis should be at the desired final orbit, your periapsis at the transfer orbit, making it a resonant orbit with the fraction of the period we need, and the first satellite should be very close, at a 0Ã‚Âº phase angle. In our example, every orbit we complete will take us 120Ã‚Âº away from the first satellite on the next apoapsis pass.\u003C/p\u003E\u003Cp\u003E4. As soon as you\u0027re past the apoapsis, create a maneuver node to circularize the orbit at the next apoapsis. Once that\u0027s done, your phase angle to the first satellite should be exactly what you needed. Fine tune everything if you need to. I usually get all their semi-major axis to exactly the same by fine tuning the orbit with RCS, and this is enough to keep their relative positionstable for quite a long time.\u003C/p\u003E\u003Cp\u003E5. Go back to 3 and repeat for the other satellites, either using the previously launched satellite as target, or using the first satellite and going through a full orbit as many times as needed.\u003C/p\u003E\u003Cp\u003EThis method also works very well when you want to get many small satellites in the same orbit on a single launch. Get the launcher to the ressonant orbit and every time you pass the apoapsis, drop a satellite, switch to it and circularize. As a matter of fact, I figured this method first, and start using the other method outlined above when I had large satellites that could be launched only one at a time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T00:41:02Z\u0022 title=\u002201/29/2014 12:41  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by lodestar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rockbloodystar","CreatedById":59828,"CreatedDateTime":"2014-01-28T17:48:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lodestar\u0022 data-cite=\u0022lodestar\u0022\u003E\u003Cdiv\u003EI got to this topic and others while searching for a method. I found the manual methods outlined here quite time consuming and error prone, so eventually I figured a method for placing multiple satellites at different longitudes of the same orbit using Mechjeb, with no manual corrections or timing.\u003Cp\u003E1. Launch your first satellite and get it to the desired orbit. For example, let\u0027s use the the geostationary orbit, 2868.75. km\u003C/p\u003E\u003Cp\u003E2. After you get your orbit right, go to the Mechjeb maneuver planner and create a maneuver node to reduce your orbital period based on the number of satellites you need. So, if you\u0027re launching 3 satellites, use 2/3; 4 satellites, 3/4; etc. \u003Cstrong\u003EDon\u0027t execute the maneuver!\u003C/strong\u003E Just create it. Take note of the final periapsis of the planned maneuver. In our example, let\u0027s say we\u0027re launching 3 satellites, so it\u0027s 1225.5 km.\u003C/p\u003E\u003Cp\u003E3. Get your second satellite on the launching pad, target your first satellite and launch to orbit you took note, with the matching planes option. Wait for the circularization burn to finish and activate Mechjeb rendezvous autopilot. Wait until it performs the Hohmman transfer and disengage. At this point, your apoapsis should be at the desired final orbit, your periapsis at the transfer orbit, making it a resonant orbit with the fraction of the period we need, and the first satellite should be very close, at a 0Ã‚Âº phase angle. In our example, every orbit we complete will take us 120Ã‚Âº away from the first satellite on the next apoapsis pass.\u003C/p\u003E\u003Cp\u003E4. As soon as you\u0027re past the apoapsis, create a maneuver node to circularize the orbit at the next apoapsis. Once that\u0027s done, your phase angle to the first satellite should be exactly what you needed. Fine tune everything if you need to. I usually get all their semi-major axis to exactly the same by fine tuning the orbit with RCS, and this is enough to keep their relative positionstable for quite a long time.\u003C/p\u003E\u003Cp\u003E5. Go back to 3 and repeat for the other satellites, either using the previously launched satellite as target, or using the first satellite and going through a full orbit as many times as needed.\u003C/p\u003E\u003Cp\u003EThis method also works very well when you want to get many small satellites in the same orbit on a single launch. Get the launcher to the ressonant orbit and every time you pass the apoapsis, drop a satellite, switch to it and circularize. As a matter of fact, I figured this method first, and start using the other method outlined above when I had large satellites that could be launched only one at a time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFanbloodytastic! \u003C/p\u003E\u003Cp\u003ENow to combine that with Molnya and I\u0027ll jhave the weather forcast I\u0027ve always wanted.\u003C/p\u003E\n"},{"CreatedByName":"wmheric","CreatedById":101012,"CreatedDateTime":"2014-01-28T18:13:33Z","Content":"\n\u003Cp\u003Elodestar has a nice procedure above on how to do it with a probe carrying all the satellites in one single mission. For a 3-satellite configuration using a 4-hr transfer orbit, 1225.553 km is the number to go; for a 4-satellite configuration...\u003C/p\u003E\u003Cp\u003EA short answer:\u003C/p\u003E\u003Cp\u003EIf you\u0027re using a 4.5-hour transfer orbit, 1658.030 km is the altitude you\u0027re looking for.\u003C/p\u003E\u003Cp\u003EA long answer:\u003C/p\u003E\u003Cp\u003EYou need Kepler\u0027s Third Law, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66952-Orbital-Mechanics-Kepler-s-Third-Law-Launching-Several-ComSats-in-One-Mission\u0022 rel=\u0022external nofollow\u0022\u003EI wrote a tutorial to explain it\u003C/a\u003E. Yes it is quite long, but I hope that by the end you will know how to do the same thing with any configuration around any planet, because you understand the principle.\u003C/p\u003E\u003Cp\u003EIf you\u0027re launching them one by one, you can do the \u0022rendezvous\u0022 thing mentioned above because now you have the closest approach markers.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"lodestar","CreatedById":101720,"CreatedDateTime":"2014-01-29T00:36:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rockbloodystar\u0022 data-cite=\u0022rockbloodystar\u0022\u003E\u003Cdiv\u003EFanbloodytastic! \u003Cp\u003ENow to combine that with Molnya and I\u0027ll jhave the weather forcast I\u0027ve always wanted.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. I think to get the satellites in sync on a Molnya orbit you\u0027d just do the reverse, instead of parking on an eccentric orbit and circularize, you park on a circular and go to the Molnya orbit, although you\u0027d probably won\u0027t be able to get the exact fraction you need on a single pass if your orbit is highly eccentric.\u003C/p\u003E\n"},{"CreatedByName":"lodestar","CreatedById":101720,"CreatedDateTime":"2014-01-29T00:46:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wmheric\u0022 data-cite=\u0022wmheric\u0022\u003E\u003Cdiv\u003Elodestar has a nice procedure above on how to do it with a probe carrying all the satellites in one single mission. For a 3-satellite configuration using a 4-hr transfer orbit, 1225.553 km is the number to go; for a 4-satellite configuration...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, you can calculate the orbital periods before the launch if you\u0027re carrying many satellites in one single mission, but I tried to keep things simple to follow in a step-by-step basis. I noticed there were many explanations on how to do it, and a very detailed explanation in your tutorial, but no step by step method that simply works every time.\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2014-01-29T03:32:49Z","Content":"\n\u003Cp\u003Esimple way... set Ap near geosync orbit altitude, and pe arround 74~90.000m\u003C/p\u003E\u003Cp\u003Ewait for the Ap point stay above or near the place you want... and circularize orbit to a geosync configuration at this point...\u003C/p\u003E\n"},{"CreatedByName":"bk2w","CreatedById":99893,"CreatedDateTime":"2014-01-29T23:30:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022luizopiloto\u0022 data-cite=\u0022luizopiloto\u0022\u003E\u003Cdiv\u003Esimple way... set Ap near geosync orbit altitude, and pe arround 74~90.000m\u003Cp\u003Ewait for the Ap point stay above or near the place you want... and circularize orbit to a geosync configuration at this point...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve recently been using a more analytic version of this, assisted by MechJeb, that lets me put a satellite in a circular synchronous orbit above a desired location on Kerbin in a short amount of time. I can do this by launching into a very carefully chosen parking orbit, waiting for one orbit, then circularizing. For most of my launchers, this means a launch to set my initial apoapsis, one burn to insert into the parking orbit, and one burn to insert into the final orbit.\u003C/p\u003E\u003Cp\u003E- Determine the longitude you\u0027d like the satellite to be above, note this as \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_longitude\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Launch the spacecraft to an apoapsis of 2868.75 km; this is the altitude for synchronous circular orbit, and we\u0027ll call it \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_apside\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Determine the surface longitude of the \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_apside\u003C/span\u003E. At the moment, I quicksave then warp to apoapsis and examine the \u0022Surface Info\u0022 from MechJeb. Note this as \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_longitude\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Calculate the offset of longitudes, \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Eoffset_longitude = starting_longitude - target_longitude\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Since Kerbin rotates 360 degrees in 6 hours, we want to change our orbital period to be \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_period = 6 hours * (offset_longitude/360 \u002B N)\u003C/span\u003E, with N being 0, 1, 2, or some other positive integer.\u003C/p\u003E\u003Cp\u003E- Calculate a new semi-major axis: \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_sma = cuberoot(kerbin_gravitational_parameter * target_period^2 / (4 * pi^2) )\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Calculate a new apside: \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_apside = 2*(target_sma - kerbin_radius) - starting_apside\u003C/span\u003E. If the target apside is less than 100km, we need to increase N and pick a new target period.\u003C/p\u003E\u003Cp\u003E- Reload the quick save, and command MechJeb to change the periapsis or apoapsis to \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_apside\u003C/span\u003E at the next apoapsis. Change periapsis if \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_apside\u003C/span\u003E is less than \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_apside\u003C/span\u003E, and change apoapsis if \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_apside\u003C/span\u003E is greater than \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_apside\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E- Execute, and we\u0027ll be in the parking orbit.\u003C/p\u003E\u003Cp\u003E- Wait a full orbit of the satellite, and Kerbin should rotate to put our \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Etarget_longitude\u003C/span\u003E right underneath.\u003C/p\u003E\u003Cp\u003E- Command MechJeb to circularize at the \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003Estarting_apside\u003C/span\u003E, and execute. This should leave us on a nearly synchronous orbit very closely above our desired target.\u003C/p\u003E\u003Cp\u003E- If needed, carefully burn prograde or retrograde to get the orbital period as close to 6 hours as possible.\u003C/p\u003E\u003Cp\u003EI\u0027ve been able to use this technique to reliably put a satellite to within 1 degree of longitude over KSC, or whatever longitude I want, usually in less than 12 hours after launch.\u003C/p\u003E\u003Cp\u003EHopefully I can get this kind of maneuver integrated into Mechjeb, as I find it very useful for establishing a particular satellite constellation. Now if only we had a good way of directly changing the longitude of the ascending node, then we could easily establish some of the really complex \u003Ca href=\u0022https://en.wikipedia.org/wiki/Satellite_constellation#Walker_Constellation\u0022 rel=\u0022external nofollow\u0022\u003EWalker constellations\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E-Brian\u003C/p\u003E\n"},{"CreatedByName":"Furious1964","CreatedById":113005,"CreatedDateTime":"2014-07-08T14:42:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lodestar\u0022 data-cite=\u0022lodestar\u0022\u003E\u003Cdiv\u003EI got to this topic and others while searching for a method. I found the manual methods outlined here quite time consuming and error prone, so eventually I figured a method for placing multiple satellites at different longitudes of the same orbit using Mechjeb, with no manual corrections or timing.\u003Cp\u003E1. Launch your first satellite and get it to the desired orbit. For example, let\u0027s use the the geostationary orbit, 2868.75. km\u003C/p\u003E\u003Cp\u003E2. After you get your orbit right, go to the Mechjeb maneuver planner and create a maneuver node to reduce your orbital period by 1/n, where n is the number of satellites you need. So, if you\u0027re launching 3 satellites, use 2/3; 4 satellites, 3/4; etc. \u003Cstrong\u003EDon\u0027t execute the maneuver!\u003C/strong\u003E Just create it. Take note of the final periapsis of the planned maneuver. In our example, let\u0027s say we\u0027re launching 3 satellites, so it\u0027s 1225.5 km.\u003C/p\u003E\u003Cp\u003E3. Get your second satellite on the launching pad, target your first satellite and launch to orbit you took note, with the matching planes option. Wait for the circularization burn to finish and activate Mechjeb rendezvous autopilot. Wait until it performs the Hohmman transfer and disengage. At this point, your apoapsis should be at the desired final orbit, your periapsis at the transfer orbit, making it a resonant orbit with the fraction of the period we need, and the first satellite should be very close, at a 0Ã‚Âº phase angle. In our example, every orbit we complete will take us 120Ã‚Âº away from the first satellite on the next apoapsis pass.\u003C/p\u003E\u003Cp\u003E4. As soon as you\u0027re past the apoapsis, create a maneuver node to circularize the orbit at the next apoapsis. Once that\u0027s done, your phase angle to the first satellite should be exactly what you needed. Fine tune everything if you need to. I usually get all their semi-major axis to exactly the same by fine tuning the orbit with RCS, and this is enough to keep their relative positionstable for quite a long time.\u003C/p\u003E\u003Cp\u003E5. Go back to 3 and repeat for the other satellites, either using the previously launched satellite as target, or using the first satellite and going through a full orbit as many times as needed.\u003C/p\u003E\u003Cp\u003EThis method also works very well when you want to get many small satellites in the same orbit on a single launch. Get the launcher to the ressonant orbit and every time you pass the apoapsis, drop a satellite, switch to it and circularize. As a matter of fact, I figured this method first, and start using the other method outlined above when I had large satellites that could be launched only one at a time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you create a video of this please? Having a little trouble doing this at the Hohmman transfer part.\u003C/p\u003E\u003Cp\u003ENever mind, figured out the problem.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T19:44:44Z\u0022 title=\u002207/08/2014 07:44  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by Furious1964\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-11-18T01:27:31Z","Content":"\n\u003Cp\u003ESomeone on here used to have a link to a simple tutorial/guide/video for this in his sig line...nut it was back in 0.23.5 I last saw it. :/It was quite easy also IIRC...now that I need it, I can\u0027t find it.\u003C/p\u003E\u003Cp\u003EEdit: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/21433-Tutorial-Geostationary-Orbit-Constellations-for-Dummies-MechJeb\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E may prove useful, and is what I was talking about above.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-18T16:29:58Z\u0022 title=\u002211/18/2014 04:29  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 18, 2014\u003C/time\u003E by Einarr\u003C/strong\u003E\n\u003C/span\u003E\n"}]}