{"TopicId":26679,"ForumId":44,"TopicTitle":"Humanity destroying a Type III civilization","CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-05-13T15:11:50Z","PageNum":1,"Articles":[{"CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-05-13T15:11:50Z","Content":"\n\u003Cp\u003EEven though you have a good understanding of the kardashev scale I highly recommend you read through this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/aliens.php#id--Technology_Level\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/aliens.php#id--Technology_Level\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow you should have an understanding about scale between type I and III civilizations. You should also have noticed how they compare the relations between a type I and a type III to the one of humanity and ants. We would know of each others existence they would treat us as we treat ants. You could imagine a civilization that we compared to would be like amoebas and neither of us would even notice each other.\u003C/p\u003E\u003Cp\u003EBut Imagine this situation:\u003C/p\u003E\u003Cp\u003EA bacteria lives in a random gletscher somewhere on the north pool. They have just been hibernating, cultivating very slowly... Until a research team arrives, looking for possible oil sources. They begin to drill and in the process some of the bacteria are released on to the surface. I man steps on these bacteria taking some with him and goes into shelter. Here he spreads the bacteria so that almost every one gets. The peoples immune systems quickly fights the bacteria but one of the scientists gets the bacteria somewhere where the immunesystem can\u0027t get them. Here they find lots and lots of nutritions and begin cultivating exponentially. They even begin to mutate to fit this new environment. After a month the bacteria have spread to the entire body until the scientist are called home. When he comes home the bacteria has already evolved so much that it spreads to other people while being able to fight there immunesystem. Soon the scientist begins to feel deprivation of nutrition and gets sick. In the beginning it\u0027s just a cold but after a few months his vital organs begin to fail and he dies. Be this time thousands of people have already been infected. Soon they also begin to get symptoms, slowly dying. First it\u0027s 10, then 100, 1000, 100000. The government sees a pattern begins to track down the source. After a month they discover the bacteria and begins to look for a cure. But by this time over a million has already been infected. They try to develop a vaccination but the bacteria has become to resistant to most medicins... I think you get the idea.\u003C/p\u003E\u003Cp\u003ENow take this scenario and put in a sci-fi world:\u003C/p\u003E\u003Cp\u003EA type III civilization with ships the size of stars come to the milky way to find new energy sources. They make a halt only a few light years from earth. The humans send some recon ships to one of these strange objects. The ships try to move closer but most of them are destroy by a sensor sweep that uses gamma radiation. But some of the ships manage to get it. All though they can\u0027t penetrate the hull they get a lot of technology just examining it. They get ready to leave but suddenly the object moves for some unknown reason. The alien ship is actually returning to it\u0027s mothership to return samples but the humans doesn\u0027t know that. They are now trapped on the mothership but the aliens haven\u0027t even noticed them. After generations the aliens begins to travel back to there home galaxy. By this time the humans have spread all over the ship, gathering technology. When the aliens get home the humans have built many ships so they travel to other of these objects but the are still so small the aliens haven\u0027t noticed them. After 1000 years the alien ship begins to get malfunctions is many of there parts are destroyed or missing but it\u0027s nothing serious but after 100000 years the ship has been almost completely striped of it\u0027s vital parts and the ship gets destroyed but the humans and they have already spread to many other similar objects as the one they were on. Many of the alien ships begins to get destroyed and the higher authorities begin to act. They build up a defense against them but the humans sees them as a hostile race. With there new technology and there familiarity with theres they quickly find a way to counter it... etc.\u003C/p\u003E\u003Cp\u003ECould I have your words on my thought \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-05-13T17:04:01Z","Content":"\n\u003Cp\u003EA couple years later... United States Patent Office....\u003C/p\u003E\u003Cp\u003EWorker: And, for your reverse engineered gamma-ray sweeper thingy, is patent No. 135,827,772,249,083,872,785. We have so much inventions that get reverse engineered nowadays.....\u003C/p\u003E\n"},{"CreatedByName":"Brenok","CreatedById":49609,"CreatedDateTime":"2013-05-13T17:45:36Z","Content":"\n\u003Cp\u003EYou\u0027re assuming a super-advanced civilization can\u0027t bother to do a decent detection system. It\u0027s like if you sent a US carrier to investigate a subsaharian tribe and all of a sudden they can make nuclear weapons based on the carrier reactor and destroy the United States. It sounds ridiculous.\u003C/p\u003E\u003Cp\u003EEdit: one more thing: the problem with the body metaphore is that on a large scale, a immune system would probably more efficient. The antibodies in our blood are mere proteins with no consciousness. An advanced spaceship would probably have artificial intelligence, or commanded by robots with artificial intelligence and/or biological beings.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-13T17:54:30Z\u0022 title=\u002205/13/2013 05:54  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 13, 2013\u003C/time\u003E by Brenok\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-05-13T17:53:52Z","Content":"\n\u003Cp\u003EVery interesting, would make a good movie. It would have to be a massive ship for the Aliens not to notice the humans.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-13T22:19:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brenok\u0022 data-cite=\u0022Brenok\u0022\u003E\u003Cdiv\u003EYou\u0027re assuming a super-advanced civilization can\u0027t bother to do a decent detection system. It\u0027s like if you sent a US carrier to investigate a subsaharian tribe and all of a sudden they can make nuclear weapons based on the carrier reactor and destroy the United States. It sounds ridiculous.\u003Cp\u003EEdit: one more thing: the problem with the body metaphore is that on a large scale, a immune system would probably more efficient. The antibodies in our blood are mere proteins with no consciousness. An advanced spaceship would probably have artificial intelligence, or commanded by robots with artificial intelligence and/or biological beings.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s fun is that the \u0022immune system\u0022 of a Type 3 could be as intelligent, or more intelligent, than us. We could talk to an \u0022extraterrestrial civilisation\u0022, only to find it to be an immune response by the Type 3.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-14T03:27:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EWhat\u0027s fun is that the \u0022immune system\u0022 of a Type 3 could be as intelligent, or more intelligent, than us. We could talk to an \u0022extraterrestrial civilisation\u0022, only to find it to be an immune response by the Type 3.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe best analogy to an \u0022immune system\u0022 for an human civilization would be the army and police and they are intelligent. \u003C/p\u003E\u003Cp\u003EOn the other hand if you have access to advanced technology its possible to catch up at least to some degree, taking the ship back to earth would be the smartest as you would be able to study it in details.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-14T13:15:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EWhat\u0027s fun is that the \u0022immune system\u0022 of a Type 3 could be as intelligent, or more intelligent, than us. We could talk to an \u0022extraterrestrial civilisation\u0022, only to find it to be an immune response by the Type 3.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/aliens.php#id--Technology_Level\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/aliens.php#id--Technology_Level\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022David Given\u0022 data-cite=\u0022David Given\u0022\u003E\u003Cdiv\u003EI can picture the ships entering a system, making contact with a highly advanced civilization, some skirmishing, diplomacy, etc. leading to a treaty and peaceful relations --- and then the invading civilization discovers that it\u0027s actually been dealing with the god\u0027s non-sentient (on the god\u0027s scale) immune system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nyrath\u0022 data-cite=\u0022Nyrath\u0022\u003E\u003Cdiv\u003EIn more detail: The Terran Empire might encounter an advance alien civilization, and engage in trade or battle with them. Only later they may discover that the \u0022alien civilization\u0022 is the cosmic equivalent of a hyper-advanced entity\u0027s immune system. The entity would probably never become aware of the Terran Empire, much as you are never aware of the many tiny infections that are quietly taken care of by your immune system. The members of the \u0022alien civilization\u0022 might be intelligent, but they are as unintelligent compared to the hyper-entity as your white corpuscles are compared to you.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Aladran","CreatedById":2055,"CreatedDateTime":"2013-05-14T14:02:06Z","Content":"\n\u003Cp\u003EHummm a Type III Civ, could be condidered as gods compared to us, and even more.\u003C/p\u003E\u003Cp\u003EHarnessing the whole power of a Galaxy!\u003C/p\u003E\u003Cp\u003EWhat would you do with that much power.\u003C/p\u003E\u003Cp\u003EAnd us, with our only planet, not even at Type 1, no match, completely.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-05-14T14:34:38Z","Content":"\n\u003Cp\u003EIt would be awesome if we where a Type V civilization. Type III? Easy, we would render them extinct in minute.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-14T15:53:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aladran\u0022 data-cite=\u0022Aladran\u0022\u003E\u003Cdiv\u003EHummm a Type III Civ, could be condidered as gods compared to us, and even more.\u003Cp\u003EHarnessing the whole power of a Galaxy!\u003C/p\u003E\u003Cp\u003EWhat would you do with that much power.\u003C/p\u003E\u003Cp\u003EAnd us, with our only planet, not even at Type 1, no match, completely.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERun a big computer.\u003C/p\u003E\n"},{"CreatedByName":"xclusiv8","CreatedById":20567,"CreatedDateTime":"2013-05-15T20:30:07Z","Content":"\n\u003Cp\u003EI\u0027ve always found that scale ridicules. Why would a type 3 civilization not recognise another intelligent species? Why might not be as intelligent as them but they must have been in our place, they probably would have high moral standards and would treat life as something delicate.\u003C/p\u003E\n"},{"CreatedByName":"LeonG17","CreatedById":65024,"CreatedDateTime":"2013-05-15T20:48:27Z","Content":"\n\u003Cp\u003EDo we have the same regards to ants?\u003C/p\u003E\u003Cp\u003ECompared to us the ants are insignificant and we don\u0027t treat their life as something delicate, we would destroy their nests to suit our needs. This is because we have evolved above them and we feel like we have the right to do what we want with them as a result.\u003C/p\u003E\u003Cp\u003EThe type III civilisation would have the same regard to us.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-05-15T21:14:19Z","Content":"\n\u003Cp\u003EI disagree with this greatly.\u003C/p\u003E\u003Cp\u003E1. A type III civilization would be able to detect life on a planet, no matter how small. As humans we can detect little bacteria already. Heck, we can even get a glimpse of the smallest particles in the universe.\u003C/p\u003E\u003Cp\u003E2. A type III would most likely have automatic protocols on it\u0027s ship to detect intruders and to repair itself. We already have check engine lights in cars, and we are a type 0.\u003C/p\u003E\u003Cp\u003E3. Smart people don\u0027t kill ants for fun, at least not usually or on purpose. I know I certainly do not. Also it\u0027s not like we are destroying the entire ant species. To say we don\u0027t treat their lives as something delicate is also wrong as it can cause issues in our ecosystem. It\u0027s why we have laws about killing certain animals and such. A type III would probably be even more aware of this then we are.\u003C/p\u003E\u003Cp\u003E4. Earth resources is not rare. This seems to be a huge misconception due to movies. A type III wouldn\u0027t have any issues getting resources from a planet with no life.\u003C/p\u003E\u003Cp\u003E5. A type III is very unlikely to be hostile. What reason would they have to be hostile toward us? Now, if we ever happened to get in a war with a type III, for what ever reason, we would be killed. It would be like a 30 second war.\u003C/p\u003E\u003Cp\u003E6. The biggest issue with the whole thing is the comparison of humans to bacteria.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-05-16T00:11:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LeonG17\u0022 data-cite=\u0022LeonG17\u0022\u003E\u003Cdiv\u003EDo we have the same regards to ants?\u003Cp\u003ECompared to us the ants are insignificant and we don\u0027t treat their life as something delicate, we would destroy their nests to suit our needs. This is because we have evolved above them and we feel like we have the right to do what we want with them as a result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe haven\u0027t evolved above ants. They are just another solution to the problem of survival on Earth. Since they\u0027ve been around much longer than humans, their solution is tried and tested to a greater degree, and can be considered more successful.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-16T00:23:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003E2. A type III would most likely have automatic protocols on it\u0027s ship to detect intruders and to repair itself. We already have check engine lights in cars, and we are a type 0.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but if you roll down your automobile window and a stray \u003Cem\u003EEpulopiscium fishelsoni\u003C/em\u003E bacterial floated in, your automobile will not tell you. Why? Because you really couldn\u0027t care less.\u003C/p\u003E\u003Cp\u003EThe only time you are likely to care is if, say, you notice the foul odor coming from the month-old used hamburger wrapper wadded up in the back seat. Then you\u0027ll look, throw out the wrapper, and spray some disinfectant.\u003C/p\u003E\u003Cp\u003EIn the same way, a Type III civilization might not have any human detectors in their solar-system-sized mobile habitats because they really couldn\u0027t care less. Unless the humans created a civilization capable of making a metaphorical odor strong enough to attract the Type III\u0027s attention.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003E3. Smart people don\u0027t kill ants for fun, at least not usually or on purpose. I know I certainly do not. Also it\u0027s not like we are destroying the entire ant species. To say we don\u0027t treat their lives as something delicate is also wrong as it can cause issues in our ecosystem. It\u0027s why we have laws about killing certain animals and such. A type III would probably be even more aware of this then we are.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EImagine a family picnic. Some ants show up. Little Billy gets annoyed, tracks the ants back to their nest, dumps a cup of kerosene onto it and lights a match. The ant nest is annihilated. Billy gets called back to the picnic for ice cream.\u003C/p\u003E\u003Cp\u003EImagine a gathering of Type III entities. Some human starships show up. Little Beta-Lambda gets annoyed, tracks the starships back to Earth, and seeds it with five gigatons of neutronium antimatter. Earth is annihilated. Beta-Lambda gets called back to the gathering for euphoronic frequencies.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003E4. Earth resources is not rare. This seems to be a huge misconception due to movies. A type III wouldn\u0027t have any issues getting resources from a planet with no life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends upon what sort of resources they are interested in. They very well could be interested in some resource that our science has not discovered yet \u003Cem\u003E(Wow, Zzazel! That planet is incredibly rich in poka-dotted quarks!).\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThen us poor humans will find ourselves in the same spot as a primitive African tribe who does not understand why these Western stranger want to bulldoze their village in order to dig up the dirt. The westerners tell the tribesmen that the dirt is called \u0022\u003Ca href=\u0022https://en.wikipedia.org/wiki/Coltan\u0022 rel=\u0022external nofollow\u0022\u003EColtain\u003C/a\u003E\u0022, from which they can extract something called \u0022\u003Ca href=\u0022https://en.wikipedia.org/wiki/Tantalum\u0022 rel=\u0022external nofollow\u0022\u003ETantalum\u003C/a\u003E\u0022, which is absolutely vital for something called a \u0022\u003Ca href=\u0022https://en.wikipedia.org/wiki/Tantalum_capacitor\u0022 rel=\u0022external nofollow\u0022\u003ECell Phone\u003C/a\u003E.\u0022 But to the tribesmen, it looks just like the same dirt that is everywhere else, and more specifically, in places that are not under their beloved village. This causes hard feelings, but unfortunately the westerners have something else called \u0022automatic rifles\u0022.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s if the aliens are a Type II civilization, who might actually bother to notice our existence. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003E5. A type III is very unlikely to be hostile. What reason would they have to be hostile toward us? Now, if we ever happened to get in a war with a type III, for what ever reason, we would be killed. It would be like a 30 second war.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, except I doubt our civilization could do anything a type III would even \u003Cem\u003Enotice\u003C/em\u003E, much less actually have any effect on them.\u003C/p\u003E\u003Cp\u003EAs a matter of fact, we might not even be able to detect them. Can bacteria detect men?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://web.archive.org/web/20090207144317/http://blissful.co.nz/library/exotic-civilizations-beyond-ka.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://web.archive.org/web/20090207144317/http://blissful.co.nz/library/exotic-civilizations-beyond-ka.php\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003E6. The biggest issue with the whole thing is the comparison of humans to bacteria.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy? Bacteria could have similar conjectures about titanic multicelluar creatures such as ourselves.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-16T00:41:25Z","Content":"\n\u003Cp\u003EReally, I think that a better comparison than \u0022Check Engine Light\u0022 would be \u0022Bug Zapper\u0022: A system that fixes the problem of minor annoyances without requiring the owner to put in any conscious effort.\u003C/p\u003E\u003Cp\u003EThe whole point of comparisons to bacteria and ants are to summarize this: We would be so insignificant on their scales that, at best, they\u0027d ignore us; or possibly, benevolent individuals of their species might take on our civilization as a \u0022pet\u0022; otherwise, curious individuals might mess around with our civilization as an experiment (or even for their own twisted amusement); and at worst, certain individuals (\u003Cem\u003Eindividuals\u003C/em\u003E, mind you) might find us annoying enough to engineer an entire species of autonomous killbots to wipe us out so that they wouldn\u0027t have to waste time hunting us themselves that they could put to better use terraforming planets into works of art with their minds.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-16T00:47:56Z\u0022 title=\u002205/16/2013 12:47  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 16, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xclusiv8","CreatedById":20567,"CreatedDateTime":"2013-05-16T06:29:06Z","Content":"\n\u003Cp\u003EAll this above is assuming that a type3civ do not care about life of any kind and just swoop in to grab anything they like. I find this rather hard to believe. If a species advances to that point I would like to think that a higher moral standard would follow with the evolution of the brain. What is the purpose of traveling around the universe if you fail to recognize that other species might rise to the same point given time.\u003C/p\u003E\u003Cp\u003EAlso if you can move suns you probably have some kind of all seeing sensor that recognizes all types of possible life. Maybe even A.I that adapts to all possible combinations of life.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-16T13:28:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xclusiv8\u0022 data-cite=\u0022xclusiv8\u0022\u003E\u003Cdiv\u003EAll this above is assuming that a type3civ do not care about life of any kind and just swoop in to grab anything they like. I find this rather hard to believe. If a species advances to that point I would like to think that a higher moral standard would follow with the evolution of the brain. What is the purpose of traveling around the universe if you fail to recognize that other species might rise to the same point given time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, not to put too fine a point on it, but do you worry about all the bacteria you step on as you walk? They can be detected. And they can rise to our point of advancement, given time.\u003C/p\u003E\u003Cp\u003EBuddhists say a little prayer over their feet, for the benefit of all the bacteria and insects they inadvertently step on. But they still walk around.\u003C/p\u003E\n"},{"CreatedByName":"xclusiv8","CreatedById":20567,"CreatedDateTime":"2013-05-16T13:58:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nyrath\u0022 data-cite=\u0022nyrath\u0022\u003E\u003Cdiv\u003EWell, not to put too fine a point on it, but do you worry about all the bacteria you step on as you walk? They can be detected. And they can rise to our point of advancement, given time.\u003Cp\u003EBuddhists say a little prayer over their feet, for the benefit of all the bacteria and insects they inadvertently step on. But they still walk around.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo I dont but then again bactaria doesnt know how to put rockets into space or are self aware. Even though a type3civ would be far superior to us they would probably recognize our intelligence and our self awarens. We are after all a sentient species which a type3civ would be aswell notmatter their leve of intellect.\u003C/p\u003E\u003Cp\u003EAlso nomatter how much time you give bacteria they will never rise to our leve of intelligence because they are not built in such a way that inteligence is possible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-16T14:01:02Z\u0022 title=\u002205/16/2013 02:01  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 16, 2013\u003C/time\u003E by xclusiv8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-16T14:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xclusiv8\u0022 data-cite=\u0022xclusiv8\u0022\u003E\u003Cdiv\u003ENo I dont but then again bactaria doesnt know how to put rockets into space or are self aware. Even though a type3civ would be far superior to us they would probably recognize our intelligence and our self awarens. We are after all a sentient species which a type3civ would be aswell notmatter their leve of intellect.\u003Cp\u003EAlso nomatter how much time you give bacteria they will never rise to our leve of intelligence because they are not built in such a way that inteligence is possible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe may not consider bacterial to be self-aware because our level of self-awareness is at such a higher level.\u003C/p\u003E\u003Cp\u003EA Type III civilization may not consider us to be self-aware because their level of self-awareness is at such a higher level.\u003C/p\u003E\u003Cp\u003EUmmm, you do know, do you not, that human beings evolved from single celled creatures much like bacteria?\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-05-16T17:49:55Z","Content":"\n\u003Cp\u003EI swear to ... \u0026gt;.\u0026gt;\u003C/p\u003E\u003Cp\u003EDo you all not read? A type III civilization is all about advancements in technology and energy use. Type III where once type 0 just like us. They do not all of a sudden forget that. Comparing humans to bacteria is retarded, just stop. That comparison makes no sense as humans and bacteria are totally different. Even if we where to scale a human to the size of a bacteria, we still would be entirely different organisms.\u003C/p\u003E\u003Cp\u003EAre you saying a type III is too stupid to know what we are? You know they have only lived for billions of years, yet they some how see a full sized mammal as bacteria?\u003C/p\u003E\u003Cp\u003EAlso if you know how biology works, you would know a species as smart as us or smarter would have to be a similar size. The larger you are the more work it takes to keep you alive, and usually you tend to be not as smart. Humans have the largest brain size to body ratio out of all the animals on earth.\u003C/p\u003E\u003Cp\u003ELet me ask you this, an Elephant isn\u0027t exactly smart, do you see them as insignificant like a bacteria? Do you not see them?\u003C/p\u003E\u003Cp\u003EThe comparisons here are way off from the mark. I know I sound like a broken record but ROFL, really people? Really? Come on, you are all smarter then this, be more reasonable.\u003C/p\u003E\u003Cp\u003EEdit: Also there is not going to be any element on earth that is so rare that an alien species would attack us. If you know how elements are created by super novas and such, you would know this would be an impossible. There are billions of stars in a galazy and billions of galaxies. There are billions of supernovas. You can be damned certain there is billions of planets with each element you could ever want.\u003C/p\u003E\u003Cp\u003EHonestly this whole comparison sounds like a bad Hollywood movie.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-16T17:58:35Z\u0022 title=\u002205/16/2013 05:58  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 16, 2013\u003C/time\u003E by Brabbit1987\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xclusiv8","CreatedById":20567,"CreatedDateTime":"2013-05-16T19:17:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003EI swear to ... \u0026gt;.\u0026gt;\u003Cp\u003EDo you all not read? A type III civilization is all about advancements in technology and energy use. Type III where once type 0 just like us. They do not all of a sudden forget that. Comparing humans to bacteria is retarded, just stop. That comparison makes no sense as humans and bacteria are totally different. Even if we where to scale a human to the size of a bacteria, we still would be entirely different organisms.\u003C/p\u003E\u003Cp\u003EAre you saying a type III is too stupid to know what we are? You know they have only lived for billions of years, yet they some how see a full sized mammal as bacteria?\u003C/p\u003E\u003Cp\u003EAlso if you know how biology works, you would know a species as smart as us or smarter would have to be a similar size. The larger you are the more work it takes to keep you alive, and usually you tend to be not as smart. Humans have the largest brain size to body ratio out of all the animals on earth.\u003C/p\u003E\u003Cp\u003ELet me ask you this, an Elephant isn\u0027t exactly smart, do you see them as insignificant like a bacteria? Do you not see them?\u003C/p\u003E\u003Cp\u003EThe comparisons here are way off from the mark. I know I sound like a broken record but ROFL, really people? Really? Come on, you are all smarter then this, be more reasonable.\u003C/p\u003E\u003Cp\u003EEdit: Also there is not going to be any element on earth that is so rare that an alien species would attack us. If you know how elements are created by super novas and such, you would know this would be an impossible. There are billions of stars in a galazy and billions of galaxies. There are billions of supernovas. You can be damned certain there is billions of planets with each element you could ever want.\u003C/p\u003E\u003Cp\u003EHonestly this whole comparison sounds like a bad Hollywood movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! This is exactly what I am talking about.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-16T21:52:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003EI swear to ... \u0026gt;.\u0026gt;\u003Cp\u003EDo you all not read? A type III civilization is all about advancements in technology and energy use. Type III where once type 0 just like us. They do not all of a sudden forget that. Comparing humans to bacteria is retarded, just stop. That comparison makes no sense as humans and bacteria are totally different. Even if we where to scale a human to the size of a bacteria, we still would be entirely different organisms.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI fear you have not thought this all the way through. You seem to be under the misapprehension that the entities of the Type III civilization are going to be identical to the Type I civilization entities they evolved from. Way before the Type I evolved to even Type II they are going to hit a technological singularity\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Technological_singularity\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Technological_singularity\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELook at the timelines suggested in the linked article, and realize that it will probably be millions of years before we reach Type III (assuming we do not destroy our civilization before then).\u003C/p\u003E\u003Cp\u003EType III species will probably be entities that have uploaded their minds into their version of a cosmic internet and formed multi-mind colony creatures. The same way single celled organisms evolved into multcellular organism like us, our single-mind organisms will evolve into multiminded organism.\u003C/p\u003E\u003Cp\u003EType III species are not going to be like Star Trek federation members walking around with more powerful phasers.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-16T21:57:49Z","Content":"\n\u003Cp\u003EWe were once bacteria, and we do not all of a sudden forget that. We still step on them though.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-05-16T22:04:24Z","Content":"\n\u003Cp\u003EWell lets just agree to disagree... not like anyone here can be right anyway. Since you know, it\u0027s just speculation. For me, I am just trying to go by the more likely case scenario.\u003C/p\u003E\n"}]}