{"TopicId":26785,"ForumId":16,"TopicTitle":"Jet Engine Questions","CreatedByName":"creator1629","CreatedById":61446,"CreatedDateTime":"2013-05-14T04:43:07Z","PageNum":1,"Articles":[{"CreatedByName":"creator1629","CreatedById":61446,"CreatedDateTime":"2013-05-14T04:43:07Z","Content":"\n\u003Cp\u003Ehello, i am designing my first SSTO spaceplane and had a few questions about using the turbo jet engine\u003C/p\u003E\u003Cp\u003E- when i look at the amount of air i have under resources, there is just one number, does that mean that the plane gathers air from all intakes into one giant air \u0022pool\u0022, and that it doesn\u0027t really matter where i place them? like they don\u0027t have to necessarily be right infront of the engine?\u003C/p\u003E\u003Cp\u003E- when a turbo jet engine says it has a flameout threshold of 0.10, does that mean that on a plane with 2 turbo jet engines they will both flameout when the air level drops below 0.20?\u003C/p\u003E\u003Cp\u003E- under the description for an intake, like for example the RAM intake it has a value that says intake air 0.2/0.2 what do the first and second values correspond to exactly?\u003C/p\u003E\u003Cp\u003E- i notice a lot of people post their spaceplane pictures and they almost always have the RAM intakes, and i was wondering why that is, because comparing the descriptions to the circular air intake it seems they are identical, is there some other statistic im missing?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-14T04:57:22Z","Content":"\n\u003Cp\u003ERam intakes are the only ones you should consider for spaceplanes. They collect more air in the thinner atmosphere than any other one\u003C/p\u003E\u003Cp\u003EThe two numbers are intake and storage\u003C/p\u003E\u003Cp\u003EYou can place them anywhere you like. The intake air is piped like rcs through magic ducts\u003C/p\u003E\u003Cp\u003EAnd lastly flameout threshold is correct. Roughly. At 0.1 air you have a chance at flaming out with the engine at full throttle. Lower your throttle and the threshold also goes lower. You get more out of your engine by lowering the throttle and preventing a flameout rather than switching to rocket engines as soon as you can\u0027t use the jet at full anymore\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-05-14T05:00:51Z","Content":"\n\u003Cp\u003E1. Yep, that\u0027s right. They do need to face forward, but otherwise it doesn\u0027t really matter.\u003C/p\u003E\u003Cp\u003E2. Nope, that\u0027s wrong. If engine A was put onto the vehicle first in the SPH, then when the game checks to see if there is enough air to avoid a flameout, engine A will have sufficient air but engine B will not, so engine B will flameout (and you\u0027ll probably go into a flat spin - very bad.) The solution is to use an odd number of engines, with the last one installed in the center of the craft. When it flames out you\u0027ve got a bit of time to throttle down before the next engine goes and you can avoid a flat spin.\u003C/p\u003E\u003Cp\u003E3. The description for the intakes are not particularly helpful. I believe that the two numbers that are listed describe how much air it can bring in in a time increment.\u003C/p\u003E\u003Cp\u003E4. The quantities that matter are the mass and intake area (which you can find in the part.cfg.) The RAM intake has the lowest mass and highest area, and thus is always preferred, unless you\u0027re using a different intake for appearance\u0027s sake. The intakes are sufficient to provide huge quantities of air as long as you\u0027re moving until you get to a high altitude. There are intakes that appear to be able to provide more air than the RAM intake, but they are only able to do so at low altitude (or insane speeds) where the amount of air is more than sufficient using just about any of the intakes, so the extra air is just wasted..\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-05-14T11:29:37Z","Content":"\n\u003Cp\u003ERam intakes generate 25% more air than circular, the descriptions and balancing were clearly rather rushed and I\u0027m sure both will be changed to be more sensible in future.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-05-14T17:52:00Z","Content":"\n\u003Cp\u003EArea determines how much air the intake can suck up per second. This is the important bit.\u003C/p\u003E\u003Cp\u003EThe capacity is how much air the \u0022tank\u0022 of air inside the intake can store. At low altitude this limits the production of IntakeAir, but at high altitude it\u0027s irrelevant. Even at low altitude though, the ram intake has the best mass:IntakeAir ratio.\u003C/p\u003E\n"},{"CreatedByName":"creator1629","CreatedById":61446,"CreatedDateTime":"2013-05-17T09:02:42Z","Content":"\n\u003Cp\u003Ecool thanks for the info guys. what is the best way to attach more RAM intakes into a plane? besides attaching more fuel tanks on the wings i mean which seems to add too much weight. are bicouplers the way to go to get the 2 RAM intake per engine ratio?\u003C/p\u003E\n"},{"CreatedByName":"Scialytic","CreatedById":43957,"CreatedDateTime":"2013-05-17T09:08:30Z","Content":"\n\u003Cp\u003EI recommend the \u0022Cubic Octagonal Strut\u0022 part. Remember that the intakes just need to be facing the correct direction; it doesn\u0027t matter what they are attached to.\u003C/p\u003E\n"}]}