{"TopicId":27154,"ForumId":34,"TopicTitle":"[0.90] LazTek SpaceX Launch, Exploration, Colonial Transporter \u0026amp; Historic mods (1/25/14)","CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-05-16T19:46:18Z","PageNum":13,"Articles":[{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-16T21:40:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prowler_x1\u0022 data-cite=\u0022Prowler_x1\u0022\u003E\u003Cdiv\u003ENo matter the timing. \u0022I love this mod\u0022. I will wait, but would prefer not to.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I think the mod will still work with the .23 update since I don\u0027t have anything that generates Science! other than crew reports from the Dragon 2. I have a Exploration Pack that I was going to launch today as well, but am waiting for the update since the new pack includes an inflatable science research habitat.\u003C/p\u003E\n"},{"CreatedByName":"DasBananenbrot","CreatedById":70900,"CreatedDateTime":"2013-12-16T21:53:53Z","Content":"\n\u003Cp\u003EThis was kind of unexpected, one day before 0.23 it gets the 0.22 update *Wink* But good to see there is a update now\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-16T21:58:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DasBananenbrot\u0022 data-cite=\u0022DasBananenbrot\u0022\u003E\u003Cdiv\u003EThis was kind of unexpected, one day before 0.23 it gets the 0.22 update *Wink* But good to see there is a update now\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, the wonky state of the spaceport website made getting this update loaded a week-long struggle. Perhaps if they would be so kind as to fix it, my .23 update will get to everyone in a more expedient manner.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-16T22:19:44Z","Content":"\n\u003Cp\u003EI\u0027d say, screw Spaceport. It\u0027s a buggy mess that corrupts files, is a chore to upload to and near-impossible to search (you can\u0027t even filter out the .craft files people have spammed it with). Use Mediafire instead, it\u0027s much more reliable.\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2013-12-16T22:21:09Z","Content":"\n\u003Cp\u003EAwesome I love this pack thanks for updating it\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-16T22:31:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EI\u0027d say, screw Spaceport. It\u0027s a buggy mess that corrupts files, is a chore to upload to and near-impossible to search (you can\u0027t even filter out the .craft files people have spammed it with). Use Mediafire instead, it\u0027s much more reliable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll look into that, thanks. If anyone has trouble with SpacePort in the meantime, use these links to d\u003Cspan style=\u0022color:#333333;\u0022\u003Eownload from LazTek:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPack_2.2.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack 2.2 [KSP .22]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPackHD_2.2.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack HD 2.2 [KSP .22]\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-16T22:35:13Z","Content":"\n\u003Cp\u003EGood riddance. Many people complained about not being able to download bigger packs from Spaceport, that should save them some grief.\u003C/p\u003E\u003Cp\u003EOh, and I have a question. What are the future plans for the pack? Perhaps a Falcon 1 and Falcon 9 v1.0, plus a Cargo Dragon capsule? Cargo Dragon would be easy, just remove the windows and interior from the current Dragon. Falcon 9 v1.0 would need a shortened 1st stage and a new engine cluster. Falcon 1 could probably only reuse the Merlin engine, though. Also, there was a proposed (not built) rocket called Falcon 5, which was basically a thicker, shorter Falcon 9 with 5 Merlin engines.\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-12-17T00:56:18Z","Content":"\n\u003Cp\u003EThanks for an alternative link. The one on spaceport was indeed causing corrupted loads for me and I couldn\u0027t isolate via the configs what it was doing.\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-17T01:32:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EThanks for an alternative link. The one on spaceport was indeed causing corrupted loads for me and I couldn\u0027t isolate via the configs what it was doing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome... I\u0027ve been trying to delete my SpacePort uploads all day with no success.\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-17T01:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EGood riddance. Many people complained about not being able to download bigger packs from Spaceport, that should save them some grief.\u003Cp\u003EOh, and I have a question. What are the future plans for the pack? Perhaps a Falcon 1 and Falcon 9 v1.0, plus a Cargo Dragon capsule? Cargo Dragon would be easy, just remove the windows and interior from the current Dragon. Falcon 9 v1.0 would need a shortened 1st stage and a new engine cluster. Falcon 1 could probably only reuse the Merlin engine, though. Also, there was a proposed (not built) rocket called Falcon 5, which was basically a thicker, shorter Falcon 9 with 5 Merlin engines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will release an exploration pack along with the .23 update, which will include an inflatable science habitat, ejectible heat shields and upper landing gear along with other goodies for visiting all the planets and moons of the Kerbalverse, I\u0027m following with the proposed SpaceX Falcon X, which I have already built out and tested with a 3m fuselage. I will create a deep space module and landable habitat for this pack along with a 4-person rover that I\u0027ve been working on for the past couple of months. After this, I plan to create a \u0022historical\u0022 pack with the older SpaceX vehicles.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T01:50:46Z\u0022 title=\u002212/17/2013 01:50  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by LazarusLuan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shaw","CreatedById":64788,"CreatedDateTime":"2013-12-17T02:15:44Z","Content":"\n\u003Cp\u003EI have one issue to report: Dragon 2 internal is still in its old orientation (not rotated by 180Ã‚Â° like rest of the capsule).\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-17T03:49:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shaw\u0022 data-cite=\u0022shaw\u0022\u003E\u003Cdiv\u003EI have one issue to report: Dragon 2 internal is still in its old orientation (not rotated by 180Ã‚Â° like rest of the capsule).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks - the rotation of the ship was a last-minute change I made. Working on the fix now.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-17T07:29:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LazarusLuan\u0022 data-cite=\u0022LazarusLuan\u0022\u003E\u003Cdiv\u003EI will release an exploration pack along with the .23 update, which will include an inflatable science habitat, ejectible heat shields and upper landing gear along with other goodies for visiting all the planets and moons of the Kerbalverse, I\u0027m following with the proposed SpaceX Falcon X, which I have already built out and tested with a 3m fuselage. I will create a deep space module and landable habitat for this pack along with a 4-person rover that I\u0027ve been working on for the past couple of months. After this, I plan to create a \u0022historical\u0022 pack with the older SpaceX vehicles.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting. With every announcement like that, I\u0027m looking forward to 0.23 even more. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Reddragon","CreatedById":66937,"CreatedDateTime":"2013-12-17T08:16:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LazarusLuan\u0022 data-cite=\u0022LazarusLuan\u0022\u003E\u003Cdiv\u003EI will release an exploration pack along with the .23 update, which will include an inflatable science habitat...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill you also make the lunar base version of the proposed inflatable habitat?\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-17T13:59:26Z","Content":"\n\u003Cp\u003EThe issue with the capsule has been fixed and is ready for download: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPack_2.2.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack 2.2 [KSP .22]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPackHD_2.2.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack HD 2.2 [KSP .22]\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-12-17T20:45:08Z","Content":"\n\u003Cp\u003EChangelog?\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-12-17T23:49:55Z","Content":"\n\u003Cp\u003ELaz: Can we have an option to turn off the blue light in the cabin? It\u0027s so bright it illuminates the ground by the launchpad, I\u0027d love to be able to just flick it off, it kinda bugs me if I\u0027m honest \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso the F9 1.1/Dragon 2 stack doesn\u0027t seem to fly terribly well with FAR. I\u0027ve had numerous issues with it falling over on gravity turn (using MechJeb 2.1).\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2013-12-18T00:45:42Z","Content":"\n\u003Cp\u003EThanks for the update! My current game uses your Falcon launchers exclusively (with several cfg changes to make performance feel more realistic to me), and your Dragon capsule is the only way my Kerbals leave or reenter Kerbin. \u003C/p\u003E\u003Cp\u003EIt\u0027s the best reusable 21st century launch system for someone like me who hates KSP spaceplanes. I\u0027m also making all my payloads fit into fairings, which makes for an interesting challenge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESoon as 0.23 is done downloading (estimated 2 hrs left...seriously, Squad???), I look forward to trying out the new Falcon/Dragon!\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2013-12-23T12:41:51Z","Content":"\n\u003Cp\u003EI see you made several design changes.\u003C/p\u003E\u003Cp\u003EThe top-mounted heat shields and burning 3 engines during 1st-stage recovery make your design closer to the conceptual video SpaceX released, so those make sense to me. Even though SpaceX said nothing in that video is official, I know people expect it to look like the video.\u003C/p\u003E\u003Cp\u003EDid you reuse the 1st-stage landing legs on the 2nd-stage as a placeholder while you work on new legs, or is that a permanent change? And why the longer interstage?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"jlangdale","CreatedById":60702,"CreatedDateTime":"2013-12-24T01:05:57Z","Content":"\n\u003Cp\u003EI was playing this with .23 and it seems that I cannot board the Dragon while EVA in space. I can grab the extended ladder but when I climb to the hatch, there\u0027s no board option. Doesn\u0027t seems to matter if the hatch is open or not. Since the version I\u0027m using is .22, it may not be appropriate to mention it, I dunno.\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-26T10:31:32Z","Content":"\n\u003Cp\u003EGood news - I am close to completing the .23 update, and will have it ready for public testing after I complete the low-rez build, which should be be the 27th. I\u0027ve made a number of cosmetic and component changes from the earlier versions and have complied a change log:\u003C/p\u003E\u003Cp\u003EChanges in LazTek SpaceX Launch Pack 2.3:\u003C/p\u003E\u003Cp\u003EUpgraded everything to Unity 3D v4.22\u003C/p\u003E\u003Cp\u003EAdded all parts to the KSP tech tree\u003C/p\u003E\u003Cp\u003EDragon 2 Capsule - Added to the Meta-Materials node of the tech tree; now has control to turn blue lights off; rotated heat shield by 180 degrees to orient passengers feet down upon rentry; rotated ship 180 degrees to correctly orient the hatch side as \u0022forward\u0022; removed interior seats from exterior view to allow more realistic interior view of Kerbals in seats; redesigned control panel for more accurate interior piloting; fixed various physics and physic collider issues related to changes between versions of the Unity engines\u003C/p\u003E\u003Cp\u003EDragon Docking Ring - Added to the Meta-Materials node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Chute - Added to the Advanced Landing node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Nose Cone - Added to the Heavy Aerodynamics node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Panel Cover - Added to the Heavy Aerodynamics node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Solar Panels - Added to the Specialized Electrics node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Steps - Added to the Advanced Motors node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Trunk - Added to the Specialized Electrics node of the tech tree\u003C/p\u003E\u003Cp\u003EDragon Trunk Decoupler - Added to the Very Heavy Rocketry node of the tech tree\u003C/p\u003E\u003Cp\u003EFalcon 9 Interstage - Added to the Very Heavy Rocketry node of the tech tree; remodeled to new design unveiled by SpaceX; removed command, SAS and ASAS abilities; now acts only as a decoupler/shroud for the upper stage Merlin 1D vacuum engine and nozzle\u003C/p\u003E\u003Cp\u003EFalcon Expanded Fairing - Added to the Heavy Aerodynamics node of the tech tree\u003C/p\u003E\u003Cp\u003EFalcon Fairing Base - Added to the Heavy Aerodynamics node of the tech tree\u003C/p\u003E\u003Cp\u003EFalcon Heavy Interstage - Added to the Very Heavy Rocketry node of the tech tree; removed command, SAS and ASAS abilities; now acts only as a decoupler/shroud for the upper stage Merlin 1D vacuum engine and nozzle\u003C/p\u003E\u003Cp\u003EFalcon Heavy Nosecone/Remote - Added to the Advanced Unmanned Tech node of the tech tree; replaces separate command remote control with one unit; now has ASAS and reaction wheel\u003C/p\u003E\u003Cp\u003EFalcon Lower Gear - Added to the Advanced Landing node of the tech tree; has been rebuilt to comply with new landing gear design from Squad \u003C/p\u003E\u003Cp\u003EFalcon Main Tank - Added to the Very Heavy Rocketry node of the tech tree; remodeled to new design unveiled by SpaceX\u003C/p\u003E\u003Cp\u003ELazTek Falcon Middle Gear - Added to the Advanced Landing node of the tech tree; landing gear for upper stage that replaces earlier heat-shielded design with a smaller side-mounted version of the lower landing gear unveiled by SpaceX in middle 2013\u003C/p\u003E\u003Cp\u003ELazTek Falcon Payload Bay - Added to the Heavy Aerodynamics node of the tech tree\u003C/p\u003E\u003Cp\u003EFalcon Radial Decoupler - Added to the Very Heavy Rocketry node of the tech tree\u003C/p\u003E\u003Cp\u003EFalcon Remote Control - Newly added to the Advanced Unmanned Tech node of the tech tree; replaces remote control/command probe/ASAS functions of the old SPS Base and first stage decoupler/remote control\u003C/p\u003E\u003Cp\u003EFalcon Remote Control Heatshield - Newly added to the Advanced Unmanned Tech node of the tech tree; replaces remote control/command probe/ASAS functions of the old SPS Base; provides top-mounted re-entry protection for upper stage; acts as decoupler before re-entry\u003C/p\u003E\u003Cp\u003ELazTek Falcon Sat Capture - Added to the Heavy Aerospace node of the tech tree\u003C/p\u003E\u003Cp\u003ELazTek Falcon Upper Tank - Added to the Very Heavy Rocketry node of the tech tree; remodeled based on new design of Falcon v1.1\u003C/p\u003E\u003Cp\u003EMerlin 1D Engine Cluster - Added to the Very Heavy Rocketry node of the tech tree; remodeled based on unveiled v1.1 design; now contains only 6 engines\u003C/p\u003E\u003Cp\u003EMerlin 1D Engine Center - Added to the Very Heavy Rocketry node of the tech tree; now designed to be attached to the Merlin 1D Cluster in a set of three to allow three engines to be re-lit in vacuum as designed by SpaceX\u003C/p\u003E\u003Cp\u003ELazTek Merlin 1D Vacuum Engine - Added to the Very Heavy Rocketry node of the tech tree; nozzle bell has been increased in size to more accurately reflect the actual design\u003C/p\u003E\u003Cp\u003ESeparation Engine - Added to the Very Heavy Rocketry node of the tech tree\u003C/p\u003E\u003Cp\u003ESHERPA Core - Newly added to the Advanced Unmanned Tech node of the tech tree; replaces SPSS from old SpaceX Launch Pack with new upcoming shepherding, droid-like independent spacecraft that can launch and maintain dozens of small satellites for up to 3 years; has own decoupler and monopropellant-fueled engine built in\u003C/p\u003E\u003Cp\u003ESHERPA Tank - Newly added to the Advanced Unmanned Tech node of the tech tree; designed to be attached to the SHERPA Core in a set of 4\u003C/p\u003E\u003Cp\u003ESHERPA Decoupler - Newly added to the Advanced Unmanned Tech node of the tech tree; designed to have small satellites attached\u003C/p\u003E\u003Cp\u003ESuperDraco Nacelle - Added to the Very Heavy Rocketry node of the tech tree\u003C/p\u003E\u003Cp\u003EAny parts not needed with the new design changes revealed by SpaceX have been eliminated, along with any pre-built space stations or large satellites, though there are 6 small satellites included with the .craft file for the Dragon 2. The \u0022experimental\u0022 version of the SuperDraco Nacelles has been eliminated and through the part tweaking functions introduced with KSP .23, the fuel levels may be adjusted before launch to more accurately reflect real life.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T10:38:49Z\u0022 title=\u002212/30/2013 10:38  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by LazarusLuan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrBackjack","CreatedById":3449,"CreatedDateTime":"2013-12-27T01:46:23Z","Content":"\n\u003Cp\u003ELaz, I just wanted to say how much I love this mod. Best mod ever!\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-12-27T16:27:05Z","Content":"\n\u003Cp\u003EThumbs up mate, can\u0027t wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pmanhart","CreatedById":78521,"CreatedDateTime":"2013-12-27T17:00:40Z","Content":"\n\u003Cp\u003ELooking forward to the update for .23, thanks for all the hard work!\u003C/p\u003E\n"},{"CreatedByName":"LazarusLuan","CreatedById":61673,"CreatedDateTime":"2013-12-30T11:06:05Z","Content":"\n\u003Cp\u003EThe update is ready for download. After thoroughly playtesting it with KSP .23, it became apparent that all of the parts of the launch packs belong within the regular nodes of the Kerbal tech tree instead of \u0022experimental\u0022. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EDownload from LazTek:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPack_2.3.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack 2.3 [KSP .23]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://electrictomatoes.com/ksp/LazTekSpaceXLaunchPackHD_2.3.zip\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack HD 2.3 [KSP .23]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EDownload from SpacePort:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/laztek-spacex-launch-pack-2-0-1-21/\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack 2.3 [KSP .23]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/laztek-spacex-launch-pack-hd-2-0-1-21/\u0022 rel=\u0022external nofollow\u0022\u003ELazTek SpaceX Launch Pack HD 2.3 [KSP .23]\u003C/a\u003E\u003C/p\u003E\n"}]}