{"TopicId":27271,"ForumId":16,"TopicTitle":"Double Or Even Triple Ship Deployments \u002B Motherships","CreatedByName":"Hovis","CreatedById":61305,"CreatedDateTime":"2013-05-17T16:34:55Z","PageNum":1,"Articles":[{"CreatedByName":"Hovis","CreatedById":61305,"CreatedDateTime":"2013-05-17T16:34:55Z","Content":"\n\u003Cp\u003ESo I have a theory and I was wondering what you folks thought to it.\u003C/p\u003E\u003Cp\u003EThe theory is that for reasons of balance it might be best to launch multiple small ships off a big rocket, rather than trying to launch one off the back of a smaller rocket.\u003C/p\u003E\u003Cp\u003EI know, in practice, the best solution is a single ship being launched off the nose of an appropriately sized rocket, but the whole point of a space program is trying out new stuff, so here we are. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESomething I had close to success with was an attempt to launch two shuttles from opposite sides of a very large rocket. As a prototype this kind of worked okay, although truth be told the shuttles themselves were of pretty poor design and were very heavy. The principle failure was that I couldn\u0027t get the entire launch vehicle and the shuttles into orbit, the shuttles had to make the final push for the a stable orbit themselves, which meant they would need bigger engines and more fuel and really for them to be fit for purpose they need to be equipped with nuclear engines, which means they need to be deployed in orbit. In the test they had nuclear engines and lacked the power to get into orbit. But that could be addressed.\u003C/p\u003E\u003Cp\u003EBut anywho, as a proof on concept it was a success I think. You could, I think, launch twin shuttles from a single extremely powerful rocket.\u003C/p\u003E\u003Cp\u003ESo now I\u0027m wondering how else multiple vehicles might be deployed?\u003C/p\u003E\u003Cp\u003EI\u0027m working on a Mun City. Well I say City, I just want to land a whole bunch of stuff in one place on the Mun. Because it\u0027s there. Get some bigger habitation buildings. Some rovers. All things that are good.\u003C/p\u003E\u003Cp\u003ENow to do this something I am wanting to build is a sort of a drop ship. A vessel that will carry pods to Mun orbit, and these pods will then drop and land under their own power. The hope is that by doing this the pods won\u0027t need to carry as much fuel.\u003C/p\u003E\u003Cp\u003EThe problem here is what is the best way to get a number of these pods into orbit and docked with the mothership? I was thinking maybe using mods for cargo holds, but these seem quite hard to use. Alternatively I was considering making the drop pods stackable end to end, so I could have maybe three of them on the front of the launch craft and release them into orbit like a pancake stack, to separate before docking with the Mother.\u003C/p\u003E\u003Cp\u003EHas anybody had any success with this type of approach though? Are there any balanced mods that might help?\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-17T16:52:10Z","Content":"\n\u003Cp\u003EI think I\u0027ve done something similar to this, though I\u0027m not totally sure about what you\u0027re planning. I build a carrier with 4 docking ports to transport landers to 4 of Jool\u0027s moons. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Endurance/ProbelaunchatJool.jpg\u0022 alt=\u0022ProbelaunchatJool.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey aren\u0027t all of equal size, which can cause a lot of issues, but it let me carry some very heavy ships without doing each individually. And if you look closely you can see that each craft has several probes and rovers stacked above and below the landers. These can all be separated at the appropriate time to land or go into orbit around the moons. There is a lot more info on this mission on my \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29028-Manned-Jool-survey\u0022 rel=\u0022external nofollow\u0022\u003Ethread here\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-17T16:58:16Z","Content":"\n\u003Cp\u003EI\u0027ve used both the b9 pack for delivering multiple drop ships inside massive cargoholds, and I\u0027ve launched smaller ships with small drop ships on their nose which were delivered in orbit to larger craft for interplanetary travel. \u003C/p\u003E\u003Cp\u003EI really love using the new b9 cargoship I threw together for this. The version I have in service currently can carry a cargo as long as 1 orange tank \u002B 1/2 sized silver tank \u002B 1/8th sized tank with a docking port on each end. \u003C/p\u003E\u003Cp\u003EThat size split up into useful things works out to four landers based on a 1/4 sized silver tanks, with docking ports on each end and such.. Going bigger isn\u0027t hard, as long as you have a lifter big enough to get it all into orbit, or are willing to send the ship up in one launch and its payload in separate launches\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/b91.jpg\u0022 alt=\u0022b91.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-17T18:19:14Z","Content":"\n\u003Cp\u003EMounting the load in pairs does make balance a breeze, but it also doubles the payload mass, which can be a deal-breaker depending on the goal of the mission. But in theory, you can just keep piling sub-ships on indefinitely. This was mission that delivered a manned lander, 4 orbital probes, and 8 landing probes, to the Jool system, but did not have enough fuel to come home. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E (The crew is currently colonizing Bop.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WTn1F5p.png\u0022 alt=\u0022WTn1F5p.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hovis","CreatedById":61305,"CreatedDateTime":"2013-05-18T10:39:07Z","Content":"\n\u003Cp\u003EHmm. B9 does look like a good shout for transporting ships like that. This does mean that I\u0027m going to need to learn about cargo bays. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf ships are attached via docking clamps, will they remain attached during a burn? Do I have to keep speeds low?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-18T11:58:43Z","Content":"\n\u003Cp\u003EI use quantum struts to keep everything from wobbling, without them they Do stay attached but its less elegant lol\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/bibbob1.jpg\u0022 alt=\u0022bibbob1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/bigbill1.jpg\u0022 alt=\u0022bigbill1.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-18T12:01:19Z","Content":"\n\u003Cp\u003ELike this?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/6vxud_BqXak?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-05-22T11:06:28Z","Content":"\n\u003Cp\u003EI\u0027ve tried to do stuff like that, using a heavy lifter rocket (I would guess that beast can bring a payload of some 200-300 tons into orbit. Weighs around 800 tons without payload and a T/W ratio of about 2.5 all the way up into orbit, with a delta V of about 14000 or so without payload. Only problem is that it takes over an hour to orbit, due to computer performance problems...) to launch multiple vessels at once, such as a space station section with four small ships docked as escape pods, or a larger interplanetary vessel with several heavy landers (the idea is that they should be able to go to most of the easier places, land, start again, return to the \u0022mothership\u0022, dock and transfer the crew, abandon the landers and then go home).\u003C/p\u003E\u003Cp\u003EHowever, I run into a problem.\u003C/p\u003E\u003Cp\u003EThe staging gets messed up. It can\u0027t keep track of the staging separately, so, for example, when I launch an escape pod, all the stages have been joined into one. Instead of just:\u003C/p\u003E\u003Cp\u003E0: Parachute\u003C/p\u003E\u003Cp\u003E1: Decouple tank/engine\u003C/p\u003E\u003Cp\u003E2: Start engine, fire separatrons (to blast it clear from the station)\u003C/p\u003E\u003Cp\u003EI get:\u003C/p\u003E\u003Cp\u003E0: Parachute, decouple tank/engine, start engine, fire separatrons\u003C/p\u003E\u003Cp\u003ENow, that\u0027s not exactly what I wanted, and certainly not what I wanted to fiddle around with in an emergency.\u003C/p\u003E\u003Cp\u003ENow, if I first send up the space station part, then the pods one by one and dock them, it works. But, when I build it all in the VAB, it essentially becomes one vessel, and when decoupled, starts to behave strangely.\u003C/p\u003E\u003Cp\u003EHow to fix it?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-22T11:43:37Z","Content":"\n\u003Cp\u003EOnly way I know to do it is to setup the staging after I undock the ships. The only emergencies in the game are self made in the game are self made ones, strictly RP, which can be put on hold while we work around the games quirks. My payloads have all been built in from the VAB but as soon as my two ships get back and land at KSC they are being decommissioned and replaced with a single ship with much more thrust, and the MK4 cargo bays instead of HL bays. It weighs 300 tonnes so far empty (and thats not done yet.. probably another 15-20t in various parts to add) so it will be sent up solo and its payloads will be sent up on their own launchers and docked in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-22T11:49:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Troberg\u0022 data-cite=\u0022Troberg\u0022\u003E\u003Cdiv\u003EI\u0027ve tried to do stuff like that, using a heavy lifter rocket (I would guess that beast can bring a payload of some 200-300 tons into orbit. Weighs around 800 tons without payload and a T/W ratio of about 2.5 all the way up into orbit, with a delta V of about 14000 or so without payload. Only problem is that it takes over an hour to orbit, due to computer performance problems...) to launch multiple vessels at once, such as a space station section with four small ships docked as escape pods, or a larger interplanetary vessel with several heavy landers (the idea is that they should be able to go to most of the easier places, land, start again, return to the \u0022mothership\u0022, dock and transfer the crew, abandon the landers and then go home).\u003Cp\u003EHowever, I run into a problem.\u003C/p\u003E\u003Cp\u003EThe staging gets messed up. It can\u0027t keep track of the staging separately, so, for example, when I launch an escape pod, all the stages have been joined into one. Instead of just:\u003C/p\u003E\u003Cp\u003E0: Parachute\u003C/p\u003E\u003Cp\u003E1: Decouple tank/engine\u003C/p\u003E\u003Cp\u003E2: Start engine, fire separatrons (to blast it clear from the station)\u003C/p\u003E\u003Cp\u003EI get:\u003C/p\u003E\u003Cp\u003E0: Parachute, decouple tank/engine, start engine, fire separatrons\u003C/p\u003E\u003Cp\u003ENow, that\u0027s not exactly what I wanted, and certainly not what I wanted to fiddle around with in an emergency.\u003C/p\u003E\u003Cp\u003ENow, if I first send up the space station part, then the pods one by one and dock them, it works. But, when I build it all in the VAB, it essentially becomes one vessel, and when decoupled, starts to behave strangely.\u003C/p\u003E\u003Cp\u003EHow to fix it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGot screenshots of it? I\u0027ve think I\u0027ve encountered something similar like that while testing some other modules.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-05-22T12:42:41Z","Content":"\n\u003Cp\u003ESorry, no screenshots, and I kind of made a very precise orbit (in other words, crashed into it) when I was going to rendezvous with the station to add another module, so it\u0027ll take a while to get the things in space again, especially on my underspeced computer. Maybe later.\u003C/p\u003E\u003Cp\u003EI had some fun, though, trying to save two surviving EVA kerbals (the station was pretty destroyed and the command capsule in a decaying orbit, so I sent Bill and Jeb EVA and launched a rescue mission). Managed to pick up Jeb, Bill tried a suit-only re-entry and failed.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-22T19:15:36Z","Content":"\n\u003Cp\u003EYou do have to reset the staging after undocking, but if you need to deploy things in a hurry, remember that you can right-click on most things and manually activate them from that menu.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-05-23T06:05:46Z","Content":"\n\u003Cp\u003EYep, that\u0027s pretty much how I did it.\u003C/p\u003E\n"},{"CreatedByName":"aleis","CreatedById":62823,"CreatedDateTime":"2013-05-23T06:32:12Z","Content":"\n\u003Cp\u003EI think I built something similar to what your talking about to practice docking with.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1283.photobucket.com/user/aleis52/media/2013-05-23_00001_zps9da7a372.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://s1283.photobucket.com/user/aleis52/media/2013-05-23_00001_zps9da7a372.jpg.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ebasically built a Lifter Rocket with 4 sub probes connected with decouplers each with their own Probe core. The decouplers were set at the last point in the staging rocket and actually controlled with either Key bindings or just moused and decoupled. \u003C/p\u003E\u003Cp\u003EI would suggest using this addon \u003Ca href=\u0022http://kerbalspaceprogram.com/subassembly-saver-loader/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/subassembly-saver-loader/\u003C/a\u003E to build each individual probe balanced to make launching easier. \u003C/p\u003E\u003Cp\u003EWhile i made mine connect in the middle it\u0027s a real pain to use that addon in that way. best to just build your parasite probes from the bottom up and connect them from the bottom of the engines than try and make them connect to the side with that addaon. I hate myself and wasted a lot of effort in trying to make the rocket look the way I wanted it to instead of what was easiest.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-23T07:47:41Z","Content":"\n\u003Cp\u003EI use this all the time, Typical probe and fuel tank who act as an satellite with ISO and kerthane mapping. this carries 2 to 8 small probe landers. \u003C/p\u003E\u003Cp\u003EAnother approach is to use an orbital tug or mothership as an reusable transfer stage, here I use docking ports and add the parts in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-05-23T08:52:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would suggest using this addon \u003Ca href=\u0022http://kerbalspaceprogram.com/subassembly-saver-loader/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/subassembly-saver-loader/\u003C/a\u003E to build each individual probe balanced to make launching easier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use that a lot, but it also tends to mess up the staging a bit. All Stage 0 from all parts get mixed up as one Stage 0, et cetera. A bit annoying when you have a very complex 79 engine asparagus setup (with separatrons for each stage), as it takes a bit of time and is pretty error prone to sort it out.\u003C/p\u003E\u003Cp\u003EI would have prefered if the stages from the subassemby were simply added after all the other stages. Then I maybe have to drag them around, but I don\u0027t have to sort out every single part.\u003C/p\u003E\n"},{"CreatedByName":"internetlad","CreatedById":67165,"CreatedDateTime":"2013-05-23T09:07:00Z","Content":"\n\u003Cp\u003Ein it\u0027s most simplistic manner, I don\u0027t expect this would be too difficult to do, all it would take is a tri-coupler flipped upside down, and you\u0027ve got 3 well designed landers on one large launch rocket\u003C/p\u003E\n"}]}