{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":2103,"Articles":[{"CreatedByName":"papuchalk","CreatedById":185036,"CreatedDateTime":"2020-03-02T22:17:47Z","Content":"\n\u003Cp\u003E\nI found a Mun Arch, it is around 120 meters high.  Tiny lander below\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YzdnBXK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YzdnBXK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CnIi5Yk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/CnIi5Yk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NorIIUD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NorIIUD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2020-03-02T23:07:09Z","Content":"\n\u003Cp\u003E\n(1.8.1) Not a great deal to report for my weekend or for my day today, though what did happen was important enough. My day on Friday began at the \u003Cem\u003EDystopia Planitia\u003C/em\u003E orbital shipyards over Kerbin, where I ordered up the print of a \u003Cem\u003EBoop-Boop 7x\u003C/em\u003E probe to handle a satellite contract I\u0027d picked up. I was in no hurry to have the probe finished and engineer Ceri Kerman, a proven idiot, obliged; construction time was just short of one Kerbin day. One of these days I\u0027ve got to get a better staff at \u003Cem\u003EDP\u003C/em\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\nThat job done, it was time for LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E to begin her historic mission to put an object in orbit of Eeloo and then return to the surface of Kerbin. \u003Cem\u003ECorrino \u003C/em\u003Ebegan her journey by breaking orbit over Kerbin and warping to Jool.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VnMNVW5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/VnMNVW5.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EI knew that I\u0027d have to bleed off a lot of speed to get out to Eeloo; heading to Jool was intended as a time saver, and I think that for the most part it did the trick.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter five warpback maneuvers to bleed off much of the ship\u0027s speed over Jool, the ship proceeded to Eeloo. Unfortunately her arrival speed of 4,194 m/s was tenfold what it should\u0027ve been to attain orbit and the planet\u0027s gravitational pull wasn\u0027t significant enough to bleed it off without a substantial number of warpbacks, so the ship departed Eeloo\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and headed to a position 1.25 Gm over Kerbol to take care of the rest of it. \u003Cem\u003ECorrino\u003C/em\u003E took the opportunity while she was in close proximity to Kerbol to recharge her exotic matter tanks. She eventually returned to Eeloo at 427.8 m/s and attained a 172.0 by 160.1 kilometer, 11.38° orbit over the outer planet. \n\u003C/p\u003E\n\u003Cp\u003E\nUpon attaining orbit, \u003Cem\u003EHouse Corrino\u003C/em\u003E launched the \u003Cem\u003EPink Noise 7a\u003C/em\u003E long-range communications satellite carrier she\u0027d hauled to Eeloo in her drydock. The new satellite, dubbed \u003Cstrong\u003E\u003Cem\u003EEeloocomm Alpha\u003C/em\u003E\u003C/strong\u003E, burned to an orbit of 250.6 by 164.7 kilometers at 0.01° inclination while \u003Cem\u003ECorrino\u0027s \u003C/em\u003Ecrew began construction of a second \u003Cem\u003EPink Noise 7a\u003C/em\u003E craft; construction time was just over 48.5 minutes. \u003Cem\u003EEeloocomm Alpha\u003C/em\u003E reached its final target equatorial orbit at 250.6 kilometers and released its sub-satellites, with the new \u003Cstrong\u003E\u003Cem\u003EEeloocomms Bravo\u003C/em\u003E\u003C/strong\u003E and \u003Cem\u003E\u003Cstrong\u003ECharlie\u003C/strong\u003E\u003C/em\u003E burning for their respective positions over the planet. The second \u003Cem\u003EPink Noise\u003C/em\u003E was finished, fueled and released, with the new \u003Cstrong\u003E\u003Cem\u003EEeloocomm Delta\u003C/em\u003E\u003C/strong\u003E communications satellite burning for a 250.6 kilometer polar orbit prior to launching \u003Cstrong\u003E\u003Cem\u003EEeloocomms Echo\u003C/em\u003E\u003C/strong\u003E and \u003Cstrong\u003E\u003Cem\u003EFoxtrot\u003C/em\u003E\u003C/strong\u003E. Meanwhile, \u003Cem\u003ECorrino\u0027s\u003C/em\u003E crew began printing up a \u003Cem\u003EScanSat\u003C/em\u003E; the new \u003Cstrong\u003E\u003Cem\u003EScanSat Eeloo\u003C/em\u003E\u003C/strong\u003E was finished, fueled and launched after 12 minutes and 39 seconds of construction time, with the new probe burning to a 176.4 by 160.2 kilometer, 90.15° inclined orbit to begin biome resource scans. The day on Friday concluded with \u003Cem\u003ECorrino \u003C/em\u003Ebeginning construction of a \u003Cem\u003EHellhound 7\u003C/em\u003E rover and skycrane, with construction expected to take one hour and 46 minutes. By building the \u003Cem\u003EG-LOC 7a\u003C/em\u003E return-to-Kerbin craft while still in Kerbin orbit and hauling it along to Eeloo rather than printing it on site, I had managed to save enough Rocket Parts for \u003Cem\u003ECorrino \u003C/em\u003Eto print up the scout rover instead; that\u0027s the first time that\u0027s happened. Figures it\u0027d be on the very last world I will visit in the Kerbol system...\u003Cbr\u003E\n \u003Cbr\u003E\nMy day today began, as on Friday, at \u003Cem\u003EDystopia Planitita\u003C/em\u003E; that probe had finished construction, and launched from the shipyard after fueling.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RawA2fF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RawA2fF.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EI don\u0027t launch things from this shipyard very often. Part of that is the fact that I don\u0027t get as many Kerbin-orbiting missions as I thought I would. The other is the aforementioned idiot manning the place...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe probe reached its target position for contract before the day was out. Unfortunately, the replacement contract was a two-kerbal tourist mission to Jool. LSV \u003Cem\u003EHouse Atreides\u003C/em\u003E hadn\u0027t yet left for her big interplanetary tourist mission and she still had open seats, so I reluctantly made the decision to go ahead and wrap that tourist mission into \u003Cem\u003EAtreides\u0027s \u003C/em\u003Emission - there are now nine contracts riding on it. I wound up spending the day finishing getting things set up over Eeloo, so \u003Cem\u003EAtreides \u003C/em\u003Ewouldn\u0027t have been able to depart anyway, but the delay there is still starting to get a bit ridiculous...\n\u003C/p\u003E\n\u003Cp\u003E\nI did at least finish setting things up over Eeloo. All six communications satellites are now in position, and as far as I\u0027m concerned, the system-wide communications satellite network is complete.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FIMmCi5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/FIMmCi5.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EOne last set of triangles for old time\u0027s sake...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will still need to build a ground station at the upcoming planned base on Eeloo, but that will be the last bit of communications hardware I\u0027ll need to install. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also spent a fair amount of time with \u003Cem\u003EScanSat Eeloo\u003C/em\u003E and at this point I\u0027ve finished taking the biome scans. Based on those scans, I want a Highlands/Midlands interface, preferably one along the equator somewhere. I\u0027ve got a spot marked that also happens to be close to an Ice Canyon biome, which also had a fair amount of resources that weren\u0027t to be found in the Highlands (Highlands looks like my best bet though). \u003Cem\u003ECorrino\u003C/em\u003E has finished and launched the \u003Cem\u003EHellhound \u003C/em\u003Eat this point (and at this point it\u0027s in a 54.7 by 54.1 kilometer equatorial orbit awaiting the go-ahead to land), and I\u0027m eager to get down to the surface as soon as possible. \n\u003C/p\u003E\n\u003Cp\u003E\nLast thing that happened today was the completion, at long last, of the orbital shipyard for Moho at the \u003Cem\u003EAban Pearl\u003C/em\u003E outpost on the surface. Fuel was transferred to the booster upon completion and engineer Anemy Kerman climbed into the cupola module. Though the launch pad was destroyed in the process (a fact that doesn\u0027t sting as much owing to the fact that the base had two launchpads), the launch was a success, with the new \u003Cstrong\u003E\u003Cem\u003ENonne Ardere Yards\u003C/em\u003E\u003C/strong\u003E coming on-line after attaining a 76.7 by 76.6 kilometer, 0.46° orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZWUUPu1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZWUUPu1.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EGetting this thing in place only took rolling back the Extraplanetary Launchpads mod to the same version I was using in KSP 1.6.1. Probably oughta report a bug or two in there there somewhere...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNext session I\u0027ll be fueling the shipyard and beginning construction on space station \u003Cem\u003EMohoport \u003C/em\u003Efirst thing. After that will be an \u003Cem\u003EAuk Ia\u003C/em\u003E flight to get tourists Kerwin and Burtop Kerman up to \u003Cem\u003EHouse Atreides\u003C/em\u003E; the plane will stop for refueling at space station \u003Cem\u003EKerbinport \u003C/em\u003Een route. Once that\u0027s done and the plane is away, \u003Cem\u003EAtreides \u003C/em\u003Ewill be heading out for Dres first. Eleven worlds in the system are on her itinerary, so I might as well begin with the hard ones first. \u003Cem\u003ECorrino\u003C/em\u003E, meanwhile, is ready to return to Kerbin; I\u0027m giving \u003Cem\u003EAtreides\u003C/em\u003E priority due to the extensive delay she\u0027s already experienced. The \u003Cem\u003EG-LOC\u003C/em\u003E that \u003Cem\u003ECorrino \u003C/em\u003Eis carrying will be de-orbited upon her return and the hope is that this will unlock surface landing at Eeloo. \u003Cem\u003ECorrino \u003C/em\u003Eherself will likely begin construction of a \u003Cem\u003ETBD 7e\u003C/em\u003E base-seeding rover when she\u0027s back home for delivery to Eeloo along with the single remaining outpost crew aboard. Looking forward to getting that done. Other than that I don\u0027t have much else going on; \u003Cem\u003EAtreides \u003C/em\u003Ehas tied up nine of my contracts, three more are waiting for time to elapse, and \u003Cem\u003ECorrino\u0027s \u003C/em\u003Egot the exploration contract. The other two are survey missions, one at Laythe and one at Eve, both of which I can do at any time (translation: when I have far less going on). I\u0027ll keep y\u0027all up to date on things and let you know how tomorrow goes as early as I can on Wednesday morning...not anticipating getting anything else done today.\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2020-03-03T01:55:46Z","Content":"\n\u003Cp\u003E\nI decided to make some progress in my stock career after neglecting it for JNSQ testing. \n\u003C/p\u003E\n\u003Cp\u003E\nMy Dres Surveyor lander finally arrived and set down safely in the lowlands, sending back images of grayness:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MMi9OM1.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.44\u0022 height=\u0022577\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/MMi9OM1.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xFIUHm4.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.02\u0022 height=\u0022614\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xFIUHm4.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGot another combination relay \u0026amp; lander into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E for the upcoming Jool transfer, this one headed for Val\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222OnvCRf.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002252.27\u0022 height=\u0022535\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2OnvCRf.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother new addition to the third flight of Jool exploration craft is the Laythe Ocean Explorer 1, a torpedo-based underwater exploration craft.  No images of this one - the fairing stays on till Laythe entry, so not much to see yet.\n\u003C/p\u003E\n\u003Cp\u003E\nThe highlight of my session was my Jool-Pioneer finally reaching Tylo for a fly-by, followed by fly-by\u0027s of Laythe and Val, then getting set up for a Bop fly-by, which should be in about 2 weeks.  There should be plenty of fuel in the NERV stage to set up a Pol fly-by after Bop, then establish orbit somewhere.  Both Laythe \u0026amp; Vall occurred on the night side, so there wasn\u0027t much to see unfortunately.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iIWkfG0.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.53\u0022 height=\u0022568\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iIWkfG0.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IOIp3nM.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002251.86\u0022 height=\u0022531\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IOIp3nM.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Dirkidirk","CreatedById":200064,"CreatedDateTime":"2020-03-03T02:13:01Z","Content":"\n\u003Cp\u003E\nAfter hours apon hours of tweaking and frustration over the crashing, I have Finally built and flown my first functioning space shuttle! (impressive) \n\u003C/p\u003E\n\u003Cp\u003E\nHere it is during launch:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223-2-2020-8-35-25-PM-f1i1ygxh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.ibb.co/rw1FFG2/3-2-2020-8-35-25-PM-f1i1ygxh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here it is replacing the propulsion module of my space station:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223-2-2020-8-34-37-PM-qyivzrpq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.ibb.co/ZWyfbdK/3-2-2020-8-34-37-PM-qyivzrpq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here it is splashing down after it\u0027s successful mission, only losing a nose cone and some solar panels:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223-2-2020-8-34-18-PM-u445vqsb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.ibb.co/4JtF794/3-2-2020-8-34-18-PM-u445vqsb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso, in case your wondering, the name of this glorious spacecraft is \u0022space shuttle\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that is all I did today, along with starting development of a New spacecraft!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003Emost eventful day of ksp anyone ever had. like two things happened!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-03T02:37:09Z\u0022 title=\u002203/03/2020 02:37  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 3, 2020\u003C/time\u003E by Dirkidirk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"eberkain","CreatedById":157548,"CreatedDateTime":"2020-03-03T02:45:30Z","Content":"\n\u003Cp\u003E\nwe did not make it to the mun today.  \u003Cimg alt=\u00229esBCKG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9esBCKG.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elro2k","CreatedById":195935,"CreatedDateTime":"2020-03-03T03:22:37Z","Content":"\n\u003Cp\u003E\nI just finished my second Munar Outpost! I got rid of my first one, since it is now redundant. This outpost is now the epicenter for all of my Munar missions going forward. It is a great little base with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E for my landers and rovers. One rover is a fuel tanker and the other is my cargo variant. The rovers are my own design, but the base itself was created by Juggernoob and can be found here: \u003Ca href=\u0022https://kerbalx.com/Juggernoob/Surface-Outpost-Zugspitze\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Juggernoob/Surface-Outpost-Zugspitze\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CGET5Si.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/CGET5Si.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2020-03-03T06:38:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223750714\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583151619\u0022 data-ipsquote-userid=\u0022157548\u0022 data-ipsquote-username=\u0022eberkain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, eberkain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI redesigned my mfd button controller one more time, did half the soldering on the aviation connectors, broke my soldering iron, and did some more programming on the kos side. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/qpL47qs.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022qpL47qs.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002291.70\u0022 height=\u0022685\u0022 width=\u0022747\u0022 src=\u0022https://i.imgur.com/qpL47qs.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow are you drawing solid lines that cross?   I\u0027ve been using the | and __ characters and it doesn\u0027t look anywhere near that good. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-03-03T07:07:29Z","Content":"\n\u003Cp\u003E\nGoing to Dress.\u003Cbr\u003E\u003Ca href=\u0022https://imgur.com/4FIVpCr\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u00224FIVpCrh.png\u0022 src=\u0022http://i.imgur.com/4FIVpCrh.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"papuchalk","CreatedById":185036,"CreatedDateTime":"2020-03-03T08:19:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223751116\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583203530\u0022 data-ipsquote-userid=\u0022157548\u0022 data-ipsquote-username=\u0022eberkain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, eberkain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwe did not make it to the mun today.  \u003Ca href=\u0022https://i.imgur.com/9esBCKG.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00229esBCKG.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9esBCKG.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwhere do you get those better lookin parachutes?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbuvim","CreatedById":160177,"CreatedDateTime":"2020-03-03T10:10:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223751183\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583217532\u0022 data-ipsquote-userid=\u0022123362\u0022 data-ipsquote-username=\u0022RizzoTheRat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, RizzoTheRat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow are you drawing solid lines that cross?   I\u0027ve been using the | and __ characters and it doesn\u0027t look anywhere near that good. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is a text-mode pseudographics\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://unicode-table.com/en/blocks/box-drawing/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://unicode-table.com/en/blocks/box-drawing/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"eberkain","CreatedById":157548,"CreatedDateTime":"2020-03-03T11:57:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223751200\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583223592\u0022 data-ipsquote-userid=\u0022185036\u0022 data-ipsquote-username=\u0022papuchalk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, papuchalk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhere do you get those better lookin parachutes?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRestock is amazing. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223751231\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583230235\u0022 data-ipsquote-userid=\u0022160177\u0022 data-ipsquote-username=\u0022Kerbuvim\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Kerbuvim said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt is a text-mode pseudographics\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://unicode-table.com/en/blocks/box-drawing/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://unicode-table.com/en/blocks/box-drawing/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, but you also need a font that supports it.  I am using Unifont for my terminals. \n\u003C/p\u003E\n"},{"CreatedByName":"HyperDraco","CreatedById":188993,"CreatedDateTime":"2020-03-03T13:07:20Z","Content":"\n\u003Cp\u003E\n(1.6.1)\n\u003C/p\u003E\n\u003Cp\u003E\nI installed the GEP last night and now have a brand new system to fiddle around with!\n\u003C/p\u003E\n\u003Cp\u003E\nI may have destroyed it once or twice already. But that\u0027s a minor setback.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a new nuclear probe nearly ready to land on some far off world to prepare for colonisation.\n\u003C/p\u003E\n"},{"CreatedByName":"michaelbezos1","CreatedById":201635,"CreatedDateTime":"2020-03-03T13:08:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223745861\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221582453736\u0022 data-ipsquote-userid=\u0022201635\u0022 data-ipsquote-username=\u0022michaelbezos1\u0022 style=\u0022border-color:#ededed #e8e8e8 #dbdbdb #666666;border-style:solid;border-width:1px 1px 1px 2px;color:#353c41;font-size:14px;padding:0px 15px;\u0022\u003E\n\u003Cdiv style=\u0022color:#222222;font-size:13px;padding:5px 15px;\u0022\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/page/2099/\u0026amp;tab=comments#\u0022 rel=\u0022\u0022 style=\u0022background-color:transparent;color:#222222;font-size:16px;vertical-align:middle;\u0022\u003E \u003C/a\u003E\u003Cspan\u003E \u003C/span\u003EOn 2/23/2020 at 10:28 AM,\u003Cspan\u003E \u003C/span\u003E\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/?app=core\u0026amp;module=members\u0026amp;controller=profile\u0026amp;id=201635\u0026amp;do=hovercard\u0022 href=\u0022https://forum.kerbalspaceprogram.com/?app=core\u0026amp;module=members\u0026amp;controller=profile\u0026amp;id=201635\u0022 rel=\u0022\u0022 style=\u0022background-color:transparent;color:#222222;\u0022\u003Emichaelbezos1\u003C/a\u003E\u003Cspan\u003E \u003C/span\u003Esaid:\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\nlooked for some program which open deb file but i need also to install win zip\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nUhh, what OS are you actually running? .deb files are packages for Debian GNU/Linux and derivatives, winzip is for Windows, hence the name.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nAlso, this is really the wrong thread for such discussion...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI do not know if it is wrong thread but annoys much as i donwloaded the 7z1900 exe whic hshould open the deb files and like at almost every application at ubuntu the an error occurred while loading the archive. \n\u003C/p\u003E\n\u003Cp\u003E\nIt is thread for discussion as it blocks my development at kerbal space program as if i had 2 notebook i could play efficiently 2 games and in this way i am losing space race. \n\u003C/p\u003E\n\u003Cp\u003E\nI will try to install debian now. \n\u003C/p\u003E\n\u003Cp\u003E\nMuch love:\u0026gt; \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-03T13:23:34Z\u0022 title=\u002203/03/2020 01:23  PM\u0022 data-short=\u00224 yr\u0022\u003EMarch 3, 2020\u003C/time\u003E by michaelbezos1\u003C/strong\u003E\n\u003Cbr\u003Eadding info\n\u003C/span\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2020-03-03T21:34:53Z","Content":"\n\u003Cp\u003E\nBeen patching more and more for the last few days. Almost done with all parts of the \u0022Aero\u0022 category!\u003Cbr\u003E\u003Cimg alt=\u00228H5BvVd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8H5BvVd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAside from these I have completed \u003Cs\u003Eall solar panels, batteries, TCS, landing gears and wheels...\u003C/s\u003E a LOT of parts!\u003Cbr\u003E\nI might want to consider starting my own thread some time soon.\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2020-03-04T02:24:33Z","Content":"\n\u003Cp\u003E\nContinued progress on my career:\n\u003C/p\u003E\n\u003Cp\u003E\nPioneer-Jool finished fly-by\u0027s of all the Joolian moons, then set up a 75* inclined elliptical orbit around Tylo to act as a relay until better probes arrive\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OijGVqo.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002258.07\u0022 height=\u0022594\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/OijGVqo.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy third \u0022flight\u0022 of Jool probes departed Kerbin for the long trip, pictured here is my Laythe Ocean Observer departing\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oUsvAF2.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.62\u0022 height=\u0022549\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oUsvAF2.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd also brought Jeb, Kelrik \u0026amp; Ambera home from their 200-day surface test on Minmus.  A Minmus rescue contract popped up just before they departed and since they had an extra seat, Jeb insisted on stopping to help.  It looks kinda low, but I had at nearly 4km clearance above the hills.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pJYA4iD.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002257.41\u0022 height=\u0022587\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pJYA4iD.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI also finally finished the R\u0026amp;D level 3 upgrade and the 2800 saved up science points resulted in some very rapid scientific advancements - 3.75 engines \u0026amp; tanks, \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E \u0026amp; Graviolli detectors, specialized electrics \u0026amp; hypersonic aerodynamics.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-04T02:26:08Z\u0022 title=\u002203/04/2020 02:26  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 4, 2020\u003C/time\u003E by Cavscout74\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Garrygirthoak","CreatedById":203119,"CreatedDateTime":"2020-03-04T03:36:36Z","Content":"\n\u003Cp\u003E\nInstalled \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E and made 5 stage rocket with the intention of rescuing a crew orbiting Eve. 1st stage consists of firing 4 hammers, 4 LVT Reliants and a single Vector.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k8KINep.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/k8KINep.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2020-03-04T12:51:17Z","Content":"\n\u003Cp\u003E\nI love the Kerbal Space Program.  On almost any day, it feels like I have devoted my whole life to it.\n\u003C/p\u003E\n\u003Cp\u003E\nI started my current \u003Cem\u003EOrbit\u003C/em\u003E production world in Jan 2018.  (We were running v1.6.1 back then.  v1.7.3 nowadays...)  Time progressed in 2018 more or less in sync with real-time.  That gave a real feel of what it is like to wait for missions to arrive at their destinations.  I\u0027m still waiting for Eve and Jool.\n\u003C/p\u003E\n\u003Cp\u003E\nMoho slipped through my fingers.   Mission Control made bumper stickers, \u0022Next time: we \u003Cstrong\u003Ebrake\u003C/strong\u003E for Moho; OK?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nDuna was simpler.  But that\u0027s \u003Cstrong\u003Eall\u003C/strong\u003E to show for the lapse of two years!!  UT (Universal Time) now: Y2 D186 04:24:55.  (Time progression picked up slightly during 2019.)\n\u003C/p\u003E\n\u003Cp\u003E\nStats Dept reports \u0022346 flights in progress\u0022.  System Monitor Desk reports \u002298.3% of memory in use\u0022.  \u003Cstrong\u003E\u0022Cap\u0027n, she can\u0027t take much more!  She\u0027s already swapping at Warp 62.2%...\u0022\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know what that means but I know the vibrations on Flight Deck are shaking my fillings loose.\n\u003C/p\u003E\n\u003Cp\u003E\nBeing Kommandant is a crushingly lonely job.  Inspire Confidence.  Maintain Loyalty.  Some days, I just feel like rolling back Time and starting over: Leaner, Younger -- Eager.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EBut the rules of this \u003Cem\u003EOrbit\u003C/em\u003E are, \u0022Manage Complexity!\u0022\u003C/u\u003E.  Directives: \u0022Time warp not to exceed 30 minutes\u0022.  Otherwise, \u0022launch, or progress, some other operation\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nToo much -- and too many -- depending upon me doing my job; every day; faultlessly.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I do feel a weary readiness -- well, not quite -- to succumb to a restart; but I know it\u0027s my Duty to instill order, cohesion and meaning in this Program.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027d be the same, done again, anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022\u003Cu\u003EOnly the weak start over\u003C/u\u003E\u0022, my Chief Instructor at the Academy drummed into us.\n\u003C/p\u003E\n\u003Cp\u003E\n                   \u003Cs\u003E                                                                        \u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d4GF5h1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/d4GF5h1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot much quiet time on the Flight Deck, but occasionally I like to check in on the flights out there I haven\u0027t heard from in a while.  And in truth, am struggling to remember at all.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is \u003Cem\u003E\u003Cstrong\u003EKontiki\u003C/strong\u003E\u003C/em\u003E above.  (So \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E informs me.)\n\u003C/p\u003E\n\u003Cp\u003E\nIt has 4 km/s delta.  7 souls onboard.  Destination appears to be Eve and an intercept has been plotted.  A maneuver in 44d.  It has an ion booster, but I don\u0027t recall its \u003Cem\u003Emarque\u003C/em\u003E.  \u003Ca href=\u0022https://kerbalx.com/Hotel26/Terrapin\u0022 rel=\u0022external nofollow\u0022\u003ERecords will have that\u003C/a\u003E.  I\u0027d publish \u003Cem\u003E\u003Cstrong\u003EKontiki\u003C/strong\u003E\u003C/em\u003E but have no clue yet whether it will perform flawlessly.  (It could be irresponsible to send even more Kerbals to their doom, ignorantly?)\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t envy the job of the descent to the Eve surface that \u003Cem\u003E\u003Cstrong\u003EKontiki\u003C/strong\u003E\u003C/em\u003E seems intended for...?  May Luck travel with this ship, in the company of its crew...\n\u003C/p\u003E\n\u003Cp\u003E\nCommand is the loneliest job.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-04T14:54:31Z\u0022 title=\u002203/04/2020 02:54  PM\u0022 data-short=\u00224 yr\u0022\u003EMarch 4, 2020\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2020-03-04T14:41:01Z","Content":"\n\u003Cp\u003E\n(1.8.1) Well, as anticipated, I didn\u0027t get anything else done after my late afternoon post on Monday, and Tuesday wound up being an abbreviated day thanks to the game deciding to try to use too much RAM at an inopportune time coupled with a late drop off at work, which killed off the early morning session. So today\u0027s going to be fairly minimal.\n\u003C/p\u003E\n\u003Cp\u003E\nMy day began with the freshly launched \u003Cem\u003ENonne Ardere Yards\u003C/em\u003E over Moho. The shipyard\u0027s SAFER reactors were fired up and the mass driver brought on-line, after which the shipyard received its first shipment of fuel, Rocket Parts and Xenon Gas from the \u003Cem\u003EAban Pearl \u003C/em\u003Eoutpost on the Mohoan surface. Thus supplied, the shipyard began construction on an \u003Cem\u003EIkeport Core 7 Station\u003C/em\u003E destined to become space station \u003Cem\u003EMohoport\u003C/em\u003E. Construction is estimated at 46 hours and 23 minutes to completion, with one resupply necessary here in a few Kerbin days.\n\u003C/p\u003E\n\u003Cp\u003E\nMy \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E calendar was completely open after work began at \u003Cem\u003ENAY\u003C/em\u003E, so I had the option to either send up a pair of straggling tourists to LSV \u003Cem\u003EHouse Atreides\u003C/em\u003E in high Kerbin orbit so that she could begin her long-delayed interplanetary tourist mission or to bring LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E home from Eeloo. After careful consideration, I went against my original plan and brought \u003Cem\u003ECorrino \u003C/em\u003Ehome.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FxyY1AT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/FxyY1AT.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EHouse Corrino\u003Cem\u003E heading out. She\u0027ll be back here before I know it.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ECorrino \u003C/em\u003Ebroke orbit over Eeloo and warped to Kerbin, arriving at 9,476.8 m/s; it took 22 warp-backs for the ship to bleed off sufficient speed to enter a 555.8 by 473.6 kilometer, 1.26° inclined orbit. Once in orbit, \u003Cem\u003ECorrino \u003C/em\u003Ereceived a shipment of Rocket Parts via mass driver from the \u003Cem\u003ESouth Base\u003C/em\u003E outpost near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and began construction of a \u003Cem\u003ETBD 7e Moho\u003C/em\u003E base-seeding rover/lander, which will deliver the system\u0027s final initial outpost to Eeloo once permission to land is received. The Moho lander design should be more than sufficient for an Eeloo landing. Construction time on the lander is expected to be around 6.5 hours total with two scheduled resupplies. \n\u003C/p\u003E\n\u003Cp\u003E\nWith construction of the \u003Cem\u003ETBD \u003C/em\u003Eunderway, the \u003Cem\u003EG-LOC 7a \u003C/em\u003Ereturn-to-Kerbin craft that \u003Cem\u003ECorrino \u003C/em\u003Ehad hauled out to Eeloo from Kerbin departed, burning from \u003Cem\u003ECorrino\u0027s \u003C/em\u003Eposition to a 554.9 x 100.3 kilometer, 0.46° orbit initially. While waiting for the craft to reach periapsis, tourists Kerwin and Burtop Kerman along with recent rescuee scientist Samdock Kerman boarded an \u003Cem\u003EAuk XV\u003C/em\u003E 3-passenger spaceplane; the original plan had been just for the tourists to ride up in an \u003Cem\u003EAuk Ia\u003C/em\u003E but I remembered that I wanted to get Samdock back up to space station \u003Cem\u003EKerbinport \u003C/em\u003Eand since the tourists were headed that direction, the opportunity was there to take care of that. The tourists wound up spending over an hour sitting on the tarmac waiting for \u003Cem\u003EKerbinport \u003C/em\u003Eto come into position at a point where the \u003Cem\u003EG-LOC \u003C/em\u003Ewasn\u0027t going to need to maneuver, a situation that didn\u0027t present itself until the craft was already on the ground as it turned out...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WfPnyYR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WfPnyYR.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EOrdinarily I\u0027d be thrilled to have a G-LOC land this close to the space center, but a part of me was worried it\u0027d hit the plane this time around. Managed to give it a wide berth though.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cem\u003EG-LOC\u003C/em\u003E was recovered successfully, landing 2.4 kilometers west-northwest of the space center to clear the current exploration contract. The next exploration contract calls for a spacewalk and crew transfer over Eeloo, which I\u0027ve elected to handle when \u003Cem\u003ECorrino \u003C/em\u003Ecan return. A satellite contract for Bop was also offered and accepted, closing out the day yesterday.\u003Cbr\u003E\u003Cbr\u003E\nThis morning it was finally time to get the plane airborne.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225KkXSh1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5KkXSh1.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003E(Airborne? Spaceborne? Starborne? Can\u0027t really decide on the proper term here...).\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe craft broke atmosphere ten minutes later and burned to set up a rendezvous with \u003Cem\u003EKerbinport\u003C/em\u003E. Rendezvous will take place in fourteen minutes time; before that occurs, the first resupply shot to \u003Cem\u003EHouse Corrino\u003C/em\u003E will take place.\n\u003C/p\u003E\n\u003Cp\u003E\nSo time permitting today I\u0027ll be getting the last few tourists up to \u003Cem\u003EHouse Atreides\u003C/em\u003E, after which she\u0027ll \u003Cstrong\u003Efinally \u003C/strong\u003Ebe able to head out with 46 tourists aboard. I\u0027ll have to get the plane back down at some point; I may just go ahead and have it head back to \u003Cem\u003EKerbinport \u003C/em\u003Efor now and land it later, but I haven\u0027t really decided what I\u0027ll do there just yet. I need to go ahead and get construction on that Bop probe going but that should be straightforward enough, and I may once again delay it for the sake of \u003Cem\u003EAtreides\u0027s \u003C/em\u003Emission. Ship\u0027s first stop is Dres, where she\u0027ll be dropping off nine colonists for the \u003Cem\u003ESleipnir A\u003C/em\u003E outpost on the surface. Moho will be up after that, with one lousy tourist wanting to visit orbit (couldn\u0027t settle for a simple flyby, no...had to be orbit....). Longer term, \u003Cem\u003EHouse Corrino\u003C/em\u003E will be heading back to Eeloo. The activities she needs to do there are simple enough and I\u0027m hopeful that permission for landing will be granted at that point. i already have a scout rover in Eeloo orbit ready to land as soon as the word is given, and with \u003Cem\u003ECorrino \u003C/em\u003Ealready in orbit a ground outpost will hopefully be quick to follow - going to depend on the outcome of the scout rover\u0027s mission. Still going to be looking for windows of opportunity to do the survey missions on Laythe and Eve as well. Hopefully the day goes well and I\u0027ll have a bit more to report to y\u0027all tomorrow.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-04T16:07:37Z\u0022 title=\u002203/04/2020 04:07  PM\u0022 data-short=\u00224 yr\u0022\u003EMarch 4, 2020\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003Cbr\u003Efixing italics. Because the universe will cease to exist otherwise...\n\u003C/span\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-03-04T14:54:58Z","Content":"\n\u003Cp\u003E\nMy new KSP video: \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/Gz29qSm_j4s?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2020-03-04T15:00:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223751507\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583271293\u0022 data-ipsquote-userid=\u0022173586\u0022 data-ipsquote-username=\u0022Delay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Delay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBeen patching more and more for the last few days. Almost done with all parts of the \u0022Aero\u0022 category!\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n\u003Cp\u003E\nAside from these I have completed \u003Cs\u003Eall solar panels, batteries, TCS, landing gears and wheels...\u003C/s\u003E a LOT of parts!\u003Cbr\u003E\nI might want to consider starting my own thread some time soon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooking good; gotta love how the updated shaders actually show some environment light effects on the parts.  Something I sorely miss whenever I have to use parts that still use the stock shaders...  Excellent work on these conversions.\n\u003C/p\u003E\n\u003Cp\u003E\nIf/when you do start your own thread, you\u0027ll have at least one instant subscriber \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Dan Kerman","CreatedById":193616,"CreatedDateTime":"2020-03-05T02:14:42Z","Content":"\n\u003Cp\u003E\nUpgraded to KSP 1.9.1 and then upgraded mods and then some UI adjustments that didn\u0027t transfer over. Test run and my Minmus lander doesn\u0027t leap off the surface anymore. Yippee!!! Seems to run smoother..  the stutter every 5 seconds is gone too!\n\u003C/p\u003E\n"},{"CreatedByName":"papuchalk","CreatedById":185036,"CreatedDateTime":"2020-03-05T09:28:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223752055\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583374482\u0022 data-ipsquote-userid=\u0022193616\u0022 data-ipsquote-username=\u0022Dan Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Dan Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUpgraded to KSP 1.9.1 and then upgraded mods and then some UI adjustments that didn\u0027t transfer over. Test run and my Minmus lander doesn\u0027t leap off the surface anymore. Yippee!!! Seems to run smoother..  the stutter every 5 seconds is gone too!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyees 1.9.1. is amazing, it runs smooth and much nicer graphics\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nwhat do you mean your lander doesnt leap off surface anymore?? my modules still jump after timewarping - both on Mun and Minmus\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-03-05T09:29:00Z\u0022 title=\u002203/05/2020 09:29  AM\u0022 data-short=\u00224 yr\u0022\u003EMarch 5, 2020\u003C/time\u003E by papuchalk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-03-05T14:33:47Z","Content":"\n\u003Cp\u003E\nStill puttering around with my Wings career.\n\u003C/p\u003E\n\u003Cp\u003E\nI said I\u0027d fly a plane by the Mun and dagnabbit I flew a plane by the Mun. This is \u003Cem\u003Enot,\u003C/em\u003E repeat, NOT, the easiest, most efficient, or generally best way to do that, but who cares? -- Anyway, both planes performed well enough. The lifter plane is a bit less stable on re-entry than I intended, I lost control when it hit thicker air but was able to put it into a steep dive and then regain it. If I decide to iterate on it I\u0027ll move the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E forward a little, or the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E back a little. It did make orbit pretty efficiently, it had just a hair over 3400 m/s on it and got an \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E over 135 km with a few drops left for the deorbit burn.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Munar module was fine. Dropped that one right on the Dessert Airfield. Aimed for that with the lifter but because of the incident with the loss of control I didn\u0027t quite make it.\n\u003C/p\u003E\n\u003Cp\u003E\nScatterer works great on 1.9.1 by the way, if you force DX12 and use a few custom configs. Check the development thread for details.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hgjjN53.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/hgjjN53.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x8KqdMz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/x8KqdMz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i1vBLca.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/i1vBLca.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022V96Oxqe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/V96Oxqe.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KIVmqTI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KIVmqTI.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelbezos1","CreatedById":201635,"CreatedDateTime":"2020-03-05T18:04:04Z","Content":"\n\u003Cp\u003E\nAlmost lost two notebook but fortunately they found. Today the rocket set cost 69,99 i heard arrived so the launches spread and boost. But still postponing the ubuntu steam installation as it takes so much time .\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMuch Love:\u0026gt; \n\u003C/p\u003E\n"},{"CreatedByName":"Dan Kerman","CreatedById":193616,"CreatedDateTime":"2020-03-06T01:18:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223752152\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221583400504\u0022 data-ipsquote-userid=\u0022185036\u0022 data-ipsquote-username=\u0022papuchalk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, papuchalk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyees 1.9.1. is amazing, it runs smooth and much nicer graphics\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nwhat do you mean your lander doesnt leap off surface anymore?? my modules still jump after timewarping - both on Mun and Minmus\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had the problem with my Minmus lander where, whenever another craft came within physics range, 2.3 km.. it would leap up and crash. Had something  to do with how landed objects sat on/slightly below the actual surface and would create stability issues.. World Stabilizer mod didn\u0027t help so waited until 1.9.1 was released to upgrade.\n\u003C/p\u003E\n"}]}