{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":1282,"Articles":[{"CreatedByName":"Planetace","CreatedById":195406,"CreatedDateTime":"2017-03-18T20:19:37Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EI SAW IT!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022Ji3mFAk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/Ji3mFAk.png\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIT WAS WHITE!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIT WAS ALL EXPLOSIONY!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAND IT EAR RAPED EVERYTHING!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIT WAS \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E PROMETHEUS CLASS \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E LIFTER!!!\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"NISSKEPCSIM","CreatedById":173812,"CreatedDateTime":"2017-03-18T20:21:37Z","Content":"\n\u003Cp\u003E\nI\u0027m sooooo happy right now. I\u0027m overjoyed. After a whole day of testing, ironing out wrinkles, and pulling my hair out in frustration, I finally got the MAKS to work. So, without further ado, here is the report of the full launch, hidden in a spoiler, because if you are reading \u0027Kontakt\u0027, this is a spoiler.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe full stack on the runway at \u0027Bigimot\u0027 (Russian: БИГИМОТ) Cosmodrome. (Just the Kerbal Konstructs \u0027KSP Cosmodrome\u0027)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RAPTepr.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/RAPTepr.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe above is actually an image of an earlier iteration, one that was 150 m/s DeltaV short of reaching orbit with decent fuel left.\n\u003C/p\u003E\n\u003Cp\u003E\nFlight to 9km altitude:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226X5QLGM.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6X5QLGM.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, the up-to-date pictures.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause separation is a mess of action groups and mashing the \u0027S\u0027 key, there were no pictures taken, but here\u0027s the ascent with the \u0027Molnia\u0027 spaceplane and the ET, which had to be converted into a booster to balance the thrust:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022flMRVye.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/flMRVye.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBecause separation of the ET/booster is also a mess of mashing keys and action groups, there were no shots taken of either the separation or the orbital insertion; but here\u0027s a beauty shot of the thing in orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KMwGvCc.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KMwGvCc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing FMRS, I switch back to the carrier aircraft and fly back to the runway:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226HfeIg2.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6HfeIg2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OWCYJt3.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OWCYJt3.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLining up for approach:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HH9xPwR.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HH9xPwR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGently touching down at a leisurely 120m/s. You now see why I have so many drogues.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y0hNZAq.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/y0hNZAq.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224IZCfbi.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/4IZCfbi.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OxVlMAr.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OxVlMAr.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing FMRS to jump back to the main mission, I save, open up the tracking station, and... the game crashed. I\u0027ll recover the carrier aircraft and begin the de-orbit burn tomorrow, as well as publish a new chapter of \u0027Kontakt.\u0027\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-18T21:32:54Z\u0022 title=\u002203/18/2017 09:32  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 18, 2017\u003C/time\u003E by NISSKEPCSIM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2017-03-18T21:00:54Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EDue to some upgrades, my first stage booster was able to land a little more on target than expected.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/KeNhT40.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022KeNhT40.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tErPtS4.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022tErPtS4.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CYr90ir.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022CYr90ir.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/k0IvVNh.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022k0IvVNh.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E-Rocket\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2017-03-18T21:25:53Z","Content":"\n\u003Cp\u003E\nSent the lads on a quick jaunt to Mint Chocolate Minmus. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SMXxFHx.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/SMXxFHx.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI have no idea how changing the color is done, but apparently it is pretty simple. It also makes for a more interesting landing on an otherwise routine mission.\n\u003C/p\u003E\n\u003Cp\u003E\nYes that is a green monolith in the background. Hard to see in the white background forum but Kerbin is high above the monolith.\n\u003C/p\u003E\n"},{"CreatedByName":"BaryonicMan","CreatedById":99615,"CreatedDateTime":"2017-03-18T23:10:43Z","Content":"\n\u003Cp\u003E\nI saw a solar eclipse during return from the Mun.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/WtOiG1E29l4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2017-03-19T00:30:28Z","Content":"\n\u003Cp\u003E\nThe launch of the Kritz Space Hotel resulted in a huge surge of demand for holidays amongst the stars. Never ones to invent a new wheel, mission control instructs engineering to modify the Manticore spaceplane that carried 16 tourists on a tour of Gael\u0027s moons, doubling the passenger capacity without sacrificing operational range. Engineering responds by adding an extra cabin and two more rapiers and calling it finished.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DqZjero.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/DqZjero.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out, this was exactly the right thing to do, and Manticore II arrives at the Kritz with over 2km/s of fuel left in the tank. Which raises a new thought with mission control...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022w7eHOuz.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/w7eHOuz.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSome of our team are still languishing in the realm of 2-star ranks. Rather than figure out the who went where with whoms, mission control packs every single kerbonaut onto Manticore III and ships them off to Niven orbit en-masse, with instructions not to come back until they\u0027re better at their jobs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222HTdET7.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/2HTdET7.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWeirdly, the plan works. Not only are all kerbonauts at least 3 stars upon their return, but Manticore III proves so fuel-laden that it doesn\u0027t even have to wait for a proper return window and heads straight home after only a couple of days in Niven orbit. Somehow having yet more fuel left over on arrival back at Gael, the excess is left with the Piggu tanker, following the old saying: lift fuel once, shame about gravity, lift fuel twice, shame about your mission planning department. Round trip time, roughly 550 days.\n\u003C/p\u003E\n\u003Cp\u003E\nExactly what everyone at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was doing for those 550 days remains a mystery... though there\u0027s now a distinct scent of fried onions hanging around the hangar that definitely wasn\u0027t there before.\n\u003C/p\u003E\n\u003Cp\u003E\n(Ed: It\u0027s about this point that I realised I\u0027d left the heating at 40% after backing down from 3.2x to 1x, which explains the brutal aerocaptures I\u0027ve been pulling off. But whatever - frankly I\u0027m enjoying the game more without that mechanic anyway, so it can stay gone.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T00:31:27Z\u0022 title=\u002203/19/2017 12:31  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by eddiew\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brownhair2","CreatedById":128730,"CreatedDateTime":"2017-03-19T00:31:30Z","Content":"\n\u003Cp\u003E\nRefueled the Emperor via klaw:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://s1.postimg.org/ogabkbtv3/Claw.png\u0022 alt=\u0022Claw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot entirely sure how you pump fuel through a metal claw, but I\u0027ll roll with it.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I sent it on its way to Gauss:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://s13.postimg.org/vql56v6l3/Emperor_Departure_2.png\u0022 alt=\u0022Emperor_Departure_2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen spent way too much time trying to get to a remote corner of Gael only to find no anomaly there. KerbNet how could you do this to me \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWell, let\u0027s see what other anomalies we ha--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://s4.postimg.org/wpsxwyzct/Nerd_s_Periphery.png\u0022 alt=\u0022Nerd_s_Periphery.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis was a randomly generated name, I swear.\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2017-03-19T00:37:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222990177\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489883490\u0022 data-ipsquote-userid=\u0022128730\u0022 data-ipsquote-username=\u0022Brownhair2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Brownhair2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nerd_s_Periphery.png\u0022 src=\u0022https://s4.postimg.org/wpsxwyzct/Nerd_s_Periphery.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy home.\n\u003C/p\u003E\n"},{"CreatedByName":"Andetch","CreatedById":173643,"CreatedDateTime":"2017-03-19T01:05:15Z","Content":"\n\u003Cp\u003E\nToday I brought  some tourists back from Duna system, meanwhile I also discovered I can\u0027t land on Eve. Sort of..... I missed a waypoint and now one tourist ship needs to spend the next 5 years orbiting Kerbol before it gets another shot at landing. Serves me right for flying 4 ships around without quicksaving!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2017-03-19T01:29:22Z","Content":"\n\u003Cp\u003E\nLast night and today, Val continued her assigned work.\n\u003C/p\u003E\n\u003Cp\u003E\n(Science game)\n\u003C/p\u003E\n\u003Cp\u003E\nWhile Munar Lander Mod. 2 was giving journeyman service for voyages to Kerbin\u0027s moons, R\u0026amp;D had kept remarkably close-mouthed about what they were working on.  They had gobbled up a huge quantity of data taken from three Mun missions and two multi-landing Minmus missions since the last significant spacecraft or launcher upgrade, and rumors had started to circulate that they were spending their time eating pizza and playing video games.  None of this was connected with Jeb\u0027s puffy eyes and drawn look; after all, he was close with a number of the R\u0026amp;D types; legend has it he was recruited by Werner himself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022The%20scale%20of%20the%20problem_zps91hx\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a183/dqualls/KSP%20Images/The%20scale%20of%20the%20problem_zps91hxchsu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHowever, with the growing awareness of the magnitude of the potential threat posed by the new type of body the astronomers call an \u0022asteroid\u0022 (because no matter how much magnification you apply, it still just looks like a star in the eyepiece at the limit of seeing quality), an R\u0026amp;D spokesman was authorized to reveal the previously secret subject of R\u0026amp;D\u0027s late nights and Jeb\u0027s fatigue: Far Traveler.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Far%20Traveler%20Ready_zpskrfshnbo.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a183/dqualls/KSP%20Images/Far%20Traveler%20Ready_zpskrfshnbo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis vessel was originally designed with its sights on Gilly, Ike, Duna, and Dres.  It has more than 5 km/s delta-V in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E while pushing the heavy upgraded lander, and the transfer stage uses seven of the new Poodle engines to get maximum use from its fuel, while maintaining the ability to thrust at nearly 1 gee with full tanks.  The lander itself is good for more than 1.2 gee, and was extensively hover tested around \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E during development.  In order to assure the (6) boosters fall clear of the (7 tanks, 7 engines) core, and give enough thrust for positive liftoff, each booster has \u003Cem\u003Efive\u003C/em\u003E Thud engines in addition to the Mainsail, giving this launcher a total of 43 engines (13 Mainsails and 30 Thuds) firing at liftoff.  With the boosters pumping fuel into the seven core tanks, this launcher can circularize, even in polar orbit, with a restart of the booster core, leaving it on orbit with seven Poodle engines and enough fuel to run them for more than \u003Cem\u003Efive minutes\u003C/em\u003E.  By the previous standards of the KSP, Far Traveler is a monster -- but it gets the job done.\n\u003C/p\u003E\n\u003Cp\u003E\nDespite Jeb having done the testing of the lander and launcher, Val was selected for the first actual mission in this new vessel, because planetary missions are on temporary hold while the asteroid problem is evaluated.  Asteroid are hers, for now.\n\u003C/p\u003E\n\u003Cp\u003E\nThe selected target of her new mission was YMQ-666, which tracking showed was due to pass Kerbin within the Mun\u0027s orbit.  Val was to attempt to get close enough to get a visual, and if possible rendezvous and return science data (ideally including a surface sample).  Due to a miscommunication, she launched north, rather than south, but Mission Control recommended continuing the mission, so she burned to put herself into a synchronous orbit (same period as Kerbin\u0027s rotation, though not stationary), which after plane correction would cross the asteroid\u0027s path during its Kerbin encounter.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Far%20Traveler%20outbound_zpshv9lmyaq.pn\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a183/dqualls/KSP%20Images/Far%20Traveler%20outbound_zpshv9lmyaq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce her high parking orbit was established, Val made a large burn to \u003Cem\u003Ecompletely reverse her orbit\u003C/em\u003E -- effectively, a 180 degree phase change, though at the apoapsis she had, the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E was hardly more than a Mun return.  Once that was done, with the thought that she might actually be able to nudge the asteroid\u0027s orbit with her landing legs if she could park against it, she decoupled the lander and docked it back to the transfer stage, nose to nose, then deactivated the lander engines and flipped an all-important switch to reverse her controls, allowing her to fly by instruments with the same orientation she would have had in the command pod prior to decoupling.  Then it was time to wait.  After three orbits, plotting reported she had an intercept at a reasonable distance, and she made a burn to extend her orbit and correct her plane a fraction of a degree, then made two tiny correction burns (\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E only, with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E shut off between burns to ensure it didn\u0027t cause drift) to give a final predicted intersect of only 2.1 km (albeit with 185\u002B m/s relative velocity).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Far%20from%20home_zps3poyvh7n.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a183/dqualls/KSP%20Images/Far%20from%20home_zps3poyvh7n.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen she arrived at the intercept, however, there was nothing in sight.  A rock estimated at half the length of the ship ought to have been visible, at least as a blinking dot, many kilometers away, but not only did she see nothing, the Tracking Station couldn\u0027t confirm a second object near her location.  With the intercept passed (seemingly missed), and with nothing to show (even her science observations produced nothing new, since she was still in an orbit of Kerbin), she made a pretty small burn to lower her periapse into the upper atmosphere, and headed for home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Almost%20Home_zpsnfs1z5yf.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a183/dqualls/KSP%20Images/Almost%20Home_zpsnfs1z5yf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the first pass, she made a powered aerobrake with the transfer stage engines (testing a technique expected to be useful for future voyages), lowering her apoapse from 4000\u002B km to around 800 km in a single pass despite burning for less than a minute at 10% throttle, and without changing her periapse (selected at 55 km), thus demonstrating that repeated passes could be used if needed to control heating.  On the next orbit (now just over an hour, compared to a full Kerbin day) she decoupled the transfer stage, still with 30% fuel, returned her controls to normal orientation, reactivated the lander\u0027s descent engines, and made a reentry burn test requested by mission control.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore burning out the lander\u0027s descent stage tanks (in conjunction with aerobraking above 50 km) she\u0027d dropped more than 2 km/s velocity.  She staged away the descent stage and found the ascent stage, now falling into somewhat thicker atmosphere around 40 km, was able to reduce velocity from just below orbital to about 1.3 km/s with use of only half its fuel.  For the first time since the early orbital launches, she opened her parachutes without any loss of the ablation layers on her heat shield.\n\u003C/p\u003E\n\u003Cp\u003E\nDespite bringing back almost no data that R\u0026amp;D could use, she had learned things that Planning could turn into better future asteroid missions.  One of these things, it was discovered, was that under circumstances yet to be fully defined, the plotting system at Mission Control could give a \u0022ghost\u0022 position for an asteroid that had not yet entered Kerbin\u0027s sphere.  In this case, it was found that, despite Tracking Center correctly showing asteroid YMQ-666 due for a Kerbin periapsis in 67 days, Mission Control\u0027s plotting system had shown it already beginning its encounter at the time of Val\u0027s launch.  Technicians are on watch-and-watch until this problem is tracked down; in the meantime, priority is being give to another object, ASA-666, for which Tracking shows a Kerbin encounter due to begin thirteen days after Val\u0027s landing, and end thirteen days later -- but its Kerbin periapsis is zero, to the accuracy of available measurements.  It appears this object may impact Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately, ASA-666 is tiny, what the astronomers are now calling Class A (the smallest current technology can detect in near-Kerbin space), with size comparable to a Munar Lander ascent stage and mass almost certainly less than the transfer stage and lander combined; it\u0027s very unlikely to do major damage, though it\u0027s uncertain what it might do if it strikes a population center.  Val\u0027s next mission is to verify its size, if possible, and evaluate the possibility of deflecting it (or another object on a similar collision course).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-03-19T03:00:57Z","Content":"\n\u003Cp\u003E\nGot \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0 1.2.2 Install working and running ok, started with the basics getting sounding rockets up and working toward manned flight.  This afternoon Jeb went out in the Cronus O1P to become the first Kerb in orbit for Cronus \u0026amp; Rhea Launch Systems.  I was going to take pictures but it got hectic.  First the boosters were a wee overpowered.  Jeb is complaining of persistent groin pain from the high G forces on ascent.  Then as he settled in for a battery of system tests having made orbit the Heat shield mounted between the service module (the one with the fuel to get home) shatters, evidently some kind of explosive gas formed in it on the ascent and after a few hours in zero-G it blew up....  The battery started developing faster and faster discharge rates, slightly overheating, this warmed up the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel tank, which thankfully had just been used to get the capsule into a low enough orbit for capture. The exploding \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E shocked Jeb into action and he got the Science bay doors closed.  Amazingly the 771x335km orbit turn into a x90km capture and the science bay survived the re-entry shielding the rest of the capsule very well. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lXngzod.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lXngzod.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/6JqTebu.png\u0022 class=\u0022ipsImage\u0022 alt=\u00226JqTebu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/4B4nd0Y.png\u0022 class=\u0022ipsImage\u0022 alt=\u00224B4nd0Y.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/6ij3N1h.png\u0022 class=\u0022ipsImage\u0022 alt=\u00226ij3N1h.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T06:02:51Z\u0022 title=\u002203/19/2017 06:02  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by Bornholio\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wrench Head","CreatedById":175503,"CreatedDateTime":"2017-03-19T03:51:04Z","Content":"\n\u003Cp\u003E\nRocked on with some collider work!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ZgvG0FRPqD4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSee the Garage\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/157573-monkeyheads-garage/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T03:55:28Z\u0022 title=\u002203/19/2017 03:55  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by Wrench Head\u003C/strong\u003E\n\u003Cbr\u003EDead link\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2017-03-19T03:51:12Z","Content":"\n\u003Cp\u003E\nOk, I fixed the flat nose on my float-back booster.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pismbW9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/pismbW9.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ReXynEv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/ReXynEv.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L0cQCJa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/L0cQCJa.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222AgUau6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/2AgUau6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022se55x4I.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022http://i.imgur.com/se55x4I.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFlight album:  \u003Ca href=\u0022http://imgur.com/a/WNwt0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/WNwt0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t fly any better, but it looks better and, let\u0027s be honest...  that\u0027s what really matters.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T03:52:34Z\u0022 title=\u002203/19/2017 03:52  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2017-03-19T04:38:21Z","Content":"\n\u003Cp\u003E\nDesigned a rover with skycrane to abuse Bon Voyage and harvest all those biomes. I didn\u0027t test it, though. Heavy, but has plenty of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, good enough thrust and room for a pilot so I don\u0027t depend on a network connection, a scientist to reset experiments and an engineer to fix the wheels. Maybe I should also add a Lab to the skycrane?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k9mG5U3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/k9mG5U3.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2017-03-19T05:44:27Z","Content":"\n\u003Cp\u003E\nSlowly getting ready to do my Mass exidous to Dres for the first time. Just wish we could get those more of the Explore x moon/planets instead of one at a time. Been streaming a lot more as well. Just for funsies. Also getting excited by the expansion pack. Just wish others where not excitable in the other direction.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbital","CreatedById":170602,"CreatedDateTime":"2017-03-19T14:08:54Z","Content":"\n\u003Cp\u003E\nNot sure what to do next. Almost feel like quitting. So I\u0027ve been having fun building some weird, some cool, some even weirder ships but the problem is that all that coolness increases part count a lot for no other benefit, but looks. These ships look and work great when flown alone. But when I start docking them to large stations or motherships, my framerate drops to single digits and stutter becomes unbearable even with MemGraph.\n\u003C/p\u003E\n\u003Cp\u003E\nI have also been having problems with extremely slow loading times and switching between ships and facilities. I noticed that my save game file has grown significantly. I looked inside and there is information stored for every thing every Kerbal did, every landing spot, every science experiment ever done, etc. My last quicksave file has 131,587 lines!\n\u003C/p\u003E\n\u003Cp\u003E\nSo I have been running into the same wall over and over trying to fly a proper mission. I like to collect experiment data and have my Kerbals progress with every thing they do. And I wanted my crew to visit each and every planet and moon in the system. But by the time I get to Dres, my game starts slowing down to the point of being unplayable. in 500\u002B hours I have not been able to fly further than Dres for this reason. I get carried away with ship designs to detrimental effects every single time \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn top of that, I am too dumb and too impatient to do orbital and inter-planetary maneuvers by hand, I can\u0027t precision land by hand either, so I have to use MechJeb and MechJeb seems to have problems flying large, wired, multi-engine ships or ships that include non \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E engines. All crashes during landing happened to ships with non \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E engines from other mods. MechJeb does some truly weird maneuvers while landing non \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E ships. The same ship switched to \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E engines engines lands fine.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it seems like the next thing to do is to cut down on mods and try to build ships that are functional and keep part count to minimum. I also have no tried SSTU mod yet, because I like to build my ships from ground up.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, this will lower screenshot opportunities:)\n\u003C/p\u003E\n\u003Cp\u003E\nI have some pics to post later.\n\u003C/p\u003E\n\u003Cp\u003E\nI really wish for performance fixes for KSP \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dangerhamster","CreatedById":146944,"CreatedDateTime":"2017-03-19T14:20:34Z","Content":"\n\u003Cp\u003E\nWith a succession of training missions dipping out of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E underway planning has started on establishing permanent Mun and Minmus bases, also with an eye to future Duna deployment. Designed to be assembled remotely and established with life support (Snacks) in place before occupation. Each base consists of any number of MOM\u0027s (Mission Orientated Module) which can be mixed and matched to suit. Each module is built on a common chassis designed to fit in the Mk3 cargo bay ready for the resurrection of the Deliverance system lost in the GDSD (Great Deleted Save Disaster). An engineering mockup of the Deliverance business end was constructed and concept validation carried out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot147_zpshgod8fzt.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i382.photobucket.com/albums/oo265/glostersoul/KSP/screenshot147_zpshgod8fzt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFrom validating the chassis and docking system prototype MOMS were deployed with mixed results... The MOM\u0027s are capable of crossing moderate terrain at \u0022careful\u0022 speed so future landing sites will need proper scouting. Thanks to the recent Comnet deployments this can be done by probe rovers capable of being rejigged as solo crew runabouts. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot150_zpsia0ajn6q.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i382.photobucket.com/albums/oo265/glostersoul/KSP/screenshot150_zpsia0ajn6q.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith beefier support legs the current iteration has (so far) resisted physics attacks as well as multiple raising/lowering of the legs and repeated timewarping.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot153_zpsyloazdtr.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i382.photobucket.com/albums/oo265/glostersoul/KSP/screenshot153_zpsyloazdtr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the exception of an errant EVA knocking off one of the antenna the Mk4 units have held up well (there I said it, kiss off death).\n\u003C/p\u003E\n\u003Cp\u003E\nThe scout rover system was also field tested. It also comes with a relay/refuge pod with enough supplies to allow any wandering Kerbals to survive until rescue.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot139_zpsaaxgnurh.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i382.photobucket.com/albums/oo265/glostersoul/KSP/screenshot139_zpsaaxgnurh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFor some reason the little rover has gained the appellation Giggity.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T17:39:58Z\u0022 title=\u002203/19/2017 05:39  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by dangerhamster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-03-19T14:26:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222990640\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489932534\u0022 data-ipsquote-userid=\u0022170602\u0022 data-ipsquote-username=\u0022Kerbital\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, Kerbital said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot sure what to do next. Almost feel like quitting. ...\n\u003C/p\u003E\n\u003Cp\u003E\nI really wish for performance fixes for KSP \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEvery ship left in orbit on land  etc is adding up. dump anything that is actually done being used. Leave the comsats you need and maybe emergency ships.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your making a large part ship, use the welding mod to put together many of the parts, just maek sure you know what can\u0027t be welded without loosing function (things like \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E/wings...) structure/tanks and eye-candy weld great.\n\u003C/p\u003E\n\u003Cp\u003E\nStart a new career, play a new scale or \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E or Gale, play hard mode or SETI, set requirements on yourself to recover things (Stage recovery or FRMS).  Play \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0.  Lots of depth left. Oh and learn to play harderer mode, do all the things manually.\n\u003C/p\u003E\n"},{"CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2017-03-19T14:51:19Z","Content":"\n\u003Cp\u003E\nInfographic about my upcoming Mars mission:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IZ5Usva.png\u0022 class=\u0022ipsImage\u0022 height=\u0022653\u0022 src=\u0022http://i.imgur.com/IZ5Usva.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E for scale:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kRBu7sT.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/kRBu7sT.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ds19YCe.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/ds19YCe.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a0fxLZq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/a0fxLZq.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbital","CreatedById":170602,"CreatedDateTime":"2017-03-19T15:16:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222990654\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489933568\u0022 data-ipsquote-userid=\u0022173101\u0022 data-ipsquote-username=\u0022Bornholio\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, Bornholio said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEvery ship left in orbit on land  etc is adding up. dump anything that is actually done being used. Leave the comsats you need and maybe emergency ships.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your making a large part ship, use the welding mod to put together many of the parts, just maek sure you know what can\u0027t be welded without loosing function (things like \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E/wings...) structure/tanks and eye-candy weld great.\n\u003C/p\u003E\n\u003Cp\u003E\nStart a new career, play a new scale or \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E or Gale, play hard mode or SETI, set requirements on yourself to recover things (Stage recovery or FRMS).  Play \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0.  Lots of depth left. Oh and learn to play harderer mode, do all the things manually.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYup, debris set to \u00220\u0022 and I remove all unused craft. It\u0027s my tendency to build large, complex ships. I already play with coms on low range, etc to add some difficulty, but I just can\u0027t fly manually. I tried a joystick, a gamepad, maneuver node mods but it\u0027s too hard and too tedious to fly manually. Just did clean reinstall and will give SSTU a shot. My goal is to finish visiting all bodies in the system for now. Too bad my save game won\u0027t work after reinstall so I lost all my experienced Kerbals.\n\u003C/p\u003E\n"},{"CreatedByName":"Planetace","CreatedById":195406,"CreatedDateTime":"2017-03-19T16:28:45Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022eLtT4su.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022http://i.imgur.com/eLtT4su.jpg\u0022 width=\u0022979\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe TITAN series has been very successful! The Prometheus has revolutionized \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E carrying technology and can carry 1500 tons into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E! This holds the record for most tons capable of being carried into orbit with an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI hold a world record...\n\u003C/p\u003E\n"},{"CreatedByName":"HurricanKai","CreatedById":175469,"CreatedDateTime":"2017-03-19T16:48:20Z","Content":"\n\u003Cp\u003E\nToday I Finished my Duna Prograde-Orbital Base and the ProGrade-Orbit RemoteTech System, Now I can Start send my First Supply Drops onto duna (I never Landed there Before) and Start building my base \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2017-03-19T17:15:51Z","Content":"\n\u003Cp\u003E\nJust another Munar mission, with more science and RADAR mapping. Looking for a good place to set down a permanent base.\u003Cbr\u003E\u003Cbr\u003E\nTo be honest, Minmus is far easier to do with all the flat wide open area\u0027s. The Mun is......problematic at finding a large smooth area.\n\u003C/p\u003E\n"},{"CreatedByName":"astroheiko","CreatedById":174159,"CreatedDateTime":"2017-03-19T18:08:04Z","Content":"\n\u003Cp\u003E\nI am struggling to design a spaceplane for Catullus. I want to bring 3 Kerbals with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E to the moon to explore all biomes.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the best attempt so far. I have not built such a strange thing yet. I can not decide whether it is pretty or ugly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wwzEChS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/wwzEChS.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe aerobraking works in any case perfectly, it stabilizes itself and brakes beautifully. Nothing gets too hot.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221m41fgx.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/1m41fgx.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D9UpShq.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/D9UpShq.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe landing also worked quite well, with 50m / s but a bit fast. \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E also works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tXcbwD5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/tXcbwD5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe return to orbit, however, gives me headaches. Before you have not reached at least 100km altitude, you can not really put the pedal to the metal. The atmosphere is furiously thick. That is why I have chosen a high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to reach this height as quickly as possible. But can not say whether this was really the right decision.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uPlPan4.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/uPlPan4.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne tank after another is blown off. Lastly also 4 of the 5 darts but the fuel is simply not enough. This was my best attempt so far. I guess I have to install at least 500 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. Or a higher starting point, or both.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229JlWfu2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://imgur.com/9JlWfu2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere really was not much missing, AP at 200 km, PE was already at -62km when the rocket fell dry. Orbit would be reached at 280km.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll get you.\n\u003C/p\u003E\n\u003Cp\u003E\nGreetings\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T18:12:24Z\u0022 title=\u002203/19/2017 06:12  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by astroheiko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brownhair2","CreatedById":128730,"CreatedDateTime":"2017-03-19T18:12:50Z","Content":"\n\u003Cp\u003E\nI investigated Nerd\u0027s Periphery. What other option did I have?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Gael_Highlands.png\u0022 src=\u0022https://s23.postimg.org/t652edqff/Gael_Highlands.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLadies and gentlemen, may I present:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ENerd\u0027s Periphery!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nerd_s_Periphery_Exposed.png\u0022 src=\u0022https://s16.postimg.org/osv4r1x9x/Nerd_s_Periphery_Exposed.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou know, I\u0027d be lying if I said I wasn\u0027t a little disappointed.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T20:14:23Z\u0022 title=\u002203/19/2017 08:14  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by Brownhair2\u003C/strong\u003E\n\u003C/span\u003E\n"}]}