{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":51,"Articles":[{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-08-02T19:52:01Z","Content":"\n\u003Cp\u003EMISSION UPDATE!\u003C/p\u003E\u003Cp\u003EAfter the engineering debacle that stranded Bob and Jebediah on the surface of the Mun, there was a massive public outcry against the suits at Munstak Industries, and the Kerbal Space Center. Picketers camped outside the gates, as eggs and other rotten fruit was lobbed at executives and flight engineers alike. Babies were left abandoned in the streets! Really, it was horrible. It wasn\u0027t long before MI:KSC released an official statement that a rescue operation was underway.\u003C/p\u003E\u003Cp\u003EAfter making sure that the fuel lines were \u003Cem\u003Eactually\u003C/em\u003E attached this time, Bill Kerman set out solo a newer, modified version of the Munar Mission Package. The experimental Mechanical Jebediah Unit (or MechJeb, as it is well known amongst the flight engineers who built it) was attached to allow for the lander to land remotely, freeing up both seats in the ascent stage for Bob and Jeb.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C8UxPFi.jpg\u0022 alt=\u0022C8UxPFi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBecause the technology was still experimental, Mission Control decided it would be smart to include a live pilot who is high on courage and low on stupidity to monitor its performance and take over manual control if necessary. If MechJeb botched the landing, Bill would have to take over remotely from the CM. This required an interesting contingency: because the mission planners had decided to explore Beggar\u0027s Canyon - inconveniently placed on the far side of the Mun - the lander could not be controlled remotely from mission control in the event something went wrong. In order to make sure Bill had the most time possible to react to anything that went wrong, the lander performed some brief maneuvers to place it just on the cusp of the CM\u0027s horizon. At the next passover, MechJeb took control and landed the ship perfectly. How perfectly? This image should speak for itself:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3gHEReS.png\u0022 alt=\u00223gHEReS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENeedless to say, our two survivors didn\u0027t have to walk very far...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/joQmZIO.png\u0022 alt=\u0022joQmZIO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd this time, the ascent stage separated just as it was supposed to and off they went!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xuVSlQd.png\u0022 alt=\u0022xuVSlQd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately, no pictures are available of the rendezvous and docking with the CM, or the flight back home. The ascent stage performed as required and Bill was once again joined happily with his two comrades, whom he had not seen in several Kerbal days. The reception on Kerbin was much warmer than the last - with orange soda and snacks a\u0027plentiful. The picketers packed up and went home - the baby that somebody had carelessly left on the runway was returned to its mother, and life back home returned to normal...\u003C/p\u003E\u003Cp\u003E...But back on the Mun, the story was already etched into eternity. Future visitors to Beggars Canyon will take note of the strange sight there, that tells the story of pride, fuel lines, and monumental oversight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rUaj2Lo.png\u0022 alt=\u0022rUaj2Lo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for reading! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2013-08-02T23:38:10Z","Content":"\n\u003Cp\u003EDrove around Duna some more and kept crashing rover and re-loading quick save. Decided I need to brake down and build a Dwarven Flying machine as it would be much safer then driving on Duna for such a smallish rover I have. And wishing I would stop getting logged out ever few seconds from forums.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-08-02T23:50:52Z","Content":"\n\u003Cp\u003EToday I built an incredibly fast plane and decided to go exploring:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot359.png\u0022 alt=\u0022screenshot359.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot371.png\u0022 alt=\u0022screenshot371.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot373.png\u0022 alt=\u0022screenshot373.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot384.png\u0022 alt=\u0022screenshot384.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot390.png\u0022 alt=\u0022screenshot390.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately, while scouting out for a landing site, our plane entered a spin and we decided that the mountains were as good a landing site as any.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot392.png\u0022 alt=\u0022screenshot392.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bagg","CreatedById":11040,"CreatedDateTime":"2013-08-03T01:39:31Z","Content":"\n\u003Cp\u003EToday I put 55 kerbals next to the munarch...\u003C/p\u003E\u003Cp\u003EOn one ship....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3Sn1Z.png\u0022 alt=\u00223Sn1Z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3SmUf.png\u0022 alt=\u00223SmUf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3SmVV.png\u0022 alt=\u00223SmVV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3SmWp.png\u0022 alt=\u00223SmWp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3SmZt.png\u0022 alt=\u00223SmZt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor no good reason either...\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-03T02:12:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Immashift\u0022 data-cite=\u0022Immashift\u0022\u003E\u003Cdiv\u003EI looked at the image, went \u0022wut?\u0022, looked down, and lol\u0027d. Hard.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook at the name of the rover, then realize the x3 is a multiplier. Now read it again.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-03T02:54:15Z","Content":"\n\u003Cp\u003EToday I decided to experiment with autonomous rovers. I picked the MÃƒÂ¼n as a nice close target to practice on. My first mission, Lunokkerbal-1 was an abject failure.\u003C/p\u003E\u003Cp\u003E The crack design team decided to start from plans provided by the lowest bid contractor, who predictably failed to provide documentation for the design. The Kerbals designing the launcher failed to realize that the lander/rover design included a mounting truss block on the bottom of the rover and decided to improvise. They mounted a separation on top of the lander and inverted it, then mounted the whole contraption on top of a basic asparagus staged rocket - two sets of two boosters, one set feeding the second, with the second set feeding the somewhat larger core, with a small second stage on top of that. Simple and effective. Unfortunately, the combination of assembly errors in the VAB and confusion among the ground controllers from the upside down lander led to a suborbital trajectory and a rain of flaming debris about halfway around Kerbin. \u003C/p\u003E\u003Cp\u003ELunokkerbal-2 fared much better, at least at first. First off, the assembly crew must have gotten a good lunch during the off-shift, because they noticed that handy mounting strut block under the rover. So after it was uprighted properly and reattached to the booster, the controller crew confusion was prevented. Next, the earlier assembly errors were corrected (gotta remember to pay close attention to the placement of the correct Separatrons in the right places in the staging sequence). Rebuilt and improved, it was time to head to the MÃƒÂ¼n! Launching at the near-optimal phase angle, the mission looked great through the trans-MÃƒÂ¼n injection burn. Once we got into the MÃƒÂ¼n\u0027s sphere of influence, things went south. An orbital insertion burn was planned but when it came time to maneuver to the prier attitude and burn, nothing happened. After much wailing, gnashing of teeth, and scratching of little green heads, it was observed that despite being well-provisioned with solar panels, neither the lander nor the rover were equipped with batteries. The entire outbound leg of the trajectory was facing almost directly away from the sun. D\u0027oh! So Lunokkerbal-2 is now looping around the Kerbin system in a highly-elliptical orbit. Barring a possible future collision with the MÃƒÂ¼n some months or years hence, that\u0027s where it will remain, a hazard to navigation and a monument to oversight.\u003C/p\u003E\u003Cp\u003ELunokkerbal-3 corrected this flaw, and with gusto. The rover, the lander AND the upper stage of the booster were provisioned with battery packs, and an auxiliary articulated solar array was installed on the upper stage for the outbound leg of the voyage to ensure that the batteries remained fully charged throughout the voyage. Launch, orbital insertion and trans-MÃƒÂ¼nar injection were carried out without a hitch. However, in their rush to correct previous errors and finally get an autonomous rover on the MÃƒÂ¼n, the ground crew missed the optimal launch window but tried to brute force it anyway. This resulted in an empty upper stage combined with a trajectory that had a fairly low periapsis over the MÃƒÂ¼n but on an escape trajectory rather than a stable orbit. In for a penny, in for a Kerbuck ... the ground crew decided to try anyway. The dumped the empty stage and tried to kill over 1,000 m/s of horizontal velocity and about 8,000 meters of altitude with just the four small lander engines. This did not end well; the remains of Lunokkerbal-3 are scattered over a 1,500 meter peak on the lip of a crater somewhere. Back to the VAB!\u003C/p\u003E\u003Cp\u003EThe engineers tried the prevent this error in the only way they know how: brute force. The size of the booster fuel tanks was doubled. The core stage was increased in length by 50%. The fuel capacity of the upper stage was doubled as well. This time, the stars aligned and Lunokkerbal-4 made it into a nice stable low-MÃƒÂ¼nar orbit with plenty of fuel to spare. Anxious to get their new toy on the ground, the controllers killed most of the horizontal velocity with the booster stage (still well-provisioned with fuel for the task) and began a descent from about 8,000 meters. The lander stage ran out of fuel maybe 20 meters above the ground but landed safely in the low gravity. Staging the now-empty lander was anticlimactic; lacking any fuel to fly away, the lander just sort of fell off the back of the lander, like the shell of a dead insect. \u003C/p\u003E\u003Cp\u003EIt looks a little sad there, but our rover is FINALLY on the ground, safe and sound, ready to explore the region for suitable crewed landing sites!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1342.photobucket.com/albums/o777/LameLefty/screenshot45_zps936172e5.png\u0022 alt=\u0022screenshot45_zps936172e5.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elen Sila","CreatedById":72902,"CreatedDateTime":"2013-08-03T03:13:38Z","Content":"\n\u003Cp\u003EPerformed a 760-m/s capture burn using only atmospheric drag (no engine thrust), managing to get within only a few kilometers of my desired trajectory.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s13.postimg.org/9isimu15j/2013_08_02_00016.jpg\u0022 alt=\u00222013_08_02_00016.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cesarcurado","CreatedById":60073,"CreatedDateTime":"2013-08-03T03:24:57Z","Content":"\n\u003Cp\u003ESent Jeb on a one-way trip to Duna.\u003C/p\u003E\u003Cp\u003EHe sacrificed himself for the good of setting a flag, what a brave kerbonaut... \u003C/p\u003E\u003Cp\u003EHis home is now a \u0022MK1 Cockpit\u0022.\u003C/p\u003E\u003Cp\u003EActually, forget \u0022one-way trip\u0022, I will probably make a rescue mission, after all, Jeb is Jeb.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UkGOUwb.png\u0022 alt=\u0022UkGOUwb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VdkRsSw.png\u0022 alt=\u0022VdkRsSw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uhZs8y6.png\u0022 alt=\u0022uhZs8y6.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-03T03:26:27Z","Content":"\n\u003Cp\u003EI put up the core of the Horizon refueling station in a separate save as I build infrastructure for my attempt at a grand tour mission.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-03T03:26:55Z\u0022 title=\u002208/03/2013 03:26  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 3, 2013\u003C/time\u003E by Captain Sierra\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"RexKramer","CreatedById":76862,"CreatedDateTime":"2013-08-03T05:57:37Z","Content":"\n\u003Cp\u003EI had Jeb test the limits of how long a space suit can keep a guy alive.\u003C/p\u003E\u003Cp\u003EHe had been on Mun for a while, I was going to bring him home. Turns out I had almost, but not quite, enough fuel to make orbit from the surface of Mun. Ran out of fuel before orbit was achieved. No RCS, I had planned on the tanker performing the docking, and return to Kerbin. It looked real bad for Jeb.\u003C/p\u003E\u003Cp\u003ESince there wasn\u0027t much to lose, I had Jeb exit the lander, and was able to use his spacesuit thrusters to achieve orbit. I wasn\u0027t able to bring up an orbit screen for Jeb while on EVA, so the orbit was far from circular- about 33,000 peri and 95,000 apo. So Jeb was no longer in immediate danger of making a new crater on Mun, but he was now orbiting Mun with just his space suit.\u003C/p\u003E\u003Cp\u003EI had no ships near Mun capable of being occupied, so I hastily assembled and launched one with a HSC. \u003C/p\u003E\u003Cp\u003ESince Jeb\u0027s orbit around Mun was quite elliptical, the rendezvous with the free-floating spaceman was tricky. But I did manage to get the ship within 15 meters of Jeb. He was still alive! And real happy to see a rescue vessel. He\u0027d been floating around Mun for days by then, it takes a while to get a ship out there..\u003C/p\u003E\u003Cp\u003EJeb\u0027s spacesuit \u0027orbit burn\u0027 had only used about 18% of his suits RCS fuel, so he still had plenty to maneuver himself to the HSC, and board it. In my haste to get a rescue container out to him, I forgot to put parachutes on his rescue vessel, so there will be at least one additional ship involved in returning Jeb safely to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-03T06:15:19Z","Content":"\n\u003Cp\u003EToday I learned that KSP is hard.\u003C/p\u003E\u003Cp\u003EI sent a rover \u002B satellites to Moho and didn\u0027t have enough delta-V for braking because I insisted on an early launch window and screwed up the initial burn because I only had a single nuclear engine (how I hate them) so I just pancaked the whole mission in the interests of keeping the solar system clean.\u003C/p\u003E\u003Cp\u003EThen I switched to the rover I had sent to Eve, performed a perfect insertion with just enough delta-V left over to get the rover over a continent, then managed to mess up the landing by dropping the rover into an ocean.\u003C/p\u003E\u003Cp\u003ETomorrow I\u0027m going to send some Kerbals to Duna.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-03T07:24:34Z","Content":"\n\u003Cp\u003EInstalled universe replacer!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DGdFnH7.jpg\u0022 alt=\u0022DGdFnH7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMilly, still alone on the Mun, noticed the change imediately. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jbZ88Kw.png\u0022 alt=\u0022jbZ88Kw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Hey, Mission control? Something\u0027s up with the sky.\u0022\u003C/p\u003E\u003Cp\u003E\u0022What?\u0022\u003C/p\u003E\u003Cp\u003EShocked and surprised, a crew was immediately dispatched to LKO in the shuttle. To investigate. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MtjnvTI.png\u0022 alt=\u0022MtjnvTI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow could this happen? Was Karistotle correct, and the stars are only points of light on a massive background, making the Kerbol system the only one in the universe? \u003C/p\u003E\u003Cp\u003EBill\u0027s not quite sure what to make of it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hyPREIY.jpg\u0022 alt=\u0022hyPREIY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn other news, I got my story I\u0027m working on a little closer to completion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-03T07:27:05Z\u0022 title=\u002208/03/2013 07:27  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 3, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-03T08:31:27Z","Content":"\n\u003Cp\u003EI got the opportunity to test my new KORS (Kerbal Orbital Recovery Ship). After a design flaw, or rather I underestimated the fuel requirements of landing my 250 ton Mun base stranded Jeb, Bill, and Bob in orbit around Mun, Ed Kerman launched the KORS from the station and recovered the three stranded Kerbalnauts. \u003C/p\u003E\u003Cp\u003ENow that they are on board (due to lag when leaving SOI I am not warping when it gets under 10 minutes to escape/enter) all I have to decide is do I put them back at the station and let them take the escape pods down to KSC or do I bring the ship down as it was originally intended to do.\u003C/p\u003E\u003Cp\u003EAs it turns out, the vessel is structurally flawed for an orbital drop. The chutes deployed and the lander can which had the most chutes (8) slammed into the stuff on top of it essentially making it explode. The command capsule which only had 2 chutes was too heavy to safely return off just 2 chutes and slammed into the ground at 16m/s making it explode. \u003C/p\u003E\u003Cp\u003ESo rather than a rescue mission my space agency just lost 4 kerbalnauts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-03T08:48:29Z\u0022 title=\u002208/03/2013 08:48  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 3, 2013\u003C/time\u003E by annallia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BananaLee","CreatedById":73706,"CreatedDateTime":"2013-08-03T12:39:11Z","Content":"\n\u003Cp\u003EHeavens be praised, my belly is raised! It only took me 28 hours of playing from scratch but after following the wee campaign, I\u0027ve managed to put up my constellation of geostationary satellites. And I can probably do them almost routinely now.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LBTzPcY.jpg\u0022 alt=\u0022LBTzPcY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnwards and upwards!\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-08-03T14:16:58Z","Content":"\n\u003Cp\u003Ebeen to the neil armstrong monument and back\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FfmrZBM.jpg\u0022 alt=\u0022FfmrZBM.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-08-03T16:12:12Z","Content":"\n\u003Cp\u003EAdded a 3rd orange tank (full) to my space station. 2 more launches until it is complete. One more fuel tank and one more habitat arm. SO CLOSE!\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-08-03T16:14:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ETomorrow I\u0027m going to send some Kerbals to Duna.\u003C/div\u003E\u003C/blockquote\u003EThose poor Kerbals. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\n"},{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2013-08-03T16:53:21Z","Content":"\n\u003Cp\u003EMade this\u003C/p\u003E\u003Cp\u003EStill working on the actual ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img812/918/k24x.png\u0022 alt=\u0022k24x.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-08-03T17:08:10Z","Content":"\n\u003Cp\u003EI, too, replaced the universe.\u003C/p\u003E\u003Cp\u003EDropped a mining camp onto Minmus - twice, Minmusaur ate the first set of astronauts, they slowly sank under the surface \u0026amp; disappeared. Convinced Minmus is an intelligent carniverous space sponge.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.flickr.com/photos/64324284@N05/9430739604/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3665/9430739604_0e668aacbe_c.jpg\u0022 alt=\u00229430739604_0e668aacbe_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAdded a Kethane refinery \u0026amp; some more tanks to Kerbin station - just need the Kethane shuttle now \u0026amp; I can start on the Laythe mission.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.flickr.com/photos/64324284@N05/9430742342/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3740/9430742342_996b91cd8a_c.jpg\u0022 alt=\u00229430742342_996b91cd8a_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"XIRA","CreatedById":42509,"CreatedDateTime":"2013-08-03T17:46:33Z","Content":"\n\u003Cp\u003EI jumped out of a airplane at 3km height, now i know what kerbals feel when i EVA them in kerbins atmosphere. It is a awesome but terrifying experience!\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-03T17:56:20Z","Content":"\n\u003Cp\u003EToday\u0027s itinerary is to use my Mun-Kerbin fuel mining operation (thanks, Kethane and KAS!) to fully fuel a rather massive station with 4 orange tanks in LKO. The ultimate goal being to send up a long-term Duna mission around day 61 or so. Seeing as it\u0027s day 4 and I\u0027ve already got a fully operational refueling system that takes less than a day per full fueling cycle, I think getting everything in order in time will not be a problem.\u003C/p\u003E\n"},{"CreatedByName":"bogpad","CreatedById":70927,"CreatedDateTime":"2013-08-03T20:29:32Z","Content":"\n\u003Cp\u003EI put my boys through a lot of stress in the last cupple of days, so I decided that they deserved some fun time, and since I have never seen anyone build something like this yet (not claimimng that noone has done it though, just saying I have not seen it yet), I build this for them for amusement:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://666kb.com/i/cgcsfvjj5o1ijmfuf.jpg\u0022 alt=\u0022cgcsfvjj5o1ijmfuf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand they had a really good time with it!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://666kb.com/i/cgcshmywcpdb0r9h3.jpg\u0022 alt=\u0022cgcshmywcpdb0r9h3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe good news is, noone died... the sad news is... it didn\u0027t explode at all, it worked just fine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-03T21:19:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bogpad\u0022 data-cite=\u0022bogpad\u0022\u003E\u003Cdiv\u003Ethe good news is, noone died... the sad news is... it didn\u0027t explode at all, it worked just fine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL!! Love it! Now use KAS to make one of those swing rides and you could open an amusement park \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EMuch more entertaining that what I did today. I just did donkey work, launching and docking the various parts of a flotilla of interplanetary ships. But that took so much time I didn\u0027t have any left to go anywhere.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-03T22:17:25Z","Content":"\n\u003Cp\u003ELast night I sent the updated Cerberus 7 rover delivery system to Mun in 0.21 to follow up on the same mission I did in 0.20, namely to locate the Armstrong Memorial. Finally spotted it...with the lander and all three rovers up what turned out to be a pretty damn steep hill. My crappy little practice rovers were no match for it...lost all three just trying to get down the hill. Ultimately I had to hop the lander itself into a position nearby; how close, I do not know.\u003C/p\u003E\u003Cp\u003ESo I then promptly turned around to try and land my Castle Zulu mission there. Discovered that I\u0027d angled the 24-77s of the descent stage to blow right into the lander\u0027s rovers. So they produced no thrust, and the ascent stage engine wasn\u0027t powerful enough to make the landing safely with all that equipment attached. Had to abort; will hopefully have time tonight to make a redesign and try again.\u003C/p\u003E\u003Cp\u003EThought about picking up work on Atanar\u0027s KSP Card Game myself; doesn\u0027t look like much has happened with it since May. I say that; it\u0027s possible Atanar lost track of the thread in the Great Coffee Spill.\u003C/p\u003E\n"},{"CreatedByName":"SatanX","CreatedById":77414,"CreatedDateTime":"2013-08-03T22:46:47Z","Content":"\n\u003Cp\u003EToday\u0027s milestone was complete with two crews docking in Low Kerbal Orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i40.tinypic.com/2rot6at.jpg\u0022 alt=\u00222rot6at.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut, In the celebrations, someone told Heremone Kerbal that space was filled with cotton candy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/beetmq.jpg\u0022 alt=\u0022beetmq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFuture missions will weld the doors closed unless there truly needs to be an EVA (Heremone has been released from the program \u003C/p\u003E\u003Cp\u003Eeffective immediately and needs to find his own transportation home).\u003C/p\u003E\n"}]}