{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":2166,"Articles":[{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2020-08-04T01:31:43Z","Content":"\n\u003Cp\u003E\nToday I was doing some booster engineering when I realized why I can\u0027t get enough takeoff thrust out of 1.875m crafts prior to engineering.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBecause it never occurred to me that Bobcats are just the right shape to cluster onto a single 1.875m engine plate two at a time without clipping.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOnce I realized that, I threw together a rocket with a five-stack first stage, looked at \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u0027s readouts and promptly dropped my jaw at the 3.77 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E at just over 100 tons. I take my until-now thoughts about this being a worthless piece of work, this is a REALLY kickass engine when clustered! Just one double-engine stack is roughly halfway between a Skipper and a Vector in terms of performance. It\u0027s quite the glutton, though; my five-stack first stage on this 100-ton rocket runs out of juice in less than 40 seconds.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOh, and while I was at it I also added the Pollux \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E to the wiki\u0027s Making History part list, since nobody ever added it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-04T01:55:24Z\u0022 title=\u002208/04/2020 01:55  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 4, 2020\u003C/time\u003E by Fraktal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"noname_hero","CreatedById":201680,"CreatedDateTime":"2020-08-04T08:00:00Z","Content":"\n\u003Cp\u003E\nThis is Valentina. She\u0027s one of the best, and this is a publicity photo, so she\u0027s smiling.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.00\u0022 height=\u0022800\u0022 width=\u00221000\u0022 src=\u0022https://i.postimg.cc/5y75wsGx/screenshot3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut yesterday? Yesterday she was bloody furious.\n\u003C/p\u003E\n\u003Cp\u003E\nHer Eve Lander Module was less than a minute past apogee and the perigee was low enough for a landing. But the rear heat shield wouldn\u0027t inflate, and a quick inspection made her disbelieve her own eyes for a second. There was a /docking port welded to her heat shield/. Apparently, some idiotic tech used an old docking port as a liner to protect the one on the transfer stage from damage, and another idiot welded it in place.\n\u003C/p\u003E\n\u003Cp\u003E\nSo Val was on the clock and she knew she couldn\u0027t stick this landing. And she\u0027s never trained for /this/ eventuality and the module\u0027s staging wasn\u0027t prepared for Emergency Orbital Disassembly. So she braked a bit more, to make sure no debris would make it back onto a stable orbit, ditched most of the lander and cleared the debris field alive. Unfortunately, everything happened in haste, so something, most likely the front heat shield assembly, hit and destroyed the docking port on top of her lander can.\n\u003C/p\u003E\n\u003Cp\u003E\nNow she had a transfer stage with no life support on it and the last ascent stage that lacked a docking port. Sure, her module might have enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to make it back to Kerbin, given she did little more than raise her perigee a bit, but the module had no docking port and no parachute. Why? The new reusable transfer stage, like the older model it replaced as having a better \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, has enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to allow the mission to dock with the KSS back at Kerbin. There was no reason to make the ascent module heavier by adding a heat shield or a parachute. What to do?\n\u003C/p\u003E\n\u003Cp\u003E\nEnter Bill and his contingency planning. There was /another/ ship orbitting Eve, the old tourist bus designed to ferry tourists to Duna and back, pre-positioned to Eve in case something went wrong. So Val took her lander can next to it, aimed her lander onto a descending course, let the engine hiss, which is like letting it roar but at around 5% of max thrust, and bailed out. It took just a few puffs from her EVA pack to make it to the old bus and grab a hold. This will make the wait for a transfer window back to Kerbin way more comfortable.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it sure took some time for her to calm down enough for this photo op \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Grogs","CreatedById":195516,"CreatedDateTime":"2020-08-04T09:59:08Z","Content":"\n\u003Cp\u003E\nNothing too exciting today. Jeb and Bill made about 5 more trips down to Minimus mining ore. Minimus Station is now full of fuel, and there are about 8,000 units of ore for making more fuel when needed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nI1UrZW.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nI1UrZW.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI did have a weird bug after the next-to-last ore run.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhen the miner returned from the surface, the radiator panels at the station were showing overheating. When I right-clicked, they were showing 100% efficiency as opposed to the 12% I was getting from the convert-o-tron 250.\n\u003C/li\u003E\n\u003Cli\u003E\nAfter I docked the miner and deployed it\u0027s panels, they did the same thing - showed overheating despite the drills being off.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen I undocked the miner, it and the station started shaking despite \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and engines being off.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen I tried to time warp, I was told I couldn\u0027t because the ship was under acceleration.\n\u003C/li\u003E\n\u003Cli\u003E\nI restored the most recent quicksave and everything went back to normal.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe only other eventful thing was the crew shuttle departing for the Mun. I\u0027ve got a contract to plant a flag there, and some of the newer kerbonauts could use the experience. I also have a contract to expand my Munar Station and having the crew shuttle attached will help meet the crew and fuel requirements.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229dhynjq.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9dhynjq.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2020-08-04T10:51:24Z","Content":"\n\u003Cp\u003E\n[from  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/\u0026amp;do=findComment\u0026amp;comment=3830090\u0022 rel=\u0022\u0022\u003EInstalment 1\u003C/a\u003E]\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in instalment 2 of my little story, \u003Cem\u003EKerbals Go Star Crazy On Ike:\u003C/em\u003E I am happy to report that Seanlas Kerman landed on the surface of Duna (first this \u0027world\u0027 (\u0027career\u0027))\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022morz87q.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/morz87q.png\u0022\u003E   \u003Cimg alt=\u0022JL8h2dN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JL8h2dN.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022QNvw3rr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QNvw3rr.png\u0022\u003E   \u003Cimg alt=\u0022OtH9hNM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OtH9hNM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nwithout mishap.  He landed on the rim of a small crater, finding 13% ore, and subsequently \u0022flew\u0022 the \u003Cem\u003E\u003Cstrong\u003ELadybug\u003C/strong\u003E\u003C/em\u003E toward the center of the crater, scouting for a flat spot.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout half fuel was consumed reaching the surface.  \u003Cem\u003E\u003Cstrong\u003E(Ladybug\u003C/strong\u003E\u003C/em\u003E has about 3.8 km/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.)  The \u003Cem\u003E\u003Cstrong\u003ELadybug\u003C/strong\u003E\u003C/em\u003E proved itself quite capable on Duna as a survey rover (I don\u0027t do wheels any more), although the extra drain on fuel caused by atmospheric drag was noticeable.  A very convenient conveyance...\n\u003C/p\u003E\n\u003Cp\u003E\nStay tuned for instalment 3, as \u003Cem\u003E\u003Cstrong\u003EHummingbird\u003C/strong\u003E\u003C/em\u003E next makes an attempt to land!\n\u003C/p\u003E\n\u003Cp\u003E\n[click and arrow for slideshow]\n\u003C/p\u003E\n\u003Cp\u003E\n[\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/\u0026amp;do=findComment\u0026amp;comment=3832041\u0022 rel=\u0022\u0022\u003EInstalment 3\u003C/a\u003E]\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T13:46:30Z\u0022 title=\u002208/05/2020 01:46  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"noname_hero","CreatedById":201680,"CreatedDateTime":"2020-08-04T22:01:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223831371\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596538284\u0022 data-ipsquote-userid=\u0022139095\u0022 data-ipsquote-username=\u0022Hotel26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Hotel26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, in instalment 2 of my little story, \u003Cem\u003EKerbals Go Star Crazy On Ike:\u003C/em\u003E I am happy to report that Seanlas Kerman landed on the surface of Duna (first this \u0027world\u0027 (\u0027career\u0027))\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/JL8h2dN.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022JL8h2dN.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JL8h2dN.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGrandmother, what big jetpack you have \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThis really takes the concept of jetpack to another level...\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"FezCool","CreatedById":174310,"CreatedDateTime":"2020-08-04T22:56:12Z","Content":"\n\u003Cp\u003E\nToday I sent two probes on trajectories to Duna and Eve. Then I sent Jebediah to the Minmus Base in a mining ship I made a while ago.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CbKUKTL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/CbKUKTL.jpg\u0022\u003E\u003Cem\u003ELanding\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hmMJJPF.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/hmMJJPF.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter landing Jeb decided the walk was too far and got back in the ship to make a short 60m hop over to the outpost.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YH1l9vt.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/YH1l9vt.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v8s8qiB.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/v8s8qiB.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter Jeb\u0027s arrival Bill went out to great them and the two talked about recent highlights in Spaseball. Jeb entered the base while Bill got in the mining ship to start up the refining process.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ivn6ki2.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Ivn6ki2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe refinery works quite well so it was probably a good investment.\n\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2020-08-05T04:59:39Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nY87, D25 - The Blue Swift nuclear turbojet aircraft flying above Laythe\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222EnO5Ax.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2EnO5Ax.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CalmLlama","CreatedById":174077,"CreatedDateTime":"2020-08-05T07:39:57Z","Content":"\n\u003Cp\u003E\nI finished this ship tonight, and flew it to Eeloo.  It worked very well.  I\u0027ve been working on it for a few weeks, and it\u0027s really great to finally see it finished and flying.  I will publish it on KerbalX in a few days.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OUTVMpe.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OUTVMpe.jpeg\u0022\u003E\u003Cimg alt=\u0022g4nqsSG.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/g4nqsSG.jpeg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-08-05T07:53:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223830184\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596366467\u0022 data-ipsquote-userid=\u0022101649\u0022 data-ipsquote-username=\u0022problemecium\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/2/2020 at 12:07 PM, problemecium said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nToday I finally got back to KSP after several days of fighting to restore my computer to health (blech) and surprisingly \u003Cem\u003Edidn\u0027t\u003C/em\u003E summon the Kraken with this abomination I have constructed:\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat happened and how\u0027d you fix your PC?\n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2020-08-05T08:19:23Z","Content":"\n\u003Cp\u003E\nOh, it\u0027s a long story. Some tiny error happened, some file corrupted or configuration misconfigured, but unfortunately in one of the boot directories, so my OS failed to boot. Startup Repair just gave up when I tried to run it, System File Checker refused to run, System Restore claimed that no restore points existed whatsoever, DISM refused to recognize the path as a place it was possible to put an OS image, and my Windows To Go USB drive loaded perfectly except for some reason is unable to render any text and is therefore useless despite System File Checker claiming that \u003Cem\u003Eits\u003C/em\u003E configuration was flawless. I exhausted every option short of paying Micro Center $69 to tell me I had to reinstall Windows and, after almost two days of failures, resorted to using 7-zip (an incredible piece of software for which I am immeasurably grateful, notably because it somehow is able to run inside a recovery environment) to copy my user directory, downloaded fonts, etc. to a backup drive and then factory reset my computer, resulting in me time-travelling back to Windows 7 in 2013. Over the last few days I\u0027ve gone about re-updating to Windows 10, redoing all my customizations, trying to install Linux on a USB drive for the next time this happens and instead accidentally erasing the file partition table on my SDXC card and causing my Steam library and a bunch of other files to get scrambled (damn you Rufus!), restoring what I could from said SDXC card, actually installing Linux on the USB drive, finding out that Linux is \u003Cem\u003Eway\u003C/em\u003E nicer than it was years ago when I was first introduced to it, and finally reinstalling KSP along with various other programs.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the interest of being on topic, today so far in KSP I have discovered an embarrassing fatal flaw in my ongoing Jool mission and am scrambling to find an efficient way to fix it.\u003Cbr\u003E\nUPDATE: And naturally, after everything seemingly going swimmingly yesterday, today every single thing I do ends up being a failure. I botched undocking the right part on the mothership three times, then it took like ten tries to come up with a system for recovering it that didn\u0027t end up with the parachutes magically disappearing and whining about \u0022aero forces and heat\u0022, the launch configuration for the recovery system kept connecting wrong invisibly in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E so it got all wobbly on launch, and then when I finally got it seemingly going right and had it on the way to rendezvous, I realized I had somehow not brought any MonoPropellant \u0026gt;.\u0026lt;\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T09:45:35Z\u0022 title=\u002208/05/2020 09:45  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by problemecium\u003C/strong\u003E\n\u003Cbr\u003Eaaaaaaaa\n\u003C/span\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2020-08-05T11:04:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223831699\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596578471\u0022 data-ipsquote-userid=\u0022201680\u0022 data-ipsquote-username=\u0022noname_hero\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, noname_hero said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis really takes the concept of jetpack to another level...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSMOKING STRICTLY PROHIBITED.\n\u003C/p\u003E\n\u003Cp\u003E\n(Thank you for your kind words!)\n\u003C/p\u003E\n"},{"CreatedByName":"Grogs","CreatedById":195516,"CreatedDateTime":"2020-08-05T11:33:01Z","Content":"\n\u003Cp\u003E\nI had a lot of activity focused on the Mun yesterday. First, I launched a cupola up from Kerbin bound for Mun Station as part of the base expansion contract. It rendezvoused with the half-full fuel tanker I had in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E at Kerbin Station and the two proceeded towards the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iSZERLM.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/iSZERLM.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen I realized that even with the fuel tanker and the crew shuttle coming down from Minimus I still wouldn\u0027t have the 7500 \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E required to complete the contract. I really regret taking this contract, but I\u0027m almost there now so I might as well finish. I launched a new tanker and sent that one off to Mun station as well. I made sure to put a new probe core on it because I get tired of manually holding maneuver node headings with the older ones.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aZZ7DwT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aZZ7DwT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEverything arrived at the Mun and got docked together. Once the crew shuttle docks and adds its 19-kerbal capacity the base upgrade contract will be complete.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225vEEWeu.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5vEEWeu.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBack on Minimus I had a probe arrive to fulfill a satellite contract.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hi18isW.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hi18isW.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI detached a refueler from Minimus Station and sent it towards Kerbin where it will replace the one I just sent up to Munar Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kFXjshn.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kFXjshn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\u003Cp\u003E\nLudorf and Beazor took the lander down to a few different biomes gathering science. They transmitted all the reports so I could get immediate science back on Kerbin and then collected a second copy so the remainder can be hand carried by the next crew heading home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DtDPEms.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/DtDPEms.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks to the new science data coming in from Minimus, I was able to unlock RTGs. I sent out a very important probe with 4 \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E power sources for the surface experiment stations on the Mun and Minimus. Once these are installed by a competent engineer, the stations will be able to collect data at night doubling the science output.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022drxtZRe.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/drxtZRe.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Okhin","CreatedById":201182,"CreatedDateTime":"2020-08-05T12:11:11Z","Content":"\n\u003Cp\u003E\nThere\u0027s a contract out there to map 11 asteroids endangering Kerbin, so I put up a small probe to go between Kerbin and Eve and catch those rocks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223FCE3EBC69B52A9AD0CEF07D54A33B645EB4F8D9\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880775546/3FCE3EBC69B52A9AD0CEF07D54A33B645EB4F8D9/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA tall rocket, it\u0027s been a while I\u0027ve done something simple like this.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022811248774685BF536303A5D58C8A12DD32A82087\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880775753/811248774685BF536303A5D58C8A12DD32A82087/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd we\u0027re now live. More or less, the antennas is a bit small so I\u0027m barely in range of anything else, but it should do it.\n\u003C/p\u003E\n\u003Cp\u003E\nNext were a contract to expand the Gateway Plexe, and expanding it from 70 to 75 Kerbals space. Which I found ridiculous, so I\u0027ve designed an asteroid holder for the station with MK2 cabins, designed in a hand. More or less. To hold the Kubpola.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227A2BE26230205D554ED9A8419A475E9CE20BED89\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880793691/7A2BE26230205D554ED9A8419A475E9CE20BED89/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is a perfectly aerodynamic thing. 6 \u003Cabbr title=\u0022Liquid fuel Rocket Booster\u0022\u003ELRB\u003C/abbr\u003E to help with the launch. 2 3.75m stage, with 3 skippers each and, in the fairing, monprop, core drone, battery and a retrograde Nerv. And a Valentina somewhere to drive some parts of the gateway, which lacks drone core. Lots of struts too, to keep things from wobbling too much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BDFF63E0ED47FF55BB021CB89B98BC5C737C3779\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880793856/BDFF63E0ED47FF55BB021CB89B98BC5C737C3779/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLRBs separation is nominal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226843D7C930A189BF488232878D842EEF1674D323\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880793994/6843D7C930A189BF488232878D842EEF1674D323/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst stage separation is A-OK.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002249127D6078FC38EC1F220979590814CC7C3287AE\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880794178/49127D6078FC38EC1F220979590814CC7C3287AE/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA little bit of maneuvering during the burn toward the Gateway Plexe to rotate the hand and have the Nerv in line with the prograde vector.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a 0.009 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E on this thing. I should have pack two or three more engines, it took forever to reach the border of Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. As well as a lot of correcting burn during the travel there.\n\u003C/p\u003E\n\u003Cp\u003E\n0.009 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. I should have checked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022590C5CB4C61C14040BB1FA0A9F61ECA8CF31FB05\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880794300/590C5CB4C61C14040BB1FA0A9F61ECA8CF31FB05/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe kubpola has been ejected from the Plexe, and the rings have been halted. The hand is en route to dock to the Kubpola.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022C69B00711E6FF98948F46AC3F919F5A2F39A70D8\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880794430/C69B00711E6FF98948F46AC3F919F5A2F39A70D8/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nContact. And nominal docking. Now we need to get rid of the Nerv and its tanks, and give Valentina control of the remaining maneuver.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221CF7A72DC2C981EC874DCB2975ADCB759E597A6D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/1463059896880794581/1CF7A72DC2C981EC874DCB2975ADCB759E597A6D/\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, everything is now assembled in position. Rings rotating perfectly fine. I can now drop asteroids on top of the station and attach them there.\n\u003C/p\u003E\n\u003Cp\u003E\nThe contract completed, but I have no idea of how many kerbals can live there. Ok, no. It\u0027s 70 \u002B 16 * 4, so 134 kerbals can fit in the space bar.\n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2020-08-05T13:44:50Z","Content":"\n\u003Cp\u003E\n[from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/\u0026amp;do=findComment\u0026amp;comment=3831371\u0022 rel=\u0022\u0022\u003EInstalment 2\u003C/a\u003E]\n\u003C/p\u003E\n\u003Cp\u003E\nMore happy news in this, \u003Cu\u003Ethe third instalment of my little story\u003C/u\u003E, \u003Cstrong\u003E\u003Cem\u003EKerbals Go Star Crazy On Ike,\u003C/em\u003E\u003C/strong\u003E in which the guys, marooned on Ike for what seemed like years, but was in actuality only a couple of revolutions around good old Kerbol, decided to improvise and toodle off to Duna for grins, even though their equipment wasn\u0027t suited, not tested, and nothing planned.\n\u003C/p\u003E\n\u003Cp\u003E\nThis time, the spotlight was on Ribdard Kerman to bring DH1 Hummingbird down to the surface of Duna and land nearby in the small crater.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PKMRf8x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PKMRf8x.png\u0022\u003E   \u003Cimg alt=\u0022pWONOgB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pWONOgB.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022N6KLwbh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/N6KLwbh.png\u0022\u003E   \u003Cimg alt=\u0022ovKbL74.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ovKbL74.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022pk1nQLh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pk1nQLh.png\u0022\u003E   \u003Cimg alt=\u0022iEqLYDW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/iEqLYDW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n[click \u0026amp; arrow for slideshow]\n\u003C/p\u003E\n\u003Cp\u003E\nSeanlas: \u0022Now how does this Bluetooth pairing thing work again...?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nRibdard: \u0022Ah, there you are, 5x5...  Good to see you, old bean!  Say, I\u0027m a wee low on EVA propellant having jetted over from the Hummingbird.  Be a good chap and go pick it up for me, would you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/\u0026amp;do=findComment\u0026amp;comment=3834055\u0022 rel=\u0022\u0022\u003Einstalment 4\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-08T06:23:05Z\u0022 title=\u002208/08/2020 06:23  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 8, 2020\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceCarmelo","CreatedById":194212,"CreatedDateTime":"2020-08-05T15:40:49Z","Content":"\n\u003Cp\u003E\nSo proud to announce you that after 4 years of playing ksp i actually docked and randevouz manually for the first time without using mechjeb. And i did it in IVA!!\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022How?\u0022 you may ask. \n\u003C/p\u003E\n\u003Cp\u003E\nI just watched a 10 minutes \u0022how to randevouz and dock for dummies\u0022 on youtube. \n\u003C/p\u003E\n\u003Cp\u003E\nThe liftoff sequence was automated by KOS, thanks to the \u003Cstrong\u003EACFEL\u003C/strong\u003E flight recording system i wrote in Kerboscript. Check out my post about it in Addons Discussion. \n\u003C/p\u003E\n\u003Cp\u003E\nThe Almaz Station had a trouble with his antennas so i sent jeb there with a Soyuz clone to fix it up.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T8ldexT.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/T8ldexT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that i learn how to dock i\u0027m gonna try a Shuttle-MIR program!\n\u003C/p\u003E\n\u003Cp\u003E\nBye!!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T15:43:40Z\u0022 title=\u002208/05/2020 03:43  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by SpaceCarmelo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Misguided Kerbal","CreatedById":203209,"CreatedDateTime":"2020-08-05T15:48:42Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022QBBY7Ld.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QBBY7Ld.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nToday, (Well, actually, last night), I launched this monstrosity: the Atlas-Heavy. Basically, a 3.75m core with 7 walrus engines from NFLV, plus 8 BACC SRBs. It\u0027s sorta overkill for the payload: A minmus lander \u002B a transfer stage.\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2020-08-05T18:20:04Z","Content":"\n\u003Cp\u003E\nBob broke Minmus\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225OoBMqM.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.26\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5OoBMqM.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T20:35:51Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EThe final Preflight test is a success!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Eve Crew lander must be able to ditch the Heat Shield successfully with no damage to the lander.\n\u003C/p\u003E\n\u003Cp\u003E\nOut of all things I think Eve Landing will be the one I do the most. I will have to do that part again and again to get the precise landing spot.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo give an idea of so far:\n\u003C/p\u003E\n\u003Cp\u003E\nI got an eve lander to get into orbit\n\u003C/p\u003E\n\u003Cp\u003E\nI have developed spacecraft designed to be optimized for the missionn\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I got the Eve mission planned out so far\n\u003C/p\u003E\n\u003Cp\u003E\nNow to build:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EThe Launcher!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-05T21:05:49Z\u0022 title=\u002208/05/2020 09:05  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 5, 2020\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-06T04:18:26Z","Content":"\n\u003Cp\u003E\nOh \u003Cspan style=\u0022font-size:22px;\u0022\u003EYEAH\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EThe moment has arrived:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEve Mission is a go! I won\u0027t start the mission tomorrow because I am VERY VERY busy with RL stuff. But afterwords I will begin my hours of flight time\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002275.00\u0022 width=\u00221024\u0022 alt=\u0022the-launcher.png?w=1024\u0022 src=\u0022https://kerbalanders.files.wordpress.com/2020/07/the-launcher.png?w=1024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\u003Cp\u003E\nFriday, I will begin the HECK OF QUICKSAVES!\n\u003C/p\u003E\n"},{"CreatedByName":"Grogs","CreatedById":195516,"CreatedDateTime":"2020-08-06T10:31:19Z","Content":"\n\u003Cp\u003E\nI put together an asteroid mover for a couple of contracts I have. It has four sets of \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E equipment, which is probably extreme overkill, but having a drill on each corner means that even if the surface is very irregular at least one should be able to make contact. I also put in 8 Gigantor solar panels, 4 fuel cell arrays, and 20,000 units of EC storage for continuous power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KxmVf2g.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KxmVf2g.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI speced it out to move a class C asteroid, which should be close to the 144-ton mass of an S4-256 fuel tank. Fully loaded with fuel, it would have about 700 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 0.43 pushing that mass of an asteroid. It should be able to move larger rocks around if they don\u0027t need a lot of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E all at once, but right now the hardest mission is to move a Class C asteroid into orbit around Minimus.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TwMbO8F.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TwMbO8F.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI designed a launcher for the ship and tested it. It took several redesigns to keep the nose from falling over during the gravity turn, but the tail fins on the side boosters finally fixed it. By the time they dropped off the gimbal on the Mammoth engine was enough to keep it on course.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LLkNhz7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LLkNhz7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAfter getting it to orbit, I realized that the asteroid I\u0027m after is on a retrograde heading. I decided at that point to revert and go back to the drawing board. I\u0027ll either have to redesign the launcher to allow the extra \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to launch a fully-fueled craft into a retorgrade orbit, or else arrange for a refueling of the asteroid grabber before it heads out to meet the target.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UWKcc8Y.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UWKcc8Y.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2020-08-06T11:25:18Z","Content":"\n\u003Cp\u003E\nSea trials: \u003Cstrong\u003E\u003Cem\u003ENautilus\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MC8HOYb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MC8HOYb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n[This is a photo without its 4 engines, lost in an incautious \u0027porpoise\u0027 maneuver.]\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s planned to have a set of \u0027dive\u0027 chutes (for the bottom) and a set of \u0027surface\u0027 chutes -- for the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition, 2 or 4 ballast tanks, 2 trim tanks and a bladder tank.  Still working on the numbers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe periscope extends and swivels and has a built-in search-light.  (Wait a minute!  It \u003Cstrong\u003Eis\u003C/strong\u003E a search-light.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E )\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EIt operates upon a key top-secret invention known as the \u003Cem\u003ETardis Effect...\u003C/em\u003E  that\u0027s all I can tell you about that.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-06T11:43:12Z\u0022 title=\u002208/06/2020 11:43  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 6, 2020\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aspacecephalopod","CreatedById":204612,"CreatedDateTime":"2020-08-06T19:04:29Z","Content":"\n\u003Cp\u003E\nPut an ocean base and boat on the semi-habitable world of Kerbmun (Whirligig World)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022C21lMRx.png\u0022 src=\u0022https://i.imgur.com/C21lMRx.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbalKiller2000","CreatedById":205492,"CreatedDateTime":"2020-08-07T01:20:13Z","Content":"\n\u003Cp\u003E\nI made a huge (but useless) basketball court and discovered a comet visible from Kerbin. I tried throwing Whack-a-Kerbal balls through the hoops, but it just crumbled into pieces.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-07T02:21:59Z","Content":"\n\u003Cp\u003E\nIn orbit of Kerbin. Trying to find the cheapest way to Eve. Might have to do an aerocapture...\n\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2020-08-07T03:49:40Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nY88, D322 - Dawn-4a deployed at Eve\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00228rZTizM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8rZTizM.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nY88, D329 - Dawn-4a deployed at Gilly\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022M5LVlas.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/M5LVlas.png\u0022\u003E\u003C/p\u003E\n"}]}