{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":586,"Articles":[{"CreatedByName":"coreross","CreatedById":60238,"CreatedDateTime":"2015-03-22T15:35:49Z","Content":"\n\u003Cp\u003ERescuing my stranded Kerbals\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/wOLWza3gv_M?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"mckamx","CreatedById":116032,"CreatedDateTime":"2015-03-22T15:43:25Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yFPgmfj.png?1\u0022 alt=\u0022yFPgmfj.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ELaunched my first expedition to one of the Outer Planets Mod (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104280-0-90-Outer-Planets-Mod-%281-6%29-Urlum-has-its-first-moons!-15-Mar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/104280-0-90-Outer-Planets-Mod-%281-6%29-Urlum-has-its-first-moons!-15-Mar\u003C/a\u003E) planets, Sarnus in this case. I am sending Friendly, one of my F-class interplanetary vessels with 2 type 4 drop tanks, an artificial gravity habitation module/lighted snackhouse (10 years there and back again is a bit long for zero-G), and a Dingy for low-G landings.\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-03-22T16:40:01Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8DgLTZD.jpg\u0022 alt=\u00228DgLTZD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERSS Phobos flyby. Periapsis 500 meters, relative velocity 8-9kms. Time in phobos sphere of influence, less than a second as I was 40 degrees inclined (seriously, this thing seems to have a 50km SoI or something, its a pebble and a nightmare to hit from retrograde)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-22T16:47:19Z\u0022 title=\u002203/22/2015 04:47  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by celem\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"coreross","CreatedById":60238,"CreatedDateTime":"2015-03-22T17:34:39Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/y1JEMEehvOg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-03-22T18:18:45Z","Content":"\n\u003Cp\u003EOh yeah, just installed OPM too, (MOAR BOOSTERS to get to MOAR PLANETS!)\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2015-03-22T19:18:15Z","Content":"\n\u003Cp\u003Eput an orbiter around duna, completely manually (mechjeb is a wuss, wouldn\u0027t set a node). third planet ive orbited. pic:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8RqxBBQ.png\u0022 alt=\u00228RqxBBQ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ScriptKitt3h","CreatedById":82780,"CreatedDateTime":"2015-03-22T20:06:07Z","Content":"\n\u003Cp\u003EDropped a tank through the roof of the VAB using a VTOL:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bkMwfu5.png\u0022 alt=\u0022bkMwfu5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oUPUMKk.png\u0022 alt=\u0022oUPUMKk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe tank survived to tell the tale!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gI2M5dJ.png\u0022 alt=\u0022gI2M5dJ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-03-22T20:17:52Z","Content":"\n\u003Cp\u003EContinued attempting to learn FAR. Still haven\u0027t made space more than once with planes...\u003C/p\u003E\n"},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2015-03-22T20:55:33Z","Content":"\n\u003Cp\u003EI waved goodbye to my first interplanetary probe (in this save, anyway. I started anew yesterday) as it left the Kerbin SOI. Its mission: Skim the corona of Kerbol, slingshot around for an eve intercept and landing.\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2015-03-22T20:59:45Z","Content":"\n\u003Cp\u003EI continued not playing KSP due to a serious Cities: Skylines addiction.\u003C/p\u003E\n"},{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2015-03-22T21:49:41Z","Content":"\n\u003Cp\u003EIt\u0027s not an addiction... It is a way of life, man!!!! \u003C/p\u003E\u003Cp\u003E I feels for you because I am there too.\u003C/p\u003E\n"},{"CreatedByName":"Joseki","CreatedById":123945,"CreatedDateTime":"2015-03-22T22:07:49Z","Content":"\n\u003Cp\u003EFirst mission on Eeloo!\u003C/p\u003E\u003Cp\u003EIt went perfect: I didn\u0027t put a single m/s of unnecessary delta-V in my entire rocket or my lander. I landed and take of from the surface pretty easily, and than I docked with my parked ship with about 2 m/s of delta-V left. I went home and I had about 20 m/s left. Really all perfect.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/37492408377420218/B6E0917C7AFCD799CD89284411B96E4BE0628765/\u0022 alt=\u0022B6E0917C7AFCD799CD89284411B96E4BE0628765\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/37492408377420653/C5E80CD9F3A25253C5B163175D5C8D50E16BDFC2/\u0022 alt=\u0022C5E80CD9F3A25253C5B163175D5C8D50E16BDFC2\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/37492408377422135/840E5CCCD7F6D8BDE02B2B2A19AC30F8C2BD6DAD/\u0022 alt=\u0022840E5CCCD7F6D8BDE02B2B2A19AC30F8C2BD6DAD\u0022\u003E\u003C/p\u003E\u003Cp\u003EUntil I died because of the g-force. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kirkhan","CreatedById":138294,"CreatedDateTime":"2015-03-22T22:08:55Z","Content":"\n\u003Cp\u003EMy first post! Today I tested my stock, ion powered, gliding, Duna rover on Kerbin. It was very stable driven in docking mode and when I hit a jump I found out it could fly! It seemed perfectly balanced in flight as well so I decided to land it at the Island Base. I didn\u0027t need to use the SAS or RCS on Kerbin but I\u0027m sure they will help on Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hJwxNG6.png\u0022 alt=\u0022hJwxNG6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/te9AQBJ.png\u0022 alt=\u0022te9AQBJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E2lLnQf.png\u0022 alt=\u0022E2lLnQf.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"landfish2","CreatedById":138824,"CreatedDateTime":"2015-03-22T22:32:51Z","Content":"\n\u003Cp\u003EI am never putting something this big into space ever again, my computer has been violated enough as it is.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C9DlGa1.png\u0022 alt=\u0022C9DlGa1.png\u0022\u003EI got a pretty good locking image though, which is nice.\u003C/p\u003E\u003Cp\u003Esorry for the massive pic, I have no idea what I am doing ):\u003C/p\u003E\n"},{"CreatedByName":"Vashts","CreatedById":125630,"CreatedDateTime":"2015-03-22T22:34:40Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/E00wB\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Enot going as planned\u003C/p\u003E\n"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2015-03-22T22:50:54Z","Content":"\n\u003Cp\u003EToday I did three things:\u003C/p\u003E\u003Cp\u003Ebuilt an F-35B9\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/4K0lG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Eimproved on my Ringo Gigante station\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/wBtyB\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Eattempted a land speed record (got to about 760 m/s across the runway)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/1UFyx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Enow I just want to sleep \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-22T23:06:52Z","Content":"\n\u003Cp\u003EToday I finalized the design for my third-generation rotating Void Liners. Seats a maximum of 128, though it will be limited to a maximum of 60 kerbals in practice (for purposes of passenger comfort). Designed to be launched in fairing-sized pieces and assembled in orbit. They\u0027ll need to be stitched together with struts, though I\u0027m undecided if I\u0027ll use KAS or just launch all the bits needed for the ship, dock them up, then HyperEdit in a version that already has the struts. Probably won\u0027t launch any more of these until KSP v1.0 happens, in case parts get nerfed or resized.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o8q7Fhp.jpg\u0022 alt=\u0022o8q7Fhp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI also tested some rotating station designs, but no photos of those yet. Too many phantom-forces and randomly exploding stations. Some of these SP\u002B size-3 parts just refuse to stay glued together....\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-03-22T23:07:34Z","Content":"\n\u003Cp\u003EDid none for the past (and also the next) few days \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E focus on the study grind.\u003C/p\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2015-03-22T23:20:03Z","Content":"\n\u003Cp\u003EToday I did my first Kerbin survey mission. The order of the day was temperature readings at three points on the highland surface just behind the mountains west of KSC. First I designed a small rocket powered (48-7S) flyer. I took it to a trip around KSC and decided that as nice a toy as it is, it just doesn\u0027t have the endurance. Then I spent some 300 science points from my accumulated 2k to get basic jet and some other useful components like the unfolding ladders. With those parts I designed a better plane that could actually fly to the mission area.\u003C/p\u003E\u003Cp\u003EThen I launched around 10 times before I managed to get the last of the three readings requested. My landing parachute design (2 radial chutes just ahead/behind the CoM) worked really well but taxiing in the undulating terrain to precisely hit the waypoints was much harder. I didn\u0027t reload at all though, since Dudlong survived every mishap. Moving uphill without an engine of any kind just wont happen, so I had to recover and launch again.\u003C/p\u003E\u003Cp\u003EIn the end the mission probably cost me much more than I gained from it. It was fun to do though, and I don\u0027t have shortage of cash or science (1,5M and 2k respectively in the bank). Yes I\u0027m cheap with my resources and try not to upgrade or research anything before I need to.\u003C/p\u003E\u003Cp\u003ENo screen shots, sorry, I had concentrate too hard to hit the F1. I could probably use a mod that automatically made screenshots at key moments like staging, flag planting, etc.\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-03-23T02:34:10Z","Content":"\n\u003Cp\u003ENew save, put up my com and power keostationary SATs( remote tech and interstellar), which was where pilots could learn from jeb. Pesky docking ports wouldn\u0027t let go of one another even after decoupling. \u003C/p\u003E\u003Cp\u003EPut up my uber generator in orbit. \u003C/p\u003E\u003Cp\u003ELanded a basic base on both the min and minmus ( mun base only lost half of their solar panels). \u003C/p\u003E\u003Cp\u003ESent up both halves of my duna(?) Ship, with some highly expiremental designs on both, docked them and got rid of their transfer stages (by ploting their orbit to collide into kerbin of course) and set course for duna. Oh wait, why are you going towards eve? Minor error, I\u0027ll adjust my orbit, and just send a tanker to duna if I have enough dV to stay in duna soi. \u003C/p\u003E\u003Cp\u003EThen I built an antimatter power generator with enough collectors to get power I\u0027m kerbin orbit. \u0022Nudged\u0022 (10k dV) it towards jool, and we\u0027ll see how much power we can actually get out of this bad boy tomorrow\u003C/p\u003E\n"},{"CreatedByName":"damowang2","CreatedById":138291,"CreatedDateTime":"2015-03-23T05:13:06Z","Content":"\n\u003Cp\u003EPracticed fighter takeoff-ground assault with unguided rocket(Special thanks to BahamutoD)-landing. Three or four success landing in a row. happy.\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-03-23T10:11:51Z","Content":"\n\u003Cp\u003EQa\u0027pla! \u003C/p\u003E\u003Cp\u003EA modder in our KSP Facebook group released his Bird of Prey model just for fun. \u003C/p\u003E\u003Cp\u003EJeb looks really happy on \u0022The Chair\u0022 doesn\u0027t he?\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/KgbcO\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-03-23T10:48:38Z","Content":"\n\u003Cp\u003EFinished off my Jool contracts with an last-bit-of-fuel suicide burn probe landing on Tylo (forgot the screenshot), and a hard barely-enough-fuel powered landing on Laythe. They broke the BBQ on landing, but that\u0027s ok: they had hardly any fuel left for it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1hnsXff.png\u0022 alt=\u00221hnsXff.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-03-23T12:04:43Z","Content":"\n\u003Cp\u003EArgh. Just aged myself by a decade easily.\u003C/p\u003E\u003Cp\u003EMaking an RSS landing on Mars with a probe suffering 12 minutes of delay. I program a script into the flight computer that I reckon might just do the job and then get to be a helpless spectator. I got the commands sent-off, then dropped the link to it so that I wouldnt be tempted to tell MJ to slap it down.\u003C/p\u003E\u003Cp\u003ELog Excerpt:\u003C/p\u003E\u003Cp\u003E70km, The craft is holding retrograde fine, it starts to make short burn cycles with the trio of Orbital Thrusters, the landing program is looking good.\u003C/p\u003E\u003Cp\u003E45km, A bit fast perhaps, needs more aggressive burns in the early stages.\u003C/p\u003E\u003Cp\u003E35km, hot ship. Mistimed the burns somewhat, with no heatshield things get a bit warm.\u003C/p\u003E\u003Cp\u003E30km, finally, a burn cycle. TWR is still below 1, but it takes the edge off and nothing bursts into flames yet. Still looking good.\u003C/p\u003E\u003Cp\u003E29km, disaster. RCS depleted. With no attitude control the Lander flips 180 hard and begins to barrel-in prograde, spinning like a rifle bullet.\u003C/p\u003E\u003Cp\u003E25-20km, not helping things here... The last two braking burns fire prograde and try to turn Lander into Impactor. Thankfully the wussy atmosphere of Mars prevents them making things too much worse.\u003C/p\u003E\u003Cp\u003E18km, yeah, this wont go well. Lander begins to tumble end over end at about 1 rev per second. Landing program is finished for what its worth... Burns are badly-timed. Descent took longer than expected.\u003C/p\u003E\u003Cp\u003E12km Its a dead-stick.\u003C/p\u003E\u003Cp\u003E6km Pre-armed chute semi-deployment by the 4 radials. Nose-chute has not been armed. Lander stops tumbling and stabilises prograde, speed isnt changing much.\u003C/p\u003E\u003Cp\u003E2.4km Radial chutes full-deploy, Lander flips 180 and holds retrograde. Craft starts to decelerate.\u003C/p\u003E\u003Cp\u003E0km Touchdown at 13.3ms, craft bounces a little and one leg is damaged but has been fortunate enough to come down on a pretty flat plain.\u003C/p\u003E\u003Cp\u003ERealChute, I love you.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DapF9Ad.jpg\u0022 alt=\u0022DapF9Ad.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-23T12:17:35Z\u0022 title=\u002203/23/2015 12:17  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 23, 2015\u003C/time\u003E by celem\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-03-23T13:48:52Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/rKMyxu\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm9.staticflickr.com/8734/16904418042_d8e99e6be4_b.jpg\u0022 alt=\u002216904418042_d8e99e6be4_b.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo ah, on the upside, it\u0027s within 500m of the target and nothing broke! which given I forgot RCS completely was not bad.\u003C/p\u003E\u003Cp\u003EOn the other hand I can\u0027t open the habitat so nobody can get in it and it won\u0027t produce food. Next time, RCS. \u003C/p\u003E\u003Cp\u003ENow I have to ship something in a hurry to get it upright...\u003C/p\u003E\n"}]}