{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":35,"Articles":[{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-12T13:44:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EI got bored of the Arkingthaad project, so I went into the VAB and invoked the insanity clause. By the time they realize there isn\u0027t an insanity clause, I\u0027ll already be at 10,000 meters and climbing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMethinks there aren\u0027t nearly enough Aerospikes on that...\u003C/p\u003E\u003Cp\u003EMy activities last night were limited to a refuel of my Typhon 1 tug (finally; this is the one with 25 LV-Ns, the thrust of a Mainsail with NERVA efficiency), a test of a rover using a SAS module as the base chassis (had to work really hard to flip it over; when I did - at 22 m/s, double the flippin\u0027 speed of my first rover - nothing crucial broke and the only reason why I had to abandon the mission is because the self-righting system (a toroidal fuel tank and 2 24-77s) ran out of juice.\u003C/p\u003E\u003Cp\u003EMade yet another attempt to build an Eve lander. On paper it said I should have the 12,000. KER said 6500 and then the damn thing was unflyable...though that\u0027s probably because the LV-T45 in the center stack fell off for some unknown reason early in the flight. Had rotten asparagus or something, I guess.\u003C/p\u003E\n"},{"CreatedByName":"Robbii6","CreatedById":69855,"CreatedDateTime":"2013-07-12T14:33:17Z","Content":"\n\u003Cp\u003EToday i tried to have a manned mission go to another planet and back for the first time\u003C/p\u003E\u003Cp\u003EI failed Miserably. \u003C/p\u003E\u003Cp\u003EI assembled my ship in orbit and it would have defiantly got there and back it had, if my calculations were correct, 14000 delta V! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E . I was using a tug approach where i was pulling my lander to Duna. Unfortunately the engines were way too close to the lander and no thrust was being applied because the trust was just hitting the lander \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E so other than learning from that mistake it wasted a good 3 hours of work.\u003C/p\u003E\n"},{"CreatedByName":"Cyst","CreatedById":74149,"CreatedDateTime":"2013-07-12T14:47:03Z","Content":"\n\u003Cp\u003EI have built a rover, a behemoth and during its test I have realized that it cannot turn left...\u003C/p\u003E\u003Cp\u003Ethere is no problem with the power source,\u003C/p\u003E\u003Cp\u003Ethe wheels are placed correctly,\u003C/p\u003E\u003Cp\u003Ethe key bindings are good aswell -I even tried remapping them-,\u003C/p\u003E\u003Cp\u003Eengines as well as steering are enabled\u003C/p\u003E\u003Cp\u003Eand I have built 2 more just in case my craft\u0027s at fault. it is not, none of the 3 can turn left.\u003C/p\u003E\u003Cp\u003Eso I, hand in hand with my creativity are having a... \u0027not as good as it should be\u0027 day, belive me.\u003C/p\u003E\u003Cp\u003EI would appreciate ideas on this matter.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-12T14:52:50Z","Content":"\n\u003Cp\u003EYet another rescue mission however on an kind of different scale.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/JaeL6cp\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JaeL6cp.jpg\u0022 alt=\u0022JaeL6cp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFinally doing aerobrake around Laythe after creating an kethane miner and docked it to the mothership(the four orange tanks to the left). Used the kethane miner as tug to get the mothership Jool express into Laythe orbit. \u003C/p\u003E\u003Cp\u003ESome complications, Jool express weight close to 2000 ton, its an orion nuclear pulse rocket with an cargo of 800 ton spare parts for orbital construction, 18 kerbals to put up an base on both Laythe and Pol.\u003C/p\u003E\u003Cp\u003ESome problems first two of the chemical engines fall off because of metal fatigue. Yes it uses mainsails for precision movement, then the orion engine failed after getting into orbit around Jool. \u003C/p\u003E\u003Cp\u003ESo after going to Jool in 30 days, I used 4 to get an minimum power intercept with Laythe. The ting was horible to rotate and had ion engine like twr. \u003C/p\u003E\u003Cp\u003ECurrently setting up infrastructure to mine on Pol to produce more infrastructure.\u003C/p\u003E\n"},{"CreatedByName":"Spooks","CreatedById":68403,"CreatedDateTime":"2013-07-12T16:36:28Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sikXHyx.jpg\u0022 alt=\u0022sikXHyx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u2uXzIX.png\u0022 alt=\u0022u2uXzIX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZFL1o6N.jpg\u0022 alt=\u0022ZFL1o6N.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2013-07-12T17:00:50Z","Content":"\n\u003Cp\u003EWell yestarday I finally got my deep space probe to orbit Eeloo. Only took 30 years x days to get there. Now I\u0027m waiting to for the Kerbals... I mean Squad to invent new star systems.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-07-12T18:51:44Z","Content":"\n\u003Cp\u003EKerbalized the Angara rocket family. \u003Ca href=\u0022http://forum.nasaspaceflight.com/index.php?action=dlattach;topic=2534.0;attach=180265;image\u0022 rel=\u0022external nofollow\u0022\u003EThis was my reference image.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlexanderB","CreatedById":17544,"CreatedDateTime":"2013-07-12T19:37:05Z","Content":"\n\u003Cp\u003EI sent my ISA mapsat to Eeloo, I was bored and descided to see how far I\u0027d get with a probe with 11k delta V (from low kerbin orbit), it still has 4000\u002B to spare. \u003C/p\u003E\u003Cp\u003EOnd mapped the whole surface.. \u003C/p\u003E\u003Cp\u003EI might even send it somewhere else.. Or try and land it. (It should have ~1.7 TWR on Eeloo, thats landable, right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-12T19:37:21Z","Content":"\n\u003Cp\u003EBusy evening. Due to strange way my mothership behaved during time-warp i lost main engine during yesterday\u0027s burn. Luckily i saved before starting, so today i was able to successfully retry. My expedition is enroute to Duna now, with correction burn planned in about a month (game time). After finishing with my mothership i launched heavy tanker into LKO. It carries about 9000 units of fuel and 1500 units of monopropellant - should be enough for Gilly mission i have in planning.\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-07-12T19:43:14Z","Content":"\n\u003Cp\u003EI\u0027ve been refining the launcher for the probe that will hopefully manage to land on Tylo. I\u0027m starting to wonder if it would need something like my Saturn V analog, just to get there without using any of its landing fuel. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-07-12T19:49:37Z","Content":"\n\u003Cp\u003EI released my VTOL on Zepto Eagleworks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bu7Sy70.jpg\u0022 alt=\u0022Bu7Sy70.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-12T20:03:49Z","Content":"\n\u003Cp\u003EHow do you do hinges in stock? I\u0027d T-bone a bus full of Nuns in my Dodge if it meant I\u0027d learn how!\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-07-12T20:04:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EHow do you do hinges in stock? I\u0027d T-bone a bus full of Nuns in my Dodge if it meant I\u0027d learn how!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s a hint: Structural Pylons. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2013-07-12T20:08:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Giggleplex777\u0022 data-cite=\u0022Giggleplex777\u0022\u003E\u003Cdiv\u003EHere\u0027s a hint: Structural Pylons. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are a structural pylon magician. You should post to Harv or Scott Manley or just on YouTube, people will ove your creation!\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-12T20:08:35Z","Content":"\n\u003Cp\u003EI use those all the time. I know they\u0027re considerably stronger connection wise along the axis than the radius, but how do you turn them into a controllable armature?\u003C/p\u003E\n"},{"CreatedByName":"Goldham","CreatedById":73478,"CreatedDateTime":"2013-07-12T20:54:12Z","Content":"\n\u003Cp\u003EI landed on the Mun today! (and learned mechjeb likes to lithobrake when I ask it to set up a Maneuver node, so I didn\u0027t use it )\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-07-13T03:01:37Z","Content":"\n\u003Cp\u003EPut my probe design on Mun. Used the second stage to slow rotational speed to zero, then ditch the booster to land on the thrusters only. Of the two probes, the first one crashed due to landing in darkness. Second probe landed OK but lost some solar panels. It remains upright sitting on the thruster tank. Did some minor redesign to balance the thrusters to estimated center of mass and raised the solar panels away from the bottom. Lots of thruster fuel left on this second attempt.\u003C/p\u003E\n"},{"CreatedByName":"TheHockeyPlayer","CreatedById":73665,"CreatedDateTime":"2013-07-13T03:26:39Z","Content":"\n\u003Cp\u003EPosted this thread idea on Steam. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/app/220200/discussions/0/864973123555815074/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/app/220200/discussions/0/864973123555815074/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-13T03:35:37Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/screenshot232_zpsfb447704.png\u0022 alt=\u0022screenshot232_zpsfb447704.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlmost. I\u0027ll try again tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2013-07-13T03:42:02Z","Content":"\n\u003Cp\u003EFirst I started to put a station into orbit, then I realized that I forgot RCS ports on the first module, and as I had to turn the station around at least one time, I relaunched it with a few RCS ports. Then I launched a few other modules before trying to make the upper stage of my heavy lifter family reusable. Now I have to redo the upper stage on all my heavy lifters as the final product turned out quite different from the base design.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-13T04:06:49Z","Content":"\n\u003Cp\u003EI backed up my save before landing on Eeloo, managed to do it and take some screenshots, but then completely f\u0027d up the rendezvous orbit by burning in the opposite direction and out of fuel. So I delete the save and restore my backup, go in for a smooth suicide burn (the method I had landed with last time), completely misjudge the height to burn from and pancake the lander. Since all my backups are gone, Bob Kerman will have to make a lonely journey home.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-13T04:21:01Z","Content":"\n\u003Cp\u003ERendezvoused with the capsule in Moho orbit. It was in a polar orbit, perpendicular to Moho\u0027s orbit. Several quicksaves showed that I would just make it if I escaped to Kerbol orbit first. I used backups of many quicksaves, and needed all the telemetry plugins I had to even get a Kerbin encounter.\u003C/p\u003E\u003Cp\u003E\u0026amp;*(\u0026amp;%$#/ Moho. I hope the 380m/s left is enough to put them on an aerocapture trajectory.\u003C/p\u003E\u003Cp\u003EAlso, I scanned Eeloo and landed a rover. Not quite where I was aiming, but that\u0027s ok. Loving the look of the stock wheels on the ice.\u003C/p\u003E\u003Cp\u003EMay add pics later.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2013-07-13T16:44:07Z","Content":"\n\u003Cp\u003EToday I \u0022downsized\u0022 my Babylon-5 Starfury to include a \u0022minified\u0022 version. Parts count reduced from 265 to 79. Posted the update in the Spacecraft Exchange: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/39317-SA-23E-Mitchell-Hyundyne-Starfury-%28Mk2%29-Babylon-5?p=514958#post514958\u0022 rel=\u0022external nofollow\u0022\u003ESA-23E Mitchell-Hyundyne Starfury (Mk2) - The Minified Version!\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-13T16:58:47Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/screenshot233_zps45033f79.png\u0022 alt=\u0022screenshot233_zps45033f79.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EInspired by a micro-lander in the pictures thread, I decided to try my hand at one of my own. This lander has only one of the tiniest engines. Older picture, so some of it is out of date, but the new one has four seperatrons to act as Mun-boosters to get the lander back up into orbit, two command chairs instead of one, and even a parachute for landing at home.\u003C/p\u003E\u003Cp\u003ESo far it\u0027s no good. I might have to make a small skycrane retrorocket system. Getting to the Mun is fine, the problem is I\u0027m getting to the surface a wee too quickly.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-07-13T17:24:29Z","Content":"\n\u003Cp\u003EI think that is the most sensible rocket I have seen you builx yet Wackjob \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}