{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":288,"Articles":[{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-05-05T06:37:24Z","Content":"\n\u003Cp\u003EPretty eventful day I\u0027d say... Background: a couple days ago I talked about how I accidentally ditched my last engine on the way back from the Mun and got stuck, and had to jetpack back to an acceptable orbit and get rescued blah blah... Well earlier I unlocked the Clawwwwwrrrr! This is actually the last thing I did just now... So I built a \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eship\u003C/span\u003E fuel tank that seats 3 to go pick up the capsule just to see how it works. Not bad, although I had a bit of trouble getting it to actually hook on. The capsule was floating around between Minmus\u0027 and the Mun\u0027s orbits. The screenie was taken after I brought it back to Kerbin and realized I didn\u0027t exactly plan for the big ship to come back to solid ground, so even if I tried to deorbit the stupid capsule and land it safely I\u0027d probably screw up and crash 2 of my dudes in the big ship as well. So for now it\u0027s just sitting there until I figure out exactly what I\u0027m going to do. Probably send up a probe with a claw on it and switch off, then let it crash and burn. Might leave the big three up there floating for a while so they quit sneaking onto my dangerous missions, then refuel in a hundred or so game days and try to wrangle a class B asteroid that\u0027s set to pass through Minmus\u0027 general area.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0501-55-20-34.jpg~original\u0022 alt=\u0022KSP2014-05-0501-55-20-34.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EI built a ship to land on the Mun and actually bring back something other than EVA reports and soil samples, and biffed the landing... This is where it gets weird. Jeb (that sneaky *******) hopped out and was walking around, then realized he couldn\u0027t get back in the ship because the door was facing down and he kept bumping his head trying to grab the ladder. So I tried to quickload to a point where he hadn\u0027t left the ship yet (but it was still trashed) and it just so happened that he was on the ladder when I made the quicksave. As soon as it loaded, he fell off and died. Somehow. I still can\u0027t figure that out. After trying everything I logically could for about 5 minutes, I realized I couldn\u0027t save him so I let him go poof and I sent another ship to go pick up the data. (Jeb fairly quickly came back from the dead.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0421-30-38-59.jpg~original\u0022 alt=\u0022KSP2014-05-0421-30-38-59.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0421-26-51-87.jpg~original\u0022 alt=\u0022KSP2014-05-0421-26-51-87.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I got some docking ports etc so I decided to refit that ship to dock in LKO and refuel then cruise out to Minmus and back, which it did admirably with plenty of fuel to spare. Which is funny because I could have easily done it without refueling if I wanted to, and when I got back I just put the whole thing into a 30km aerobraking maneuver, watched the light show, then staged right behind the capsule\u0027s little backup engine and popped the chute... What a waste. And I know, that \u0022tanker\u0022 is a joke. It was really made to go as far as possible and still have enough fuel to help out if I was stuck somewhere. I sent one just like it to the Mun \u0022just in case\u0022, then decided to toss one up in LKO specifically for this mission. That was right before I unlocked Mainsails and orange tanks. Also I have no idea why I made the probe core able to leave the big tank behind under its own power, it\u0027s not like it matters. I think I was on two trains of thought and I was going to send one to Minmus with extra sensors on it then ditch the (full) tank in orbit and bring the data back. Who knows. This reminds me, I need to do something with that lander if I\u0027m going to continue to use it (probably not). With the Skipper still attached at the bottom it\u0027s near impossible to dock because it\u0027s off balance, and will barely turn without RCS because originally I dropped that section as I was leaving LKO so I didn\u0027t care and never put reaction wheels on it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0420-16-36-30.jpg~original\u0022 alt=\u0022KSP2014-05-0420-16-36-30.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0423-26-03-05.jpg~original\u0022 alt=\u0022KSP2014-05-0423-26-03-05.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-05-0500-16-39-58.jpg~original\u0022 alt=\u0022KSP2014-05-0500-16-39-58.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt seems that after taking my break on .23, I\u0027m addicted again. Oh well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-05T06:59:56Z\u0022 title=\u002205/05/2014 06:59  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 5, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2014-05-05T09:13:12Z","Content":"\n\u003Cp\u003EMentioned this before, but here\u0027s a screenie of Jeb doing the Abort-to-EVA:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/0DnBcHw.png\u0022 alt=\u00220DnBcHw.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"loch.ness","CreatedById":101329,"CreatedDateTime":"2014-05-05T10:29:03Z","Content":"\n\u003Cp\u003EAs I entered \u0022Final\u0022 preparations for my Moho mission (yet again - something is always not yet right) I took a break to work on a military project.\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/450668507907473519/8E88E2C42D2891C3AA7C1E487320A4D3EADFA50A/1024x640.resizedimage\u0022 alt=\u00221024x640.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think my Moho missions had given me too many headaches (and I haven\u0027t even left yet). My first interplanetary ship went wrong from the very start, when the landers couldn\u0027t undock I staged them off and let the crew RCS back to Kerbin (they had chutes in-case they were to be used as return craft or for emergency abort prior to leaving Kerbin SOI).\u003C/p\u003E\u003Cp\u003EI\u0027m happy enough with my ICARUS I now (Interplanetary Command And Reconnaissance Utility Ship). \u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/450668507907468222/ACC30BE98880CD8A20599BD804FB5D6D3AF83A3E/1024x640.resizedimage\u0022 alt=\u00221024x640.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt won\u0027t have enough fuel to return, but I\u0027ve got a solution for that. ICARUS 1 - the Mark Twain is captained by Bob. Its landers (Tom and Huck) will be competing with ICARUS II for the honor of first touch down.\u003C/p\u003E\u003Cp\u003EICARUS II finished orbital costruction and refueling today. This is Merely - My head Zero-G engineer, at work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/450668507907465033/A123787AA961023985A31DE6EE031D42452F8530/1024x640.resizedimage\u0022 alt=\u00221024x640.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EICARUS II probably won\u0027t have enough fuel for the return either though I\u0027m much less worried about it having fuel and thrust to handle Moho intercept (I half expect ICARUS 1 to blast through its Moho encounter). I sent my now broken interplanetary prototype ahead to serve as a fuel depot, if it makes the flight fine I\u0027ll know both ICARUS crews will too, especially as it didn\u0027t wait for a window. Its going to arrive pretty dry though, which brought me to MARVIN.\u003C/p\u003E\u003Cp\u003EMy solution to my Moho woes (in theory) will be the Moho Adventure Resource Vehicle Intelligence Nexus. MARVIN is an autonomous Kethane extraction and refinery unit... though I am a bit worried about it \u0022upgrading\u0022 my crew... \u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/450668507907476828/C09E352D88D5723D154275372F8F03B51B43DE95/1024x640.resizedimage\u0022 alt=\u00221024x640.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EMoho is proving to be enough of a Pain that I\u0027m about ready to turn the missions around and fly for Eeloo instead, I think the Delta V requirements are similar (haven\u0027t checked) as is the gravity (also haven\u0027t checked). Jool is my next big transfer window and I\u0027m already thinking up what I need to build/test to be ready for Jool (plan to try to visit every moon on my first go... do not expect to succeed). After Jool is my first Duna window by which point I should be ready to launch a colony.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-05-05T10:34:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeroignite\u0022 data-cite=\u0022Zeroignite\u0022\u003E\u003Cdiv\u003EMentioned this before, but here\u0027s a screenie of Jeb doing the Abort-to-EVA:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow did you make Kerbin look like that.\u003C/p\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2014-05-05T10:56:20Z","Content":"\n\u003Cp\u003EKerbal Space Program Renaissance Compilation, plus a custom skybox, plus slightly edited suit textures.\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2014-05-05T12:21:35Z","Content":"\n\u003Cp\u003EBuilt a station orbiting the mun (Kerbal Station One is too long to accurately move anymore, flex\u0027s way too much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EMunar Station One has two modules already, tossed them up separately and assembled in munar orbit.\u003C/p\u003E\u003Cp\u003ESo I now have a station in Kerbin Orbit, Mun Orbit, and currently one 3 Kerbal lander in farside crater, to which I dropped them a rover to go truckkin in.\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-05-05T13:32:34Z","Content":"\n\u003Cp\u003EPerhaps you remember Queen Dresmeralda, the well dressed queen of Dres and all that is lumpy? I just finished her quest for asteroid domination!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BaU7vmE.png\u0022 alt=\u0022BaU7vmE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELet us start from the beginning, shall we? She came to liberate our beloved dwarf planet from the terrible pretender queen who didn\u0027t even pay the landing fee.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bcQ0OFv.png\u0022 alt=\u0022bcQ0OFv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEquipped with only a rocket launcher, fueled by blood and powered by hatred, our glorious Queen heroically confronted the unarmed impostor from behind!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bWIjyk5.png\u0022 alt=\u0022bWIjyk5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnable to defend herself, her stricken adversary could only watch as justice hit her like a hammer; her solar panels had been ripped clean off by the blast. Such is the precision of the rocket launcher mounted on the shoulder of Queen Dresmeralda.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fBInHXp.png\u0022 alt=\u0022fBInHXp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EForever trapped underneath Queen Dresmeralda\u0027s terrible metal gown, the overthrown pretender can only watch as her old realm is being governed by its rightful ruler instead. Without any electrical systems to support her, she can neither move, speak nor even see. She is trapped and shall remain so for all eternity, for such is the punishment for asteroid theft!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rw1Y3fl.png\u0022 alt=\u0022Rw1Y3fl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll hail Dresmeralda, Queen of Dres and all that is lumpy! May her reign last until the end of time!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-05T13:58:32Z\u0022 title=\u002205/05/2014 01:58  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 5, 2014\u003C/time\u003E by Felsmak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pantner","CreatedById":83119,"CreatedDateTime":"2014-05-05T14:26:29Z","Content":"\n\u003Cp\u003EI\u0027ve been doing work on my custom control panel/display.\u003C/p\u003E\u003Cp\u003EThis is what I have got working so far.\u003C/p\u003E\u003Cp\u003E\u0026lt;a href=\u0022\u003Ca href=\u0022http://imgur.com/HeRGdRC\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/HeRGdRC\u003C/a\u003E\u0022\u0026gt;\u0026lt;img src=\u0022http://i.imgur.com/HeRGdRC.jpg?1\u0022 title=\u0022Hosted by imgur.com\u0022 /\u0026gt;\u0026lt;/a\u0026gt;\u003C/p\u003E\u003Cp\u003EThe plugin to do this can be found in this thread if you are interested...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66393-Hardware-Plugin-Arduino-based-physical-display-serial-port-io-tutorial-%2804-May%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66393-Hardware-Plugin-Arduino-based-physical-display-serial-port-io-tutorial-%2804-May%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mazlem","CreatedById":57206,"CreatedDateTime":"2014-05-05T14:29:55Z","Content":"\n\u003Cp\u003EVery cool Pantner!\u003C/p\u003E\u003Cp\u003EI just finished uploading part 2 of the Kerbal\u0027s little asteroid wrangling mini-series. Things go well even after the explosion.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/IeIO1olk6Tk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-05T23:57:57Z\u0022 title=\u002205/05/2014 11:57  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 5, 2014\u003C/time\u003E by Mazlem\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2014-05-05T15:00:08Z","Content":"\n\u003Cp\u003EI went mun roving for science\u003C/p\u003E\n"},{"CreatedByName":"User Unrelated","CreatedById":74021,"CreatedDateTime":"2014-05-05T15:26:10Z","Content":"\n\u003Cp\u003EBeen having fun with my couple new realism mod...\u003C/p\u003E\u003Cp\u003EI\u0027ve had FAR for a while, but the new structural failures have really been helping me design less wobbly rockets.\u003C/p\u003E\u003Cp\u003EAlso, deadly reentry has been interesting, and has been helping me re-enter atmospheres more realistically (instead of just bombing straight in and hitting the chutes high up)\u003C/p\u003E\u003Cp\u003EI\u0027m thinking life support next.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i149.photobucket.com/albums/s59/KSPbox/screenshot5_zps94c1d8fc.png\u0022 alt=\u0022screenshot5_zps94c1d8fc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i149.photobucket.com/albums/s59/KSPbox/screenshot6_zpsecaa8f71.png\u0022 alt=\u0022screenshot6_zpsecaa8f71.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PlonioFludrasco","CreatedById":98915,"CreatedDateTime":"2014-05-05T16:02:36Z","Content":"\n\u003Cp\u003ETrying KAS stuff \u003C/p\u003E\u003Cp\u003EJeb discovered how fun is being lifted by a winch\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gi4Gc4o.jpg?1\u0022 alt=\u0022gi4Gc4o.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd while moving things around, Bill stated that the small radial engine is very useful when your boots are dirty\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u66Etga.jpg?1\u0022 alt=\u0022u66Etga.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Karla","CreatedById":109530,"CreatedDateTime":"2014-05-05T17:06:40Z","Content":"\n\u003Cp\u003EBuilt a double decker asparagus launcher and set course from Kerbin to Eloo via low Kerbol orbit. I drifted a bit during the hour long burn so I don\u0027t know if I will miss Eloo.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-05-05T20:24:56Z","Content":"\n\u003Cp\u003E@Felsmak: That... Is impressive. I always enjoy seeing the odd creations people come up with in this game lol. Also you\u0027ve just (re)inspired me to work on a weapon system. I got the idea after I fired two small fuel tanks up and out of sight using only a decoupler on Minmus, due to a slight design flaw. The idea was I\u0027d jettison the larger tanks after landing and then take off with the smaller ones (assuming I\u0027d used up the fuel to land) but... It was based on an older design that actually worked, but I threw this one together in orbit for some reason and when the side engines were attached to the lifter it made sense, but when I docked it to my lander well... You can kind of see how that turned out. *facepalm*\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2013-12-2402-48-09-76-1.png~original\u0022 alt=\u0022KSP2013-12-2402-48-09-76-1.png~original\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-05T20:31:28Z\u0022 title=\u002205/05/2014 08:31  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 5, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2014-05-05T21:29:29Z","Content":"\n\u003Cp\u003EI finally build a plane I can fly and actually land where I want it to, then went to the island runway with it. And then to the Anomaly north of KSC. Stopped ~350m behind it after missing it by like 2 meters - I have to do something about those breaks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso lost more than a hour trying to hunt down a mod bug - the specific part was somehow broken and deleting and readding it actually fixed the problem.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-05T21:58:17Z","Content":"\n\u003Cp\u003EI finally finished assembling a fairly large modular space station in LKO. It has full scientific facilities, a considerable amount of fuel (about three X200-32\u0027s worth) and monoprop, docking facilities for ships of any size, four little 4-man escape pods, and a robotic tug. When I have time to play again, I\u0027ll post pics in the other thread.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-05T22:23:13Z","Content":"\n\u003Cp\u003EMy efforts to dock my ion drive module with my station made a good impression of a Chihuaha humping a Great Dane. I got it docked, but decided that while engine-only docking is \u003Cem\u003Epossible\u003C/em\u003E, it\u0027s a horrible thing to do and I never want to attempt it again, so I deorbited the sodding thing. Having consigned the payloads, a couple of lighting poles, to the same fate earlier that\u0027s a good few hours of time wasted in frustration for no result :@\u003C/p\u003E\u003Cp\u003EThen I redesigned the darn things, putting RCS and a reaction wheel on the drive module, and a reaction wheel and better placed lights on the lighting poles. Built a small chemical drive module too which I might use instead of the ions for my next attempt, much less delta-V of course but more thrust and \u003Cem\u003Efar\u003C/em\u003E fewer parts. The ions were hilarious overkill just for reaching a space station really.\u003C/p\u003E\n"},{"CreatedByName":"incal","CreatedById":110170,"CreatedDateTime":"2014-05-05T22:42:19Z","Content":"\n\u003Cp\u003ESpent a very frustrating afternoon trying to get a small space shuttle to work. Turns out it always goes out of balance at some point as the tanks go empty.\u003C/p\u003E\u003Cp\u003EHow NASA came up with a design so insanely difficult to balance is beyond me.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-05T23:51:26Z","Content":"\n\u003Cp\u003EWell in KSP we have at most 3 degrees of gimballing (on the Mk 55 and the Rapier). The Space Shuttles engines had 10 degrees, which was required to keep the thrust pointed through the changing centre of mass. It\u0027s small wonder shuttles are hard in KSP.\u003C/p\u003E\n"},{"CreatedByName":"incal","CreatedById":110170,"CreatedDateTime":"2014-05-06T00:50:52Z","Content":"\n\u003Cp\u003EOh well, I understand now; it was basically impossible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI feel the SRBs should go out smoothly like in real life, that would already make it easier to transition. Also more gimballing angle. Maybe in a future update, or a mod..?\u003C/p\u003E\n"},{"CreatedByName":"Lundmunchkins","CreatedById":85761,"CreatedDateTime":"2014-05-06T02:19:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022loch.ness\u0022 data-cite=\u0022loch.ness\u0022\u003E\u003Cdiv\u003EAs I entered \u0022Final\u0022 preparations for my Moho mission (yet again - something is always not yet right) I took a break to work on a military project.\u003Ca href=\u0022http://cloud-4.steampowered.com/ugc/450668507907473519/8E88E2C42D2891C3AA7C1E487320A4D3EADFA50A/1024x640.resizedimage\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-4.steampowered.com/ugc/450668507907473519/8E88E2C42D2891C3AA7C1E487320A4D3EADFA50A/1024x640.resizedimage\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know, I once made a Dalek in KSP too, but it couldn\u0027t move or fly.\u003C/p\u003E\n"},{"CreatedByName":"loch.ness","CreatedById":101329,"CreatedDateTime":"2014-05-06T03:03:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lundmunchkins\u0022 data-cite=\u0022Lundmunchkins\u0022\u003E\u003Cdiv\u003EYou know, I once made a Dalek in KSP too, but it couldn\u0027t move or fly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI put wheels on the bottom, but I think it was too heavy, was thinking of trying to use ions for \u0022EleVaTion\u0022 on a future model, but it was really just me getting frustrated with Moho mission prep and being silly. My KAC timer says I have 22 days till my Moho transfer window and the cheapest dV of anything I sent ahead of that window has been ~ 5.6k dV from orbit before the braking at Moho (which I\u0027m not sure those ships will have fuel for. I\u0027ve got my big lovely ships but I\u0027m not sure they\u0027ll make it without better piloting than I think I can manage (seeing as this is my first attempt at going there and the only other interplanetary mission I\u0027ve done was an over budget Duna mission in a previous save that still ran dangerously low on fuel for return trips.\u003C/p\u003E\u003Cp\u003EI could probably get away with sending one of those ships to Gilly and peeping the other for Jool (next major window) and just scrapping Moho, but another part of my brain says \u0022you still have time to figure something out, just get there first. \u003C/p\u003E\u003Cp\u003EAfter setting this planet as a goal and reading up on the forums, I\u0027m thinking I was over ambitious. Eeloo and Jool look easier than Moho and I still haven\u0027t managed a Duna return mission or Gilly mission (not touching Eve yet).\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-06T03:06:38Z","Content":"\n\u003Cp\u003EFinally got the lights on my station. I did a lot more ground testing to make sure I\u0027d get good coverage of the station, needed ten lights on each pole. Found there\u0027s a bit of saturation when they combine with sunlight but it\u0027s not too bad.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nvDyw2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm3.staticflickr.com/2935/14118999045_98c52f111c_b.jpg\u0022 alt=\u002214118999045_98c52f111c_b.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENext thing to add is a bunch of senior docking ports for parking the modules in my new modular ships, since the station core only has two.\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2014-05-06T03:51:20Z","Content":"\n\u003Cp\u003EI\u0027m preparing for the Jool-5 Challenge (its in the Challenges forum, if interested). Today\u0027s project is the Tylo lander. Under simulation (e.g. Hyperedit testing) it can descend from a 60km orbit, land, then launch back to a 60km orbit with more than 350m/s delta-v remaining. Not convinced this is the best design, but it works. Jeb is excited.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://bobandeileen.com/ksp/TyloLanderOne.png\u0022 alt=\u0022TyloLanderOne.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pwnstarr","CreatedById":84803,"CreatedDateTime":"2014-05-06T05:31:21Z","Content":"\n\u003Cp\u003EJoined the SSTO club at long last... just barely \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pSn0QLZ.png\u0022 alt=\u0022pSn0QLZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r7yVfRX.png\u0022 alt=\u0022r7yVfRX.png\u0022\u003E\u003C/p\u003E\n"}]}