{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":778,"Articles":[{"CreatedByName":"Generalstarwars333","CreatedById":151938,"CreatedDateTime":"2015-10-19T15:52:07Z","Content":"\n\u003Cp\u003EMade a research base near the runway and had it make science for a couple of years. Then tried and failed several times to make a good VTOL. I just want to get something to go do those temperature readings contracts that doesn\u0027t take five weeks to get there and can land in a small space without parachutes!\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-10-19T15:55:11Z","Content":"\n\u003Cp\u003EI did this plane! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/qUfVnLf.png\u0022 alt=\u0022qUfVnLf.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wild Cobra","CreatedById":150214,"CreatedDateTime":"2015-10-19T16:00:10Z","Content":"\n\u003Cp\u003ESo far, I nearly emptied a refueler into a station I\u0027m sending to the Mun Rocked challenge. two or three more tankers, and I\u0027m ready to head to the Mun. Hopefully I will complete that today.\u003C/p\u003E\n"},{"CreatedByName":"nsgallup","CreatedById":136892,"CreatedDateTime":"2015-10-19T16:27:38Z","Content":"\n\u003Cp\u003ERefined the efficiency of my Laythe lander and transfer system\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/395547605770909871/011EC5E5D46FB2458FD9E6D7EEEB4A2C536A8F7E/\u0022 alt=\u0022011EC5E5D46FB2458FD9E6D7EEEB4A2C536A8F7E\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AdrianK.","CreatedById":144890,"CreatedDateTime":"2015-10-19T18:26:08Z","Content":"\n\u003Cp\u003EI did the 64 bit workaround today. Works like a charm \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-19T18:40:32Z","Content":"\n\u003Cp\u003EI spent my evening testing re entry of my duna return plane. Made adjustments to the new joy stick, making for easier landings. Unfortunately my minimus drill rig is not performing as needed, so tonight work may be a complete redesign of my ore harvester. As fuel is not being produced fast enough for ships queuing up for departure.\u003C/p\u003E\n"},{"CreatedByName":"stratvox","CreatedById":134498,"CreatedDateTime":"2015-10-19T18:44:01Z","Content":"\n\u003Cp\u003EOver the weekend... well, finally got to my first Duna transfer in my 1.04 career game, so I fired off a bunch of ships at that... Duna lander, Duna polar sat, Duna synchronous orbit sat, Ike scilab, and a resource scanner which isn\u0027t contracted for but will get there and fully map out both Duna and Ike. I also wrangled the first asteroid threatening to obliterate itself on Kerbin, and now have it in a very eccentric orbit that I will be regularizing into LKO so I can start building a refuelling facility, and just generally use it as the basis for a central point to have crews and ships come and go as required. I\u0027m aiming for maximum reusability of assets that I\u0027ve gotten up off the surface of Kerbin, and I hope to be able to continue this so I can have things going on without it costing me tremendous amounts of money, either building the vessel or getting it into orbit. I\u0027m also kind of looking at the idea of using asteroids in conjunction with KIS/KAS to orbital construction on the asteroids and use them as the basis for large vessels moving about the kerbin system... with a class E and mining and the right facilities built into/onto the asteroid I bet you can go hit a LOT of the bodies in Kerbin without necessarily having to worry so much about how much fuel you can carry with you. A little floating city on a rock, as it were.... and if there ever comes a time when stock comes with more than one star that\u0027s one way to approach interstellar transfers.\u003C/p\u003E\u003Cp\u003EAnyway. Next up is taking the large group of Kerbals I\u0027ve got orbiting Minmus and get them down to the surface, getting a flag on, and getting them back to the KSC so I can get them all to level three and then use them to build onto the asteroid I\u0027m wrangling (which is the first one I\u0027ve ever done, so I\u0027m already looking at how to improve the ship design I\u0027m using to conquer that thing... it\u0027s a class D and I\u0027ve already figured out some of the shortcomings of my design for moving asteroids so I\u0027m looking forward to improving on it... but it\u0027ll take a while because the Duna transfer has eaten ALL OF THE MONEY so until I can get some contracts dealt with I\u0027m down to using the assets I have to get my science moving along for the next planetary transfer... plus I\u0027m also hoping to unlock enough tech to be able to start looking seriously at making SSTOs happen, so I can move Kerbonauts up and down to my orbital station more cheaply than I\u0027m able to currently.\u003C/p\u003E\u003Cp\u003EFun and games, fun and games \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kuansenhama","CreatedById":114023,"CreatedDateTime":"2015-10-19T18:49:13Z","Content":"\n\u003Cp\u003ESo I took this space station contract without stopping to read how much krew capacity it was asking for...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qJHOwvr.png\u0022 alt=\u0022qJHOwvr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlright. Let\u0027s get this over with.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y2bGdeK.png\u0022 alt=\u0022y2bGdeK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter making orbit and payday, I decided to land it. Becuase, why not?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SaM57kx.png\u0022 alt=\u0022SaM57kx.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2015-10-19T19:14:07Z","Content":"\n\u003Cp\u003EBrought home my first Mun and Minmus landers in my new game, they let me unlock Labs, ISRU and Nervas, so I took a 3 station missions(Kerbin, Minmus, Mun orbit), Tourists, and 3 rescue missions(so far), and launched a 500K Mk3 rocket into orbit capable of holding 22 kerbals(needed 16\u002B science), 1500 ore(missions require 1050 and 400), and 10K liquid fuel(Minmus station needs 6K), all pushed by 5 nervas.\u003C/p\u003E\u003Cp\u003ELoaded up every Kerbal I had, and set out to get everyone up to 3 stars(Mun flag, Minmus flag, Kerbol Flyby).\u003C/p\u003E\u003Cp\u003EExpected profits \u0026gt; 4M.\u003C/p\u003E\u003Cp\u003EI also experimented with KAS/KIS and managed to successfully remove the struts and decoupler from the core of my lifter stage(still ~ 50 fuel), putting a docking port in place of the decoupler.\u003C/p\u003E\u003Cp\u003E(the decoupler floated off as it did not fit in my inventory, next time I\u0027ll try a parts bin instead of just putting parts in kerbal inventories)\u003C/p\u003E\u003Cp\u003EUnfortunately it looks like the life support recycler I used is not up for supporting the 10\u002B kerbals on board, fortunately I still have ~300 days worth of supplies for a mission that should take less than a month.(UKS)\u003C/p\u003E\u003Cp\u003EI was thinking about leaving it up in orbit until I got a contract that requires I land 400 Minmus ore on Kerbin. Of course the next one is expected to have a few Gigantors instead of lots of shielded 1x6\u0027s, and that should make mining and refining go more smoothly.\u003C/p\u003E\u003Cp\u003ECurrently transiting from Mun to Minmus after visiting a couple new Mun biomes. Expecting to get that last Minmus Flats biome when I arrive, now that I have Minmus mapped.\u003C/p\u003E\u003Cp\u003EThought about taking them all the way to Duna for 4 stars, but my engine count was designed for easy Mun liftoff, and can manage ~2.7m/s/s, not Duna liftoff needing \u0026gt; 2.9m/s/s; even if 4km/s of delta-v would probably handle the trip quite well. \u003C/p\u003E\u003Cp\u003ENow that I have the tech to go places, I should really set up a demonstration base a couple km from KSP so I can figure out exactly how all this UKS stuff works...\u003C/p\u003E\n"},{"CreatedByName":"ROXunreal","CreatedById":133129,"CreatedDateTime":"2015-10-20T00:09:04Z","Content":"\n\u003Cp\u003EAfter \u003Cem\u003EDawn \u003C/em\u003Eand \u003Cem\u003ESunrise \u003C/em\u003Espacecraft managed to leave the atmosphere and achieve orbit around Kerbin (respectively), my new career continues on with \u003Cem\u003EMunrise \u003C/em\u003Ecraft doing a successful flyby of Mun, and \u003Cem\u003ESalvation \u003C/em\u003Ebasic rescue vessel doing a first orbital rendezvous and rescuing a stranded astronaut for a contract.\u003C/p\u003E\u003Cp\u003EMunrise:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YpsBo2j.jpg\u0022 alt=\u0022YpsBo2j.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2gsBmBw.jpg\u0022 alt=\u00222gsBmBw.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESalvation:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YHEOUUw.jpg\u0022 alt=\u0022YHEOUUw.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RwX2EDE.jpg\u0022 alt=\u0022RwX2EDE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETomorrow we will achieve orbit around Mun, and after that send a lander. Then slowly build satellite communication network, put up a space station or two and visit Minmus. And then in a week or so pick off where I stopped 9 months ago - visiting other planets, which I never got around to in this game yet.\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-10-20T00:48:47Z","Content":"\n\u003Cp\u003EI \u003Cem\u003Emight\u003C/em\u003E have underestimated my TWR... well you know what they say: too much is always better than not enough ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q3KkOaa.png\u0022 alt=\u0022Q3KkOaa.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Goomblah","CreatedById":143441,"CreatedDateTime":"2015-10-20T01:04:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaarst\u0022 data-cite=\u0022Gaarst\u0022\u003E\u003Cdiv\u003EI \u003Cem\u003Emight\u003C/em\u003E have underestimated my TWR... well you know what they say: too much is always better than not enough ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Q3KkOaa.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Q3KkOaa.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMOARRRRR BOOOSTERS\u003C/p\u003E\u003Cp\u003EIs that for the Mach 10 in 10s challenge?\u003C/p\u003E\u003Cp\u003EEDIT: Oh, yes it is. Hadn\u0027t gotten to that thread yet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-20T01:07:15Z\u0022 title=\u002210/20/2015 01:07  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 20, 2015\u003C/time\u003E by Goomblah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-10-20T01:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Goomblah\u0022 data-cite=\u0022Goomblah\u0022\u003E\u003Cdiv\u003EMOARRRRR BOOOSTERS\u003Cp\u003EIs that for the Mach 10 in 10s challenge?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, just added my answer, and I will probably make a more detailed album tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2015-10-20T01:14:03Z","Content":"\n\u003Cp\u003EI started work on a MK3 cargo SSTO\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D42aPKd.jpg\u0022 alt=\u0022D42aPKd.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xub313","CreatedById":57408,"CreatedDateTime":"2015-10-20T02:20:28Z","Content":"\n\u003Cp\u003EI finished designing my Eve/Gilly mission mothership and the rocket to lift it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7rxGCfE.png\u0022 alt=\u00227rxGCfE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECerenkov 1 has a mass of about 45 metric tons. The biggest rocket I had could only get 12 metric tons to LKO. So I had to design a new one.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bwvmmI3.png\u0022 alt=\u0022bwvmmI3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has a very high TWR of 2, but theoretically it should get Cerenkov to orbit.\u003C/p\u003E\u003Cp\u003EAfter that I have to send up the Gilly lander, the crew, and the Eve probe. The entire mission will cost half a million funds. This is one of the most complex missions I\u0027ve done in KSP. I am exited. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerBlammo","CreatedById":137834,"CreatedDateTime":"2015-10-20T04:17:14Z","Content":"\n\u003Cp\u003EI completed my Duna campaign!!! First an orbital habitat and the lander were sent towards Duna. Later during the same window, the crew departed on board the \u003Cem\u003EEndeavour. (\u003C/em\u003EDuring as previous window a surface habitat had been sent and landed.)\u003C/p\u003E\u003Cp\u003EEndeavour arriving in Duna orbit:\u003C/p\u003E\u003Cp\u003Ev=\u003Cimg src=\u0022http://i.imgur.com/3GviTmA.png\u0022 alt=\u00223GviTmA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd docked with the orbital habitat, lander and transfer stage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XFUORfu.png\u0022 alt=\u0022XFUORfu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was able to land within 250 m of the base, not as good as his best result in the simulator (99m) but close enough!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cKt1GkV.png\u0022 alt=\u0022cKt1GkV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew about to enter the base:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PrhSDvb.png\u0022 alt=\u0022PrhSDvb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter an extended stay the crew returned to orbit and safely returned to Kerbin on board \u003Cem\u003EEndeavour\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/opPfEaz.png\u0022 alt=\u0022opPfEaz.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-10-20T04:43:17Z","Content":"\n\u003Cp\u003EOpened up a new 64K save to try out some different mods, particularly Tantares, which I\u0027ve always liked the look of but I\u0027ve tended to find the parts a little on the lightweight side for the stock system. Figured they\u0027d be perfect for 64K, though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/50g14YJ.jpg?1\u0022 alt=\u002250g14YJ.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ESent up a few comsats with this Soyuz-ish rocket. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RnB4MpJ.jpg?1\u0022 alt=\u0022RnB4MpJ.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main booster puts the satellite nearly into orbit; the final stage is a solid motor which kicks it into about a 150x2000km elliptical orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/81Kw2JL.jpg?1\u0022 alt=\u002281Kw2JL.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ESent up a manned mission to try out a heavier booster. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xITnmiN.jpg?1\u0022 alt=\u0022xITnmiN.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Soyuz-type spacecraft makes orbit with plenty of delta-v left for maneuvering, though not enough to actually go anywhere in 64K.\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-10-20T05:24:54Z","Content":"\n\u003Cp\u003Efinished my VAB cargo lift... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3LEiAB3.jpg\u0022 alt=\u00223LEiAB3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SmashingKirby148","CreatedById":130193,"CreatedDateTime":"2015-10-20T06:42:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022luizopiloto\u0022 data-cite=\u0022luizopiloto\u0022\u003E\u003Cdiv\u003Efinished my VAB cargo lift... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/3LEiAB3.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/3LEiAB3.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOooh! I like that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2015-10-20T08:46:49Z","Content":"\n\u003Cp\u003ESo many awesome pictures and stories in this thread. \u003C/p\u003E\u003Cp\u003EWhat I\u0027m doing in regards to KSP today is... uhm... well I\u0027m sipping coffee, so there\u0027s that... I mean, rockets might run on any number of exotic cryogenic fuels, but engineers and pilots run best on caffeine right? \u003C/p\u003E\u003Cp\u003ETho, yesterday I cleaned up my old array of medium range com sats (contract orbits), about 25 of them, and a few expensive, but somehow wrongly built scansats. All by lazy deletion. Yes... I could have deorbited each one manually or reused them at the orbital dock, but doing the same things that many times in a row? \u003C/p\u003E\u003Cp\u003EInstead I designed a new, still cheap, but over deltav\u0027ed, long range com sat series. Which lead to a heap of problems during deployment. Yes, overheat bug while timewarping. Tried other parts, tried turning it 90 degrees in the VAB and tried steams repair to no avail. Since they didn\u0027t explode and did slowly cool off while at no timewarp, I decided to deploy 6 of them to KEO orbit anyway and just never return to them. \u003C/p\u003E\u003Cp\u003EThen I designed a specific ressources scanning sat, to be my first on orbit constructed thing and then... I proceeded to design a resupply rocket for delivering rocket parts to the station. Only to discover I had designed it around being empty. *lol* So that\u0027ll be the doover for today.\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2015-10-20T09:22:57Z","Content":"\n\u003Cp\u003EI was working on some kind of rapid accent rocket, when I realized my TWR was exceeding 3 with a payload of 32t.\u003C/p\u003E\u003Cp\u003EOoops.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i357.photobucket.com/albums/oo19/TimePeriod/2015-10-20_00001_zps7z7rqtba.jpg\u0022 alt=\u00222015-10-20_00001_zps7z7rqtba.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2015-10-20T09:27:15Z","Content":"\n\u003Cp\u003EMy next Duna mission landed at the red planet last night and began setting up for its mission to find good ore deposits. Its job is to find a good place for the colony I am designing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/b3UmSgJ.png\u0022 alt=\u0022b3UmSgJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VameD93.png\u0022 alt=\u0022VameD93.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HnY8Inm.png\u0022 alt=\u0022HnY8Inm.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-10-20T11:04:21Z","Content":"\n\u003Cp\u003EI made a proof of concept spaceplane, although all it really proved was that this thing flies like a pig. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HJkVyYW.png\u0022 alt=\u0022HJkVyYW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GbWON3b.png\u0022 alt=\u0022GbWON3b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OinQova.png\u0022 alt=\u0022OinQova.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lG5BcnC.png\u0022 alt=\u0022lG5BcnC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qKQ4LJL.png\u0022 alt=\u0022qKQ4LJL.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-10-20T12:40:18Z","Content":"\n\u003Cp\u003EStarted working on a Venus ascent vehicle, haven\u0027t decided if I\u0027ll make it SSTO or not though...\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2015-10-20T12:45:40Z","Content":"\n\u003Cp\u003EPlaced my Orbital Refinery in equatorial Munar orbit, and landed the Munar Prospector in East Crater. A little worried about the amount of deltaV left in the Prospector lander after landing; I might have cut it too close. We will see.\u003C/p\u003E\u003Cp\u003EA third launch will carry empty tanks to fit out the Refinery and more kerbonauts to fully staff it.\u003C/p\u003E\n"}]}