{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":323,"Articles":[{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-06-10T02:10:08Z","Content":"\n\u003Cp\u003EToday I had a revelation that if a Kerbal on EVA can carry an unlimited amount of science data, then by extension so can a Kerbal in a low-budget command pod jury-rigged out of an external chair and some fairings. So I built \u0022Science Shlepper Mk2\u0022, a shuttle of sorts whose task is to periodically visit my outposts, collect all their Science, and bring it back to Kerbin in one big batch.\u003C/p\u003E\u003Cp\u003EExploit? Yes. Worth it? Totally.\u003C/p\u003E\u003Cp\u003EBut then I realized that my available selection of lift rockets included a micro-mini rocket which couldn\u0027t carry the ship even off the pad, and a number of hugely overqualified monster ships rated for 18 tons and up (this thing weighed about 2 tons). The Kerbal staff was unanimously in favor of just launching a big, fat rocket, but I with my sense of propriety and misguided aversion to wastefulness decided to spend the rest of the day trying to build a light lifter. Turns out that\u0027s a hard task for me.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-10T03:10:55Z","Content":"\n\u003Cp\u003ERendezvoused with my Duna-bound asteroid during its Kerbin flyby and set about rearranging the various bits. Here it is with everything together.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nTmzTU\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3842/14364649686_2b748f7a68_o.png\u0022 alt=\u002214364649686_2b748f7a68_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENext stop: Duna!\u003C/p\u003E\u003Cp\u003EAnd the return vessel, to take the original crew and some science back to Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nVo6M6\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3879/14387578315_6f85b7c842_o.png\u0022 alt=\u002214387578315_6f85b7c842_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe engine section here is the original one from the asteroid tug. For the return I\u0027ve given it only just enough fuel to deorbit shortly before it would leave Kerbin\u0027s SOI.\u003C/p\u003E\n"},{"CreatedByName":"DivisionByZero","CreatedById":62591,"CreatedDateTime":"2014-06-10T06:47:53Z","Content":"\n\u003Cp\u003EI\u0027ve got maintenance going on. My asteroid redirect failed when the SOI change (or something) resulted in the asteroid being out of position for capture. The new delta-v for capture was 300m/s up from 70m/s. I had 84 m/s left. Incidentally, this was with lithium plasma engines in KSPI so I had a crap-ton of fuel. So, I aborted the mission and sent the asteroid tug (the Atlas) on a return mission to Kerbin. This meant swinging past Mun in order to change a retrograde orbit into prograde, and then a series of maneuvers to dock it with my space station in Kerbo-stationary orbit. Fortunately, all the spare Li on board meant I could load up some empty tanks I had constructed in orbit so I can eventually breed tritium on the station. I was also able to transfer the life support resources to the station before setting up an empty Atlas in a parking orbit about 10km away from the station (for lag reasons).\u003C/p\u003E\u003Cp\u003EI also set a small transfer vehicle with loads of science on its way back from Minmus to rendezvous with the same station. There, it will drop off the science and pick up a replacement crew for the station which has been moved from Minmus to Mun. \u003C/p\u003E\u003Cp\u003EI modified a SSTO spaceplane that had been set up to carry Kerbals so that the extra seats were replaced with the 6m cargo space. The cargo space will carry up resupply materials in the form of life support and UF4 for the station. It is also carrying up a DT cryo-stat so that I can breed tritium with the 4.1 GW reactor up there. I checked out the flight stability curves for the flight up and the return trip empty back down but I haven\u0027t launched anything yet. Should be good.\u003C/p\u003E\u003Cp\u003EFinally, I had a probe enter orbit around Duna and start the mapping process. There\u0027s so much delta-v I\u0027m sure I\u0027ll have no problem mapping Ike as well and I may send it on to Dres or Jool if it really looks like a obscene amount of delta-v when I\u0027m done.\u003C/p\u003E\u003Cp\u003EDoes anyone know if you can strap command chairs into a cargo bay and not toast your kerbals?\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2014-06-10T08:31:00Z","Content":"\n\u003Cp\u003EI realized I had never been to Kerbol before, so me and Jeb decided to take a vacation to the sun. It seemed like the perfect opportunity to try a bi-elliptic transfer as well. So I pushed my orbit to somewhere around Jool/Eeloo, burned retrograde at Ap to lower my Pe to just above explodey height above the sun\u0027s surface to maximize Jeb\u0027s suntan. Once at Pe, I burned retrograde again to lower the Ap and lo and behold I got a (lucky) Kerbin encounter. In terms of expended dV, this was a very cheap flight. I didn\u0027t even expect to make it back to Kerbin, but my ship still had about 4000dV left upon arrival.\u003C/p\u003E\n"},{"CreatedByName":"theonegalen","CreatedById":71012,"CreatedDateTime":"2014-06-10T08:33:28Z","Content":"\n\u003Cp\u003EI did my first asteroid redirect mission! Still early in the tech tree, so I sent Jeb out in Orionkerman\u0027s HGR Spud to prevent the apocalypse. Catch it far enough away, and 18 m/s is all you need to prevent oceans rising and civilizations falling.\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2014-06-10T09:26:37Z","Content":"\n\u003Cp\u003EWhile testing a Tylo lander on the Mun, after successfully landing and seperating stages, while waiting for the intercept with the transfer stage in orbit, somehow the joyride of a rocket (48-7S, FLT100 tank and a seat) managed to stay exactly perpendicular to the sun and lose all electric charge. Wobbly Kerman had to lean out and shove it upright with the jetpack.\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-06-10T10:23:12Z","Content":"\n\u003Cp\u003EToday I installed interstellar. . . I am collecting antimatter rather terrified its all gonna blow up. . .\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2014-06-10T18:27:06Z","Content":"\n\u003Cp\u003EBuilt a Mass Relay out of Nasa parts!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y5BEXpI.png\u0022 alt=\u0022Y5BEXpI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/n1D7po2.png\u0022 alt=\u0022n1D7po2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd also the launcher to get all 220 tons of it into orbit, which in turn has given me an idea to get my 250t Jool Five ship into orbit on something that still looks like a plausible rocket instead of an asparagus staged pancake.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-10T18:29:52Z\u0022 title=\u002206/10/2014 06:29  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 10, 2014\u003C/time\u003E by McFarnsworth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justice","CreatedById":112695,"CreatedDateTime":"2014-06-10T18:37:24Z","Content":"\n\u003Cp\u003EToday I registered on the KSP forums and posted the career mode (with Interstellar) trip to Minmus I did last night in the What did you do in KSP today thread.\u003C/p\u003E\u003Cp\u003EI brought a ship that could land, but never ran out of fuel in the launch stage center tank until I left Minmus, so I just landed on the nozzle. Several times! And on slopes! Unlocked a whole column of science.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/BYNNG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"TerLoki","CreatedById":30301,"CreatedDateTime":"2014-06-11T00:39:00Z","Content":"\n\u003Cp\u003EWell I haven\u0027t been doing anything in KSP specifically recently, but since I\u0027ve been tasked with running the computer lab at a boy scout camp these next few weeks I\u0027ve been talking with the other instructors about using KSP to help out with Space Exploration merit badge. Everyone\u0027s on board with the idea, I just need to get a better PC (i.e.: Mine) to run it on, which should happen this weekend. I\u0027ll try to upload some screenshots of the stuff we do later on.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-11T01:03:50Z","Content":"\n\u003Cp\u003EFlew a tight formation of 16 SLS core stages into orbit. Over 600 tons to LKO. Biggest thing I\u0027ve ever launched in a \u0022serious\u0022 mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/J5/screenshot297.png\u0022 alt=\u0022screenshot297.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dire_Squid","CreatedById":111106,"CreatedDateTime":"2014-06-11T01:03:53Z","Content":"\n\u003Cp\u003EWell, after replacing my 6 Mainsail engines with LFB KR-1x2s (and needing to control the rocket while in in Kerbin\u0027s atmosphere with each decoupling) for my MK3 Eve satellite (with SCANsat tech) and FINALLY being able to make a low orbit to get to below 240,000 m above Eve (and it only took me less than 2 Kerbin years)... I got greedy and decided to make my satellite\u0027s orbit near-polar. Basically, my satellite got sucked into Eve\u0027s gravitational field while I was turning its orbit, and I beautifully crashed into purple hellish oblivion (in water, no less).\u003C/p\u003E\u003Cp\u003EThe good news: I milked the OTHER sciences (temperature, barometer, materials bay, and Mystery Goo), and got 200 Science out of it all.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-11T01:11:39Z","Content":"\n\u003Cp\u003EPrepared a big asteroid for aerocapture:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nVTQZ7\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm3.staticflickr.com/2909/14393381912_63551711f2_o.png\u0022 alt=\u002214393381912_63551711f2_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWeighs in at just over 500 tons, and thanks to some errors earlier in the mission I\u0027ve only got 100 m/s of delta-V with it attached. But she handles well thanks to the little control sections, and I want it in an eccentric polar orbit anyway so should have enough fuel for the job.\u003C/p\u003E\u003Cp\u003EAnd brought a small asteroid to my station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nVHVoB\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3905/14391445611_96ba8c6145_o.png\u0022 alt=\u002214391445611_96ba8c6145_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust a little A class, I wanted this to look like an asteroid on the station not a station on the asteroid. I\u0027ll give it a more permanent attachment at some point but for now I just docked the whole tug.\u003C/p\u003E\n"},{"CreatedByName":"Ser Brynden","CreatedById":84390,"CreatedDateTime":"2014-06-11T01:34:33Z","Content":"\n\u003Cp\u003EThe journey of my Voyager 3 spacecraft in Kerbal Space Program. Part mods used: DMagic Orbital Science and AIES Aerospace. Environment mod used: KSP Renaissance Compilation.\u003C/p\u003E\u003Cp\u003E\u0026lt;iframe class=\u0022imgur-album\u0022 width=\u0022100%\u0022 height=\u0022550\u0022 frameborder=\u00220\u0022 src=\u0022http://imgur.com/a/pLDZr/embed\u0022\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T01:37:03Z\u0022 title=\u002206/11/2014 01:37  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by Ser Brynden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-06-11T02:15:46Z","Content":"\n\u003Cp\u003EBob was instructed to drive the Eve Science Rover to a point on the east side of the Eastern Sea and await further instructions.\u003C/p\u003E\u003Cp\u003EThen this ridiculous contraption was landed on the island 40 km offshore from them. The boys will be overjoyed to learn that the ion powered boat (on the front) will be dispatched to bring 2 of them to the island to collect the experimental data and take it back to the rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OOo3Jz3.png\u0022 alt=\u0022OOo3Jz3.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-06-11T03:12:18Z","Content":"\n\u003Cp\u003EI replaced the cruising stage on my Jool ship with something... bigger. It\u0027s basically the same thing as \u003Ca href=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-0823-33-42-08.jpg~original\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E but it\u0027s made to carry a crapload more weight and waste a lot more fuel. Oh and I forgot the science lab, but that\u0027s okay I can just dock it later. Not that I need it since I unlocked the rest of my tech tree with the last excursion.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-0903-29-21-53.jpg~original\u0022 alt=\u0022KSP2014-06-0903-29-21-53.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat was last night, today isn\u0027t my day. I stranded 3 Kerbals in Munar orbit while I was dropping off a goofy looking robotic rover crane (IR). The crane got to the ground just fine since it had its own engines, but I ran out of fuel in the transfer ship while circularizing and, err, forgot to put batteries on it. \u0022Who needs batteries, the rover has 8 RTGs\u0022 *facepalm* I\u0027m going to send a rescue mission but I\u0027m not sure if I\u0027m going to send up batteries (KAS) and fuel on a probe and bring the ship back, or just bring a hitchhiker container and get the Kerbals home. Might as well just send the hitchhiker container because the other ship can\u0027t deorbit safely. Ugh. This is what happens when I test launch something before it\u0027s actually finished and it goes better than expected.\u003C/p\u003E\u003Cp\u003EThen I went to bring my little SSTO down from my space station. I came closer to KSC than usual on approach and cruised along the ground for about 20km and when I came in for landing I had a little accident on the runway. The pilot survived with minor injuries.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1022-53-11-18.jpg~original\u0022 alt=\u0022KSP2014-06-1022-53-11-18.jpg~original\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumrex","CreatedById":103753,"CreatedDateTime":"2014-06-11T03:16:57Z","Content":"\n\u003Cp\u003ERuined myself today just permanently ruined. Finally broke down and added a few mods mk2 capsule cockpit, infernal robotics, and spaceplane plus. My ICBM launcher / redneck rover is fully functional now and my all stock ssto space shuttle converted to having working bays. Ruined I say!!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jtdlFR9.jpg\u0022 alt=\u0022jtdlFR9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lNqHhoP.jpg\u0022 alt=\u0022lNqHhoP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tAAETER.png\u0022 alt=\u0022tAAETER.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w5gPAP5.jpg\u0022 alt=\u0022w5gPAP5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESSTO Shuttle before the converstion\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/46njlaa.jpg\u0022 alt=\u002246njlaa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter Conversion\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XgLsJcb.jpg\u0022 alt=\u0022XgLsJcb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YJc9vJw.jpg\u0022 alt=\u0022YJc9vJw.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T03:28:08Z\u0022 title=\u002206/11/2014 03:28  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by sumrex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dire_Squid","CreatedById":111106,"CreatedDateTime":"2014-06-11T04:17:28Z","Content":"\n\u003Cp\u003EWelp, tried to get one last satellite around Eve for a SCANsat scan (lo-res map and radar), and this time it was a success.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-06-11T04:37:27Z","Content":"\n\u003Cp\u003EIn accord with original mission specs with the real LADEE mission, I had my own LADEE at the Mun \u0026lt;launched the same day as the genuine article\u0026gt; and placed into a similar retrograde orbit around Mun. While my mission clock says my mission was 11 years in length \u0026lt;not in keeping with the real deal since I had other missions going and used time warp so game clocks skewed\u0026gt;, Real time, my LADEE mission went 1 month or so \u0026lt;i think\u0026gt; longer than the real mission. Here are some highlights from arrival at the Mun, to final experiment shut down and deorbit command issuance.\u003C/p\u003E\u003Cp\u003EFirst is arrival and orientation at the Mun.\u003C/p\u003E\u003Cp\u003ESecond is antenna extension as final Mission commands arrive.\u003C/p\u003E\u003Cp\u003EThird is shortly after all experiments are shut down and Engine activated for de orbit burn into the Mun.\u003C/p\u003E\u003Cp\u003EFourth is a second or so prior to impact, with antenna retracted and engine in shut down mode. \u0026lt;sorry its soo dark, wasnt intending to hit the dark side of the Mun\u0026gt;\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/E7sIF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T04:39:32Z\u0022 title=\u002206/11/2014 04:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-06-11T05:00:19Z","Content":"\n\u003Cp\u003EI bulldozed a hotdog stand.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-06-11T05:41:14Z","Content":"\n\u003Cp\u003Ebecause of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82717-I-Just-Bugged-the-Game-into-Five-Sided-Symmetry?highlight=fold\u0022 rel=\u0022external nofollow\u0022\u003ETHIS thread\u003C/a\u003E i went from just toying with the bug to something horrifying! What happens when you put this game into 8X Symmetry and add in 18 stacks of parachutes? Well, take a look. First pic is of the 5x symmetry that is yes, stable, but check the struts. anyway, now, check out the parachutes, and then the last picture, just under 3m/s decent rate!! (2.6m/s) YES that IS 144 parachutes! \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/gO9Zx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E...next step:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/75vA0ZC.png\u0022 alt=\u002275vA0ZC.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T06:44:12Z\u0022 title=\u002206/11/2014 06:44  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-06-11T06:44:34Z","Content":"\n\u003Cp\u003EToday I Laythe-tested my new Astroliner VIII Nova.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OtMyqdF.jpg\u0022 alt=\u0022OtMyqdF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI conducted a test flight with a 20t dummy payload, and can confirm it is suited for the job :^)\u003C/p\u003E\u003Cp\u003EBut still, delivering cargo to Laythe is risky business - so just to be sure it\u0027s capable, I did a transfer which had inclination burns both ways.\u003C/p\u003E\u003Cp\u003EI\u0027ll make a video sometime with a real payload, but if you\u0027re curious about the flight, it\u0027s pretty similar to the Astroliner VII Andromeda flight - it is somewhere in my youtube account.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-06-11T06:48:50Z","Content":"\n\u003Cp\u003EI installed Spaceplane Plus and after much frustration (mostly from my lack of plane building skills, not the mod) built an SSTO to deploy small probes and such; this is it\u0027s first successful orbital test flight. Took me a while to get it stable in the upper atmo and fine tune the TWR. Still not done and haven\u0027t tried to land it yet so we\u0027ll see how that goes, but I\u0027m impressed so far. This is my largest SSTO so far for what it\u0027s worth and has ~1350 DV with the NERVAs after getting into a 200km orbit. This could be very, very useful because if I refuel at my station, it will have around 5000 DV if I remember correctly. Also... I forgot to put the solar panels back on after modifying the design. D\u0027oh. I think it\u0027s stable enough now to remove at least two of the SAS modules weighing it down.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1102-37-59-99.jpg~original\u0022 alt=\u0022KSP2014-06-1102-37-59-99.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EI really like this mod. I wish it was easier to place certain things inside the cargo bay (docking ports and fuel tanks) but it just looks so good.\u003C/p\u003E\u003Cp\u003EJust going to edit this one... So I was sending up a docking hub for my space station and grossly underestimated how much fuel I needed, so I ran out before rendezvous. (pictured below)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1103-51-59-20.jpg~original\u0022 alt=\u0022KSP2014-06-1103-51-59-20.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo that was a perfect excuse to use my shiny new SSTO to bring it fuel. It took a little rebalancing to carry the heavier payload and I modified the design a bit anyway since last flight. Other than turning a little slow because of taking out three SAS modules from the cargo bay to fit the payload, it worked surprisingly well. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1104-53-20-02.jpg~original\u0022 alt=\u0022KSP2014-06-1104-53-20-02.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately I screwed up a bit and instead of a docking port I just had a decoupler so it slammed the tank around in the bay and gave it a good little spin, making it nearly impossible to dock with it in the other craft. I tried really hard but after bumping it a few times I got frustrated and just time warped for a second to put it on rails and docked as usual.\u003C/p\u003E\u003Cp\u003EThis thing was surprisingly stable after moving around a little fuel as needed for balance. I\u0027m pretty happy with it! Gearing up now to send it to LKO in a somewhat polar orbit to toss out a high-res Scansat and maybe go grab the old one, then same thing at the Mun and Minmus. Just needs a quick orbital refuel and it should be good to go pretty much anywhere in the immediate area including Duna and possibly Eve. Guess today wasn\u0027t so bad after all.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1105-46-20-08.jpg~original\u0022 alt=\u0022KSP2014-06-1105-46-20-08.jpg~original\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T10:26:57Z\u0022 title=\u002206/11/2014 10:26  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-06-11T07:26:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Overfloater\u0022 data-cite=\u0022Overfloater\u0022\u003E\u003Cdiv\u003EToday I Laythe-tested my new Astroliner VIII Nova.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OtMyqdF.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/OtMyqdF.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI conducted a test flight with a 20t dummy payload, and can confirm it is suited for the job :^)\u003C/p\u003E\u003Cp\u003EBut still, delivering cargo to Laythe is risky business - so just to be sure it\u0027s capable, I did a transfer which had inclination burns both ways.\u003C/p\u003E\u003Cp\u003EI\u0027ll make a video sometime with a real payload, but if you\u0027re curious about the flight, it\u0027s pretty similar to the Astroliner VII Andromeda flight - it is somewhere in my youtube account.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly hell dude that is impressive. Is that full stock?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-06-11T07:44:12Z","Content":"\n\u003Cp\u003EI think I am getting along with my Jool mission finally - the solution for landing on Tylo is not pretty and might rely on TAC Fuel Balancer to work (stacking some extra tanks on top of my expedition lander), but it is a solution ... I think.\u003C/p\u003E\u003Cp\u003ENow designing the actual ship to get there, and a Kethane miner (that has to weigh the same as the expedition lander to balance everything while docked) just strong enough to get up from Pol and Bop, but will have to be able to return to the ship inside the Jool system on its own, so it will carry a small converter. (Do I even need a big one back on the ship in this case? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E )\u003C/p\u003E\n"}]}