{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":206,"Articles":[{"CreatedByName":"brian_mcgee","CreatedById":75993,"CreatedDateTime":"2014-02-12T07:06:55Z","Content":"\n\u003Cp\u003EToday I rescued a guy who\u0027s been stranded on eve since july.\u003C/p\u003E\u003Cp\u003E\u0026lt;iframe class=\u0022imgur-album\u0022 width=\u0022100%\u0022 height=\u0022550\u0022 frameborder=\u00220\u0022 src=\u0022http://imgur.com/a/WlxCP/embed\u0022\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/p\u003E\u003Cp\u003E100% unpowered landing on eve, the only damage was two torn off parachutes and inline stabilisers, and most of the legs couldn\u0027t retract.\u003C/p\u003E\u003Cp\u003ERan out of fuel just barely before orbit, but bailing out with the jetpack was more than enough to make up the difference\u003C/p\u003E\u003Cp\u003EThe missing pieces made it very difficult to hold the ship on target during liftoff. I wonder if I would have made orbit If I\u0027d still had them to balance the center of gravity, or if I\u0027d have fallen even shorter due to the extra mass..\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-12T09:29:16Z","Content":"\n\u003Cp\u003EFinally, the Duna Expedition Ship is on its way - lets see how long that beautiful encounter at 100km over Duna\u0027s equator can be maintained - but it is only a mid-course-correction-maneuver-node-projection for now anyway.\u003C/p\u003E\u003Cp\u003EBurned for a while at a TWR of 0.357 - hope that will not pose to much difficulty to get into a Duna orbit. Without the heavy lander and half empty fuel tanks the return flight should be easier.\u003C/p\u003E\u003Cp\u003EOnly now realized that I never checked if a trip to Ike would be possible - the DES runs on Kethane powered nukes only and the lander has (hopefully ... !) enough L/OX to go to Duna and come back up into orbit.\u003C/p\u003E\u003Cp\u003ETo do:\u003C/p\u003E\u003Cp\u003EWill have to get a space station up and running as well as an surface-to-orbit crew transport for when the eight kerbonauts return, but that will take a while anyway.\u003C/p\u003E\u003Cp\u003EThe Kethane mining operations on Mun could do with a larger crew, so a bigger crew module and one or two rovers might be good to have up there.\u003C/p\u003E\u003Cp\u003EThe one-man mobile-Kethane-miner on Minmus should be brought back too.\u003C/p\u003E\u003Cp\u003ENext window up is Eeloo - maybe a quick probe launch ... ?\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-02-12T10:01:42Z","Content":"\n\u003Cp\u003EI tried to lift my ion throne to the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oOXqkYO.png\u0022 alt=\u0022oOXqkYO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not doing very well.\u003C/p\u003E\n"},{"CreatedByName":"coreross","CreatedById":60238,"CreatedDateTime":"2014-02-12T10:21:42Z","Content":"\n\u003Cp\u003EI increased the size of my Mobile base on Duna, I am so proud of her. Once I docked together she rolls along the surface to stable.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/_ggI9D7ds18?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EOnce there are more bioms on Duna I will be rolling in science.\u003C/p\u003E\n"},{"CreatedByName":"JenBurdoo","CreatedById":98099,"CreatedDateTime":"2014-02-12T10:24:04Z","Content":"\n\u003Cp\u003EOrbited Minmus for the first time ever, and picked up all the EVA biome science in one go! Landing was not so easy; I kept my engine burning until landing on Kerbin at about 5m/s, but when it tipped over the Science Jr. was destroyed, splitting the rest of the ship in half (capsule on one side, engine on the other, SciJr nowhere in between). I think Circle VII will try for a landing on Minmus. Now that I have the Skipper engine and Rockomax tanks I should be able to loft three SciJrs, fuel and engines into Minmus orbit.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-02-12T10:35:51Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DSynJkb.png\u0022 alt=\u0022DSynJkb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI am about half way through a heavily modded career. I need some extra science, so I thought, hey, you know, I hae been to mun and minmus loads. Lets try something new! So I built this 300mT monstrosity. On the outside, it looks very silly, and very \u0022LOL SOKERBAL XD\u0022. However, like everything I do, I tried to think it out as much as possible. Because I don\u0027t do the Permadeath or No-Reverts, I am fine with just launching and reverting as needs be until it works. The transfer stage actually has a hab, which will be used by the crew in transit and in LDO. The lander capsule has ebough fuel to land, and do part of the ascent on the descent stage, Incase it proves 1800m/s proves unable to return from duna\u0027s surface to the orbiting CM. The CM is a watered down version of my MPCV, and with all of the unnessecary extras the standard MPCV has, that can go to jool on it\u0027s own. This one should be able to make it to jool and back on it\u0027s own. So yes, inside that ridiculous, and gigantic fairing is a fully fleged, Apollo style mission to another world.\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-02-12T10:38:36Z","Content":"\n\u003Cp\u003EI improved the aesthetics of my ion throne a bit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IitXAra.png\u0022 alt=\u0022IitXAra.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI also made Jeb king of the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m8nzJSh.png\u0022 alt=\u0022m8nzJSh.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T15:29:57Z\u0022 title=\u002202/12/2014 03:29  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by Felsmak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-02-12T12:26:10Z","Content":"\n\u003Cp\u003EI made my first (flyable) spaceplane last night! A lot of Kerbals were sacrificed, bu it was worth it! I\u0027ve been playing KSP for about 3 or 4 months now, but getting the knack of spaceplanes has always been difficult for me. I went with a Dreamchaser style booster and mini shuttle combo, and I think I\u0027ll start using it for space station crew rotation. It\u0027s a lot of fun to be actively piloting a spacecraft from orbit to runway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-12T12:55:01Z","Content":"\n\u003Cp\u003EYesterday I built my most complex rocket yet. 147.5 tons in 176 parts and 12 stages, it carries three identical landers inside its payload fairing*. Each lander is a completely self-sufficient manned vehicle, fitted with 10 days fo life support** and enough delta-V to b able to land on either Mun or Minmus and return all five of its scientific experiments plus crew safe to Kerbin.\u003C/p\u003E\u003Cp\u003EThe number three was chosen because Minmus has 9 and the Mun has 15 biomes to visit; both numbers divisible by 3. Therefore this rocket is perfectly suited for doing science on them. By inserting into a polar orbit and decoupling landers one by one when passing over the desired biomes, all possible ground-based science can be achieved in just 3 or 5 launches, respectively.\u003C/p\u003E\u003Cp\u003E* KW Rocketry\u003C/p\u003E\u003Cp\u003E** TAC Life Support\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-02-12T13:00:48Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BWMrghK.png?1\u0022 alt=\u0022BWMrghK.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThough really, this more describes what my IRL day was like, rather than what I did in KSP.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEdit: Hey! What is this doing un stickied?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T13:25:09Z\u0022 title=\u002202/12/2014 01:25  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"iNUKE","CreatedById":102782,"CreatedDateTime":"2014-02-12T13:57:19Z","Content":"\n\u003Cp\u003ETried ONCE again to land in Duna AND come back to kerbin with science, to once again fail due to lack of fuel.\u003C/p\u003E\n"},{"CreatedByName":"BBcokeley","CreatedById":103306,"CreatedDateTime":"2014-02-12T14:05:01Z","Content":"\n\u003Cp\u003ENothing, stuck in work, not a lot to do, reading forum, reminiscing on times past and flights gone by, chuckling at first time landing attempts, and the look on Bill Kermans face as his rocket ell apart mid flight.....\u003C/p\u003E\u003Cp\u003EJeb is out there somewhere.....somewhere..\u003C/p\u003E\n"},{"CreatedByName":"Biker Joe","CreatedById":82495,"CreatedDateTime":"2014-02-12T15:57:13Z","Content":"\n\u003Cp\u003EI built a rover and was gonna send it to the mun, built a rocket (waaay too big and heavy) which failed miserably and could barely get off the launch platform, was quite funny!\u003C/p\u003E\n"},{"CreatedByName":"Concentric","CreatedById":103320,"CreatedDateTime":"2014-02-12T16:44:07Z","Content":"\n\u003Cp\u003EWasn\u0027t exactly today, but finishing yesterday, plus a little background.\u003C/p\u003E\u003Cp\u003EI\u0027m playing a completely stock Career, with very little play experience - didn\u0027t do any sandbox in 0.23, and only clocked about two hours play on the demo. Reverting and quicksaving are perfectly normal, but so far no transmission if any science at all is lost.\u003C/p\u003E\u003Cp\u003EOnce I got the thermometer, after a quick jaunt to grab Kerbin\u0027s thermoscience, I decided to make a Mun landing, taking with me three thermometers, and planning to do my first biome-hop. That all went well-ish, if a little inefficient. Then I burned to escape. In the \u003Cem\u003Ewrong direction\u003C/em\u003E (relative to Kerbin). So, almost no fuel, on a Kerbin escape trajectory, haven\u0027t quicksaved since launch. Good thing you\u0027ve got RCS, Jeb, I thought. 10 monoprop in capsule, 100 in tank and another 160 from those four Roundifieds, 270 total should be just fine, right?\u003C/p\u003E\u003Cp\u003EManaged to pull out of Kerbin escape, left myself a hair away, and transmitted my EVA reports and Crew reports. So, with so little fuel, I needed to get right up to my 82 million meter apoapsis so I could lower the 11 million meter periapsis for aerobraking. 35 km should do it without being too steep, leaving me with a little over 5/270 monopropellant. \u0027Just\u0027 fine was right. Given that that was now 6 days or so away, I decided to leave it be and not timewarp it in for a while - get some other things done, like my first three successful SSTOs (One even put up my first orbital probe - but only barely, and I needed to quickload after I... let the plane fall back, killing the kerbal within...) and getting the first docking port research node. Started a first space station, too - but I think I\u0027ll talk more about that when I complete it.\u003C/p\u003E\u003Cp\u003ESo, MunTherm\u0027s return. While up at the apoapsis, I realised that it was possible that my landing could be pretty hard, and there was a chance that my thermometers would be destroyed. Unacceptable! I had only recently learned of EVA data collection from a Youtube video, but it was worth a shot. Way up there, and for quite a bit around, thrusterpack EVA was utterly ridiculous. The frame of reference is continuously flipping and Jeb is wasting fuel trying to \u0027right\u0027 himself, only to \u0027realise\u0027 that he is now on his \u0027side\u0027 - I mean seriously, is this relative to Kerbin North, the lander\u0027s \u0027down\u0027, or gravity? KSP didn\u0027t seem to be able to decide. I noticed that I could reach two out of three from a ladder, but the other definitely required the thrusterpack, so I kept trying, quicksaving and quickloading as I lost control. Eventually, I gave up on getting the last reading this far out and (after getting the station into an okay-but-incomplete shape at 200km) warped in for an aerobrake pass. First pass was pretty normal - into atmosphere, stow solar panels, and out again a little slower. Got out and went for that last reading (much easier with an apoapsis below Mun orbit), and put my solar panels back out. So, all science in the pod, that\u0027s two surface samples and three thermo readings, meaning any return of even the slightest success means full value. Safe!\u003C/p\u003E\u003Cp\u003EThen, two more full passes - in, brake, out - before my final landing pass on this, my first multipass aerobrake. And then, disaster (almost) struck! Parachute deployed normally at 149m/s, full deployment at 500m altitude... and there\u0027s a sudden wrenching. Lack of struts was the culprit, along with using a single XL parachute to land the whole lander. If there had been radial chutes on the lander\u0027s fuel tank, or struts connecting to the capsule, most likely the rest of the craft would also have survived... Fortunately, that moment of forethought at apoapsis, that little doubt saying \u0022But what if the lander \u003Cem\u003Edoesn\u0027t\u003C/em\u003E survive?\u0022, and the watching of KSP Youtube videos saved the mission! Splashdown into the ocean, recovered - forgetting to take ocean samples, but that\u0027s fine - and that brings me up to the 300 science I need for Electronics, my first of the 300-tier technologies.\u003C/p\u003E\n"},{"CreatedByName":"Masked Turk","CreatedById":76284,"CreatedDateTime":"2014-02-12T16:55:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/BWMrghK.png?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/BWMrghK.png?1\u003C/a\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThough really, this more describes what my IRL day was like, rather than what I did in KSP.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEdit: Hey! What is this doing un stickied?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qDw5TUY.png\u0022 alt=\u0022qDw5TUY.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-02-12T17:21:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/BWMrghK.png?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/BWMrghK.png?1\u003C/a\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThough really, this more describes what my IRL day was like, rather than what I did in KSP.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEdit: Hey! What is this doing un stickied?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy rendition of your awesome image:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-vBOXSRrNxhk/UvutbzK7JOI/AAAAAAAAANw/u2039hwfqgY/w753-h635-no/BWMrghK.png\u0022 alt=\u0022BWMrghK.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-12T17:44:40Z","Content":"\n\u003Cp\u003EJust prototyped a seismic monitoring station for my current career (for KSP Interstellar impact experiments).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W6wdkK0.png\u0022 alt=\u0022W6wdkK0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts a KAS ground pylon, battery, OX-STAT, accelerometer, and a LLL microchip. Takes up 47 storage units in a KAS box. Now to deploy these all over the place...\u003C/p\u003E\u003Cp\u003EEdit: and I forgot to add, the battery won\u0027t charge unless you quicksave and reload.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T17:49:37Z\u0022 title=\u002202/12/2014 05:49  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by SpaceGremlin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-12T18:08:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wooks\u0022 data-cite=\u0022Wooks\u0022\u003E\u003Cdiv\u003EMy rendition of your awesome image:\u003Cp\u003E\u003Ca href=\u0022https://lh4.googleusercontent.com/-vBOXSRrNxhk/UvutbzK7JOI/AAAAAAAAANw/u2039hwfqgY/w753-h635-no/BWMrghK.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://lh4.googleusercontent.com/-vBOXSRrNxhk/UvutbzK7JOI/AAAAAAAAANw/u2039hwfqgY/w753-h635-no/BWMrghK.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI sense the genesis of a meme here...\u003C/p\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2014-02-12T18:09:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EIts a KAS ground pylon, battery, OX-STAT, accelerometer, and a LLL microchip. Takes up 47 storage units in a KAS box. Now to deploy these all over the place...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewait wait wait wait wait wait wait... you can put non-KAS stuff in a KAS storage box? How\u0027s that work?? =o\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-12T18:19:08Z","Content":"\n\u003Cp\u003EIn the VAB/SPH you right click on a KAS box to open its inventory editor. To make a part available there it needs to have some attributes added to it with Module Manager I think. KAS 0.4.5 does this to a number of stock parts by default, and LLL has a number of KAS enabled parts as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T18:23:15Z\u0022 title=\u002202/12/2014 06:23  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by SpaceGremlin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2014-02-12T18:33:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EIn the VAB/SPH you right click on a KAS box to open its inventory editor. To make a part available there it needs to have some attributes added to it with Module Manager I think. KAS 0.4.5 does this to a number of stock parts by default, and LLL has a number of KAS enabled parts as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn %KSP_FOLDER%/GameData/KAS/addModule.cfg:\u003C/p\u003E\u003Cp\u003EAdd in a simple block of code to the end of the file that references the part that you want to be grabbable:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E///////// RCSBlock ///////\u003Cbr\u003EGRAB\u003Cbr\u003E{\u003Cbr\u003E    stockPartName = RCSBlock\u003Cbr\u003E    evaPartPos = (0.0, 0.00, -0.18)\u003Cbr\u003E    evaPartDir = (0,0,-1)\u003Cbr\u003E    storable = true\u003Cbr\u003E    storedSize = 6\u003Cbr\u003E    attachOnPart = True\u003Cbr\u003E    attachOnEva = True\u003Cbr\u003E    attachOnStatic = False\u003Cbr\u003E    attachSendMsgOnly = False\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI did this with Aviation Lights by adding one of these for each kind of light available in the mod:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E///////// (this is a comment line) AviationLight-Green Navlight ///////\u003Cbr\u003EGRAB\u003Cbr\u003E{\u003Cbr\u003E    stockPartName = lightnav_green\u003Cbr\u003E    evaPartPos = (0.0, 0.09, -0.23)\u003Cbr\u003E    evaPartDir = (0,0,-1)\u003Cbr\u003E    physicJoint = true\u003Cbr\u003E    storable = true\u003Cbr\u003E    storedSize = 2\u003Cbr\u003E    attachOnPart = True\u003Cbr\u003E    attachOnEva = False\u003Cbr\u003E    attachOnStatic = False\u003Cbr\u003E    attachSendMsgOnly = False\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe orientation of the part when it\u0027s picked up is determined by the evaPartPos and evaPartDir directives. I\u0027m no good with KSP\u0027s coordinate system, but perhaps those who are better with it will know how to get things oriented so they look more realistic (assuming the defaults I posted don\u0027t do the trick well enough).\u003C/p\u003E\u003Cp\u003EAll that said, using the ModuleManager method would be better for those who want to maintain their mod customizations (such as those B9 currently requires for some minor bits) across updates, without having to re-edit the config files for each mod all over again.\u003C/p\u003E\u003Cp\u003EUnfortunately, I can\u0027t offer guidance with the MM method, as I don\u0027t have the relevant knowledge to work effectively with that either (yet?)\u003C/p\u003E\n"},{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-02-12T19:13:38Z","Content":"\n\u003Cp\u003EI noticed that my KSC Runway marker flag had somehow gotten knocked over. I don\u0027t know who did this, but it\u0027s pretty disrespectful.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/XysVOL4\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XysVOL4.png\u0022 alt=\u0022XysVOL4.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen I checked the Island Runway and found that the vandals had done their mischief there too! Not only that, but they\u0027d thrown it way down the runway! Found some incriminating evidence here though. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/IGN4xi5\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IGN4xi5.png\u0022 alt=\u0022IGN4xi5.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2014-02-12T19:26:59Z","Content":"\n\u003Cp\u003EI tried a dumb idea\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6x868lZ.png\u0022 alt=\u00226x868lZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(it didn\u0027t work)\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-02-12T19:50:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jfull\u0022 data-cite=\u0022jfull\u0022\u003E\u003Cdiv\u003EI tried a dumb idea\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/6x868lZ.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/6x868lZ.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(it didn\u0027t work)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry again, take moar pictures... and add moar boosters \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-02-12T20:08:48Z","Content":"\n\u003Cp\u003EWent to bed before posting about it but yesterday, I finished and did a shake-down run of a science supply chain to easily harvest the rest of the science from Mun. It consists of a low-orbiting Munar station; a reusable lander that can detach from the station, land, collect data, then bring itself back up, re-dock, transfer science (via Kerbal) to the station, refuel, and repeat; and the key element, a \u0022Science Shlepper\u0022 craft with a bunch of extra command pods allowing it to bring large amounts of data back to Kerbin for maximum credit.\u003C/p\u003E\u003Cp\u003EI\u0027m gonna find out if it\u0027s possible to clear the tech tree without leaving Kerbin\u0027s SOI (except maybe a little bit for \u0022high over the Sun\u0022 data).\u003C/p\u003E\n"}]}