{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":167,"Articles":[{"CreatedByName":"sickboy","CreatedById":32225,"CreatedDateTime":"2013-12-21T16:29:18Z","Content":"\n\u003Cp\u003Ewow over, I hadn\u0027t thought about removing the fuel to check the balance of COW and COL along with removing oxydizer from my tanks... now that i see that i realise i know approximately how much fuel i use that doesn\u0027t use oxydizer on my SSTO, so i should remove that amount and BAM, saved some weight!\u003C/p\u003E\n"},{"CreatedByName":"TheOrqwithVagrant","CreatedById":39208,"CreatedDateTime":"2013-12-21T16:30:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Ca href=\u0022http://i.imgur.com/CYf54vs.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/CYf54vs.png\u003C/a\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI went hunting for prey.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERocket Millipede! Amazing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2013-12-21T16:45:34Z","Content":"\n\u003Cp\u003EI started on a historical sandbox save.\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2013-12-21T17:22:16Z","Content":"\n\u003Cp\u003E@\u003Cstrong\u003EGeschosskopf\u003C/strong\u003E Thanks buddy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sickboy\u0022 data-cite=\u0022sickboy\u0022\u003E\u003Cdiv\u003Ewow over, I hadn\u0027t thought about removing the fuel to check the balance of COW and COL along with removing oxydizer from my tanks... now that i see that i realise i know approximately how much fuel i use that doesn\u0027t use oxydizer on my SSTO, so i should remove that amount and BAM, saved some weight!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh yes, those \u0022new\u0022 plane tanks rock the house!\u003C/p\u003E\u003Cp\u003EBy the way... that plane is now a SSTO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/osPyscY.png\u0022 alt=\u0022osPyscY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FD31Tj5.png\u0022 alt=\u0022FD31Tj5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rXcNx02.png\u0022 alt=\u0022rXcNx02.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KQVY7Bc.png\u0022 alt=\u0022KQVY7Bc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T3mUHBe.png\u0022 alt=\u0022T3mUHBe.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qKdZAT5.png\u0022 alt=\u0022qKdZAT5.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-12-21T20:16:19Z","Content":"\n\u003Cp\u003EBad night in KSP - the new Ranger Baker Two, Ranger Able and Storax Sedan missions all failed to make their respective target with sufficient delta-V to insert orbit and were each aborted in turn. A new mission has been launched for Eeloo and I\u0027m sending a Sandstone Xray probe to Bop; this time I\u0027m doing it the old-fashioned way (using maneuver nodes) as opposed to relying on Protractor for the transfer (I am still using Protractor for setting the position of the node for the ejection burn). So far things are going well with the new missions.\u003C/p\u003E\u003Cp\u003EStill in the process of sending a Constipation XIII-C probe to Moho; I think I\u0027ve figured out the transfer process now and I\u0027ve sent up a new Orthus Moho lander. We\u0027ll see if I can actually make it to Moho for less than 6,000 m/s of delta-V.\u003C/p\u003E\u003Cp\u003ERedid my mini probe design; actually worked with just two FL-T100s as it turned out...\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2013-12-22T00:19:58Z","Content":"\n\u003Cp\u003EI built a present for \u003Ca href=\u0022https://twitter.com/Danny_2462/status/414511263956226048\u0022 rel=\u0022external nofollow\u0022\u003EDanny2462\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/685969538511422736/B3D86B2C792F95227BEA25B824C5E23FD0259B58/\u0022 alt=\u0022B3D86B2C792F95227BEA25B824C5E23FD0259B58\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat could it be!? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(You can download it \u003Ca href=\u0022http://www.filedropper.com/presentfordanny\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E if you want)\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-22T03:04:50Z","Content":"\n\u003Cp\u003EWell after playing around with my space station a bit today I came to the conclusion that it needed a lot of fixing to making look a bit better. One of the major issues I had with it is the science lab has in IVA mode, yeah this sounds silly but I like to look inside. Also I had left out a bunch of other ideas I had found after looking around at other stations. So after the old station \u0022being shutdown\u0022 I made the Kerbin Interplantary Snack Station (Still calling K.I.S.S. for fun).\u003C/p\u003E\u003Cp\u003EHere is the redesigned K.I.S.S. now in orbit around Kerbin (Not sure yet if I want to keep that nuke engine attached now or not).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img841/7003/ciiv.png\u0022 alt=\u0022ciiv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I also worked on making a refueling pod and habitation module, but now I think I will do those as separate pieces instead of one long one. The ports on the refueling cell will hold the return pods for Kerbals that have been away on missions to come back home. Sorry the pictures are dark I needed a break and did not feel up for another orbit around Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img842.imageshack.us/img842/2271/gxmq.png\u0022 alt=\u0022gxmq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf I drop the nuke off of the bottom that would open up another port to make the base even larger later on if I wanted too. Also right now this thing is solar only, so I may need to make a habitation module with a generator on it for good measure, though there are 4 of the 400 battery blocks on the station and 2 more on the habitation module with its own solar panels as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T03:13:57Z\u0022 title=\u002212/22/2013 03:13  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-22T04:24:46Z","Content":"\n\u003Cp\u003EI flew this dorky-looking ship \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2UmXcBQ.png\u0022 alt=\u00222UmXcBQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eto Minmus, landed it in four places, \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XNCtJvK.png\u0022 alt=\u0022XNCtJvK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CmPOcse.png\u0022 alt=\u0022CmPOcse.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bB8GPLJ.png\u0022 alt=\u0022bB8GPLJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W4Q5sVq.png\u0022 alt=\u0022W4Q5sVq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand came back with 1389 science. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lSBdAHf.png\u0022 alt=\u0022lSBdAHf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(The recovery total doesn\u0027t include some transmissions.)\u003C/p\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2013-12-22T04:38:34Z","Content":"\n\u003Cp\u003EIt was a working day for me. Did some mods to my Jet and took atmosphere samples all around Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i40.photobucket.com/albums/e216/Max_Payne_0001/screenshot16.png\u0022 alt=\u0022screenshot16.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the side of the cockpit you can make out the Sensor Nose cone. I flew around different area\u0027s of Kerbin, took samples, and earned 200 points for 30 minutes of work. Not bad. Jeb earned his pay check. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sgt. Cookie","CreatedById":93080,"CreatedDateTime":"2013-12-22T04:42:15Z","Content":"\n\u003Cp\u003ETried to rendezvous with a space station. Failed miserably. I need MechJeb...\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-12-22T04:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maccollo\u0022 data-cite=\u0022maccollo\u0022\u003E\u003Cdiv\u003EWent to all the planets and moon and landed on them in less than 4 years, using one launch.\u003Cp\u003EAnd then I took the recorded footage and made it into a video.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/Q2V6a9-FUHM\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/Q2V6a9-FUHM\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Ca href=\u0022http://i.imgur.com/CYf54vs.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/CYf54vs.png\u003C/a\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI went hunting for prey.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EI figured out a way to get my bike over the mountains. I now use this to jump islands on Laythe.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/NsQOhyn.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/NsQOhyn.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Overfloater\u0022 data-cite=\u0022Overfloater\u0022\u003E\u003Cdiv\u003EToday for the 1st time I made a good aeroplane \u0026amp; for the 1st time I\u0027ve landed one! Thanks to the new update, we can now see how emptying fuel tanks shift weight centre, and any fuel tank can be used as a plane tank by emptying the oxidizer. One might think that, even if you empty the oxidizer from the rocket tank, it still might be too heavy, but no! not at all! The relative weight is about the same as the plane fuselages!\u003Cp\u003ESo here\u0027s my Freakishly AWESOME aeroplane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E :\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/h3EjMss.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/h3EjMss.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/lbU0r\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/lbU0r\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, maccollo, that video was amazing! Definitely video of the year for me. I had no idea that so much could be done with those little engines!\u003C/p\u003E\u003Cp\u003EWhackjob, that is whack, even for you! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELevelord, wonderful job blending aethetics with function. I love the seismic sensor cylinders!\u003C/p\u003E\u003Cp\u003EOverfloater, great job with that biplane. Looks great!\u003C/p\u003E\u003Cp\u003EAs for me, I did my 2nd ever Duna/Ike return with the SS Stephen Hawking and Penrose I lander. I sent the whole thing at once, and assembly was the hardest part of the mission. As you can see, subtlety is not my specialty:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/705109836941611072/4C1A21F30A25EE28376BC69E768ED1C186E7D86D/\u0022 alt=\u00224C1A21F30A25EE28376BC69E768ED1C186E7D86D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks to everyone who shares in this thread. I\u0027ve gotten tons of inspiration from seeing your creations, and have gotten more than a little jealous of your creativity and skills. Happy holidays! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2013-12-22T04:46:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sgt. Cookie\u0022 data-cite=\u0022Sgt. Cookie\u0022\u003E\u003Cdiv\u003ETried to rendezvous with a space station. Failed miserably. I need MechJeb...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not easy, but it can be done without MechJeb. Timing, practice, and patience. Small moves pay off big in space.\u003C/p\u003E\n"},{"CreatedByName":"insylem","CreatedById":97326,"CreatedDateTime":"2013-12-22T04:52:23Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EToday was a busy day in KSP. \u003C/p\u003E\u003Cp\u003EIn launched and docked the last two fuel tanks of my K7 space station. These last two tanks are equiped with sas and thrusters to help re-orient the station should it be nesicary.\u003C/p\u003E\u003Cp\u003EI created and launched the Orinoco and Rio Grande ships. These are intended to be used solely in space, but are equpied for emergancy return to Kerbal. The Rio Grande is large, powered by 2 of the Nuke engies. Plenty of fuel. The engines are on pylons on the sides. Allowing for a docking port in the back as well as the front of the ship. The Orinoco is smaller, less fuel, and has an engine in the back instead of the docking port. This gives it more power if needed though normally will use just the nukes on it\u0027s pylons. \u003C/p\u003E\u003Cp\u003ENewton V:\u003C/p\u003E\u003Cp\u003ELaunched fuel tank for space station into orbit\u003C/p\u003E\u003Cp\u003E1: Launched Rio Grande into orbit\u003C/p\u003E\u003Cp\u003E2: Launched fuel tank for space station into orbit\u003C/p\u003E\u003Cp\u003E3: Launched Orinoco Into orbit\u003C/p\u003E\u003Cp\u003E4: Launched fuel tank for space station into orbit\u003C/p\u003E\u003Cp\u003ERio Grande:\u003C/p\u003E\u003Cp\u003E1: Arrived at Space Station K7\u003C/p\u003E\u003Cp\u003E2: Descended and retrived Fuel tank and assembled to K7\u003C/p\u003E\u003Cp\u003EOrinoco:\u003C/p\u003E\u003Cp\u003E1: Launched, Currently in orbit awaint lineup for arrivale at K7\u003C/p\u003E\u003Cp\u003EGalileo VII:\u003C/p\u003E\u003Cp\u003E1: Launched\u003C/p\u003E\u003Cp\u003E2: Retrieved final fuel tank\u003C/p\u003E\u003Cp\u003E3: Placed onto K7:\u003C/p\u003E\u003Cp\u003E4: Returned to Kerbal\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2013-12-22T05:23:47Z","Content":"\n\u003Cp\u003ECompleted my first mission to Dres using my interplanetary shuttle with a lander in the cargo bay. I barely had enough fuel to make it back to Kerbin, but I got a decent chunk of science from it. I\u0027ll probably shoot for Jool or Moho next.\u003C/p\u003E\n"},{"CreatedByName":"Gods315Pawn","CreatedById":97772,"CreatedDateTime":"2013-12-22T05:41:30Z","Content":"\n\u003Cp\u003EI only have two week\u0027s worth ksp experience and I spent the morning failing to design a successful airplane before ending up with my first ever successful take off and landing (landed at the dirt strip). It still tends strongly upward though. I then spent a solid portion of the day failing new rocket designs. I was trying to build a design to get both Mun orbiter/shuttle AND Mun lander up into orbit at the same time. After hours of failure I finally decided to send them up seperately on my old reliable. Worked brilliantly. Extra fuel from lighter load was transferred over before being dumped and now I\u0027m ready to do my proof of concept run tomorrow. On Kerbal, trial and error is less of a process and more of a prayer.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-12-22T09:23:22Z","Content":"\n\u003Cp\u003ETwo somewhat botched missions to Minmus that I managed to rescue.\u003C/p\u003E\u003Cp\u003EMission 1. Where I learned the hard way that polar orbits can be a pain to plot return trajectories from. The best I could do with available fuel left me around 90m/s short of getting home. Fortunately the Explorer 3 was equipped with a launch escape system (four sepratrons stuck to the capsule) so I had my \u0027Gravity\u0027 moment of using the LES to get me home. Unfortunately it was a little too powerful, putting me on a collision course with Kerbin. So obviously the way to fix that was to plot a course correction, orient the capsule (with about 5 units of electricity left), then get out and push.\u003C/p\u003E\u003Cp\u003EMission 2. Where I learned that leaving the SAS on can really drain your batteries when landed on a slope. Launched a rescue mission, landed around 10km away and was very glad that my brave kerbonaut could lug all the experimental data over to the rescue craft (yay for new science model!). Landed safely on Kerbin and scooped just over 1k science for my troubles (yay Minmus biomes!)\u003C/p\u003E\n"},{"CreatedByName":"Krupski","CreatedById":80925,"CreatedDateTime":"2013-12-22T09:43:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003ESo, what did you do in KSP today? I\u0027m working on my project to touch down on every object in the system without mechjeb, so everything is done by hand. I launched a rocket (Project D-Man)to Duna yesterday and today I \u003Ca href=\u0022http://i.imgur.com/q69FMvH.jpg\u0022 rel=\u0022external nofollow\u0022\u003Elanded on Duna \u003C/a\u003E. After taking off, I realized that I could \u003Ca href=\u0022http://i.imgur.com/wiqra8R.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eland on Ike too\u003C/a\u003E. This way I don\u0027t have to visit the Duna-system again. However - it seems I did a \u003Cem\u003Eslight\u003C/em\u003E miscalculation and only reached Ike orbit....with a 30 km apoapsis. \u003Cp\u003ESo, I converted a space-tug I had in storage into a interplanetary towing service and left for Duna. Yeah, it has mechjeb, because I did all the landing allready and its better than just leaving my faithfull kerbals in Ike orbit (my project - my rules \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E ). So both ships met in Ike-orbit, where I accidently triggered the last stage seperator on D-Man just after docking. However after a few months of waiting for the right planetary alignment - the D-Man capsule is on \u003Ca href=\u0022http://i.imgur.com/PMNDAzj.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eits way home\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E And yes, I did not have to attend any lectures today - so there was plenty of time for KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, what about you?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat did I do in KSP today? I downloaded version 0.23 and (again) had to patch it so it would load PNG textures without crashing. Note this is only for 64 bit Linux version........ and the location of the bytes to patch has moved. Lots of fun trying to find them (but I did!)\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-22T09:45:20Z","Content":"\n\u003Cp\u003EI built a shiny new SSTO shuttle for my shiny new sandbox game, so I can play around with the shiny new RAPIER engines and the shiny new science equipment that I never really got to appreciate in 0.22. I\u0027ve been a busy bee lately. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mortaz","CreatedById":83326,"CreatedDateTime":"2013-12-22T09:53:48Z","Content":"\n\u003Cp\u003EToday, Jeb went on a walk around his capsule after successfully returning from an minmus fly-by, cause i thought i could get so more SCIENCE!!!. However, a mysterious force grabbed Jeb and he fell through the planet and Dying!!! (I\u0027m sorry that i let Jeb Die in such a simple way). Disgraced by this, i decided to take a break while waiting for a trans-munar burn. By some miracle when i went back to the astronaut complex and suprised. Jebediah was back!!! I was happy to see my best astronaut back...but how did he survive? who knows but i had fun. XD\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2013-12-22T11:35:00Z","Content":"\n\u003Cp\u003EIt appears my Kerbals have decided to research stealth rocketry...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/883002022199958365/D761ACD13107D2105ADD3C137E12508B7DB7F8B7/\u0022 alt=\u0022D761ACD13107D2105ADD3C137E12508B7DB7F8B7\u0022\u003E\u003C/p\u003E\u003Cp\u003E(either that or my laptop is so underpowered I have to turn the graphics settings way down and my fps while Kerbin is in the frame rarely get above 3...)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T14:04:06Z\u0022 title=\u002212/22/2013 02:04  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by Padishar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jmartin","CreatedById":97579,"CreatedDateTime":"2013-12-22T11:52:26Z","Content":"\n\u003Cp\u003EFinally built a successful space shuttle. Big and way over engineered. For Kerbin\u0027s sake it can go out the Mun and back with fuel to spare. \u003C/p\u003E\u003Cp\u003EAfter a successful flight test\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0pO57nt.jpg?2\u0022 alt=\u00220pO57nt.jpg?2\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZKHvPqi.jpg?2\u0022 alt=\u0022ZKHvPqi.jpg?2\u0022\u003E\u003C/p\u003E\u003Cp\u003EReentry returning from the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q9sYr0p.jpg?2\u0022 alt=\u0022Q9sYr0p.jpg?2\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the Launch system.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rdKBGxp.jpg?2\u0022 alt=\u0022rdKBGxp.jpg?2\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zippy","CreatedById":95968,"CreatedDateTime":"2013-12-22T12:53:37Z","Content":"\n\u003Cp\u003EHmm, approaching a big ball of bubblegum!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i41.photobucket.com/albums/e272/timbrad/screenshot12_zps877dcafc.png\u0022 alt=\u0022screenshot12_zps877dcafc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESlightly oversized lander this time, just experimenting with lifters \u0026amp; what they could load!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i41.photobucket.com/albums/e272/timbrad/screenshot13_zps323e0ec8.png\u0022 alt=\u0022screenshot13_zps323e0ec8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETouchdown! Minimus! Lets go check out the surfa.....oh, wait, yes, thats a solar panel blocking the hatch....! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i41.photobucket.com/albums/e272/timbrad/screenshot14_zpsd4e82b52.png\u0022 alt=\u0022screenshot14_zpsd4e82b52.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-12-22T13:32:11Z","Content":"\n\u003Cp\u003EWelp. Finally made a flying jet bike with a design that I liked.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5FCGlyh.jpg\u0022 alt=\u00225FCGlyh.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-12-22T14:22:03Z","Content":"\n\u003Cp\u003EBrought a \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63036-Larry-Kerman-Kerbaboy%21\u0022 rel=\u0022external nofollow\u0022\u003ESuperhero\u003C/a\u003E\u0022 to life...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/WJVFCEi\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WJVFCEi.png\u0022 alt=\u0022WJVFCEi.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T14:43:44Z\u0022 title=\u002212/22/2013 02:43  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-12-22T15:25:33Z","Content":"\n\u003Cp\u003EThanks to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61478-Oh-bugger-Injection-burn-at-Moho?p=835667\u0026amp;viewfull=1#post835667\u0022 rel=\u0022external nofollow\u0022\u003Ehelp from maccollo\u003C/a\u003E, I finally put a satellite in orbit of Moho. I left Kerbin on the wrong date and screwed up the plane change so it turned out taking ~8,000 m/s of delta-V all told; anticipating a screw-up, I went with a Constipation XIII-C probe (14,000 m/s of delta-V available to it)...\u003C/p\u003E\u003Cp\u003EEve and Bop are the only two worlds I haven\u0027t put sats around at this point (Eve for lack of trying; I\u0027ve got one around Gilly). Rover delivery is still giving me headaches.\u003C/p\u003E\n"}]}