{"TopicId":27452,"ForumId":44,"TopicTitle":"Earth orbit rendezvous: The moon, the easy way!","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-05-18T20:16:02Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-05-18T20:16:02Z","Content":"\n\u003Cp\u003EThe reason why the Apollo program was so \u0022expensive\u0022 was because it needed its own launch vehicle to get that much equipment (the CSM, the LM and the S-IVB booster stage) into LEO, the previous projects only needing converted missiles. Saturn V had a LEO payload of 120,000 kg. The international space station is a mass of 450,000 kg, with it being completed in only a little more than a decade. I love the ISS, but if something of that mass can be built in LEO, then surely a \u0027moon tug\u0027 with a manned lander can be built within 40 YEARS, even if you have to use standard rockets ( Atlas 5, Ariane 5, Proton etc).\u003C/p\u003E\n"},{"CreatedByName":"WCOLE360","CreatedById":57227,"CreatedDateTime":"2013-05-18T20:22:50Z","Content":"\n\u003Cp\u003EConsidered how much it\u0027d cost too? I know the ISS costed \u003Cstrong\u003EA LOT\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFrom the international space station program funding section:\u003C/p\u003E\u003Cp\u003E2005 ISS budget allocation\u003C/p\u003E\u003Cp\u003ENASA allocates about 125 million US dollars (USD) annually to EVAs.\u003C/p\u003E\u003Cp\u003EThe $1.8 billion expensed in 2005 consisted of:[47]\u003C/p\u003E\u003Cp\u003EDevelopment of new hardware: $70 million were allocated to core development, for instance development of systems like navigation, data support or environmental.\u003C/p\u003E\u003Cp\u003ESpacecraft Operations: $800 million consisting of $125 million for each of software, extravehicular activity systems, and logistics and maintenance. An additional $150 million is spent on flight, avionics and crew systems. The rest of $250 million goes to overall ISS management.\u003C/p\u003E\u003Cp\u003ELaunch and Mission operations: Although the Shuttle launch costs are not considered part of the ISS budget, mission and mission integration ($300 million), medical support ($25 million) and Shuttle launch site processing ($125 million) is within the ISS budget.\u003C/p\u003E\u003Cp\u003EOperations Program Integration: $350 million was spent on maintaining and sustaining U.S. flight and ground hardware and software to ensure integrity of the ISS design and the continuous, safe operability.\u003C/p\u003E\u003Cp\u003EISS cargo/crew: $140 million was spent for purchase of supplies, cargo and crew capability for Progress and Soyuz flights.\u003C/p\u003E\u003Cp\u003E[end copied material, \u003Ca href=\u0022https://en.wikipedia.org/wiki/International_Space_Station_program#2005_ISS_budget_allocation%5D\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/International_Space_Station_program#2005_ISS_budget_allocation]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s just LEO. What about the cost to get to the moon. Consider this, NASA\u0027s next interplanetary/non leo project is based off of ISS-Derived parts.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Deep_Space_Habitat\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Deep_Space_Habitat\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-05-19T00:23:54Z","Content":"\n\u003Cp\u003EMuch of the development costs would be downsized, as much of the craft would be fuel and tanks, parts which could be standardized. Also, money may be less of a problem, as now the moon mission can be done as an international project, spreading the cost, and the public is more likely to want it funded, since a moon base is considered \u0022more prestigious\u0022 than a LEO lab.\u003C/p\u003E\n"},{"CreatedByName":"WCOLE360","CreatedById":57227,"CreatedDateTime":"2013-05-19T03:51:06Z","Content":"\n\u003Cp\u003ERussia (our main space fairing partner) will be making OPESK and more focused on interplanetery. It\u0027s not as simple as asking other countries to help.\u003C/p\u003E\n"}]}