{"TopicId":27690,"ForumId":16,"TopicTitle":"How do I use asparagus staging with 6 fold symmetry?","CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2013-05-20T06:22:07Z","PageNum":1,"Articles":[{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2013-05-20T06:22:07Z","Content":"\n\u003Cp\u003ELet\u0027s say my main stage for my rocket is symetrically surrounded by 6 identical cores. How do I set up asparagus staging to that each stage drops 2 of these cores? Every time I try to set my rockets up like that they loose their balance and crash. So far I have only been able to drop 4 of the cores for my first stage then 2 cores for the next. Im not sure how much more effective it would be to drop 2 cores at time, but I want to maximize efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Actzoltan","CreatedById":58787,"CreatedDateTime":"2013-05-20T06:29:20Z","Content":"\n\u003Cp\u003EThis is a quick and easy way to do what you want.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/en4n8fsKWXA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2013-05-20T07:18:38Z","Content":"\n\u003Cp\u003ESorry I should have been more clear. I understand how to set up the fuel lines and the stages. What I\u0027m having problems with are balance issues. The kinda of lifts that I would use a 6 fold radial symmetry with an asparagus system are inherently uneven. (Think Station modules) Usually I can drop one pair of boosters without having issues. The problem is, once I drop the second pair, my rocket becomes unbalanced and tips over and falls back to Kerbal. The only method that I have been able to get to work is to first drop 4 boosters, then to drop the other 2 in my next stage.\u003C/p\u003E\n"},{"CreatedByName":"Actzoltan","CreatedById":58787,"CreatedDateTime":"2013-05-20T08:03:56Z","Content":"\n\u003Cp\u003EWould it be possible to see a screen shot in the VAB with your mass, lift and thrust enabled?\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-05-20T09:45:10Z","Content":"\n\u003Cp\u003EI did have a similar problem.\u003C/p\u003E\u003Cp\u003EI am not sure that was the actual solution, but after I turned the gimble on the outer engines off, it was gone, the rocket staying stable. Except a little rotation.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-20T12:42:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EThe kinda of lifts that I would use a 6 fold radial symmetry with an asparagus system are inherently uneven.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not \u003Cem\u003Einherently \u003C/em\u003Euneven. Configure them exactly they way you do with four-way symmetry, just adding a third pair of tanks/engines.\u003C/p\u003E\u003Cp\u003EPlease post a good picture of the rocket. That should make it easy to figure out the problem.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-20T14:07:01Z","Content":"\n\u003Cp\u003EThere is nothing inherently unstable about 6 fold symmetry. But if you are having stability problems after dropping 4 of the 6 outer boosters that could mean that your last pair of boosters needs to be better stabilized. \u003C/p\u003E\u003Cp\u003EDo you put struts between the boosters, or do you put struts between the boosters and the central stage, or do you do both? I\u0027ve had problems before with the last pair of boosters becoming unstable because all of the outer boosters stabilized each other, so the last pair had very little to hold it in place and needed much more strutting than the other boosters. \u003C/p\u003E\u003Cp\u003EOr is your rocket actually becoming unbalanced? Is the fuel load somehow different on one side than the other? That would be a different problem, and most likely an issue of fuel flow, as there is no reason that fuel should become unbalanced on 6 or 8 fold symmetry.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-05-20T15:07:18Z","Content":"\n\u003Cp\u003EI use 6 fold symmetry for the vast majority of my builds without ever having symmetry problems. If your payload is asymmetrical, it\u0027s going to cause problems whether you\u0027ve got a 6 fold set of boosters or an 8 fold set. \u003C/p\u003E\u003Cp\u003EIt could also be that your setup includes an accidental fuel loop (probably via a fuel crossfeed part) and that one side of the rocket is draining fuel faster than the other.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-05-20T16:07:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jason Patterson\u0022 data-cite=\u0022Jason Patterson\u0022\u003E\u003Cdiv\u003EIt could also be that your setup includes an accidental fuel loop (probably via a fuel crossfeed part) and that one side of the rocket is draining fuel faster than the other.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve also accidentally screwed up symmetry by forgetting to make sure the proper figure was selected (I.E. leaving it in one-fold), and while the rocket is powerful enough to initially overcome the asymmetry... but eventually it tumbles.\u003C/p\u003E\u003Cp\u003EAnother thing to watch for is a departing spent stage taking out a running engine, have you checked your flight log?\u003C/p\u003E\n"},{"CreatedByName":"sdub","CreatedById":68949,"CreatedDateTime":"2013-06-02T04:09:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DerekL1963\u0022 data-cite=\u0022DerekL1963\u0022\u003E\u003Cdiv\u003EI\u0027ve also accidentally screwed up symmetry by forgetting to make sure the proper figure was selected (I.E. leaving it in one-fold), and while the rocket is powerful enough to initially overcome the asymmetry... but eventually it tumbles.\u003Cp\u003EAnother thing to watch for is a departing spent stage taking out a running engine, have you checked your flight log?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can get all the tanks set up and the staging, but as soon as I try to add my fuel lines, they automatically go to 6 x symmetry. As soon as I move the cursor over my tanks, it automatically changes. I have tried to hot key X to change the symmetry, but it doesn\u0027t do anything. What am I doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-06-02T06:05:35Z","Content":"\n\u003Cp\u003EIf a part was placed with 6x symmetry, you have only two options for fuel lines, struts, or other parts you want to add to it: either 6x symmetry like the original part, or no symmetry (1x).\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-06-02T06:13:19Z","Content":"\n\u003Cp\u003ELink em up like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/e/e7/Asparagus-staging.svg/100px-Asparagus-staging.svg.png\u0022 alt=\u0022100px-Asparagus-staging.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith stage 4 jettisoning first, then 3 and so on.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Asparagus_Staging\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:Asparagus_Staging\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stazi","CreatedById":68773,"CreatedDateTime":"2013-06-02T06:28:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdub\u0022 data-cite=\u0022sdub\u0022\u003E\u003Cdiv\u003EI can get all the tanks set up and the staging, but as soon as I try to add my fuel lines, they automatically go to 6 x symmetry. As soon as I move the cursor over my tanks, it automatically changes. I have tried to hot key X to change the symmetry, but it doesn\u0027t do anything. What am I doing wrong?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn easy way to set it up for six-way symmetry asparagus staging is setting the symmetry to two and creating a full stage with it. Then just Alt\u002Bleft click the decoupler and place the rest of the stages using two-fold symmetry, setting up fuel lines and struts afterward. This has the added benefit of keeping the decouplers in groups of two for simpler staging, since you\u0027ll likely be dropping two tanks at a time.\u003C/p\u003E\n"},{"CreatedByName":"zanzibar196","CreatedById":67228,"CreatedDateTime":"2013-06-02T07:35:23Z","Content":"\n\u003Cp\u003EI actually use 3 way symmetry with my very large rocket tanks, asparagus style... here\u0027s a video how to build it:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/Z7NQpWXA2SA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnd here is a video showing it launching and getting up to sub-orbit:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/4J8hGzxBlHs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"}]}