{"TopicId":27719,"ForumId":16,"TopicTitle":"What to do once returned to kerbin?","CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2013-05-20T13:21:20Z","PageNum":1,"Articles":[{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2013-05-20T13:21:20Z","Content":"\n\u003Cp\u003ESo, My first Minmus landing was a success, (by success, 2 kerbals got on the surface, a little dizzy and bruised, but they made it) they are now in a low orbit around Kerbin, i will aim to land close as poss to the space centre, but what do i do then? just \u0027end flight\u0027? Should i set up a kerbin living module near the space centre? should i experiment with the ragdoll effect? (its only Bob and Jonke)\u003C/p\u003E\u003Cp\u003EWhat do you do with your returned Kerbals?\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2013-05-20T13:29:48Z","Content":"\n\u003Cp\u003EWell, the best answer is, of course whatever you want \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI personally just land them and end flight; they can get a taxi back to the space center, and if they landed on some distant continent, then they get a free holiday, so it\u0027s all good.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-05-20T13:34:27Z","Content":"\n\u003Cp\u003EI keep a rover parked nearby for a victory lap.\u003C/p\u003E\u003Cp\u003ENo, that\u0027s not true...usually I just hit \u0022end flight\u0022.\u003C/p\u003E\u003Cp\u003E(But that would be cool).\u003C/p\u003E\n"},{"CreatedByName":"icemasterpt","CreatedById":61626,"CreatedDateTime":"2013-05-20T13:59:27Z","Content":"\n\u003Cp\u003ETRy to land them the near as possible the Launch centre, then end flight... i imagine that a REscue team will be there when i press \u0022end flight\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2013-05-20T14:08:49Z","Content":"\n\u003Cp\u003EReally?\u003C/p\u003E\u003Cp\u003EIt seems a little un-imaginative, I feel like setting up a stack of hitchiker modules, the Kerbal thats performed better on his mission lives nearer the top, this would also supply me a few spare kerbals if i ever need to send some extra on a mission. - I wonder how long a kerbal could hold on to a ladder during launch???......\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-05-20T14:08:56Z","Content":"\n\u003Cp\u003Eactually, it would be nice if a short in-game cinimatic showed a vechicle coming to pick them up (if on land) or a boat (if in water)\u003C/p\u003E\n"},{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2013-05-20T14:38:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rosenkranz\u0022 data-cite=\u0022rosenkranz\u0022\u003E\u003Cdiv\u003Eactually, it would be nice if a short in-game cinimatic showed a vechicle coming to pick them up (if on land) or a boat (if in water)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree, it would be nice to see this once or twice, but then it would become tedious and would just skip it.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-05-20T14:44:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Callmedave\u0022 data-cite=\u0022Callmedave\u0022\u003E\u003Cdiv\u003EReally?\u003Cp\u003EIt seems a little un-imaginative, I feel like setting up a stack of hitchiker modules, the Kerbal thats performed better on his mission lives nearer the top, this would also supply me a few spare kerbals if i ever need to send some extra on a mission. - I wonder how long a kerbal could hold on to a ladder during launch???......\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know, I never thought of doing that before, but that is a brilliant idea!\u003C/p\u003E\u003Cp\u003EThe only problem I have is my Kerbals never come back... they are all in orbits around other planets.\u003C/p\u003E\n"},{"CreatedByName":"kerbomatic","CreatedById":62928,"CreatedDateTime":"2013-05-20T14:45:53Z","Content":"\n\u003Cp\u003EIn career mode I\u0027d just expect to be required to land within X km of KSP and if that fails a \u0027rescue\u0027 mission would have to be mounted. A cinematic would be a cool bonus but yes, it should be skip-able...\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-05-20T14:57:51Z","Content":"\n\u003Cp\u003EAnd w like for example if the Kerbal has returned after being the first to land on a planet/moon after you hit end flight you could be like watching from a news helicopter or something and there should be a Kerbal voice like a reporter saying\u003C/p\u003E\u003Cp\u003E\u0022(Kerbals name), first man to land on (name of planet/moon), has safely returned to Kerbin\u0022\u003C/p\u003E\u003Cp\u003EEx: \u0022Jebediah Kerman, first man to land on the mÃƒÂ¼n, has safely safely returned to Kerbin\u0022\u003C/p\u003E\u003Cp\u003ESomething like that or similar would be nice, and make you feel like you\u0027ve really accomplished something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-05-20T15:03:29Z","Content":"\n\u003Cp\u003EI leave all missions other than test flights active. It lets me see where I tend to land and also it\u0027s just kind of fun to see all of the vessel markers flying by as I launch. I really don\u0027t like to return my kerbals to the base.\u003C/p\u003E\u003Cp\u003EPerhaps with the addition of flags we\u0027ll be able to post something visible from a distance that says, \u0022Jason was here!\u0022 but until then I\u0027m going to retain my little pink reticles.\u003C/p\u003E\n"},{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2013-05-21T10:19:42Z","Content":"\n\u003Cp\u003ESo, got Bob and Jonke to land 3km from the KSC, so built a small rover with a hitchiker to collect them, drove all the way there EVA\u0027d them both got in the new rover, headed back, all going well......\u003C/p\u003E\u003Cp\u003EHit a bump in the grass, rover smashes, blows up (?? no fuel! all electric!) and i say farewell to two brave Kerbals unable to complete their mission.\u003C/p\u003E\u003Cp\u003EI mean really!?! I get them in to orbit, land on the mun, back to kerbin, but i cant get them the last Km to the space centre! B*#\u0026amp;cks!\u003C/p\u003E\n"}]}