{"TopicId":27726,"ForumId":18,"TopicTitle":"Star Trek in KSP [spoilers allowed]","CreatedByName":"kerbomatic","CreatedById":62928,"CreatedDateTime":"2013-05-20T14:55:01Z","PageNum":1,"Articles":[{"CreatedByName":"kerbomatic","CreatedById":62928,"CreatedDateTime":"2013-05-20T14:55:01Z","Content":"\n\u003Cp\u003EIf Star Trek was set in the Kerbal System...?\u003C/p\u003E\u003Cp\u003EI promise this thread will be a bit different from the other threads. Also spoilers explicitly allowed.\u003C/p\u003E\u003Cp\u003EYou may conveniently ignore that there is only one Kerbal System and no warp drive.\u003C/p\u003E\u003Cp\u003EI\u0027ll start us off:\u003C/p\u003E\u003Cp\u003E- If Star Trek was set in the Kerbal System, I would wonder how those warp nacelles manage to balance center of mass vs. center of thrust (curses, you KSP!)\u003C/p\u003E\u003Cp\u003E- ... I\u0027d wonder how they get from the MÃƒÂ¼n SOI into the Kerbin SOI so fast - Sulu must be really good with those maneuver nodes.\u003C/p\u003E\u003Cp\u003E- ... criticize the builders about how inefficiently they placed their RCS thrusters and expect to see more struts between the saucer section and the rest of the ship.\u003C/p\u003E\u003Cp\u003E- ... Jeb would be playing Kirk (obviously)\u003C/p\u003E\u003Cp\u003ESurely you guys can do better than this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EFull disclosure: long-time Star Trek fan.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-05-20T15:17:05Z","Content":"\n\u003Cp\u003EThe warp nacelles are just used the create the warp field. The impulse engines are the only \u0022real\u0022 engines, and they\u0027re right behind the Saucer, Which is probably pretty close to the COM.\u003C/p\u003E\u003Cp\u003EThe guy that made the Starship enterprise parts for KSP put the engine in the same place it\u0027s in here, and it works great in space. In the atmosphere, not so much.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://1.bp.blogspot.com/-jUGWapuory0/UHL8Bf2iOAI/AAAAAAAAKEE/R-5s3cd64nE/s1600/star-trek-impulse-engine.jpg\u0022 alt=\u0022star-trek-impulse-engine.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kerbomatic","CreatedById":62928,"CreatedDateTime":"2013-05-20T15:25:56Z","Content":"\n\u003Cp\u003EShould have known someone actually made the Enterprise in KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I had been thinking about how close one would get using stock parts.\u003C/p\u003E\u003Cp\u003EAnd indeed, the warp field does not work like linear thrust. Historically, warp nacelles have been seen practically anywhere relative to the saucer section short of ahead of the saucer. There\u0027s no reason why they couldn\u0027t be though.\u003C/p\u003E\n"}]}