{"TopicId":27883,"ForumId":16,"TopicTitle":"Most fuel friendly transfer to Moho","CreatedByName":"RatBeer","CreatedById":63063,"CreatedDateTime":"2013-05-21T04:21:29Z","PageNum":1,"Articles":[{"CreatedByName":"RatBeer","CreatedById":63063,"CreatedDateTime":"2013-05-21T04:21:29Z","Content":"\n\u003Cp\u003EThe title pretty much explains it but im planning to go to moho and i know it requires a fair amount of delta V to get into orbit around it. So what would be the best way to approach this say from LKO. I dont mind if the moho orbit ends up being a polar orbit just as long as its an orbit. cheers:)\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-21T04:31:17Z","Content":"\n\u003Cp\u003EThe most efficient method is a gravity assist using Eve, but it takes a lot of work and timing to set up.\u003C/p\u003E\n"},{"CreatedByName":"AkalaÃƒÂ«l","CreatedById":58210,"CreatedDateTime":"2013-05-21T09:35:31Z","Content":"\n\u003Cp\u003EYou want to arrive at Moho\u0027s SOI when the planet is at is periapsis. By doing so you\u0027ll need 2500m/s to circularise your orbit.\u003C/p\u003E\u003Cp\u003EIf you arrive at it\u0027s apoapsis, you\u0027ll need a mere 5000m/s.\u003C/p\u003E\u003Cp\u003EEDIT : or the opposite, i\u0027m confused, someone clever than me confirm -or infirm- please !\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-05-21T10:04:48Z","Content":"\n\u003Cp\u003EArriving at Pe is the most efficient. By the normal delta-v calculations it makes a difference of about 700m/s for the whole one-way journey. Be warned though that the eccentricity of Moho means that it isn\u0027t where the phase angle calculators expect it to be and with the inclination you might end up spending an extra 1000 or so getting your capture orbit.\u003C/p\u003E\u003Cp\u003EDon\u0027t do what I did and only allow 15% more fuel then the theoretical value and end up with two Kerbals stranded in Moho orbit unable to get home. There rescue mission is scheduled to depart in 8 days.\u003C/p\u003E\n"},{"CreatedByName":"RatBeer","CreatedById":63063,"CreatedDateTime":"2013-05-21T10:34:31Z","Content":"\n\u003Cp\u003Eoh all right thanks. I had always thought arriving at Ap was more efficient because you didnt have to burn as much to get your Pe down to moho\u0027s orbit.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-05-21T10:52:52Z","Content":"\n\u003Cp\u003EYour initial burn at kerbin is more but if you arrive at AP the difference in your speed and Moho\u0027s speed is larger than if you arrive at PE\u003C/p\u003E\n"}]}