{"TopicId":28290,"ForumId":32,"TopicTitle":"Nooooooooo","CreatedByName":"Exal","CreatedById":57986,"CreatedDateTime":"2013-05-23T02:19:43Z","PageNum":1,"Articles":[{"CreatedByName":"Exal","CreatedById":57986,"CreatedDateTime":"2013-05-23T02:19:43Z","Content":"\n\u003Cp\u003EWell I lost all of my save files after I had finally gotten to Jill and lathe. And all of my parts in my parts folder was deleted during the update so I had to completely remove the game and then reinstall trying to reinstall now, hopefully it works. All well though stuff happens I guess\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-05-23T02:20:44Z","Content":"\n\u003Cp\u003EBackups!\u003C/p\u003E\u003Cp\u003EJust imagine that your kerbal race got wiped out on Kerbin and had to start over.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-23T06:08:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SalmonellaDingDong\u0022 data-cite=\u0022SalmonellaDingDong\u0022\u003E\u003Cdiv\u003EBackups!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly we had 2 groups of people here - this ones who made back-up copies and people who didn\u0027t lost data yet (And this apply not only for KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"joppiesaus","CreatedById":57698,"CreatedDateTime":"2013-05-23T08:11:05Z","Content":"\n\u003Cp\u003EI don\u0027t make backups, because I don\u0027t care if my space station gets wiped out, I can always build a new one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-23T08:19:49Z","Content":"\n\u003Cp\u003EI have backups going back to when I first started... multiple versions too. INCLUDING the the whole KSP directory which includes what mods I used lol. Kind of anal retentive that way. Oh and the backups are on a mirrored server box too.\u003C/p\u003E\u003Cp\u003EIt\u0027s one reason why I didn\u0027t accept the Steam upgrade. I like to have control over the upgrade process. Especially as this is an alpha.\u003C/p\u003E\u003Cp\u003EOh yeah... and I currently am running three whole versions at the moment. One is 19.1 with all my mods, another is stock 19.1 plus my own mod for linking with hardware (as it was under test) and stock 20.0. I will probably make another one later this week for stock 20.0 plus my hardware interface as it will obviously need some work done on it to continue working.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-23T08:22:30Z\u0022 title=\u002205/23/2013 08:22  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 23, 2013\u003C/time\u003E by NeoMorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"internetlad","CreatedById":67165,"CreatedDateTime":"2013-05-23T08:36:49Z","Content":"\n\u003Cp\u003Eone of the reasons I didn\u0027t opt for the steam key. I can keep old versions/save files by simply extracting the game to a different folder.\u003C/p\u003E\u003Cp\u003ESorry for your loss, but in what is essentially an open beta like this, it\u0027s a necessary evil.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2013-05-23T09:24:40Z","Content":"\n\u003Cp\u003EI usually just start over fresh with the main updates, but I do have to remind myself to check my screenshots folder before that gets deleted.\u003C/p\u003E\u003Cp\u003EEither case, if you do like to try carrying over missions, then I do recommend backing up your current KSP folder, and then do a fresh install of the new update. You can then try out the new update as it comes, and then copying over your mission saves to see if they are broken or not. Keeping an archive of previous versions for Your Own Personal Use is also a good strategy, as well.\u003C/p\u003E\n"},{"CreatedByName":"Exal","CreatedById":57986,"CreatedDateTime":"2013-05-23T15:01:18Z","Content":"\n\u003Cp\u003EYa all well though. At least it gives me a reason to go to planets again. And It mad me stick with the vanilla version.\u003C/p\u003E\n"}]}