{"TopicId":28342,"ForumId":16,"TopicTitle":"Line of sight/radio range question and story","CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-05-23T05:54:50Z","PageNum":1,"Articles":[{"CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-05-23T05:54:50Z","Content":"\n\u003Cp\u003EHello all!\u003C/p\u003E\u003Cp\u003EI learned something new during today\u0027s recovery mission which I have not read anywhere before.\u003C/p\u003E\u003Cp\u003EA poorly planned re-entry left a grounded Kerbal (Keldrin Kerman) out in the middle of a vast continent on the other side of the planet. Before embarking on the recovery mission, Oroly Kerman checked the Tracking Center for landmarks. Version 0.20 of the tracking software provides a cute, little icon for lone Kerbals. There was Keldrin; near a set of lakes. Aboard the Javelin 2 -- a leapfrogging spaceplane -- Oroly had no visual of a grounded Kerbal (Keldrin) on the horizon, nor via the tactical map view. It wasn\u0027t until Oroly was within 50km to 52km, just overhead, that he could see Keldrin\u0027s \u0022bracket\u0022 icon and set as target. Once landed, Keldrin became visible from other orbiting vessels.\u003C/p\u003E\u003Cp\u003EI can only assume that EVA suits have a short comms range which can be relayed by command pods? Or perhaps there is a line of sight limitation from the plane? Is there any documentation about this sort of thing? I\u0027m familiar with a plugin called RemoteTech which implements these sorts of ranges, but I\u0027m not using any plugins at all.\u003C/p\u003E\u003Cp\u003ETL;DR I see grounded Kerbals from tracking center, however not when in my plane until within 52Km. Any docs regarding comms ranges on parts, EVA suits, and antennae?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-23T05:57:49Z\u0022 title=\u002205/23/2013 05:57  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 23, 2013\u003C/time\u003E by velusip\u003C/strong\u003E\n\u003Cbr\u003Egrammars\n\u003C/span\u003E\n"},{"CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-05-28T05:19:22Z","Content":"\n\u003Cp\u003EI suppose I\u0027ll bump once and then let it die.\u003C/p\u003E\u003Cp\u003EOne more bit of info. I left a stranded kerbal inside of the pod and conducted a similar mission, this time I couldn\u0027t see the pod until I was around 100km away, up from 50km when it was just the lone kerbal.\u003C/p\u003E\n"},{"CreatedByName":"legodragonxp","CreatedById":7204,"CreatedDateTime":"2013-05-28T05:31:43Z","Content":"\n\u003Cp\u003ELimits of the game at this point. The only other thing that comes to mind is the old Monty Python skit, \u0022The is Keldrin Kerbal, he cannot be seen. Keldrin, can you stand up please?\u0022 BOOM!\u003C/p\u003E\u003Cp\u003E-Lego (insomnia time, sorry)\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-05-28T05:36:46Z","Content":"\n\u003Cp\u003EThere\u0027s hardcoded ranges for how far away you can \u0022see\u0022 various types of objects. At present, communications serve no purpose; a vessel can never truly be \u0022lost\u0022, and the concept of radio contact only exists through mods like RemoteTech. It\u0027s not known at this point what form the eventual implementation of official communications and locational awareness of other craft will take.\u003C/p\u003E\n"}]}