{"TopicId":28540,"ForumId":32,"TopicTitle":"Please report here if you\u0026#039;re having absolutely ZERO problems with 0.20","CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-23T20:07:54Z","PageNum":4,"Articles":[{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2013-05-24T10:57:31Z","Content":"\n\u003Cp\u003EI also don\u0027t have any issues with the new KSP, except form some lag when driving or at EVA at the planet\u0027s surface. I believe that at the next update these issues will be solved since they changed the memory loading procedures. During launch the lag at large part count is smaller than 0.19 and the launches are very beautiful. I like that they fixed the radial coupling and i hope that at a future update we will have back again (or as an option form the graphics menu) high resolution planets at the map view. Now i only need to wait to fix the mods so my mapsat mod will map properly the planets\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-05-24T11:03:39Z","Content":"\n\u003Cp\u003EI haven\u0027t noticed anything unusual inside the game itself. Though, the tracking station seems to have some issues with the orientation of atmosphere glows.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2013-05-24T11:24:22Z","Content":"\n\u003Cp\u003EI\u0027ve never encountered a single bug in all the time I\u0027ve been playing. It helps that I run a purely vanilla game, but I seem to have been relatively lucky in comparison to some people.\u003C/p\u003E\u003Cp\u003EWell, I\u0027ve had the occasional framerate drop, but that\u0027s more of a matter of my hardware being less than stellar than anything else.\u003C/p\u003E\n"},{"CreatedByName":"legodragonxp","CreatedById":7204,"CreatedDateTime":"2013-05-24T12:05:04Z","Content":"\n\u003Cp\u003EOverall I\u0027m doing good, but like others reporting in happy I have a clean install, stock parts, and new save game. While I need to get to the bugs area, two things I am researching to see if they are bugs are:\u003C/p\u003E\u003Cp\u003EWhen trying to dock with another ship in space, the nav ball won\u0027t switch over to the \u0027target\u0027 mode without jumping to the command center and then hopping back in.\u003C/p\u003E\u003Cp\u003EThe turbojet engine does not appear the \u0027initiate launch\u0027 so the map veiw never calculates periapsis or appoapsis. \u003C/p\u003E\u003Cp\u003E-Lego\u003C/p\u003E\n"},{"CreatedByName":"carranty","CreatedById":67479,"CreatedDateTime":"2013-05-24T12:09:25Z","Content":"\n\u003Cp\u003EI think a thread like this is a really good idea. I\u0027d be interested in knowing how many of you are running linux. I am, and there is a problem (bug report filed and several other users have the same problem) with the scroll wheel on the mouse. What used to be zoom in now zooms out, and zooming in doesn\u0027t work. We\u0027re having to use keyboard commands for zooming (trandslating in VAB), which are very slow. \u003C/p\u003E\u003Cp\u003EIs anyone here running linux and \u003Cem\u003Enot\u003C/em\u003E having this issue? If so, please state your os.\u003C/p\u003E\n"},{"CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-05-24T14:48:22Z","Content":"\n\u003Cp\u003EI\u0027ve only had time to play for a couple of hours with the 0.20 windows version but so far it works good for me. I noticed a huge performance boost in general; loading the game and launchpad is much faster now. Also I experience a lot less lag even during time warping in LKO; warping in MÃƒÂ¼n orbit is super fast. I have to play some more to build up my opinion, but at first glance it looks smooth.\u003C/p\u003E\n"},{"CreatedByName":"cypher_00","CreatedById":61486,"CreatedDateTime":"2013-05-24T14:55:44Z","Content":"\n\u003Cp\u003EPlayed all evening yesterday and enjoyed it very much. The only problem i noticed was the camera shaking when walking in EVA.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-24T14:58:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peenvogel\u0022 data-cite=\u0022Peenvogel\u0022\u003E\u003Cdiv\u003EI\u0027ve only had time to play for a couple of hours with the 0.20 windows version but so far it works good for me. I noticed a huge performance boost in general; loading the game and launchpad is much faster now. Also I experience a lot less lag even during time warping in LKO; warping in MÃƒÂ¼n orbit is super fast. I have to play some more to build up my opinion, but at first glance it looks smooth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow that you mentioned it, warping seems much faster in .20. Probably because the game isn\u0027t bogging down as your spacecraft approaches a planet or moon the way it used to. I\u0027ll have to get used to this! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2013-05-24T15:01:50Z","Content":"\n\u003Cp\u003EThanks to the OP for creating this thread! \u003C/p\u003E\u003Cp\u003EIt\u0027s very interesting how on a thread about people \u003Cem\u003Enot \u003C/em\u003Ehaving issues, I was able to pick out pretty much all the same bugs we had gleaned off the more uh, negative threads, and in a much less depressing way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHearing from those who AREN\u0027T experiencing a bug is very often just as important as hearing from those that are. \u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Macenzie","CreatedById":65231,"CreatedDateTime":"2013-05-24T15:07:46Z","Content":"\n\u003Cp\u003ENot had any issues here~\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-05-24T15:13:25Z","Content":"\n\u003Cp\u003ETo be honest, the people complaining are all using mods it seams. Anyhow, I do notice a better increase in speed and my computer not about to commit suicide. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-24T15:30:24Z\u0022 title=\u002205/24/2013 03:30  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 24, 2013\u003C/time\u003E by TheCanadianVendingMachine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-05-24T15:25:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003ETo be honest, the people complaining are all using mods it seams. Anyhow, I do notice a better in crease in speed and my computer not about to commit suicide. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBefore I started playing, I manually added the mods one by one and started a new game each time. Those that gave me trouble (no more inflatable hab:( ) I threw out immediately. I think most popular mods will be made compatible rather sooner than later.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-24T15:59:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003EThanks to the OP for creating this thread! \u003Cp\u003EIt\u0027s very interesting how on a thread about people \u003Cem\u003Enot \u003C/em\u003Ehaving issues, I was able to pick out pretty much all the same bugs we had gleaned off the more uh, negative threads, and in a much less depressing way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHearing from those who AREN\u0027T experiencing a bug is very often just as important as hearing from those that are. \u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome HarvesteR \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E LOL your game has left me not being able to finish my New Brighton Beach addon (*whispers*, um, for that other space sim hehehe), because it rocks so much! Thanks for making it! Dream come true! LOL\u003C/p\u003E\n"},{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2013-05-24T16:03:21Z","Content":"\n\u003Cp\u003EPlaying all stock -- that\u0027s just what I like to do -- and have tried all the new parts, built and driven a few rovers, and launched things to and from orbit, to Mun and back, and to Minmus (not back yet... will try after traveling tonight). So far, it\u0027s all been slicker than snot on a doorknob. It runs \u003Cstrong\u003Emuch\u003C/strong\u003E smoother and \u003Cstrong\u003Emuch\u003C/strong\u003E faster than 0.19 did, even when I try to throw things with all kinds of parts onto the pad. I\u0027ll have to load it on my daughter\u0027s computer when we return.\u003C/p\u003E\u003Cp\u003EThere was one point where the editor seemed to get confused when I took out the two new probe cores to look at them side-by-side, but it\u0027s entirely possible that \u003Cstrong\u003EI\u003C/strong\u003E got confused about which one I\u0027d picked first. If I can manage to duplicate it, it\u0027s the only thing I\u0027d classify as a bug, and it didn\u0027t even interrupt the software\u0027s execution.\u003C/p\u003E\n"},{"CreatedByName":"Zatie12","CreatedById":57823,"CreatedDateTime":"2013-05-24T16:04:52Z","Content":"\n\u003Cp\u003EI\u0027ve experienced zero new problems since 0.20.. It seems a load of bugs have been reported but none have affected me so far! I have a rather clean installation, only a couple of mods.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-24T16:57:54Z","Content":"\n\u003Cp\u003EWell, this is awful news. This will be a three day weekend for me, and it\u0027s supposed to rain for nearly all of it. All that yard work will have to wait until next week. Whatever shall I do to occupy the time? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-05-24T17:06:24Z","Content":"\n\u003Cp\u003ELoving the new update, especially the bugfixes, optimizations, and new part loader!\u003C/p\u003E\u003Cp\u003ENotable among the fixed bugs are the repaired VAB/SPH name fields and the crew hatches have been fixed! (I\u0027m on a Mac)\u003C/p\u003E\u003Cp\u003EI can also use higher graphics settings when playing, I might even turn on antialiasing to see how well it performs!\u003C/p\u003E\u003Cp\u003EPart loader is a ton faster, I can load the game in 0-2 minutes versus my 4\u002B in 0.19 and before.\u003C/p\u003E\u003Cp\u003ENew parts are great as well, I love the new wheels and the flags are killer!\u003C/p\u003E\u003Cp\u003EI have to say this is my new favorite update with all of the great stuff that Squad added!\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2013-05-24T17:25:19Z","Content":"\n\u003Cp\u003ENo trouble at all here, good sir.\u003C/p\u003E\u003Cp\u003ENo wait, I did have trouble.. thanks to my derpy self. I didn\u0027t rotate the new wheels correctly when adding them in the SPH.. so when I tested the rover it would\u0027nt drive.. I also thought they steered rather strangely.. then it dawned on me.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI also always start with a fresh install/map, too. Adding mods when they\u0027re ready. That new cupola internal is great for Kerbin gazing on a station.\u003C/p\u003E\u003Cp\u003EAlso, definitely faster, something my pc (and myself) are very happy with.\u003C/p\u003E\u003Cp\u003EIt loads very fast, so I don\u0027t know, but has the old loading screen been totally removed? I really liked that one.\u003C/p\u003E\u003Cp\u003EThanks, squad, for all the work you put into it. Very (very) much appreciated.\u003C/p\u003E\n"},{"CreatedByName":"SinPistones","CreatedById":42727,"CreatedDateTime":"2013-05-24T17:30:22Z","Content":"\n\u003Cp\u003EI haven\u0027t encountered any bugs at all either. My only problem seems to be the (apparent) new ocean shader, for some reason it lags my game by quite a lot compared to .19.\u003C/p\u003E\u003Cp\u003EBut only when I look at it from IVA, so it\u0027s not really that bad.\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-05-24T17:33:03Z","Content":"\n\u003Cp\u003EI have not found any problem yet, just improvement, but also the 0.19 was good, I fear that those mods inevitable slow down things...I am tempted to leave my 0.20 full stock\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-24T17:33:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SinPistones\u0022 data-cite=\u0022SinPistones\u0022\u003E\u003Cdiv\u003EI haven\u0027t encountered any bugs at all either. My only problem seems to be the (apparent) new ocean shader, for some reason it lags my game by quite a lot compared to .19.\u003Cp\u003EBut only when I look at it from IVA, so it\u0027s not really that bad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust out of curiosity, what sort of video card do you have? ATI or Nvidia based?\u003C/p\u003E\n"},{"CreatedByName":"SinPistones","CreatedById":42727,"CreatedDateTime":"2013-05-24T18:23:02Z","Content":"\n\u003Cp\u003EAMD Radeon HD6970. But it\u0027s coupled with a 3 year old Phenom II X4 where I think the problem lies.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-24T18:30:25Z","Content":"\n\u003Cp\u003EPossibly. I\u0027m running an i7-920/2.66 GHz which is about 5 years old, but with an Nvidia GTX650-Ti SC, and I\u0027m getting no lag at all. I was getting nasty lag on .19 with an ancient AMD Radeon HD4850, which is why I upgraded. Just grasping at straws for a possible correlation. Thanks for replying!\u003C/p\u003E\n"},{"CreatedByName":"AtmaStorm","CreatedById":4411,"CreatedDateTime":"2013-05-24T18:35:40Z","Content":"\n\u003Cp\u003E0.20 works just fine for the couple of hours I\u0027ve played so far, any issues I have with it have been in previous versions.\u003C/p\u003E\u003Cp\u003EIf they made parts act like they were properly bolted together at the seams rather than at the attachment node I\u0027d be very happy.\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2013-05-24T18:39:31Z","Content":"\n\u003Cp\u003EI\u0027m getting stuttering with the new wheels, and I have to quicksave like every three minutes to make sure I have something to go back to whenever I flip my rover. Even when I\u0027m not moving at all I\u0027m getting all this gittery movement and I have to spam the quicksave button until it saves. For some reason it keeps saying \u0022Cannot save when about to crash\u0022 or \u0022Cannot save when moving across the surface\u0022, even though I have breaks activated. It\u0027s not really a big deal though. I\u0027ll just wait \u0027till .20.\u003C/p\u003E\u003Cp\u003EOther than that it\u0027s a great version. I really like what Squad added.\u003C/p\u003E\n"}]}