{"TopicId":2860,"ForumId":25,"TopicTitle":"Impossible Challenge?","CreatedByName":"Warringer","CreatedById":328,"CreatedDateTime":"2011-10-12T17:10:37Z","PageNum":1,"Articles":[{"CreatedByName":"Warringer","CreatedById":328,"CreatedDateTime":"2011-10-12T17:10:37Z","Content":"\n\u003Cp\u003EThis challenge sounds pretty easy at first...\u003C/p\u003E\u003Cp\u003EGet into orbit, do two orbits, an orbit change and a return back to Kearth.\u003C/p\u003E\u003Cp\u003EBut here\\\u0027s the catch.\u003C/p\u003E\u003Cp\u003EUse only the RCS system!\u003C/p\u003E\n"},{"CreatedByName":"Phoxtane","CreatedById":6626,"CreatedDateTime":"2011-10-12T17:54:04Z","Content":"\n\u003Cp\u003EI declare this Impossibru. 16 RCS blocks barely have enough power to lift a fuel tank and the capsule off the ground.\u003C/p\u003E\u003Cp\u003EIt *might* be possible to get into orbit by conventional methods, THEN orbit twice and land via RCS. *Might*.\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-12T18:01:44Z","Content":"\n\u003Cp\u003EHmm. This is an interesting one. The max single stage dV using stock RCS is 2,986 m/s, which means that a multi-stage system is a necessity. However, all RCS thrusters which are still connected to the craft will fire, which means we can theoretically offload empty RCS tanks without losing any thrust at all (only put thrusters on the top stage).\u003C/p\u003E\u003Cp\u003EHowever, RCS blocks have a thrust/weight ratio of 20, vs. the stock engine\\\u0027s TWR of 100, and the thrust forward thrust of a single RCS block seems to be 0.98, maximum, which means to equal the thrust of a standard engine, we need 204 thrusters. (26 rings of 8 would do.) This would burn 41.6 fuel/second, which means a single RCS tank would last 6 seconds.\u003C/p\u003E\u003Cp\u003ELet\\\u0027s look at a single stage example. Assuming a parachute, decoupler, and 208 RCS blocks (capable of lifting 20.8 weight units), we have 8.3 weight units left to fill out if we want to be able to lift off the pad. That gives us 9 RCS tanks, which last 54 seconds at full burn.\u003C/p\u003E\u003Cp\u003EThis makes things pretty simple to calculate out: in order for a rocket with ONLY RCS to lift off the pad, half its weight needs to be RCS blocks. For every unit of weight added to the rocket, 20 RCS blocks must also be added to lift it. This means, at MOST, our lower stages can have a mass ratio of 1.71. Using the rocket equation, this means every stage can, at most, provide 894 m/s of delta-v, without payload.\u003C/p\u003E\u003Cp\u003ENow, your standard minimum-sized SSTO (pod, chute, 4 fuel tanks, engine) has 6,157 m/s of delta-v. Let\\\u0027s consider this the bare minimum for achieving orbit. We want to do some manuvers, and get back home, so let\\\u0027s assume that, all things considered, 7,000 m/s of delta-v is enough to complete the challenge. This means we need to have a rocket with 8 perfect stages, perfect meaning no payload. Since every stage is the payload of the stage above it, we can\\\u0027t have perfect stages. It also means that, since every stage is the payload of the stage above it, the required fuel to lift every successive stage (down from the orbiter) is roughly doubled -- we have an exponential need for more fuel. This is why in normal rocket designs, your first stages are so huge to lift your tiny upper stages to orbit.\u003C/p\u003E\u003Cp\u003EIn theory, I believe this challenge could be completed, but the sheer size of the rocket would crash KSP. Even the uppermost stage has over 200 components, and it provides \u003Cem\u003Ean eighth\u003C/em\u003E of the required power to achieve the challenge\\\u0027s goals.\u003C/p\u003E\n"},{"CreatedByName":"6677","CreatedById":890,"CreatedDateTime":"2011-10-12T18:50:30Z","Content":"\n\u003Cp\u003EVanilla RCS its impossible, its quite hard to fly with just RCS anyway, I tried a 20 RCS vehicle and its was painful to fly around the space center. Made a max altitude of 100 meters with some flying around first, no chute or decoupler so landing was a failure.\u003C/p\u003E\n"},{"CreatedByName":"Warringer","CreatedById":328,"CreatedDateTime":"2011-10-12T19:34:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phoxtane\u0022 data-cite=\u0022Phoxtane\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI declare this Impossibru. 16 RCS blocks barely have enough power to lift a fuel tank and the capsule off the ground.\u003C/p\u003E\u003Cp\u003EIt *might* be possible to get into orbit by conventional methods, THEN orbit twice and land via RCS. *Might*.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe command capsule got a weight of one ton and the RCS tank a weight of 0.9 tons. One RCS thruster got a weight of 0.05 tons. 16 thrusters are 0.8 tons. So 16 thrusters are able to lift 2.7 tons. Or 8 are able to lift 1.35 tons.\u003C/p\u003E\u003Cp\u003E8 thrusters and one RCS tank are 1.2 tons.\u003C/p\u003E\u003Cp\u003ESo for each set of thrusters and RCS tank you get a net left over of 0.15 tons. \u003C/p\u003E\u003Cp\u003ESo for each 6 8*RCS\u002Btank you can lift an RCS tank for free.\u003C/p\u003E\u003Cp\u003EMake that 16 8*RCS\u002Btank and you can lift three stack decouplers or a tricoupler.\u003C/p\u003E\u003Cp\u003EFor 8 8*RCS\u002Btank you can lift three Radial decouplers.\u003C/p\u003E\u003Cp\u003ESo do the math yourself... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-12T19:48:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warringer\u0022 data-cite=\u0022Warringer\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOr 8 are able to lift 1.35 tons.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, that\\\u0027s interesting. That would give the RCS blocks a strength of 1.65N rather than the 1N suggested in the config. I bet there\\\u0027s multiple gas jets combining from a single block to produce that thrust -- which means effective fuel efficiency goes down, if multiple jets being active at once results in further fuel consumption.\u003C/p\u003E\u003Cp\u003EThis changes the math behind my previous post significantly -- now a stock-engine equivalent amount of thrust only requires 122 RCS blocks, which is 15 rings of 8 \u002B 2, for a weight of 6.1. This means the TWR is 33, and that a pod\u002Bchute\u002Bdecoupler\u002B122 RCS \u002B fuel setup has 12.3 weight units left for fuel, permitting 13 tanks to be used.\u003C/p\u003E\u003Cp\u003ENow, I\\\u0027m not certain about fuel consumption with multiple jets, so I don\\\u0027t know how long the fuel lasts, but the theoretical delta-v of this setup is better than previously assumed: 1,122 m/s. How much is lost to horizontal thrust I\\\u0027m not sure.\u003C/p\u003E\n"}]}