{"TopicId":2865,"ForumId":18,"TopicTitle":"\u0026quot;Armed Chinese Troops in Texas!\u0026quot; video on YouTube","CreatedByName":"ForumHelper","CreatedById":8635,"CreatedDateTime":"2011-10-12T18:47:55Z","PageNum":1,"Articles":[{"CreatedByName":"ForumHelper","CreatedById":8635,"CreatedDateTime":"2011-10-12T18:47:55Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XKfuS6gfxPY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI\\\u0027ve just seen this and thought I should share it with you, in my opinion it\\\u0027s amazing. I\\\u0027m not from the US myself, however it\\\u0027s still interesting:)\u003C/p\u003E\n"},{"CreatedByName":"your mom","CreatedById":2028,"CreatedDateTime":"2011-10-12T20:14:57Z","Content":"\n\u003Cp\u003E is this real or just an advertisement for Ron Paul....\u003C/p\u003E\u003Cp\u003Eand for some reason that video reminded me of homefront \u003C/p\u003E\n"},{"CreatedByName":"Hypocee","CreatedById":8609,"CreatedDateTime":"2011-10-12T21:02:28Z","Content":"\n\u003Cp\u003EGood, can\\\u0027t think of a better place for them to be.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-10-12T21:36:13Z","Content":"\n\u003Cp\u003EHooray, fearmongering! Ron Paul can kiss my ass.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2011-10-13T04:57:41Z","Content":"\n\u003Cp\u003EI can\\\u0027t help but agree with the dislike of american military bases all over the world, but... Yeah, fear mongering.\u003C/p\u003E\n"},{"CreatedByName":"ryacko","CreatedById":240,"CreatedDateTime":"2011-10-15T17:44:02Z","Content":"\n\u003Cp\u003ESounds more like Red Dawn.\u003C/p\u003E\n"},{"CreatedByName":"Warshawski","CreatedById":9171,"CreatedDateTime":"2011-10-20T05:57:39Z","Content":"\n\u003Cp\u003EWhich they are remaking... with armed chinese troops.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-10-20T06:43:39Z","Content":"\n\u003Cp\u003ESounds like a good idea for a game.\u003C/p\u003E\u003Cp\u003EBut really. This is essentually why america will go bankrupt (yet they still cut nasa budget to put into the military?).\u003C/p\u003E\n"},{"CreatedByName":"Howson","CreatedById":2638,"CreatedDateTime":"2011-10-20T07:04:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GroundHOG-2010\u0022 data-cite=\u0022GroundHOG-2010\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESounds like a good idea for a game.\u003C/p\u003E\u003Cp\u003EBut really. This is essentially why America will go bankrupt (yet they still cut NASA budget to put into the military?).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\\\u0027s called Homefront, but it\\\u0027s North Korea not China\u003C/p\u003E\u003Cp\u003EThis advertisement is for a presidential Candidate that will actually make some major changes, like balancing the budget in 3 years\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2011-10-20T14:33:36Z","Content":"\n\u003Cp\u003EOkay, I\\\u0027m Australian and not American. So some of the nuances will be lost on me no doubt. But to me it seemed like the very opposite of fearmongering.\u003C/p\u003E\u003Cp\u003EIn case you\\\u0027re wondering, if you watch the entire video, Senator Paul is NOT saying \u0027elect me or there will be Chinese bases in Texas\u0027. His point is rather more clever than that. He\\\u0027s putting you in the place of, say, a citizen of Iraq; and he\\\u0027s asking you what you\\\u0027d do. He\\\u0027s showing you that the \u0027insurgents\u0027 may well be doing just what you\\\u0027d do if you were in their shoes, and demonstrating how offensive current American foreign policy appears to people from overseas.\u003C/p\u003E\u003Cp\u003EI am from overseas, though I have a fairly similar culture and language. I can back up what he says - your foreign policy is seen AT BEST as being a good-natured bull in a china shop, and at worst as a spoiled bully getting what he wants by violence[1]. \u003C/p\u003E\u003Cp\u003EWorse, as an ally of the USA we send our boys to the same trouble spots. Some of them die by accident from the bullets of their friends (not as many as the black humour would have you think, admittedly - but nevertheless the problem is real). Also they come home saying that after they go in and respectfully earn the trust of the local people, an American squad comes in and throws their weight around, undoing much of the good work they\\\u0027ve done.\u003C/p\u003E\u003Cp\u003ENo, he\\\u0027s not fearmongering. Not at all. As far as I can tell, this guy is right on the money.\u003C/p\u003E\u003Cp\u003EI know little else about him. For all I know he might be no good on any other issue; but I have to tell you that on this one he would seem to be quite persuasive.\u003C/p\u003E\u003Cp\u003E[1] Whether this is an accurate idea of what is happening or not is a separate issue. This is very definitely the perception.\u003C/p\u003E\n"},{"CreatedByName":"Hypocee","CreatedById":8609,"CreatedDateTime":"2011-10-20T18:21:33Z","Content":"\n\u003Cp\u003EYou\\\u0027re correct; that is the perception, and the perception is quite accurate. America\\\u0027s got a bad case of imperialism, and we may be in the death throes at this point. \u0027How would you feel if it were happening here?\u0027 is a fine message. However, I assume you\\\u0027re familiar with \u0027dog-whistle\u0027 politics? I\\\u0027m pretty confident there\\\u0027s another payload on that ad. \u003C/p\u003E\u003Cp\u003EFor the past three years I\\\u0027ve worked in a small room with, no way around it, a neurotypical nutcase. If it\\\u0027s contrary to what liberals, scientists or THE GOVERNMENT says, he\\\u0027s in. Young-Earth Creationist. Bircher. Takes his colloidal silver, his patented herbal heart drops and his megadose omega supplements every day. Most relevantly he plays the Genesis Communications Network (wink wink) all day, particularly his favorite show, \u003Ca href=\u0022http://buffalobeast.com/?p=423\u0022 rel=\u0022external nofollow\u0022\u003EAlex Jones\u003C/a\u003E... where Rand Paul drops in every few weeks for a long chat as one of Jones\\\u0027 favorite guests, alongside such luminaries as the Loose Change guys, the Christian Dominionist politician of the day, professional Holocaust denier David [Ed, derp] Irving, rich hobbyist climate change denier Lord Monckton, and a pump-and-dump precious metals merchant. Also every few weeks, Jones finds some way to mention that the National Guard is running roadblock checkpoints in Texas - always in Texas - in cooperation with ARMED MEXICAN TROOPS to practice for the implementation of MARTIAL LAW axross America by the Zioni\u003Cstrong\u003EJ\u003C/strong\u003Est tn\u003Cstrong\u003EE\u003C/strong\u003Eterna\u003Cstrong\u003EW\u003C/strong\u003Etional ba\u003Cstrong\u003ES\u003C/strong\u003Enkers and their military body, the UN. Keeping Texans worried about \u003Cem\u003Eforeigners\u003C/em\u003E entering \u003Cem\u003Eillegally\u003C/em\u003E much? Dog-whistle messaging isn\\\u0027t about \u003Cem\u003Epersuading\u003C/em\u003E the target audience that something is true, so the ad can be explicitly fictional and still achieve its purpose. The method is to repeatedly state that something is true, then move on. You can admit it\\\u0027s false a second later. That one second of shock is what matters. Invasion invasion invasion. Commies\\\u0027n\\\u0027Jews. Fnord fnord fnord.\u003C/p\u003E\u003Cp\u003EInternet Anarchists don\\\u0027t like to admit that that\\\u0027s Paul\\\u0027s crowd. Yes, he\\\u0027s for withdrawing from Iraq and reducing our ridiculous military expenditures...as one facet of eliminating the Federal government. He and his fellow Jesusland wranglers are in the business of saying things that are 95% reasonable, then covertly applying that final spin into reverse. Yes, the invasion of Iraq was a war crime that must stop. Yes, police forces inevitably abuse their power sometimes, and have recently been allowed to do it more. Yes, a small cartel of banks have a corrupt Congress at their heel. You\\\u0027re right, Rand Paul, what shall we do about that? Repeal the Civil Rights Act, give all law enforcement power to local \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewarbands\u003C/span\u003Emilitia, eliminate the SEC and all corporate taxes, and change our currency back to the gold standard that a \u003Cem\u003Emuch smaller\u003C/em\u003E cartel can control completely.\u003C/p\u003E\u003Cp\u003E...What?\u003C/p\u003E\n"},{"CreatedByName":"mojoey","CreatedById":8856,"CreatedDateTime":"2011-10-20T19:50:17Z","Content":"\n\u003Cp\u003Emaybe im nit picking here, but when they did the shadow outline of the foreign troops, note not ONE of the guns looked like an AK (standard Gun of the chinese and russian militaries) but looked instead like the barrel of an M-16. When people get sick of the things this government has done for years, i wont be suprised to see american troops in the streets. Sometimes its not whats outside, its whats inside that could be dangerous. I would infact be one to fight off anyone who tried to invade the US. And Closing bases around the world, is NOT how to do it. \u003C/p\u003E\u003Cp\u003EEDIT: after doing some googling, it seems that one Naval carrier is enough to deter violent activities. Sending our Fathers and Mothers and Sisters and Brothers And Sons and Daughters to fight a loosing ground is not how to keep the world in check.\u003C/p\u003E\n"},{"CreatedByName":"Howson","CreatedById":2638,"CreatedDateTime":"2011-10-21T01:57:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOkay, I\\\u0027m Australian and not American. So some of the nuances will be lost on me no doubt. But to me it seemed like the very opposite of fearmongering.\u003C/p\u003E\u003Cp\u003EIn case you\\\u0027re wondering, if you watch the entire video, Senator Paul is NOT saying \u0027elect me or there will be Chinese bases in Texas\u0027. His point is rather more clever than that. He\\\u0027s putting you in the place of, say, a citizen of Iraq; and he\\\u0027s asking you what you\\\u0027d do. He\\\u0027s showing you that the \u0027insurgents\u0027 may well be doing just what you\\\u0027d do if you were in their shoes, and demonstrating how offensive current American foreign policy appears to people from overseas.\u003C/p\u003E\u003Cp\u003EI am from overseas, though I have a fairly similar culture and language. I can back up what he says - your foreign policy is seen AT BEST as being a good-natured bull in a china shop, and at worst as a spoiled bully getting what he wants by violence[1]. \u003C/p\u003E\u003Cp\u003EWorse, as an ally of the USA we send our boys to the same trouble spots. Some of them die by accident from the bullets of their friends (not as many as the black humour would have you think, admittedly - but nevertheless the problem is real). Also they come home saying that after they go in and respectfully earn the trust of the local people, an American squad comes in and throws their weight around, undoing much of the good work they\\\u0027ve done.\u003C/p\u003E\u003Cp\u003ENo, he\\\u0027s not fearmongering. Not at all. As far as I can tell, this guy is right on the money.\u003C/p\u003E\u003Cp\u003EI know little else about him. For all I know he might be no good on any other issue; but I have to tell you that on this one he would seem to be quite persuasive.\u003C/p\u003E\u003Cp\u003E[1] Whether this is an accurate idea of what is happening or not is a separate issue. This is very definitely the perception.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe\\\u0027s a Congressman not a Senator. Other than that you are right on the money\u003C/p\u003E\n"},{"CreatedByName":"DoctorEvo","CreatedById":4870,"CreatedDateTime":"2011-10-21T05:42:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOkay, I\\\u0027m Australian and not American. So some of the nuances will be lost on me no doubt. But to me it seemed like the very opposite of fearmongering.\u003C/p\u003E\u003Cp\u003EIn case you\\\u0027re wondering, if you watch the entire video, Senator Paul is NOT saying \u0027elect me or there will be Chinese bases in Texas\u0027. His point is rather more clever than that. He\\\u0027s putting you in the place of, say, a citizen of Iraq; and he\\\u0027s asking you what you\\\u0027d do. He\\\u0027s showing you that the \u0027insurgents\u0027 may well be doing just what you\\\u0027d do if you were in their shoes, and demonstrating how offensive current American foreign policy appears to people from overseas.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait... so you\\\u0027re saying... we ARE the China in this analogy?! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003E(But seriously, thanks for clearing that up. I feel like the people who missed it didn\\\u0027t listen to the entire message.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mojoey\u0022 data-cite=\u0022mojoey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Emaybe im nit picking here, but when they did the shadow outline of the foreign troops, note not ONE of the guns looked like an AK (standard Gun of the chinese and russian militaries) but looked instead like the barrel of an M-16. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Chinese shoot the QBZ-95 now.\u003C/p\u003E\n"},{"CreatedByName":"Reflector","CreatedById":79,"CreatedDateTime":"2011-10-22T06:06:49Z","Content":"\n\u003Cp\u003EFUD.\u003C/p\u003E\n"}]}