{"TopicId":28871,"ForumId":44,"TopicTitle":"Science in TV series and cinema","CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-24T19:44:40Z","PageNum":1,"Articles":[{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-24T19:44:40Z","Content":"\n\u003Cp\u003EHere is the most accurate and very interesting TV series I\u0027ve ever seen, 3 hours of a good entertainment on youtube:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/5cqe9Wq9gqo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/NDuuVo7lVW0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBased on NASA\u0027s Mars Design Reference Architecture 5.0:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uUBhn3_P3hU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E(\u003Ca href=\u0022http://www.flightglobal.com/blogs/hyperbola/2009/12/nasas-latest-manned-mars-missi.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.flightglobal.com/blogs/hyperbola/2009/12/nasas-latest-manned-mars-missi.html\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EIn contrast to some corny American movies with a Hollywood attempt to add drama to space (gum-chewing tough guy, weird geek, focused military man, main hero, action girl and love interest or any other standard team of protagonists) in this TV series there ain\u0027t no drinking, no sex, no stupid backstories (Bruce Willis and his daughter in \u0022Armageddon\u0022), no pathetic aliens (like in this dumb Mars movie with Carrie-Anne Moss) and no one liners. No explosions, no screaming, no quick montage. Team sent to Mars are scientists for whom having a good time means playing chess (!). Sounds interesting?\u003C/p\u003E\u003Cp\u003EWell, it is. Although budget wasn\u0027t big and actors aren\u0027t that interesting to watch (but they shouldn\u0027t be! such mission would be rather boring) and there is some unnecessary drama, this is still lightyears ahead of most what we can watch on TV. \u0022Prometeus\u0022 or this last blockbuster with Tom Cruise ain\u0027t even close to this. Even despite some silly things like CanadArm, but ok, this is a Canadian production so I get it that they wanted to show what they got.\u003C/p\u003E\u003Cp\u003EBut why s-f movies or TV series based on reality (hard s-f, if you will) are almost nonexistant? I mean, compare the \u0022Race to Mars\u0022 if you watched it to this piece of crap:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/aifSgUNLsfQ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/aifSgUNLsfQ\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust one scene but you can easily tell how dumb it is (look at the interior of this ship! how much water they are using, how bad is acting and what morons USA sends to multitrilion dolar mission). And the rest of the movie is much, much worse (exploding bugs on Mars when you can breathe - wtf?!).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003ESo, what do you think about this? Why do most movies and TV series in space are just crap?\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T12:41:32Z\u0022 title=\u002205/25/2013 12:41  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jokurr","CreatedById":57496,"CreatedDateTime":"2013-05-24T20:23:03Z","Content":"\n\u003Cp\u003E\u0022Hard Sci-fi\u0022 is rare, quite simply because it doesn\u0027t sell. Mainstream audiences have very limited knowledge on physics or the realities of space travel, nor do they care. They don\u0027t have the patience to learn it either. Because of that, it\u0027s much more entertaining (and thus profitable for movie makers) to watch big explosions while sexy actors/actresses get involved in some heavy drama that makes little sense in reality.\u003C/p\u003E\u003Cp\u003EI watched the first 3 minutes or so of the movie you posted and I will have to watch it when I have time, looks quite interesting.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-24T20:32:59Z","Content":"\n\u003Cp\u003EI understand that transfer windows, inclination and delta V aren\u0027t really popular and \u0022sexy\u0022 things to sell to the public. But this still doesn\u0027t explain why the scripts and acting are bad and mostly they are. I\u0027m not talking about mindless blockbusters like \u0022Transformers\u0022 or movies which only use s-f as a decoration like \u0022Firefly\u0022. Even this movies which are supposed to be entertaining and are set in space mostly, well, ain\u0027t - lazy writing, one dimensional characters, cheesy dialogues and of course aliens. Why? Only good movie more or less about space which I remember is \u0022Contact\u0022 with Jodie Foster (yes, there are aliens but opening sequence is mind blowing) and \u00222010\u0022.\u003C/p\u003E\u003Cp\u003EIt\u0027s not surprising that the general population doesn\u0027t care about space when all they see is explosions on a futuristic ships while fighting alien species. Or worse, they think that we can do this easily and therefore we will start colonization in 10-20 years, which is equally ignorant. Without sound knowledge there won\u0027t be support and without public support the only space program which will have enough funding is the Chinese one, since China isn\u0027t a democracy.\u003C/p\u003E\n"},{"CreatedByName":"Jokurr","CreatedById":57496,"CreatedDateTime":"2013-05-24T20:43:14Z","Content":"\n\u003Cp\u003EI think that most people (except the most ignorant perhaps) realize that Hollywood movies are fiction and unrealistic, even if they do not fully understand why or how it really works. Hollywood makes **** up all the time, across all genres of movies. Unrealistic movies are not unique to the sci-fi genre. I\u0027d go so far as to say that it is common knowledge that Hollywood movies should be taken with a grain of salt when it comes to assessing how realistic the movie is. I very much doubt unrealistic Hollywood movies affect how much funding the space program receives. There are many reasons for the average person\u0027s rather apathetic view towards space, but unrealistic movies isn\u0027t one of them.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-24T21:00:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jokurr\u0022 data-cite=\u0022Jokurr\u0022\u003E\u003Cdiv\u003E very much doubt unrealistic Hollywood movies affect how much funding the space program receives. There are many reasons for the average person\u0027s rather apathetic view towards space, but unrealistic movies isn\u0027t one of them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot directly perhaps but if you don\u0027t get interested in space as a kid you probably won\u0027t get interested later. Lack of good s-f or space as a theme in culture means less people are interested. Look what\u0027s happening with the comic\u0027s superheroes - there are an increasing number of movies and franchise because kids who loved this movies are now 20-40 years old. In 90\u0027 and last decade fantasy was much more popular than space, so when in the 10-20 years from now these children will have smaller incentive to support space exploration than if they get more s-f. As long as space programs are funded by the government in democracies attracting attention of the average Joe and his kid is worth effort. And crappy s-f movies (not only phycis, but as I said acting, script and so on) aren\u0027t really helping.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-05-25T00:08:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jokurr\u0022 data-cite=\u0022Jokurr\u0022\u003E\u003Cdiv\u003EI think that most people (except the most ignorant perhaps) realize that Hollywood movies are fiction and unrealistic, even if they do not fully understand why or how it really works.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly I have to disagree with you. I soak up everything I can about past, present \u0026amp; future space missions, and I love to talk about it with anyone who even so much as feigns interest. In my experience, people imagine the realities of space travel are more like a Hollywood movie than reality. One example that springs to mind is a university classmate of mine. We were both studying mechanical engineering, yet he asked me \u0022what planet the [space shuttle crew] was on\u0022 when we saw a story about them on the news. He got mad when I laughed at him, telling me he had no interest in space flight so how should he know. He\u0027s since graduated and works as a professional engineer, so he\u0027s obviously a smart guy with a strong technical background... If it is possible for someone like that to have such misconceptions, then how bad is it among the majority of people who have no interest in space flight?\u003C/p\u003E\n"},{"CreatedByName":"EatThePath","CreatedById":123,"CreatedDateTime":"2013-05-25T00:29:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003ESo, what do you think about this? Why do most movies and TV series in space are just crap?\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite simply, because most movies and TV series are just crap. Most forms of entertainment are a sea of bad to passable with the rare standout.\u003C/p\u003E\u003Cp\u003EThe related question seems to be, roughly, \u0027why aren\u0027t any of these hard SF?\u0027. Well, I think the answer to that is that hard SF by itself only appeals to a very small market. To make it appealing to a large market, and if you\u0027re making a movie to make money, that\u0027s what you want, you have to make it more accessible. You make it about human drama, or about explosions. And if you\u0027ve got effective human drama or explosions, most of your audience isn\u0027t going to care if the SF is hard as cotton candy, so why bother with it? It might not actually get in the way, but if you don\u0027t need it to satisfy the majority of the audience, you might as well just ignore it from the outset.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-25T01:06:14Z","Content":"\n\u003Cp\u003EIMHO, one of most shameless spaceship designs (and there is more sharing ever lower place - Armageddon, I\u0027m looking at You ;p) I remember are \u0022messiah\u0022 from deep impact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.doblu.com/wp-content/uploads/2010/12/deepimpact4001.jpg\u0022 alt=\u0022deepimpact4001.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt looks like shuttle being duct-taped to some random Russian stages with few shuttle/titan SRB\u0027s strapped around, but movie is pretending that this craft is propelled by \u0022nuclear\u0022 rocket thingy... what the hell\u0027s wrong with these people !? \u003C/p\u003E\u003Cp\u003ERace to Mars was pretty decent movie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T01:15:32Z\u0022 title=\u002205/25/2013 01:15  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PaleoGamer","CreatedById":66992,"CreatedDateTime":"2013-05-25T01:33:50Z","Content":"\n\u003Cp\u003ECheck out \u003Cem\u003EEuropa Report\u003C/em\u003E. It\u0027s a \u0022found footage\u0022 type movie coming out about a mission to Europa but the spacecraft and science in it look to be pretty realistic. (OK, there\u0027s probably a monster on Europa, but beyond that... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey have a pretty good teaser website\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.europaventuresllc.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.europaventuresllc.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd a trailer\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/cbw9hlBnG74?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-25T01:55:45Z","Content":"\n\u003Cp\u003EFirst half of Europa report trailer was quite cool but then I start to feel horrible scent of Apollo 18. \u003C/p\u003E\u003Cp\u003EMaybe I\u0027m just grumbling now, but anyone of You guys felt tired of all this clichÃƒÂ© structure in movies and games that everyone is dying (or lived before we come), collapsing, burning, full of thrilling scenes and action ? \u003C/p\u003E\u003Cp\u003EWhy not once we get some \u0022nice\u0022 place to explore/experience some adventures and not kill/run of adversaries on some rubbles of once mighty city \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T01:59:13Z\u0022 title=\u002205/25/2013 01:59  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-25T02:07:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003ESo, what do you think about this? Why do most movies and TV series in space are just crap?\u003C/strong\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETodd Boyce explained it to me the reasons why this way:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/prelimnotes.php#id--On_Shaky_Ground--Hollywood_Reasons\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/prelimnotes.php#id--On_Shaky_Ground--Hollywood_Reasons\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"PaleoGamer","CreatedById":66992,"CreatedDateTime":"2013-05-25T03:50:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EFirst half of Europa report trailer was quite cool but then I start to feel horrible scent of Apollo 18. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, there\u0027s a reason I have the rolleyes Kerbal on there...\u003C/p\u003E\u003Cp\u003EI think just having a movie about exploring an amazing place would be great (travelogues are popular, right?) but Hollywood doesn\u0027t seem to think that we will be interested unless a monster or something shows up. The main reason why I\u0027ve stopped waiting for the \u003Cem\u003ERendezvous with Rama\u003C/em\u003E movie to ever show up. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-25T08:11:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nyrath\u0022 data-cite=\u0022nyrath\u0022\u003E\u003Cdiv\u003ETodd Boyce explained it to me the reasons why this way:\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/prelimnotes.php#id--On_Shaky_Ground--Hollywood_Reasons\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/prelimnotes.php#id--On_Shaky_Ground--Hollywood_Reasons\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery interesting - how could I miss it while reading your page? Thank you.\u003C/p\u003E\u003Cp\u003EHowever, this doesn\u0027t close the discussion. \u0022The Right Stuff\u0022 and \u0022Apollo 13\u0022 (not to mention \u00222001 Space Oddysey\u0022) - very good movies with decent pacing, drama, characters and script and all this without blasters, warp drive and aliens. You do not these to make a good movie. Take a look at Star Wars:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/_h_DMjfY7ZU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/_h_DMjfY7ZU\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGoofy space battles but screw science, there are knights with telekinetic powers and laser swords. The script and characters are poorly writen - why? Is it because s-f have amazing views and breathtaking CGI (\u0022Avatar\u0022)? Reasons why science is ignored in Hollywood are sound (although I gave few examples of a movies with realistic setting), okay, but why everything is so bad in most cases? You can have space dreadnought and good story but usually you don\u0027t.\u003C/p\u003E\u003Cp\u003E\u0022Europa Report\u0022 probably will containt some aliens beneath the ice, with some crew killing or driving them insane telepathicly included. Shame. But there is another good (I hope) space movie coming this year:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/doLizp4PJmc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cem\u003EDr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone--tethered to nothing but each other and spiraling out into the blackness. \u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHopefully no aliens or other silly things. Alfonso CuarÃƒÂ³n directed \u0022Children of Men\u0022 which was a good s-f movie, so my hopes are high. Although the first cliches are already visible (why ALWAYS there few days before retirement left?) it deserves a chance I think.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T08:15:59Z\u0022 title=\u002205/25/2013 08:15  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thaniel","CreatedById":11130,"CreatedDateTime":"2013-05-25T08:40:08Z","Content":"\n\u003Cp\u003EWhat would be fun, in 3-5 years time would be a movie about the Kerbal Spaceprogram, complete with female kerbals and Kerner von Grun, with realistic physics, and no humans. The possibilities for a good movie is there, and hollywood would love it, lots of explosions and aliens. Although I hope they\u0027ll be kept away from it.\u003C/p\u003E\u003Cp\u003EAnypooh, another movie in the spirit of \u0022race to mars\u0022 would be nice. There\u0027s nothing wrong with fantastic CGI as long as the vista portrayed could exist in reality, nor is there anything wrong with drama, as long as it could happen on a real flight. And I consider the incident with the faulty monoxide sensors to be a very good example on how drama can be both realistic and dramatic, something hollywood don\u0027t seem to understand.\u003C/p\u003E\u003Cp\u003EEdit: My bad, it wasn\u0027t the sensor that was faulty, but...... Not spoiling this, if you have watched the movie, you know, if you haven\u0027t, you should.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T08:42:26Z\u0022 title=\u002205/25/2013 08:42  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by Thaniel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-25T09:05:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thaniel\u0022 data-cite=\u0022Thaniel\u0022\u003E\u003Cdiv\u003EAnypooh, another movie in the spirit of \u0022race to mars\u0022 would be nice. There\u0027s nothing wrong with fantastic CGI as long as the vista portrayed could exist in reality, nor is there anything wrong with drama, as long as it could happen on a real flight. And I consider the incident with the faulty monoxide sensors to be a very good example on how drama can be both realistic and dramatic, something hollywood don\u0027t seem to understand.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. Good cinema is the goal - you can focus on visuals or story or characters but this should be done good. \u0022Avatar\u0022 is a visual masterpiece but scientifically and storywise it\u0027s just crap. \u0022Race to Mars\u0022 is very scientific accurate but lacks the visuals and interesting characters. The point is, there is no reasons to concentrate only on big explosions and lasers - as \u0022Right stuff\u0022 proves, excellent movie can be made almost without fireworks (no pun intended).\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-25T10:00:58Z","Content":"\n\u003Cp\u003EMost of the \u0022Sci\u0022Fi movies are just prolefeed. And this will be so until the public will get a clue about science. = not until after this \u0022civilization\u0022 blows itself up, and a new, better one is started.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-05-25T12:07:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003E\u0022 (not to mention \u00222001 Space Oddysey\u0022) - very good movies with decent pacing\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elololololololololololololololololololololololol\u003C/p\u003E\u003Cp\u003EI guess its been a while since you saw that movie.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-25T12:12:43Z","Content":"\n\u003Cp\u003EIt\u0027s because most people, including me, don\u0027t analyse movies for character development, just sit back and watch them.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-25T12:15:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003Elololololololololololololololololololololololol\u003Cp\u003EI guess its been a while since you saw that movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, the pacing is certainly atypical, though it\u0027s very deliberate, it\u0027s not just because they weren\u0027t really thinking about getting it right.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-25T12:16:40Z","Content":"\n\u003Cp\u003EOne of the best and more realistic sci-fi movies is 2010 the year we make contact. I even prefer it over 2001.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=34MXGB83heI\u0026amp;list=FLSiy1IfJmYJmd3BGnmGl5eg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=34MXGB83heI\u0026amp;list=FLSiy1IfJmYJmd3BGnmGl5eg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-25T12:20:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003Elololololololololololololololololololololololol\u003Cp\u003EI guess its been a while since you saw that movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s perfect for the purpose of the movie and its story. It\u0027s not a movie for those who prefer shaky camera and quick montage, that\u0027s for sure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MBobrik\u0022 data-cite=\u0022MBobrik\u0022\u003E\u003Cdiv\u003EMost of the \u0022Sci\u0022Fi movies are just prolefeed. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a little harsh (not everybody who watches dumb movies is dumb) but yes, most of the popcultural products are of very low quality.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EOne of the best and more realistic sci-fi movies is 2010 the year we make contact. I even prefer it over 2001.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI prefer \u00222001\u0022 but it\u0027s just my opinion. Though the scene when they use \u0022Discovery\u0022 as a booster isn\u0027t well done; however EVA and aerobraking are great.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T12:22:58Z\u0022 title=\u002205/25/2013 12:22  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-25T12:25:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003EI prefer \u00222001\u0022 but it\u0027s just my opinion. Though the scene when they use \u0022Discovery\u0022 as a booster isn\u0027t well done; however EVA and aerobraking are great.\u003C/div\u003E\u003C/blockquote\u003EJust out of interest why do you think this scene isn\u0027t well done?\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-05-25T12:30:08Z","Content":"\n\u003Cp\u003EFirst of all, the Soviet spacecraft has a big connector/clamp just the size of the \u0022Discovery\u0022; than they use it to connect two ships and fire the engines of the american ship. I doubt that the center of mass was were it should be to prevent flipping. Try to do this in KSP: connect your rocket to the booster attached to the middle section of the hull but few meters from it and fire it. You won\u0027t go straight ahead.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-25T12:33:28Z","Content":"\n\u003Cp\u003EThe center of mass offset could probably be explained by thrust vectoring or powerful gyros but the convenient clamp is a bit suspicious unless the ship was designed with that purpose in mind.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-05-25T12:34:26Z","Content":"\n\u003Cp\u003EIs there any movie that takes place a couple hundred years in the future when mankind has colonized the entire solar system? No warp drives or other star systems. It would be an interesting setting. Cities on Mars, maybe beginning the terraforming process etc.\u003C/p\u003E\u003Cp\u003EThere\u0027s just so much potential, but for some reason monsters. Monsters everywhere.\u003C/p\u003E\n"}]}