{"TopicId":28974,"ForumId":32,"TopicTitle":"Your Biggest Fail in KSP!","CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2013-05-25T03:56:40Z","PageNum":8,"Articles":[{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2013-11-07T01:41:42Z","Content":"\n\u003Cp\u003Efew weeks ago and after many missions (Well only like 5 missions) i finally did it to Eve on career mode (Actually was just intended to be a sun probe but i dont even know that smaller things do better orbital maneuvers to other planets) Well no more complex 30 t Interplanetary-Maneuvering stages for small probes (That had to make over 3-5 maneuvers to get on target\u0027s SOI), yesterday i was able to get to Jool for first time, Again whit a little rocket stage.... Damn maybe i should start thinking \u0022smaller\u0022 from now......\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-07T01:55:29Z","Content":"\n\u003Cp\u003ESpent three das designing my Duna lander, an hour to get there, landed, and realized I forgot the ladder....\u003C/p\u003E\n"},{"CreatedByName":"johnnyhandsome","CreatedById":59580,"CreatedDateTime":"2013-11-07T02:14:46Z","Content":"\n\u003Cp\u003EHitting the time warp key, when I meant to hit M, as I approached the breaking burn for orbiting Eve. Not a good day.\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-11-07T02:25:21Z","Content":"\n\u003Cp\u003EI thought the Mun was Minmus....\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-11-07T02:27:06Z","Content":"\n\u003Cp\u003EUpon arriving at Laythe, I assumed I could take off from it like I do in airless worlds/moons. My lander was underpowered, so my Kerbal got stranded. I was even surprised that I couldn\u0027t use the jetpack.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-11-07T03:00:33Z","Content":"\n\u003Cp\u003E*accidentally* stranding Jeb in high-altitude (above Munar) orbit above Kerbin with no EVA fuel. He was aboard my first .22 space station, originally intended for high Kerbin orbit, which I proceeded to take to do a very low-altitude (6 km!) Mun flyby (I\u0027m notorious for packing too much delta-v, especially when I don\u0027t need it) and ended up going on a trajectory into international space. I quickly loaded him into the return pod, detached, and fired the two seperatrons, proving to not be enough. I decided to try and exploit the infinite-dV by pushing method, but the pod ran out of power (again, this was a small station and I had little tech unlocked then) and I quickly found the pod spinning, Jeb 20 meters away with ~2% pack fuel, and was thus doomed.\u003C/p\u003E\n"},{"CreatedByName":"XVeris","CreatedById":57192,"CreatedDateTime":"2013-11-07T03:04:09Z","Content":"\n\u003Cp\u003EThat moment when you realize you forgot the parachute...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kD29hBV.png\u0022 alt=\u0022kD29hBV.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Carl","CreatedById":2645,"CreatedDateTime":"2013-11-07T05:28:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027ve never really liked one-use rockets in the real world, so for my first manned mission to Duna I decided to go big. I assembled a massive interplanetary spaceship at my orbital fuel depot through eight launches (not including countless failed prototypes), dubbed it the K.S.V. Intrepid, undocked from the station, set up my maneuver node, and engaged the engines. The ensuing explosion vaporized most of the ship, killed all ten crew members, and heavily damaged the space station itself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy did it explode though?\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-11-07T05:31:23Z","Content":"\n\u003Cp\u003EI sent a probe to Jool and I didn\u0027t have enough Delta V to circularize my orbit so I just left it in a highly elliptical orbit and I came back after a couple of extra missions and it was thrown out of the Joolian system almost into interstellar space.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2013-11-07T06:44:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Carl\u0022 data-cite=\u0022Carl\u0022\u003E\u003Cdiv\u003EWhy did it explode though?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe engines were mounted on pylons made from docking ports and were unstable. When I fired them they bent right into the center of the ship and ignited all the fuel on board.\u003C/p\u003E\n"},{"CreatedByName":"Polstar","CreatedById":89598,"CreatedDateTime":"2013-11-07T07:21:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnnyhandsome\u0022 data-cite=\u0022johnnyhandsome\u0022\u003E\u003Cdiv\u003EHitting the time warp key, when I meant to hit M, as I approached the breaking burn for orbiting Eve. Not a good day.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGot to admit 99% of all my screw ups are caused when using time warp and not slowing it back down in time. Usually missing my manouver node or the worst are when i get captured by a planet then thrown back into space due to the pause and then the time skip.\u003C/p\u003E\n"},{"CreatedByName":"DeepSpaceDutch","CreatedById":66213,"CreatedDateTime":"2013-11-07T08:57:47Z","Content":"\n\u003Cp\u003ECool, finally putting my new C\u0026amp;C Module on my spacestation!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/558737235174023570/1F56349C474C2C77D09D12219BA2F9C8B875AA85/\u0022 alt=\u00221F56349C474C2C77D09D12219BA2F9C8B875AA85\u0022\u003E\u003C/p\u003E\u003Cp\u003E..euh...wait a minute...CRAP!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/558737235174027776/B6F9DD37A31D96806205ABF4667E56C182D5ED6D/\u0022 alt=\u0022B6F9DD37A31D96806205ABF4667E56C182D5ED6D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DartBoris","CreatedById":91729,"CreatedDateTime":"2013-11-07T11:45:35Z","Content":"\n\u003Cp\u003EHad a shipbreaking landing on Mun , however , with massive skill of Jeb managed to get the remaining part back in orbit , even in kerbin orbit. \u003C/p\u003E\u003Cp\u003EWith 110 km periapsis and no fuel.\u003C/p\u003E\u003Cp\u003ENo problem for Jeb and his comrades! Just lets slow this thing a bit with eva jetpacks....so slow...\u003C/p\u003E\u003Cp\u003EWait , why are we pushing entire thing? Lets remove deadweight!\u003C/p\u003E\u003Cp\u003E- *Detaching service module* -\u003C/p\u003E\u003Cp\u003EGood , but there are some more things to detach!\u003C/p\u003E\u003Cp\u003E- *Detaching heatshield* -\u003C/p\u003E\u003Cp\u003EDerp.\u003C/p\u003E\u003Cp\u003E(have Deadly reentry)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T11:50:30Z\u0022 title=\u002211/07/2013 11:50  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by DartBoris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rholtsla98","CreatedById":83914,"CreatedDateTime":"2013-11-07T12:51:03Z","Content":"\n\u003Cp\u003EDefinitely being able to dock and do all the hard in kerbin orbit things easily and then ever single interplanetary mission failing horribly. I have had this game for almost three months and have not had a single successful interplanetary mission\u003C/p\u003E\n"},{"CreatedByName":"DeepSpaceDutch","CreatedById":66213,"CreatedDateTime":"2013-11-07T12:55:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rholtsla98\u0022 data-cite=\u0022rholtsla98\u0022\u003E\u003Cdiv\u003EDefinitely being able to dock and do all the hard in kerbin orbit things easily and then ever single interplanetary mission failing horribly. I have had this game for almost three months and have not had a single successful interplanetary mission\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo what goes wrong every time?\u003C/p\u003E\n"},{"CreatedByName":"Dweller_Benthos","CreatedById":15418,"CreatedDateTime":"2013-11-07T14:01:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Polstar\u0022 data-cite=\u0022Polstar\u0022\u003E\u003Cdiv\u003EGot to admit 99% of all my screw ups are caused when using time warp and not slowing it back down in time. Usually missing my manouver node or the worst are when i get captured by a planet then thrown back into space due to the pause and then the time skip.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGet the Kerbal Alarm Clock mod and never miss another maneuver node. Indispensable add-on, IMO.\u003C/p\u003E\u003Cp\u003EAs for my failures, the most recent was the \u0022forgot to add a decoupler between stages\u0022 foul-up. Was sending a probe to Eve for science and was just about to run out of fuel on the lower stage, then realized there was no decoupler and the probe lander was stuck to the last ascent stage and had used all of the fuel it had because it was considered one big rocket. It\u0027s now floating in a weird orbit just inside Kerbin\u0027s and has been renamed \u0022Lost Eve Mission\u0022. It seems every save file I have has at least one spacecraft floating around after something went wrong.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-07T14:53:11Z","Content":"\n\u003Cp\u003EI got a new keyboard last week. It has a key to put the computer to sleep mounted just above, and the same size and shape as, the minus key of the numpad. You know, the key you use to zoom the view out? Naturally, I\u0027ve accidentally hit the sleep key quite a few times already now. Mostly this happens in the VAB and it\u0027s no big deal, just waste a minute while the computer dozes off and then wakes up again.\u003C/p\u003E\u003Cp\u003EBut 2 days ago I did it while flying. I was trying to take a cool screenshot while docking a couple of monstrosities together, had the camera at the right angle and didn\u0027t want to risk messing it up by using the mouse wheel to adjust the zoom. So I tried to zoom out with KP- just reaching for the upper left corner of the keyboard while keeping my eyes on the screen, and hit the sleep key instead. While one of the ships was moving towards the other at a fairly good clip. When my computer goes to sleep, the monitor shuts off instantly but the numbers keep crunching for a little while. And when it wakes up, the numbers start crunching for 5-10 seconds before the monitor comes back up. The speakers worked from the get-go and I heard all sorts of horrible noises coming from the black screen. When the picture came up again, there was a just huge debris cloud.\u003C/p\u003E\n"},{"CreatedByName":"vencaslac","CreatedById":57518,"CreatedDateTime":"2013-11-07T17:28:38Z","Content":"\n\u003Cp\u003Eassuming what can take off and orbit from the mun can also do the same on laythe.... i learned to research stuff before comitting to a few hours of gameplay only to fail miserably \u0026gt;.\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"tobjv","CreatedById":50269,"CreatedDateTime":"2013-11-12T23:09:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spacetortoise1\u0022 data-cite=\u0022spacetortoise1\u0022\u003E\u003Cdiv\u003EFinally, been waiting to see this thread. Had two recently, one time I built an entire rocket from scratch, after I put the finishing touches on and organized the staging, I tried to save but accidentally clicked \u003Cem\u003ENew\u003C/em\u003E and erased a good 15 minutes from my life.\u003Cp\u003EAlso I just recently wasted a bunch of time getting to Minmus to do some science, apparently the hills biome includes the poles, so I got about 30 science from an orbital report, and like 3.5 from a surface sample. Got this picture though:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W4QD6fg.png\u0022 alt=\u0022W4QD6fg.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou do know the game auto saves ships every so often just in case you do this right?\u003C/p\u003E\u003Cp\u003EIts usually the top most save called Auto Save\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-11-13T04:17:00Z","Content":"\n\u003Cp\u003EI once sent a rover to Minmus that was supposed to be able to re-dock to its lander for refueling, but the gap between the lander port and the port on the underside of the rover was too narrow -- when I undocked the rover, the magnetism of the ports would re-grab. So I needed to move the body of the lander a little higher on its legs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SI6NZkD.jpg\u0022 alt=\u0022SI6NZkD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I went back to the VAB, tweaked all the legs a bit higher on the body of the lander, and sent it off to Minmus.\u003C/p\u003E\u003Cp\u003EAnd, if you are paying more attention than I was, you\u0027ll see that after the new lander touched down and released the rover.......the gap was even smaller. Because I should have moved the legs DOWN LOWER on the lander to make it\u0027s body sit higher. What a goofball.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2013-11-13T04:36:45Z","Content":"\n\u003Cp\u003EAah, somebody revived the revival thread. My biggest fail was shorty after Duna was discovered and I had previously landed a rocket to discover atmosphere. So naturally, I want to fly a space plane there. Complex, awesome staging and capable of a space plane landing back to kerbal afterwards. All tests showed green and did it with style. So I went to duna and here I am before I attempt my landing. Take a close look at my main landing engines and see if you can tell a flaw in my design...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i529.photobucket.com/albums/dd332/KwKiller/Kerbal%20Space%20Command/screenshot33-1.png\u0022 alt=\u0022screenshot33-1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere was many a save and quickload as I tried to get down before I discovered the jet engines don\u0027t work in duna\u0027s atmosphere. So I quickloaded once more and resigned myself to just holding stylishly in orbit....\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-11-13T04:46:09Z","Content":"\n\u003Cp\u003EOne of my fails was forgetting stage decouplers... That was fun.\u003C/p\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2013-11-13T09:07:41Z","Content":"\n\u003Cp\u003EI installed the Kethane mod as I wanted a fuel supply from minmus. Built a kethane probe remembering to include solar cells etc. Launched it and tested it above kerbin. Worked well - built a transporter to take it to minmus. Launched and docked with the probe successfully. Started a transfer to minmus. Got in to a retrograde orbit but it was no biggie as I wanted to get polar anyway - transferred remaining fuel to the probe. Undocked. Unfolded the solar panels - yeah not making that mistake. Did a burn for polar making sure I kept my orbit nice and tight around minmus. Didn\u0027t quite get a polar orbit but figured I didn\u0027t want to land at the poles anyway. Activated the kethane detector. Got a ping, and another. Two grey hexagons - result. pressed escape. Selected the space centre (no not ending the flight mistake). over the course of several days I built a space station with empty fuel tanks, a kethane miner, a ground transporter to move the fuel around on minmus a fuel transfer system to move the converted fuel from the surface to a waiting transporter in minmus orbit. Docked in LKO successfully and Transferred all these successfully to Minmus low orbit in prograde this time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Switched to my kethane probe to see a screen full of hexagons. Ping. 3 hexagons...\u003C/p\u003E\u003Cp\u003EOnly then did I find out that it only works while you\u0027re switched to it. Time to leave KSP running over night \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"[email\u0026#160;protected]","CreatedById":80529,"CreatedDateTime":"2013-11-13T20:16:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022psyper\u0022 data-cite=\u0022psyper\u0022\u003E\u003Cdiv\u003EI installed the Kethane mod as I wanted a fuel supply from minmus. Built a kethane probe remembering to include solar cells etc. Launched it and tested it above kerbin. Worked well - built a transporter to take it to minmus. Launched and docked with the probe successfully. Started a transfer to minmus. Got in to a retrograde orbit but it was no biggie as I wanted to get polar anyway - transferred remaining fuel to the probe. Undocked. Unfolded the solar panels - yeah not making that mistake. Did a burn for polar making sure I kept my orbit nice and tight around minmus. Didn\u0027t quite get a polar orbit but figured I didn\u0027t want to land at the poles anyway. Activated the kethane detector. Got a ping, and another. Two grey hexagons - result. pressed escape. Selected the space centre (no not ending the flight mistake). over the course of several days I built a space station with empty fuel tanks, a kethane miner, a ground transporter to move the fuel around on minmus a fuel transfer system to move the converted fuel from the surface to a waiting transporter in minmus orbit. Docked in LKO successfully and Transferred all these successfully to Minmus low orbit in prograde this time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Switched to my kethane probe to see a screen full of hexagons. Ping. 3 hexagons...\u003Cp\u003EOnly then did I find out that it only works while you\u0027re switched to it. Time to leave KSP running over night \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERun it with time acceleration on. Just play around with it a bit to see how fast it can run while still hitting all the hexs.\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2013-11-14T01:19:30Z","Content":"\n\u003Cp\u003EFlying my first ever mission with 2 meter parts in Career mode. I get up out of the atmosphere and switch to map view, then all of a sudden hear an explosion. I look back and find that one of the fuel tanks is missing, and there is a bit of debris flying past my rocket.\u003C/p\u003E\u003Cp\u003ESince then, I\u0027ve always made sure to launch slightly out of plane of the debris.\u003C/p\u003E\n"}]}