{"TopicId":29003,"ForumId":25,"TopicTitle":"Duna Permanent Outpost Mission Architecture Challenge","CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-05-25T07:50:44Z","PageNum":9,"Articles":[{"CreatedByName":"Raptor831","CreatedById":68286,"CreatedDateTime":"2013-08-08T17:37:30Z","Content":"\n\u003Cp\u003EWell, back to the drawing board. When planning my missions, my timeline is so tight I can\u0027t miss a single launch or vehicle, and I\u0027ve only got 10 kerbals on Duna by the end of 1000 days. And no rovers or science-y cool stuff. Looks like a weight reduction is in order. NeilC, I guess you were right. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Or, I guess if I increase the nominal mass of my launcher enough I could just lift it all at once. Will have to test it out again.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-08-08T18:44:59Z","Content":"\n\u003Cp\u003EActions on the fly.. wow that looks really cool. I have an interplanetary shuttle that has an action group for atmospheric encounters (retracts the solar panels and turns off lights) but due to a QA glitch, only 3 of the 4 panels retract. Since my schedule does not have another one of these planned to go up for another four Kerbin-Duna launch windows, I might be able to fix this one. Its only a matter of time until I forget to retract that one last panel and rip it off in an aerocapture.\u003C/p\u003E\u003Cp\u003ESay.. does that actions on the fly allow things that regular action groups don\u0027t? In particular, I\u0027d like to be able to disable flow from RCS tanks on an action key so I don\u0027t have to right-click them every time I switch back to the vessel.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-08T19:33:27Z","Content":"\n\u003Cp\u003EI don\u0027t believe it does. You enable it by right clicking the control pod for the vehicle (drone body, command module etc), hitting engage AGs, then can click on any other item and any normal controls will be listed with a pop up menu that adds that command to any of the control groups. Then disable it on the control pod again so those menu items don\u0027t pop up any more. I mainly use it when having vessels with multiple components that dock or undock. It can get confusing otherwise with multiple parachutes on different craft on different action groups. I think that it only does commands that a part can normally do. Like toggle engines, deploy chutes etc. I haven\u0027t tried disabling fuel flow, but that\u0027s a different style of command I think. Those little green arrow tabs aren\u0027t quite like the right click commands on most pods.\u003C/p\u003E\u003Cp\u003EThe one annoying thing about it is if you have a lot of radial symmetry Actions on the Fly has to do each part seperately, where-as in the VAB you do all the radially symmetric parts at once.\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-08T23:31:30Z","Content":"\n\u003Cp\u003EI\u0027m probably a little late with this, but maybe it will help some of you out when choosing a payload size. I\u0027m looking at you, Raptor831.\u003C/p\u003E\u003Cp\u003EHere\u0027s a chart showing payload mass to LKO vs max tonnage to Duna. Day 283 and Day 739 are the transfer windows that let you put things on Duna by day 500 and 1000, respectively. _RU denotes reusable lifters - they always launch more tonnage than non-reusable ones, so that\u0027s a no-brainer if you\u0027re after a high score.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AklVil6.jpg\u0022 alt=\u0022AklVil6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBigger payload isn\u0027t always better: there are local maxima, and you can actually reduce your total paylaod to Duna by making your payload a ton or two bigger. 30 is good for reusable lifters, as it\u0027s near local maxima for both 500 and 1000 day windows, and has the added bonus of 2 payloads in the first Duna transfer.\u003C/p\u003E\u003Cp\u003EHope that helps!\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-09T01:23:30Z","Content":"\n\u003Cp\u003EMe I did briefly consider 38tons, just because it neatly divides into 228day turnover. It does however mean you only get one launch before the 55day window. Once I complete mine I may try a do-over without the limitations I put on myself this time around on that size payload and a full bore kethane fueled system. *shrugs* Might be interesting. Especially since ELP is no longer allowed.\u003C/p\u003E\u003Cp\u003EOh, and though 30 is dead on for re-usable lifters it leaves no room for error or for launching crew up. Make a mistake anywhere and you\u0027d be a day off and miss the first Duna intercept. That\u0027s why I aimed a hair under 30 to give me time to get crew up, set up the burn and generally make sure things went well. As it turned out I didn\u0027t need quite as much time as I thought so when I upped from 27tons to 28tons it didn\u0027t make any difference as far as that was concerned.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-09T01:25:50Z\u0022 title=\u002208/09/2013 01:25  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 9, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-09T02:08:18Z","Content":"\n\u003Cp\u003EA 30-minute crew launch won\u0027t put a dent in the dV requirement for the Hohmann transfer, a few hours leeway is no problem. Your 38-ton launcher could get 2 payloads to Duna in the first \u0022transfer window\u0022 if you gave your second IPT enough punch to make up for the delayed launch.\u003C/p\u003E\u003Cp\u003ECheck out the transfer window dV plotter linked in the OP, you can use it to figure out how much of a penalty you should pay.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-09T02:39:23Z","Content":"\n\u003Cp\u003EI thought about that, even had a \u0027non-hoffmann\u0027 transfer plotted on my original set up, just after the first transfer (about 15 days after if I remember right) but I eventually just delayed the Gamma launch to launch on the 2nd hoffmann transfer window anyway. I guess just minimising the fuel use was the aim. The more I arrive with the more I have to play with for refueling ITVs for return trips, refueling the Destiny landers etc, all this before the K mining gets going of course. After that fuel arrived doesn\u0027t matter much.\u003C/p\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2013-08-09T06:39:32Z","Content":"\n\u003Cp\u003E4 more hours of work tonight, redesigned my DDAV - Duna Descent/Ascent Vehicle. Im trying to make something relatively light, but also carry a lot of kerbals, fuel, and oxygen to orbit, while being able to survive atmospheric reentry and being able to be pulled around on the surface by my DEV - Duna Exploration Vehicle.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1160.photobucket.com/user/TheBobWiley/media/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-20-34-86_zps18ad94a5.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1160.photobucket.com/albums/q498/TheBobWiley/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-20-34-86_zps18ad94a5.png\u0022 alt=\u0022KSP2013-08-0902-20-34-86_zps18ad94a5.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1160.photobucket.com/user/TheBobWiley/media/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-08-15-31_zps8a1aa7fc.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1160.photobucket.com/albums/q498/TheBobWiley/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-08-15-31_zps8a1aa7fc.png\u0022 alt=\u0022KSP2013-08-0902-08-15-31_zps8a1aa7fc.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1160.photobucket.com/user/TheBobWiley/media/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-08-28-96_zps3b273be4.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1160.photobucket.com/albums/q498/TheBobWiley/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-08-28-96_zps3b273be4.png\u0022 alt=\u0022KSP2013-08-0902-08-28-96_zps3b273be4.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1160.photobucket.com/user/TheBobWiley/media/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-11-08-54_zps4213e0e0.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1160.photobucket.com/albums/q498/TheBobWiley/Duna%20Permanent%20Outpost%20Mission/KSP2013-08-0902-11-08-54_zps4213e0e0.png\u0022 alt=\u0022KSP2013-08-0902-11-08-54_zps4213e0e0.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf I am able to get my timing right, I should be able to fly at least 2-4 missions to duna during the second homman window, which would put 40 kerbals on duna by day 500, if everything goes perfect that is..... only time will tell. Now that im finally getting my vehicles banged out, I can start flying missions to see if everything works the way im planning!\u003C/p\u003E\n"},{"CreatedByName":"Raptor831","CreatedById":68286,"CreatedDateTime":"2013-08-09T13:59:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeilC\u0022 data-cite=\u0022NeilC\u0022\u003E\u003Cdiv\u003EI\u0027m probably a little late with this, but maybe it will help some of you out when choosing a payload size. I\u0027m looking at you, Raptor831.\u003Cp\u003EHere\u0027s a chart showing payload mass to LKO vs max tonnage to Duna.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually did that when I started setting up my plan. Max you can lift over the 1000 days is 660 tons (or close), no matter the size of the lifter. It all comes down to the timing of your launches and what you can actually send to Duna. Which is why I trimmed my payloads down to under 30 tons. Not as good looking, but they get the job done just the same. I still have to trim my launcher for 30 tons, but it does qualify as reusable at 34 tons so I\u0027m still good there. I like wide margins anyway...\u003C/p\u003E\u003Cp\u003EI\u0027m still not setting kerbals down until the second window, as I\u0027m sending a large kethane/MapSat probe and an unmanned lander. But if my plan holds it will be 5 kerbals at the second window with dual redundancy for habitats. Next set will make the base self sufficient (kethane), add a rover, and 5 more kerbals. 3rd window will have more rovers, 5 more kerbals and original crew coming home around the same time. Last window (which doesn\u0027t make it before 1000 days) will increase safety (extra escape launchers) and add still more kerbals. I\u0027ll have at least 10 kerbals on Duna at once, with missions being around 400 days per 5-kerbal crew. We\u0027ll have a regular train of interplanetary vehicles transferring back and forth, and I can send rescue landers at almost any point.\u003C/p\u003E\u003Cp\u003EOnce I get the plan cleaned up I\u0027ll post the official one here.\u003C/p\u003E\n"},{"CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-08-09T14:58:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meyst\u0022 data-cite=\u0022meyst\u0022\u003E\u003Cdiv\u003EGood to see other people are making progress too!\u003Cp\u003EI would like to get a confirmation that supplies that have been used up and abandoned don\u0027t negatively affect the base mobility achievement.\u003C/p\u003E\u003Cp\u003EI ask because this is a picture summery of the current state of supply mobility system testing.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.com/i/f3t79bp/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.com/a/img543/2889/t79b.png\u0022 alt=\u0022t79b.png\u0022\u003E\u003C/a\u003EUploaded with \u003Ca href=\u0022http://imageshack.com\u0022 rel=\u0022external nofollow\u0022\u003EImageShack.com\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes they will not affect base mobility achievement. Saw your recent designs and really liked the ingenuity and their safety / redundancy features!\u003C/p\u003E\n"},{"CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-08-09T15:21:56Z","Content":"\n\u003Cp\u003ESorry people I\u0027ve been really busy with RL lately so haven\u0027t got a chance to update / reply until now. Good to see the great progress, with several entries nearing the completion of their design phase or are already flying Duna missions and several more joining the great race to Duna. I have updated the Entries in Progress section in the OP and will update the leaderboard tomorrow. I\u0027ll also get to some questions and other updates tomorrow.\u003C/p\u003E\u003Cp\u003EAlso I recently got a PM from one of main authors of the MarsDrive Consortium\u0027s \u0022Ready For Mars\u0022 reference design for manned missions to Mars, which I referenced as an important inspiration for the challenge. This is the guy behind the idea of landing many small and mobile payload, to permit manned mission to Mars with today\u0027s launch vehicles (e.g. without SHLV) and Mars EDL technology, and to lower the cost (through high launch frequency) and increase safety / redundancy. Apparently he has also been following this challenge!\u003C/p\u003E\n"},{"CreatedByName":"ThreeMartiniLaunch","CreatedById":62595,"CreatedDateTime":"2013-08-09T21:20:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sturmstiger\u0022 data-cite=\u0022sturmstiger\u0022\u003E\u003Cdiv\u003EAlso I recently got a PM from one of main authors of the MarsDrive Consortium\u0027s \u0022Ready For Mars\u0022 reference design for manned missions to Mars, which I referenced as an important inspiration for the challenge. This is the guy behind the idea of landing many small and mobile payload, to permit manned mission to Mars with today\u0027s launch vehicles (e.g. without SHLV) and Mars EDL technology, and to lower the cost (through high launch frequency) and increase safety / redundancy. Apparently he has also been following this challenge!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is almost as cool as this challenge!\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-09T22:03:19Z","Content":"\n\u003Cp\u003EVery interesting! Though I fancy even using Kerbal physics a Earth Mars venture is still considerably more complex than Kerbin Duna venture.\u003C/p\u003E\u003Cp\u003EOn a side note I\u0027ve noticed that the trouble I was having with Ioncross life support running out before reaching Duna was not due to insufficient oxygen tanks. The system uses more oxygen at high warp! I think it\u0027s the same problem with batteries at high warp, something to do with the way KSP deals with energy flow at various warp levels, and thus affects the recyclers (might also be the tipping point when the recyclers switch on and off due to \u0027insufficient CO2\u0027). With the same ship travelling at 100,000 warp it hasn\u0027t enough air for the trip, but at 10,000 warp it does. Really odd.\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-10T00:57:21Z","Content":"\n\u003Cp\u003EWOW, that is a cool way to do a supply drop! Why bother with legs when you can just tip over?\u003C/p\u003E\u003Cp\u003ENice. Very nice.\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-10T02:40:49Z","Content":"\n\u003Cp\u003EIts here! Its finally here! (the laptop that is) Big and heavy and beautiful and more than I should have spent, but MY GOD! I never knew how beautiful Kerbal really was! Went ahead and wiped my saves again, installed way too many mods, and having a new go. I\u0027ve recreated a couple bits so far, but I\u0027m holding off on the finishing bits until the new infernal robotics pack comes out in a few days so that I can get my hands on all those new sweet hinges (I dont want to install/tweak the original robotics parts just to toss them and rebuild stuffs).\u003C/p\u003E\u003Cp\u003EIn the mean time, I\u0027ll post a couple of images on some of the idea\u0027s I\u0027m rather proud of. The first is the crew housing pod. At the top inside of the fairing is a small autonomous Duna lifter/landing assistance module (these will be refueled and reused). Three inflatable \u0022crewpartments\u0022 are held below, and at the bottom is a small transfer vehicle. The heat shielding for aerobreaking is pending the infernal bits, but this is the main form.\u003C/p\u003E\u003Cp\u003ENext picture is a view of the inflated crewpartment. Each crewpartment is built on a small supply module, containing 375 supply (total) and long term housing for two Kerbals (inflatable activity module from LLL, max capacity 4). The inflating top does clip through the docking port on top, but this isn\u0027t done using part clipping, just in the nature of the part. I would love if the docking port would be pushed to the top, but I imagine it being disassembled/reassembled and stored as needed. In the back you can faintly see a mark 1 version of the duna crane that will be launching in the first window (once I get those new infernal hinges installed). I\u0027ll be pulling some overtime to pay off the new rig, but I think I can squeeze enough kerbal in to make more frequent updates (since i wont wait hours just for a couple hundred parts to transfer to Duna on crippled physics).\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/bckoZ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2013-08-10T07:45:26Z","Content":"\n\u003Cp\u003ECongrats on the new laptop, Thats how I felt when I bought mine, spent too much, but worth every penny. Thankfully I have a desktop for kerbal so 500\u002B parts usually just starts lagging the physics in atmosphere. Those parts look really cool, what mods are you using? - KeithStone\u003C/p\u003E\n"},{"CreatedByName":"SRFirefox","CreatedById":67434,"CreatedDateTime":"2013-08-10T08:56:18Z","Content":"\n\u003Cp\u003EI\u0027ve been working on my entry to this challenge for about a week now, and I think I have the launch vehicle family to do the job. Now I just have to choose which one I like best. Each one of these vehicles is rated very near it\u0027s maximum payload to 100km LKO, and requires precise flying to achieve orbit with it\u0027s rated payload. The test payloads are a stack of 4 ton Kethane refiners with a 0.5 ton probe core attached. I use a combination of MechJeb and hand-flying to make sure they get where they need to be. Also, while the first stage cores all get re-entry flames, they only hit the lower atmosphere at ~1400m/s and Deadly Re-entry doesn\u0027t even bring up a heat meter. Without further ado, the Winter series of launch vehicles:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFlurry MRLV\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe Flurry launch vehicle was designed specifically to carry the Kraken Crew Service Vehicle into orbit, and as such features single engine-out capability* and extra fuel in the second stage. The Flurry is also the first of it\u0027s kind in reusable launch vehicles, recovering it\u0027s stretched Crystal boosters by parachute splash-down and the first stage by propulsive landing in the Kerban Ordinance Test Range, 360 kilometers east of KSC. \u003C/p\u003E\u003Cp\u003EKerb-Rated\u003C/p\u003E\u003Cp\u003EPayload to LKO: 11.5 T (12.5% derated)\u003C/p\u003E\u003Cp\u003EFuel Load: 88 T\u003C/p\u003E\u003Cp\u003EMass Fraction: 10.22\u003C/p\u003E\u003Cp\u003EFuel Usage per Tonne Payload: 7.65 T\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 130 T\u003C/p\u003E\u003Cp\u003ELiftoff Thrust: 1690 kN\u003C/p\u003E\u003Cp\u003ETWR @ Liftoff: 1.33\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm6.staticflickr.com/5531/9478107586_d3ae5d0315_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5531/9478107586_4e09289b34.jpg\u0022 alt=\u00229478107586_4e09289b34.jpg\u0022\u003E\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm3.staticflickr.com/2836/9475592531_e5587d24f0_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2836/9475592531_ff7565a011_m.jpg\u0022 alt=\u00229475592531_ff7565a011_m.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm3.staticflickr.com/2879/9475593105_8ef7a66c39_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2879/9475593105_a1bc764b2e_m.jpg\u0022 alt=\u00229475593105_a1bc764b2e_m.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm6.staticflickr.com/5450/9475592285_53766a0858_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5450/9475592285_991614e568_m.jpg\u0022 alt=\u00229475592285_991614e568_m.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm6.staticflickr.com/5520/9475592019_c32afe61e0_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5520/9475592019_e8b99035d3_m.jpg\u0022 alt=\u00229475592019_e8b99035d3_m.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm8.staticflickr.com/7446/9475596259_57f5968a96_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7446/9475596259_339fe390b4_m.jpg\u0022 alt=\u00229475596259_339fe390b4_m.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm4.staticflickr.com/3757/9478381520_116cee7131_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3757/9478381520_733d27439e_m.jpg\u0022 alt=\u00229478381520_733d27439e_m.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E*Flavor text only\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKraken Crew Service Vehicle\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe Kraken CSV is the workhorse of Kerbin\u0027s kerb-rated vehicles, putting up to seven kerbals comfortably into the arms of an awaiting station or ship. The Kraken is not designed to be long-term habitation for it\u0027s inhabitants, and relies on existing architecture to support it\u0027s crew for long-term missions. The KCSV can be launched unmanned as a contingency or lifeboat to larger craft and stations. A modification to the original design, the Long Range Rescue and Resupply variant, has been designed for missions requiring up to 1000m/s extra dV or supply delivery to LKO. V4 now includes reusable Flurry Reusable MLV.\u003C/p\u003E\u003Cp\u003ECrew: 2-7\u003C/p\u003E\u003Cp\u003EOn Orbit dV: 200m/s Hypergolic, 200m/s Monopropellant\u003C/p\u003E\u003Cp\u003EService Ceiling: 150km circular equatorial\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Flurry MRLV\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm6.staticflickr.com/5505/9478110244_758307d237_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5505/9478110244_f5c6a5a240.jpg\u0022 alt=\u00229478110244_f5c6a5a240.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://farm4.staticflickr.com/3667/9475321351_ce1662e6da_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7300/9475319441_f2a7dcfd01.jpg\u0022 alt=\u00229475319441_f2a7dcfd01.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESnowstorm HRLV\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAs Kerban scientists became more and more ambitious in their persuit of lofty goals and loftier space stations, station modules being dreamt up by engineers became too heavy for the Flurry to lift. Instead of giving up on the Flurry design, engineers simply stuck to the Kerbal tradition of MOAR BOOSTERS! The core of the Snowstorm is similar in tankage to the Flurry, though slightly larger, and the boosters are Flurry first stages used in their entirety with nosecones. Like the Flurry, much of the Snowstorm is reusable - both boosters and core are designed to land propulsively. The core makes the hop to the KOTS, while the boosters brake and return to KSC.\u003C/p\u003E\u003Cp\u003EPayload to LKO: 20 T\u003C/p\u003E\u003Cp\u003EFuel Load: 136 T\u003C/p\u003E\u003Cp\u003EMass Fraction: 10.05\u003C/p\u003E\u003Cp\u003EFuel Usage per Tonne Payload: 6.8 T\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 201 T\u003C/p\u003E\u003Cp\u003ELiftoff Thrust: 3160 kN\u003C/p\u003E\u003Cp\u003ETWR @ Liftoff: 1.64\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm4.staticflickr.com/3667/9475321351_ce1662e6da_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3667/9475321351_5fe33f34a7.jpg\u0022 alt=\u00229475321351_5fe33f34a7.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESquall HRLV\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEvolved from the Snowstorm launch vehicle, the Squall uses four standard length Crystal satellite booster first stages as long-burn boosters, adding 400kN of liftoff thrust to the Snowstorm design. This in turn allows the use of a heavier second stage, doubling both it\u0027s thrust and fuel capacity. The new design allows for an improved mass to orbit ratio of 9.16 over the Snowstorm\u0027s 10.05. Like the Snowstorm, the first stage and main boosters are propulsively landed for reuse. The Crystal boosters are light enough to be recovered under parachute and splashed down. Feasibility tests are underway to determine if sustainer recovery is possible.\u003C/p\u003E\u003Cp\u003EPayload to LKO: 28 T\u003C/p\u003E\u003Cp\u003EFuel Load: 176 T\u003C/p\u003E\u003Cp\u003EMass Fraction: 9.16\u003C/p\u003E\u003Cp\u003EFuel Usage per Tonne Payload: 6.29 T\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 261 T\u003C/p\u003E\u003Cp\u003ELiftoff Thrust: 4020 kN\u003C/p\u003E\u003Cp\u003ETWR @ Liftoff: 1.57\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://farm4.staticflickr.com/3698/9475322301_3243067908_o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3698/9475322301_478891c3c0.jpg\u0022 alt=\u00229475322301_478891c3c0.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI will update later with pictures of the launch and recovery of the propulsively landed stages of each vehicle.\u003C/p\u003E\u003Cp\u003ETo Be Continued....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-10T09:08:42Z\u0022 title=\u002208/10/2013 09:08  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 10, 2013\u003C/time\u003E by SRFirefox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-10T18:35:00Z","Content":"\n\u003Cp\u003EI have an absolute ton of mods installed. I would like to put B9 back in but with the current version of kerbal\u0027s memory management it would force me to remove too much else. In no particular order I use:\u003C/p\u003E\u003Cp\u003ENovapunch\u003C/p\u003E\u003Cp\u003EAies\u003C/p\u003E\u003Cp\u003EKAS\u003C/p\u003E\u003Cp\u003EFusTek\u003C/p\u003E\u003Cp\u003EMechjeb\u003C/p\u003E\u003Cp\u003EEngineer\u003C/p\u003E\u003Cp\u003EInfernal Robotics\u003C/p\u003E\u003Cp\u003ELackluster Labs (LLL)\u003C/p\u003E\u003Cp\u003EAviation Lights\u003C/p\u003E\u003Cp\u003EHOME\u003C/p\u003E\u003Cp\u003EDroman Rubberband Tracks\u003C/p\u003E\u003Cp\u003ESubassembly Manager\u003C/p\u003E\u003Cp\u003EKethane\u003C/p\u003E\u003Cp\u003EAnd prolly a few others...lol\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-10T19:37:11Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure Novapunch would be the highest memory usage of those, though from what I\u0027ve read B9 is optimized in a couple of ways to minimize that. Swapping out Nova for B9 should save you some memory. Note, I don\u0027t speak from experience. I haven\u0027t used both at the same time, and in fact haven\u0027t used Novapunch that much.\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-10T21:32:25Z","Content":"\n\u003Cp\u003EFor this one I really like novapunch. I had a really extreme spaceplane mothership that I built with B9 (it had to be assembled in space) but it wont work very well for this mission. I\u0027ll probably swap nova for B9 after this one, and just keep the nova landing gear set.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-10T23:03:04Z","Content":"\n\u003Cp\u003EI might try Nova or B9 if I try this again. Right now I\u0027m on the verge of \u0027mission execution=1\u0027. I\u0027ve done most of the unique missions (after a few minor redesigns once I went back to all ioncross rather than part ioncross part RCS supply) but still haven\u0027t done the initial DTS station since the changes. After redesigning the transfer rovers they do have a couple of seats each on the back, but it\u0027s just short term Kerbal seating. No life support. Also I changed from one rover landing to two on a landing frame which works well... but weighs more. I\u0027m not sure I can fit two heatshields on that package that launches the rovers and the orbital tug. May have to see if I can redesign the heatshield... or maybe look up the inflatable ones. (EDIT: even though there now are piloted rovers there aren\u0027t even enough seats in the plan to account for 25%, let alone 50% of the Kerbals having seats on rovers, so that achievement is still at zero)\u003C/p\u003E\u003Cp\u003EDoes anyone know if the inflatable heatshields from Deadly re-entry work outside of that mod? Just inflation with no heat effects?\u003C/p\u003E\u003Cp\u003E(Edit: I may still want to try the inflatable heatshields, but I have managed to get a dockable heatshield down to 3.47tons. With the Scout ITV I think I can stack three on launch which should keep things going for later on)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T00:17:20Z\u0022 title=\u002208/11/2013 12:17  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"meyst","CreatedById":59881,"CreatedDateTime":"2013-08-11T01:35:55Z","Content":"\n\u003Cp\u003EI decided that it would be a good idea to test my method of docking to landed supply craft on Duna to make sure it works the same with the different gravity. Also seemed a good idea to get some practice before posting my finalized plan seeing as I have orbited but never landed on Duna. So I sent two supply craft and a supply recovery rover. \u003C/p\u003E\u003Cp\u003EResult are not encouraging. The rover was looking good as it came in, dumped its heat shield, deployed parachutes and proceeded to have one parachute come off while the other ripped the rover in half before most of it landed at a \u0027gentle\u0027 200 m/s. Supply craft #1 came in over the north pole. I was expecting all that white to be a giant glacier, instead I discovered a mountain range of ice before going into the side of a mountain at over 4000 meters altitude. Supply craft #2 used too much fuel to avoid terrain and was scattered across the surface of Duna after running out of landing fuel just before touchdown.\u003C/p\u003E\u003Cp\u003EWith Duna winning 3 zip I have been re examining assumptions, hardware and overall plans. I intended to get points for having a robust mission architecture before but Now... \u003C/p\u003E\u003Cp\u003EThese pictures I got from Wikipedia sum it up nicely.\u003C/p\u003E\u003Cp\u003EOld plan\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/7/7b/Outhouse%2C_Lake_Providence%2C_LA_IMG_7386.JPG\u0022 alt=\u0022Outhouse%2C_Lake_Providence%2C_LA_IMG_7386.JPG\u0022\u003E\u003C/p\u003E\u003Cp\u003ENew plan\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/b/b3/Poplar_Forest6.jpg\u0022 alt=\u0022Poplar_Forest6.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceK531","CreatedById":62535,"CreatedDateTime":"2013-08-11T01:47:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meyst\u0022 data-cite=\u0022meyst\u0022\u003E\u003Cdiv\u003E-snip-\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat outhouse is not made out of straw or twigs though\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-11T02:43:21Z","Content":"\n\u003Cp\u003ENote, on a lot of designs I\u0027ve had with sharp deceleration (on either engines or parachutes) simple attachments of struts usually will stop that at the cost of a few extra parts (no extra mass on current KSP, despite what the VAB says). I\u0027ve had wonderful designs, with perfect parachute systems, that just don\u0027t slow down quite enough on drogues, and when the final chutes open up... the engines disappear off into the sunset. Nice landing, but you\u0027re not taking off again! Similarly it looks silly for a load of chutes to hang in mid air, floating down while your craft plummets dramatically into the Duna landscape (OK, I know the chutes don\u0027t hover in mid air after they tear off, but they should!). Very artistic but not what we\u0027re looking for here!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T02:45:23Z\u0022 title=\u002208/11/2013 02:45  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-08-11T02:58:25Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EIn today\u0027s mission entry...\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EBob learns why he was sent to Duna\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELudlong gets a new assignment\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EParty at KSC with kookies and kake!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E...and much, MUCH more!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003EMission Entry 8 is posted in two parts: \u003C/em\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43260-Duna-Space-Program-or-Do-we-have-to-call-it-Death-Engineering?p=585763\u0026amp;viewfull=1#post585763\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003Ehere\u003C/em\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003E and \u003C/em\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43260-Duna-Space-Program-or-Do-we-have-to-call-it-Death-Engineering?p=586070\u0026amp;viewfull=1#post586070\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003Ehere\u003C/em\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003E.\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EFine print\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EDeath Engineering uses no part mods of any kind. The only mod being used for this challenge is Kerbal Alarm Clock. All flights are piloted otherwise \u0022manually\u0022. In order to account for \u0022supplies\u0022, jet-fuel is used for nearly all situations. The only exceptions are two instances when RCS fuel is used, and in these cases there are no RCS propulsion parts of any kind, in order to preserve supply continuity. Any supply is considered viable if:a) it can be reached within a reasonable time AND \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E it is stored in something that is powered. At no time in this mission has a supply been further away than a reasonable commute or a manageable walk. All calculations for supply management are being managed on a spreadsheet.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T04:55:40Z\u0022 title=\u002208/11/2013 04:55  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"}]}