{"TopicId":29003,"ForumId":25,"TopicTitle":"Duna Permanent Outpost Mission Architecture Challenge","CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-05-25T07:50:44Z","PageNum":26,"Articles":[{"CreatedByName":"meyst","CreatedById":59881,"CreatedDateTime":"2015-04-28T16:43:48Z","Content":"\n\u003Cp\u003EA great deal has been added and changed in the game since this challenge. I don\u0027t think a score from an entry now is directly comparable to the original entry scores.\u003C/p\u003E\u003Cp\u003EInstead of getting a mode to update the original post scores I think it may be better to start a refresh of the challenge and take advantage of the opportunity to updated the rules.\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2015-05-01T12:45:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meyst\u0022 data-cite=\u0022meyst\u0022\u003E\u003Cdiv\u003EA great deal has been added and changed in the game since this challenge. I don\u0027t think a score from an entry now is directly comparable to the original entry scores.\u003Cp\u003EInstead of getting a mode to update the original post scores I think it may be better to start a refresh of the challenge and take advantage of the opportunity to updated the rules.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with you meyst. A lot of the rules I like, even dividing the completions by ksp version would be interesting / useful. Did you see vosechu was working on a \u0027Realism Overhaul\u0027 \u0027Real Mars\u0027 challenge which includes a \u0027Stock Duna\u0027 component.\u003C/p\u003E\u003Cp\u003EI started evaluating if I should switch my current \u0027in progress\u0027 to 1.0. So far I\u0027ve figured a way I can work with the new overheat and explode or run at 30% thrust nukes. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113541-DeeplyDuna-Permanent-Outpost-Mission-Architecture-8-1-0-or-not-1-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/113541-DeeplyDuna-Permanent-Outpost-Mission-Architecture-8-1-0-or-not-1-0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0ik7Ngr.png\u0022 alt=\u00220ik7Ngr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-05-02T08:56:47Z","Content":"\n\u003Cp\u003EThis was an awesome challenge, I was really sad when I accidentally deleted my save halfway through my attempt.\u003C/p\u003E\u003Cp\u003EIt would be really cool if we could see a new challenge for 1.0 that incorporated the new ISRU in an interesting way.\u003C/p\u003E\n"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-07-07T18:44:46Z","Content":"\n\u003Cp\u003EWould it be okay if I have a Crew LV and a Cargo LV?\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2015-07-07T22:09:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VASMIR\u0022 data-cite=\u0022VASMIR\u0022\u003E\u003Cdiv\u003EWould it be okay if I have a Crew LV and a Cargo LV?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way I read the rules that would be fine - as long as you fit into the Kerbin launch constraints (you can put whatever you like on the launcher) and remember the scoring counts \u0027Kerbal days on Duna\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-07-08T00:57:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VASMIR\u0022 data-cite=\u0022VASMIR\u0022\u003E\u003Cdiv\u003EWould it be okay if I have a Crew LV and a Cargo LV?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I may add to what DBowman mentioned, you\u0027re fine as long as the only thing that leaves LKO that went up on the Crew LV is the crew - no other supplies or equipment from the Crew LV can leave LKO other than the crew, unless it counts as one of the launches covered by the launch vehicle rules. Good luck and welcome to the challenge!\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2015-07-08T06:40:18Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E I\u0027d read LV as \u0027landing vehicle\u0027 - but \u0027launch vehicle\u0027 make just as much - or more sense.\u003C/p\u003E\u003Cp\u003EIf you have doubts then maybe it\u0027s a good idea to post your plans for the first few launches (day, mass, payload description) so it\u0027s clear what you intend.\u003C/p\u003E\n"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-07-08T14:54:41Z","Content":"\n\u003Cp\u003EI\u0027m doing a IMIS 1968 style mission. Saturn MLV is almost ready.\u003C/p\u003E\n"},{"CreatedByName":"MathigNihilcehk","CreatedById":81703,"CreatedDateTime":"2015-07-21T19:06:07Z","Content":"\n\u003Cp\u003EWell, I\u0027ve finally started the challenge, after months of breaks... Yesterday I did about 10% of the execution...\u003C/p\u003E\u003Cp\u003EI actually got nauseous and had to stop playing. Where did that happen, might you ask? While piloting the darned rover, I built. I forgot to include an SAS module, so landing it was a pain, and I ended up 100km\u002B away from the landing site. I had saves to reload, but that would\u0027ve meant landing again. It was incredibly light weight, but also incredibly likely to flip over on the slightest bump on the road. I tried going 10m/s, but it\u0027d flip over within 1km. Eventually I tried going 3m/s, and it seems to work fine... but by then I was too sick to keep playing. I ended up turning on MechJeb\u0027s auto-pilot (which likes to flip over too) for 3m/s on 4x time acceleration and I left the room.\u003C/p\u003E\u003Cp\u003EUnfortunately for me, I don\u0027t have just one rover to do, but 10. Note to anyone attempting this challenge. \u003Cstrong\u003EADD SAS TO YOUR ROVERS!\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"MacGamer04","CreatedById":134081,"CreatedDateTime":"2015-07-22T21:31:42Z","Content":"\n\u003Cp\u003EI\u0027m thinking about doing this, and I was wondering if I could change the amount of SRB\u0027s on my launch vehicle. The core and upper stage is constant, but I don\u0027t want an overpowered vehicle for light loads, and I don\u0027t want and underpowered vehicle for heavy loads\u003C/p\u003E\n"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-07-26T17:45:55Z","Content":"\n\u003Cp\u003EThe IMIS mission will not qualify for the challenge, sadly. Still, the Martian looks fun to try. Only problem is that the cargo probes require separate launchers.\u003C/p\u003E\n"},{"CreatedByName":"MathigNihilcehk","CreatedById":81703,"CreatedDateTime":"2015-08-01T15:45:45Z","Content":"\n\u003Cp\u003ESeveral weeks, 55 hours of recording, and 181 Gigabytes later, and I\u0027ve FINALLY finished recording my attempt at the challenge.\u003C/p\u003E\u003Cp\u003EI\u0027ve compeleted everything by the rules, with the possible exception of flame effects. Considering how the new game rules seem far harsher, in regards to displaying flame effects, AND since the new rules will actually destroy your craft, if you suffer too much re-entry heat, I\u0027m going to kind of ignore the \u0022absolutely no flame effects\u0022 rule.\u003C/p\u003E\u003Cp\u003ETheoretically, if I had done a gravity assist off mun to get to duna, I\u0027d have had enough extra fuel to deorbit burn myself, instead of letting the atmosphere do it for me. I don\u0027t mind losing points on the execution, if we assume I completely failed (didn\u0027t try) the gravity assist, and therefore the plan is good, but my execution doesn\u0027t count. If I were doing the points, I\u0027d consider this a different version of KSP, deserving slightly different rules. Since the game can destroy your craft quite easily, if it doesn\u0027t actually burn up in the atmosphere, it didn\u0027t burn up in the atmosphere. That\u0027s up to the OP, though, not me. Heck, if the OP doesn\u0027t count my attempt at all, I probably won\u0027t care. I\u0027m happy with my attempt, at least.\u003C/p\u003E\u003Cp\u003EOh, and the Kerbals might have to ration their food a bit. Probably not, and definitely not according to my proposal, but perhaps on the actual mission. The dates given for duna transfer burns didn\u0027t exactly work for me. I\u0027ll have to double check the timing, though.\u003C/p\u003E\u003Cp\u003EIt\u0027ll be a few more weeks for me to take a look at editing this footage into... I don\u0027t know, something. I\u0027m thinking of cutting this into one succesful continuous video, and highlights of various failed attempts. Perhaps 5x-10x speed, correcting for time dilation, with overlayed commentary... Bah, I\u0027m no entertainer. I\u0027ll think of something, though. The straight-up recording was so boring, that even I didn\u0027t watch it, while recording it.\u003C/p\u003E\u003Cp\u003EAnyway, just saying that I will enter my attempt eventually... probably. It won\u0027t top the leader-boards, but it\u0027s on the order of 10,000 points, and there is a good reason I didn\u0027t have room for \u0022heatshields\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-08-01T16:55:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou have just been appointed as the Deputy Administrator of KSC for Missions to Duna \u003Cstrong\u003Eand Other Celestial Bodies which Start with \u0022D\u0022\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this include Dres? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MathigNihilcehk","CreatedById":81703,"CreatedDateTime":"2015-08-06T09:42:46Z","Content":"\n\u003Cp\u003EFinally, I\u0027ve posted the first video discussing my plan. If you prefer text, I\u0027ve included it here. The video is\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/D-grSRnTAuk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. I\u0027ll post some of the execution videos once I finish post-commentary and editing. It shouldn\u0027t take nearly as long as the opening video, as I won\u0027t edit as much. Enjoy!\u003Cp\u003EOverview:\u003C/p\u003E\u003Cp\u003EThis is my entry to the challenge. Included is a theoretical, and practical analysis of the challenge, a detailed design description of each component, a detailed mission outline for each mission, and a detailed report of the execution of each mission. I will also attempt to create a YouTube series that animates this to some degree.\u003C/p\u003E\u003Cp\u003EGoals:\u003C/p\u003E\u003Cp\u003E1: Be unique. We choose to go to duna and to do the other things not because they are easy, but because they are hard.\u003C/p\u003E\u003Cp\u003E2: Achieve everything. While I may not invent any new achievements, I seek to score all existing achievements.\u003C/p\u003E\u003Cp\u003E3: Be practical. One of the achievments is execution. A theoretically perfect design includes no structural support, excess fuel, and demands superhuman piloting. I can\u0027t execute that.\u003C/p\u003E\u003Cp\u003E4: Be realistic. I will bend some rules, and create harder rules to my entry, because some rules lead to unrealistic play.\u003C/p\u003E\u003Cp\u003E5: Be optimal. Everything else held equal, I want my challenge to get the most points it can. If that means cutting things close, then so be it.\u003C/p\u003E\u003Cp\u003ETheoretical Analysis:\u003C/p\u003E\u003Cp\u003ETo achieve the maximum number of points, you want to send the most kerbals to duna in the shortest time period possible. This depends on how many kerbals you can send and support in each launch window.\u003C/p\u003E\u003Cp\u003EThe most effective way to do this, is to launch an infinitely large rocket, with an infinite number of kerbals and food storages in the first launch. This will yield an infinite number of points. Unfortunately, this rocket can not be constructed in finite time.\u003C/p\u003E\u003Cp\u003ESince all launches must be equal, you can send the product of your launch size, and the number of launches into orbit. The number of launches you have depends on the time between launches, which depends on your launch size. In our scenario, we have up to day 739 to send mass to duna. We also have a bonus launch at day 10. So, this gives us a total number of launchers of Round down((739-10)/1.5*payload mass)\u002B1, or Round down(486/payload mass)\u002B1. The total mass sent to duna, is then payload mass*Round down(486/payload mass)\u002Bpayload mass.\u003C/p\u003E\u003Cp\u003EThe round down function is maximized for a serious of steps, where 486 mod payload mass = 0. For these steps, the equation simplifies to 486\u002Bpayload mass. For each step, there is also a distinct number of launches equal to (486/payload mass)\u002B1.\u003C/p\u003E\u003Cp\u003EThus, the lower the number, of launches, the higher your total payload to duna, which means the higher your total point score. For practical reasons, I am going to pick 7 launches. This gives us a maximum payload mass of 69.429.\u003C/p\u003E\u003Cp\u003ENow, the mass we can get to duna is less than this maximum payload. The change in velocity required to get to duna is at least 860dV. This is assuming that you create an intercept with mun, and gravity assist all the way to duna, and aerobrake in duna\u0027s atmosphere into a perfect landing. The best engine to use is the LV-N \u0022Nerv\u0022 Atomic Rocket Motor, which has a mass of 3, and a specific impulse of 800 s. \u003C/p\u003E\u003Cp\u003EAdditionally you are getting mass to duna in stages, assuming you use the launch windows. I\u0027d call that a safe assumption, since otherwise you use more mass, and may get there in more time. The first stage gets one launch (50-10), the second two (55\u002B228-10-104*2), the third two (55\u002B228*2-10-104*4), the fourth two (55\u002B228*3-10-104*6).\u003C/p\u003E\u003Cp\u003EUsing the rocket equation, this means we can get 860=9.81*800*ln(full mass/(full mass - fuel)). For the first case, this is 860=9.81*800*ln(69.429/(69.429 - fuel)) or 860=9.81*800*ln(69.429/(69.429 - fuel)), or a fuel mass of 7.206. This will take 8.75 mass for the fuel tanks, for a total mass to duna, less engine and fuel, of 57.679. For the other cases, this is 860=9.81*800*ln(69.429*2/(69.429*2 - fuel)) 14.41 or 16.25 using fuel tanks, thus we have a to duna mass of 119.608.\u003C/p\u003E\u003Cp\u003EWe also need mass for food. Each kerbal will spend 960 days in transit. Using the most space efficient food and realistic food, this is FL-R1 RCS Fuel Tank at 220.6 food per mass. If we wanted the most space efficient food, it\u0027d be PB-X150 Xenon Container at 5833.4 food per mass. In my opinion 100 grams is not a full day\u0027s worth of food. 400 grams, on the other hand, is reasonable, assuming you recycle 100% of your water. Anyways, assuming we utilize the 40 days of food in our rover and housing we get 4.17 mass per kerbal, for food.\u003C/p\u003E\u003Cp\u003EWe also need long term housing. The cheapest option, is for kerbals to live in a pair of EAS-1 External Command Seats, which duplicate as their rover. However, for realism sake, I\u0027ll pick something else. How about a pair of MK1 Lander Cans? MK3 Passenger Module? MK2 Crew Cabin? All would work, but I feel like all of those options would be kind of unrealistic. A more realistic option is the PPD-10 Hitchhiker Storage Container. It\u0027s roomy, spacious, and linked. It\u0027s quite large, and so I can EASILY see a couple of kerbals living years in one. However, this means it will require 1.25 mass per kerbal.\u003C/p\u003E\u003Cp\u003EFor the kerbals to get home, let\u0027s assume they are just lifting their storage container into orbit and then to ike. This is a dv of 1690, and using 24-77 \u0022twitch\u0022 liquid fuel engines(what I am actually using). This gives us 1690=9.81*290*ln(2.5\u002Bfuel/(2.5)) or 2.475 with fuel cans considered.\u003C/p\u003E\u003Cp\u003EThis gives us a grand total of 6.68 mass per kerbal, not including a lot of stuff. So, in the first trip we can get 8 kerbals, to duna, and during each subsequent trip, we can get 16, assuming we don\u0027t spread the food out. This gives us a theoretical score of 832*8\u002B717*16\u002B489*16\u002B261*16\u002B33*16 or 30,656.\u003C/p\u003E\u003Cp\u003EPractical Analysis\u003C/p\u003E\u003Cp\u003ENext up, the explanation for how NeilC gets larger than this score... he manufactured fuel on site. Basically, if you do that, you get to drop the food cost entirely, and you get 275% more kerbals per trip. This actually means that had NeilC found a way to do his mission with a 0 mass mining operation, and more improbably assumptions made in this calculation, he could\u0027ve scored 84304 points.\u003C/p\u003E\u003Cp\u003EObviously, at some point we have to stop making wild assumptions like \u0022If you could somehow get to duna by intercepting mun and using a gravity assist, it\u0027ll only cost 860 dV\u0022, because I am not building my entire program based on my capability of performing a perfect gravity assist off of Mun. Not even going to try for a gravity assist in the first place. I\u0027m pretty sure if I tried, I\u0027d end up spending more dV than I would\u0027ve just going straight to duna.\u003C/p\u003E\u003Cp\u003EAnyway, the process of actually designing a ship is, well, a process. Start with the theoretical max, include all the components, then ask yourself \u0022Am I missing something to actually launch this into space\u0022, like an engine, or a some way to connect the blob of parts I just stacked other than stacking them, or docking ports, or even a light. Instead of going through the whole process, I\u0027ll show the results.\u003C/p\u003E\u003Cp\u003EI\u0027ve created three modular ship types.\u003C/p\u003E\u003Cp\u003EThe first I call the Food Supplier. It consists of RCS cans to store 1870 food, nd a few RCS engines(with RCS fuel) to land. It\u0027s total mass is 9.7.\u003C/p\u003E\u003Cp\u003EThe second I call the Inhabitor. It has a hitchhiker housing unit, 360 units of fuel, and a bit of food.\u003C/p\u003E\u003Cp\u003EThe third I call rover. It has seating for four kerbals, and four scientific tools.\u003C/p\u003E\u003Cp\u003EAll three ship types include power generation, parachutes, wheels, and docking ports (except the rover).\u003C/p\u003E\u003Cp\u003EThese parts come together to make a primary payload and a secondary payload. The primary payload consist of two rovers, four inhabitors, and a food supplier, along with a pair of nuclear engines, liquid fuel, food, docking ports, and structural parts. The secondary payload consists of four food suppliers, excess fuel for the return trip, docking ports, and structural parts. Each tops out at just under 69.42 mass.\u003C/p\u003E\u003Cp\u003EThe launch schedule is as follows.\u003C/p\u003E\u003Cp\u003ELaunch and transfer schedule\u003C/p\u003E\u003Cp\u003EDay 10: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 55: Duna Transfer Window\u003C/p\u003E\u003Cp\u003EDay 114: Launch Window(Suppliers)\u003C/p\u003E\u003Cp\u003EDay 119: Duna arrival\u003C/p\u003E\u003Cp\u003EDay 218: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 283: Duna Transfer Window(3 Food)\u003C/p\u003E\u003Cp\u003EDay 322: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 347: Duna arrival\u003C/p\u003E\u003Cp\u003EDay 426: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 511: Duna Transfer Window(1 Food)\u003C/p\u003E\u003Cp\u003EDay 530: Launch Window(Suppliers)\u003C/p\u003E\u003Cp\u003EDay 575: Duna arrival\u003C/p\u003E\u003Cp\u003EDay 634: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 739: Launch Window(Base)\u003C/p\u003E\u003Cp\u003EDay 739: Duna Transfer Window(1 Food)\u003C/p\u003E\u003Cp\u003EDay 803: Duna arrival\u003C/p\u003E\u003Cp\u003EDay 843: Launch Window(Suppliers)\u003C/p\u003E\u003Cp\u003EDay 947: Launch Window(Suppliers)\u003C/p\u003E\u003Cp\u003EDay 951: Kerbin Transfer Window\u003C/p\u003E\u003Cp\u003EDay 967: Duna Transfer Window(5 food)\u003C/p\u003E\u003Cp\u003EDay 1015: Kerbin arrival\u003C/p\u003E\u003Cp\u003EDay 1031: Duna arrival\u003C/p\u003E\u003Cp\u003EDay 1051: Launch Window(Suppliers)\u003C/p\u003E\u003Cp\u003EDay 1155: Launch Window(Suppliers)\u003C/p\u003E\n"},{"CreatedByName":"Syhrus","CreatedById":64839,"CreatedDateTime":"2015-08-19T05:30:07Z","Content":"\n\u003Cp\u003EIs this challenge still alive? I\u0027m thinking of doing a new 1.0 mission with TAC...\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-08-21T18:08:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Syhrus\u0022 data-cite=\u0022Syhrus\u0022\u003E\u003Cdiv\u003EIs this challenge still alive? I\u0027m thinking of doing a new 1.0 mission with TAC...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile we haven\u0027t seen OP in quite some time, this challenge is as close to immortal as they come. You might not get on the leaderboard, but there are a few of us still participating and encourage new attempts. \u003C/p\u003E\u003Cp\u003ERegarding my own latest attempt... it was all a bad dream! Whew.. it was getting silly trying to complete this challenge under the restrictions of the BTSM mod. Will still be entering another submission, but going to be more of an extension of the AAP Challenge.\u003C/p\u003E\n"},{"CreatedByName":"Syhrus","CreatedById":64839,"CreatedDateTime":"2015-08-26T06:25:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Death Engineering\u0022 data-cite=\u0022Death Engineering\u0022\u003E\u003Cdiv\u003EWhile we haven\u0027t seen OP in quite some time, this challenge is as close to immortal as they come. You might not get on the leaderboard, but there are a few of us still participating and encourage new attempts. \u003Cp\u003ERegarding my own latest attempt... it was all a bad dream! Whew.. it was getting silly trying to complete this challenge under the restrictions of the BTSM mod. Will still be entering another submission, but going to be more of an extension of the AAP Challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps we should rejig the rules a little for 1.0 and start up again?\u003C/p\u003E\u003Cp\u003EHeck, make the goal a little different and aim for Laythe or something.\u003C/p\u003E\n"},{"CreatedByName":"MathigNihilcehk","CreatedById":81703,"CreatedDateTime":"2015-08-26T22:21:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Syhrus\u0022 data-cite=\u0022Syhrus\u0022\u003E\u003Cdiv\u003EPerhaps we should rejig the rules a little for 1.0 and start up again?\u003Cp\u003EHeck, make the goal a little different and aim for Laythe or something.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking of issuing a similar challenge, after I finish editing videos, for Mars Permanent Outpost... RSS style. I mean, the cool thing about that challenge, is if you could complete it, then theoretically someone could ACTUALLY set up a permanent base on mars for the same price... excluding the billion assumptions made that say all your mods === real life.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-08-26T23:39:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Syhrus\u0022 data-cite=\u0022Syhrus\u0022\u003E\u003Cdiv\u003EPerhaps we should rejig the rules a little for 1.0 and start up again?\u003Cp\u003EHeck, make the goal a little different and aim for Laythe or something.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MathigNihilcehk\u0022 data-cite=\u0022MathigNihilcehk\u0022\u003E\u003Cdiv\u003EI was thinking of issuing a similar challenge, after I finish editing videos, for Mars Permanent Outpost... RSS style. I mean, the cool thing about that challenge, is if you could complete it, then theoretically someone could ACTUALLY set up a permanent base on mars for the same price... excluding the billion assumptions made that say all your mods === real life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKinda torn.. I like the idea of reworking this challenge with attention to in-game costs and science achievements, but I\u0027m not into RSS and undecided on whether Laythe would make for a better goal. There\u0027s this challenge, as an option: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/115535-From-Duna-to-Mars-Realism-Challenge\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/115535-From-Duna-to-Mars-Realism-Challenge\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf I were to author a re-worked \u0022Permanent Outpost\u0022 challenge, I\u0027d be more inclined to stick with stock SS/Duna..\u003C/p\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2015-08-27T03:44:17Z","Content":"\n\u003Cp\u003EI like stock also, apart from anything it\u0027s much more approachable and will have more participants. Duna has a special \u0027romance\u0027 as a Mars analog also.\u003C/p\u003E\u003Cp\u003EI like the launch constraints from this challenge, maybe they are \u0027too generous\u0027. You could imagine having the same launch constraints and a few (any?) alternate destinations.\u003C/p\u003E\u003Cp\u003EI think the current \u0027kerbal duna day\u0027 scoring forces a particular kind of entry, i.e. as big as you can as early as you can. I tried to make a \u0027realistic\u0027 science oriented scoring system for \u0027From Duna to Mars\u0027, not sure how well it would actually work.\u003C/p\u003E\n"}]}