{"TopicId":29498,"ForumId":24,"TopicTitle":"Hi Kerbs!","CreatedByName":"FirstyB","CreatedById":64619,"CreatedDateTime":"2013-05-27T11:28:54Z","PageNum":1,"Articles":[{"CreatedByName":"FirstyB","CreatedById":64619,"CreatedDateTime":"2013-05-27T11:28:54Z","Content":"\n\u003Cp\u003EHi all, I\u0027ve been a long time reader of the forums here, and thought it was eventually time to finally poke my head out of the darkness and say hello \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing for a few months now, and after an extremely steep learning curve i think i can finally fly without inexplicable explosions \u003Cem\u003Emost \u003C/em\u003Eof the time now.. I\u0027m doing a PhD at the moment designing drilling tools for mars, so i can at least pretend any time spent playing this awesome game classifies as \u0027research\u0027... (Kethane drilling anyone?? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E).\u003C/p\u003E\u003Cp\u003EAfter attempting to clear out all my outdated mods with the 0.20 release (resulting in an accidental wipe of everything I\u0027ve done so far), i\u0027ve now decided to go all out and attempt Zekes\u0027 KSP Grandmaster challenge, putting a Kerbinaught on every celestial body. Expect an update on that at some point in the future.\u003C/p\u003E\u003Cp\u003EFinally, a quick question. When putting flags down, has anyone else found that they can point it only in one of two directions? Are they only able to go east to west, and is there any way around this?\u003C/p\u003E\u003Cp\u003ECheers everyone!\u003C/p\u003E\n"},{"CreatedByName":"austin4050","CreatedById":66368,"CreatedDateTime":"2013-05-27T11:52:29Z","Content":"\n\u003Cp\u003EWelcome to the forums! Have fun and enjoy KSP! Glad to see you \u0022out of the darkness\u0022! Do not be afraid to post bugs and suggestions in their correct forum. Have fun landing!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-27T13:17:20Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}