{"TopicId":29692,"ForumId":16,"TopicTitle":"Anyone else wondering where this \u0026quot;Filter Parts List\u0026quot; feature is from the Patch Notes?","CreatedByName":"Glockshna","CreatedById":32859,"CreatedDateTime":"2013-05-28T04:07:23Z","PageNum":1,"Articles":[{"CreatedByName":"Glockshna","CreatedById":32859,"CreatedDateTime":"2013-05-28T04:07:23Z","Content":"\n\u003Cp\u003EAm I the only one wondering where this: (red box) is? \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://img.techpowerup.org/130528/Glockshna_pix071.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://img.techpowerup.org/130528/Glockshna_pix071.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s no search keybinding and no button that I\u0027ve seen anywhere... Any ideas on this? I want it so bad.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-28T04:10:53Z","Content":"\n\u003Cp\u003EI believe it is implemented partially in that when you first enter the VAB/SPH, only some parts are available. The devs may include a search bar later on when the amount of parts increases to something more manageable.\u003C/p\u003E\n"},{"CreatedByName":"Glockshna","CreatedById":32859,"CreatedDateTime":"2013-05-28T04:18:12Z","Content":"\n\u003Cp\u003EWell, with the advent of mods (and it\u0027s pretty safe to say most people have parts packs installed) a search bar sooner rather than later would be very nice.\u003C/p\u003E\u003Cp\u003EI suppose there are mods for that though.\u003C/p\u003E\n"},{"CreatedByName":"Finnerty","CreatedById":61457,"CreatedDateTime":"2013-05-28T04:33:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Glockshna\u0022 data-cite=\u0022Glockshna\u0022\u003E\u003Cdiv\u003EAm I the only one wondering where this: (red box) is? \u003Cp\u003E\u003Ca href=\u0022http://img.techpowerup.org/130528/Glockshna_pix071.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://img.techpowerup.org/130528/Glockshna_pix071.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s no search keybinding and no button that I\u0027ve seen anywhere... Any ideas on this? I want it so bad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you are in the VAB and building a ship, the greyed-out parts in the parts lists is the filtering. Parts you can\u0027t begin building with are greyed-out, so you can\u0027t select them to start with.\u003C/p\u003E\u003Cp\u003EAnd I think that is it, that\u0027s all it is, greyout boxes that you can\u0027t use.\u003C/p\u003E\n"},{"CreatedByName":"jeti140973","CreatedById":61447,"CreatedDateTime":"2013-05-28T05:29:00Z","Content":"\n\u003Cp\u003EThe filter was explained in Harvesters blog entry \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entry.php/350-Seats-Pods-and-Other-Parts\u0022 rel=\u0022external nofollow\u0022\u003ESeats, Pods and Other Parts\u003C/a\u003E. We are just seeing the first steps, and it will probably be extended in later updates.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E[...] you can see that parts that aren\u0027t allowed are greyed out. This is a new system we cooked up, that I have to say I\u0027m very excited about. Excited as only a code geek can get about managing enumerated collections of data, which is saying something both about the geekiness involved, and the level of excitement.\u003Cp\u003EIn a nutshell, the parts list is now equipped with two \u0027filter stacks\u0027. One for excluding parts off the list, and another for greying them out. The cool thing about this is that these filters are completely arbitrary. That is, the parts list doesn\u0027t know what the filtering criteria are, it just applies and combines all of them, to produce a list of parts that matches all of them.\u003C/p\u003E\u003Cp\u003ESo, now when you have zero parts in your editor build area, the editor logic files the \u0022rootPartsOnly\u0022 filter, which sets a requirement for parts, saying only parts that allow both stacking and surface attachment are valid. This causes all other parts to become grey, and to show the reason why they\u0027re grey on their tooltips.\u003C/p\u003E\u003Cp\u003EEach filter has a \u0022reason\u0022 it writes to parts that fail to meet the criteria. If a part is culled by more than one filter, the reasons will accumulate. So if your part can\u0027t be used as a first part, and on top of that, you wouldn\u0027t be able to afford it, the part will tell you both reasons why you\u0027re not able to pick it.\u003C/p\u003E\u003Cp\u003EThe second stack of filters is more straightforward. That\u0027s the exlusion filter. It\u0027s applied in much the same way, with filters that add criteria parts must meet, but instead of greying them out, the part is completely omitted off the list. This is useful for things like guided tutorials, where we only want a few parts to be shown at a time, and also later for when we have R\u0026amp;D implemented, to hide away parts you haven\u0027t researched yet.\u003C/p\u003E\u003Cp\u003EAll in all, a very useful addition.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}