{"TopicId":29737,"ForumId":34,"TopicTitle":"[0.20] Deadly Reentry 2.3 - reentry heat, plus thermal and g-force damage to parts","CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T11:37:19Z","PageNum":26,"Articles":[{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2013-08-08T14:03:41Z","Content":"\n\u003Cp\u003EI must be doing something wrong I have yet to get a craft or debris to overheat or blow up from g\u0027s. I get temp effects, and shielding ablation during reentry, but no boom even on unshielded junk falling in.\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-08-08T14:24:43Z","Content":"\n\u003Cp\u003EThe easy way to test the over-g is to create a rocket with a TWR of greater than 5:1. Launch at full throttle and watch the g-meter. Stuff should start exploding rather quickly.\u003C/p\u003E\u003Cp\u003ETo test the reentry, i\u0027ve found that short, sub-orbital flights don\u0027t get you the speeds required to over-heat stuff. You need to get up to a full orbit and then retro back down. If you\u0027re getting shield ablation, i would say it\u0027s working correctly though. You might just be doing something right and not wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-08-08T16:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jasmir\u0022 data-cite=\u0022Jasmir\u0022\u003E\u003Cdiv\u003EThe Problem is, this PE value is completly addicted to the mass, the drag and the stability(aerodynamic* and g-forces) of the vessel (and, of course, the incoming speed). So this PE will will just work for this POD at this speed.\u003Cp\u003E*Large Vessels tend to flipp over if you go to steep into the atmosphere. If this occur in the \u0022hot\u0022 reentry-phase, bad things will happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, it\u0027s always going to be vessel-specific, but the Mk1-2 pod is a good starting point. It\u0027s small and dense and simple. If you\u0027ve got less mass or more surface area, you can aim for a higher altitude. If you\u0027ve got more mass and a smaller area... you\u0027ll probably want to add enough fuel for some sort of deceleration burn before hitting atmo.\u003C/p\u003E\u003Cp\u003EFor large crafts that want to spin around, you have to specifically build your reentry stage so that the center of mass is below the vertical halfway point of your ship. I had this same issue with my 60-ton Duna lander -- I was doing multiple tests around Kerbin and it took several revisions to get the CoM low enough before I sent it to (and successfully aerobraked/landed on) Duna.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve got the B9 parts installed, there\u0027s a fantastic airbrake you can put on the upper part of the re-entry vessel -- those will help keep it pointed in the right direction, and they\u0027re great for bleeding off a lot of speed in thin atmospheres.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T16:22:48Z\u0022 title=\u002208/08/2013 04:22  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by jrandom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2013-08-08T18:28:23Z","Content":"\n\u003Cp\u003EDoes this mod work for 0.21? I\u0027m thinking of getting it.\u003C/p\u003E\n"},{"CreatedByName":"birrhan","CreatedById":62148,"CreatedDateTime":"2013-08-08T18:41:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrandom\u0022 data-cite=\u0022jrandom\u0022\u003E\u003Cdiv\u003EAgain, entering Kerbin\u0027s SOI with a speed of 2000m/s, hitting 70km at 3800m/s.\u003Cp\u003EPeriapsis 20km: Total destruction of the pod. The heatshield overheats and explods, with the pod following shortly thereafter.\u003C/p\u003E\u003Cp\u003EPeriapsis 26.5km: We have a winner! Pod survives and winds up with an orbit of 25.7km x 6968km. 2/3rds of the ablating shield are left.\u003C/p\u003E\u003Cp\u003ESo when coming in that fast, 30km is too high and 20km is too low. The reentry window is around 26.5km but I don\u0027t know how narrow that window is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcellent work! Good to know that 3800 m/s is survivable. I am definitely trying this. For reference, your reentry mass was 6 tons or less, correct (IonCross/DRE equipment, with an SAS and parachutes on an Mk1-2 pod)?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFull reentry on the second orbit. Unfortunately, IonCross drained the rest of my battery power so I couldn\u0027t deploy chutes, but had I added a second battery, it\u0027s totally survivable. G-forces never went over 2-something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo RTG on the command pod? Now that ASAS requires constant power to maintain heading, I never leave home without one.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-08-08T19:44:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022birrhan\u0022 data-cite=\u0022birrhan\u0022\u003E\u003Cdiv\u003EExcellent work! Good to know that 3800 m/s is survivable. I am definitely trying this. For reference, your reentry mass was 6 tons or less, correct (IonCross/DRE equipment, with an SAS and parachutes on an Mk1-2 pod)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the bottom: Heat Shield -\u0026gt; Pod -\u0026gt; Battery -\u0026gt; Drogue Chute. Three radial regular chutes are attached just below the drogue chute.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENo RTG on the command pod? Now that ASAS requires constant power to maintain heading, I never leave home without one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could never find a good place to attach it. We need inline RTGs in 1.25, 2.5, and 3.75 sizes. However, the craft that the pod is attached to right up until re-entry is built with plenty of battery power and solar cells, so really I just need to slap a second battery under the drogue chute and I\u0027m good to go.\u003C/p\u003E\u003Cp\u003EActually... I\u0027ll have to double-check the CO2 capacity of the Mk1-2 -- I might be able to get away with simply shutting off the CO2 scrubber when starting that second orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T23:30:08Z\u0022 title=\u002208/08/2013 11:30  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by jrandom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-08-08T21:43:45Z","Content":"\n\u003Cp\u003EI just started using Ioncross and by my calculations, you should be good for 10 hours without the scrubber. So if you can make sure you don\u0027t skip out of the atmosphere, you don\u0027t need to switch it on. If I didn\u0027t miscalculate, you need 166,66 of power to use the scrubber to clean out the 30 maximum CO2 of the pod. The pod has 150 power, and a mini battery ring on top gives another 200, so you can go more than 30 hours with that. Which should be enough for a large orbit after aerobraking.\u003C/p\u003E\u003Cp\u003EI also find I don\u0027t really need SAS for the reentry. Before the atmosphere gets thick, the SAS doesn\u0027t fight much, so it should use almost no power. Once reentry really gets going, the pod orients itsself on it\u0027s own (at least with FAR). I usually only use shield, pod, docking port and three sidemounted parachutes, and never ran out of power so far.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-08-08T22:05:11Z","Content":"\n\u003Cp\u003EYep, you\u0027ll notice my re-entry test pod has no extra SAS added. And since this was just a quick test before going to bed, I didn\u0027t do any CO2 and battery power calculations.\u003C/p\u003E\u003Cp\u003EWhen I do full-blown missions, I sit down and work all those numbers out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"birrhan","CreatedById":62148,"CreatedDateTime":"2013-08-09T00:13:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrandom\u0022 data-cite=\u0022jrandom\u0022\u003E\u003Cdiv\u003EFrom the bottom: Heat Shield -\u0026gt; Pod -\u0026gt; Battery -\u0026gt; Drogue Chute. Three radial regular chutes are attached just below the drogue chute.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI imagine at that speed you need each chute. From a 80 x 80 km orbit, setting Pe to ~0, I can get a similar pod through firey reentry, deploy two radial chutes, and decelerate to 160-180 m/s at around 500 m before they fill and come to a near stop. Most things are damaged, and the SAS and/or docking port may get destroyed, but everything else survives. The problem I tend to have with the drogue is finding a place for it on the command pod if I also put on a docking port.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-08-09T00:20:40Z","Content":"\n\u003Cp\u003EI\u0027ve done tests with the Mk1 in a simple configuration: Mk16,Oct2,Mk1 and I can come in at Kerbin escape velocity anywhere in the 0-34km Pe range and only burn through about 40% of the shield. The Mk1-2 pod however I burn through the whole shield every time even for gentle 60x10 reentries (yes I know low angle is more heat). However the capsule temp peaks at ~1100 or so and I\u0027m fine. It feels like many max temps are too low since I can reenter without a shield and just suffer the heat.\u003C/p\u003E\n"},{"CreatedByName":"Moose","CreatedById":34007,"CreatedDateTime":"2013-08-10T16:08:48Z","Content":"\n\u003Cp\u003EHas anyone managed to solve the problem that the inflatable heat shield always drags the ship so it faces the wrong way? I\u0027ve got a functional design for a ship but the fact that I can\u0027t use that shield it means aerobreaking is a no go.\u003C/p\u003E\u003Cp\u003ESearched the topic, either I failed or the search did!\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-08-10T20:17:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moose\u0022 data-cite=\u0022Moose\u0022\u003E\u003Cdiv\u003EHas anyone managed to solve the problem that the inflatable heat shield always drags the ship so it faces the wrong way? I\u0027ve got a functional design for a ship but the fact that I can\u0027t use that shield it means aerobreaking is a no go.\u003Cp\u003ESearched the topic, either I failed or the search did!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t tried that head shield yet, but I know that if your center of mass is above the halfway point of whatever is reentering, it\u0027ll flip around. If you have a ton of drag on the entering side but not the opposite side, you\u0027ll \u003Cem\u003Ealso\u003C/em\u003E flip around.\u003C/p\u003E\u003Cp\u003EIf you need a quick fix, the B9 Aerospace air brake pieces are \u003Cem\u003Egreat\u003C/em\u003E for keeping your craft pointed the right way.\u003C/p\u003E\n"},{"CreatedByName":"Jasmir","CreatedById":76744,"CreatedDateTime":"2013-08-10T21:10:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moose\u0022 data-cite=\u0022Moose\u0022\u003E\u003Cdiv\u003EHas anyone managed to solve the problem that the inflatable heat shield always drags the ship so it faces the wrong way? I\u0027ve got a functional design for a ship but the fact that I can\u0027t use that shield it means aerobreaking is a no go.\u003Cp\u003ESearched the topic, either I failed or the search did!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPersonally, i use such a heatshield on _both_ ends of my big vessels. Also, i take a very smooth angle of entry, so i\u0027ll won\u0027t get a big difference between \u0022retrograde\u0022 and \u0022angle of attack\u0022 during the hot phase. My vessels now still flipp over after the hot entry phase, but this help a much to get rid of this heatshields after they have done their jobs.\u003C/p\u003E\n"},{"CreatedByName":"Moose","CreatedById":34007,"CreatedDateTime":"2013-08-10T23:54:04Z","Content":"\n\u003Cp\u003EAh thankyou. I\u0027ll see if I can play around. Trying to avoid B9 if I can for now, though.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-08-11T00:32:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moose\u0022 data-cite=\u0022Moose\u0022\u003E\u003Cdiv\u003EAh thankyou. I\u0027ll see if I can play around. Trying to avoid B9 if I can for now, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny particular reason? It\u0027s one of the very few parts mods I kept out of all that I\u0027ve tried -- very balanced, fits right in with all the rest of the pieces, and downright \u003Cem\u003Enecessary\u003C/em\u003E if you build planes of any kind.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-08-12T19:38:57Z","Content":"\n\u003Cp\u003EThe zip-file is somewhat stuffed with files and doubled folders - what do I really need?\u003C/p\u003E\n"},{"CreatedByName":"boberts314","CreatedById":69216,"CreatedDateTime":"2013-08-12T20:17:50Z","Content":"\n\u003Cp\u003EA question for those of you better acquainted with how this mod works: Is it hypothetically possible to install Deadly Reentry without using Module Manager, or is MM being used for more than .cfg file editing here?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrandom\u0022 data-cite=\u0022jrandom\u0022\u003E\u003Cdiv\u003EAny particular reason? It\u0027s one of the very few parts mods I kept out of all that I\u0027ve tried -- very balanced, fits right in with all the rest of the pieces, and downright \u003Cem\u003Enecessary\u003C/em\u003E if you build planes of any kind.\u003C/div\u003E\u003C/blockquote\u003EI actually consider the B9 parts to be kind of overpowered. The weights are about right I think, but the amount of fuels that the assorted parts carry seems sometimes almost comical compared to vanilla parts of the same volume. I\u0027m thinking that when the tech tree comes out I will put them toward the top.\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-08-12T23:56:22Z","Content":"\n\u003Cp\u003EI believe the reentry effects depend on MM\u003C/p\u003E\u003Cp\u003E@REENTRY_EFFECTS[Default]:Final\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E @heatMultiplier = 25\u003C/p\u003E\u003Cp\u003E @startThermal = 750\u003C/p\u003E\u003Cp\u003E @fullThermal = 1150\u003C/p\u003E\u003Cp\u003E @temperatureExponent = 1.03\u003C/p\u003E\u003Cp\u003E @densityExponent = 0.85\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\n"},{"CreatedByName":"boberts314","CreatedById":69216,"CreatedDateTime":"2013-08-13T23:30:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frederf\u0022 data-cite=\u0022Frederf\u0022\u003E\u003Cdiv\u003EI believe the reentry effects depend on MM\u003Cp\u003E@REENTRY_EFFECTS[Default]:Final\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E @heatMultiplier = 25\u003C/p\u003E\u003Cp\u003E @startThermal = 750\u003C/p\u003E\u003Cp\u003E @fullThermal = 1150\u003C/p\u003E\u003Cp\u003E @temperatureExponent = 1.03\u003C/p\u003E\u003Cp\u003E @densityExponent = 0.85\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan the file containing those lines not be edited manually then?\u003C/p\u003E\u003Cp\u003EI\u0027m in a conversation with some forumites who feel that MM shouldn\u0027t be used by modmakers. I\u0027m trying to understand their complaints, although the arguments seem questionable to me.\u003C/p\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2013-08-14T00:47:50Z","Content":"\n\u003Cp\u003EI\u0027d like to increase g-tolerance of parts, but reduce thermal tolerance of non-heatshields. How should I edit the .cfg?\u003C/p\u003E\u003Cp\u003EAlso, it seems odd to me that the fastest rate of AblativeShield depletion isn\u0027t at max temperature, but rather at max deceleration. The shield is keeping the rest of the craft cooled by burning itself off, after all.\u003C/p\u003E\n"},{"CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-08-14T02:06:06Z","Content":"\n\u003Cp\u003EI think it\u0027s this mod making noises while attaching parts in symmetry in the VAB. Any fix for that?\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-08-14T18:30:34Z","Content":"\n\u003Cp\u003ESo is there any reason my normally designed rocket gets G-Force damage \u003Cem\u003Ebefore takeoff\u003C/em\u003E? It\u0027s really starting to piss me off.\u003C/p\u003E\u003Cp\u003EScreenshot of rocket:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot745.png\u0022 alt=\u0022screenshot745.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T18:38:04Z\u0022 title=\u002208/14/2013 06:38  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by Nutt007\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2013-08-14T18:54:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boberts314\u0022 data-cite=\u0022boberts314\u0022\u003E\u003Cdiv\u003EA question for those of you better acquainted with how this mod works: Is it hypothetically possible to install Deadly Reentry without using Module Manager, or is MM being used for more than .cfg file editing here?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is hypothetically possible to install anything using MM without using MM.\u003C/p\u003E\u003Cp\u003EThat being said, it requires you to redistribute other people\u0027s work, as well as meaning that mod compatibility gets rather hairy (you have to manually fix config files)\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-08-15T19:43:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeroignite\u0022 data-cite=\u0022Zeroignite\u0022\u003E\u003Cdiv\u003EI\u0027d like to increase g-tolerance of parts, but reduce thermal tolerance of non-heatshields. How should I edit the .cfg?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I\u0027ve been trying to do the same but I think g-tolerance is hard coded. You can edit thermal tolerance in the custom.cfg though.\u003C/p\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-08-15T19:52:08Z","Content":"\n\u003Cp\u003EThis quote might help. Maybe this was tweaked later, but I guess the same principle still applies. I would vote for a parameter to make this tweakable. But if your rocket explodes on the pad it\u0027s propably a bug.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EYeah, 45G is a bit absurd. Right now, I\u0027m computing G-force as SQRT(8 * crashTolerance), so you get roughly the following values:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EcrashTolerance     G-Tolerance\u003Cbr\u003E       6                 7\u003Cbr\u003E       8                 8\u003Cbr\u003E      10                 9\u003Cbr\u003E      12                10\u003Cbr\u003E      15                11\u003Cbr\u003E      18\t\t12\u003Cbr\u003E      21                13\u003Cbr\u003E      24                14\u003Cbr\u003E      28                15\u003Cbr\u003E      32                16\u003Cbr\u003E      36                17\u003Cbr\u003E      40                18\u003Cbr\u003E      45                19\u003Cbr\u003E      50                20\u003Cbr\u003E      55                21\u003Cbr\u003E      60                22\u003Cbr\u003E      66                23\u003Cbr\u003E      72                24\u003Cbr\u003E      80                25\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENote that these are for G-forces averaged over 1 second, and discarding any spurious spikes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}