{"TopicId":29737,"ForumId":34,"TopicTitle":"[0.20] Deadly Reentry 2.3 - reentry heat, plus thermal and g-force damage to parts","CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T11:37:19Z","PageNum":10,"Articles":[{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-04T20:33:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EI did give details at some point...honestly don\u0027t recall what thread....I was told not to use other mods....not really help in my book so I was just gonna forget about it\u003Cp\u003Edon\u0027t worry about it anymore, I\u0027m not, but I do thank you for trying to help again\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETold not to use other mods? Now I\u0027m sure there was a miscommunication somewhere. The whole point of Module Manager is to help other mods.\u003C/p\u003E\n"},{"CreatedByName":"WedgeJAntilles","CreatedById":67191,"CreatedDateTime":"2013-06-04T20:40:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EBecause spaceplanes such as the space shuttle don\u0027t use ablative tiles. Spaceplanes in the next version *will* use heat tiles, they just won\u0027t be ablative (i.e., they won\u0027t get \u0022used up\u0022 as you go through the atmosphere).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYES! Very happy about this--I have a number of SSTO designs that I want to be 100% reusable, e.g. to station on Laythe, so having the heat shield ablate on re-entry was a big problem for me.\u003C/p\u003E\u003Cp\u003EWell, sortof. I\u0027ve also noticed, like a lot of people, that deadly reentry isn\u0027t that deadly anymore. I would expect that de-orbiting an unshielded spent stage from 250km orbit would end in a fiery explosion, but I\u0027ve dropped a dozen craft that way and not had a single component overheat (best I got was about 1200C). \u003C/p\u003E\u003Cp\u003EAlso, I think it would make sense to try and balance it against the stock heat values -- I have a lot of part packs and it\u0027s not really feasible for your mod to update the values for every part that\u0027s out there.\u003C/p\u003E\u003Cp\u003EEDIT: For reference, I am using FAR\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T20:42:38Z\u0022 title=\u002206/04/2013 08:42  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by WedgeJAntilles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-06-04T21:53:39Z","Content":"\n\u003Cp\u003EOne thing to remember: Kerbin ain\u0027t Earth. 250km orbit around Earth: 7762km/s. 250km orbit around Kerbin: \u0026lt; 2200km/s (I don\u0027t know the exact value). That\u0027s less than 1/3 the orbital velocity or 1/9 the energy to shed.\u003C/p\u003E\u003Cp\u003EAlso, even with deadly reentry 1.3 (using FAR), I\u0027ve had plenty of debris hit the surface with all parts: debris has a very high surface area to mass ratio (especially large tanks with mainsails, though I did lose many a mainsail) and thus decelerates pretty rapidly. When your max temp is 1450C, you need to be going at over 1800m/s at peak heat transfer altitudes to even begin to worry. Try some Mun free return orbits (though even then, the Mk1 command pod survives, but does get hot).\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-04T22:00:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EOne thing to remember: Kerbin ain\u0027t Earth. 250km orbit around Earth: 7762km/s. 250km orbit around Kerbin: \u0026lt; 2200km/s (I don\u0027t know the exact value). That\u0027s less than 1/3 the orbital velocity or 1/9 the energy to shed.\u003Cp\u003EAlso, even with deadly reentry 1.3 (using FAR), I\u0027ve had plenty of debris hit the surface with all parts: debris has a very high surface area to mass ratio (especially large tanks with mainsails, though I did lose many a mainsail) and thus decelerates pretty rapidly. When your max temp is 1450C, you need to be going at over 1800m/s at peak heat transfer altitudes to even begin to worry. Try some Mun free return orbits (though even then, the Mk1 command pod survives, but does get hot).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the real problem, I think. Accurate physics means that Kerbin almost never presents a real problem, unless you\u0027re doing something crazy like dropping straight home from Jool. I\u0027m already tweaking quite a bit to make it even slightly \u0027deadly\u0027; the question is, how much do we want to make this \u0022hard mode\u0022 for the sake of hard mode, vs. how much do we want to make it reasonably realistic?\u003C/p\u003E\u003Cp\u003EMy preference is always towards moar sim, of course.\u003C/p\u003E\n"},{"CreatedByName":"King Jareth","CreatedById":63223,"CreatedDateTime":"2013-06-04T22:04:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- B9 pack support.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes that include the B9/ModuleManager \u0027funkyness\u0027 ?\u003C/p\u003E\u003Cp\u003ELiking the sound of the EVA checks, always good to have a reason to suit up.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-04T22:05:46Z","Content":"\n\u003Cp\u003EOK, I\u0027m getting really strange behavior using this mod. I\u0027ve got an ablative heat shield on the BobCat\u0027s Orion, which is a copy of the standard 2.5m shield. The problem is, upon reentry, the shield starts to ablate at -5 or so degrees (barely into the atmosphere), gets used up by the time flames start to appear, yet the capsule isn\u0027t damaged in any way. Same goes for Space Shuttle (CSS), which has heat shield directly based of spaceplane fuselages. This one loses it\u0027s heat shield long before the atmo starts to get thick, yet it doesn\u0027t seem to have a heating problem once flames start to appear. Is it how it\u0027s supposed to act?\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-04T22:10:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Jareth\u0022 data-cite=\u0022King Jareth\u0022\u003E\u003Cdiv\u003EDoes that include the B9/ModuleManager \u0027funkyness\u0027 ?\u003Cp\u003ELiking the sound of the EVA checks, always good to have a reason to suit up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes; careo\u0027s given me permission to redistribute his dll (which we have successfully patched).\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-06-05T00:14:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EThis is the real problem, I think. Accurate physics means that Kerbin almost never presents a real problem, unless you\u0027re doing something crazy like dropping straight home from Jool. I\u0027m already tweaking quite a bit to make it even slightly \u0027deadly\u0027; the question is, how much do we want to make this \u0022hard mode\u0022 for the sake of hard mode, vs. how much do we want to make it reasonably realistic?\u003Cp\u003EMy preference is always towards moar sim, of course.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA very valid point. I\u0027ve been mentioning the difference in reentry velocity ever since people started getting worried that reentry heat was coming. The devs plan on dealing with reentry heat without involving heat shields, so I suspect that they\u0027re aiming for \u0022You can either be cautious and enter from a reasonable orbit, or you can aerocapture and pay attention to where your more heat-sensitive parts are.\u0022 They could be just aiming for \u0022don\u0027t be stupid.\u0022\u003C/p\u003E\u003Cp\u003EOf course, the more important point of view is yours. Personally, other than needing a heat shield, I never really felt that 1.3 made the game much harder. As long as I wasn\u0027t doing anything stupid and was actually behind my heat shield, I wouldn\u0027t even see a heat bar. Then again, I never did try aerobraking inbound from Jool into a nice low orbit with DR. As long as I slowed down enough to stay inside the orbit of the Mun, I was willing to finish up on subsequent passes.\u003C/p\u003E\u003Cp\u003EI guess I\u0027d say somewhere in between but not so much earth-hard as something you have to think about, even if that thinking is just \u0022I\u0027ll settle for a light aerocapture and use another pass (or passes) to brake enough to reenter rather than change the design of the craft.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Wert","CreatedById":63907,"CreatedDateTime":"2013-06-05T00:58:28Z","Content":"\n\u003Cp\u003EGreat Mod! Here are some questions I have about how to edit the configuration of it. What config edits do you use to make a heat shield that isn\u0027t ablative? Also, what exactly do each of the parameters in REENTRY_EFFECTS do, and how could you change them to work with stock heat resistance? Finally, do you change the REENTRY_EFFECTS in DeadlyReentry.cfg or custom.cfg?\u003C/p\u003E\u003Cp\u003EI also agree that this mod should be balanced with stock heat values, to make it compatible with other mods.\u003C/p\u003E\n"},{"CreatedByName":"WedgeJAntilles","CreatedById":67191,"CreatedDateTime":"2013-06-05T03:37:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003Ethe question is, how much do we want to make this \u0022hard mode\u0022 for the sake of hard mode, vs. how much do we want to make it reasonably realistic?\u003Cp\u003EMy preference is always towards moar sim, of course.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to think there\u0027s a happy medium somewhere. As it stands, DR has no effect on 99% of my mission profiles, which sort of kills the point of using it in the first place.\u003C/p\u003E\u003Cp\u003EAnother thing to think about that still veers on the side of realistic is the heat values. Is 1700 really low enough? I mean, 1700 is roughly the melting point of steel, but I have a hard time believing that a rocket tank would heat all the way to the point of steel melting without taking ANY damage beforehand. I know this contradicts my earlier request to balance it against stock values, it\u0027s just something to think about.\u003C/p\u003E\n"},{"CreatedByName":"rifter","CreatedById":65091,"CreatedDateTime":"2013-06-05T03:48:34Z","Content":"\n\u003Cp\u003EThat brings up an idea: as something heats up more and more, it becomes more vulnerable to structural failure under lower G-forces. This is all based on the idea that steel can still deform well below its melting point.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-05T04:00:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rifter\u0022 data-cite=\u0022rifter\u0022\u003E\u003Cdiv\u003EThat brings up an idea: as something heats up more and more, it becomes more vulnerable to structural failure under lower G-forces. This is all based on the idea that steel can still deform well below its melting point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, all that is already factored in and working. In general, things start taking damage at 85% of their maximum temperature, so around 1450 Celcius things start being a little problematic, and around 1600 things go south fast.\u003C/p\u003E\n"},{"CreatedByName":"aquilux","CreatedById":23859,"CreatedDateTime":"2013-06-05T05:14:44Z","Content":"\n\u003Cp\u003EMaybe, we could use the animation module in some way to vary connection strength and impact tolerance dependent of temperature similar to how the inflatable heat shield works?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-06-05T06:43:01Z","Content":"\n\u003Cp\u003EI just checked, and the most common titanium alloy is \u0022good\u0022 up to about 400C (probably higher, but that seems to be the design cutoff). Not sure what Kerbals use, though.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-05T07:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EYep, all that is already factored in and working. In general, things start taking damage at 85% of their maximum temperature, so around 1450 Celcius things start being a little problematic, and around 1600 things go south fast.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow what does \u0022taking damage\u0022 mean? I\u0027ve seen it in the game reports (in stock KSP) and all that but does damage really do anything? Currently the three different settings a part can be in seem to be \u0022fine\u0022, \u0022disconnected\u0022, and \u0022destroyed\u0022. I see no damaged effect besides on rover wheels. And you get the damaged warning whenever you splash a part with some rocket exhaust, but if you keep the rocket pointed at it nothing happens besides it being pushed away. So unless \u0022damaged\u0022 means that it blows up or gets disconnected more easily, I think I\u0027m missing something?\u003C/p\u003E\n"},{"CreatedByName":"King Jareth","CreatedById":63223,"CreatedDateTime":"2013-06-05T07:26:16Z","Content":"\n\u003Cp\u003Eialdabaoth has a 5(?) tier damage system in DR, you can see it in the right click menu for parts in game.\u003C/p\u003E\u003Cp\u003E(not sure if thats just for G force damage TBH).\u003C/p\u003E\u003Cp\u003EEdit - No its 6, he talks about it back \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/32342-Deadly-Reentry-2-1-Release-Candidate-4-in-need-of-testers!-(This-time-for-sure!)?p=411619\u0026amp;viewfull=1#post411619\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"MaHuJa","CreatedById":58370,"CreatedDateTime":"2013-06-05T08:05:04Z","Content":"\n\u003Cp\u003EI think the stock game \u0022part x damaged by y exhaust\u0022 will purely increase the temperature of x until it hits the max for that part.\u003C/p\u003E\n"},{"CreatedByName":"Yoloswaggins","CreatedById":63275,"CreatedDateTime":"2013-06-05T19:29:38Z","Content":"\n\u003Cp\u003EBeen testing this out and have come across one strange thing. I built a rover/skycrane thingy using the kerbal attachment system and was testing it on Kerbin. \u003C/p\u003E\u003Cp\u003ENo problems with re-entry using a heat-shield but when it comes to deploying the rover from the skycrane, it winches down about a meter and then the skycrane explodes. \u003C/p\u003E\u003Cp\u003EAccording to the post flight screen the crane components are exceeding their g-limit. \u003C/p\u003E\u003Cp\u003EThe crane itself is drifting down at about 7 m/s on parachutes when this happens. I tried with KAS in both docked and undocked mode to no avail. I\u0027ve no idea what\u0027s causing the g-overload and am presuming it\u0027s just an issue between KAS and deadly reentry. \u003C/p\u003E\u003Cp\u003EAnywho just thought I\u0027d give you a heads up as it would be nice to have the skycrane working. I\u0027m enjoying both mods and don\u0027t really want to give either up, but I also love skycranes and don\u0027t wanna shelf those either. Dilemmas, dilemmas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-05T21:33:07Z","Content":"\n\u003Cp\u003Eit feels like most of the g-force limits are too low. One of my jets just rips itself apart while turning (granted it is a 11g turn) but even my more modest jets have their engines explode at 8.5gs, and at that turning speed it would take it ages just to do a 180 degree turn\u003C/p\u003E\u003Cp\u003Ehell, I added a joystick so my controls would be fine enough to not turn at 11 gs and explode, and then it ripped itself apart at 6 gs after a slightly longer flight. all of the small fuel tanks and contol surfaces just rip off, and then the fuel tanks hit other parts of my jet and explode, and then half of my jet is debris and the rest is falling to the ground \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T23:05:49Z\u0022 title=\u002206/05/2013 11:05  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Tripod27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-06T19:55:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tripod27\u0022 data-cite=\u0022Tripod27\u0022\u003E\u003Cdiv\u003Eit feels like most of the g-force limits are too low. One of my jets just rips itself apart while turning (granted it is a 11g turn) but even my more modest jets have their engines explode at 8.5gs, and at that turning speed it would take it ages just to do a 180 degree turn\u003Cp\u003Ehell, I added a joystick so my controls would be fine enough to not turn at 11 gs and explode, and then it ripped itself apart at 6 gs after a slightly longer flight. all of the small fuel tanks and contol surfaces just rip off, and then the fuel tanks hit other parts of my jet and explode, and then half of my jet is debris and the rest is falling to the ground \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E This is a problem in general.\u003C/p\u003E\u003Cp\u003EI\u0027m basing my computations of G-force tolerance on crashTolerance.\u003C/p\u003E\u003Cp\u003ESo, what would the entire KSP community (at least those who use my mod) prefer:\u003C/p\u003E\u003Cp\u003E1. Plane wings that can withstand 15 to 20 G\u0027s of acceleration, and pods that can reenter at 40 G\u0027s\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E2. Pods that break up after 20 G\u0027s, and plane wings that break up at 10 to 15 G\u0027s?\u003C/p\u003E\n"},{"CreatedByName":"yongedevil","CreatedById":62491,"CreatedDateTime":"2013-06-06T20:35:14Z","Content":"\n\u003Cp\u003EI haven\u0027t gotten as far as testing this in reentry but I\u0027ve notice a problem in the editor. The parts with ablative heat shields cause a drop in FPS in editor. I\u0027m using a rocket with six NCS Adaptors and six Standard NC and the editor becomes very slow after a while.\u003C/p\u003E\u003Cp\u003EIt isn\u0027t immediately noticeable upon launching the game but after flying an returning to the VAB a few times it is a fairly pronounced slow down. I\u0027ve tried the Mk1 and Mk2 cockpits as well and they have the same effect so I tried removing the heat shield module from the parts and that cleared the problem. I have not noticed an effect in flight\u003C/p\u003E\u003Cp\u003EOther mods I\u0027m using:\u003C/p\u003E\u003Cp\u003EMechjeb v2.0.8.0 (tested both on and not on the ship)\u003C/p\u003E\u003Cp\u003EEngineer Redux v0.6.0.3 (tested both on and not on the ship)\u003C/p\u003E\u003Cp\u003EFerram Aerospace Research v0.9.4 (also tested without FAR installed)\u003C/p\u003E\u003Cp\u003ECrew Manifest v0.5.4.0\u003C/p\u003E\u003Cp\u003EIoncross v1.1\u003C/p\u003E\n"},{"CreatedByName":"Killerblonde","CreatedById":36220,"CreatedDateTime":"2013-06-07T00:57:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E This is a problem in general.\u003Cp\u003EI\u0027m basing my computations of G-force tolerance on crashTolerance.\u003C/p\u003E\u003Cp\u003ESo, what would the entire KSP community (at least those who use my mod) prefer:\u003C/p\u003E\u003Cp\u003E1. Plane wings that can withstand 15 to 20 G\u0027s of acceleration, and pods that can reenter at 40 G\u0027s\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E2. Pods that break up after 20 G\u0027s, and plane wings that break up at 10 to 15 G\u0027s?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs someone who flies planes and wants realistic reentry, I\u0027d pick number 2. With a few adjustments, perhaps you could give wings a little \u0022boost\u0022 in G-force tolerance, although to be honest with you, a 10g turn in a plane is starting to get ridiculous. - \u003Ca href=\u0022https://en.wikipedia.org/wiki/G-force#Short_Duration_Shock_and_Jerk\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/G-force#Short_Duration_Shock_and_Jerk\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EForgive me for citing wikipedia, but it makes sense that most aircraft never exceed 10 G\u0027s, with fighter jets only taking 10\u002B G\u0027s briefly and under extreme conditions. If you\u0027re doing a turn that would require 10\u002B G\u0027s, then your aircraft should be flying apart. I\u0027d say keep the pod G tolerance as is, and give wings a \u003Cem\u003Elittle\u003C/em\u003E boost in crashTolerance or add some subroutine to increase the G-force tolerance.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-07T01:10:48Z","Content":"\n\u003Cp\u003EWell the issue is that the planes tear apart at a sustained 6-7 Gs, and it\u0027s not the wings themselves, the rocket fuel tanks explode and then everything attached to them just falls apart. Most of the plane parts (besides the engines, which also explode often) can sustain 3-5 times the Gs of an equivalent rocket part, but when you\u0027re building a SSTO which needs rocket fuel, that one weak link is all it takes to break your plane apart into three pieces with a rocket fuel tank shaped hole in the middle\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-06-07T01:26:44Z","Content":"\n\u003Cp\u003Eialdabaoth: pods probably should survive 40G acceleration. They\u0027re just not that massive. Using acceleration alone is bogus because there\u0027s the problem of what\u0027s connected to the part. A length of 25lb fishing line will survive 1000g just fine. Put a 10lb weight on the end, and it probably won\u0027t handle 3.\u003C/p\u003E\u003Cp\u003EAlso, basing G tolerance on impact tolerance is tricky because the acceleration in an impact is ridiculously high.\u003C/p\u003E\u003Cp\u003EIMO, your mod most definitely should not be ripping ships apart, at all. Leave that to mods like FAR. Better yet, Deadly Reentry should not be worrying about acceleration at all. Leave that to a Deadly Acceleration mod, and that mod should not be affecting parts because the engine already does (though maybe not sufficiently, I will admit). However, Deadly Acceleration should be crushing Kerbals. Probes probably should be able to take 40g. Kerbals should not.\u003C/p\u003E\u003Cp\u003EI wish I could remember the details, but I remember being surprised at just how much continuous vibrational acceleration a non-operating hard-drive could take. Even an operating hard-drive could take a surprising amount (though much less than when not operating).\u003C/p\u003E\n"},{"CreatedByName":"Killerblonde","CreatedById":36220,"CreatedDateTime":"2013-06-07T02:41:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003Eialdabaoth: pods probably should survive 40G acceleration. They\u0027re just not that massive. Using acceleration alone is bogus because there\u0027s the problem of what\u0027s connected to the part. A length of 25lb fishing line will survive 1000g just fine. Put a 10lb weight on the end, and it probably won\u0027t handle 3.\u003Cp\u003EAlso, basing G tolerance on impact tolerance is tricky because the acceleration in an impact is ridiculously high.\u003C/p\u003E\u003Cp\u003EIMO, your mod most definitely should not be ripping ships apart, at all. Leave that to mods like FAR. Better yet, Deadly Reentry should not be worrying about acceleration at all. Leave that to a Deadly Acceleration mod, and that mod should not be affecting parts because the engine already does (though maybe not sufficiently, I will admit). However, Deadly Acceleration should be crushing Kerbals. Probes probably should be able to take 40g. Kerbals should not.\u003C/p\u003E\u003Cp\u003EI wish I could remember the details, but I remember being surprised at just how much continuous vibrational acceleration a non-operating hard-drive could take. Even an operating hard-drive could take a surprising amount (though much less than when not operating).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I understand your argument, the purpose of including acceleration to the \u0022deadliness\u0022 is because reentry must consider heat and acceleration. Otherwise, you can survive nearly any reentry just by nose diving straight down. This mod is meant to provide realistic, challenging reentry, which makes the inclusion of deadly G forces a must, lest an inaccurate heat model be introduced.\u003C/p\u003E\n"}]}