{"TopicId":29737,"ForumId":34,"TopicTitle":"[0.20] Deadly Reentry 2.3 - reentry heat, plus thermal and g-force damage to parts","CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T11:37:19Z","PageNum":2,"Articles":[{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T18:56:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022erbmur\u0022 data-cite=\u0022erbmur\u0022\u003E\u003Cdiv\u003EThanks for that!\u003Cp\u003EBy the looks of it it appears to have understood the mod because all the parts now have a temperature associated with them, however i\u0027m not sure if they are actually overheating the way they are supposed to. As you can see from the image below, with that speed and that altitude, i thought there would be no way anything would survive. V1.3 would cause things to ignite long before then. Unless the new version is supposed to work like this?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RbCfb0B.jpg\u0022 alt=\u0022RbCfb0B.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1.3 was way, way more harsh than it should be. In 1.3 and earlier, the effective temperature of the shockwave was infinite - so you could explode at almost any speed if you didn\u0027t decelerate fast enough.\u003C/p\u003E\u003Cp\u003EIn 2.0, the temperature is capped by the velocity, so as long as you are going under 2 km/s you\u0027ll get a lot of pretty lights but nothing will explode.\u003C/p\u003E\u003Cp\u003Ehere\u0027s how the logic is working in 2.0:\u003C/p\u003E\u003Cp\u003EA) all parts have their maxTemp halved, so your capsule will have a maxTemp of around 1700\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Atmospheric_entry#Shock_layer_gas_physics\u0022 rel=\u0022external nofollow\u0022\u003EAccording to the oracle\u003C/a\u003E, the temperature of the shockwave in Kelvins is approximately equal to the speed in m/s. Since the game uses Celsius, your shockwave temp is somewhere around your velocity - 275.\u003C/p\u003E\u003Cp\u003EC) The temperature at which any object begins emitting visible black body radiation (aka \u0022glowing red\u0022) is 525 C. Therefore, at 800 m/s (525C ~= 800K) your contrail begins glowing.\u003C/p\u003E\u003Cp\u003ED) Each part that is not shielded by another part gains heat from the shockwave until it reaches thermal equilibrium with it. The rate of heat increase depends on the difference between the temperatures and the density of the air - so you\u0027ll gain heat about 2.7 times as fast at 30 km altitude as you would at 35km altitude. This is fiddly - I might need to adjust the density exponent here.\u003C/p\u003E\u003Cp\u003EE) if your part has a heat shield, that shield has three components: an angle, a reflective factor, and an ablative factor. The reflective factor ranges from 0 to 100%; it\u0027s the amount of heat increase that\u0027s flat-out ignored if you\u0027re coming in at the correct angle, no matter what. The ablative factor represents how much ablative resource gets blasted off your ship as a function of temperature, and how much temperature gets wicked away per chunk of tile that gets melted off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T19:24:36Z\u0022 title=\u002205/28/2013 07:24  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by ialdabaoth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Killerblonde","CreatedById":36220,"CreatedDateTime":"2013-05-28T19:02:17Z","Content":"\n\u003Cp\u003EIn RC1, I launched straight up, Apo at about 450km, fell straight down a \u002B2km/s with mark1 pod into Kerbin\u0027s atmosphere, at about 30km started getting serious reentry, although the heatshield held up fine and only lost about 80 ablation points or so. I\u0027m trying RC2 now.\u003C/p\u003E\u003Cp\u003EEdit: Same thing with RC2. I don\u0027t think that coming straight down pulling 15\u002B g\u0027s on reentry should be survivable - the heat shield would likely disintegrate under these conditions. I recommend nerfing it a bit - otherwise, successful reentry would be far too easy.\u003C/p\u003E\u003Cp\u003EEdit 2: Never mind - steeper reentry angle is more G\u0027s, less heat. I understand now. In that case, possibly have some kind of G limit on the heat shield for the sake of overall realism? Maybe the higher G\u0027s it receives, the faster the heat shield ablates or something.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T19:10:43Z\u0022 title=\u002205/28/2013 07:10  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Killerblonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ph34rb0t","CreatedById":4291,"CreatedDateTime":"2013-05-28T19:03:00Z","Content":"\n\u003Cp\u003EIs the Module Manager contained within the DealyReentry.dll?\u003C/p\u003E\u003Cp\u003EIf not, the manager\u0027s .dll is not in the download.\u003C/p\u003E\u003Cp\u003EIn any case, thanks for this. I can finally retire PerkledHostage\u0027s reentry mod.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-28T19:08:44Z","Content":"\n\u003Cp\u003EActually, it occurs to me that maybe the behavior I\u0027m experiencing is normal (and I was just confused by the bass-ackwards way heating in 1.3 worked). Steeper angles should have less heating, due to shorter duration exposure to the high temperatures. This is what I\u0027m seeing: Ap: 100km, Pe: 35km and I lose about half of my shielding. Ap: 100km, Pe:-450km and I lose less than a quarter.\u003C/p\u003E\u003Cp\u003EThe unphysical part of this is that on the nose-dive reentry, my craft isn\u0027t breaking up due to g-stress the way it should.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EC) The temperature at which any object begins emitting black body radiation is 525 C. Therefore, at 800 m/s (525C ~= 800K) your contrail begins glowing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t true. Bodies at any temperature above absolute zero emit blackbody radiation. 525 C might be the temperature at which that radiation begins to become visible, but that\u0027s not the same thing as not emitting radiation at all. There will be radiative heat transfer even below this point (although it will be lower), so if you spend enough time at those speeds you can still cook.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T19:21:30Z\u0022 title=\u002205/28/2013 07:21  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Stochasty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T19:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stochasty\u0022 data-cite=\u0022Stochasty\u0022\u003E\u003Cdiv\u003EThis isn\u0027t true. Bodies at any temperature above absolute zero emit blackbody radiation. 525 C might be the temperature at which that radiation begins to become visible, but that\u0027s not the same thing as not emitting radiation at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s correct, I just forgot the word \u0027visible\u0027. At any speed over 300 m/s, you will experience some heating, but the contrail starts glowing visibly at 800 m/s.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-28T19:25:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EThat\u0027s correct, I just forgot the word \u0027visible\u0027. At any speed over 300 m/s, you will experience some heating, but the contrail starts glowing visibly at 800 m/s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suspected this is what you meant; just wanted to make sure. The \u0027P\u0027 in PhD stands for pedantic, after all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T19:27:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Killerblonde\u0022 data-cite=\u0022Killerblonde\u0022\u003E\u003Cdiv\u003EEdit 2: Never mind - steeper reentry angle is more G\u0027s, less heat. I understand now. In that case, possibly have some kind of G limit on the heat shield for the sake of overall realism? Maybe the higher G\u0027s it receives, the faster the heat shield ablates or something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote that this mod\u0027s primary concern is heat, not G-forces. Worrying about what G-forces are survivable would be a nightmare, because of other mods doing the same thing (most notable FAR). Although at some point, DeadlyReentry and FerramAerospace should probably be merged somehow, at which point G-force considerations would be easy.\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-05-28T19:28:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stochasty\u0022 data-cite=\u0022Stochasty\u0022\u003E\u003Cdiv\u003EActually, it occurs to me that maybe the behavior I\u0027m experiencing is normal (and I was just confused by the bass-ackwards way heating in 1.3 worked). Steeper angles should have less heating, due to shorter duration exposure to the high temperatures. This is what I\u0027m seeing: Ap: 100km, Pe: 35km and I lose about half of my shielding. Ap: 100km, Pe:-450km and I lose less than a quarter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually that part doesn\u0027t make physical sence since atmosphere is much less dense up high and so should cause less heating although for prolonged time.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-05-28T19:31:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EActually that part doesn\u0027t make physical sence since atmosphere is much less dense up high and so should cause less heating although for prolonged time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eactually, here\u0027s what happens:\u003C/p\u003E\u003Cp\u003EAt a shallow angle, you tear through the atmosphere at speeds of several km/s. Final temperature is dependent entirely on speed, although how quickly you reach that temperature is dependent on density.\u003C/p\u003E\u003Cp\u003EAt a steep angle, you slow down VERY quickly, so while you\u0027re lower in the atmosphere and hence heating up faster, the temperature you\u0027re heating up TO is lower, because you\u0027ve just experienced 18\u002B G\u0027s of acceleration.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-28T19:33:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EActually that part doesn\u0027t make physical sence since atmosphere is much less dense up high and so should cause less heating although for prolonged time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a trade off. If you stay high enough, you are correct that the low density wins out and you\u0027ll experience less heating; also, you won\u0027t slow down very much. This is okay if you are aerobraking and will be returning to orbit. Not so useful for reentry.\u003C/p\u003E\u003Cp\u003EGo lower, and the density increases to the point that you\u0027ll equilibrate before you slow down. This is bad; it means you fry and die. The solution, then, is to go even lower still, so that you slow down before you equilibrate.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-05-28T19:50:57Z","Content":"\n\u003Cp\u003EI am unable to get it working. I unzipped the contents of the zip file into a folder inside GameData called DeadlyReentry. \u003C/p\u003E\u003Cp\u003EIs there some indicator that it\u0027s installed, like a UI box?\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-05-28T19:57:00Z","Content":"\n\u003Cp\u003ETest report:\u003C/p\u003E\u003Cp\u003EThe 2 man lander can survived a rather steep reentry from 250km. \u003C/p\u003E\u003Cp\u003ETemp got up to about 800c.\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-05-28T20:12:23Z","Content":"\n\u003Cp\u003EWith v1.3 the only survivable reentry I was able to come up with that would be more or less repetitive (meaning I\u0027ve done it on first try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) was to drop Pe to ~38-40 kms, then as you \u0022bounce off\u0022 atmosphere heatshield cools down and also bleeds off enough speed so it was safe to drop into thicker air without burning out. If currently all it gets to reentry is to drop vertically down it kinda kills the fun... Maybe you can speak to Ferram as to include high-G desintegration? But again in real life crew would be dead long before any structural damage is done to the capsule...\u003C/p\u003E\n"},{"CreatedByName":"airminer","CreatedById":59222,"CreatedDateTime":"2013-05-28T20:12:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EI am unable to get it working. I unzipped the contents of the zip file into a folder inside GameData called DeadlyReentry. \u003Cp\u003EIs there some indicator that it\u0027s installed, like a UI box?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can check what plugins are loaded in the debug menu, under the tab named \u0022assemblies\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-05-28T20:23:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003ENote that this mod\u0027s primary concern is heat, not G-forces. Worrying about what G-forces are survivable would be a nightmare, because of other mods doing the same thing (most notable FAR). Although at some point, DeadlyReentry and FerramAerospace should probably be merged somehow, at which point G-force considerations would be easy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlease don\u0027t completely combine DeadlyReEntry and FAR, I like DeadlyReEntry, but find FAR just way way too complex for me to use.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-05-28T20:29:20Z","Content":"\n\u003Cp\u003EFAR is probably complex internally, but as far as using, it goes like this:\u003C/p\u003E\u003Cp\u003E1. Install\u003C/p\u003E\u003Cp\u003E2. Enjoy more realistic aerodynamics\u003C/p\u003E\u003Cp\u003E3. Keep moving the stupid windows out of the way because you don\u0027t really need to adjust anything on them.\u003C/p\u003E\n"},{"CreatedByName":"gabmaia","CreatedById":33005,"CreatedDateTime":"2013-05-28T20:45:02Z","Content":"\n\u003Cp\u003EAny good heatshield packs out there?\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-05-28T21:19:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rhoark\u0022 data-cite=\u0022rhoark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E3. Keep moving the stupid windows out of the way because you don\u0027t really need to adjust anything on them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell they scared me enough I uninstalled the mod, I tried to read through all that stuff and yeah... \u003C/p\u003E\u003Cp\u003EAll I could figure out is I had a rocket that flew before, and didn\u0027t after, and got this window on my screen that I don\u0027t understand... time to get rid off. \u003C/p\u003E\u003Cp\u003EMaybe I\u0027ll give it a new try.\u003C/p\u003E\n"},{"CreatedByName":"Killerblonde","CreatedById":36220,"CreatedDateTime":"2013-05-28T21:19:21Z","Content":"\n\u003Cp\u003EThat\u0027s the same problem I had with it... annoying windows everywhere. Is there a way to disable them? It would seem to me like there would have to be....\u003C/p\u003E\u003Cp\u003EEDIT: Also, to my knowledge, FAR only causes G forcing damage on larger vessels. A single command pod can still hurtle towards the atmosphere and take 44 G\u0027s straight down, and stands a better chance of surviving than going for a more realistic reentry. I don\u0027t want to be pushy or anything, and I know there are more important things to take care of first, but it seems like a rather large flaw in a realism mod to be able to make your reentry angle arbitrarily steep in order to be sure you survive it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T21:32:36Z\u0022 title=\u002205/28/2013 09:32  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Killerblonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NannerManCan","CreatedById":27019,"CreatedDateTime":"2013-05-28T21:41:02Z","Content":"\n\u003Cp\u003EWhere\u0027s ds store supposed to go?\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-28T21:45:41Z","Content":"\n\u003Cp\u003EOkay, after some more testing, there\u0027s some very definite issues with engine heating - at least in conjunction with your ModularFuelTanks mod. LV-Ns overheat at 50% thrust. Aerospikes running LOX\u002BLH2 at about 60%, running LOX\u002BLiquidFuel at less than 50%. LV-T45 overheats on LOX\u002BLH2 at 100% but is stable at 90%. Overheats more quickly on LOX\u002BLiquidFuel, but I\u0027m not sure the exact percentage. Couldn\u0027t test the LV-T30, since it\u0027s not configurable.\u003C/p\u003E\u003Cp\u003ESeems to be that the reduction in heat tolerance from Deadly Reentry doesn\u0027t play well with the changes to engine heat generation from ModularFuelTanks.\u003C/p\u003E\u003Cp\u003EEdit: Potentially hacky solution: rather than reducing maxTemp values for all parts by 50%, pretend that maxTemp values are given in Fahrenheit, not Celsius. (Actually, given their stock values, do we know for certain the temps are Celsius?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T21:50:01Z\u0022 title=\u002205/28/2013 09:50  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Stochasty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nobody_1707","CreatedById":42582,"CreatedDateTime":"2013-05-28T22:09:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NannerManCan\u0022 data-cite=\u0022NannerManCan\u0022\u003E\u003Cdiv\u003EWhere\u0027s ds store supposed to go?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat stores data for the Mac desktop. It shouldn\u0027t be there at all, but it\u0027s a bit difficult sometimes to keep them out of archives.\u003C/p\u003E\n"},{"CreatedByName":"NannerManCan","CreatedById":27019,"CreatedDateTime":"2013-05-28T22:18:51Z","Content":"\n\u003Cp\u003EWell it seems like the heat has been toned down. From a 100km orbit I came down at 2182.5m/s from 70KM up then 2252m/s at 35KM. Nothing exploded just some flames. I had to go to about 500km above kerbin then I fired my rocket straight down until I was going like 2800m/s the ship started exploding but my capsule and the fuel tank, asas, and engine below it were still fine. Also are we going to get some heat shield parts?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T22:22:25Z\u0022 title=\u002205/28/2013 10:22  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by NannerManCan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-05-28T23:04:11Z","Content":"\n\u003Cp\u003EIs it just me or is the download down?\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-05-28T23:10:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gabmaia\u0022 data-cite=\u0022gabmaia\u0022\u003E\u003Cdiv\u003EAny good heatshield packs out there?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo but fairing factory can be used in a pinch.\u003C/p\u003E\n"}]}