{"TopicId":29754,"ForumId":24,"TopicTitle":"Afternoon And hello to you all.","CreatedByName":"ManFlu","CreatedById":59902,"CreatedDateTime":"2013-05-28T13:34:00Z","PageNum":1,"Articles":[{"CreatedByName":"ManFlu","CreatedById":59902,"CreatedDateTime":"2013-05-28T13:34:00Z","Content":"\n\u003Cp\u003EHi everyone I am ManFlu, I\u0027m a 26yr old man, Currently serving in HM Armed Forces, I actually have an engineering role of sorts and this game presses all the right buttons in what is left of my brain. This game is a bit of a change of pace for me and my usual haunts of battlefield 3 (PS3 Beemerron) I have been playing KSP for what seems to be years now although its just months. Absolutely brilliant and life absorbing. \u003C/p\u003E\u003Cp\u003EVery glad to be part of this growing community and all advice will taken on board readily, as it has taken me this long to finally land on the flippin Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gniuz","CreatedById":57846,"CreatedDateTime":"2013-05-28T13:58:20Z","Content":"\n\u003Cp\u003EWelcome dude,\u003C/p\u003E\u003Cp\u003EI\u0027m like you and usually hunt the battlefield on PS3, that was until I came across this gem of a game.\u003C/p\u003E\u003Cp\u003EIt\u0027s good how someone with an engineering role as a day job enjoys the game as I\u0027m sure the developers intended that to be the case. \u003C/p\u003E\u003Cp\u003EGood luck in venturing further into the Kerbol system.\u003C/p\u003E\u003Cp\u003EG.\u003C/p\u003E\n"},{"CreatedByName":"ManFlu","CreatedById":59902,"CreatedDateTime":"2013-05-28T15:22:36Z","Content":"\n\u003Cp\u003EThanks :-) Although due to mechjeb I just lost all of my ships with any mechjeb module on it. didnt quite update it the way I was supposed to I guess\u003C/p\u003E\n"},{"CreatedByName":"Gniuz","CreatedById":57846,"CreatedDateTime":"2013-05-28T15:42:42Z","Content":"\n\u003Cp\u003EYeah the update has trashed some peoples games. I got lucky, where as my friend suffered. That\u0027s life though.\u003C/p\u003E\u003Cp\u003EG.\u003C/p\u003E\n"},{"CreatedByName":"ManFlu","CreatedById":59902,"CreatedDateTime":"2013-05-28T15:45:21Z","Content":"\n\u003Cp\u003ECertainly is in KSP, Can\u0027t say it is the first time, although I will be taking this opportunity to have much less debris filled space. and a semi pro looking space program\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-28T17:57:51Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m one of those who got a little over-dependent on mods myself, so I had to abandon my save that I\u0027d been maintaining since 0.18. I\u0027ve decided to look at it as an opportunity to start with a clean slate myself, though I will admit I was a little nonplussed at first.\u003C/p\u003E\u003Cp\u003EIf you get stuck somewhere or just want to learn more about the game, questions in the How To section of the forums are always welcome. As well, you can also check out the Drawing Board (link in my sig), which has a number of tutorials and player aids for players of all skill levels.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-31T02:43:20Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}