{"TopicId":29866,"ForumId":16,"TopicTitle":"How many parts is too many","CreatedByName":"Claytsuk","CreatedById":59247,"CreatedDateTime":"2013-05-28T21:48:37Z","PageNum":1,"Articles":[{"CreatedByName":"Claytsuk","CreatedById":59247,"CreatedDateTime":"2013-05-28T21:48:37Z","Content":"\n\u003Cp\u003EMy laptop does not do a great job at KSP, it gets very laggy. Have docked a few 200 part crafts together and don\u0027t get my FPS.. Is there a general rule to keep struts down and therefore parts down to a minimum???\u003C/p\u003E\u003Cp\u003EAlso does having 1000 part stations around lag other parts of the game? Eg space station around kerbin lag a mission around Duna?\u003C/p\u003E\u003Cp\u003EThanks...\u003C/p\u003E\n"},{"CreatedByName":"Qumefox","CreatedById":43197,"CreatedDateTime":"2013-05-28T21:58:53Z","Content":"\n\u003Cp\u003EThere is no \u0027real\u0027 answer.. It\u0027s going to entirely depend on your computer.\u003C/p\u003E\u003Cp\u003ESomeone with a new top of the line machine is going to be able to use a lot more parts without lagging than someone say, trying to play on an old P4 machine with integrated intel graphics.\u003C/p\u003E\u003Cp\u003EAbout all you can do is post your exact system specs, and hope someone with a similar configuration reads it and tells you what they can usually get away with, part count wise.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T22:01:14Z\u0022 title=\u002205/28/2013 10:01  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Qumefox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NIN3","CreatedById":16605,"CreatedDateTime":"2013-05-28T22:00:02Z","Content":"\n\u003Cp\u003EWhile I cant answer the first question very well, I can say that a 1000part station will not lag the rest of the world if it is in orbit, and not loaded. Only what is in several km is loaded into the game, and thus creating lag. the rest is on rails and unloaded.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-29T05:51:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claytsuk\u0022 data-cite=\u0022Claytsuk\u0022\u003E\u003Cdiv\u003EMy laptop does not do a great job at KSP, it gets very laggy. Have docked a few 200 part crafts together and don\u0027t get my FPS.. Is there a general rule to keep struts down and therefore parts down to a minimum???\u003Cp\u003EAlso does having 1000 part stations around lag other parts of the game? Eg space station around kerbin lag a mission around Duna?\u003C/p\u003E\u003Cp\u003EThanks...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s going to vary from machine to machine, albeit not too much. One thing to note is that docking ports appear to be bugged and contribute to lag more than other types of nodes. \u003C/p\u003E\u003Cp\u003EIf you come within range of an oversized station, you will know it. The game will hang while it loads it up, and then slowly pick back up into bad lag. Fortunately, you have to get very close for this to happen, generally close enough it\u0027s not something that happens accidentally. Stations in orbit do not contribute to lag when they\u0027re not loaded, as far as I\u0027m aware.\u003C/p\u003E\u003Cp\u003EIf you\u0027re unsure, test things first.\u003C/p\u003E\u003Cp\u003Eover-strutting can contribute to this problem, since it\u0027s easy to send your part count through the roof that way. It\u0027s usually better to attach problems like rocket wobble through better balance and disabling gimballing on outer engines, before you try and attack them with struts. A little flex won\u0027t kill you, and most of the time the problem is caused by something other than just not enough struts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Qumefox\u0022 data-cite=\u0022Qumefox\u0022\u003E\u003Cdiv\u003EThere is no \u0027real\u0027 answer.. It\u0027s going to entirely depend on your computer.\u003Cp\u003ESomeone with a new top of the line machine is going to be able to use a lot more parts without lagging than someone say, trying to play on an old P4 machine with integrated intel graphics.\u003C/p\u003E\u003Cp\u003EAbout all you can do is post your exact system specs, and hope someone with a similar configuration reads it and tells you what they can usually get away with, part count wise.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is both true and not. Since KSP is limited to a single physics thread, physics is always the bottleneck when lag arises, and regardless of the processor, graphics, memory, etc... the only thing that will really net you better (and margainally better at that) performance is a higher clock speed or more FLOPs per clock per core. Because of this things like massive 6 and 8 core processors in really serious gaming machines can actually do more poorly in KSP than a simple core 2 duo with a very high clock speed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-29T05:53:37Z\u0022 title=\u002205/29/2013 05:53  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 29, 2013\u003C/time\u003E by Colonel_Panic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2013-05-29T09:24:21Z","Content":"\n\u003Cp\u003EAs I add more parts my game slowly gets slower, and at 1500 parts there\u0027s a huge drop-off that gives me about 3FPS\u003C/p\u003E\n"}]}