{"TopicId":29888,"ForumId":32,"TopicTitle":"Why Ion Engines?","CreatedByName":"bigpapabearxx","CreatedById":30899,"CreatedDateTime":"2013-05-29T00:10:07Z","PageNum":1,"Articles":[{"CreatedByName":"bigpapabearxx","CreatedById":30899,"CreatedDateTime":"2013-05-29T00:10:07Z","Content":"\n\u003Cp\u003EAre Ion engines useful? I found that it saves time to just pack some liquid fuel and use a rocket to go IP. What do you guys use it for?\u003C/p\u003E\n"},{"CreatedByName":"Dortmunder","CreatedById":66018,"CreatedDateTime":"2013-05-29T00:16:16Z","Content":"\n\u003Cp\u003EI throw them on satellites that I may want to change the orbit of.\u003C/p\u003E\u003Cp\u003EI hear they can be good for long interplanetary journeys as well. As they can burn for a really long time, thus increasing your speed over long distances.\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-05-29T00:17:02Z","Content":"\n\u003Cp\u003EIon engines have a far, far higher efficiency than standard rocket engines. Specific Impulse (ISP) is a measure of efficiency; normal rockets are in the 300-400 range, nuclear engines are at 800 in a vacuum, jet engines are 2000 in-atmosphere, and ion engines are a whopping 4200. Ions make up for this with an atrocious thrust value and the need for a lot of electricity.\u003C/p\u003E\u003Cp\u003EIf you\u0027re making a small, unmanned probe that\u0027s going to go orbit some distant planet or moon, you\u0027re far better off using ions to do so. A conventional rocket simply won\u0027t be able to carry enough fuel to get to an orbit around someplace like Moho (unless you make it ridiculously huge), but ions can do it easily, even if launched from low Kerbin orbit. The problem is that due to their low thrust, you can\u0027t really use them for anything larger than that unmanned probe; a manned rocket would be so heavy that ions would take forever to get any appreciable acceleration. Even that small unmanned probe will have uncomfortably long burn times, but at least it\u0027ll still be measured in minutes instead of hours.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-29T00:19:19Z\u0022 title=\u002205/29/2013 12:19  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 29, 2013\u003C/time\u003E by Spatzimaus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Westo454","CreatedById":12702,"CreatedDateTime":"2013-05-29T00:17:55Z","Content":"\n\u003Cp\u003EBecause they have an enormous amount of D-V per tank.\u003C/p\u003E\n"},{"CreatedByName":"Shrike42","CreatedById":61104,"CreatedDateTime":"2013-05-29T00:20:26Z","Content":"\n\u003Cp\u003EThey have also found a bit of use as long-lasting orbital correction engines for space stations, as each docking procedure alters the orbit slightly.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-29T00:24:35Z","Content":"\n\u003Cp\u003EIon engines are also excellent for kerbolar observing probes intended for low orbit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i44.tinypic.com/33vdr91.jpg\u0022 alt=\u002233vdr91.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECircularising at low Kerbolar orbit takes extraordinary amount of delta-V and an ion stage can give you 10km/s fairly easily. Close proximity to the sun also boosts the output of your solar panels by many times their normal Kerbin value so you don\u0027t need giganator panels to further mess up your TWR.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-29T00:46:07Z","Content":"\n\u003Cp\u003ESome tips for ion probes, first is that you want them as light as possible.\u003C/p\u003E\u003Cp\u003E1-3 tanks, one ion engine, do not use the large solar panels as they are heavy, use the small one who fold outward and put on an tower of small struts. Payload might be iso mapsat and the small kerthane detector, the large is to heavy and the science packs. \u003C/p\u003E\u003Cp\u003ETest on launchpad to see how many solar panels you need however if you go to Moho or inward you need fewer, going towards jool and you need 60% more,\u003C/p\u003E\n"}]}