{"TopicId":303,"ForumId":16,"TopicTitle":"SRB vs. Liquid","CreatedByName":"FreeLaunch","CreatedById":1494,"CreatedDateTime":"2011-07-14T20:17:45Z","PageNum":1,"Articles":[{"CreatedByName":"FreeLaunch","CreatedById":1494,"CreatedDateTime":"2011-07-14T20:17:45Z","Content":"\n\u003Cp\u003EHey fellow K-Nauts,\u003C/p\u003E\u003Cp\u003ELoving this game. My question pertains to solid rocket boosters vs. liquid. Looking at the specs in the .cfg files, it appears that the numbers are pretty close on these thrust and mass-wise. Obviously liquid fuel tanks can stack and flow, which is handy - other than that, what is the main difference between the two, and how do folks use them differently?\u003C/p\u003E\u003Cp\u003Ead astra,\u003C/p\u003E\u003Cp\u003EFL\u003C/p\u003E\n"},{"CreatedByName":"LionsPhil","CreatedById":1252,"CreatedDateTime":"2011-07-14T20:21:48Z","Content":"\n\u003Cp\u003EI tend to use them how I believe they\u0027re used in real life: SRBs to assist (sometimes for pure first stage) take-off, and liquid toward the end. Obviously you want something you can throttle back when you begin to escape the clutches of the atmosphere and want to go somewhere other than \u0027straight up, as fast as possible\u0027. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Finrandojin","CreatedById":1598,"CreatedDateTime":"2011-07-14T20:38:09Z","Content":"\n\u003Cp\u003EIn my opinnion solids are just a means to get the stack hauling mail at launch, I never use them past the first stage and I\u0027ve done pretty well so far.\u003C/p\u003E\n"},{"CreatedByName":"Supraluminal","CreatedById":1472,"CreatedDateTime":"2011-07-14T21:35:19Z","Content":"\n\u003Cp\u003EI also tend to use them only as a first stage. They seem to put out lots of thrust very quickly, which is great for getting off the ground but not so hot for maintaining stability once you\u0027re on the move. They\u0027re also just kinda difficult to get integrated into subsequent stages very smoothly (lots of mucking around in the stage editor required for anything like good results).\u003C/p\u003E\u003Cp\u003EThat\u0027s my take on them as part of a utilitarian craft intended to actually get into (and back out of) space, anyway. For creating cobbled-together deathtraps, they\u0027re indispensable!\u003C/p\u003E\n"},{"CreatedByName":"Ntmoore19","CreatedById":646,"CreatedDateTime":"2011-07-14T22:18:20Z","Content":"\n\u003Cp\u003ESolid boosters are lighter but don\u0027t last nearly as long. I only use them for radial decoups because you can\u0027t put liquid engines on them. I even use Liquid for the liftoff stage. \u003C/p\u003E\u003Cp\u003EYou also don\u0027t need to worry about liquid engines overheating. \u003C/p\u003E\n"},{"CreatedByName":"cjameshuff","CreatedById":152,"CreatedDateTime":"2011-07-15T00:30:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ntmoore19\u0022 data-cite=\u0022Ntmoore19\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESolid boosters are lighter...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is a bit insane, considering that the SRBs on the Space Shuttle take up about 60% of the whole thing\u0027s mass on the pad. Real solids are \u003Cstrong\u003Eheavy\u003C/strong\u003E!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ntmoore19\u0022 data-cite=\u0022Ntmoore19\u0022\u003E\u003Cdiv\u003EYou also don\u0027t need to worry about liquid engines overheating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey do overheat, but I haven\u0027t yet blown up an engine that way.\u003C/p\u003E\n"},{"CreatedByName":"CannotIntoSpace","CreatedById":1556,"CreatedDateTime":"2011-07-15T00:38:11Z","Content":"\n\u003Cp\u003EI blow up liquid fuel engines regularly, since my designs are based primarily on\u003C/p\u003E\u003Cp\u003Ea number of fuel tanks \u002B tri-coupler \u002B 3 engines\u003C/p\u003E\u003Cp\u003EThese burn really hot, but work really great for single stage orbits.\u003C/p\u003E\n"},{"CreatedByName":"Jack","CreatedById":265,"CreatedDateTime":"2011-07-15T00:47:05Z","Content":"\n\u003Cp\u003EI\u0027ve also found SRB\u0027s are incredibly unstable when it comes to turning, because it causes quite a bit of drag and forces the engine to work harder, which makes it overheat faster.\u003C/p\u003E\u003Cp\u003EI usually stick with liquid unless it\u0027s a completely SAS-guided mission. (if it\u0027s a Kerbal suicide mission, SRB all the way.)\u003C/p\u003E\n"},{"CreatedByName":"cjameshuff","CreatedById":152,"CreatedDateTime":"2011-07-15T00:53:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack\u0022 data-cite=\u0022Jack\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027ve also found SRB\u0027s are incredibly unstable when it comes to turning, because it causes quite a bit of drag and forces the engine to work harder, which makes it overheat faster.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou may be catching some exhaust or something. Maybe atmospheric compression heating is simulated to some degree, or maybe the SRB\u0027s are being pushed into your stack or something...\u003C/p\u003E\u003Cp\u003EIf it\u0027s as you describe, it\u0027s a physics bug...a rocket experiencing more drag should just go slower.\u003C/p\u003E\n"},{"CreatedByName":"kerbalkicker","CreatedById":7684,"CreatedDateTime":"2011-08-29T13:46:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou may be catching some exhaust or something. Maybe atmospheric compression heating is simulated to some degree, or maybe the SRB\u0027s are being pushed into your stack or something...\u003Cp\u003EIf it\u0027s as you describe, it\u0027s a physics bug...a rocket experiencing more drag should just go slower.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot necessarily. I have no idea if the physics engine actually simulates this, but the faster you go the more heat you can dump to the air moving past. So yeah - a rocket sitting still will overheat faster than one that is moving through the atmosphere at a gazillion miles an hour.\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2011-08-29T14:00:44Z","Content":"\n\u003Cp\u003ESFBs are superior to a liquid stack of two tanks \u003Cem\u003Eonly\u003C/em\u003E on a single first stage.\u003C/p\u003E\n"},{"CreatedByName":"Epsilon","CreatedById":392,"CreatedDateTime":"2011-09-01T21:00:29Z","Content":"\n\u003Cp\u003E\u0027As an aside, Von Braun had said that no human should ever ride on\u003C/p\u003E\u003Cp\u003Esolid rockets. They were just too dangerous. One in twenty-five blew\u003C/p\u003E\u003Cp\u003Eup due to defects. They could not be stopped once lighted and thus had\u003C/p\u003E\u003Cp\u003Ethe potential for a major loss of life.\u0027\u003C/p\u003E\u003Cp\u003EThis is somewhat to an effect of what he actually once said (of course it was being quoted by someone else)\u003C/p\u003E\u003Cp\u003EI personally prefer liquid fueled rockets, but solid rockets are pretty cool and pack a big punch.\u003C/p\u003E\u003Cp\u003EBesides, what\u0027s a few Kerbal\u0027s gone boom going to do to the program anyway? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DoctorEvo","CreatedById":4870,"CreatedDateTime":"2011-09-01T22:30:12Z","Content":"\n\u003Cp\u003EBoosters. Always boosters. Liquids are boring for anything but dinky rockets with just one or two stages.\u003C/p\u003E\u003Cp\u003E(I bet you think I\u0027m joking, too.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Epsilon\u0022 data-cite=\u0022Epsilon\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u0027As an aside, Von Braun had said that no human should ever ride on\u003C/p\u003E\u003Cp\u003Esolid rockets. They were just too dangerous. One in twenty-five blew\u003C/p\u003E\u003Cp\u003Eup due to defects. They could not be stopped once lighted and thus had\u003C/p\u003E\u003Cp\u003Ethe potential for a major loss of life.\u0027\u003C/p\u003E\u003Cp\u003EThis is somewhat to an effect of what he actually once said (of course it was being quoted by someone else)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, you also gotta realize that he and Thiel were pretty much the ones who made liquid-fuelled rocketry practical in the first place, and he was VERY proud of that fact. And as for that little statistic there...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESRB failure rates are about 1%. They usually fail in sudden, catastrophic explosions due to case overpressurization.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Solid_rocket_booster\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Solid_rocket_booster\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESRBs are actually quite a bit more reliable than liquid rocket engines, owing mostly to their rugged simplicity. They do fail much more spectacularly, though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CannotIntoSpace\u0022 data-cite=\u0022CannotIntoSpace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ea number of fuel tanks \u002B tri-coupler \u002B 3 engines\u003C/p\u003E\u003Cp\u003EThese burn really hot, but work really great for single stage orbits.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find that using a single engine is usually more appropriate for SSTO, unless I have more than about 6 fuel tanks. The engines just weigh too darn much to bother with unless you absolutely have to.\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2011-09-02T05:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoctorEvo\u0022 data-cite=\u0022DoctorEvo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBoosters. Always boosters. Liquids are boring for anything but dinky rockets with just one or two stages.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m interested in your reasoning here\u003C/p\u003E\n"},{"CreatedByName":"DoctorEvo","CreatedById":4870,"CreatedDateTime":"2011-09-02T06:56:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022foamyesque\u0022 data-cite=\u0022foamyesque\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m interested in your reasoning here\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s something of an exaggeration, but the high weight of LFEs is not well-suited to large, multi-stage designs. For most of the rockets I build, this eliminates the viability of liquid-fuelled design schemes. I certainly KNOW the point where liquid-fuelled rockets gain the advantage over lighter and more modular solid-fuelled schemes, but due to various reasons including my inability to cope with slideshow-esque framerates, I can never reach this optimum in any practical form. I just can\u0027t build a rocket that lofts that fuel-heavy, 7-tank liquid upper stage, and for lighter upper stages, solid-fuelled schemes have a lot more delta-V.\u003C/p\u003E\u003Cp\u003EPlus, heavy liquid-fuelled rockets tend to be ridiculously tail-heavy, and I don\u0027t like having to cope with that.\u003C/p\u003E\u003Cp\u003ESo yeah, given all my practical limitations, my solid-fuelled designs generally outperform my liquid ones.\u003C/p\u003E\n"},{"CreatedByName":"salsathegeek","CreatedById":8011,"CreatedDateTime":"2011-09-03T04:20:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kerbalkicker\u0022 data-cite=\u0022kerbalkicker\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENot necessarily. I have no idea if the physics engine actually simulates this, but the faster you go the more heat you can dump to the air moving past. So yeah - a rocket sitting still will overheat faster than one that is moving through the atmosphere at a gazillion miles an hour.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really. Air can transfer heat by convection or conduction, but this only works if the air is cooler than the thing it\u0027s taking heat from. When something gets moving at even mach 2 friction starts becoming a problem. The F-111 could hit mach 2 at sea-level for only ten minutes because the canopy would melt from the heat from friction. The X-15 had a shutter over one of the windows so that the pilot could see after plowing through the upper atmosphere at mach 6. The reason reentry is so tricky is because the friction between the atmosphere and the ship is so great that it produces quite a lot of heat. So a rocket in motion is more likely to overheat than one standing still and wasting fuel.\u003C/p\u003E\n"},{"CreatedByName":"DoctorEvo","CreatedById":4870,"CreatedDateTime":"2011-09-03T10:14:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022salsathegeek\u0022 data-cite=\u0022salsathegeek\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENot really. Air can transfer heat by convection or conduction, but this only works if the air is cooler than the thing it\u0027s taking heat from. When something gets moving at even mach 2 friction starts becoming a problem. The F-111 could hit mach 2 at sea-level for only ten minutes because the canopy would melt from the heat from friction. The X-15 had a shutter over one of the windows so that the pilot could see after plowing through the upper atmosphere at mach 6. The reason reentry is so tricky is because the friction between the atmosphere and the ship is so great that it produces quite a lot of heat. So a rocket in motion is more likely to overheat than one standing still and wasting fuel.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly one issue here; most of the heating during reentry and high-speed flight is due to rapid compression of the nearby air, not friction. But yes, for aerodynamic heating to be dissipated, it must be either be radiated (either directly, or indirectly through some kind of coolant loop); or dumped overboard in the form of ablated materials (or, in the case of the SR-71 or X-30, burnt fuel). Otherwise, it must be absorbed or \u0027soaked\u0027 by the craft itself - which will result in overheating if prolonged for too long.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-09-03T13:50:29Z","Content":"\n\u003Cp\u003EAs a note, the X-15\u0027s \u0027eyelid\u0027 window wasn\u0027t related *directly* to the heat, and wasn\u0027t present on the original configuration. After X-15-2 suffered a horrific landing accident when a skid collapsed and it rolled down the lakebed at Edwards, it was rebuilt with a fuselage extension, provision for external drop tanks, and a new ablative thermal protection coating (which saw the pilots immediately DEMAND that it have some color, ANY color, painted over it, because there was no way in hell they were going to fly a pink spaceplane--they chose white, by the way), so that it could be used on the ultra-high-speed portions of the test program. (X-15-3 also gained drop tanks for extreme high-altitude work.)\u003C/p\u003E\u003Cp\u003EAfter one of the first large-scale plasma wind tunnel tests of the new configuration (I think--it MIGHT have been the very first flight of that configuration), someone noticed that the ablative coating would streak and cover the windscreen, rendering the pilot unable to see out of the cockpit to land. The quick-and-dirty solution was the \u0027eyelid\u0027 cover for the left-hand window, which would be kept closed until slow enough that ablator streaking was finished, then opened so that the pilot could see.\u003C/p\u003E\u003Cp\u003EAs a side note, there was a plan to mount the X-15 on top of a Titan II or III and fly it into orbit, with the same ablative coating, but apparently, the \u0027eyelid\u0027 window wouldn\u0027t have survived re-entry, as the proposal was for the pilot to ride out re-entry in the X-15, then eject over Edwards and let the vehicle crash onto a bombing range. Given the cost and limited value (Mercury could acheive the same goals with a less-expensive and ready-sooner Atlas booster, and without throwing away an expensive X-15 for each flight), the Air Force pretty much considered that about as seriously as NASA did the proposal of a one-way lunar mission. (A real proposal--send a one-man lander to the moon RIGHT NOW, then just keep sending supply ships to keep the astronaut alive \u0027until we figure out a way to get him back.\u0027 There were some *really* psychotic ideas spitballed back in the late 50s and early 60s...)\u003C/p\u003E\n"},{"CreatedByName":"DoctorEvo","CreatedById":4870,"CreatedDateTime":"2011-09-03T18:16:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E(X-15-3 also gained drop tanks for extreme high-altitude work.)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey weren\u0027t droptanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs a side note, there was a plan to mount the X-15 on top of a Titan II or III and fly it into orbit\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, it was a Navajo, and I hardly think they were serious about it at all. By the time the Air Force started looking at man-rated Titans, they had already moved onto what would become the X-20 Dyna-Soar.\u003C/p\u003E\u003Cp\u003ENot long after, they realized the Titan didn\u0027t have enough payload to lift the X-20 without modification. This led the Air Force and to put out a request for proposal for a larger booster, which is what ABMA\u0027s initial Saturn concepts were intended to fulfill, while Martin frantically tried to improve Titan so it could meet the requirements.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ethe Air Force pretty much considered that about as seriously as NASA did the proposal of a one-way lunar mission. (A real proposal--send a one-man lander to the moon RIGHT NOW, then just keep sending supply ships to keep the astronaut alive \u0027until we figure out a way to get him back.\u0027 There were some *really* psychotic ideas spitballed back in the late 50s and early 60s...)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell... that\u0027s... fun...\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2011-09-03T19:46:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoctorEvo\u0022 data-cite=\u0022DoctorEvo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWell... that\u0027s... fun...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHAT sounds like an eventual KSP mission.\u003C/p\u003E\n"},{"CreatedByName":"salsathegeek","CreatedById":8011,"CreatedDateTime":"2011-09-03T20:40:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EAs a note, the X-15\u0027s \u0027eyelid\u0027 window wasn\u0027t related *directly* to the heat, and wasn\u0027t present on the original configuration. After X-15-2 suffered a horrific landing accident when a skid collapsed and it rolled down the lakebed at Edwards, it was rebuilt with a fuselage extension, provision for external drop tanks, and a new ablative thermal protection coating (which saw the pilots immediately DEMAND that it have some color, ANY color, painted over it, because there was no way in hell they were going to fly a pink spaceplane--they chose white, by the way), so that it could be used on the ultra-high-speed portions of the test program. (X-15-3 also gained drop tanks for extreme high-altitude work.)\u003C/p\u003E\u003Cp\u003EAfter one of the first large-scale plasma wind tunnel tests of the new configuration (I think--it MIGHT have been the very first flight of that configuration), someone noticed that the ablative coating would streak and cover the windscreen, rendering the pilot unable to see out of the cockpit to land. The quick-and-dirty solution was the \u0027eyelid\u0027 cover for the left-hand window, which would be kept closed until slow enough that ablator streaking was finished, then opened so that the pilot could see.\u003C/p\u003E\u003Cp\u003EAs a side note, there was a plan to mount the X-15 on top of a Titan II or III and fly it into orbit, with the same ablative coating, but apparently, the \u0027eyelid\u0027 window wouldn\u0027t have survived re-entry, as the proposal was for the pilot to ride out re-entry in the X-15, then eject over Edwards and let the vehicle crash onto a bombing range. Given the cost and limited value (Mercury could acheive the same goals with a less-expensive and ready-sooner Atlas booster, and without throwing away an expensive X-15 for each flight), the Air Force pretty much considered that about as seriously as NASA did the proposal of a one-way lunar mission. (A real proposal--send a one-man lander to the moon RIGHT NOW, then just keep sending supply ships to keep the astronaut alive \u0027until we figure out a way to get him back.\u0027 There were some *really* psychotic ideas spitballed back in the late 50s and early 60s...)\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I learned something new. I knew the eyelid was to keep the window clear, I didn\u0027t connect it with the ablative heat shield, which I didn\u0027t know was pink. \u003C/p\u003E\u003Cp\u003EBut my point about air friction causing heating still stands.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022foamyesque\u0022 data-cite=\u0022foamyesque\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETHAT sounds like an eventual KSP mission.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0027Jeb, we\u0027re sending you, Bob, and Bill to the moon. That\u0027s good news. The bad news is it\u0027s a one way trip, good luck.\u0027 \u003C/p\u003E\u003Cp\u003EBob and Bill: \u0027NOOOOOOOOOOOOO!\u0027\u003C/p\u003E\u003Cp\u003EJeb: (:\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-09-03T23:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoctorEvo\u0022 data-cite=\u0022DoctorEvo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThey weren\u0027t droptanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMakes sense. I\u0027d heard them referred to as jettisonable, for weight reasons on X-15-3 and drag reasons on X-15A-2, but I would have been horrified by the thought of trying to engineer a system to jettison big tanks at mach 3-4 without having them \u0027bounce off\u0027 the shockwave and hit the vehicle.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EActually, it was a Navajo, and I hardly think they were serious about it at all. By the time the Air Force started looking at man-rated Titans, they had already moved onto what would become the X-20 Dyna-Soar.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgh, right, it was a Navajo launcher, not a Titan for the unmodified X-15. Interestingly, I have a book on the history of North American that includes a picture of a proposal that *was* meant for launch from a Titan III that NAA called the X-15B. By the narrow delta configuration and the booster of choice, it\u0027s pretty clear that it was the NAA entry in the Dyna-Soar competition.\u003C/p\u003E\n"}]}