{"TopicId":30367,"ForumId":35,"TopicTitle":"[WEB APP] Launch Window Planner","CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-05-31T01:34:07Z","PageNum":3,"Articles":[{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-12T02:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EI think Chrome 28 broke this, sadly. It still works in Firefox, so I don\u0027t think the site itself is broken. :-(\u003Cp\u003EEDIT: I should be more specific. The graphic isn\u0027t displaying (at all, even before I hit calculate), but everything else seems to be working fine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, Chrome 28 is working fine for me. If you\u0027re still having problems, can you let me know what platform you\u0027re using (i.e. Windows/Linux/Mac/Android)? Also, if you could go to the Tools menu and click on Javascript Console and let me know any error messages that are displayed, that would be helpful.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI\u0027m getting a strange issue, the dates on the porkchop plot are reversed:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOops, yeah that\u0027s a bug. It should be fixed now.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-12T05:26:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alexmun\u0022 data-cite=\u0022alexmun\u0022\u003E\u003Cdiv\u003EHmm, Chrome 28 is working fine for me. If you\u0027re still having problems, can you let me know what platform you\u0027re using (i.e. Windows/Linux/Mac/Android)? Also, if you could go to the Tools menu and click on Javascript Console and let me know any error messages that are displayed, that would be helpful.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas just getting on to say that a full reboot of the computer, thanks to a fan dieing, fixed the problem.\u003C/p\u003E\n"},{"CreatedByName":"Nephf","CreatedById":66354,"CreatedDateTime":"2013-07-12T18:33:22Z","Content":"\n\u003Cp\u003EThe site says Minimus, but it\u0027s Minmus\u003C/p\u003E\u003Cp\u003EAnd try to plot optimal transfer from a 150 Jool orbit to a 25 Eeloo orbit, is this bugged?\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2013-07-12T20:33:56Z","Content":"\n\u003Cp\u003ECould you please some manouver information like the exact ejection orbit and it delta-v values for prograd, normal and radial\u003C/p\u003E\u003Cp\u003EAnd it brakes if you set a minimum of 0 days of flight\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T20:37:46Z\u0022 title=\u002207/12/2013 08:37  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by Spanier\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-13T19:36:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nephf\u0022 data-cite=\u0022Nephf\u0022\u003E\u003Cdiv\u003EThe site says Minimus, but it\u0027s Minmus\u003Cp\u003EAnd try to plot optimal transfer from a 150 Jool orbit to a 25 Eeloo orbit, is this bugged?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood catch on the Minmus typo. It\u0027s fixed now.\u003C/p\u003E\u003Cp\u003EThe Jool to Eeloo transfer is unusual, I think because they are in resonant orbits. If you zoom out (click Show Advanced Settings then set the time of flight between 1 and 4000 days) you can start to see the pattern, particularly on the ballistic transfer type. On the plane change or optimal transfer type there are some discontinuities caused by my assumption that you always want a counter-clockwise transfer orbit. I think there may be a small region near that boundary where a clockwise transfer orbit would be more efficient (but still very expensive).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spanier\u0022 data-cite=\u0022Spanier\u0022\u003E\u003Cdiv\u003ECould you please some manouver information like the exact ejection orbit and it delta-v values for prograd, normal and radial\u003Cp\u003EAnd it brakes if you set a minimum of 0 days of flight\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEjection delta-v components are available if you hover over the delta-v value. I\u0027ve added an underline to make that more obvious. And I\u0027ve added some more sanity checking to the time of flight values.\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-07-16T21:45:49Z","Content":"\n\u003Cp\u003EThis tool is so thought-provoking. Why is it sometimes better to do a mid-course plane change and sometimes not?\u003C/p\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-17T02:58:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jackissimus\u0022 data-cite=\u0022Jackissimus\u0022\u003E\u003Cdiv\u003EThis tool is so thought-provoking. Why is it sometimes better to do a mid-course plane change and sometimes not?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt all depends on how expensive it is to do the plane change required to intercept your target. The two factors that go into determining how expensive the plane change is are:\u003C/p\u003E\u003Cp\u003E- The delta-v required for a plane change is directly related to your orbital velocity. So if you\u0027re in an eccentric orbit, the closer you are to apoapsis the cheaper it is.\u003C/p\u003E\u003Cp\u003E- The delta-v is also related to the sine of the half angle of the inclination change you need to make. Your inclination change is smallest if you change your plane 90 degrees before intercept and increases to 90 degrees if you wait until you\u0027re directly \u0022under\u0022 your intercept point before making your plane change maneuver.\u003C/p\u003E\u003Cp\u003ESo for a transfer to an outer planet the mid-course strategy works to find the point at which the decreasing delta-v because you are getting farther from the sun starts to get counteracted by the increasing delta-v as the angle you have to achieve increases towards 90 degrees.\u003C/p\u003E\u003Cp\u003ENow, when you\u0027re doing a ballistic transfer the raw delta-v for the inclination change is probably a lot higher than the inclination change delta-v for the mid-course strategy. For one thing, your orbital velocity around Kerbin is probably pretty high, and for another to shift your transfer orbit by a degree might take several degrees of inclination change to your ejection orbit (compare your ejection orbit inclination with your transfer orbit inclination to see what I mean). Both of those factors would seem to suggest that the mid-course plane change should always be better. However, there is one big factor in the ballistic strategy\u0027s favor and that is the law of cosines.\u003C/p\u003E\u003Cp\u003EWhat the law of cosines says is that if you combine two maneuvers into one you don\u0027t have to spend the sum of their delta-v\u0027s, instead it\u0027s related to the square root of the sum of their squares and the cosine of the angle between them (for a 90 degree angle, this is just the pythagorean theorem). So if we combine our ejection burn with the plane change burn the net delta-v becomes: sqrt(v0^2 \u002B (v0 \u002B dv[ejection])^2 - 2*v0*(v0 \u002B dv[ejection])*cos(angle)).\u003C/p\u003E\u003Cp\u003EFor a typical Duna transfer, the ejection delta-v without any plane change is about 1040 m/s. To do a ballistic transfer takes about a 2 degree ejection inclination in order to get about a 0.1 degree transfer inclination. Doing the plane change alone in a 100km Kerbin orbit (which has an orbital velocity of about 2250 m/s) would take about 80 m/s. Plugging into the formula we get sqrt(2250^2 \u002B 3290^2 - 2 * 2250 * 3290 * cos(2)) = 1044 m/s. So by combining the maneuvers we get to do an 80 m/s plane change maneuver for only 4 m/s more than the ejection would otherwise take.\u003C/p\u003E\u003Cp\u003ETL;DR: It works out that for transfers outer planets with small inclination changes and for transfers to inner planets with moderate inclination changes the ballistic transfer tends to be cheaper because the benefits from combining the maneuvers outweigh the cost of doing the plane change at a less optimal time. However for transfers to outer planets with significant inclination changes or transfers to inner planets with extreme inclination changes the benefits of a cheaper plane change exceed the benefit from combining maneuvers.\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-07-17T05:23:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alexmun\u0022 data-cite=\u0022alexmun\u0022\u003E\u003Cdiv\u003EAlexmun\u0027s post\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, I think I sort of understand it, although I\u0027m lucky you wrote the TLDR to sum it up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs there like a book or something that I should maybe read?\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2013-07-17T21:17:09Z","Content":"\n\u003Cp\u003EAwesome tool, cheers! Kudos for \u003Ca href=\u0022https://github.com/alexmoon/ksp\u0022 rel=\u0022external nofollow\u0022\u003Eputting the source up, too.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2013-07-24T12:47:08Z","Content":"\n\u003Cp\u003EI am not convinced that leaving the final orbit blank works properly (for fly-by or aerobraking). Plotting a Kerbin to Jool transfer with it blank gives me ejection dV results of around 2000 m/s. If I input a final orbit of 100 km, however, it gives me a best result of 1944 m/s (ejection). Surely the former should be giving lower dV results as the insertion dV is irrelevant and only the injection dV matters.\u003C/p\u003E\u003Cp\u003EOtherwise excellent tool with superb results.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-24T16:11:20Z\u0022 title=\u002207/24/2013 04:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 24, 2013\u003C/time\u003E by Grizzlol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-24T17:52:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grizzlol\u0022 data-cite=\u0022Grizzlol\u0022\u003E\u003Cdiv\u003EI am not convinced that leaving the final orbit blank works properly (for fly-by or aerobraking). Plotting a Kerbin to Jool transfer with it blank gives me ejection dV results of around 2000 m/s. If I input a final orbit of 100 km, however, it gives me a best result of 1944 m/s (ejection). Surely the former should be giving lower dV results as the insertion dV is irrelevant and only the injection dV matters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERunning those settings for a day 1 plot gives 1996m/s for a fly-by vs 2002m/s for a transfer with insertion. Can you tell me what other parameters you were using that gave you inconsistent results?\u003C/p\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2013-07-24T19:57:22Z","Content":"\n\u003Cp\u003ESorry, I forgot to add the plane change dV, it makes much more sense now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-24T20:28:00Z\u0022 title=\u002207/24/2013 08:28  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 24, 2013\u003C/time\u003E by Grizzlol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-24T20:29:55Z","Content":"\n\u003Cp\u003EOk, the main thing is that a mid-course plane change transfer is optimal for transferring to Jool. For a mid-course plane change you need to add both the ejection delta-v and the inclination change delta-v to get the delta-v required to reach your target. In the 150km final orbit case your delta-v to reach jool is 1950m/s ejection delta-v \u002B 138 m/s inclination change delta-v for a total of 2088m/s. In the fly-by case, your delta-v is 2003m/s ejection \u002B 60m/s inclination change for a total of 2063m/s, which is 25m/s cheaper than the insertion case. The reason the inclination change is included is because without the inclination change you will never reach your target.\u003C/p\u003E\u003Cp\u003EThe other thing to note is that for the fly-by case the point it picked is at the very top of the plot. That usually means there is a more optimal transfer with a longer time of flight. If you increase the time of flight to go up to 600 days in the advanced settings, you\u0027ll find a ballistic transfer with an ejection delta-v of 2047m/s which is even cheaper than the previous fly-by solution.\u003C/p\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2013-07-26T19:17:17Z","Content":"\n\u003Cp\u003EI assume that all transfers (including ballistic trajectories) are, as is explained, assumed to be departed from circular, equatorial orbits. Considering how accurate this tool is, how come you did not add the option to depart from an already appropriately inclined orbit, which would then result in less dV overall? I guess it does not apply if say you were to visit a station at an equatorial orbit first, but otherwise the vehicle could be launched from the ground inclined.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-26T19:42:06Z\u0022 title=\u002207/26/2013 07:42  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 26, 2013\u003C/time\u003E by Grizzlol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"voneiden","CreatedById":38803,"CreatedDateTime":"2013-07-27T09:33:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grizzlol\u0022 data-cite=\u0022Grizzlol\u0022\u003E\u003Cdiv\u003EI assume that all transfers (including ballistic trajectories) are, as is explained, assumed to be departed from circular, equatorial orbits. Considering how accurate this tool is, how come you did not add the option to depart from an already appropriately inclined orbit, which would then result in less dV overall? I guess it does not apply if say you were to visit a station at an equatorial orbit first, but otherwise the vehicle could be launched from the ground inclined.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t the lambert solver exactly solve a non-planar transfer? Could \u0022Ejection inclination\u0022 be the information you\u0027re looking for?\u003C/p\u003E\u003Cp\u003EE: Of course you still need to figure the right launch angle and time of launch yourself to be able to get on the correctly oriented parking orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-27T09:36:06Z\u0022 title=\u002207/27/2013 09:36  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 27, 2013\u003C/time\u003E by voneiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2013-07-27T11:52:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022voneiden\u0022 data-cite=\u0022voneiden\u0022\u003E\u003Cdiv\u003EDoesn\u0027t the lambert solver exactly solve a non-planar transfer? Could \u0022Ejection inclination\u0022 be the information you\u0027re looking for?\u003Cp\u003EE: Of course you still need to figure the right launch angle and time of launch yourself to be able to get on the correctly oriented parking orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that is just the inclination you end up with after the burn is complete. Executing the burn from an equatorial orbit works perfectly well, so I assume that it would not be the case had the same burn been executed from an inclined orbit (given that the ejection dV has a normal or anti-normal component to it).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-27T11:59:01Z\u0022 title=\u002207/27/2013 11:59  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 27, 2013\u003C/time\u003E by Grizzlol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-07-27T12:02:37Z","Content":"\n\u003Cp\u003EYou essentially just wouldn\u0027t need the normal component of the ejection burn, if you happened to be sitting in an inclined parking orbit with exactly the correct inclination and LAN as the hyperbolic ejection orbit. Timing the LAN to be correct is the tricky part, you\u0027d have to work that out from the ejection angle and the departure time.\u003C/p\u003E\n"},{"CreatedByName":"Grizzlol","CreatedById":40170,"CreatedDateTime":"2013-07-27T12:11:53Z","Content":"\n\u003Cp\u003EThat makes sense, so what is missing here is a tool to figure out the approximate launch time and exact inclination which is a problem aside.\u003C/p\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-28T00:03:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grizzlol\u0022 data-cite=\u0022Grizzlol\u0022\u003E\u003Cdiv\u003EThat makes sense, so what is missing here is a tool to figure out the approximate launch time and exact inclination which is a problem aside.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe inclination you want is the ejection inclination. You would want to launch when the KSC is at the ejection angle relative to Kerbin\u0027s prograde vector (or actually, just slightly before). The delta-v of the burn from that orbit is a little more complicated than just the prograde component, unfortunately. If v(prograde) is the prograde component of the normal burn, v0 is your circular orbital velocity and i is the inclination, you can calculate the delta-v by:\u003C/p\u003E\u003Cp\u003Edv = (v(prograde) \u002B v0) / cos(i) - v0\u003C/p\u003E\u003Cp\u003EAnd you would want to time your burn for when you\u0027re passing over the equator in your inclined orbit, either the ascending node for positive inclinations or the descending node for negative inclinations.\u003C/p\u003E\u003Cp\u003EOverall the procedure is complicated enough that I don\u0027t think it\u0027s usually worth it.\u003C/p\u003E\n"},{"CreatedByName":"tssn1611","CreatedById":64821,"CreatedDateTime":"2013-08-12T08:51:23Z","Content":"\n\u003Cp\u003EAny thoughts on adding graphical plotting of the transfer orbits, such as in Arrowstar\u0027s KSPTOT, instead of (or in addition to) the text readout? Seems like you might be able to display the same information in a much more intuitive fashion than a wall of text.\u003C/p\u003E\u003Cp\u003EBTW, as it is, it\u0027s a very nice, light-weight tool. I might try to make use of it for my Moho trip that I have yet to complete ...\u003C/p\u003E\u003Cp\u003EAlso, a bug report (or perhaps just an oversight): in Chrome 28, the \u0022Reset\u0022 button sets the \u0022Latest Departure\u0022 field to Year 1, Day 1 and the \u0022Time of Flight\u0022 fields both to 1 day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T09:08:32Z\u0022 title=\u002208/12/2013 09:08  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by tssn1611\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-08-13T14:34:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tssn1611\u0022 data-cite=\u0022tssn1611\u0022\u003E\u003Cdiv\u003EAny thoughts on adding graphical plotting of the transfer orbits, such as in Arrowstar\u0027s KSPTOT, instead of (or in addition to) the text readout? Seems like you might be able to display the same information in a much more intuitive fashion than a wall of text.\u003Cp\u003EBTW, as it is, it\u0027s a very nice, light-weight tool. I might try to make use of it for my Moho trip that I have yet to complete ...\u003C/p\u003E\u003Cp\u003EAlso, a bug report (or perhaps just an oversight): in Chrome 28, the \u0022Reset\u0022 button sets the \u0022Latest Departure\u0022 field to Year 1, Day 1 and the \u0022Time of Flight\u0022 fields both to 1 day.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t have any plans to add a graphical plot of the transfer orbit at the moment. I know it would be useful, but I\u0027m not convinced it\u0027s useful enough to justify the effort, at least for me.\u003C/p\u003E\u003Cp\u003EThanks for the bug report, I\u0027ll work on getting that fixed.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-18T17:44:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alexmun\u0022 data-cite=\u0022alexmun\u0022\u003E\u003Cdiv\u003E\u003Cul\u003E\u003Cli\u003EAdded a tooltip to the ejection delta-v parameter giving the prograde and normal components of the maneuver.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded UT tooltips to dates in the transfer details.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just noticed this, thank you and well done!\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-23T05:56:59Z","Content":"\n\u003Cp\u003EI\u0027m a big fan of the ability to do suboptimal transfers at odd times so I do a lot of planning with your app, but I seem to have to do a lot of high delta-V corrections after doing the indicated burn. Here is a plot I recently ran:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xOx0GNi.png\u0022 alt=\u0022xOx0GNi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6jfjH0e.png\u0022 alt=\u00226jfjH0e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI then plugged the UT and burn parameters directly into Maneuver Node Improvement (because MechJeb doesn\u0027t allow me to set a UT) and then used MechJeb to execute the maneuver. My craft has a TWR around 0.4 so the burn took a good 6 minutes; not at all unreasonable and MechJeb did a half/half burn so it should be at least be somewhat accurate. Here is the resulting orbit from the plot above:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6ab2C0B.jpg\u0022 alt=\u00226ab2C0B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t know if this is an issue with the plot or Maneuver Node Improvement but there are no intercepts on the orbit (you can\u0027t really see, but it goes right through Moho\u0027s orbit) and it looks like it ended up inclined way too much. I tried doing a correction node but couldn\u0027t find an intercept anywhere near the stated time on the plot. It looks like Moho is too far advanced for the earlier time so I tried getting an intercept on the other side of the sun and found a relatively close intercept (not within SOI), but it added an additional 800m/s on to my trip.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if I just need some direction on using this tool. I\u0027ll try using the mid-course correction and just plug in the values, and let MechJeb do the burns to see what happens.\u003C/p\u003E\n"},{"CreatedByName":"Crater","CreatedById":48907,"CreatedDateTime":"2013-08-23T08:29:46Z","Content":"\n\u003Cp\u003EDid you just time it for exactly the UT specified, or did you adjust it to correct the ejection angle? (If the latter, I\u0027d love to know how you worked it out, as I end up eyeballing them as often as not)\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2013-08-23T13:37:16Z","Content":"\n\u003Cp\u003EIn my Moho trip I had to drag around my maneuver node (neglecting the whole \u0022your ejection path must be parallel\u0022 stuff since I couldn\u0027t get even a close approach marker with that) for get an intersect, it was all good until I had to do the insertion burn, as I had to use like 4km/s more of what it was indicated by the app. It was the same launch window, with departure in day 10. Next time I will try to be more rigorous but it does seem that small errors in your initial burn create bigger ones later.\u003C/p\u003E\n"}]}