{"TopicId":30639,"ForumId":21,"TopicTitle":"SSTOs! Post your pictures here~","CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-06-01T06:21:17Z","PageNum":26,"Articles":[{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-12T17:51:56Z","Content":"\n\u003Cp\u003EAletzN1, here you go... my first working SSTO non-space plane design. SVO-2.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img571/1731/tvc5.jpg\u0022 alt=\u0022tvc5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img89/9757/fyru.jpg\u0022 alt=\u0022fyru.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill working on landing it on Kerbin... but in launch to landing without breaking atmo, climbing to 500m then moving and landing near the runway, it works.\u003C/p\u003E\u003Cp\u003EIt has 2 cargo bays, and can ferry 12 Kerbalnaughts to space... possibly to Mun if I manage to perfect the launch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-12T17:54:49Z\u0022 title=\u002209/12/2013 05:54  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 12, 2013\u003C/time\u003E by Hodo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaebn","CreatedById":76969,"CreatedDateTime":"2013-09-12T21:05:00Z","Content":"\n\u003Cp\u003EHi AletzN1! I\u0027ve actually accidentally done a couple of those in my explorations for a SSTO Tylo lander (I don\u0027t like my ships littering like *some* people) \u003C/p\u003E\u003Cp\u003EHere\u0027s one, full stock, minus the mechjeb:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s13.postimg.org/hrkgfzfh1/screenshot391.png\u0022 alt=\u0022screenshot391.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/efuvufivl/screenshot392.png\u0022 alt=\u0022screenshot392.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s8.postimg.org/w4lpje4g5/screenshot393.png\u0022 alt=\u0022screenshot393.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI call it the \u0022The Space Booth\u0022. In fact, this silly thing not only makes it to an 100km orbit, but if you do a Hoffman transfer it has enough fuel to crash on the moon. \u003C/p\u003E\u003Cp\u003ESo I guess you could call it it a Single Stage to Moon Impactor or something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ECraft file to confirm: \u003Ca href=\u0022http://www.sendspace.com/file/ud9ois\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sendspace.com/file/ud9ois\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd yes, for that matter, it is a fully a capable 100km to surface, surface to 100km, SSTO Tylo lander as well, if interested. Or don\u0027t mind carrying a 80tn \u0022lander\u0022 around.\u003C/p\u003E\u003Cp\u003EAnd here\u0027s another one! (told ya I have lots). This is not exactly a lander design, but a derivative of one which I figured could make it to Kerbin Orbit with a couple of tweaks.\u003C/p\u003E\u003Cp\u003EIt makes it to 70km Kerbin Orbit, again full stock, minus Mechjeb:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s21.postimg.org/qmg3ipg39/screenshot399.png\u0022 alt=\u0022screenshot399.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s17.postimg.org/fhivef8a7/screenshot400.png\u0022 alt=\u0022screenshot400.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s17.postimg.org/a8nugjpv3/screenshot403.png\u0022 alt=\u0022screenshot403.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWat. LV-Ns? I know that these make no sense on Kerbin but in makes more sense on Tylo. Notice the aerospike in the middle.\u003C/p\u003E\u003Cp\u003EThis actually starts with a terrible TWR on Kerbin of, uh, 1.04, but as it consumes fuel it improves. At about 30km, I shut down the aespike and LV-Ns can do the rest alone.\u003C/p\u003E\u003Cp\u003ECraft file to confirm: \u003Ca href=\u0022http://www.sendspace.com/file/98dve1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sendspace.com/file/98dve1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERemember that you are looking at lander design derivatives so none of those are really meant to carry any payload or land again, they are however \u0022rocket fuel only, stock parts, SSTO\u0022s ^^\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-12T22:40:29Z\u0022 title=\u002209/12/2013 10:40  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 12, 2013\u003C/time\u003E by Vaebn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-09-12T21:21:26Z","Content":"\n\u003Cp\u003EFrom the depths of the 6th page of the rocket builders subforum, I have come with finally, a cargo lifter.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EZQK9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003E C20S4-2 \u0022Supper Guppy\u0022 Monarch \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/5kbbsnajifvoh7n/C20S4-2%20Monarch.craft\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBarely controllable, the Monarch is created out of my unwillingness to compromise between form, function, and my own self-imposed rule of what can and cannot be clipped. The end result, as you can see, is an utterly ridiculous looking plane that works with FAR with a maximum payload of 20 tons to a 75x75 orbit. And yes, before you ask, the cargo detaches from the plane as if it were in a proper cargo bay (minus doors) thanks to the magic of SelectRoot. The action groups have been set up so you can turn the turbojets off in stages, starting from the ones on the sides, the top one, and finally the bottom one. It is advised that you don\u0027t start the rockets before reaching 1500 m/s. If you need to shorten the cargo bay for whatever reason, take off the rear I-beam and replace the front one.\u003C/p\u003E\u003Cp\u003EAt this point, some of you may be questioning what\u0027s with the \u0022Supper Guppy\u0022. As some may have noticed, I attempted to replicate the bloated hull look. Of course, the Super Guppy does not have a massive delta wing trailing behind it, but at least I got the cockpit position right. As for why it\u0027s Supper instead of Super, it was a typo that stuck since I thought it was funny.\u003C/p\u003E\u003Cp\u003EIf you feel like you want to use this, do note that an autopilot mod is highly recommended. It\u0027s perfectly flyable by hand, yes, but not comfortable at all thanks to the slow nature of the SAS. Once we get a hard lock SAS, flying this will be much easier.\u003C/p\u003E\n"},{"CreatedByName":"Keranolist","CreatedById":82402,"CreatedDateTime":"2013-09-12T21:33:41Z","Content":"\n\u003Cp\u003ENot only SSTO but SSTD - Single Stage to Duna!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/1117178606725075440/33653EC19D7AF79C25B15F07CD844D8D3D723D43/\u0022 alt=\u002233653EC19D7AF79C25B15F07CD844D8D3D723D43\u0022\u003E\u003C/p\u003E\u003Cp\u003ECruising around in the atmosphere - sadly i didn\u0027t managed to land because jet engines wont work without oxygen and the rocket engine freaked me out for \u0022normal\u0022 flying with this design, after like 10 attempts I gave up and returned (safely! yay!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/1117178606725077115/C0B7D3D35960F5724E3EF9C4CDCCDEEE29D82E4E/\u0022 alt=\u0022C0B7D3D35960F5724E3EF9C4CDCCDEEE29D82E4E\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m really proud of this for myself because around a week before this mission I wasnt even able to build an airplane that was flying straight in one direction \u003Cimg src=\u0022https://forum.kerbalspaceprogram.com/images/smilies/k_angry.gif\u0022 alt=\u0022k_angry.gif\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"speedboiae86","CreatedById":67419,"CreatedDateTime":"2013-09-13T01:11:18Z","Content":"\n\u003Cp\u003ESpartan 300 Industries proudly presents, our latest and greatest single stage to orbit spaceship, Project Icarus Mk. II\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash4/1238036_10151849496581815_555635172_n.jpg\u0022 alt=\u00221238036_10151849496581815_555635172_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIcarus is capable of reaching a stable 80x80 km orbit around Kerbin, with fuel leftover for some small delta-v maneuvers, such as rendezvousing with a space station to refuel. It carries three Turbofan Jet engines, and single LV-T30 liquid engine. It is capable of supersonic speeds, this SSTO was built to go fast. The cost of making this beast so fast, is that it\u0027s light on fuel and oxidizer, so skillful piloting is required. A plethora of Ram Air intakes will keep the jets breathing upwards of 25km. She has plenty of onboard RCS for docking maneuvers, and a topside Clamp-o-tron Jr. docking port allows the ship to dock at a space station for refuelling. It features a vertical landing system for airless worlds in the form of retractable rear mounted landing legs. A single radiothermal generator supplies all this ships power needs. Should s*it hit the fan, this ship features a safety system that ejects the pilot capsule. A top mounted parachute brings the capsule safely to the ground.\u003C/p\u003E\u003Cp\u003EAll stock parts, Mechanical Jeb only shown in the photos. Craft file will be up as soon as I have it uploaded.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-13T08:41:14Z","Content":"\n\u003Cp\u003EAnd back to spaceplanes... I find the non-space plane designs to be less efficient than the space plane design. You use so much fuel getting to orbit, but you can do it faster. But it could be I suck with them. \u003C/p\u003E\u003Cp\u003EBut I found a hidden gem in my previous work. The \u0022Trident\u0022 space plane. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img801/1434/br3i.jpg\u0022 alt=\u0022br3i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E32 ton cargo to orbit of 73km, could have gone higher, but needed to stay lower than my station at 75km to catch it. Finally building a refueling station in orbit... so ferrying parts up to it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img833/883/ikhg.jpg\u0022 alt=\u0022ikhg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eanother shot without the UI up. It actually flies like a dream when empty. But I found one minor flaw in the design... with that much weight in the cargo bay, it shifts the center of weight further forward of the center of lift, making flight a bit of a balancing act until you get up to supersonic speeds. Good news is that only takes about 2 min after take off.\u003C/p\u003E\n"},{"CreatedByName":"RocketTurtle","CreatedById":67534,"CreatedDateTime":"2013-09-13T20:38:08Z","Content":"\n\u003Cp\u003EOne question... what is Stabojet?\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2013-09-13T21:05:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketTurtle\u0022 data-cite=\u0022RocketTurtle\u0022\u003E\u003Cdiv\u003EOne question... what is Stabojet?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStabojet is when you angle your jet engines so they always point through the center of mass. that way when you flame out your active engine is still in line with the center of mass and you don\u0027t spin-out. Then you can throttle back and reignite the engine that flamed out.\u003C/p\u003E\u003Cp\u003EThe trade- off is that the more you angle your jets, the more they thrusting against each other, creating inefficiency. So ideally you want to have them angled as little as possible, and the center of mass moving as little as possible.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-13T21:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne question... what is Stabojet?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHahah. Good question!. The thing is, it\u0027s the name of a craft by... I think it was Meticulous Mitch, but the main thing is it was a jet-powered SSTO, and that he angled (quite brilliantly) the jet engines so their thrust would go through the center of mass of the craft. That meant, that when one of the jets flamed out, no matter which one, he wouldn\u0027t get any spin, just the thrust would be angled towards the direction of travel slightly. Amazing idea! no more flat spins of death making you restart the flight after you spent ten minutes getting to altitude.\u003C/p\u003E\u003Cp\u003EAnd we are all so grateful he posted the idea, we named the concept after the craft. Quite simple, and it\u0027s no law or anything, buty I always refer to it by that name.\u003C/p\u003E\u003Cp\u003ERune. Also, he is also the guy (I think) that first worked out how to do stock helicopters with aerodynamic controls work. Shame his bearing system no longer works.\u003C/p\u003E\n"},{"CreatedByName":"RocketTurtle","CreatedById":67534,"CreatedDateTime":"2013-09-13T22:06:52Z","Content":"\n\u003Cp\u003EOh... thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"speedboiae86","CreatedById":67419,"CreatedDateTime":"2013-09-14T00:37:32Z","Content":"\n\u003Cp\u003ESupersonic SSTO - Icarus Mk.III - Upgraded over the original, now capable of getting up to speed much faster with 5 Turbofan Jet Engines, arranged with StaboJet technology. Jets are angled through the center of mass, so if one flames out, it is quite easy to recover by throttling back, and reigniting the engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-ash3/600141_10151851195171815_529836397_n.jpg\u0022 alt=\u0022600141_10151851195171815_529836397_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESitting on the runway, standing by for takeoff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-ash3/1175210_10151851194751815_1212772343_n.jpg\u0022 alt=\u00221175210_10151851194751815_1212772343_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn a stable 80km orbit around Kerbin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T00:40:06Z\u0022 title=\u002209/14/2013 12:40  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by speedboiae86\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-09-14T01:24:53Z","Content":"\n\u003Cp\u003EMy first ever SSTO\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/600392284662270263/BE366D61EAB2ACB6FB576A4DFD8C27F6FF89DD42/\u0022 alt=\u0022BE366D61EAB2ACB6FB576A4DFD8C27F6FF89DD42\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/600392284662262916/F040E21DDCC1AA0C8DD2BFE6A6708C0D00055CD9/\u0022 alt=\u0022F040E21DDCC1AA0C8DD2BFE6A6708C0D00055CD9\u0022\u003E\u003C/p\u003E\u003Cp\u003EI Just need to tweak its capabilities a bit, but I should be able to use it to ferry Kerbals and a small amount of cargo to and from space stations and interplanetary craft in Kerbin orbit.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-14T03:58:32Z","Content":"\n\u003Cp\u003Ejfull, looks good. Once you start, you will always want bigger.\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-09-14T04:34:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003Ejfull, looks good. Once you start, you will always want bigger.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, funny you should say \u003Cem\u003Ebigger\u003C/em\u003E\u003C/p\u003E\u003Cp\u003Ebecause, for my next project, I went in exactly the opposite direction\u003C/p\u003E\u003Cp\u003EThe Mayfly:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/600392284666822153/2A78DCABD5ADA065DF578CB116BDC96E9DE73A0D/\u0022 alt=\u00222A78DCABD5ADA065DF578CB116BDC96E9DE73A0D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/600392284666827052/9F530145D7CB10CBD1DA597C8F6265914C9B1FE0/\u0022 alt=\u00229F530145D7CB10CBD1DA597C8F6265914C9B1FE0\u0022\u003E\u003C/p\u003E\u003Cp\u003E...I still can\u0027t believe it makes it to orbit\u003C/p\u003E\u003Cp\u003EThis prototype has way to much liquidfuel though, and not enough oxydizer to de-orbit it.\u003C/p\u003E\u003Cp\u003EI\u0027ll fix it in the final version, which will also be able to dock.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T04:37:41Z\u0022 title=\u002209/14/2013 04:37  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by jfull\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-14T08:20:15Z","Content":"\n\u003Cp\u003ETonight I did this one... which I call the Wyrm, only because of its flight characteristics. But it managed to get a 60 ton part into orbit and connected to my space station project and land back at KSC, thats when I took the picture. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img90/3082/ygoc.jpg\u0022 alt=\u0022ygoc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo this, which is the smallest cargo hauler I have ever made. I don\u0027t know how much it can fit in that tiny cargo bay but I cant imagine much more than 8 tons maybe 10. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img809/1653/rvnh.jpg\u0022 alt=\u0022rvnh.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-09-16T01:40:16Z","Content":"\n\u003Cp\u003EHere\u0027s my contribution to SSI\u0027s catalogue! Figured I\u0027d post it here as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a VTOL SSTO, (VTOL is atmospheric only).\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/uVg5p\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-09-16T04:18:45Z","Content":"\n\u003Cp\u003EWhat is it\u0027s top speed in atmosphere using only the Jet Engines Cruzan?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T05:47:12Z\u0022 title=\u002209/16/2013 05:47  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by KissSh0t\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-09-16T05:46:11Z","Content":"\n\u003Cp\u003EGood question. I actually didn\u0027t know so I did a test run for you to find out since you got me curious. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/48tcNXX.jpg?1\u0022 alt=\u002248tcNXX.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooks like 2382m/s. I usually don\u0027t push it that long because I\u0027m impatient and switch to the nuke earlier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T05:49:35Z\u0022 title=\u002209/16/2013 05:49  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by Cruzan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-09-16T05:49:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cruzan\u0022 data-cite=\u0022Cruzan\u0022\u003E\u003Cdiv\u003EGood question. I actually didn\u0027t know so I did a test run for you to find out since you got me curious. \u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/48tcNXXl.jpg\u0022 alt=\u002248tcNXXl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooks like 2382m/s. I usually don\u0027t push it that long because I\u0027m impatient and switch to the nuke earlier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrust you to reply as I edit my post haha..\u003C/p\u003E\u003Cp\u003EI mean in atmosphere.. not out of atmosphere... Because of it\u0027s small size I was curious how fast it can go before running out of air and having to switch to rocket engines.\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-09-16T05:51:58Z","Content":"\n\u003Cp\u003EI\u0027m technically still in atmosphere there at 41km. I had .03 units of intake air left to throttle around with before switching if I wanted to.\u003C/p\u003E\u003Cp\u003EI can test it at a lower altitude if you want though, just give me a number to shoot for!\u003C/p\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-09-16T10:16:31Z","Content":"\n\u003Cp\u003EHaha! well.... I guess it does count in that situation xD\u003C/p\u003E\u003Cp\u003EVery good.\u003C/p\u003E\n"},{"CreatedByName":"pinolallo","CreatedById":47075,"CreatedDateTime":"2013-09-16T22:02:42Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EHere a SSTO production project and the data sheets of 6 SSTO\u0027s builded using my standar SSTO body (in version v1, v2)\u003C/p\u003E\u003Cp\u003EYou can find more info inside the album descriptions.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xrr3q\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Mrwood","CreatedById":79207,"CreatedDateTime":"2013-09-17T04:14:31Z","Content":"\n\u003Cp\u003EI\u0027m using the S2 six meter cargo bay on the B9 mod, but I\u0027m having cargo problems. I don\u0027t have a joystick and when I use SAS after take off the cargo snaps off inside the cargo bay and through the fuselage due to body flex. (I\u0027m using FAR also). I have a docking node on the door of the forward section holding the cargo. Any ideas as to how I can keep the oscillations down or secure the cargo better? I don\u0027t think I can do the same thing on the rear end because my cargo has a rocket engine on it. If I put structure links on it will it undock once I reach orbit? Can I put something on the bottom/sides of the cargo bay?\u003C/p\u003E\u003Cp\u003EThanks in advance.\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/images/smilies/k_huh.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/images/smilies/k_huh.gif\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-09-17T04:31:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cruzan\u0022 data-cite=\u0022Cruzan\u0022\u003E\u003Cdiv\u003EHere\u0027s my contribution to SSI\u0027s catalogue! Figured I\u0027d post it here as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EIt\u0027s a VTOL SSTO, (VTOL is atmospheric only).\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/uVg5p\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh wow... that makes my Mayfly compact SSTO look like a jet liner by comparison.\u003C/p\u003E\u003Cp\u003EYou should dock a few of them on an interplanetary ship and send them to Laythe, they\u0027d be perfect.\u003C/p\u003E\n"},{"CreatedByName":"pa1983","CreatedById":58328,"CreatedDateTime":"2013-09-17T10:05:38Z","Content":"\n\u003Cp\u003EMy latest SSTO. A lot of people on the forum and on youtube have requested a Medium SSTO spaceplane so I hope this fits the bill. Modifications should be easy enough for those that need docking ports, more fuel, no payload doors etc. This is the basic multipurpose version.\u003C/p\u003E\u003Cp\u003EIt has a very high lift rate so very efficient climber even at low speeds. It has about 44ton of trust with 4 turbojets at take off and a take of tonnage of 70 tons with a 9 ton payload still it can climbs with very good efficiency that can be seen by the almost parallel smoke trail during the initial 45 degree climb. I got away with 50 intakes, a lot but not as many as I would have figured.\u003C/p\u003E\u003Cp\u003EFlight instructions and the craft file can be found in the description in the youtube video. You can also go to my channel using the link in my signature.\u003C/p\u003E\u003Cp\u003EHere is a video of the new SSTO, Falcon XIV Kosmos doing her first successful trip.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/ayHBGs9Ztrw\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/ayHBGs9Ztrw\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img404/9573/cfok.png\u0022 alt=\u0022cfok.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img843/1458/rqoo.png\u0022 alt=\u0022rqoo.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-17T10:07:43Z\u0022 title=\u002209/17/2013 10:07  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 17, 2013\u003C/time\u003E by pa1983\u003C/strong\u003E\n\u003C/span\u003E\n"}]}