{"TopicId":30639,"ForumId":21,"TopicTitle":"SSTOs! Post your pictures here~","CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-06-01T06:21:17Z","PageNum":61,"Articles":[{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-11T23:09:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KissSh0t\u0022 data-cite=\u0022KissSh0t\u0022\u003E\u003Cdiv\u003EI figured something out today.\u003Cp\u003EI\u0027ve been building SSTO\u0027s where the fuel tanks are as close to the middle of the craft as possible so when the fuel drains the weight doesn\u0027t shift too much making the aircraft balanced like it was when full.\u003C/p\u003E\u003Cp\u003EThis is the thing I learned... if you have a fuel tank at the front of the craft, and a fuel tank in the rear of the craft, then having the front fuel tank feed the engines on the left of the craft, and the rear fuel tank feeding the engines on the right of the craft.. the drain will be even front and back in turn not making weight shift as it drains.\u003C/p\u003E\u003Cp\u003EIf you take this design principal it means you can have space in the middle of the craft for taking things as cargo.\u003C/p\u003E\u003Cp\u003E: D\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s also method of placing 3 FL T400s lengthways and and having the front and rear tank feed simultaneously to the engine. I\u0027ll add the \u0022perfect fuel/engine pod\u0022 to construction techniques thread when I get the time to make some screen caps.\u003C/p\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2014-02-11T23:43:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EThere\u0027s also method of placing 3 FL T400s lengthways and and having the front and rear tank feed simultaneously to the engine. I\u0027ll add the \u0022perfect fuel/engine pod\u0022 to construction techniques thread when I get the time to make some screen caps.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELink it here when you get around to it..\u003C/p\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2014-02-11T23:44:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Silverchain\u0022 data-cite=\u0022Silverchain\u0022\u003E\u003Cdiv\u003ESkurj-class \u003Cem\u003ERamtut III\u003C/em\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YJCfw7x.png\u0022 alt=\u0022YJCfw7x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESkurj-class \u003Cem\u003ERa Ra Rasputin\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uyqusmk.png\u0022 alt=\u0022uyqusmk.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat landing *___*\u003C/p\u003E\n"},{"CreatedByName":"Fellow314","CreatedById":76781,"CreatedDateTime":"2014-02-11T23:54:54Z","Content":"\n\u003Cp\u003EDelivering station hub to orbit.\u003C/p\u003E\u003Cp\u003EStation fitted with two \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69150-Hercules-Manned-Maneuvering-Unit-Mk-10\u0022 rel=\u0022external nofollow\u0022\u003EHerculese MMUs\u003C/a\u003E, two escape pods and a possibly pointless engine.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GTYqM\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2014-02-12T00:15:21Z","Content":"\n\u003Cp\u003EVery Nice \u003Cstrong\u003E\u003Cem\u003EFellow314\u003C/em\u003E\u003C/strong\u003E~!~~!\u003C/p\u003E\n"},{"CreatedByName":"Fellow314","CreatedById":76781,"CreatedDateTime":"2014-02-12T00:16:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KissSh0t\u0022 data-cite=\u0022KissSh0t\u0022\u003E\u003Cdiv\u003EVery Nice \u003Cstrong\u003E\u003Cem\u003EFellow314\u003C/em\u003E\u003C/strong\u003E~!~~!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m far too pleased with myself over that one and it\u0027s little brother.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-02-12T00:41:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EIn that example, the payload was the command pod and the attached parts (4.6 tonnes), and the launch mass was 16 tonnes, so the payload fraction was a bit less than 29%. I already started building a bigger model that turned out to be quite ridiculous.\u003Cp\u003E\u003Ca href=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/ridiculous_lifter.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.cs.helsinki.fi/u/jltsiren/stuff/ridiculous_lifter.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe lifter scaled up quite well and behaved pretty much the same as the smaller model during the ascent. With 16 turbojets and a Skipper, the launch mass was 115.3 tonnes, including payload. That got the 36.2-tonne payload into a 125x121 km orbit, with about 350 m/s of delta-v remaining. The total mass will increase by a few tonnes, when I add landing gear and some parachutes for parachute-assisted powered landing.\u003C/p\u003E\u003Cp\u003EI\u0027m not going to use more than one intake per engine, unless the drag model changes to take the air flow from intakes to engines into account. This means that I have to switch from jets to rockets when the airspeed is around 1950 m/s, or risk going into spin and losing at least 50 m/s.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you pretty much confirm what I say. It would be really weird if it didn\u0027t scale indeed. Now I must confess, I am rather impressed you can milk 1950m/s out of a 1:1 intake ratio. You must have a keen ear for flameout and fast reflexes! But you are also helped by the fact that almost-rocket SSTOs are very easy in KSP, and your exploits, however cool (don\u0027t deny that), don\u0027t really contradict my point: you would get better payload ratio with less engines and more wings and liquid fuel.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EI would add to that the need to make the distinction between a short range heavy lifter and a long range light lifter. If you are pushing a high payload fraction into LKO then a \u0026gt;1 TWR is best. Those 30min ascents scrub out huge amounts of fuel in the form of atmospheric drag which you don\u0027t benefit from if you are only popping up into lower orbit. With a long range craft you do get the payback with more fuel during space flight having burnt the jet fuel on the way up.\u003Cp\u003EI also think basic jets are an awesome way to get your SSTO TWR up. Just when your basics cut out your turbos are starting to peak in the thrust department. Also, you don\u0027t need many turbos at the top of the atmosphere, they tend to be dead weight. I\u0027ve seen too many designs that use too many just for getting through the lower atmosphere when basic jets are lighter, more fuel efficient and have more thrust(and just as useless as extra turbos at high altitudes).\u003C/p\u003E\u003Cp\u003EMy rule of thumb is about 0.8TWR of turbos, 0.5TWR of basics and 0.2TWR on nukes.\u003C/p\u003E\u003Cp\u003EEDIT: These numbers are ground level engine outputs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s kind of wrong on both counts... first, extra jet fuel to climb means crap when you are counting weight in orbit. Its empty tanks, and they are light at that. It won\u0027t hurt your final in-space delta-v one bit, and heavy jet engines will. Much, much more. So high T/W gets you less payload fraction on orbit every time, regardless of final orbit, all other parameters like jet cutoff speed being equal.\u003C/p\u003E\u003Cp\u003EAnd second, and this is a very extended, and very wrong, belief, standard jet engines are wasted weight on SSTOs. Yes, they give more T/W on the low atmosphere. So what? \u003Cem\u003EThe only place you would want the highest T/W is high in the atmosphere, right before flameouts start.\u003C/em\u003E That is crucial. It doesn\u0027t really matter how long it takes you to get to rocket takeover, as I said, empty aviation fuel tanks are light (or full, for that matter), but what really matters for your final mass fraction to orbit, is your rocket takeover speed. And for a given intake-engine ratio, the higher T/W gets a higher flameout speed. So totally wrong to saddle yourself with 0.5mT to have a bit more thrust were it\u0027s totally useless except to shave off one minute or two on the climb to orbit.\u003C/p\u003E\u003Cp\u003ERune. Well now it looks as if I\u0027m looking down on your ships... totally not the idea!! I like VTOL SSTOs!! Even non airbreathing ones!\u003C/p\u003E\n"},{"CreatedByName":"Cinocal","CreatedById":54959,"CreatedDateTime":"2014-02-12T01:34:27Z","Content":"\n\u003Cp\u003EDecided to try my hand at a modular 2 man SSTO space plane, again.\u003C/p\u003E\u003Cp\u003EThis is what I would call my 3rd generation Mk6 variant, the X10. First two generation designs worked but were not up to par.\u003C/p\u003E\u003Cp\u003EThis works really well. The whole thing will get into 100km orbit with 2k\u002B dv remaining. The lander itself has 4000\u002B Dv if you separate it when you get to LKO.\u003C/p\u003E\u003Cp\u003EThe whole thing can fly to the moon, separate, land, rendezvous back with wings in orbit and return to Kerbin. If you refueled it in LKO I assume it should make it to Duna, or even further if you ditch the wings en-route somewhere.\u003C/p\u003E\u003Cp\u003EIt uses a 3 docking port setup so that when you reconnect it, it will line itself up.\u003C/p\u003E\u003Cp\u003ELander has 4 chutes for atmospheric landings.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img842.imageshack.us/img842/4062/0r03.png\u0022 alt=\u00220r03.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img513.imageshack.us/img513/7912/kb66.png\u0022 alt=\u0022kb66.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img854.imageshack.us/img854/6374/0d78.png\u0022 alt=\u00220d78.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img850.imageshack.us/img850/9429/3gh9.png\u0022 alt=\u00223gh9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img580.imageshack.us/img580/8138/6ttc.png\u0022 alt=\u00226ttc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img401.imageshack.us/img401/5916/uuax.png\u0022 alt=\u0022uuax.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img208.imageshack.us/img208/2650/nari.png\u0022 alt=\u0022nari.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img839.imageshack.us/img839/9641/jnr5.png\u0022 alt=\u0022jnr5.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fellow314","CreatedById":76781,"CreatedDateTime":"2014-02-12T01:43:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cinocal\u0022 data-cite=\u0022Cinocal\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s deeply impressive \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-12T01:56:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ENow I must confess, I am rather impressed you can milk 1950m/s out of a 1:1 intake ratio. You must have a keen ear for flameout and fast reflexes!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExtra thrust makes that easier, as it allows accelerating a bit lower. The flameout happens quite predictably at around 33 km, where the airspeed can reach something like 1970-1980 m/s.\u003C/p\u003E\u003Cp\u003EThe downside of milking the turbojets for maximal speed is that it requires almost level flight. When the switch to rockets happens at a low vertical speed, a lot of fuel is wasted in trying to climb up from the dense atmosphere at 33 km. A bit steeper ascent profile, where the switch to rockets happens at 1850-1900 m/s, would probably be more efficient. I\u0027ve never had the reason to investigate that, however, as my SSTOs never go higher than 130 km.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T02:07:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003Ethe higher T/W gets a higher flameout speed.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re talking about non-airhogging designs then, I agree with you. Otherwise, past 0.5TWR, moar intakes! My workhorse lifters haul up around 40% into LKO. I currently have two primary SSTO lifters which are a result of literally hundreds of ascent tests each throughout their design phases. \u003C/p\u003E\u003Cp\u003EMy Mantis(SPH), 54T with 5 turbos, 2 basics and 3 nukes. It pushes 20T(w/ butterfly lift attachment) to LKO with a third of it\u0027s rocket fuel(approx 1k) left over and a handy 17K xenon.\u003C/p\u003E\u003Cp\u003EMy goto lifter is the Swordfish(VAB) weighing in at 90T(approx?) and takes 45T to a lower Minmus orbit for interplanetary vehicle assembly. 8 basics, 8 turbos and 4 nukes.\u003C/p\u003E\u003Cp\u003EThose lifter SSTO profiles are not possible without the basic jet engines to give a rocket style ascent. And, of course, massive intake spamming that keeps those basic jet engines running up to 28km.\u003C/p\u003E\u003Cp\u003EMy point about the fuel is that,the more atmosphere you go through, the more jet fuel you have to add at takeoff which means less rocket fuel. Yes, you can add more wings but, then you get those awkward handling issues when it comes time to return home. I like my SSTOs perfectly balanced from take-off to touchdown.\u003C/p\u003E\u003Cp\u003EAnyway, that\u0027s my two cents. I will be posting these crafts on my company thread when I get the time to put a solid package of screens together across different missions.\u003C/p\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2014-02-12T02:22:48Z","Content":"\n\u003Cp\u003EIf you have SSTO\u0027s... Post them here as well.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T02:56:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KissSh0t\u0022 data-cite=\u0022KissSh0t\u0022\u003E\u003Cdiv\u003EIf you have SSTO\u0027s... Post them here as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll only be posting my craft files on my thread. Sorry about the wait but, that\u0027s going to be how I do it. Aw, now I feel bad for being a bit of a tease. Tell you what, grab the perfect fuel/engine pod off this craft.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/103197430/KSP/Salamander_1-0.craft\u0022 rel=\u0022external nofollow\u0022\u003ESalamander \u002B Olympus lifter v1.0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-12T03:23:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EMy workhorse lifters haul up around 40% into LKO. I currently have two primary SSTO lifters which are a result of literally hundreds of ascent tests each throughout their design phases. \u003Cp\u003EMy Mantis(SPH), 54T with 5 turbos, 2 basics and 3 nukes. It pushes 20T(w/ butterfly lift attachment) to LKO with a third of it\u0027s rocket fuel(approx 1k) left over and a handy 17K xenon.\u003C/p\u003E\u003Cp\u003EMy goto lifter is the Swordfish(VAB) weighing in at 90T(approx?) and takes 45T to a lower Minmus orbit for interplanetary vehicle assembly. 8 basics, 8 turbos and 4 nukes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you including payload in SSTO mass, or are you talking about 40% payload mass to lifter mass ratio instead of 40% payload fraction? If you mean payload fraction, that Swordfish is really impressive, because it only has 18.4 tonnes remaining for other than engines and payload.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T03:35:29Z","Content":"\n\u003Cp\u003EThe Mantis takes a full X200-32 plus parts to 250km orbit, routinely. The Mantis weights 54T without X200-32 payload. The Mantis design is of a refuelling tanker anyway so it is more economical both time and fuel-wise just to fly up, drop off an X200-32(and a bit) worth of fuel from internal tanks and come home. This mission is about a 40% payload fraction.\u003C/p\u003E\u003Cp\u003EThe Swordfish takes a Jumbo-64, an X200-16 and alot of other parts, to lower Minmus orbit. I can\u0027t remember the exact total weight of the ship but it is something like 90T including the payload. It could be 100T, I can\u0027t quite remember the Swordfish unloaded and loaded weights. But yeah, the payload fraction is about 40% to Minmus. Only possible with basic jet engines to get that massive load economically out of the thin atmosphere.\u003C/p\u003E\u003Cp\u003EEDIT: *thick atmosphere\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T03:45:44Z\u0022 title=\u002202/12/2014 03:45  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by O-Doc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-02-12T10:37:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EIf you\u0027re talking about non-airhogging designs then, I agree with you. Otherwise, past 0.5TWR, moar intakes! My workhorse lifters haul up around 40% into LKO. I currently have two primary SSTO lifters which are a result of literally hundreds of ascent tests each throughout their design phases. \u003Cp\u003EMy Mantis(SPH), 54T with 5 turbos, 2 basics and 3 nukes. It pushes 20T(w/ butterfly lift attachment) to LKO with a third of it\u0027s rocket fuel(approx 1k) left over and a handy 17K xenon.\u003C/p\u003E\u003Cp\u003EMy goto lifter is the Swordfish(VAB) weighing in at 90T(approx?) and takes 45T to a lower Minmus orbit for interplanetary vehicle assembly. 8 basics, 8 turbos and 4 nukes.\u003C/p\u003E\u003Cp\u003EThose lifter SSTO profiles are not possible without the basic jet engines to give a rocket style ascent. And, of course, massive intake spamming that keeps those basic jet engines running up to 28km.\u003C/p\u003E\u003Cp\u003EMy point about the fuel is that,the more atmosphere you go through, the more jet fuel you have to add at takeoff which means less rocket fuel. Yes, you can add more wings but, then you get those awkward handling issues when it comes time to return home. I like my SSTOs perfectly balanced from take-off to touchdown.\u003C/p\u003E\u003Cp\u003EAnyway, that\u0027s my two cents. I will be posting these crafts on my company thread when I get the time to put a solid package of screens together across different missions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuote the whole phrase, and you will see why I\u0027m not wrong:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd \u003Cstrong\u003Efor a given intake-engine ratio\u003C/strong\u003E, the higher T/W gets a higher flameout speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMany people insist on sticking to a certain intake ratio, and the ones who don\u0027t are equally capable of spamming intakes in pure turbojet designs to keep thrusting at 35kms and higher. I know I have, in the past. And as I said before, aviation fuel tanks weight much less than the basic jet engines you substitute them for. And by the time you light the rockets, \u003Cem\u003Eempty\u003C/em\u003E aviation fuel tanks certainly weight much less than useless jet engines that have been turned off a while ago.\u003C/p\u003E\u003Cp\u003ESo yeah, your designs? I don\u0027t care what their actual payload fraction is right now, it would be better if you substituted jet engine weight with aviation fuel weight. Sorry, but that\u0027s just the way it works.\u003C/p\u003E\u003Cp\u003ERune. Do I have to calculate how many empty fuel tanks equal the weight of a single jet?\u003C/p\u003E\n"},{"CreatedByName":"Judgementus","CreatedById":103128,"CreatedDateTime":"2014-02-12T12:03:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EIn that example, the payload was the command pod and the attached parts (4.6 tonnes), and the launch mass was 16 tonnes, so the payload fraction was a bit less than 29%. I already started building a bigger model that turned out to be quite ridiculous.\u003Cp\u003E\u003Ca href=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/ridiculous_lifter.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.cs.helsinki.fi/u/jltsiren/stuff/ridiculous_lifter.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe lifter scaled up quite well and behaved pretty much the same as the smaller model during the ascent. With 16 turbojets and a Skipper, the launch mass was 115.3 tonnes, including payload. That got the 36.2-tonne payload into a 125x121 km orbit, with about 350 m/s of delta-v remaining. The total mass will increase by a few tonnes, when I add landing gear and some parachutes for parachute-assisted powered landing.\u003C/p\u003E\u003Cp\u003EI\u0027m not going to use more than one intake per engine, unless the drag model changes to take the air flow from intakes to engines into account. This means that I have to switch from jets to rockets when the airspeed is around 1950 m/s, or risk going into spin and losing at least 50 m/s.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELove it, after I got the flight path right I was able to replicate both craft. Even went to the moon for a flyby on my first run with the heavy launcher of 36.2tns.\u003C/p\u003E\u003Cp\u003EAdded some stabilizing fins but apart from that I copied your design entirely. \u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E*Thank you Jouni*\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pt5ZvkR.jpg\u0022 alt=\u0022pt5ZvkR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext stop landing on the moon and making \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Esure\u003C/span\u003E I can land on Kerbin Safely.\u003C/p\u003E\n"},{"CreatedByName":"Judgementus","CreatedById":103128,"CreatedDateTime":"2014-02-12T12:17:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EExtra thrust makes that easier, as it allows accelerating a bit lower. The flameout happens quite predictably at around 33 km, where the airspeed can reach something like 1970-1980 m/s.\u003Cp\u003EThe downside of milking the turbojets for maximal speed is that it requires almost level flight. When the switch to rockets happens at a low vertical speed, a lot of fuel is wasted in trying to climb up from the dense atmosphere at 33 km. A bit steeper ascent profile, where the switch to rockets happens at 1850-1900 m/s, would probably be more efficient. I\u0027ve never had the reason to investigate that, however, as my SSTOs never go higher than 130 km.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnce I followed the flight details the Heavy SSTO lifter worked a dream.\u003C/p\u003E\u003Cp\u003E- first test with no payload got to 120-130km with a spin out at 29km but recovered at 31km to light the main engine.\u003C/p\u003E\u003Cp\u003E- second test with 36.4tn payload, no worries all the way to 32km with jets. Swapped to the skipper and completed my burn and orbit with 80 liquid fuel and correlating oxidizer mix. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E*on a side note I reduced the fuel in the Jet tanks to 90 to save weight and get to 32km with 5.12 fuel to spare!*\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Judgementus","CreatedById":103128,"CreatedDateTime":"2014-02-12T15:00:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EQuote the whole phrase, and you will see why I\u0027m not wrong:\u003Cp\u003EMany people insist on sticking to a certain intake ratio, and the ones who don\u0027t are equally capable of spamming intakes in pure turbojet designs to keep thrusting at 35kms and higher. I know I have, in the past. And as I said before, aviation fuel tanks weight much less than the basic jet engines you substitute them for. And by the time you light the rockets, \u003Cem\u003Eempty\u003C/em\u003E aviation fuel tanks certainly weight much less than useless jet engines that have been turned off a while ago.\u003C/p\u003E\u003Cp\u003ESo yeah, your designs? I don\u0027t care what their actual payload fraction is right now, it would be better if you substituted jet engine weight with aviation fuel weight. Sorry, but that\u0027s just the way it works.\u003C/p\u003E\u003Cp\u003ERune. Do I have to calculate how many empty fuel tanks equal the weight of a single jet?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing Wikki and in game data I pulled out the parts and put them in Excel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qsGNMqR.png\u0022 alt=\u0022qsGNMqR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter learning how to Work out the Percentages I realized it was 31.76% not the 47% I came out with the first time.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.wikihow.com/images/7/76/Calculate-Mass-Percent-Step-4-Version-2.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wikihow.com/images/7/76/Calculate-Mass-Percent-Step-4-Version-2.jpg\u003C/a\u003E \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E(times 100)\u003C/strong\u003E\u003C/span\u003E for the Percentage\u003C/p\u003E\u003Cp\u003EI think its very important to have a good lift ratio and it looks like winged fight gives the best. However lets keep the below points in mind.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELift Ratio\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAssent Time\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECost of Lifter\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEase of Use\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETech Limitations\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d rather be limited at 30% and have a quick flight time with little complications, lower tech and a lower cost.\u003C/p\u003E\u003Cp\u003EBut each to their own \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S. It be great to see what the costs of comparable space planes are.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T17:12:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd for a given intake-engine ratio, the higher T/W gets a higher flameout speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll I can do is go back to what I initially posted...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would add to that the need to make the distinction between a short range heavy lifter and a long range light lifter. If you are pushing a high payload fraction into LKO then a \u0026gt;1 TWR is best.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not disagreeing with you. Unfortunately, you\u0027ve misread most of my post.\u003C/p\u003E\u003Cp\u003ELike I said, if delta-v in space is your goal then, absolutely yes. The least amount of atmosphere propulsion weight is the primary principle. If, however you are hauling up large loads into orbit with your SSTO then most of your delta-v requirements are in-atmosphere. Which means, your primary design concern is getting the most delta-v from air breathers. That is my point.\u003C/p\u003E\u003Cp\u003E1. Ton for ton, at sea level to 15km, basic jets are 6 times more efficient than turbos.\u003C/p\u003E\u003Cp\u003E2. When basics cut out, turbos are operating a peak efficiency.\u003C/p\u003E\u003Cp\u003EIf you design to an ascent profile that exploits these two facts then you can get very high payload fractions into space. Speed and delta-v are two different things.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T17:42:44Z","Content":"\n\u003Cp\u003EI would also add, this craft is a a pretty typical setup for me these days. One forward facing basic per 2-3 turbos. That\u0027s a vtol taking 3 kerbols to the Mun and back.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vGdhj\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-02-12T18:21:41Z","Content":"\n\u003Cp\u003EIf payload in space is your goal, then also yes, I\u0027m afraid. Let\u0027s give an example to see if you finally understand it: Suppose we have two ships, with equal mass, number of intakes, and number of turbojets. That sets the maximum atmospheric speed before flameout, right? Because normal jets don\u0027t thrust that high. Now lets say one of those ships has some part of its mass devoted to jet engines. Do you seriously think the other craft needs more weight than that in aviation fuel tanks to climb to the same airhogging altitude? But even if it did, by the time they both got to their maximum airbreathing altitude, the craft without the jets would be lighter, and therefore faster. That saved weight by the fact that the aviation fuel is lighter than the jets, and that extra speed, mean both more delta-v, and more payload. In fact, delta-v in space is a function of fuel, and that \u003Cem\u003Eis\u003C/em\u003E payload after all.\u003C/p\u003E\u003Cp\u003ESo the \u003Cem\u003Eonly\u003C/em\u003E thing jets do is make the climb faster, when you take out all the other variables. And even then, I just timed how long a very slow climb takes me to get to 20,000m, and it is 10 minutes. Is it really worth it? Not what I\u0027m saying. But it IS less efficient by any measure you want to use.\u003C/p\u003E\u003Cp\u003ERune. I hope I was clear enough! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T18:33:29Z\u0022 title=\u002202/12/2014 06:33  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003Cbr\u003Etypos\n\u003C/span\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T18:37:09Z","Content":"\n\u003Cp\u003EWith craft under 50T there\u0027s no real gains for choosing basic jets. Some but, they can be offset in different ways. When your payloads are over 30T and you are talking about the difference between a 10min to 10km and 2min to 10km, then yes, the difference is night and day. Turbos burn fuel at 3 times the rate for 3/4 of the thrust and if you are burning for 5 times as long then that\u0027s 15 times more jet fuel you have to carry. My flagship would not even get into space if it wasn\u0027t for the use of basic jet engines. But, it does so with almost 2 big reds of fuel for a commute to the interplanetary fuel depot orbiting Minmus.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xFEML\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-02-12T19:10:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EWith craft under 50T there\u0027s no real gains for choosing basic jets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECare to explain why it would not scale? You might surprise yourself. But please do keep posting ships, otherwise this discussion would be very unproductive.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-02-12T19:48:12Z","Content":"\n\u003Cp\u003EIf you can find a way to mount half a jet engine on a vehicle, I\u0027m all ears. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}