{"TopicId":30649,"ForumId":36,"TopicTitle":"[PLUGIN, PARTS, Development] [0.20\u002B][0.21\u002B] tek Industries Science v0.4.1","CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-06-01T08:20:33Z","PageNum":9,"Articles":[{"CreatedByName":"John Nowak","CreatedById":67890,"CreatedDateTime":"2013-07-15T13:30:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tek_604\u0022 data-cite=\u0022tek_604\u0022\u003E\u003Cdiv\u003EIt is actually really simple to implement a resource scanner; I have a stock antenna now acting as a \u0022Rock\u0022 scanner. I will need to play with the individual planet settings, so that a limited number interesting deposits are shown as a small number of hexes, requiring precision landings. As it stands now, I have it using the same settings as Kethane, which is ok, but not really want we want for science.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EAnother question is, what would be the potential benefits of landing on a scanned hex? What I don\u0027t want is players not being able to collect a sample, just because they didn\u0027t land on the correct hex, but there should be some kind of benefit to it. Maybe add a flag to the sample, so that if the lander lands on a scanned deposit, it is marked as \u0022interesting\u0022, doubling the science points? Something along those lines?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds good to me! My only concern is that a sample taken from anywhere should have _some_ scientific value, but higher value targets are defined places. This would seem to encourage rovers and such without requiring it. \u003C/p\u003E\u003Cp\u003EIt\u0027s a recapitulation of Apollo. The first missions were to validate the system, subsequent missions started going for specific targets with defined value. By Apollo 15, they were going to canyons. \u003C/p\u003E\u003Cp\u003EConsider possibly salting the maps so that places that look interesting have higher value when reached. Craters at the poles, the Anomalies, and probably canyons.\u003C/p\u003E\n"},{"CreatedByName":"King Jareth","CreatedById":63223,"CreatedDateTime":"2013-07-15T14:26:40Z","Content":"\n\u003Cp\u003EThere could be two resources on planets, a complete coverage generic samples worth low science and a high value targetted information for a more MSL style precision mission worth bonus science?\u003C/p\u003E\u003Cp\u003EKethane mod maps are randomly generated with each new save as far as I know so can\u0027t be fixed to set locations.\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-15T15:09:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Jareth\u0022 data-cite=\u0022King Jareth\u0022\u003E\u003Cdiv\u003EThere could be two resources on planets, a complete coverage generic samples worth low science and a high value targetted information for a more MSL style precision mission worth bonus science?\u003Cp\u003EKethane mod maps are randomly generated with each new save as far as I know so can\u0027t be fixed to set locations.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is exactly how I will implement it. Jareth is also correct, for as far as I can see, Kethane randomises the locations. This will lead to plenty of oddities, with some interesting locations appearing in the lakes/oceans of Eve/Laythe. Nothing I can do about it though.\u003C/p\u003E\u003Cp\u003EMy plan is to have a number (as yet unknown) of hexes per body which will be scientifically interesting. These would require precision landings, depending upon the size of the body in question. These hexes will give some kind of point bonus. Everywhere will be available for sampling though. And this will only apply to rock sampling.\u003C/p\u003E\u003Cp\u003EExactly what the end goal of all this sampling and analysis will be, is still under discussion.\u003C/p\u003E\n"},{"CreatedByName":"Lanfranc","CreatedById":67288,"CreatedDateTime":"2013-07-16T11:27:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003EThat sounds like a lovely system, tek_104. It would give the mod depth by allowing a simple low-reward path and a more difficult high-reward path. Perhaps you could dress up the rock scanner as a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Ground-penetrating_radar\u0022 rel=\u0022external nofollow\u0022\u003Eground-penetrating radar\u003C/a\u003E? Those are usually used on the ground, but I don\u0027t see why you couldn\u0027t use one on a satellite, if you\u0027re willing to expend the energy for a super-high signal strength.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Mars Reconnaissance Orbiter actually has a ground penetrating radar (the \u003Ca href=\u0022https://en.wikipedia.org/wiki/SHARAD\u0022 rel=\u0022external nofollow\u0022\u003ESHARAD\u003C/a\u003E system) equipped, so it\u0027s definitely possible.\u003C/p\u003E\u003Cp\u003EThis looks like a great mod, I\u0027ll check it out. Always nice to have more science things to do out there!\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-16T12:31:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lanfranc\u0022 data-cite=\u0022Lanfranc\u0022\u003E\u003Cdiv\u003EThe Mars Reconnaissance Orbiter actually has a ground penetrating radar (the \u003Ca href=\u0022https://en.wikipedia.org/wiki/SHARAD\u0022 rel=\u0022external nofollow\u0022\u003ESHARAD\u003C/a\u003E system) equipped, so it\u0027s definitely possible.\u003Cp\u003EThis looks like a great mod, I\u0027ll check it out. Always nice to have more science things to do out there!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, welcome to the mod! I hope you enjoy using it, and if not, or even if you do, but see something else you might want, feel free to post a message or two here or on github!\u003C/p\u003E\u003Cp\u003EAs for your suggestion though, I\u0027ve already decided to go with a camera-type (I\u0027m hoping Dawn\u0027s Framing Cameras...). Maybe... just maybe... room could be had for a ground penetrating radar in the future. Just not right now...\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-19T10:47:09Z","Content":"\n\u003Cp\u003EDoes anyone happen to know if the number of hexes produced by the Kethane mod is a fixed number, or variable per body?\u003C/p\u003E\n"},{"CreatedByName":"King Jareth","CreatedById":63223,"CreatedDateTime":"2013-07-19T11:11:00Z","Content":"\n\u003Cp\u003EIn the root kethane folder there\u0027s a grid.cfg file that I think messes with this and is per body.\u003C/p\u003E\u003Cp\u003EBut messing with it might mess up other kethane resources.\u003C/p\u003E\u003Cp\u003EUnless you mean number of hexes containing the resourse, thats defined in the resource definition under body depositcount = and the radius variables I think.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-19T11:16:31Z\u0022 title=\u002207/19/2013 11:16  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 19, 2013\u003C/time\u003E by King Jareth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"scottholio","CreatedById":67477,"CreatedDateTime":"2013-07-19T11:38:24Z","Content":"\n\u003Cp\u003E@tek_604 Check this out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-7-3-Geodesic-grid-overlay-%28hex-map%29-and-other-scanning-improvements%21?p=484088\u0026amp;viewfull=1#post484088\u0022 rel=\u0022external nofollow\u0022\u003ELinky\u003C/a\u003E I think that might be the answer to your question?\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-25T08:43:44Z","Content":"\n\u003Cp\u003ENow that 0.21 has been released, I will get a fully compatible version out this weekend. I do not expect any issues with the current release, but, its always nice to compile your plugins against the latest version of libraries it requires.\u003C/p\u003E\u003Cp\u003EI also plan on keeping the current release available, but, all new development will be with the newest release of KSP. The next planned update will most likely be parts...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022scottholio\u0022 data-cite=\u0022scottholio\u0022\u003E\u003Cdiv\u003E@tek_604 Check this out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-7-3-Geodesic-grid-overlay-%28hex-map%29-and-other-scanning-improvements%21?p=484088\u0026amp;viewfull=1#post484088\u0022 rel=\u0022external nofollow\u0022\u003ELinky\u003C/a\u003E I think that might be the answer to your question?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis might be the answer to my question, but his answer is a little confusing actually. I can\u0027t see how the size of a cell would be the same everywhere, if the number of cells stays the same. I would expect the number of cells to stay constant, and therefore the size of the cell to be variable, or if the cell size stays constant, the number of cells to be variable. So, I\u0027m confused. I think I\u0027ll PM Majiir to be on the safe side.\u003C/p\u003E\u003Cp\u003EFor the record, I would actually expect the number of cells to remain constant, with the size varying.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T08:47:04Z\u0022 title=\u002207/25/2013 08:47  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by tek_604\u003C/strong\u003E\n\u003Cbr\u003EAdded answer re Kethane cells\n\u003C/span\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-25T09:17:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tek_604\u0022 data-cite=\u0022tek_604\u0022\u003E\u003Cdiv\u003EThis might be the answer to my question, but his answer is a little confusing actually. I can\u0027t see how the size of a cell would be the same everywhere, if the number of cells stays the same. I would expect the number of cells to stay constant, and therefore the size of the cell to be variable, or if the cell size stays constant, the number of cells to be variable. So, I\u0027m confused. I think I\u0027ll PM Majiir to be on the safe side.\u003Cp\u003EFor the record, I would actually expect the number of cells to remain constant, with the size varying.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe said that on a \u003Cem\u003E2D\u003C/em\u003E map, the cells vary in size. On his 3D overlay, however, the amount of cells at the poles is smaller, with the average size of a cell being constant all over the globe.\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-28T14:56:26Z","Content":"\n\u003Cp\u003EVersion 0.4.1 has been released!\u003C/p\u003E\u003Cp\u003ENo changes in this version, beyond compiling against KSP 0.21.1. Any new versions will be compiled against the latest KSP at the time; but, for those wanting to remain on KSP 0.20, you can use 0.4.0. See the first post for the downloads.\u003C/p\u003E\u003Cp\u003EI have also finally introduced a proper license, as it is becoming more of an issue these days. I have checked with King Jareth, and he has agreed to the license for his parts also. The license I have selected allows for anyone to modify and distribute the mod, as long as it is done for free, and gives me and King Jareth proper attribution for the work we\u0027ve done thus far. Further information regarding the license can be found in the first post.\u003C/p\u003E\u003Cp\u003EAs for further development; I have done a little since 0.21 came out, but, it looks like I need to wait for an update to Kethane to let me do what I want. As for parts, that I keep promising, they will come! Keep an eye on this thread.\u003C/p\u003E\u003Cp\u003EAnd, as always, ideas are welcome! Post here, or on github!\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-28T15:06:37Z","Content":"\n\u003Cp\u003EThanks for the update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-07-28T23:09:21Z","Content":"\n\u003Cp\u003EHi tek, sorry for being a bit quiet on the sampling statistics proportion of this mod - I\u0027ve been fairly busy with postgrad, fixing my KSP 0.21 install and the FusTek parts.\u003C/p\u003E\u003Cp\u003EThat being said, at some stage in the future I plan to integrate your science features into my Karmony Sciences Module by default \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-07-29T07:33:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EHi tek, sorry for being a bit quiet on the sampling statistics proportion of this mod - I\u0027ve been fairly busy with postgrad, fixing my KSP 0.21 install and the FusTek parts.\u003Cp\u003EThat being said, at some stage in the future I plan to integrate your science features into my Karmony Sciences Module by default \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot a problem at all! I\u0027ve been too quiet also. Work, and the heat we\u0027ve had in Germany does not equal a good time for concentrating in your spare time. Good luck with your postgrad! (whats your subject btw?)\u003C/p\u003E\u003Cp\u003EI\u0027m very glad to hear about your Karmony Sciences Modules. If there is anything I can help with, then give me a shout!\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-07-29T08:04:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tek_604\u0022 data-cite=\u0022tek_604\u0022\u003E\u003Cdiv\u003ENot a problem at all! I\u0027ve been too quiet also. Work, and the heat we\u0027ve had in Germany does not equal a good time for concentrating in your spare time. Good luck with your postgrad! (whats your subject btw?)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEngineering - specifically, MEMS/lab-on-a-chip devices.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tek_604\u0022 data-cite=\u0022tek_604\u0022\u003E\u003Cdiv\u003EI\u0027m very glad to hear about your Karmony Sciences Modules. If there is anything I can help with, then give me a shout!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-31T01:12:38Z","Content":"\n\u003Cp\u003EThis mod sounds promising. I\u0027ll be watching its progress.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-31T01:17:50Z\u0022 title=\u002207/31/2013 01:17  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 31, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-08-04T17:25:53Z","Content":"\n\u003Cp\u003EI think the EVA for the science command pod should show a bundle of equipment strapped into the empty chair. Right now it just shows the stock IVA, but I bet someone here could make a custom one for you. It seems very Kerbal to me to just kick out a crewman to make room for some equipment strapped into his seat.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T17:44:59Z\u0022 title=\u002208/04/2013 05:44  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by zxczxczbfg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-04T19:24:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003Eat some stage in the future I plan to integrate your science features into my Karmony Sciences Module by default \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m really looking forward to that - my space stations need proper orbital science capabilities! There are a lot of options for planetary science, but as far as an orbital lab goes, not much beyond the gravimeter and accelerometer. Stuff like chromatography and spectrography would be cool.\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-08-05T08:36:06Z","Content":"\n\u003Cp\u003EOK, I should make an update about whats happening. Since the release of 0.21.1, I\u0027ve not been playing KSP at all. I\u0027m pretty disappointed with the performance of the game, and for a plugin developer, its a living hell. Make changes, compile, load game, quick test, exit. The load, test, exit parts take FOREVER, and this is not fun.\u003C/p\u003E\u003Cp\u003EI\u0027ll be keeping an eye out for a performance update, and then we\u0027ll get cracking again. It doesn\u0027t help when we have the sun out, and lots of heat either (as I\u0027ve said before). As for modelling, Jareth is in a similar situation, with real life and summer holidays taking over, so no progress has been made. A prototype for an IVA for the Orbital Lab was under development, which should include science equipment inside the capsule.\u003C/p\u003E\u003Cp\u003EThis mod isn\u0027t dead, its just having a bit of a sleep for a while. If people continue to use us, and keep the discussion going, that would be great \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-08-05T08:45:32Z","Content":"\n\u003Cp\u003Etek, try this:\u003C/p\u003E\u003Cp\u003E - Launch the game\u003C/p\u003E\u003Cp\u003E - Go to space center scene\u003C/p\u003E\u003Cp\u003E - Go to VAB/SPH/flight and do whatever tests you want\u003C/p\u003E\u003Cp\u003E - Go back to space center\u003C/p\u003E\u003Cp\u003E - Open up the debug menu (Alt-F12 in Windows)\u003C/p\u003E\u003Cp\u003E - Go to Database tab\u003C/p\u003E\u003Cp\u003E - Click the reload button - the game will stay running but reload any changes to plugins and parts\u003C/p\u003E\u003Cp\u003E - Repeat steps 3 to 7 until you\u0027re satisfied with your plugin edits\u003C/p\u003E\u003Cp\u003EThis should be able to speed up development time by cutting back on unneccessary restarts of KSP\u003C/p\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-08-05T09:45:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003Etek, try this:\u003Cp\u003E - Launch the game\u003C/p\u003E\u003Cp\u003E - Go to space center scene\u003C/p\u003E\u003Cp\u003E - Go to VAB/SPH/flight and do whatever tests you want\u003C/p\u003E\u003Cp\u003E - Go back to space center\u003C/p\u003E\u003Cp\u003E - Open up the debug menu (Alt-F12 in Windows)\u003C/p\u003E\u003Cp\u003E - Go to Database tab\u003C/p\u003E\u003Cp\u003E - Click the reload button - the game will stay running but reload any changes to plugins and parts\u003C/p\u003E\u003Cp\u003E - Repeat steps 3 to 7 until you\u0027re satisfied with your plugin edits\u003C/p\u003E\u003Cp\u003EThis should be able to speed up development time by cutting back on unneccessary restarts of KSP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that only reloads parts, not plugins. Or it did that in 0.20, anyway.\u003C/p\u003E\n"},{"CreatedByName":"vasco","CreatedById":76096,"CreatedDateTime":"2013-08-05T10:12:31Z","Content":"\n\u003Cp\u003ERegarding Hitchhiker Science Laboratory - can you analyse more then 10 samples?\u003C/p\u003E\u003Cp\u003EYou have mentioned that the ovens can be reused, but how does it work in practice?\u003C/p\u003E\u003Cp\u003EI\u0027m building a long-term mission right now and your mode gives it a lot more purpose:)\u003C/p\u003E\u003Cp\u003EBut I\u0027d like to be able to analyse all three samples from each body I visit.\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-08-05T11:43:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vasco\u0022 data-cite=\u0022vasco\u0022\u003E\u003Cdiv\u003ERegarding Hitchhiker Science Laboratory - can you analyse more then 10 samples?\u003Cp\u003EYou have mentioned that the ovens can be reused, but how does it work in practice?\u003C/p\u003E\u003Cp\u003EI\u0027m building a long-term mission right now and your mode gives it a lot more purpose:)\u003C/p\u003E\u003Cp\u003EBut I\u0027d like to be able to analyse all three samples from each body I visit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot yet! I was planning on implementing a way of sending spare parts to the station, I\u0027ve just not gotten round to it yet. But, it is on the list of things to do. When I get around to doing some more coding, this should be a priority, as its not so difficult to do really.\u003C/p\u003E\u003Cp\u003EGlad you like the mod though, thats always nice to hear \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-08-05T22:43:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Weatherman159\u0022 data-cite=\u0022Weatherman159\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure that only reloads parts, not plugins. Or it did that in 0.20, anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrange - it worked for me in 0.21\u002B.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-05T23:22:17Z","Content":"\n\u003Cp\u003EWell, that\u0027s handy even for a player to know! I can\u0027t count the number of times I\u0027ve loaded the game and realized there was something I\u0027d wanted to change or adjust. With a lot of mods, that\u0027s a 10-minute proposition sometimes.\u003C/p\u003E\n"}]}