{"TopicId":30718,"ForumId":39,"TopicTitle":"First Flight (Epilogue and Last Thoughts)","CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-06-01T16:40:21Z","PageNum":39,"Articles":[{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-07-06T21:32:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222663891\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467833207\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeh - Sean Bean for (temporary) Prime Minister.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAre you daft, man?! That didn\u0027t work out so well for \u003Cem\u003Eany\u003C/em\u003Eone, did it?\n\u003C/p\u003E\n\u003Cp\u003E\nPeter Dinklage for PM. And while you\u0027re at it, make him President, too. \u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://www.clickinmoms.com/forums/images/smilies/shakinghead.gif\u0022 alt=\u0022shakinghead.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBack on topic \u003Cspan style=\u0022font-size:8px;\u0022\u003Esorta...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pyfPmbL.jpg\u0022 alt=\u0022pyfPmbL.jpg\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"AviosAdku","CreatedById":165040,"CreatedDateTime":"2016-07-07T07:42:33Z","Content":"\n\u003Cp\u003E\nWell, that happened.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the first, one of the greatest and ... it was just so sudden, no warning, no foreshadowing, just ... a somewhat routine test and it crashed, not even flying in space.\n\u003C/p\u003E\n\u003Cp\u003E\nMuch like most of NASA\u0027s early casualties.\n\u003C/p\u003E\n\u003Cp\u003E\nA twist and a half I\u0027d say, keen to see how this affects things, I have a feeling it will.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-07-10T21:34:18Z","Content":"\n\u003Cp\u003E\nThanks Aku. \n\u003C/p\u003E\n\u003Cp\u003E\nThe next chapter should answer that - and a couple more questions besides. So without further ado...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EBlack Stripes\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“It \u003Cem\u003Ewould \u003C/em\u003Ebe fitting but have we got time?”\n\u003C/p\u003E\n\u003Cp\u003E\n“I think so. Jeb had a couple of quiet words with people at the medical centre and they’ve agreed to keep him in a cold room for as long as we need. He’ll be embalmed too, just like…just like anyone else going home to their Grove.”\n\u003C/p\u003E\n\u003Cp\u003E\n“I thought the embalming was only temporary?”\n\u003C/p\u003E\n\u003Cp\u003E\n“It is. But in a cold, mostly sterile capsule? It could keep him preserved almost forever.”\n\u003C/p\u003E\n\u003Cp\u003E\n“What about the hardware?”\n\u003C/p\u003E\n\u003Cp\u003E\n“That’s the easiest part. We’ve still got a spare Moho booster in storage back from the beginning of Pioneer, when we were launching docking targets for Rockomax. We’ve certainly got no shortage of recovered Moho capsules that we can refit. Shroud the windows, extra insulation in the crew compartment - it should work.”\n\u003C/p\u003E\n\u003Cp\u003E\n“No sponsors obviously - that goes without saying - but did Jeb have any other ideas about paint jobs?”\n\u003C/p\u003E\n\u003Cp\u003E\n“I have his sketches right here. I think everyone’s going to find them very fitting too.”\n\u003C/p\u003E\n\u003Cp\u003E\n---------------\n\u003C/p\u003E\n\u003Cp\u003E\n“Thank you, Tomass.” Lodan took the tray, waited until his aide had left, then set it down on the table. He poured water for everyone, before locking the conference room door and returning to his place. Across the table, the Chief Investigator took a quiet sip and glanced down at his papers. Jeb, Geneney, Ademone and Nelton stared at the thick, spiral-bound reports before them, the front page of each discreetly stamped with the Seal of Twelve Pillars and the wings and crossed feathers of the Kerbin Air Accident Board. \n\u003C/p\u003E\n\u003Cp\u003E\nLodan nodded at the Chief Investigator, who knocked on the table for attention, opened his own copy of the report and pressed a button on the small tape recorder set in front of him.\n\u003C/p\u003E\n\u003Cp\u003E\n“By order of the Kerbin Air Accident Board, as authorised and instructed by the Council of Twelve Pillars, I hereby open this review and recommendation session of accident investigation nine two zero two. Here today are: Ademone Kerman, company manager, Rockomax Corporation; Geneney Kerman, Flight Director, Kerbin Space Agency; Jebediah Kerman, pilot, Kerbin Space Agency; Lodan Kerman, Director, Kerbin Space Agency; Nelton Kerman, Flight Director, Rockomax Corporation.” The Chief Investigator’s gaze rested briefly on each of them as he spoke. “All present are reminded that by Council order, this record shall be deemed accurate and inviolable with any false statement made today constituting a betrayal of that Council and punishable consecutively, to the fullest extent possible by law, in each of the Six Regionalities of Kerbin.”\n\u003C/p\u003E\n\u003Cp\u003E\n“The Kerbin Air Accident Board notes, with appreciation, the full and open assistance rendered to this investigation by those present, the Kerbin Space Agency and the Rockomax Corporation. That investigation is now complete and the Board wishes to place its conclusions on the public record, to make diverse recommendations therefrom and to place those recommendations also on the public record.”\n\u003C/p\u003E\n\u003Cp\u003E\nThe Chief Investigator’s shoulders relaxed slightly as he took another sip of water. “Good kerbals, I suggest we begin with a summary of the events underlying accident nine two zero two before reviewing my recommendations for mitigating the risk of each on future flights. Copies of them can be found in the reports in front of you. We can then take a short break before reconvening to discuss a timeline  and action plan for each recommendation. Does anyone have any questions?”\n\u003C/p\u003E\n\u003Cp\u003E\nHe glanced around the table but nobody spoke up. “Very well. From the facts before me, I find that the accident was due to poor wildlife management and risk assessment, pilot error, and faulty or inappropriate hardware design compounded by insufficient design and flight qualification for test vehicle MLT-01.” \n\u003C/p\u003E\n\u003Cp\u003E\nHe looked up at a circle of carefully neutral expressions. “Witness reports are unanimous that the primary event leading to the crash was a near bird-strike event on MLT-01 on approach to landing. In response, the pilot initiated a routine go-around manoeuvre intended to increase both altitude and speed of his vehicle. In a conventional fixed-wing aircraft this would have been the proper course of action. Regrettably, it was not the correct choice of manoeuvre for a vertical take off or landing aircraft.”\n\u003C/p\u003E\n\u003Cp\u003E\nThe Chief Investigator bowed his head for a moment then continued. “The pilot then attempted to regain control of his aircraft but was unable to do so. Data from the telemetry recordings and recovered flight recorder indicates that the vehicle attitude and commanded pitch angle was sufficient to bring the onboard inertial measurement unit near to gimbal lock. The IMU went into recovery mode in which the locking gimbal is driven to a safing angle and the unit is restarted. By design, pitch authority was transiently halted during reset to avoid generating spurious control signals and unfortunately this loss of authority coincided with the pilot-commanded nose down manoeuvre. The vehicle therefore continued to pitch over, reaching an attitude where safe ejection was no longer possible. From here, the pilot responded correctly, cutting power to the primary jet engine and initiating an emergency roll. Regrettably there was insufficient altitude remaining to complete the roll, resulting in the loss of pilot and vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Chief Investigator took another sip of water. “Control logic analysis using test vehicle MLT-02 indicates that the MLT-01 fly-by-wire system was operating near the edge of its safety envelope due to the increased gravity compensation required to simulate a Minmus landing. Additional wind tunnel studies found a number of dynamic instabilities at high pitch angles which tend to magnify the effect of sudden rapid pilot inputs. In short, a vehicle designed for simulating \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E flight in a Munar gravity field, did not have the required safety margins for equivalent simulated flight in a Minmus gravity field and vehicle qualification procedures were insufficient to correctly determine those margins before starting simulated landing operations.”\n\u003C/p\u003E\n\u003Cp\u003E\nJeb and Geneney exchanged grim looks with Nelton whilst everyone else around the table flipped over the next page of their reports.\n\u003C/p\u003E\n\u003Cp\u003E\n“We will now take each contributing factor in turn. Section one begins with recommendations for KSA test flight facilities and airspace management…”\n\u003C/p\u003E\n\u003Cp\u003E\n---------------\n\u003C/p\u003E\n\u003Cp\u003E\nThe conference room door closed behind Lodan with an audible click. Ademone finished scribbling a note in the margin of her report and looked up at him. “This will need to be a joint effort,” she said bluntly.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney nodded. “I agree,” he said reluctantly. “Led by the KSA’s Kerballed Spaceflight Division.” He gave Jeb an apologetic look. “I’m truly sorry old friend - this is \u003Cem\u003Enot\u003C/em\u003E the way I’d hoped to discuss this.\u0022 Everyone braced themselves for an explosion but Jeb just stared down at the table. When he looked up again, Geneney bit his lip. For once in his life, his friend had no reply. The veteran kerbonaut and irrepressible founder of the Kerbin Interplanetary Society just looked old, tired and defeated.\n\u003C/p\u003E\n\u003Cp\u003E\n“I think so too,” Jeb said at last. He glanced at Lodan and for a second, ingrained defiance sparked in his eyes, only to be quickly stifled. “So what did you have in mind?”\n\u003C/p\u003E\n\u003Cp\u003E\n“A merger,” Lodan said quietly. “Between the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E and Rockomax’s Crewed Spaceflight Division. To be charged, amongst other things, with all aspects of crew selection and training. I know this isn’t how you run things, Jeb.” He tapped his own copy of the air accident report, “but apart from anything else, I think it’s the only way to address the Board’s recommendations.”\n\u003C/p\u003E\n\u003Cp\u003E\n“A Kerballed Spaceflight Division will need a leader,” said Geneney softly. “And with respect to all the other kerbonauts, I can’t think of a better one than the first kerbal in space - and the first to walk on the Mün.” To his surprise, Jeb shook his head.\n\u003C/p\u003E\n\u003Cp\u003E\n“I appreciate the gesture, Gene but I don’t think I’m suited.” He managed a faint grin at Lodan. “Politics never was my strongest point. If you’re asking, then Sherfel would be my choice. Nobody’s going to argue with her flight record, she’s a natural diplomat and she knows both us and Rockomax inside-out. Ribory would be good option too, I’d say Bob, but he doesn’t have the flight experience yet.”\n\u003C/p\u003E\n\u003Cp\u003E\nLodan looked at him. \u003Cem\u003EWell there’s something I never expected to see. Although Geneney makes a valid point too. You’re no politician, Jebediah Kerman but you\u003C/em\u003E are \u003Cem\u003Ea powerful figurehead - and we’re going to need that too\u003C/em\u003E. “You might be right,” he said. “and your recommendation is noted. For now though, I think our first task is to persuade everyone that a merger is necessary at all. In the meantime, I think we can move ahead with the Board’s airspace management and test facilities recommendations.”\n\u003C/p\u003E\n\u003Cp\u003E\n---------------\n\u003C/p\u003E\n\u003Cp\u003E\nThe final, melancholy, strains of the Lament for the Lost Explorer faded into silence. Corvan shouldered his instrument and led the rest of his pipers, all of them bedecked in formal Spierkan funeral garb, in a stiff-legged march to the sweetblossom pole. Row upon row of mourners faced them, almost every last member of the Kerbin Interplanetary Society, and dozens more from the Rockomax Corporation, from Barkton and Foxham, and their surrounding Groves.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher and Jeb walked slowly down a gap in the rows, carrying a small casket between them. Richlin followed them, dressed in a black poncho and carrying a pair of small spades crossed over his chest. At the front of the crowds, the officiant waited by a stele of dark grey stone. Two small kerm wood plaques were affixed to one corner with brass screws, each bearing a name written in finely inlaid gold script. For a moment, the officiant wondered who Enley Kerman was but then the casket bearers came to a halt in front of her. She cleared her throat.\n\u003C/p\u003E\n\u003Cp\u003E\n“Good kerbals. We are gathered here today to celebrate the life and mourn the passing of Ornie Kerman. He was kerbal, and as he came forth from his Grove, so in the presence of us all, shall he return to his Grove.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSolemnly, she took the two spades from Richlin, knelt and presented them to Wernher and Jeb, who began to dig a small trench at the foot of the trellised pole. Slowly, she stood up, withdrew a carved wooden figurine from inside her robes and held it up to the crowd. “Like us all, Ornie was a child of the Kerm. And though his body is not with us today, this poor marker shall stand in its stead. For it too is of the Kerm, and also of Ornie\u0027s Grove.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb and Wernher put down their tools. The officiant stepped forward, knelt, and gently placed the figurine into the trench. The casket lid tipped open and a cascade of soil tumbled out over the grave marker.  All three casket bearers stepped back and bowed. The rhythmic thudding of spade against earth punctuated the silence.\n\u003C/p\u003E\n\u003Cp\u003E\n“Thank you.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“Ornie meant many things to each of us. If anyone here today wishes to speak, to share their memories of him, we would be honoured to hear your words.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nRichlin stepped forward, took the radio microphone from the officiant and clipped it to his collar. Blinking hard, he turned towards the sea of faces. \u0022Good afternoon,\u0022 he said haltingly, \u0022My name is Richlin Kerman and Ornie was my best friend.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nUnconsciously, Richlin straightened his poncho. \u0022Before I met Ornie, I was just a greasebucket on the circuit; fixing up planes at the local aerodrome. I met him on the day before our airshow - he asked if I could help take a look at his plane engine which was making ‘a mighty lot of noise but not goin’ nowhere fast.’ We managed to get it working in the end, in time for Ornie to compete the next day. The afternoon after the show, he offered to take me up myself, by way of a thank you.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We went out for a drink that evening. We got to talking and by the end of the night I was going with him to the next show on the circuit. Ornie showed me the world, taught me to fly, became the best friend I ever had. When I got to fly in space before him it just didn’t seem \u003Cem\u003Eright\u003C/em\u003E. Not that he ever seemed to mind. He helped me with all the training, drove me out to the launch pad that day, helped Bob strap me into the capsule. Gene told me afterwards that he was watching over me for the whole flight - didn’t leave his console until I was safely home. I just wish I… wish I could have done the same for him.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nRichlin hid his face in his hands, small, choked noises coming from the microphone. Blindly, he unclipped it from his collar and thrust it towards the officiant. Jeb hurried over and put his arm round his shoulders, murmuring something too faint for the watching crowd to hear. As Jeb led Richlin away, Wernher stepped forward and solemnly accepted the microphone.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Good afternoon. My name is Wernher Kerman and Ornie was one of my dearest colleagues.\u0022 Wernher took a deep breath. \u0022One of my lasting memories of Ornie was his calm good humour under pressure. He’d always laugh with you - but never, ever at you. I remember once losing a prototype engine on the test stand. This was back in the early days you understand, we didn’t have many spare engines left to use and I was not in a good mood. Ornie came out to see what was wrong, let me blow off some steam - and then took me out for lunch. \u0027I’ll tell you what we’ll do, Wernher,\u0027 he said, \u0027We\u0027re going to take a walk, we\u0027re going to grab a bite to eat and then we\u0027re going to come back, check the data and figure out what went wrong.\u0027 \u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And we did. But it was something else that Ornie said that day has stayed with me ever since. \u0027Better that they blow up now,\u0027 he told me, \u0027than on the launch pad.\u0027 He lived by that philosophy and, to our deep and lasting sorrow, he died for it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So this is what we’re going to do. Learn. Move on. Never give up. Find out what went wrong and make sure it never happens again. Ornie would expect nothing less. And to do anything less would dishonour the memory of a brave kerbonaut and one of the finest kerbals that I ever knew.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher bowed and passed the microphone to the waiting and shiny-eyed Jeb before walking over to stand by Richlin. The crowd silently watched Kerbin\u0027s first Munwalker fumble nervously with his collar before beginning to speak. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Good afternoon. My name is Jebediah Kerman and Ornie was my mentor.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nRichlin looked up in surprise as Jeb continued. \u0022The very first time I met Ornie, I was trying to sell him some old engine parts. Bill, Bob and I were only just back on dry land after Kerbal 1. Ornie was one of the first to see Bill’s photos once they were done and we literally wouldn’t be where we are today without him and Richlin. And as the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E bloomed beyond our wildest dreams, Ornie was always there for \u003Cem\u003Eeveryone\u003C/em\u003E, with a kind word or sound advice. Smoothing the way, getting the very best out of people - and teaching me everything I needed to know about that.”\n\u003C/p\u003E\n\u003Cp\u003E\n“He was the beating heart of the space program. He built the LVT-20 that put the first kerbals into space. He played a vital role in building the LVT-30 and LV909 engines that took us to the Mün and helped to test them both as the copilot and flight engineer for Eve 2. And that’s how I’d like everyone here today to remember him. Ornie Kerman: mentor, engineer, explorer, and above all else, a beloved and irreplaceable friend.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nOne person after another came forward to share their memories and stories. As the last of them returned to their places, the officiant coughed discreetly. \u0022Good kerbals, I thank you all for sharing your Ornie Kerman with us. Today we have honoured him in the traditional way, with music, stories, seeds and pole. Now, I beg you to join me in observing a new tradition for a new age of explorers.” She clicked a switch on her microphone and a familiar, but restrained, litany washed over the crowd.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Guidance?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Go, Flight.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Booster?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Go, Flight.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Spacecraft?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a sudden choked sob. \u0022Spacecraft...spacecraft is Go.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022T-minus two minutes. G-Go for engine start.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAs one, the funeral crowd turned towards the distant rocket on its launchpad. Unadorned by logos or sponsored slogan, the only marks on the gleaming white booster were a set of thick black stripes painted down its flanks.\n\u003C/p\u003E\n\u003Cp\u003E\n“…six…five...four...three...ignition...and lift-off.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSmoke and fire erupted over the launchpad. From their midst the Moho booster rose majestically into the sky, carrying Ornie Kerman on his final journey to the stars.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026lt;\u0026lt; \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2630073\u0022 rel=\u0022\u0022\u003EChapter 64\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E:     \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2699006\u0022 rel=\u0022\u0022\u003EChapter 66\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026gt;\u0026gt; \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-01T14:33:40Z\u0022 title=\u002205/01/2020 02:33  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 1, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2016-07-10T22:33:54Z","Content":"\n\u003Cp\u003E\nFarewell, Ornie.\n\u003C/p\u003E\n"},{"CreatedByName":"GKSP","CreatedById":160883,"CreatedDateTime":"2016-07-10T23:51:06Z","Content":"\n\u003Cp\u003E\nAlmost caught up!  One more chapter.   REVERT FLIGHT , ORNIE!  REVERT FLIGHT!\n\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-07-11T06:06:18Z","Content":"\n\u003Cp\u003E\nOnce again, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261025\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/61025-ksk/\u0022 rel=\u0022\u0022\u003E@KSK\u003C/a\u003E, your technical attention to detail is on point.\n\u003C/p\u003E\n\u003Cp\u003E\nFarewell, Ornie, and Kermspeed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JQUbHBM.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/JQUbHBM.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E( And immature juvinile snickering @ Tomass)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"AviosAdku","CreatedById":165040,"CreatedDateTime":"2016-07-11T07:26:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222670262\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468190034\u0022 data-ipsquote-userid=\u002261242\u0022 data-ipsquote-username=\u0022JakeGrey\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, JakeGrey said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFarewell, Ornie.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy thoughts exactly, I had in mind a bundle of analysis on how this leads to the single agency we think of but after this ... It just didn\u0027t suit.\n\u003C/p\u003E\n\u003Cp\u003E\nA masterpiece, beautifully capturing the mood of the scene.\n\u003C/p\u003E\n"},{"CreatedByName":"superstrijder15","CreatedById":155985,"CreatedDateTime":"2016-07-11T12:09:58Z","Content":"\n\u003Cp\u003E\nNow I had to explain why my eyes where tearing to my friends!\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-07-11T20:47:38Z","Content":"\n\u003Cp\u003E\nThanks everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nCF - glad it worked. One of the tougher bits of technodetail to write actually - I wanted to give a plausible reason for the accident without either making it too contrived (as in a longer chain of circumstances) or having the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E miss anything too blindingly obvious. That was the perfect video clip to go with that final paragraph by the way.\n\u003C/p\u003E\n\u003Cp\u003E\nAku - thank you for the much appreciated kind words.\n\u003C/p\u003E\n\u003Cp\u003E\nSuperstrijder - you and me both - it was Richlin\u0027s eulogy that did it for me. An odd confession perhaps but I figured I was probably doing something right if I was misting up too. And speaking of which, I wanted to share this comment from Hazard over on the Spacebattles forum - and you\u0027d better believe I\u0027m working this in somewhere if he(?) okays it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWho wants to bet that the official status of kerbonauts that died is \u0027on leave amongst the stars,\u0027 or something similar?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-07-12T01:22:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671618\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468270058\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCF - glad it worked. One of the tougher bits of technodetail to write actually - I wanted to give a plausible reason for the accident without either making it too contrived (as in a longer chain of circumstances) or having the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\u003C/abbr\u003E miss anything too blindingly obvious. That was the perfect video clip to go with that final paragraph by the way.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDone and done well. I could practically smell the paperwork. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E I\u0027ve always loved that clip, it\u0027s one of the most moving pieces of cinema I\u0027ve ever seen. Unfortunately it\u0027s become a bit cliche nowadays but it\u0027s one of those formative things that just sticks with you.\n\u003C/p\u003E\n\u003Cp\u003E\nI thought of reversing the gif for better accuracy, but shooting corpses at the Enterprise probably isn\u0027t wise. \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671618\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468270058\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWho wants to bet that the official status of kerbonauts that died is \u0027on leave amongst the stars,\u0027 or something similar?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-07-12T15:17:20Z","Content":"\n\u003Cp\u003E\nHeh - being an ex civil servant and  working with patents for a living probably helps with the dry government-speak. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAnd Spock\u0027s burial - I can totally see that being a formative cinema experience. Funeral setting, actual death (so far as we knew at the time) of a major character and above all, finding out that Vulcan logic wasn\u0027t just a collection of high sounding platitudes. The needs of the many outweighs the needs of the few - or the one? You\u0027d better believe it cos Spock just gave his life for it.\n\u003C/p\u003E\n"},{"CreatedByName":"fire219","CreatedById":140437,"CreatedDateTime":"2016-07-12T15:29:15Z","Content":"\n\u003Cp\u003E\nRest in peace among the stars, Ornie.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m not 100% sure why this happened, but a song from one of my other favorite games came to mind here. \u003Ca href=\u0022https://www.youtube.com/watch?v=cw_0Bxqpc9o\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=cw_0Bxqpc9o\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-07-13T02:51:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672667\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468336640\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeh - being an ex civil servant and  working with patents for a living probably helps with the dry government-speak. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAnd Spock\u0027s burial - I can totally see that being a formative cinema experience. Funeral setting, actual death (so far as we knew at the time) of a major character and above all, finding out that Vulcan logic wasn\u0027t just a collection of high sounding platitudes. The needs of the many outweighs the needs of the few - or the one? You\u0027d better believe it cos Spock just gave his life for it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI I was referring more to Kirk\u0027s response and, ahem, \u003Cem\u003Elegendary\u003C/em\u003E acting.  \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFunny you should mention that last bit, I was just about to poke at it myself. \u003Cimg alt=\u0022:ph34r:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ph34r.png\u0022 title=\u0022:ph34r:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-07-31T18:53:41Z","Content":"\n\u003Cp\u003E\nNext chapter is up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EProspecting\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Good afternoon and welcome to this month\u0027s Starseed Special. With me in the studio today are three distinguished guests who have all kindly made time in their busy schedules to bring us the latest Space Program updates and, if we have time, to answer some of the many questions from our audience and from our viewers at home. My guest on the left will be a familiar figure to Engines and Engineers regulars but, as always,  it\u0027s a privilege to welcome him back to the studio. As chief propulsion engineer for the Rockomax Corporation, he\u0027s been instrumental in all their many spaceflight successes including the Muna probes, the Endurance space station and of course, the joint Pioneer Program with the Kerbin Interplanetary Society. Good kerbals, please welcome Hanbal Kerman!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHanbal smiled at the camera before turning back to the presenter. \u0022It\u0027s good to be back, Tom. And as always, thank you for your kind introduction.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022My pleasure, Hanbal. Now on my right is a kerbal who will need no introduction. Astronomer, founder of the field of planetary geology, and leader of the Probodyne deep space operations team, please welcome Dunney Kerman to the studio.\u0022 Tom waited for the applause to die away. \u0022And sitting next to him is Probodyne\u0027s Head of cis-Munar operations. She\u0027s an accomplished astrophysicist, now turned flight director at the Probodyne Deep Space Operations Centre, and most recently responsible for the highly successful Unity 1 Mün landing and joint mission with Pioneer 5. Good kerbals, I give you Germore Kerman!”\n\u003C/p\u003E\n\u003Cp\u003E\nGermore looked surprised at the enthusiastic round of applause. Dunney just smiled and leaned back in his chair. Tom looked at his three guests solemnly. \u0022After the tragic events befalling the crewed space program and the unfortunate end to the KDS Stretch test flight, a lot of us here today would be glad for some good news. Dunney - is there anything you can tell us?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Nothing that will make up for our loss,\u0022 replied Dunney soberly. \u0022Incidentally, I think I can speak for the whole Kerbin Space Agency when I say that I was particularly moved by the eulogy from Capital News. \u0027Going on leave amongst the stars\u0027 was a beautiful way to describe Ornie\u0027s final flight.\u0022 He blinked, one hand unconsciously reaching for the folded handkerchief in his top pocket. \u0022But to answer your question, yes, we \u003Cem\u003Edo \u003C/em\u003Ehave some good news, or rather Germore does.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGermore glanced at Tom, who nodded back. \u0022Thank you, Dunney,\u0022 she said quietly, adjusting the microphone at her collar. \u0022On behalf of the Probodyne cis-Munar team, I can confirm that Minmus 1 has arrived at its destination and successfully completed its mission objectives. All four button probes have successfully reached the surface and, as of last night, the instrument packages on all four probes have started up on schedule and are transmitting data.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well that is good news,\u0022 said Tom. \u0022But for everyone listening at home, perhaps you could tell us a little more about those uh... button probes?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Certainly,\u0022 said Germore. \u0022They\u0027re simple, very lightweight probes, really not much more than a radio transmitter and a seismometer on the smallest lander we could build. We\u0027re going to need a lot of them for a complete Minmus network so we wanted to be able to send multiple buttons there on a single booster.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Seismometers? Are you looking for earthquakes - or I suppose that should be munquakes - on Minmus, Germore?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGermore smiled. \u0022It does sound a little farfetched when you put it like that, Tom but yes we are. One of the first things we discovered with our original Minmus Explorer probe was that Minmus is actually a captured comet. How it got to Kerbin is a long story - and we\u0027re still not quite sure of all the details - but the important thing is that it\u0027s still active. It hasn\u0027t been in orbit around Kerbin for long enough to lose all its ices and other volatiles and, as we discovered, they\u0027re all boiling away still, giving Minmus a very thin atmosphere. Which is why it looks blue from a distance, just like Kerbin\u0027s atmosphere.\u0022 Germore sipped at her water. \u0022Now the problem is that the boiling isn\u0027t uniform. Quite the opposite in fact - we\u0027ve spotted some quite spectacular eruptions from Minmus Explorer.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nTom nodded. \u0022So you need an early warning system to spot them before they go off under a crewed lander. Which I suppose brings me on to my next question. Why is the KSA going to Minmus, or even the Mün for that matter? Shouldn\u0027t we be spending all our time on Duna?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Fear not, Tom,\u0022 said Dunney, \u0022If all goes well, we\u0027ll be launching a veritable flotilla of spacecraft to Duna when the next launch window opens. Hope 5\u003Cem\u003E \u003C/em\u003Eand Hope 6 from Barkton, Hope 7 and 8 from Foxham and we\u0027re hoping to launch a pair of communication satellites from the new Doreni launch site too. Launched on Doreni boosters no less - they\u0027re not as powerful as an Eve or a Rockomax Type Six - but they\u0027ll get a small satellite to Duna and getting the Doreni into the space launch business is going to be vital for Starseed.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That sounds more like it,\u0022 said Tom, \u0022but why all the probes?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022If you\u0027ll excuse this old astronomer ducking a technical question, Tom, I think Hanbal is better placed to answer this one.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Propellant,\u0022 said Hanbal succinctly. He leaned forward in his chair. \u0022The biggest question we need to nail down before we can choose a colony ship design is; what \u003Cem\u003Eengines\u003C/em\u003E are we using? Lots of options Tom, some of them better than others and none of them perfect. One thing\u0027s for sure though, if we could live off the land, in other words find a way of making propellant out at Duna, it could make everything a lot easier. We\u0027d still have to work out how to make it of course, not to mention figuring out a way of refuelling our colony ships, and neither of those are going to be trivial problems to solve. But not having to lift each and every drop of fuel into orbit from Kerbin is such a huge advantage that we can\u0027t afford not to explore that option.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nDunney nodded. \u0022And to do that, we need to know what\u0027s out there to work with. Minmus Explorer already found water and ammonia, which are both good starting materials for making rocket fuels and, at a pinch, we could use them directly. We know there\u0027s a lot of hydrogen on Duna from the Hope 3 and 4 data and our best guess is that it\u0027s water ice, although we can\u0027t rule out sub-surface ammonia ice either. Hope 5 will be targeting a Dunan polar orbit and tasked with extending and updating our current survey data.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nDunney took a sip of water.  \u0022Now Ike, on the other hand, we know almost \u003Cem\u003Enothing\u003C/em\u003E about bar some very tentative observational data from Kerbin. So Hopes 6 through 8 will be carrying out a detailed survey, dropping landers if necessary for a close up look at any interesting sites that we spot from orbit. All the probes will be carrying updated versions of the gamma and x-ray mapping instruments used on the Muna flights.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A real prospectin\u0027 mission then,\u0022 said Tom, putting on an exaggerated Spierkan accent, \u0022Och, you\u0027ll be hopin\u0027 for rocket fuel in them old plains.\u0022 He cocked his head, \u0022But how did you plan to use \u003Cem\u003Ewater\u003C/em\u003E as a rocket fuel?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHanbal looked at him. \u003Cem\u003EHere goes nothing\u003C/em\u003E. \u0022By using a nuclear rocket, Tom.\u0022 He lifted his hands hastily. \u0022And before we start, you should know that the LV-N programme is being run under strict oversight from the Kerbin Nuclear Standards Agency. I think everyone here can agree that the KNSA is not known for cutting corners with nuclear materials or for having any sense of humour whatsoever when it comes to health and safety. For one, it has already flatly forbidden us from flying nuclear rockets in Kerbin\u0027s atmosphere.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nTom blinked. \u0022LV-N is the wrong name then,\u0022 he said weakly. \u0022It can\u0027t be a launch vehicle engine if you can\u0027t use it till you get to space.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHanbal laughed. \u0022Only on Engines and Engineers, Tom. Only on Engines and Engineers.\u0022 His face turned serious. \u0022Think of this as another option we can\u0027t afford not to explore. Water is a bad example actually - an LV-N running on water wouldn\u0027t be much more efficient than an ordinary rocket engine burning hydrogen and oxygen. Not that building one of those would be easy either but at least it wouldn\u0027t be radioactive. For a lot of other propellants though, a nuclear engine should be a lot more efficient and the more efficient our engine, the less reaction mass we need to get to Duna and the more actual cargo we can take with us.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHanbal rolled a gulp of water around his suddenly dry mouth. \u0022Like I said, Tom, we\u0027re under strict oversight from the KNSA and the colony ships will only be using nuclear propulsion if there\u0027s a rock solid case for it and if the risks to crew safety can be made acceptably low.\u0022 He looked the presenter in the eye. \u0022I\u0027m not going to lie to anyone here - there \u003Cem\u003Ewill\u003C/em\u003E be risks. We\u0027ll be using a high powered nuclear reactor with as little shielding as possible in order to minimise launch mass. But there are plenty of other risks to consider in a flight to Duna. If nuclear propulsion can offset some of those, then it might even make the overall flight slightly safer.  That\u0027s a \u003Cem\u003Ebig\u003C/em\u003E If, Tom and at the moment I\u0027m not about to promise anything either way. All I can say is that we\u0027re looking at all the options for our colony ship designs. Now, I\u0027m happy to answer any questions as best I can but please bear in mind that I\u0027m not a nuclear engineer.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n-----------\n\u003C/p\u003E\n\u003Cp\u003E\nFor the fourth time in as many minutes, the pilot checked her heading, altitude and transponder settings. Then, glancing at her copilot, she keyed her microphone. \u0022Wakira ATC, KSA zero-six-zero requesting permission to enter Wakiran airspace.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022KSA zero-six-zero, Wakira ATC. Please confirm flight plan and manifest.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022KSA zero-six-zero is a Skyway inbound from Barkton at five, bearing two-nine-eight for KSA Site D. Manifest is VIP transport.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022KSA zero-six-zero, standby. Please maintain current heading and altitude for visual inspection.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022KSA zero-six-zero copies.\u0022 The pilot toggled her microphone. \u0022For Kerm\u0027s sake. Do they \u003Cem\u003Ereally\u003C/em\u003E think we\u0027re stupid enough to paint the wrong number on the tail. And they\u0027d better be coming in low and slow - the last thing I want is some Wakiran wannabe shaking up my passenger!\u0022  \n\u003C/p\u003E\n\u003Cp\u003E\nHer copilot shrugged. \u0022Reckon it\u0027ll take more than a fighter to rattle this passenger. Soon find out anyway - that\u0027ll be them on their way now.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nA glinting arrowhead arced up through the sky towards them, contrail suddenly bursting out behind it. The Wakiran plane swept past them at a discreet distance, before banking sharply onto their heading and taking up a position off their left wing. The copilot craned his neck, trying to catch a glimpse of it out of the cockpit window. \u0022Looks like a Skysprite - they\u0027re obviously not \u003Cem\u003Etoo\u003C/em\u003E worried about us. Nothing under the wings that I can see, can\u0027t spot anything under the nose either from this angle but I\u0027m betting they\u0027re rigged with some kind of cannon.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Probably,\u0022 she grunted, resetting her microphone and scanning her instruments; resisting the instinctive urge to pull away to a safer distance from the unnaturally close aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022KSA zero-six-zero, Wakira ATC. You are cleared for Wakiran airspace, confirm you inbound for KSA Site D. Thank you for your cooperation.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wakira ATC, KSA zero-six-zero copies. Thank you.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe Skysprite peeled away from them, diving out of sight. The little Skyway passenger jet flew on towards the desert, its pilot wiping the sweat from her forehead.\n\u003C/p\u003E\n\u003Cp\u003E\n-----------\n\u003C/p\u003E\n\u003Cp\u003E\nWernher stacked his notes together and tucked them neatly back into his briefcase on the seat next to him. Seeing the movement, the steward padded quietly over and refilled his coffee cup. He smiled a quick thanks, rubbed the bridge of his nose thoughtfully and checked his watch. Outside his window the gently scalloped cliffs of the Kolan Western Peninsula were just giving way to turquoise coastal waters. To the northwest, hidden by haze and distance, the narrow Jhazi Straits marked the closest point between Kolan and Wakiran territorial waters.\n\u003C/p\u003E\n\u003Cp\u003E\nMyriad wakes criss-crossed the sea, as the Skyway flew out over deeper waters. Squadrons of smaller boats trailed white v-shaped threads behind them, contrasting with the ropy, forked comet tails of froth churned up by the bigger container ships. Wernher watched a larger formation of vessels steam past underneath him, parallel wakes precisely scored across the azure waves. He sighed. \u003Cem\u003ESo much for a Wakiran spaceport. They\u0027d never be able to clear a launch corridor through all of that. And given the payloads we\u0027d be launching...\u003C/em\u003EHe shuddered. \u003Cem\u003EWhich means we\u0027ll need to transport the LV-N cores overland to Barkton\u003C/em\u003E \u003Cem\u003Ewhich\u0027ll just be a different headache\u003C/em\u003E. Wernher rubbed his eyes. \u003Cem\u003EFortunately not one that I\u0027ll need to deal with directly.\u003C/em\u003E He swallowed a mouthful of coffee and pulled the next stack of notes out of his briefcase.\n\u003C/p\u003E\n\u003Cp\u003E\nBuried in his work, Wernher failed to notice the light go on above his head or the soft chime that accompanied it. The steward cleared his throat more loudly, eyes deliberately fixed on the opposite cabin wall.  \u0022I\u0027m sorry sir but we\u0027re starting our descent. Please could you refasten your seatbelt and return your table to its stowed position.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher gathered up his papers, flipping them face down as he slid them into a buff folder, prominently marked with the Seal of Twelve Pillars and the letters KNSA arranged in a square. \u0022Of course,\u0022 he answered. \u0022and thank you for letting me know.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe steward smiled and went back to his seat. Wernher stared around the little twelve-seater cabin, working the cricks out of his neck before turning to the window again. The Wakiran east coast was just coming into view, a meagre strip of dusty green that rapidly petered out into duns and ochres. From the opposite window, the distant Diamondback mountains stretched across the horizon. The plane banked, revealing a glimpse of habitation strung out along the banks of a convoluted river delta. A labyrinth of jetties and pontoon bridges, decked out in gaudy fabric awnings added to the confusion. Away from the banks, the settlement became a recognisably kerman town, although rather more haphazardly organised than most and with a noticeable lack of greenery.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Skyway rolled wings level and lowered its undercarriage with a rumbling thump. It flew over a main road, dipped over a chain link fence and then, with a dainty flare, touched down neatly on the smaller runway of Balcabar International Airport. Wernher waited patiently until the plane had come to a standstill before gathering his luggage and making his way to to the exit. The cabin door opened and the heat hit him like a wall.\n\u003C/p\u003E\n\u003Cp\u003E\nA prickle of sweat broke out on Wernher\u0027s forehead and, just as quickly, was sucked away by the thirsty sun. The parched air smelled of aviation fuel, flint dust and over-baked stone. Bracing himself, he thanked the steward, hurried down the aircraft steps and made his way to the terminal building. A lone kerbal, dressed in a loose but heavy hooded poncho, waited for him just outside the door.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wernher? Good to meet you - glad you made it on time. I\u0027m Hading.\u0022 Hading pushed back his hood and thrust a bottle of water at Wernher. \u0022Here, let me take the bags - you\u0027d better get some of this into you.\u0022 He whisked Wernher through the airport, past a pair of security stations and into a small but thoroughly air-conditioned off-roader parked in a private car park. \u0022It\u0027s a couple of hours to Site D I\u0027m afraid. Feel free to nap on the way - I won\u0027t be offended by the lack of conversation and Kerm knows the scenery isn\u0027t worth staying up for.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher placed his briefcase carefully on the floor between his feet. \u0022I\u0027m fine thank you,\u0022 he said. \u0022Besides, the flight steward was very...attentive with the coffee - I\u0027m not sure I could sleep yet if I tried.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Fair enough,\u0022 said Hading, starting the car, \u0022In that case, hail and farewell to Balcabar - city of a thousand mosquitoes - and welcome to the beginning of the middle of nowhere.\u0022 He drove past the airport gates and pulled out onto the main road, accelerating briskly.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher stared at the ribbon of shimmering black asphalt receding into the distance. \u0022A thousand dessicated mosquitoes perhaps,\u0022 he said.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It gets a lot more muggy down-town,\u0022 said Hading. \u0022Somebody once told me that Balcabar is a shortening of Bal-cabara in old Kerba. Translates to \u0027homes on the sand\u0027 apparently, which seems a daft name for a town built on a river delta but there you go. Anyway, enough of the local history - did you manage to get through the briefing notes I sent you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EA little more local history might have been nice\u003C/em\u003E, Wernher thought. \u0022I finished the last of them on the plane,\u0022 he answered. \u0022By my reading, your materials test program is going well, you have a shortlist of fuel element designs and reactor configurations drawn up but the fabrication work hasn\u0027t started yet?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHading nodded. \u0022Preliminary materials testing has been done off-site - no sense building a new lab for that in the middle of a desert. So far we\u0027ve been optimising for reducing propellants, as per your recommendations, but we have started looking at coatings capable of handling water.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Good,\u0022 said Wernher. \u0022We won\u0027t get much of a specific impulse advantage from water but there\u0027s plenty of it out there for refuelling. Assuming we can persuade the KNSA that an LV-N is still required if we\u0027re only running it on water.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What else would we use?\u0022 asked Hading. \u0022Hypergolics are no good - I\u0027m no rocket engineer but I\u0027ve been doing some reading too and even I could tell you that the mass fraction would be lousy. Kerosene and liquid oxygen still wouldn\u0027t be as good as a water propelled nuke and boil-off on the oxygen would be horrible. I don\u0027t even want to think about using liquid hydrogen.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We could use water as a portable hydrogen supply and electrolyse it as required,\u0022 said Wernher.\n\u003C/p\u003E\n\u003Cp\u003E\nHading glanced at him incredulously before turning his attention back to the road. \u0022You can\u0027t be serious,\u0022 he said. \u0022Unless you actual rocket engineers are comfortable with far more points of failure than I would be.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I didn\u0027t say it was a good solution,\u0022 said Wernher mildly, \u0022but it would be a non-nuclear one.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Provided you can hang several net-ball courts worth of photovoltaics off the ship,\u0022 muttered Hading. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Agreed,\u0022 said Wernher, \u0022And that\u0027s one factor that the design team are looking at very closely. We won\u0027t have a final answer until the latest set of Hope probes reach Duna space next year, so in the meantime the KSA are running parallel design programmes for the colony ships and demonstrator programmes for key technologies.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That figures,\u0022 said Hading. \u0022So far we\u0027ve only been resourced for a single test stand and one prototype. So you and I will be picking the most likely reactor design and deciding how to turn it into a working nuclear rocket. That\u0027s our turn-off up ahead - give me a minute.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher caught sight of a signpost just before Hading pulled off onto a side road. Fresh black asphalt abruptly gave way to a broad swathe of hard packed pavement, innumerable heavy gauge tyre tracks just visible against the densely compacted surface. Hading reached for the water bottle wedged into his door tray and downed half of it in a single gulp. \u0022Get some more down you,\u0022 he advised. \u0022Don\u0027t let the cold fool you - it\u0027s still drier than an a mallek\u0027s temper in here so you need to keep drinking.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher nodded and took a swallow from his own bottle. For a while he watched the desert roll past. \u0022I\u0027ve been thinking about the reactors,\u0022 he said at last. \u0022Configuration C seems like the best option, especially if we can run a heat exchanger off the secondary coolant channels and use it to drive a generator. The extra electrical power would be helpful.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We can do that with any of the configurations,\u0022 said Hading glumly. \u0022Figured you\u0027d pick the toughest option though.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It just looked like the highest propellant flow option,\u0022 said Wernher, \u0022Granted, we\u0027ll never be launching anything on an LV-N but a semi-reasonable thrust to weight ratio will make the trajectories a lot easier to work with.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yeah but higher propellant flow means more cooling and bigger thermal gradients across the core to design around,\u0022 said Hading. \u0022Not to mention that all that lovely propellant is also going to make a lovely neutron moderator, giving us an interestingly non-linear feedback loop during startup.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher grimaced. \u0022What about normal operation.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Shouldn\u0027t be too bad once we\u0027re at steady state flow,\u0022 said Hading. \u0022Unless you wanted it to be throttleable too. The control drums will need to be fail-safe of course and we\u0027ll build in a thermal cutout. Worst case scenario is that the reactor shuts down before going runaway. Not ideal during a critical manoeuvre but a sight better than having to cope with a nuclear meltdown on the back of your spacecraft. Anyway, these are the sort of trifling small details that we\u0027\u0027re here to work out.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022At least the engine design won\u0027t be too complicated said Wernher, \u0022No igniters required, single pump...\u0022 His voice trailed away thoughtfully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027ll take your word for it,\u0022 said Hading. \u0022Good to hear we get \u003Cem\u003Esome\u003C/em\u003E breaks with this thing.\u0022 Both engineers took another swig of water and lapsed into companionable silence.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbol was dipping low in the sky when Hading pulled up outside a heavy steel security gate. Chain link fence stretched out in either direction from the gate, fronted by a double row of large concrete blocks, spaced far enough apart to let a kerbal through but nothing larger. Armed guards patrolled behind the fence. In the distance Wernher saw a handful of blocky, white-painted outbuildings, their roofs glinting in the setting sun. Behind them, an enormous barn-like structure and a gantry crane stood out against the skyline. To his surprise, a ring of floodlight poles surrounded both crane and barn. \n\u003C/p\u003E\n\u003Cp\u003E\nHading saw his expression. “Not much to the place at the moment,” he said. “The business end of the test stand is all underground - you can see the loading crane on the horizon there. That architectural masterpiece next to it is where all the construction gear is parked out of the way of any passing sandstorms. Building work tends to happen at night when it’s cooler, hence the floodlights. As for the rest of it, well that’s home sweet home. Welcome to Site D.”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026lt;\u0026lt; \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2670202\u0022 rel=\u0022\u0022\u003EChapter 65\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E:     \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2729750\u0022 rel=\u0022\u0022\u003EChapter 67\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026gt;\u0026gt; \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-01T14:34:58Z\u0022 title=\u002205/01/2020 02:34  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 1, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-08-01T05:38:32Z","Content":"\n\u003Cp\u003E\nAwwww yih. \u0022Nuke... from orbit. Only way to be sure.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nalso:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ninterestingly non-linear feedback loop\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis line just begs further use. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yes, there was an interestingly non-linear feedback loop. Now if you\u0027ll excuse me, I\u0027m going to go over here and glow in the dark for a while.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2016-08-02T09:38:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222699696\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470029912\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/31/2016 at 10:38 PM, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Yes, there was an interestingly non-linear feedback loop. Now if you\u0027ll excuse me, I\u0027m going to go over here and glow in the dark for a while.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRocket scientists and engineers do love their understated euphemisms - see also the classic \u0022rapid unplanned disassembly\u0022.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-02T09:38:49Z\u0022 title=\u002208/02/2016 09:38  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 2, 2016\u003C/time\u003E by Commander Zoom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-02T11:30:12Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nFlight directors aren\u0027t immune either. For example, advising the crew of a jerry-rigged suborbital rocket powered by four homemade SRBs that the lift-off \u0027might be a little bumpy\u0027.\n\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2016-08-04T07:25:31Z","Content":"\n\u003Cp\u003E\nKSK. I don\u0027t know to if I should hate you or love you right now. On the one hand you killed Ornie, but on the other you made me care enough about him that his death meant something. So I guess all I can say is thank you. Thank you for writing this story for us.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;line-height:12.8px;\u0022\u003Etotally\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E not tearing up right now.\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-05T06:59:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222703924\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470295531\u0022 data-ipsquote-userid=\u002267451\u0022 data-ipsquote-username=\u0022briansun1\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, briansun1 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSK. I don\u0027t know to if I should hate you or love you right now. On the one hand you killed Ornie, but on the other you made me care enough about him that his death meant something. So I guess all I can say is thank you. Thank you for writing this story for us.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;line-height:12.8px;\u0022\u003Etotally\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E not tearing up right now.\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs always Briansun - you\u0027re very welcome and thanks for the appreciation.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next chapter is finally taking shape in my head and I should have a nice chunk of time this weekend to set some of it down. In no particular order, it may feature: a giant leap for kerbalkind, the appearance of a new old character, and a papier-mâché cactus...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd on a completely different note, that\u0027s an interesting feature of the forum editor I just found. On the off-chance that nobody else is aware: hold down your vowel button and get a nice pop-up list, with hotkeys no less, of that vowel with various accents applied. Rather useful, especially when writing about the Mün. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-05T07:02:39Z\u0022 title=\u002208/05/2016 07:02  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 5, 2016\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-08-05T08:17:57Z","Content":"\n\u003Cp\u003E\nuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeY\n\u003C/p\u003E\n\u003Cp\u003E\nUh, wat?\n\u003C/p\u003E\n\u003Cp\u003E\nAll I get is the above. Unless you\u0027re talking tablets, which that feature is availabile any time the keyboard is up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-05T09:19:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222705335\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470385077\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeY\n\u003C/p\u003E\n\u003Cp\u003E\nUh, wat?\n\u003C/p\u003E\n\u003Cp\u003E\nAll I get is the above. Unless you\u0027re talking tablets, which that feature is availabile any time the keyboard is up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Maybe it\u0027s a Mac thing. Scratch that - it is a Mac thing - I\u0027ve just tried it out in a separate program. Sorry folks. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2016-08-05T10:52:59Z","Content":"\n\u003Cp\u003E\nWell, another decent thing to consider, if you need to write about the Mün, is that alt-codes work, too.  At least, they worked for me.\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2016-08-05T20:07:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222705411\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470394379\u0022 data-ipsquote-userid=\u002289995\u0022 data-ipsquote-username=\u0022Madrias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Madrias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, another decent thing to consider, if you need to write about the Mün, is that alt-codes work, too.  At least, they worked for me.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlt-codes work for Windows (maybe Linux) users, but Mac users are restricted to only the characters on the keyboard. Though, if you (Mac user) hold Alt and mash the keyboard, you\u0027ll find some interesting characters on your screen.\n\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2016-08-06T01:29:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222706021\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470427658\u0022 data-ipsquote-userid=\u0022110660\u0022 data-ipsquote-username=\u00220111narwhalz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, 0111narwhalz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlt-codes work for Windows (maybe Linux) users, but Mac users are restricted to only the characters on the keyboard.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know.  KSK mentioned the Mac version above, I offered a Windows alternative that works in the event of not having a Mac.\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2016-08-06T01:31:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222706400\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470446979\u0022 data-ipsquote-userid=\u002289995\u0022 data-ipsquote-username=\u0022Madrias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Madrias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know.  KSK mentioned the Mac version above, I offered a Windows alternative that works in the event of not having a Mac.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKSK mentioned holding down vowel keys. That\u0027s distinct from what I\u0027m talking about.\n\u003C/p\u003E\n"}]}