{"TopicId":30875,"ForumId":16,"TopicTitle":"Bring a dead probe back to life.","CreatedByName":"Engineer_Tony","CreatedById":66416,"CreatedDateTime":"2013-06-02T09:36:34Z","PageNum":1,"Articles":[{"CreatedByName":"Engineer_Tony","CreatedById":66416,"CreatedDateTime":"2013-06-02T09:36:34Z","Content":"\n\u003Cp\u003EHello Kerbonauts.\u003C/p\u003E\u003Cp\u003EI thought i would share a litte gem of an idea i stubled across that saves you from losing your probes.\u003C/p\u003E\u003Cp\u003EHere\u0027s the situation:-\u003C/p\u003E\u003Cp\u003EYou have launched a sweet little probe out amongst the planets, but during the chaos of launching you forgot to deploy those folded solar panels \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E and now your probe is completely powerless and you have no choice but to abandon it.\u003C/p\u003E\u003Cp\u003EWell here are a couple of solutions i use to avoid this happening (I have not yet found a way to truly ressurect a dead probe without this prior preparation)\u003C/p\u003E\u003Cp\u003E1.Fit at least one basic square solar panel. This panel is always \u0027on\u0027 therefore all you have to do is wait for it to rotate sunward and you will get a trickle of power, should be enough to deploy your main solar panels. You would have to be really unlucky to be in a position where your emergency panel is permanently facing away from the sun.\u003C/p\u003E\u003Cp\u003EThis can also be done with the nuclear generator but i find them a pain in the ass to fit, and they ruin the aesthetics.\u003C/p\u003E\u003Cp\u003E2.Fit an emergency battery. This is my chosen method and it works like this. Fit a battery to your probe and just before launch right click on it. You will see a display of the batteries current charge and to the right hand side of that a small green triangle. If you click this triangle the power stored in this battery will not be used by your craft (it switches to a red stop sign) therefore if you happen to lose all the power on your probe you can switch it back on thereby activating your emergeny power supply \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E (you do of course have to remember to isolate it befor launch).\u003C/p\u003E\u003Cp\u003EI hope somebody finds this useful, if anyone has any more little tips on this please feel free to share.\u003C/p\u003E\u003Cp\u003EMay all your probes live long and fruitful lives. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-06-02T11:11:32Z","Content":"\n\u003Cp\u003E\u002B1 for basic \u0027always on\u0027 solar panels. Hadn\u0027t thought about the battery thing myself, I just use RTGs. Perhaps you can tie the battery into action groups? I haven\u0027t checked what actions you can do for batteries, but if you use an action group during launch (like I do for locking engine gimbals) you could tie it into there so you don\u0027t forget.\u003C/p\u003E\u003Cp\u003EA tip for RTGs, you can hide them inside other things if you don\u0027t like the aesthetics. I used to stick mine into fuel tanks or even pods. I have read posts about issues sometimes arising from clipping/hiding, so use at your own risk.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-06-02T11:24:42Z","Content":"\n\u003Cp\u003EKerbals can deploy solar panels manually during EVA. Just plan a short stop in your next manned mission in that direction.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-06-02T11:36:12Z","Content":"\n\u003Cp\u003EOn #2:\u003C/p\u003E\u003Cp\u003EI tried that in the past and epically failed. I \u0027stopped\u0027 one of my fully charged batteries shortly after launch in the hopes of reviving my probe once I ran out of juice. Turned out I couldn\u0027t, I did not have enough power to turn on the power. Since that time I pretty much always stick at least 1 RTG to my rockets.\u003C/p\u003E\n"},{"CreatedByName":"Joe_Bender","CreatedById":60838,"CreatedDateTime":"2013-06-02T14:00:06Z","Content":"\n\u003Cp\u003EI typically put four to six OX-STAT panels around my tugs or kicker units just for the simple fact that they need some power and I dont want to mess with deploying panels. I also use them on my landers.\u003C/p\u003E\n"},{"CreatedByName":"Dust","CreatedById":96482,"CreatedDateTime":"2013-12-20T05:59:56Z","Content":"\n\u003Cp\u003EYou could go into your quicksave, find your probe, find one or more of the solar panels and change it/them from \u0022stateString = RETRACTED\u0022 to \u0022stateString = EXTENDED\u0022. \u003C/p\u003E\u003Cp\u003EBut of course that would be cheating...\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2013-12-20T08:05:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EOn #2:\u003Cp\u003EI tried that in the past and epically failed. I \u0027stopped\u0027 one of my fully charged batteries shortly after launch in the hopes of reviving my probe once I ran out of juice. Turned out I couldn\u0027t, I did not have enough power to turn on the power. Since that time I pretty much always stick at least 1 RTG to my rockets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrior to .23 you could not do this. But now you can.\u003C/p\u003E\u003Cp\u003EEven before .23 if you had a full stopped battery, although you could not turn it back on, you could transfer electric charge from it to the probe core or another battery to get things working.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-20T09:46:05Z","Content":"\n\u003Cp\u003EI found solar power too unreliable. In career I only use it until I discover RTGs. In sandbox I use only RTGs.\u003C/p\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-12-20T10:08:06Z","Content":"\n\u003Cp\u003EPersonally, I just give it enough juice \u0022by default\u0022 that it can run for a few minutes after reaching its destination until it needs to deploy panels. Additionally, using KAS to simply \u003Cem\u003Eattach\u003C/em\u003E a square panel on your next manned mission is handy if you\u0027re like me and totally forget to add a power supply until your probe is in Joolian orbit. Another option, of course, is to replace all your probe cores with Mk I lander cans, which are slightly bigger and somewhat heavier but don\u0027t require power and also have a \u0022spare\u0022 Kerbal on board.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-20T10:10:27Z\u0022 title=\u002212/20/2013 10:10  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 20, 2013\u003C/time\u003E by zxczxczbfg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ChrisMayhew","CreatedById":90199,"CreatedDateTime":"2013-12-20T11:52:10Z","Content":"\n\u003Cp\u003ESince suffering from this recently I have always put a square solar panel or two on every craft and I have also used the spare battery method you mentioned..\u003C/p\u003E\u003Cp\u003ENothing worse than sending something up and forgetting about power and it becomes useless.. haha\u003C/p\u003E\u003Cp\u003EI did however manage to put a square panel on and was very unlucky in the fact that it was completely pointing away from the sun so it would have took me ages of speeding up time to get any bit of power back.. lol\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-12-20T12:55:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Engineer_Tony\u0022 data-cite=\u0022Engineer_Tony\u0022\u003E\u003Cdiv\u003E2.Fit an emergency battery. This is my chosen method and it works like this. Fit a battery to your probe and just before launch right click on it..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood idea.\u003C/p\u003E\u003Cp\u003ENote that in 0.23, you can use tweakables in the VAB to have this battery off by default, instead of having to remember to do it on the launch pad each flight.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-20T13:06:41Z","Content":"\n\u003Cp\u003EI managed to strand my Progress test that way. I set up rendezvous and warped. This being RSS, it lasted quite long. Coming out of warp... rats, the panels were facing away from the Sun the whole time! I suppose it\u0027ll have to wait until the Sun shines on the panels, which is going to take some time...\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-20T13:51:08Z","Content":"\n\u003Cp\u003EI ALWAYS fit a set of small panels to EVERYTHING. They\u0027re extremely light, and any power is good. RTGs are heavy, and only used for things that need to be powered overnight.\u003C/p\u003E\n"}]}