{"TopicId":30901,"ForumId":32,"TopicTitle":"Wing Crosses Halfway the Globe!?","CreatedByName":"whiterafter","CreatedById":66064,"CreatedDateTime":"2013-06-02T13:46:47Z","PageNum":1,"Articles":[{"CreatedByName":"whiterafter","CreatedById":66064,"CreatedDateTime":"2013-06-02T13:46:47Z","Content":"\n\u003Cp\u003EDuring a launch catastrophe, one of my winglets went flying off, ascending. I was like \u0022LOL, its going to cross the globe! (sarcasm)\u0022. So I went to the wing and applied 4x time acceleration. It ascended, to an apoapsis of 64 km. It then decelerated and its apoapsis would be 5 km less each go.\u003C/p\u003E\u003Cp\u003EEventually it would descend, then randomly its apoapsis would go up and it would gain speed. However, after crossing that \u0022middle\u0022 ocean, it randomly turned around and slowly began heading back. It went north, so it crossed the ocean higher. If you look at Mapsat maps of Kerbin, it flew right over that island in the middle ocean at 30,10.\u003C/p\u003E\u003Cp\u003EIt then passed over the island again, and I was going really slowly there and I was worried I\u0027d crash before making it back. However, the island seemed to be good luck and I gained tons of speed over the island and began flying west again at a much faster rate.\u003C/p\u003E\u003Cp\u003EHowever, at precisely -20,-20, it turned around again and began heading eastward. At this point I just quit. The winglet is an AV-R8 and has nothing really unusual. Its top speed when ascending to 64 km was like 2500 m/s.\u003C/p\u003E\u003Cp\u003EIt was at 4x time acceleration the entire time.\u003C/p\u003E\u003Cp\u003ESo what happened. I have photos but my imgur is broken so I will do them on special request as it will take me time to get uploaded.\u003C/p\u003E\n"},{"CreatedByName":"Nicoli","CreatedById":68993,"CreatedDateTime":"2013-06-02T13:51:50Z","Content":"\n\u003Cp\u003EI think it was a glitch. I ejected out of one of my planes at about 5000m. If it wasn\u0027t for the fact I started a new game It would still be orbiting Kerbal at 5000m going about 23m/s. No clue how or why but I just could not get the thing to crash/land. Engine was shutdown too.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-02T13:59:19Z","Content":"\n\u003Cp\u003EThis is a known issue with KSP\u0027s atmospheric system.\u003C/p\u003E\n"}]}