{"TopicId":31387,"ForumId":44,"TopicTitle":"What exactly is sentience?","CreatedByName":"itstimaifool","CreatedById":61889,"CreatedDateTime":"2013-06-04T23:33:30Z","PageNum":1,"Articles":[{"CreatedByName":"itstimaifool","CreatedById":61889,"CreatedDateTime":"2013-06-04T23:33:30Z","Content":"\n\u003Cp\u003ESo I was reading an interesting article in Wired magazine today. It was about a guy who hopes to build a complete, working model of a human brain in a computer. He claims that, if it works, it will be a fully intelligent, sentient, self-aware intelligence. I thought to myself, \u0022Nah, you can\u0027t have real intelligence in a computer. The only thing computers can do is follow strict instruction!\u0022 But then I began thinking, and started to get pretty existential. What exactly is intelligence? \u003C/p\u003E\u003Cp\u003ELet\u0027s say that this model of a brain does work. It gets every single neuron right, and every connection between them right. If it gets everything right, then one can reasonably assume that it would function like a human brain and be intelligent. But what would that mean for us? Simple: It would mean that every single one of our thoughts, feelings, actions, ideas, etc. is governed, on some level, by simple, inescapable commands: When neuron A pulses\u003Csup\u003E1\u003C/sup\u003E, neuron B does, too. When neuron D pulses\u003Csup\u003E1\u003C/sup\u003E, neuron a synapse\u003Csup\u003E1\u003C/sup\u003E forms between it and neuron C. So then, what is free will?\u003C/p\u003E\u003Cp\u003EBut on the other hand, consider this: Thousands of man-hours are spent writing the most complex code ever written, on the largest supercomputer ever built, and when it\u0027s turned on, nothing happens.\u003Csup\u003E3\u003C/sup\u003E Every detail is perfect, every neuron, every synapse, everything. But it\u0027s not intelligent. It just sits there. What would this mean? What makes us special?\u003C/p\u003E\u003Cp\u003ENote: Please respect everyone\u0027s opinions, and answer constructively. The internet has a tendency to devolve into flame wars from much more innocent topics than this, but I trust the maturity of the KSP community. Thank you!\u003C/p\u003E\u003Cp\u003EFootnotes:\u003C/p\u003E\u003Cp\u003E1. This probably isn\u0027t the right word, but I hope you know what I\u0027m talking about.\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E2. I know vaguely how the brain works, I just don\u0027t know the words. I swear!\u003C/p\u003E\u003Cp\u003E3. Then, after a few seconds, nothing continues to happen.\u003Csup\u003E4\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E4. I just finished reading Hitchhiker\u0027s Guide to the Galaxy. Good book.\u003C/p\u003E\u003Cp\u003E5. Wait, how did you get here?\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-06-05T00:15:21Z","Content":"\n\u003Cp\u003EMost everything I post in this forum is pure speculation and often incorrect, but this one time can confidently say \u0022Noone knows.\u0022\u003C/p\u003E\u003Cp\u003EHuman psychology shows most of us to be creatures of habit and on some level predictable, but our behaviors can be modified and changed both at will and against it to become extremely unpredictable. (See Pavlovs Dog).\u003C/p\u003E\u003Cp\u003ETo say a computer can\u0027t have a human brain because any simulation is simply synthetic I personally belive is a cop out. A simulation of that magnitude would become a emulator, and I will say that personally I would view a perfect emulation of a human brain as the real deal. Why not? It can do everything the real one can and it would have all of the same handicaps and quirks.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-06-05T00:15:27Z","Content":"\n\u003Cp\u003E\u0022What exactly is sentience?\u0022 is one of those philosophical navel-gazing questions that no one really has a good answer to, because no one really understands intelligence well enough to form the appropriate questions, let alone solve for 42.\u003Csup\u003E1\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s been a lot of pseudo-answers over the years, like Hofstadter\u0027s argument that sentience is a series of feedback loops, or the idea that sentience is the ability to maintain models of phenomenon in your head (including models of your own thought processes), but really you either have to frame things narrowly enough that the answers are self-evident (\u0022self-awareness\u0022 defined as the ability to recognize yourself in the mirror, and what not) or you just have to admit that we don\u0027t have any clue.\u003C/p\u003E\u003Cp\u003EOne would hope that the ability to build a working model of a human brain would go a long way towards solving these questions - it would give us something to poke at and prod with sticks in a way that would be unethical for us to do on living humans.\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E1\u003C/sup\u003EWhat do you get if you multiply six by nine?\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E2\u003C/sup\u003EOf course, if it really were a faithful reproduction of a human mind, why would poking it with a stick be any more ethical than poking a real human with a stick?\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E3\u003C/sup\u003E...and some good bits about frogs.\u003C/p\u003E\n"},{"CreatedByName":"tk5800thesecond","CreatedById":16577,"CreatedDateTime":"2013-06-05T00:16:08Z","Content":"\n\u003Cp\u003EI believe sentience or having a working mind is for the \u0022thing\u0022 to ask a question on its own without any prior stimuli, for example, apes who have been taught sign language don\u0027t ask \u0022what is this?\u0022 when left alone, but when a human asks \u0022would you like food\u0022 the ape says \u0022yes\u0022 back, however it doesn\u0027t go up to the human and ask \u0022can I have food\u0022 on it\u0027s own.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-06-05T00:30:48Z","Content":"\n\u003Cp\u003E\u0027Sentience\u0027 is the thing that proves there\u0027s a fundamental difference between humans and \u0027animals\u0027 intellectually, not just us being farther ahead on a scale. It\u0027s impossible to give a proper definition because it\u0027s something that probably doesn\u0027t exist, and of which there are only vague guesses on the nature of. There used to be quite \u0027hard\u0027 definitions, e.g. \u0027can make use of tools, and produce themselves\u0027, but they all got scrapped after people pointed out there were \u0027animals\u0027 could do in fact do all of them.\u003C/p\u003E\n"},{"CreatedByName":"itstimaifool","CreatedById":61889,"CreatedDateTime":"2013-06-05T01:07:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tk5800thesecond\u0022 data-cite=\u0022tk5800thesecond\u0022\u003E\u003Cdiv\u003EI believe sentience or having a working mind is for the \u0022thing\u0022 to ask a question on its own without any prior stimuli, for example, apes who have been taught sign language don\u0027t ask \u0022what is this?\u0022 when left alone, but when a human asks \u0022would you like food\u0022 the ape says \u0022yes\u0022 back, however it doesn\u0027t go up to the human and ask \u0022can I have food\u0022 on it\u0027s own.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting opinion. I have read that before, about the apes. The article I read mentioned something called a \u0027Theory of Mind\u0027 that people have, but most animals\u003Csup\u003E1\u003C/sup\u003E do not have. It is the ability to understand that other people have a completely independent mind from yours. Apes don\u0027t have this, so they don\u0027t know that the person to whom they are \u0027talking\u0027 knows things that the ape doesn\u0027t. This is why they never ask questions, because if they don\u0027t know the answer, they don\u0027t realize that other people might.\u003C/p\u003E\u003Cp\u003EPeople don\u0027t have a Theory of Mind until a few years of age, so some experiments have been done with very young children where a person tried to convince the children that they (the adult)\u003Csup\u003E2\u003C/sup\u003E prefer broccoli over chocolate cake, but the children couldn\u0027t understand that someone could have a different opinion.\u003C/p\u003E\u003Cp\u003ESo, maybe you could say that sentience = Theory of Mind. I like this definition, because if a species (like humans) starts asking questions, then eventually they\u0027ll get to where we are now (trying to unravel the mysteries of the universe), and beyond (I don\u0027t know what\u0027s beyond, it hasn\u0027t happened yet). Which is, I think, a pretty good definition.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stochasty\u0022 data-cite=\u0022Stochasty\u0022\u003E\u003Cdiv\u003Eit would give us something to poke at and prod with sticks in a way that would be unethical for us to do on living humans.\u003Csup\u003E2\u003C/sup\u003E\u003Cp\u003E2Of course, if it really were a faithful reproduction of a human mind, why would poking it with a stick be any more ethical than poking a real human with a stick?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is an interesting point. I guess you could say we could easily back it up, being a computer, in case we broke something. But if, again, it was a faithful reproduction, then it would feel pain.\u003Csup\u003E5\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003EFootnotes:\u003C/p\u003E\u003Cp\u003E1. I don\u0027t remember, are humans the only known animals with this ability, or are there others? I know apes don\u0027t, but I wouldn\u0027t be surprised if dolphins did. Some of them are pretty intelligent.\u003C/p\u003E\u003Cp\u003E2. I am a bad writer. I tend to use pronouns in the most confusing possible way, and then am unable to fix it. I can speak just fine, I swear! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E3. I like using footnotes.\u003Csup\u003E4\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E4. I realize that nothing leads to this\u003Csup\u003E3\u003C/sup\u003E footnote, so it\u0027s probably pretty lonely.\u003C/p\u003E\u003Cp\u003E5. I just realized how cool it is the technology has come so far that we can have a legitimate conversation about sentient computers that feel pain. But still no flying cars...\u003Csup\u003E6\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E6. I would actually prefer a driving plane, but flying cars are more clichÃƒÂ©.\u003Csup\u003E7\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E7. I\u0027m sorry if I used the wrong accent mark. I only speak English, and though our grammar and spelling (and language overall) is spectacularly convoluted and terrible, we don\u0027t ever use accent marks.\u003Csup\u003E8P\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E8. Oh dear, I appear to have become addicted to footnotes and now I can\u0027t stop.\u003C/p\u003E\u003Cp\u003EP.S. I just realized how few posts I have. My account was lost in the April catastrophe, in case anyone was wondering.\u003C/p\u003E\n"},{"CreatedByName":"SuperFastJellyfish","CreatedById":57985,"CreatedDateTime":"2013-06-05T01:10:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003E\u0027Sentience\u0027 is the thing that proves there\u0027s a fundamental difference between humans and \u0027animals\u0027 intellectually, not just us being farther ahead on a scale. It\u0027s impossible to give a proper definition because it\u0027s something that probably doesn\u0027t exist, and of which there are only vague guesses on the nature of. There used to be quite \u0027hard\u0027 definitions, e.g. \u0027can make use of tools, and produce themselves\u0027, but they all got scrapped after people pointed out there were \u0027animals\u0027 could do in fact do all of them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis.\u003C/p\u003E\u003Cp\u003EOn a lighter note, anything Captain Kirk will bed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-06-05T01:16:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022itstimaifool\u0022 data-cite=\u0022itstimaifool\u0022\u003E\u003Cdiv\u003E\u0022Nah, you can\u0027t have real intelligence in a computer. The only thing computers can do is follow strict instruction!\u0022 But then I began thinking, and started to get pretty existential. What exactly is intelligence? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuppose deep down that\u0027s all our brain is doing too?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022itstimaifool\u0022 data-cite=\u0022itstimaifool\u0022\u003E\u003Cdiv\u003EBut on the other hand, consider this: Thousands of man-hours are spent writing the most complex code ever written, on the largest supercomputer ever built, and when it\u0027s turned on, nothing happens.\u003Csup\u003E3\u003C/sup\u003E Every detail is perfect, every neuron, every synapse, everything. But it\u0027s not intelligent. It just sits there. What would this mean? What makes us special?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s the right question? It might mean that your model made faulty assumptions, for instance are you just modeling neuron action potentials (relatively easy), or are you modeling in high fidelity all of the complex molecular underworkings of each individual nuron and insulating cell, sodium channels and all that included (not at all close to possible with current technology). \u003C/p\u003E\u003Cp\u003EIf you made a literally perfect copy of a brain, indistinguishable in all physical characteristics from the original, and negating stochastic effects it did not function the same way as the original, then it would imply that the brain\u0027s function can not be fully described in terms of natural physics... spooky... But do we really have any reason at all to suppose this given our knowledge of biology? It there some phenomenon which we observe for which a physical explanation is impossible?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003E\u0027Sentience\u0027 is the thing that proves there\u0027s a fundamental difference between humans and \u0027animals\u0027 intellectually, not just us being farther ahead on a scale.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt gets tricky huh? The thing about observing sentience from the outside it that it is entirely subjective. People have posited things such as the Chinese room conjecture to argue against machine intelligence. Basically the argument is that even if a computer was made that could pass the Turing test (any arbitrarily sophisticated Turing test even), that computer still wouldn\u0027t be necessarily sentient. It\u0027s a double edged sword though. If you\u0027ve disproved machine sentience using the Chinese room, then you are going to have a really hard time dealing with the fallout: namely that the logic can be just as easily applied to biological entities as well. For instance you might see a person, and by observation be led to believe that he is sentient, but he is really dead on the inside. Unfortunately we cannot \u0027look inside\u0027, and directly observe sentience, we can only observe outside signs and behaviors we associate with sentience, so we can\u0027t actually tell for sure one way or the other. For instance whether sentience actually does separate us from other animals in any non-tautological sense. Either way the implications are discomforting.\u003C/p\u003E\n"},{"CreatedByName":"SuperFastJellyfish","CreatedById":57985,"CreatedDateTime":"2013-06-05T01:30:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022architeuthis\u0022 data-cite=\u0022architeuthis\u0022\u003E\u003Cdiv\u003EIt gets tricky huh? The thing about observing sentience from the outside it that it is entirely subjective. People have posited things such as the Chinese room conjecture to argue against machine intelligence. Basically the argument is that even if a computer was made that could pass the Turing test (any arbitrarily sophisticated Turing test even), that computer still wouldn\u0027t be necessarily sentient. It\u0027s a double edged sword though. If you\u0027ve disproved machine sentience using the Chinese room, then you are going to have a really hard time dealing with the fallout: namely that the logic can be just as easily applied to biological entities as well. For instance you might see a person, and by observation be led to believe that he is sentient, but he is really dead on the inside. Unfortunately we cannot \u0027look inside\u0027, and directly observe sentience, we can only observe outside signs and behaviors we associate with sentience, so we can\u0027t actually tell for sure one way or the other. For instance whether sentience actually does separate us from other animals in any non-tautological sense. Either way the implications are discomforting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never thought of it that way. It\u0027s almost like observing a train traveling at the speed of light. From an observers perspective, they would see everything inside the train as unmoving(if I recall my relativity physics basics). As such, a rock, while seemingly unmoving, unliving, and unperceptive, may actually be a sentient being that just traverses time at a different rate.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-06-05T01:35:11Z","Content":"\n\u003Cp\u003EI always thought of sentience as having the capability to create thoughts (that is, being able to think in your own language). That\u0027s just me though. From what I can see in this thread, there is no universally accepted definition.\u003C/p\u003E\u003Cp\u003EYou mind linking me to that wired.com post. I remember seeing a T.V. show about some computer scientists who were doing what you are saying, so I want to see if it\u0027s the same guys, and either way, see how far they have come along.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-06-05T01:38:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022architeuthis\u0022 data-cite=\u0022architeuthis\u0022\u003E\u003Cdiv\u003EPeople have posited things such as the Chinese room conjecture to argue against machine intelligence. Basically the argument is that even if a computer was made that could pass the Turing test (any arbitrarily sophisticated Turing test even), that computer still wouldn\u0027t be necessarily sentient. It\u0027s a double edged sword though. If you\u0027ve disproved machine sentience using the Chinese room, then you are going to have a really hard time dealing with the fallout: namely that the logic can be just as easily applied to biological entities as well. For instance you might see a person, and by observation be led to believe that he is sentient, but he is really dead on the inside. Unfortunately we cannot \u0027look inside\u0027, and directly observe sentience, we can only observe outside signs and behaviors we associate with sentience, so we can\u0027t actually tell for sure one way or the other. For instance whether sentience actually does separate us from other animals in any non-tautological sense. Either way the implications are discomforting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with the Chinese Room Conjecture and similar arguments is that it presupposes that the type of pattern recognition being done by the human with the instruction booklet is not, in fact, the primary building block of sentience (and that therefore anything capable of replicating that sort of pattern recognition would be sentient). This seems to be a rather far-fetched assumption, since the one thing that human brains are really, really good at (and far exceed computer capabilities at present) is pattern recognition.\u003C/p\u003E\u003Cp\u003E(Well, it\u0027s also pre-supposing that there exists an instruction booklet that a human could follow that would allow them to trick a Chinese speaker into believing that they spoke Chinese. Such instruction booklets do in fact exist, and are typically presented in a series of semester-long courses, the first of which typically title themselves variously as Introductory Chinese, Chinese I, and Chinese 101.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022itstimaifool\u0022 data-cite=\u0022itstimaifool\u0022\u003E\u003Cdiv\u003EThis is an interesting point. I guess you could say we could easily back it up, being a computer, in case we broke something. But if, again, it was a faithful reproduction, then it would feel pain.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe question\u003Csup\u003E1\u003C/sup\u003E\u003Csup\u003E\u003Csup\u003E2\u003C/sup\u003E\u003C/sup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E3\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E4\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E5\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E\u003Csup\u003E6\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E\u003C/sup\u003E here is \u0022do we base our ethical system on life\u0022 or \u0022do we base our ethical system on intelligence?\u0022 If we decide that the salient property as regards our system of morals is whether or not an entity is a \u0022flesh and blood\u0022 human, then there is no problem with poking and prodding a computerized replicate regardless of its putative ability to feel pain. If we decide that intelligence is the salient property, then it would be unethical to treat any \u0022sentient\u0022 computer system in a way we would not so treat ourselves, even if we knew for certain that that system were incapable of feeling pain. While I am firmly in the latter camp as regards the basis of morality, there does not appear to be any a priori reason why one choice would be more appropriate than the other. Indeed, evolution tends to suggest that picking the former is the superior option (insofar as species which choose the latter might quickly cease to be species when confronted with entities which chose the former); although as an aside I should note that thinking similar to the former choice has been used to justify some truly horrible events in our past.\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E1-6\u003C/sup\u003EI was going to build a footnote labyrinth here, a la XKCD, but, as it turns out, I\u0027m far too lazy to actually put in that much effort.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T01:43:29Z\u0022 title=\u002206/05/2013 01:43  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Stochasty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jheriko","CreatedById":67666,"CreatedDateTime":"2013-06-05T01:40:26Z","Content":"\n\u003Cp\u003ESo, there are a few things I\u0027d like to say about this... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirstly in a strictly purist sense I do not believe that there is anything particularly special to distinguish the laws of nature that apply to me over, say, this chair I am sitting on. Life is basically unmeasurable and unquantifiable if you are looking for anything beyond a certain accuracy, and so I believe is sentience as a property of life.\u003C/p\u003E\u003Cp\u003EIts a very useful label - the example that springs to mind is the pile of sand. As we add grains one by one we can never say when they become a pile - we can conclude (wrongly) that therefore the pile doesn\u0027t exist. It does infact exist, but it is a useful approximation to reality that we employ because stating precise numbers of sand is impossible - we have some ballpark idea that we call a pile.\u003C/p\u003E\u003Cp\u003EThe same is so with life and its many properties. Some are defined \u0027precisely\u0027 in terms of chemistry or other criteria, but even those can be challenged in this way... right the way down to constituent parts and even the logic and background for our theories. I\u0027ve seen very reasonable arguments that any complete theory of everything (with some assumptions about how good GR and QFT are...) has no precise concept of \u0027vacuum\u0027 or \u0027state\u0027, that measurements become meaningless at the tiny scale, things like space and time lose meaning and are emergent from something else - or even the concept of countability being unusable (and hence lots of axiomatic set theory, on which we base almost all of our mathematics and science).\u003C/p\u003E\u003Cp\u003EThen there is the question of what we think of as life in concrete examples... What about prions, which are tiny protein fragments which will replicate in vivo displaying a key property of what we consider life - to reproduce? Virions which are essentially giant molecules and do the same, maybe more by encoding for genes that affect their hosts... or viruses which are the same but happen to be encapsulated in protein that their RNA/DNA encodes the genes for assembling... and what about bacteria and so on? There are also stranger things like Spiegelman\u0027s monster... a strange result of forced evolution containing \u0027merely\u0027 a few hundred atoms, but able to replicate itself in the presence of RNA replicase? Where do we draw the line? What about software? By some measures computer viruses can be considered alive - and thanks to radiation, error tolerances and various other quirks of nature they are now evolving, live, in an artificial ecosystem. \u0027Artificial\u0027 is another one of those words though - where do we draw the line? How is my house or a factory any less natural than an ant hill or a beehive? How derived does a tool need to be before it stops being natural? On the flipside how can we justify not considering prions, virions, Spiegelman monsters or computer viruses to be life? \u003C/p\u003E\u003Cp\u003EAside from this I don\u0027t think you really know how the brain works - lets be honest here. No offence, its just that whilst neural networks are certainly capable of learning and are powerful tools for this, they are not the only functionality in the brain - there are many functions which are poorly understood on the cellular level involving the ion channels and their self-regulation which have effects on the neuron firings. The glial cells are also less well understood than the neurons, but are known to be important and at least partly responsible for brain function. I think the best neuroscientists will even deny having a good or near complete understanding of the matter and medicine is one of the more \u0027dangerous\u0027 of sciences for constant changing its mind and not being able to easily carry out good quality of experiments to pin things down (not always such a bad thing...)\u003C/p\u003E\u003Cp\u003EThere are plenty of people working on artificial neural networks and machine learning in general btw, and making things that can be considered intelligent has already happened, arguably going right back to the perceptron. In fact I believe the human neural summing function is known (or at least some generalisation or approximation of it) but being the result of chemical processes which come out of messier math than we have even invented yet it is a monsterous thing to calculate using classical computing resources. I wish I could quote a source for this because a figure here would really help pin down exactly how feasible it will ever be to build a \u0027true\u0027 replica of the neural network in the brain using classical computers.\u003C/p\u003E\u003Cp\u003EI do not subscribe to free will or any interpretations of quantum mechanics (including those which claim to have uncovered the magic of free will) - I prefer the \u0022it just works and the abstractions I use in my daily life are as useful for describing this as \u0027pile\u0027 is when discussing sand\u0022 interpretation. As a random aside am I the only one who finds spooky action at a distance far more reasonable than infinitely small things that must occupy the same point in space and time to communicate...\u003C/p\u003E\u003Cp\u003EThat being said I have a rather dull outlook on life it could be said - at the same time I can\u0027t really tell that I don\u0027t have free will and this illusion is rather convincing and works pretty well to an every-day approximation... I won\u0027t complain that the universe sees fit to allow us these comforting delusions of self-importance - it helps me feel smug when \u0027I\u0027 am successful. It also makes it a little easier somehow to not be worried about the meaning or consequences of approaching, asking or answering these \u0027deep and meaningful\u0027 questions. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: nearly forgot - referring to the \u0027question asking\u0027 criteria. What about animals who learn to perform one behaviour when they expect you to perform another in response? This requires no great intelligence - and in fact what is there to say that asking questions isn\u0027t learned behaviour in humans because it provides us with reward? Most obviously we get attention when we receive an answer. You never asked a guy/girl where she worked or some other mundane question only because you wanted his/her attention for a few more minutes whilst you think of something worthwhile to say? For example...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T01:44:40Z\u0022 title=\u002206/05/2013 01:44  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by jheriko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-06-05T01:57:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jheriko\u0022 data-cite=\u0022jheriko\u0022\u003E\u003Cdiv\u003EThe same is so with life and its many properties. Some are defined \u0027precisely\u0027 in terms of chemistry or other criteria, but even those can be challenged in this way... right the way down to constituent parts and even the logic and background for our theories. I\u0027ve seen very reasonable arguments that any complete theory of everything (with some assumptions about how good GR and QFT are...) has no precise concept of \u0027vacuum\u0027 or \u0027state\u0027, that measurements become meaningless at the tiny scale, things like space and time lose meaning and are emergent from something else - or even the concept of countability being unusable (and hence lots of axiomatic set theory, on which we base almost all of our mathematics and science).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d be careful about trying to use the lack of a \u0022theory of everything\u0022 in an analogous fashion to our inability to define intelligence. We physicists go to a lot (and I do mean a lot) of effort to make sure that every question we ask is well-defined and has a quantitative answer (even the string theorists, although only barely). Space and time might be emergent properties, but once we have a working theory we\u0027ll know exactly how they emerge, and on what scales we can consider \u0022spacetime\u0022 to be a good approximation. (I should mention that my current area of research is exactly this question.)\u003C/p\u003E\u003Cp\u003ESame thing for life, in principle. The rules of Go are quite simple, but they encode the emergence of life and death. Same with chemistry, once we get clear on our definitions.\u003C/p\u003E\u003Cp\u003EAnd so, eventually, it shall be for intelligence (thus, maybe, in the end, your analogy wasn\u0027t such a stretch after all).\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-06-05T03:43:48Z","Content":"\n\u003Cp\u003EI\u0027m gonna save you all from the long rambling post that I wrote on sentience vs sapience, and I\u0027ll summarize the parts that were even halfway interesting.\u003C/p\u003E\u003Cp\u003ETo say that an intelligence can\u0027t be predicted is to say that either we lack the knowledge to make that prediction, or there\u0027s something non-deterministic going on. Unless there\u0027s something going on at the quantum level, there\u0027s not a lot of room to say that the chemistry of the brain is non-deterministic (though the level of detail that would be necessary to make a prediction probably goes beyond just the state of the neurons, since chemistry can affect thought).\u003C/p\u003E\u003Cp\u003EThis kind of leads to the assertion that if we truly have free will, then it comes from something beyond our physical body.\u003C/p\u003E\u003Cp\u003EAt which point, my free will simulation triggers it\u0027s coping mechanism and makes an attempt at humor.\u003C/p\u003E\u003Cp\u003EWhen I was in college (computer science), friends would ask if I thought that we\u0027d ever have artificial intelligence. I\u0027d always look at them and say \u0022Why not? Anyone that works with computers half as much as I do can tell you we\u0027ve already got artificial attitude.\u0022\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-06-05T15:50:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EUnless there\u0027s something going on at the quantum level, there\u0027s not a lot of room to say that the chemistry of the brain is non-deterministic (though the level of detail that would be necessary to make a prediction probably goes beyond just the state of the neurons, since chemistry can affect thought).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome of you guys might be interested in the CBC\u0027s \u0022Quirks and Quarks\u0022 radio science magazine show\u0027s \u003Ca href=\u0022http://www.cbc.ca/quirks/episode/2012/04/07/april-7-2012/\u0022 rel=\u0022external nofollow\u0022\u003Esegment on quantum biology\u003C/a\u003E from about a year ago. They interviewed Dr. Seth Lloyd of MIT, Dr. Greg Scholes of the University of Toronto and Dr. Jennifer Brookes at Harvard University\u0027s Department of Chemistry and Chemical Biology. There are links on the episode\u0027s web page to a Nature article and a Wired article about quantum biology. The segment and articles aren\u0027t directly related to brain chemistry, but if quantum effects are starting to be observed in some areas of biology then they are bound to appear in a lot more as we gain more knowledge.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-06-05T15:54:21Z","Content":"\n\u003Cp\u003EWe can determine whether or not a human being is sentient, without having a precise definition of what sentience is. \u003C/p\u003E\u003Cp\u003EWhy would that not apply to an artificial brain?\u003C/p\u003E\u003Cp\u003EWhat is needed before an artificial human brain can be build, is that it is understood how it works. And with that there is still a long way to go.\u003C/p\u003E\n"},{"CreatedByName":"Gniuz","CreatedById":57846,"CreatedDateTime":"2013-06-05T16:00:13Z","Content":"\n\u003Cp\u003Eempathy - this is the main thing, or at least I would say it is.\u003C/p\u003E\u003Cp\u003EG.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-06-05T16:08:37Z","Content":"\n\u003Cp\u003EHow would you define empathy? There was a heuristic program that existed a while back that could have any sort of rule-of-thumb programmed into it. One set of rules it was given was to be a psychologist or psychiatrist, and to say neutral or (I think) empathetic phrases, and many real patients enjoyed this computer as their shrink. So, would you have considered that to be sentient?\u003C/p\u003E\n"},{"CreatedByName":"jheriko","CreatedById":67666,"CreatedDateTime":"2013-06-05T18:10:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stochasty\u0022 data-cite=\u0022Stochasty\u0022\u003E\u003Cdiv\u003EI\u0027d be careful about trying to use the lack of a \u0022theory of everything\u0022 in an analogous fashion to our inability to define intelligence. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t my intent - I was trying to draw analogy between \u0027life\u0027 and \u0027sentience\u0027 and things like \u0027space\u0027 or \u0027time\u0027, rather than analogising with some unknown theory of everything - i.e. as things that only make sense in coarse, practical day-to-day descriptions and not when you investigate them more closely.\u003C/p\u003E\u003Cp\u003EThe alternative analogy with the same meaning is perhaps that a theory of intelligence is analogous to classical physics... it only makes sense approximately, and only at a very coarse scale.\u003C/p\u003E\u003Cp\u003ESorry, just being nitpicky. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-06-05T19:55:36Z","Content":"\n\u003Cp\u003ESomewhat O.T., the word \u0022sentient\u0022 has changed meanings sharply over the last 50 years or so. It used to mean \u0022capable of sensing\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2013-06-05T23:19:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003E\u0027Sentience\u0027 is the thing that proves there\u0027s a fundamental difference between humans and \u0027animals\u0027 intellectually, not just us being farther ahead on a scale.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut we ARE just further ahead on a scale. There\u0027s no fixed limit, above which you can be said to be sentient, as far as I know.\u003C/p\u003E\u003Cp\u003EIt\u0027s like sexual preferences, it\u0027s scientifically meaningless to talk about people being straight or gay. It\u0027s all a sliding scale, with most people being near the \u0022straight\u0022 end, some near the \u0022gay\u0022 end , and a few closer to the middle. I imagine sentience the same way, with ringworms near the bottom, apes somewhere near our end of the scale, and us near the top.\u003C/p\u003E\n"},{"CreatedByName":"DrDima","CreatedById":63318,"CreatedDateTime":"2013-06-06T01:27:18Z","Content":"\n\u003Cp\u003E\u0027Sentient\u0027 is an illusion. It\u0027s semantics for human beings asking a lot of questions. The human brain is nothing more than one of the most complex things ever to exist and one of its byproducts is that we feel we are in control of our actions and feel we are capable of independent thinking.\u003C/p\u003E\u003Cp\u003ETheoretically we could simulate a human brain from a computer, however we lack the knowledge and technology. Most of the basic functions of the human brain, the \u0027basics\u0027, we understand. A lot of research has been done in artificial intelligence using something called \u0027nodes\u0027(this is a software implementation). But the real limitation of a computer is that it\u0027s built binary, in contrast with the human brain which has thousands of connections per neuron and can change those synapses to learn. So yeah, science is far from developing real sentience.\u003C/p\u003E\u003Cp\u003EI will reference on of my favorite scifi authors here again, Michael Crichton: Prey.\u003C/p\u003E\n"},{"CreatedByName":"itstimaifool","CreatedById":61889,"CreatedDateTime":"2013-06-06T23:27:15Z","Content":"\n\u003Cp\u003ESome interesting responses here. It\u0027s interesting to see philosophy, science, and maturity all in one place. And on the internet, of all places!\u003Csup\u003E1\u003C/sup\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI thought of another, related question: I read a snippet from someone explaining why this fully functional replica of our brain could never work. They said that any intelligence will never be able to fully understand itself. I don\u0027t know where I could find this, nor can I explain it as well as they did, but just take my word for it that it was a compelling argument. What is your opinion on this idea?\u003C/p\u003E\u003Cp\u003EI personally believe that it makes sense. However, the human race as a whole has a far greater intelligence than a single human. We have an extraordinary ability to cooperate (when we\u0027re not killing each other). Look at the Human Genome Project: Thousands of scientists worked together to accomplish a goal that many thought would be impossible, and that indeed no single person could have done. This project that I mentioned in the OP is a similar project drawing together hundreds, and hopefully in the future thousands, of neuroscientists. Perhaps no single one of these scientists, or anyone, can fully understand and comprehend their own brain. But each one could work on a small segment, and all of this data could be amalgamated. While no one person could understand the entirety of this data, the fact that such a database (hypothetically) exists would prove that the human race as a whole understands an individual brain. Kind of like swarm intelligence.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rickenbacker\u0022 data-cite=\u0022Rickenbacker\u0022\u003E\u003Cdiv\u003EBut we ARE just further ahead on a scale. There\u0027s no fixed limit, above which you can be said to be sentient, as far as I know.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with you on this, but Kryten has a point. There is a fundamental difference in the minds of Humans from all other animals. You could say this is just another step along that scale, but it\u0027s a fairly significant step.\u003C/p\u003E\u003Cp\u003E1. I guess I\u0027ve just had some bad experiences on some less-mature forums. \u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E*cough* Minecraft forums *cough*\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-06T23:30:40Z\u0022 title=\u002206/06/2013 11:30  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 6, 2013\u003C/time\u003E by itstimaifool\u003C/strong\u003E\n\u003C/span\u003E\n"}]}