{"TopicId":31396,"ForumId":16,"TopicTitle":"How do you create a rover and get it to the mun successfuly?","CreatedByName":"soldierboy333","CreatedById":69373,"CreatedDateTime":"2013-06-05T00:09:10Z","PageNum":1,"Articles":[{"CreatedByName":"soldierboy333","CreatedById":69373,"CreatedDateTime":"2013-06-05T00:09:10Z","Content":"\n\u003Cp\u003EI just got the game a few days ago. And today i completed my first moon landing. I\u0027d like to build a full base there but i need rovers first. i just need a link to a tutorial video or detailed instructions on making a rover and landing it on the mun. thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2013-06-05T02:44:16Z","Content":"\n\u003Cp\u003EHey man, welcome aboard.\u003C/p\u003E\u003Cp\u003EWhat you\u0027re asking for is how to see results in the game without playing, because the process of figuring these things out \u003Cem\u003Eis\u003C/em\u003E the game. =) \u003C/p\u003E\u003Cp\u003EIf you have specific hang-ups, you will find a bajillion people here who are willing to help, but if it\u0027s a munar sandbox that you\u0027re after, use hyperedit or persistent file edits or something.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-06-05T03:01:10Z","Content":"\n\u003Cp\u003EYes, the secret to doing anything big in KSP is a \u003Cem\u003Elot\u003C/em\u003E of trial-and-error, testing parts on Kerbin before sending them off to the Mun, designing rockets, and so on. This is rather similar to real life space programs; the amount of testing required for the Apollo Program was huge!\u003C/p\u003E\u003Cp\u003EAs for landing rovers, they are generally quite similar to landing kerbals in capsules, except that they are generally a more unwieldy payload (either make it symmetrical or play with the centre of mass and your rockets to make it fly straight), and don\u0027t need the capability to return to Kerbin.\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking for video tutorials, \u003Ca href=\u0022https://www.youtube.com/user/szyzyg\u0022 rel=\u0022external nofollow\u0022\u003EScott Manley\u003C/a\u003E is one of the best; he does great videos and some amazing tutorials as well.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2013-06-05T06:35:19Z","Content":"\n\u003Cp\u003EThis was my technique (Going for the ugliest lander ever competition!):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s289.photobucket.com/user/chrissetti/media/screenshot9-2_zps921fa78a.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i289.photobucket.com/albums/ll232/chrissetti/screenshot9-2_zps921fa78a.png\u0022 alt=\u0022screenshot9-2_zps921fa78a.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd a closer look at that lander (During testing on kerbin):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s289.photobucket.com/user/chrissetti/media/screenshot1-1_zpsa0f4b2fb.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i289.photobucket.com/albums/ll232/chrissetti/screenshot1-1_zpsa0f4b2fb.png\u0022 alt=\u0022screenshot1-1_zpsa0f4b2fb.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jheriko","CreatedById":67666,"CreatedDateTime":"2013-06-05T07:19:41Z","Content":"\n\u003Cp\u003EIf you make small 4 wheel 10m/s rovers you can easily strap them to the side of landers using symmetry and docking ports or separators then blast them off when you land. as long as you have a module on it you can control it and even right it if it lands on its back... small rovers are very light. If you\u0027ve gotten to the Mun already likely you have some spare delta-v enough for a couple of little rovers too...\u003C/p\u003E\u003Cp\u003Emy favourite mun landing has to be unintentionally lithobreaking a lander carrying only 3 rovers and detaching them one by one as the ship turned into a fireball sliding across the surface - they all survived to some degree - one in operable - another with one damaged wheel and another with solar panels missing. The lander was almost utterly obliterated. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}