{"TopicId":31411,"ForumId":20,"TopicTitle":"Stock versus Modded Game","CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-06-05T01:11:08Z","PageNum":1,"Articles":[{"CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-06-05T01:11:08Z","Content":"\n\u003Cp\u003EThis isn\u0027t another one of those posts. I just wanted to comment that I learned to play the game pure stock and then started using mechjeb and other mods. Just out of curiosity, I created a purely stock install a while back and I\u0027m doing one mission on the modded game and the same mission on the stock game - where appropriate. Obviously there is no Kethane equivalent in the stock game right now.\u003C/p\u003E\u003Cp\u003EI will admit, my skills are a little rusty. I can\u0027t make orbital insertions with the precision mechjeb can manage. I most certainly can\u0027t limit acceleration to terminal velocity or g limit as well either. But I can do a pretty fair approximation at least. So far I\u0027ve been able to land on the Mun, plant flags, etc in both modded and stock games. Has anyone else tried to do anything similar, run the game modded and stock?\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-06-05T01:15:05Z","Content":"\n\u003Cp\u003EI have. It\u0027s normal to not be as precise as MechJeb, no one can be. MechJeb is a computer. This is why real space agencies only work on computers, it reduces the human error risk. Of course the machine failure still exists but it\u0027s much more reliable.\u003C/p\u003E\u003Cp\u003EYou\u0027re probably not rusty, just not used to what a non MechJeb insertion looks like ^^ When I downloaded the mission pack that goes around the spaceport I remember that I almost forgot to do my gravity turn, at least the popup reminded me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-06-05T01:19:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI can\u0027t make orbital insertions with the precision mechjeb can manage\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow precise is mechjeb 2 these days anyway? Previously it didn\u0027t achieve that precise of a circular orbit. I routinely achieve a AP/PE difference of less than 50m by hand, is that considered precise?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-05T01:22:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003EHow precise is mechjeb 2 these days anyway? Previously it didn\u0027t achieve that precise of a circular orbit. I routinely achieve a AP/PE difference of less than 50m by hand, is that considered precise?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B/- 50 metres? That\u0027s highly accurate. MJ gets in the ballpark, maybe not that precise but close enough. MJ2 has been highly accurate for me so far in both launches and landings.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T01:28:26Z\u0022 title=\u002206/05/2013 01:28  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Jack Wolfe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-05T01:37:08Z","Content":"\n\u003Cp\u003EMechJeb can get really precise, esp. if the maneuvers \u003Cem\u003Eprior\u003C/em\u003E to the one you just did were also accurate--if you started off in bad form (manually), don\u0027t expect MechJeb to compensate for that.\u003C/p\u003E\u003Cp\u003EI\u0027ve only recently begun to use MechJeb again, but mainly to fine-tune my stack back at VAB--the ship specs feature is indispensible for that. But I\u0027ve gone to Eve/Gilly and back (didn\u0027t land Kerbals at Eve though--that\u0027s still a goal of mine down the road, esp. if I do plan to do it purestock) with a high degree of precision using just stock KSP, some tables, MS Excel, and a little luck.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-05T01:38:26Z","Content":"\n\u003Cp\u003EOne thing I haven\u0027t bothered checking is the eccentricity of the orbits I get with MJ. I got so used to the Orbiter MFD doing it for me... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"1096bimu","CreatedById":65460,"CreatedDateTime":"2013-06-05T01:38:54Z","Content":"\n\u003Cp\u003EI didn\u0027t get this game to practice any sort of \u0022skill\u0022, It\u0027s a sandbox game with a science and engineering theme and that\u0027s what I\u0027m gonna do, build stuff and test them out. Everything that can be done by a few lines of code will be done by the computer.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-05T01:40:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003EOne thing I haven\u0027t bothered checking is the eccentricity of the orbits I get with MJ. I got so used to the Orbiter MFD doing it for me... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut you can see that visually in Map view, by checking how the AP-PE nodes \u0022rotate\u0022 or \u0022flip around\u0022 when you circularize. Granted, it\u0027s not a precise value, but it\u0027s quite good to figure out if you\u0027re circular or not.\u003C/p\u003E\n"},{"CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-06-05T01:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003E\u002B/- 50 metres? That\u0027s highly accurate. MJ gets in the ballpark, maybe not that precise but close enough. MJ2 has been highly accurate for me so far in both launches and landings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a mental block, I still don\u0027t trust MechJeb to handle the landings.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-05T01:43:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221096bimu\u0022 data-cite=\u00221096bimu\u0022\u003E\u003Cdiv\u003EI didn\u0027t get this game to practice any sort of \u0022skill\u0022, It\u0027s a sandbox game with a science and engineering theme and that\u0027s what I\u0027m gonna do, build stuff and test them out. Everything that can be done by a few lines of code will be done by the computer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIronically, a lot of the real-world manned missions were actually \u0022saved\u0022 by piloting skill. Case in point--if Neil Armstrong allowed the PGNS/AGS to continue with its planned descent, the AP11 LM would have landed in an area that would have potentially tilted the LM to the point that it would have toppled over. The PGNS/AGS already wanted to land because it felt it was running out of fuel, but thanks to Neil\u0027s handling (and best guesstimate on fuel left), he managed to fly the LM horizontally towards an area that was flatter and where there were fewer obstacles. Lots of other cases in other manned missions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Conarr\u0022 data-cite=\u0022Conarr\u0022\u003E\u003Cdiv\u003EI have a mental block, I still don\u0027t trust MechJeb to handle the landings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep so in my example above, PGNS/AGS in the LM was basically the MechJeb equivalent.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-05T01:48:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EBut you can see that visually in Map view, by checking how the AP-PE nodes \u0022rotate\u0022 or \u0022flip around\u0022 when you circularize. Granted, it\u0027s not a precise value, but it\u0027s quite good to figure out if you\u0027re circular or not.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve noticed that, and assumed it was because the values were dead close. Good to know I guessed right! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Conarr\u0022 data-cite=\u0022Conarr\u0022\u003E\u003Cdiv\u003EI have a mental block, I still don\u0027t trust MechJeb to handle the landings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI consistently get within 5~10 metres of the desired landing site \u003Cem\u003Eif\u003C/em\u003E I start from an orbit of over 110km. I typically use 120km as a rule of thumb.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2013-06-05T02:04:23Z","Content":"\n\u003Cp\u003EWell... MechJeb has a direct data feed to the PRECISE orbital information currently available and \u0022can feasibly\u0022 do realtime calculations that have an insane degree of accuracy. (Doesn\u0027t mean the developers care enough to do them, just that it can feasibly do them).\u003C/p\u003E\u003Cp\u003EIt is more than a \u0022Flight Computer\u0022, it is a \u0022Total Awareness Unit\u0022 from CyberDyne Systems. O.O\u003C/p\u003E\u003Cp\u003E*Just meaning, you can\u0027t really compare your \u0022skills\u0022 against something that can theoretically have near 100% accuracy... while you\u0027re limited by the little information that is present.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T02:07:17Z\u0022 title=\u002206/05/2013 02:07  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Fel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T02:08:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EIronically, a lot of the real-world manned missions were actually \u0022saved\u0022 by piloting skill. Case in point--if Neil Armstrong allowed the PGNS/AGS to continue with its planned descent, the AP11 LM would have landed in an area that would have potentially tilted the LM to the point that it would have toppled over. The PGNS/AGS already wanted to land because it felt it was running out of fuel, but thanks to Neil\u0027s handling (and best guesstimate on fuel left), he managed to fly the LM horizontally towards an area that was flatter and where there were fewer obstacles. Lots of other cases in other manned missions.\u003Cp\u003EYep so in my example above, PGNS/AGS in the LM was basically the MechJeb equivalent.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah... and P66 is the Translatron.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-05T02:10:00Z","Content":"\n\u003Cp\u003EI like how people forget that Mechjeb just assists flying a mission. And I\u0027ll agree with some people that it\u0027s not perfect. I had rockets that I can bring to orbit manually but Mehchjeb can\u0027t do the same thing. Mechjeb is by no means perfect. It can even do two completely different things with the exact same ship.\u003C/p\u003E\u003Cp\u003EIt\u0027s just like auto pilots like the one from the Lazor System. That thing can\u0027t land a single space plane, even the ones that come with the mod.\u003C/p\u003E\u003Cp\u003EI only use MJ for things I tried and failed many times, like docking.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T02:12:46Z","Content":"\n\u003Cp\u003EI kind of like the 1.9.8 version of MechJeb. It\u0027s not as capable at MJ2 but it does the job. It doesn\u0027t automate things like rendezvous and docking but it gives me all the info that I need.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-06-05T02:16:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI consistently get within 5~10 metres of the desired landing site \u003Cem\u003Eif\u003C/em\u003E I start from an orbit of over 110km. I typically use 120km as a rule of thumb.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E120km orbit? Is this a Mun landing? It seems pretty high, I normally start powered descent from a descent orbit somewhere between 10-20km.\u003C/p\u003E\u003Cp\u003EManual precision landing is actually not that hard, I say about the same difficulty level as docking and same as with docking you get better at it the more you do it. It\u0027s a lot like flying a helicopter and that\u0027s certainly possible.\u003C/p\u003E\n"},{"CreatedByName":"FluxCap","CreatedById":60007,"CreatedDateTime":"2013-06-05T04:39:10Z","Content":"\n\u003Cp\u003E1234567890\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T04:42:24Z\u0022 title=\u002206/05/2013 04:42  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by FluxCap\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-05T05:04:00Z","Content":"\n\u003Cp\u003EWell the latest MJ I used for landing on the Mun scared the hell out of me. I mean, it landed perfectly and probably the most efficient way too, but it also had me going \u0022gonna crash gonna crash gonna crash\u0022 for the entire landing, so, I might go back to my less efficient manual landings.\u003C/p\u003E\n"},{"CreatedByName":"AkalaÃƒÂ«l","CreatedById":58210,"CreatedDateTime":"2013-06-05T07:01:02Z","Content":"\n\u003Cp\u003EI had MJ installed in the 0.19.\u003C/p\u003E\u003Cp\u003E0.20 came, and I didn\u0027t put that computer on my game.\u003C/p\u003E\u003Cp\u003EActually, I can do the same things than this tool, and \u003Cem\u003EI am \u003C/em\u003Eplaying the game, not MJ.\u003C/p\u003E\u003Cp\u003EOf course, I can\u0027t land so precisely than MJ, my bests landing are 500m away from my targets. Doesn\u0027t bother me.\u003C/p\u003E\u003Cp\u003EI launch my rockets better than it did (especially the big ones, and without this annoying search to be in the right plan... you know, tend to go to the right, overshoots, goes to the left, oversoot even more, ect ect \u003Cem\u003Ead nauseam\u003C/em\u003E)\u003C/p\u003E\u003Cp\u003EI dock better than MJ, no monopropellant wasted (I need, say, 20l of mono for the final approach, and that\u0027s it) and no time waiting in the lower orbit as recommended by the help encounter module.\u003C/p\u003E\u003Cp\u003EI recon that MJ was a sort of teatcher for me. It shows me tricks that I wasn\u0027t aware of : near perfect ascending path, how to get an encounter.\u003C/p\u003E\u003Cp\u003EBut the thing is that I learned all the manoeuvers in KSP \u003Cem\u003Ebefore \u003C/em\u003EI get MJ installed. So I perfected my skills with it, and no longer needs it.\u003C/p\u003E\u003Cp\u003EWell, no longer for the driving help at last.\u003C/p\u003E\u003Cp\u003EI\u0027m missing all the infos it was provided. I installed engeenier redux to have the delta-V of my rockets, and to have basics infos on my fligths, but I really regret the MASS of data you could get.\u003C/p\u003E\u003Cp\u003EOf course, in the orbital map, you can have some of the infos you need, but I like being in the staging mode and perform my manoeuvers. Simple exemple : how to circularise your trajectory in the staging window ? That momment when your AP is flipping with your PE is transcribe on the numbers you can get from MJ, but you have to be in the orbital map in the basic game to see it. I deplore that fact.\u003C/p\u003E\u003Cp\u003EI wish sometimes the devs will implement more data to be read in the game, so that I can get rid of all those addons.\u003C/p\u003E\u003Cp\u003ECheers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T07:07:39Z\u0022 title=\u002206/05/2013 07:07  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by AkalaÃƒÂ«l\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Uncle Mort","CreatedById":57933,"CreatedDateTime":"2013-06-05T10:28:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EI kind of like the 1.9.8 version of MechJeb. It\u0027s not as capable at MJ2 but it does the job. It doesn\u0027t automate things like rendezvous and docking but it gives me all the info that I need.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought I was the only one!\u003C/p\u003E\u003Cp\u003EI prefer the cleaner, simpler displays on 1.9.8 over MJ2 and, as you say, it does the job.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T10:53:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Uncle Mort\u0022 data-cite=\u0022Uncle Mort\u0022\u003E\u003Cdiv\u003EI thought I was the only one!\u003Cp\u003EI prefer the cleaner, simpler displays on 1.9.8 over MJ2 and, as you say, it does the job.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the MJ2 transparent displays look cool and flashy but they are not really easy to read which is a definite negative score on my end. I like the information to be easy to read so I can make an informed decision. I\u0027ve played with MJ2 and it\u0027s a VERY powerful guidance computer. It can play the whole game for you. But that isn\u0027t what I want. I want something like the Apollo guidance computer. \u003C/p\u003E\u003Cp\u003ENow the one reason I\u0027m going to have to play with is due to using hardware. Telemachus has a function to interface with MJ2 and my hardware will grab the data from the Telemachus system (hopefully). \u003C/p\u003E\u003Cp\u003EBut for pure keyboard control I use MJ1.9.8. As you say, it cleaner and simpler... and is easy to use. I do the Hohmann Transfers and docking manually. The only extra thing I use is the Lazor docking camera.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-06-05T10:54:21Z","Content":"\n\u003Cp\u003EI definitely need the information that Mechjeb provides (delta-v, speed, altitude), otherwise it feels like I\u0027m flying blind.\u003C/p\u003E\u003Cp\u003EWhen designing a rocket, I need to know if it\u0027s capable of getting anywhere in the first place. Without Mecheb\u0027s delta-v display I can only guess.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T12:04:19Z","Content":"\n\u003Cp\u003EWell I\u0027m amazed at the makers of MechJeb... Hidden away in the Settings of MJ2 is an option to make it have the skin of MJ1... so I that\u0027s one big plus for MJ2 in my book. I\u0027m not a fan of transparent menus you see.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3UcemiW.png\u0022 alt=\u00223UcemiW.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T12:07:04Z\u0022 title=\u002206/05/2013 12:07  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by NeoMorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"whiterafter","CreatedById":66064,"CreatedDateTime":"2013-06-05T12:17:58Z","Content":"\n\u003Cp\u003EI\u0027d just like to say here that I only use Lazor System. Even then, I use that only for informational purposes (physical parameters, phase angles) and stuff like that. I haven\u0027t used MechJeb at all. \u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E I think some people use MechJeb so \u0022confidently\u0022 that they\u0027re not cheating by using it, that they use it so much they practically are cheating\u003C/strong\u003E. I\u0027ve been to Duna and back without any mod but Lazor System (used informationally).\u003C/p\u003E\u003Cp\u003EI may eventually get MechJeb, but I\u0027d probably make a restriction that I\u0027d have had to already do the landing on my own (Apollo 11) and then use MechJeb for all the other landings and such (Apollo 12,14,15,16,17).\u003C/p\u003E\u003Cp\u003EI am really interested in its landing feature but I\u0027d have to use that with caution.\u003C/p\u003E\u003Cp\u003EAnd I\u0027m not a purist, but this is just how I\u0027ve sort of introduced myself to the game. I sort of felt hurt when I found out people had effectively made it into orbit without doing anything with MechJeb, when I spent 2 weeks trying to get into orbit the normal way.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T12:27:19Z","Content":"\n\u003Cp\u003EApollo 11 landed WITH THE EQUIVALENT OF MECHJEB TRANSLATRON.\u003C/p\u003E\u003Cp\u003EIf something is going to push my buttons it\u0027s this myth that Neil landed the LEM manually. He landed it under computer control with human doing the equivelant of saying to the computer \u0022Don\u0027t land in the crater, go over there\u0022. The thrust was under P66 landing program with manual guidance input... THAT\u0027S where manual is mistaken for totally manual.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAt MET 102:43:20 (430 feet) Armstrong flicked a spring loaded toggle switch with his left hand, entering the rate-of-descent mode (P66). \u003Cstrong\u003ENow the computer controlled the spacecraft\u0027s thrust to maintain a rate-of-descent commanded by the ROD switch.\u003C/strong\u003E A flick upward slowed the descent by one foot per second; a flick downward increased the descent rate by the same amount. Using the joystick, Armstrong tilted the LM to null out horizontal velocity and bring the LM to a safe area for touchdown. After some \u0022possibly spastic\u0022 control motions because dust kicked up by the exhaust plume distorted his perception of translational velocity, at MET 102:45:40, Armstrong landed the spacecraft safely in the Sea of Tranquility.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup... Armstrong was using the equivelant of a MechJeb Translatron to help handle the thrust so he could concentrate on choosing a good clear landing area.\u003C/p\u003E\u003Cp\u003EGo and have a read here... \u003Ca href=\u0022http://www.klabs.org/history/apollo_11_alarms/eyles_2004/eyles_2004.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.klabs.org/history/apollo_11_alarms/eyles_2004/eyles_2004.htm\u003C/a\u003E - it\u0027s from one of the guys who made the apollo guidance computer.\u003C/p\u003E\u003Cp\u003EI guess Armstrong was cheating then heh.\u003C/p\u003E\n"}]}