{"TopicId":31481,"ForumId":16,"TopicTitle":"(Space)planes keep making constant left turns.","CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2013-06-05T13:15:33Z","PageNum":1,"Articles":[{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2013-06-05T13:15:33Z","Content":"\n\u003Cp\u003EI just tried too dabble with SPH, and noticed a few quirks..\u003C/p\u003E\u003Cp\u003EAll my planes, Selfmade, Stock and downloaded ones claiming too be very stable, all are pulling too the left, and are near uncontrollable, and over sensitive, even with turning sencetivity down, i tried with an Controller, Even used my FSX controllers, without controllers, unmodded KSP (pure stock), and Modded KSP with FAR, but nothing seems too work.\u003C/p\u003E\u003Cp\u003ELike this is a broken part of KSP and utterly not working as intented..\u003C/p\u003E\u003Cp\u003EAt first i blamed myself (allthough i know pretty well how too fly planes and even Choppers IRL and in FS(x) series) since this flight model for planes is as realistic as a Marvel Comic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI just cant control the planes in KSP, with them pulling hard too the left.. \u003C/p\u003E\u003Cp\u003EI made a pretty stable plane now, and its pretty good controllable compared too the stock ones, but i just have too keep steering right too get out of the constant left pulling what makes flying it ackward, and i checked, and rechecked, tuned and retuned postions of all parts, but the left pulling just cant be eliminated somehow.\u003C/p\u003E\u003Cp\u003EIt starts on the runway, and only get worse and worse as the speed and altitude raises. \u003C/p\u003E\u003Cp\u003ETried several wing conffigurations, and positions, V-shape ailerons, T-Shape and basic low-cross chape, everything leads too the same result, a left pulling plane :S\u003C/p\u003E\u003Cp\u003EIt drives me nuts...\u003C/p\u003E\u003Cp\u003EI checked about everything, checked my controllers in FSX, A10-Warthog, and few more tests, and they are all perfectly calibrated, can fly in those games straight without even touching my controllers, but in KSP.. well constant left turning..\u003C/p\u003E\u003Cp\u003EI tried added RT/MJ and use kill-rot, and too use FAR too balance the place, nothing seems too help getting the left turning out of any plane..\u003C/p\u003E\u003Cp\u003EIs this a more common issue, or i\u0027m the only one suffering from this..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T13:58:46Z\u0022 title=\u002206/05/2013 01:58  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Arran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"leptir1","CreatedById":67021,"CreatedDateTime":"2013-06-05T13:22:28Z","Content":"\n\u003Cp\u003ETry to trim the yaw, or roll to the right, until your planes are stabilized, and fly straight.\u003C/p\u003E\n"},{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2013-06-05T13:29:44Z","Content":"\n\u003Cp\u003EThis might be the root cause:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/290\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/290\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2013-06-05T13:58:26Z","Content":"\n\u003Cp\u003EI just noticed the trim of KSP, didnt knew it was in the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E, and yeah it solves the problem too that i dont have too pull right anymore, so the planes are now flyable \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E thats the good part..\u003C/p\u003E\u003Cp\u003EStill it means i have too trim my planes alot too the right, to keep them straight, and as result left turns are much more nimble as right turns nows since my trim is 2/3 trimmed too the right, so i have hardly any right turn movement on Tail and aerelons left.\u003C/p\u003E\u003Cp\u003EBut i think Thorfinn has a point wich seems to be my problem, i notice the same effect on some larger powerfull rockets, but thats easy too cancel with Kill-Rot and turning Gimbals off.\u003C/p\u003E\u003Cp\u003EAt least the problem is known, and i know now how too work around the issue, so for me this problem is answered.\u003C/p\u003E\u003Cp\u003EAll we need too do is wait for the symetry to be fixed on wings\u003C/p\u003E\n"},{"CreatedByName":"Cranium","CreatedById":69153,"CreatedDateTime":"2013-06-05T14:16:27Z","Content":"\n\u003Cp\u003EI\u0027ve found this issue before as well. It turned out that the few times it happens, one or new of my engines is not firing, or once I\u0027m in the air, my intakes didn\u0027t open evenly. I\u0027ve also seen that when returning to the hangar, I am no longer in symmetry mode, and any part I tweak is no longer mirrored.\u003C/p\u003E\n"}]}