{"TopicId":31547,"ForumId":32,"TopicTitle":"long term missions \u002B mods = pointless?","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-05T20:58:39Z","PageNum":1,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-05T20:58:39Z","Content":"\n\u003Cp\u003ESo I\u0027m building a nice infastructure in the solar system. Some ships using mods some not, but what\u0027s the point? .20 just came out. Mods are just now getting updated. So when .21 comes out soon.. it all breaks. Even stock parts are doomed. All my landers end up a mile below the surface. Everythings lost... So what now? Start over? Id rather not... This is the only thing bumbing me out about this game. All my work goes to **** every update. So.. all my future plans.. screw em or what?\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-06-05T21:00:59Z","Content":"\n\u003Cp\u003EWhat you do is simple: don\u0027t update. Wait until the mods you use have updated to the new system before making the transition. I\u0027m still running 19.1 on my own machine, because none of the 20 improvements matter to me as much as working mods do.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-06-05T21:01:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003ESo I\u0027m building a nice infastructure in the solar system. Some ships using mods some not, but what\u0027s the point? .20 just came out. Mods are just now getting updated. So when .21 comes out soon.. it all breaks. Even stock parts are doomed. All my landers end up a mile below the surface. Everythings lost... So what now? Start over? Id rather not... This is the only thing bumbing me out about this game. All my work goes to **** every update. So.. all my future plans.. screw em or what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI expect that most mods won\u0027t have issues with the next couple of patches. The new file structure is there to help that sort of thing.\u003C/p\u003E\n"},{"CreatedByName":"Camelotking524","CreatedById":58776,"CreatedDateTime":"2013-06-05T21:03:13Z","Content":"\n\u003Cp\u003EConsidering I\u0027ve been here since 0.17, I feel your pain bro. Just every update, retire the old designs and start anew. Every update my designs get more effective and more streamlined.\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-06-05T21:05:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BubbaWilkins\u0022 data-cite=\u0022BubbaWilkins\u0022\u003E\u003Cdiv\u003EThe new file structure is there to help that sort of thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends. When they add a new aerodynamics model, parts might have to have some new piece of information that isn\u0027t there currently; regardless of file structure, that\u0027ll break things unless they keep the current system as some sort of default backup system. The same goes for the fuel tanks once we get tunable sizes (necessary for the new resource system). It\u0027s possible that these sorts of things will break many (if not most) mods once they\u0027re implemented.\u003C/p\u003E\n"},{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-05T21:06:43Z","Content":"\n\u003Cp\u003EDon\u0027t lose hope! Remember that the game is still in development phase, and fast development is a good thing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-05T21:09:08Z","Content":"\n\u003Cp\u003EYou saying it like SQUAD changed the folder structure at every single release, including the hotfix ones. Also, some big mods worked like normal in their 0.19 versions even when 0.20 was released, only requiring a few tweaks to work properly. Then the mod maker would make a fully compatible version later. So, it\u0027s not that every new version of KSP makes all mods unusable.\u003C/p\u003E\u003Cp\u003EWith 0.20, at least one mod was rendered redundant (Haystack), so I believe some functionality mods suffer the risk of getting obsolete.\u003C/p\u003E\n"},{"CreatedByName":"Aeshi","CreatedById":33076,"CreatedDateTime":"2013-06-05T21:09:44Z","Content":"\n\u003Cp\u003EYou think you have it bad? Us Mac players have to re-download (and then re-install) \u003Cem\u003Ethe entire frickin\u0027 game\u003C/em\u003E EVERY time we want to update! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-06-05T21:11:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EAll my landers end up a mile below the surface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey fixed that, all my stuff that was below the surface is fine now. I left it all in the hopes that they\u0027d sort it out, which they did.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Everythings lost... So what now? Start over? Id rather not... This is the only thing bumbing me out about this game. All my work goes to **** every update. So.. all my future plans.. screw em or what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be honest you\u0027re playing a game in development, you\u0027re supposed to be a tester not player. If you\u0027ve paid for the license you\u0027re free to take a break until everything\u0027s sorted and there\u0027s no risk of setbacks/rollbacks. But even now I haven\u0027t lost anything since I started back in 0.18. \u003C/p\u003E\u003Cp\u003EEven in \u0027live\u0027 or \u0027gold\u0027 games you have to often update mods/addons, if you don\u0027t want to do that then just use stock stuff.\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of anything? Why even play computer games? Why breathe and go about your daily business? Sounds more like you\u0027re having a blue day than anything wrong with the game.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-05T21:20:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnno\u0022 data-cite=\u0022Johnno\u0022\u003E\u003Cdiv\u003EThey fixed that, all my stuff that was below the surface is fine now. I left it all in the hopes that they\u0027d sort it out, which they did.\u003Cp\u003ETo be honest you\u0027re playing a game in development, you\u0027re supposed to be a tester not player. If you\u0027ve paid for the license you\u0027re free to take a break until everything\u0027s sorted and there\u0027s no risk of setbacks/rollbacks. But even now I haven\u0027t lost anything since I started back in 0.18. \u003C/p\u003E\u003Cp\u003EEven in \u0027live\u0027 or \u0027gold\u0027 games you have to often update mods/addons, if you don\u0027t want to do that then just use stock stuff.\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of anything? Why even play computer games? Why breathe and go about your daily business? Sounds more like you\u0027re having a blue day than anything wrong with the game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elol na just bumbed that any plans I have for the game cannot be long term. But you guys are right. Development is what you want to see. I guess I can always disable auto update in steam.\u003C/p\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2013-06-05T22:34:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camelotking524\u0022 data-cite=\u0022Camelotking524\u0022\u003E\u003Cdiv\u003EConsidering I\u0027ve been here since 0.17, I feel your pain bro. Just every update, retire the old designs and start anew. Every update my designs get more effective and more streamlined.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei second this. I was really bummed when I lost my space station, but it prompted me to come up with a redesign for the same purpose and I like the new one better. its sort of a grieving process. once you get through the anger and denial you can start to launch stuff again and move on.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2013-06-05T22:49:02Z","Content":"\n\u003Cp\u003EI don\u0027t consider anything I do before 1.0 permanent. Plus I kind of enjoy starting over every new patch, but I\u0027m kinda funny like that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I don\u0027t think I ever loaded a save in a strategy game, I just start over - the beginning is the fun part anyway!\u003C/p\u003E\n"},{"CreatedByName":"lobsterbark","CreatedById":57253,"CreatedDateTime":"2013-06-05T23:07:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aeshi\u0022 data-cite=\u0022Aeshi\u0022\u003E\u003Cdiv\u003EYou think you have it bad? Us Mac players have to re-download (and then re-install) \u003Cem\u003Ethe entire frickin\u0027 game\u003C/em\u003E EVERY time we want to update! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have to do that on the pc as well.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-06-05T23:21:18Z","Content":"\n\u003Cp\u003EI chose to restart my save due to one new feature - Clamp-o-tron Sr. Great for space stations.\u003C/p\u003E\u003Cp\u003EOtherwise, I would have just copied my saves over. Yes the terrain was messed up to start with, but they fixed that. I was also impacted by that since I had already put a base on the Mun before 0.20.1 - I fixed it by editing the save file to give them a higher altitude.\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2013-06-05T23:40:34Z","Content":"\n\u003Cp\u003EIt\u0027s something you just sort of have to make peace with. Even if you wait for mods to update, every once in awhile the game loses forward compatibility (that is, the save files can\u0027t be read by the new version), such as when they overhauled the parts system.\u003C/p\u003E\u003Cp\u003EThe game is still way in development, and Squad is gracious enough to try and space out compatability crushing updates when they can. But part of the development cycle is that you have ideas, but they are not wholly representative of the end product, especially when you\u0027re working on this scale. You find that something doesn\u0027t work the way it did in your head, or you get a new idea. There are also parts of the game created quickly as placeholders to make it relatively playable under the foundations are complete, such as the aerodynamic system we currently have. It\u0027s crude and unrealistic, but it\u0027s good enough for now, and it relies on things like the way parts are described, so that needs to be finalized as much as possible before significant effort is made to fixing anything that relies on it.\u003C/p\u003E\u003Cp\u003EThis highlights some of the advantages and disadvantages of doing a live alpha like this. On the upside, the feedback is invaluable to a developer at this stage for making a game that will succeed, and better to find out what changes should be made during development than in Beta or upon release, when making large changes is difficult and expensive, often to the point of \u0027we\u0027ll try that next game\u0027. Also, they get funding as they progress, so they require a lot less investment to get the game to the release stage. On the other hand, it adds a lot of time to the development cycle. Squad will have probably added at least 6 months or more to the games development cycle before we clear Alpha, mostly on bug fixing and issues like the patcher.\u003C/p\u003E\u003Cp\u003EAt the end of the day, I find it helps to look at it like this. Treat alpha states as kickstarter. You are giving them money now to help provide funding for a game that does not yet exist. You are helping to allow that game exist, and contributing for the promise that you will get a copy for your support, often cheaper than at release price. As a bonus, the developer has been gracious enough to allow access to the development builds of the game for their backers so that they can get feedback.\u003C/p\u003E\u003Cp\u003EMy point is, these versions aren\u0027t what you are paying for. That product doesn\u0027t exist yet. That you have access to these versions is a favor, and Squad does a better job of making them not a royal pain in the butt than most. This game, as it is right now, is a favor for giving them money now. Consider it the interest on your support if you like. I just find that, in that light, the issues that come up with alpha state releases are a lot easier to take in stride than if you approach it as a game that you paid for, because that would mean paying for what is essentially a broken game that is taking months to patch. All about your state of mind really \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-06-05T23:44:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lobsterbark\u0022 data-cite=\u0022lobsterbark\u0022\u003E\u003Cdiv\u003EYou have to do that on the pc as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. Until the new patcher is out (I think it\u0027s almost ready, they just need to finish bugfixing/testing? o.O) then you will have to redownload every time. It\u0027s better than the old patcher, if people remember, which took several hours to complete a download that should have taken 15 minutes at most (for Mac users at least).\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-06-06T00:55:12Z","Content":"\n\u003Cp\u003EI held off updating for a while since some mods were not yet updated (and still aren\u0027t). And I had some ships turning up underground (a couple rovers so far...haven\u0027t checked everything yet)...so I moved them to safer locations in 0.19 and tried updating the save again. For a couple things that have parts that haven\u0027t been updated (damned robotics hinges) I made replacement craft and edited them into the save in place of the others. My biggest problem was all the Dishy JEB 9000 units that I have attached to ships spread all over the solar system...but I used the new Dishy Bill 9000 cfg file in place of the old JEB 9000 cfg file, with edits, and all of the old units now link to MechJeb 2.\u003C/p\u003E\u003Cp\u003ESo, yes... A bother to maintain big projects, but doable.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-06T01:13:07Z","Content":"\n\u003Cp\u003EI generally just extract the new version ontop of the old one and let it overwrite and that almost always works perfectly\u003C/p\u003E\u003Cp\u003EThe only time I\u0027ve really restarted a game was when I got bored and wanted to start fresh\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-06-06T01:22:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BubbaWilkins\u0022 data-cite=\u0022BubbaWilkins\u0022\u003E\u003Cdiv\u003EI expect that most mods won\u0027t have issues with the next couple of patches. The new file structure is there to help that sort of thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty much this, mods worked well from 18 to 19, one option might be to put mod parts on dockable struts. this also let you upgrade mechjeb to 2 and add new functions in orbit.\u003C/p\u003E\u003Cp\u003EOn large ships I always have an docking port for this. \u003C/p\u003E\u003Cp\u003EHowever changes like adding reentry damage will break existing games, this will break them independent on mods if you are incoming to Jool and has to aerobreak to get into orbit.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-06T01:31:22Z","Content":"\n\u003Cp\u003EI\u0027m actually GLAD SQUAD sorted out the folders... it makes keeping track of what you have installed so much easier now. So when you update to the next version you know what is going on, what files you have installed and what you need to update.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-06T01:34:10Z","Content":"\n\u003Cp\u003EHave you seen kids playing in a \u003Cem\u003Ereal\u003C/em\u003E sandbox in a playground? I\u0027ve seen kids playing with the usual construction type toys, or shovels and rakes and buckets. But I\u0027ve also see some kids actually playing out a story or a mini-drama with their action figures, complete with sound effects and lighting. KSP is that sandbox. Now if they change the sand, to the point that your action figures \u0022sink\u0022 into the sand, and say the sand is now wet that it might actually break battery-operated toys placed in it, well, that\u0027s how a sandbox is--you just have to find a way to adapt to the changes the owners make, because the owners announced that they can change it anytime they want to.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-06T01:38:01Z\u0022 title=\u002206/06/2013 01:38  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 6, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-06T02:17:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EHave you seen kids playing in a \u003Cem\u003Ereal\u003C/em\u003E sandbox in a playground? I\u0027ve seen kids playing with the usual construction type toys, or shovels and rakes and buckets. But I\u0027ve also see some kids actually playing out a story or a mini-drama with their action figures, complete with sound effects and lighting. KSP is that sandbox. Now if they change the sand, to the point that your action figures \u0022sink\u0022 into the sand, and say the sand is now wet that it might actually break battery-operated toys placed in it, well, that\u0027s how a sandbox is--you just have to find a way to adapt to the changes the owners make, because the owners announced that they can change it anytime they want to.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edamn solar flares frying all my spaceships, I knew I shoulda used vacuum tubes on everything\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-06T02:28:01Z","Content":"\n\u003Cp\u003EEverything I\u0027m doing now is in preparation for version 1.0. Nothing I build is permanent. KSP is, for me, at this point like a fantastic Lego set. One that gets better and better. Why would I want to keep all that old crap hanging about when I can build better, newer, and bigger things? Once the game goes gold, then I\u0027ll consider more long-duration structures.\u003C/p\u003E\n"},{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-06-06T03:15:18Z","Content":"\n\u003Cp\u003ESo quit depending on mods. The stock game has enough stuff in it to make it fun. In fact, most of the fun is in the challenge to overcome the problems without it being handed to you.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-06-06T03:18:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bothersome\u0022 data-cite=\u0022Bothersome\u0022\u003E\u003Cdiv\u003ESo quit depending on mods. The stock game has enough stuff in it to make it fun. In fact, most of the fun is in the challenge to overcome the problems without it being handed to you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry and handle seven interplanetary transfers all wanting attention at the same time without Kerbal Alarm Clock? I\u0027d go nuts.\u003C/p\u003E\n"}]}