{"TopicId":31579,"ForumId":32,"TopicTitle":"Looking for a function describing optimal ascension speed","CreatedByName":"Time Sheep","CreatedById":69496,"CreatedDateTime":"2013-06-05T22:51:06Z","PageNum":1,"Articles":[{"CreatedByName":"Time Sheep","CreatedById":69496,"CreatedDateTime":"2013-06-05T22:51:06Z","Content":"\n\u003Cp\u003EOkay, I\u0027ve seen several interesting techniques to ascending optimally, but they all seem rather primitive.\u003C/p\u003E\u003Cp\u003EThese techniques are mostly something like staying at 200 m/s until you reach a certain altitude and then max the thrust, or just going full speed all the way. So I set out to find a mathematical expression for this. I\u0027m pretty good with algebra and calculus, but still, I haven\u0027t managed to come up with such a function myself.\u003C/p\u003E\u003Cp\u003ETaking drag, weight, thrust and air pressure into consideration, would it be possible to find the optimal travelling speed? If so, how?\u003C/p\u003E\u003Cp\u003EI saw someone had once put up a table with optimal speeds in intervals, but he didn\u0027t explain how he figured it out and I cannot seem to find this by searching on the forums nor on the wiki page.\u003C/p\u003E\n"},{"CreatedByName":"Luna Lovecraft","CreatedById":63903,"CreatedDateTime":"2013-06-05T23:51:53Z","Content":"\n\u003Cp\u003EIt\u0027s usually just travel at terminal velocity.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-06-06T00:08:55Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/6664-Mini-challenge-max-altitude-with-this-supplied-spacecraft?p=100912\u0026amp;viewfull=1#post100912\u0022 rel=\u0022external nofollow\u0022\u003EI believe that this is the post/thread in question\u003C/a\u003E\n"},{"CreatedByName":"Time Sheep","CreatedById":69496,"CreatedDateTime":"2013-06-06T00:11:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/6664-Mini-challenge-max-altitude-with-this-supplied-spacecraft?p=100912\u0026amp;viewfull=1#post100912\u0022 rel=\u0022external nofollow\u0022\u003EI believe that this is the post/thread in question\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly, however at this second glance I see his formula, which is pretty simple, actually.\u003C/p\u003E\u003Cp\u003ETWR= 2 \u002B v\u003Csub\u003ET\u003C/sub\u003E2/(2H)\u003C/p\u003E\u003Cp\u003EI\u0027m going to play around with that for a bit.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-06T00:25:23Z","Content":"\n\u003Cp\u003EI think it goes like this:\u003C/p\u003E\u003Cp\u003E-Launch\u003C/p\u003E\u003Cp\u003E-If it goes over 140 m/s you throttle down.\u003C/p\u003E\u003Cp\u003E-When you reach 5 Km, turn 22,5 degrees.\u003C/p\u003E\u003Cp\u003E-After you reach 10 Km, turn the remaning 22,5 degrees then throttle up to the maximum your engine can.\u003C/p\u003E\u003Cp\u003E-After you leave orbit, aim towards the prograde vector.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-06-06T00:39:19Z","Content":"\n\u003Cp\u003EAs much as possible, stay within 10Ã‚Â° of the prograde marker. Even during ascent. It\u0027s not always possible, but it helps...\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-06-06T01:12:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luna Lovecraft\u0022 data-cite=\u0022Luna Lovecraft\u0022\u003E\u003Cdiv\u003EIt\u0027s usually just travel at terminal velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrect. Any faster than terminal velocity and you\u0027ll be wasting too much energy fighting drag, any lower and you\u0027ll be wasting too much fighting gravity.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t like using mods, just go to the wiki and look at the Kerbin page. It\u0027ll have a table showing terminal velocity as a function of altitude; it\u0027s 110m/s at 1000m, 140m/s at 3000m, 170m/s at 6000m, and so on. The critical point comes at about 15km; below there, you\u0027ll often need to throttle down to keep your speed at terminal velocity, but above that height the atmosphere thins out enough that terminal velocity starts rising much more quickly than you can possibly accelerate in a rocket. In real life, the critical point is the \u0022max Q\u0022 point, where stresses are maximized and liquid fuel rockets throttle down, but once you\u0027re past that point you can (and should) go max throttle.\u003C/p\u003E\u003Cp\u003EIf you DO like using mods, the Flight Engineer mod (and MechJeb, of course) have readouts that can dynamically tell you the terminal velocity at your current height. This makes it much, much easier to know whether you need to tweak the throttle.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-06-06T01:23:02Z","Content":"\n\u003Cp\u003EThe ascent profile for my Sky-ORC is usually to take off at 60 degrees from the runway until 10km, at which point I drop to 40 degrees until 15km, then I drop to 20 until 20km, after which point I drop to 10, and continue accelerating until my intake air gets to 0.15, then I activate the rocket engines, and wait until my intake air drops to 0.01... deactivate one set of engines to bring intake air back up to 0.15 until it gets down to 0.01 again, deactivate another pair, and so on until all engines are off and all I have are the rockets. By that point my apoapsis is around 150km, so I throttle back until the deceleration from the atmosphere keeps my apoapsis constant. Once I\u0027m at 70km, it\u0027s straight rocket flight.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-06-06T01:58:15Z","Content":"\n\u003Cp\u003EIf you\u0027re travelling vertically, this is known as the Goddard problem, and the solution is to ascend at terminal velocity. It gets more complicated once you start turning however, and there\u0027s really no closed-form solution. For a given rocket design you can determine the optimal ascent profile (in terms of trajectory and thrust level) using numerical optimization, but it\u0027s a bit of work to set that up.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-06-06T02:31:57Z","Content":"\n\u003Cp\u003EWhat I do is try to keep my acceleration meter slightly above the 1g mark, until I reach 10 km. This is usually sufficient to keep me travelling at ~terminal velocity. If I ever go above 200 m/s, I throttle down and try not to gain any more speed. When I reach 10 km, I will pitch over, the amount is dependant on how large of a TWR my rocket has. If it has a large TWR, then I pitch over to 45 degrees and throttle up. If it has a smaller TWR, I will either keep going straight up or turn over slightly.\u003C/p\u003E\u003Cp\u003EAfter the pitching over, I will switch to map view and check to make sure my time to apoapsis is increasing. If it is, great! I\u0027ll continue up, following the prograde marker as necessary. If it is going down, then I have to pitch the craft back up closer to 90 degrees again. \u003C/p\u003E\u003Cp\u003EI don\u0027t generally worry about terminal velocity (I could likely save a few m/s of delta-v if I did, but I don\u0027t think it\u0027s really worth the effort), and just try to keep speed below 200 m/s before 10 km.\u003C/p\u003E\n"}]}