{"TopicId":31754,"ForumId":24,"TopicTitle":"Jod!","CreatedByName":"Jod","CreatedById":68384,"CreatedDateTime":"2013-06-06T20:59:19Z","PageNum":1,"Articles":[{"CreatedByName":"Jod","CreatedById":68384,"CreatedDateTime":"2013-06-06T20:59:19Z","Content":"\n\u003Cp\u003EGood day, I am Jod. I am currently obtaining a masters degree in aviation engineering and instead of preparing for exams I\u0027ve been playing KSP for the past couple of weeks.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E I like all sorts of winged contraptions, engine noise, and shiny things.\u003C/p\u003E\u003Cp\u003ECurrently I\u0027m going for a 0 stage aerospace game(everything is built in the aerospace hangar, no decouplers allowed), with SSTOs, space station modules, clampotrons etc. But there are several problems, mostly with Eve, which I hope I will solve eventually. On the upside, I\u0027ve already perfected my first SSTO to the point where 40% of fuel is left after reaching low Kerbin orbit.\u003C/p\u003E\n"},{"CreatedByName":"Sᴄɪɴᴛɪʟʟᴀᴛᴏʀ","CreatedById":69027,"CreatedDateTime":"2013-06-07T00:05:19Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003ETut-tut, you should be studying \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWelcome to the forums!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-07T00:53:10Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHope you\u0027ll keep us posted on how that space program goes; it sounds like quite an interesting idea. Maybe you could take a few screenshots, then post a thread in the Mission Reports section where you can post progress reports as you play.\u003C/p\u003E\u003Cp\u003EAlso, feel free to take a look at the Drawing Board (link in my sig). I\u0027m going to assume that your background means you\u0027re thoroughly familiar with most of the basic concepts, but many of the player aids there are oriented towards helping players apply many of the more complex operations and calculations specifically to the game environment, as well as providing key maps for the different controls (as the game itself is rather slim on the documentation).\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\u003Cp\u003EP.S.:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i685.photobucket.com/albums/vv213/Specialist290/4274282_460s_zps7a2de5e6.jpg\u0022 alt=\u00224274282_460s_zps7a2de5e6.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jod","CreatedById":68384,"CreatedDateTime":"2013-06-07T06:04:20Z","Content":"\n\u003Cp\u003EThanks, I\u0027ve already glanced through the Drawing Board. The docking tutorial was helpful when I was assembling my space station.\u003C/p\u003E\u003Cp\u003EI will look into the Mission Report section. I\u0027ve already posted one of my missions in an unrelated SSTO topic, will probably move it there.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-06-07T23:21:27Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}