{"TopicId":31845,"ForumId":32,"TopicTitle":"Kerbal Backgrounds","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-06-07T12:46:25Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-06-07T12:46:25Z","Content":"\n\u003Cp\u003EI like to think that Kerbol system contains an super dense element called Element-139 Superheavium (Formed from neutron stars), and so, the planets can be much smaller with a core of the element, and still retain gravity like earth. \u003C/p\u003E\u003Cp\u003EThe Kerbol System is the remains of a neutron star that collapsed and evaporated just minutes after the intial supernova. That is how they have Element-139 and still have planets and such. Since when it collapsed, it did another \u0022neutron nova\u0022, the element was scattered throughout the system, and as an result, all the planets have a surplus of it in their cores. Later, a large rogue planet is flung into the Kerbol system. It flings into Duna Orbit, and parts smash into the planet, forming the lowlands. The impacts being Debris into orbit, later forming Ike. Also, Duna, which used to be the third planet, it flung out past Kerbin as a result of the impact and the rogue planets gravity. \u003C/p\u003E\u003Cp\u003EThe object splits in two, and one aerobrake into or it near Kerbin. It later receives an assist and is put into high-orbit, becoming Minmus. The other impacts Eve, wiping the planet of life and causing its toxicity today. Gilly was not formed by this, and was formed fifteen million years later.\u003C/p\u003E\u003Cp\u003EKerbals breathe both oxygen and monoxide. However, when they breathe monoxide, they breathe out oxygen. When they breathe oxygen, they breathe out monoxide, allowing for near-infinite air supply. \u003C/p\u003E\u003Cp\u003EKerbals became interested in space travel after an human interstellar probe crashed onto the surface of Kerbin. Inside, the Kerbals (Who were still in the equivalent of 1920\u0027s technology), found dozens of charts and diagrams of the universe, a map of Earth and its location, and most importantly, a book that would forever change their history. The \u003Cem\u003E Encyclopedia Technologicia\u003C/em\u003E. Inside where technical charts and diagrams of humanities technology leading up to the 22nd Century and descriptions of more wonders in the 26th Century (Humans where already a Type II at 2651), and more....\u003C/p\u003E\u003Cp\u003EAfter the discovery of the crashed starship, the Kerbals began to reverse engineer. First, the reverse engineered the boosters. Then the engines. Then the fuel tanks. Soon, came decoupler and such. Parachutes. Landing legs. A whole plethora of information flooded in, as the Kerbals set themselves to the ultimate goal. Reach Earth (By now, Humans where considered \u0022gods\u0022 in Kerbal society. Like the forerunners and the Coveant.). They wanted to see their creators, the very race that brought them to the space age...\u003C/p\u003E\u003Cp\u003EAnd so, they started leaving Kerbin. Leaving for the Mun. But then, a SRB with nuclear engines exploded over KSC, and many employees died from Radiation. The Goverment quickly banned anyone from living within 100KM from the center. And it resumed......\u003C/p\u003E\u003Cp\u003EWhat\u0027s your thoughts on my background views? And more importantly, what are yours?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-07T15:20:07Z\u0022 title=\u002206/07/2013 03:20  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 7, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stelith61","CreatedById":58699,"CreatedDateTime":"2013-06-07T14:35:35Z","Content":"\n\u003Cp\u003EI just think that KSP is \u0027normal sized\u0027, and just ignore it.\u003C/p\u003E\u003Cp\u003EHere\u0027s my idea.\u003C/p\u003E\u003Cp\u003EA few thousand years from now, Humans leave earth. Only a few organisms can survive on the polluted world. Kerbals then evolve from Salamanders.\u003C/p\u003E\u003Cp\u003EMillions of years later...\u003C/p\u003E\u003Cp\u003ELarge planetoid hurtles toward Kerbin/Earth. As a last too-little-too-late attempt, KSA uses a nuke to deflect it. It fails, and a huge radioactive chunk of rock slams into Kerbin/Earth. However, the rest of the rock, that has a substantial and now radioactive atmosphere, has a glancing blow with Eve/Venus with the remains coalescing into Gilly. The rock spurts up huge amounts of chemicals from under the surface, making the atmosphere thicker and purpler.\u003C/p\u003E\u003Cp\u003EMars, as it eventually will be, was finally struck by its innermost moon, causing a medium sized crater, but small, compared to the Sliding Spring Comet that impacted the red world, the first impact of a comet and a planet and recorded human history, Giving it its huge crater lowlands.\u003C/p\u003E\u003Cp\u003EThe Impact with Kerbin/Earth spewed huge amounts of water into a high orbit (Getting a \u0027gravity assist\u0027 from the moon) where the solids in the water, along with debris from the impact, coalesced into Minmus.\u003C/p\u003E\u003Cp\u003EThe impact was less severe than first anticipated, and only 3/4 of Kerbin\u0027s population was wiped out. They started to rebuild, and now realising space travel\u0027s importance, built up the KSP rather quickly.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-06-07T15:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stelith61\u0022 data-cite=\u0022Stelith61\u0022\u003E\u003Cdiv\u003EI just think that KSP is \u0027normal sized\u0027, and just ignore it.\u003Cp\u003EHere\u0027s my idea.\u003C/p\u003E\u003Cp\u003EA few thousand years from now, Humans leave earth. Only a few organisms can survive on the polluted world. Kerbals then evolve from Salamanders.\u003C/p\u003E\u003Cp\u003EMillions of years later...\u003C/p\u003E\u003Cp\u003ELarge planetoid hurtles toward Kerbin/Earth. As a last too-little-too-late attempt, KSA uses a nuke to deflect it. It fails, and a huge radioactive chunk of rock slams into Kerbin/Earth. However, the rest of the rock, that has a substantial and now radioactive atmosphere, has a glancing blow with Eve/Venus with the remains coalescing into Gilly. The rock spurts up huge amounts of chemicals from under the surface, making the atmosphere thicker and purpler.\u003C/p\u003E\u003Cp\u003EMars, as it eventually will be, was finally struck by its innermost moon, causing a medium sized crater, but small, compared to the Sliding Spring Comet that impacted the red world, the first impact of a comet and a planet and recorded human history, Giving it its huge crater lowlands.\u003C/p\u003E\u003Cp\u003EThe Impact with Kerbin/Earth spewed huge amounts of water into a high orbit (Getting a \u0027gravity assist\u0027 from the moon) where the solids in the water, along with debris from the impact, coalesced into Minmus.\u003C/p\u003E\u003Cp\u003EThe impact was less severe than first anticipated, and only 3/4 of Kerbin\u0027s population was wiped out. They started to rebuild, and now realising space travel\u0027s importance, built up the KSP rather quickly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI took some ideas and incorporated them:\u003C/p\u003E\n"},{"CreatedByName":"NuclearWarfare","CreatedById":42325,"CreatedDateTime":"2013-06-07T15:26:57Z","Content":"\n\u003Cp\u003EHow would we explain how Mars/Duna got such large ice caps?\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-06-07T15:36:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NuclearWarfare\u0022 data-cite=\u0022NuclearWarfare\u0022\u003E\u003Cdiv\u003EHow would we explain how Mars/Duna got such large ice caps?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I already said. The Duna planet used to be the third planet. It had lush oceans at the poles and such. But after being flung out beyond Kerbin, the water froze, creating the icecaps you see today. \u003C/p\u003E\u003Cp\u003EThe Duna Radio Pyramid is the last legacy of an advanced race on Duna as it went extinct from the impacts and freezing. As it froze, their scientists decided to build a pyramid with a message.\u003C/p\u003E\u003Cp\u003EThe four humanoids represent the four leaders of Duna Society at the time. The \u0022High Priest\u0022, the \u0022Builder\u0022, the \u0022Emperor\u0022, and the \u0022Sea Emperor\u0022. They are the four leaders of Duna society. The planet near the chart represents the location of Duna. The orange blot near the bottom represents the color of the planet, and the three planets represent the size of the rogue planet, in Duna terms, meaning the Dunaian Astronomers saw the planet as the size of three Duna\u0027s. The sole pyramid represents the transmitter used to display the message, and the line going up represents the spherical geostationary station that was destroyed by the impact. The Duna\u0027ns used lasers to communicate, and the red color symbolizes the lives lost onboard the station.\u003C/p\u003E\u003Cp\u003EThe chart symbolizes the path if the rogue planet, in order to warn other races of it. However, since the planet changed course, the chart was inaccurate.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-07T15:39:40Z\u0022 title=\u002206/07/2013 03:39  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 7, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AkalaÃƒÂ«l","CreatedById":58210,"CreatedDateTime":"2013-06-07T15:56:47Z","Content":"\n\u003Cp\u003EOn the first day, SQUAD said : \u0022Let be the light\u0022. And therefore, Kerbol was created.\u003C/p\u003E\u003Cp\u003EOn the second day, SQUAD said :\u0022Boring place, na ? Let\u0027s put some things inside\u0022. So appeared, Moho, Eve, Kerbal, Duna, Dres, Jool, and Eeloo. They were spinning around in space, smashing in themselves... Actually doing nothing, just annoy Kerbol.\u003C/p\u003E\u003Cp\u003ESo, on the third day, SQUAD said : \u0022OK, stop this mess, let\u0027s put some kind of a rule Inside this shambles !\u0022. So was created gravity. Each planet recieved an amount in proportion of his size.\u003C/p\u003E\u003Cp\u003EOn the fourth day, SQUAD said again : \u0022In the name of Jeb\u0027, it\u0027s REALLY borring\u0022. So were created athmospheres, and moons, and the easter eggs !\u003C/p\u003E\u003Cp\u003EBut on the fith day, SQUAD realised that if there were nobody to see this wonderfull universe, it wasn\u0027t usefull. So were ceated Jeb, Bill and Bob, wandering around, having big smiles on theirs (stupid) faces.\u003C/p\u003E\u003Cp\u003ESo, on the sixth day, SQUAD was fed up by the smiles. \u0022You smile, hey ? Gona give you reasons to smile !\u0022. And goes the rocket science, and the terrifying expÃƒÂ©riences associated with it. But the smiles weren\u0027t get off the faces.\u003C/p\u003E\u003Cp\u003ESo, on the seventh day, SQUAD said : \u0022Nevermind, I give up...\u0022\u003C/p\u003E\u003Cp\u003ELater after, the 0.20 pops out.\u003C/p\u003E\n"}]}