{"TopicId":32130,"ForumId":16,"TopicTitle":"Why do my space planes always unstable?","CreatedByName":"Narrov","CreatedById":69944,"CreatedDateTime":"2013-06-09T10:27:57Z","PageNum":1,"Articles":[{"CreatedByName":"Narrov","CreatedById":69944,"CreatedDateTime":"2013-06-09T10:27:57Z","Content":"\n\u003Cp\u003EIt doesnt seem to matter how I build my space planes they are always unstable. Most of the time they never get off the ground. I\u0027ve tried everything I can think of. \u003C/p\u003E\u003Cp\u003EI\u0027m pretty much a noob to all this so go easy on me. I\u0027ve put my latest attempt in the link below. Please help.\u003C/p\u003E\u003Cp\u003ENarrov\u003C/p\u003E\u003Cp\u003ELink\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://db.tt/ieefmv6n\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://db.tt/ieefmv6n\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"SoldierHair","CreatedById":62167,"CreatedDateTime":"2013-06-09T11:25:23Z","Content":"\n\u003Cp\u003EGoing to test it now , but my game will take a few good minutes to load (too many mods).\u003C/p\u003E\u003Cp\u003EAt this point i will asume your center of mass is far from your center of lift.They should be in the same spot , the lift can be a little forward though.\u003C/p\u003E\n"},{"CreatedByName":"SoldierHair","CreatedById":62167,"CreatedDateTime":"2013-06-09T11:31:00Z","Content":"\n\u003Cp\u003EIt says it is not compatible with my version.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2013-06-09T11:47:00Z","Content":"\n\u003Cp\u003EI tried your plane, and I think it simply doesn\u0027t have enough lift. By using the rockets from the start, I got it off the ground, and flying OK. But you probably want to fly on the jet for a while, and this plane simply won\u0027t stay up with the jet alone.\u003C/p\u003E\u003Cp\u003EAlso, make sure your main landing gear is straight! It\u0027s currently tilted, which makes the plane very squirrelly on the ground. Straighten it (By using shift and the WASD keys to rotate it until it\u0027s straight up and down) and you\u0027ll have a much easier ground run. But I think this plane needs less weight or more wings!\u003C/p\u003E\u003Cp\u003EOh, and the center of lift should NEVER be in front of the center of mass. Nose heavy planes are a little annyoing to fly, tail heavy planes are impossible to fly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-09T13:37:38Z\u0022 title=\u002206/09/2013 01:37  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 9, 2013\u003C/time\u003E by Rickenbacker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-06-09T11:56:31Z","Content":"\n\u003Cp\u003EThere are some things, that can make your (Space)plane unstable. I will do a short list:\u003C/p\u003E\u003Cp\u003E1: Center of mass is not aligned with center fo Lift.\u003C/p\u003E\u003Cp\u003E2: Sloppy placed center of mass (Actualy, your center of mass is shifting heavily while you drain fuel) Simple fix: \u003Ca href=\u0022http://kerbalspaceprogram.com/tac-fuel-balancer-v1-0/\u0022 rel=\u0022external nofollow\u0022\u003ETAC Fuel Balancer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E3: Not enough control surfaces\u003C/p\u003E\u003Cp\u003E4: To many conrol surfaces\u003C/p\u003E\u003Cp\u003E5: Gearbay is placed to far in the rear, so your Plane can not push its tail down to get some angle of attack. Fix: try to place your rear gearbay a bit closer to your center, also try to place teh front gearbay elevated, so your Plane is already angle a bit.\u003C/p\u003E\u003Cp\u003E6: A lot of thing I have not mentioned, ranging from Engines Placed in front of the COM, to not enough Lift or TWR.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-09T15:53:21Z","Content":"\n\u003Cp\u003EHow do you guys deal with a huge shift in weight? How do you plan for it? I have this great SSTO. It can climb up too 100k with ease and dock with my station. The problem is getting back. I\u0027m using B9 and I have 3 mono tanks up front just after the command pod. So when I go to drain the tanks ( fueling the station with mono ). My center of mass shifts to the rear behind my SoL. All is fine until after reentry. The plane wants to pitch up. So if I give it too much input or it travels to far from prograde... It does backflips and I go into a yawrates. So.. how can I counter this? What can I change to make reentry stable, but at the same time preserve its awesome ascent stability?\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-06-09T16:00:48Z","Content":"\n\u003Cp\u003EThat is the most dificult task you ahve to deal with while building an SSTO Spaceplane. You usualy have two options for this. Either you accout for this while you build your plane or you balance the fuel during flight. The best way of doing the latter is the \u003Ca href=\u0022http://kerbalspaceprogram.com/tac-fuel-balancer-v1-0/\u0022 rel=\u0022external nofollow\u0022\u003ETAC fuel balancer Plugin\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI usualy try to balance it in the SPH, but I USe the fuel balancer, since it will help a lot, especaly if you try to build \u0022realistic\u0022 Spaceplanes, with the fuel in tanks spread along your plane.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-06-09T16:10:19Z","Content":"\n\u003Cp\u003EPlanes are unstable because aerodynamics don\u0027t work yet. There really is no point in bothering with spaceplanes until KSP has a semi-realistic flight model.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-09T16:16:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Klajan\u0022 data-cite=\u0022Klajan\u0022\u003E\u003Cdiv\u003EThat is the most dificult task you ahve to deal with while building an SSTO Spaceplane. You usualy have two options for this. Either you accout for this while you build your plane or you balance the fuel during flight. The best way of doing the latter is the \u003Ca href=\u0022http://kerbalspaceprogram.com/tac-fuel-balancer-v1-0/\u0022 rel=\u0022external nofollow\u0022\u003ETAC fuel balancer Plugin\u003C/a\u003E\u003Cp\u003EI usualy try to balance it in the SPH, but I USe the fuel balancer, since it will help a lot, especaly if you try to build \u0022realistic\u0022 Spaceplanes, with the fuel in tanks spread along your plane.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat plugin would be nice, but the plane only has one tank.\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-06-09T16:29:03Z","Content":"\n\u003Cp\u003EThis is actualy nice to balance then. You should try to balance every tank around your center fo mass. So for example you place one rcs tank infront and one behind the fueltank, which is the center of mass. this way your COM does not shift if you use fuel.\u003C/p\u003E\u003Cp\u003EI have build this little plane.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZZDtlFi.jpg\u0022 alt=\u0022ZZDtlFi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote the little black box. This is where the COM is located. Both full and empty. I also have this Fueltank as the rootpart of the craft, this makes it easier to balance the Plane. But it will be unbalanced if there is only some fuel consumed, so I have to use the fuel balancer Plugin.\u003C/p\u003E\n"},{"CreatedByName":"feudalord","CreatedById":135072,"CreatedDateTime":"2015-01-10T11:08:46Z","Content":"\n\u003Cp\u003EI found the problem to be caused by the pitch of the plane during take off. If your plane is tilted slightly up or down, the aerodynamics in this game will cause your plane to wobble during take off. I am not sure why, but putting your plane perfectly horizontal during take off will make your plane stable on the runway. However, if you prematurely start pitching up the nose of your plane before it has reached sufficient take off speed, it will also wobble. \u003C/p\u003E\u003Cp\u003EIf your plane do not take off on the runway even at high speed, it could be due to the position of your rear landing gear being placed further behind than your elevon, which means even if you pitch up your elevon, the downward force will not provide a moment to pitch up the nose of your plane about the pivot which is your rear landing gear. I didnt know this until I came cross a tutorial by Scott Manley.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uo1C3lODTJU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-10T13:03:55Z","Content":"\n\u003Cp\u003EThis thread is quite old, and it\u0027s very unlikely to still be relevant. Please check the date of the last post before posting -- if the thread is more than a few months old, it\u0027s better to let it rest quietly unless there\u0027s a pressing need to resurrect it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EClosing this for now...\u003C/p\u003E\n"}]}