{"TopicId":32396,"ForumId":34,"TopicTitle":"[0.22] Extraplanetary Launchpads Legacy Thread","CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-06-11T04:17:27Z","PageNum":24,"Articles":[{"CreatedByName":"slashvalintino","CreatedById":60089,"CreatedDateTime":"2013-07-07T23:11:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Zee\u0022 data-cite=\u0022_Zee\u0022\u003E\u003Cdiv\u003EYou\u0027ve \u003Cstrong\u003Ecompletely\u003C/strong\u003E missed the point here friend.... does anyone read before they post?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eactually i did read your post, and what im suggesting is launch a small ship just big enough to land on the planet with a kas removable port and just move it onto the launch pad, i actually have done this already so i know it works\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-07T23:53:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Farnsworth\u0022 data-cite=\u0022Farnsworth\u0022\u003E\u003Cdiv\u003EYou can use KAS (I attach them to the base the sphere is on), or docking ports should work as well. See the thread for the launchpad for some pics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! Attaching them directly to the base works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E That\u0027s one less rocket to Duna I\u0027ll need to do.\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2013-07-08T02:53:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Zee\u0022 data-cite=\u0022_Zee\u0022\u003E\u003Cdiv\u003EYou\u0027ve \u003Cstrong\u003Ecompletely\u003C/strong\u003E missed the point here friend.... does anyone read before they post?\u003Cp\u003EYou\u0027re right, the serious problem that I\u0027m running into here is a result of KAS, but the only reason I\u0027m even having to deal with it is because EL isn\u0027t functioning in the way I had hoped. I was hoping to find an alternative means to getting the launchpads to recognize available fuel during construction. If fuel lines are the ONLY means, then I will have to find a way to get KAS to stop acting so screwy.\u003C/p\u003E\u003Cp\u003EEdit: Also it\u0027s worth mentioning that its not really a mass or balance issue in the normal way you would think of them happening. These spontaneous disassemblies are occuring before any fuel has even begun to transfer. They start happening as soon as things are docked together.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIdea: Docking ports. One on the launchpad, one on the bottom of your tanker. You\u0027ll unfortunately need to make it a VTOL tanker, rather than a more conventional truck. However,if you park atop the pad such that your docking ports connect, it should do the trick. I just thought of this now, so I haven\u0027t tested it; what I\u0027d done before is \u0022launch\u0022 another launchpad with a bunch of fuel tanks on it, sitting atop a truck, and then I detached it from the truck upon driving off the original launchpad.\u003C/p\u003E\n"},{"CreatedByName":"_Zee","CreatedById":71167,"CreatedDateTime":"2013-07-08T03:45:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022slashvalintino\u0022 data-cite=\u0022slashvalintino\u0022\u003E\u003Cdiv\u003Eactually i did read your post, and what im suggesting is launch a small ship just big enough to land on the planet with a kas removable port and just move it onto the launch pad, i actually have done this already so i know it works\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re still completely missing the point of my post.... But since you seem to be stuck on the KAS Removable Radial Port; Yes, I know what it is. Yes, I know how to use it. No, it has nothing to do with my problem.\u003C/p\u003E\n"},{"CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2013-07-08T05:09:46Z","Content":"\n\u003Cp\u003EHey all, just curious if anyone has had a chance to try many of the various available launchpad/runway parts - and if any of them are more \u0027gentle\u0027 with rovers/wheels/general launch? Or, are they all the same, as it\u0027s probably within the mod itself?\u003C/p\u003E\u003Cp\u003EGoing to give the sphere ones a try Farnsworth, they look great.\u003C/p\u003E\n"},{"CreatedByName":"_Zee","CreatedById":71167,"CreatedDateTime":"2013-07-08T07:11:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EIdea: Docking ports. One on the launchpad, one on the bottom of your tanker. You\u0027ll unfortunately need to make it a VTOL tanker, rather than a more conventional truck. However,if you park atop the pad such that your docking ports connect, it should do the trick. I just thought of this now, so I haven\u0027t tested it; what I\u0027d done before is \u0022launch\u0022 another launchpad with a bunch of fuel tanks on it, sitting atop a truck, and then I detached it from the truck upon driving off the original launchpad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDock the fuel tanks on top of the pad??? How on earth would that work? How would there be room for newly constructed craft? Lol sorry, either your idea makes no sense or I\u0027m gonna need some kind of visual aid. Haha\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-08T12:18:27Z","Content":"\n\u003Cp\u003EUnfortunately I don\u0027t think docking ports would work. Not sure, but in the past when I\u0027ve tried to put various parts clipped into the pad structure near the folding section they exploded when the pad unfolded. Since you can\u0027t see the top surface of the pad when it\u0027s folded I\u0027m pretty sure it would have to be seriously clipped to be able to get a docking port in there in the VAB/SPH.\u003C/p\u003E\n"},{"CreatedByName":"urablahblah","CreatedById":46911,"CreatedDateTime":"2013-07-08T12:26:01Z","Content":"\n\u003Cp\u003EHas anyone been able to create a config for the large kethane drill to be a dedicated ore drill? I\u0027ve tried suggestions further up in the thread but to no avail. I can get it to say it will work in the VAB, but then the vehicle will not launch and it ends up crashing the program. Any help would be greatly appreciated!\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-08T13:18:08Z","Content":"\n\u003Cp\u003EOne problem, I\u0027m unable to make anything who contains the rocket part, ore or metal containers.\u003C/p\u003E\u003Cp\u003ENice to have if you need to replace or upgrade the processing parts.\u003C/p\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-07-08T14:20:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EA query Skykooler. You (and others) have mentioned that at present you can\u0027t build a launchpad equipped craft from a launchpad. Is that going to be remedied in future? I\u0027m curious about whether you\u0027ve decided it\u0027s a design feature (limiting growth and forcing you to use the VAB for SOMETHING! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) or whether you\u0027re redesigning it so such \u0027staging\u0027 of construction will be possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis should work fine in the latest version. You weren\u0027t able to do so in the earlier testing build, because launchpads spawned full of resources, and they would therefore require more resources than the other launchpad could provide.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-08T14:30:03Z","Content":"\n\u003Cp\u003EAh thank you. I hadn\u0027t seen anything anywhere that it had been fixed. I appreciate it.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-08T16:00:02Z","Content":"\n\u003Cp\u003EUm Zee? What everyone\u0027s been talking about, using KAS, I\u0027ve just confirmed that the winches connected via the stock radial plate couplers (forget what they are called) doesn\u0027t allow that section to share fuel with the pad, even when connected to a tank that is part of the stack that the pad (or runway in this case) is connected to. Not sure if connecting to a winch that is stacked will work instead. Have to try that.\u003C/p\u003E\u003Cp\u003EHaven\u0027t tried putting the connectors directly on the bottom of the pad yet to see if that will work.\u003C/p\u003E\n"},{"CreatedByName":"_Zee","CreatedById":71167,"CreatedDateTime":"2013-07-08T16:28:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EUm Zee? What everyone\u0027s been talking about, using KAS, I\u0027ve just confirmed that the winches connected via the stock radial plate couplers (forget what they are called) doesn\u0027t allow that section to share fuel with the pad, even when connected to a tank that is part of the stack that the pad (or runway in this case) is connected to. Not sure if connecting to a winch that is stacked will work instead. Have to try that.\u003Cp\u003EHaven\u0027t tried putting the connectors directly on the bottom of the pad yet to see if that will work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, KhaosCorp has since explained that using KAS in that way will never work unless either EL or KAS are updated to work differently in regards to fuel transfer. The tanks connected to the same stack of the pad would also need to have fuel lines running from them to the pad itself. KAS cannot do anything about this unless KAS gets updated to act exactly like fuel lines do, or EL updates the way it requests fuel during construction.\u003C/p\u003E\n"},{"CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2013-07-08T23:44:38Z","Content":"\n\u003Cp\u003EIf anyone wants to see some explosions, try loading something on a launchpad with the Deadly Re-Entry Mod enabled! (I guess there is a point where it experiences a lot of g\u0027s - which is consistent with wheels popping, ect.)\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-09T20:45:18Z","Content":"\n\u003Cp\u003EI\u0027ve just noticed a bug with the current EL. Once a pad has built more than one item, then you bring the build menu up, sometimes it can be \u0027blank\u0027. IE, you click on a ship to select and nothing comes up in the panel for fuel shifting. I think this is when it\u0027s the same ship I built last time with this pad (not too sure on that point). If I then select a different ship, that ship\u0027s fuel, rocket parts requirements etc comes up. All well and good, but if you then try to reselect the ship that wouldn\u0027t come up before it comes up in the title, but the cost of construction stays with the second ship design you brought up. After hitting \u0027build\u0027 the ship is fully fuelled if that type of fuel was at 100% on the slider, even if the design showing used much less fuel that what was built! I selected a large pad to send to Laythe via my Minmus Pad, and as a secondary build selection picked the stock station core... which only needs rocket parts and electric charge! It fully fuelled the whole ship for free, more than the pad could supply!\u003C/p\u003E\n"},{"CreatedByName":"Azazael","CreatedById":68390,"CreatedDateTime":"2013-07-09T20:58:21Z","Content":"\n\u003Cp\u003EHere I have the launchpad connected to the smelter via KAS\u003C/p\u003E\u003Cp\u003EThe smelter is connected via KAS to a Kethane production facility (double upright HOME admin unit) making LFO \u0026amp; Monofuel \u003C/p\u003E\u003Cp\u003EThe smelter is also connect via KAS to a tall structure containing triple stacked empty Ore, Metal and part tanks\u003C/p\u003E\u003Cp\u003EThe smelter is also connected via KAS to a large LFO tank (HOME Admin unit)\u003C/p\u003E\u003Cp\u003EAll this makes complete ready to launch craft using the Extraplanetary launch pad. \u003C/p\u003E\u003Cp\u003ETook ages to land and then tow this stuff into position on Duna (no hyper edit used!!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud.steampowered.com/ugc/903252997095110378/583FE8F3CC5B55EA8EFBACA009985EEFC7E4E078/\u0022 alt=\u0022583FE8F3CC5B55EA8EFBACA009985EEFC7E4E078\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903252997095105237/8A5151507EA8AE1A4C781050A8A6F70BBA44A9D6/\u0022 alt=\u00228A5151507EA8AE1A4C781050A8A6F70BBA44A9D6\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-09T21:01:25Z\u0022 title=\u002207/09/2013 09:01  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 9, 2013\u003C/time\u003E by Azazael\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2013-07-09T23:20:08Z","Content":"\n\u003Cp\u003ELooks awesome Azazael,\u003C/p\u003E\u003Cp\u003EThat\u0027s pretty much what I\u0027m going for now - given up on the docking ports and trying to make a large connected base (the physics always break me). KAS seems like a better alternative, and if you plan the modules right only requires limited use. I like the foil look on your modules too - I think I\u0027ll have to check out the HOME mod just for that.\u003C/p\u003E\n"},{"CreatedByName":"Eskandare","CreatedById":62742,"CreatedDateTime":"2013-07-09T23:52:30Z","Content":"\n\u003Cp\u003EI don\u0027t know if anyone else has had this bug, but it appears that the VAB/SPH have a node connection issue with the parts where it attaches but doesn\u0027t stay, and the nodes disappear. Also, it crashes the VAB/SPH at times and prevents any of the buttons from working.\u003C/p\u003E\n"},{"CreatedByName":"Andayle","CreatedById":73953,"CreatedDateTime":"2013-07-10T13:15:17Z","Content":"\n\u003Cp\u003EAnyone Have a craft file for getting the smelter onto the Mun, I can get everything else there fine. Just the smelter has been causing me headaches for about the last 2 days lol.\u003C/p\u003E\u003Cp\u003EEDIT: Completely disregard my comment, just after posting that i thought I would give it one last shot and managed to land on the MUN, YEEE HAAAW. Now to start plugging all this stuff together \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-10T14:20:33Z\u0022 title=\u002207/10/2013 02:20  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 10, 2013\u003C/time\u003E by Andayle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-10T15:34:00Z","Content":"\n\u003Cp\u003EThe smelter is a bit of a pain to deploy...trick is LOTS of rcs on the way down. I crashed about 4 of em into Minmus..that\u0027s when I decided to make one =)\u003C/p\u003E\n"},{"CreatedByName":"MaHuJa","CreatedById":58370,"CreatedDateTime":"2013-07-11T04:11:36Z","Content":"\n\u003Cp\u003EBug report: When the rocketpart requirement is 7 digits (including . and two decimal places) or more, the text wraps and you can only see the lower half of each number. I don\u0027t know if it wants 6k or 8k parts. I do recognize it when it wants some 12k parts.\u003C/p\u003E\u003Cp\u003EWhich brings me to my question: How exactly is the rocketparts requirement calculated? \u003C/p\u003E\u003Cp\u003EI\u0027ve built several small utility vehicles without problems (other than getting them off the pad, my \u0022robot\u0022 with canadarms has helped a lot with that) but the parts requirement scales to ridiculous.\u003C/p\u003E\u003Cp\u003EIs it exponential off the ships dry mass or something?\u003C/p\u003E\u003Cp\u003EEdit: Turns out to be SRBs that kill it. Are we paying 1 rocketpart per unit of solid fuel or something?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-11T09:23:07Z\u0022 title=\u002207/11/2013 09:23  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 11, 2013\u003C/time\u003E by MaHuJa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-07-11T13:27:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaHuJa\u0022 data-cite=\u0022MaHuJa\u0022\u003E\u003Cdiv\u003EBug report: When the rocketpart requirement is 7 digits (including . and two decimal places) or more, the text wraps and you can only see the lower half of each number. I don\u0027t know if it wants 6k or 8k parts. I do recognize it when it wants some 12k parts.\u003Cp\u003EWhich brings me to my question: How exactly is the rocketparts requirement calculated? \u003C/p\u003E\u003Cp\u003EI\u0027ve built several small utility vehicles without problems (other than getting them off the pad, my \u0022robot\u0022 with canadarms has helped a lot with that) but the parts requirement scales to ridiculous.\u003C/p\u003E\u003Cp\u003EIs it exponential off the ships dry mass or something?\u003C/p\u003E\u003Cp\u003EEdit: Turns out to be SRBs that kill it. Are we paying 1 rocketpart per unit of solid fuel or something?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI may have done that, because you obviously can\u0027t treat solid fuel like the other resources. I\u0027ll look and see whether I can fix that.\u003C/p\u003E\n"},{"CreatedByName":"Supergamervictor","CreatedById":23473,"CreatedDateTime":"2013-07-11T14:19:11Z","Content":"\n\u003Cp\u003EI tried launching a rocket from orbit but failed because it couldn\u0027t do it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-07-11T14:28:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022skykooler\u0022 data-cite=\u0022skykooler\u0022\u003E\u003Cdiv\u003EI may have done that, because you obviously can\u0027t treat solid fuel like the other resources. I\u0027ll look and see whether I can fix that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, it seems I did do that. I\u0027ve changed it to multiply by SolidFuel\u0027s density by default; that will be in the next version.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022victor tan\u0022 data-cite=\u0022victor tan\u0022\u003E\u003Cdiv\u003EI tried launching a rocket from orbit but failed because it couldn\u0027t do it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is correct. This cannot launch things from orbit. This has been said probably sixty times already.\u003C/p\u003E\n"},{"CreatedByName":"Supergamervictor","CreatedById":23473,"CreatedDateTime":"2013-07-11T15:06:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022skykooler\u0022 data-cite=\u0022skykooler\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat is correct. This cannot launch things from orbit. This has been said probably sixty times already.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wanted to launch a star trek style spaceship from orbit instead from the ground.Wish you ca actually do that\u003C/p\u003E\n"}]}