{"TopicId":32479,"ForumId":36,"TopicTitle":"The L.O.G. Multiplayer Project","CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-06-11T19:57:07Z","PageNum":10,"Articles":[{"CreatedByName":"Wait- Was That Important?","CreatedById":58359,"CreatedDateTime":"2013-10-04T02:40:54Z","Content":"\n\u003Cp\u003EHey, just another question that I\u0027d love to see how you dealt with.\u003C/p\u003E\u003Cp\u003EIf Prima\u0027s ship is on a 500-day intercept trajectory with Jool, and Secunda\u0027s is on an 80 day intercept trajectory with Duna, how will that work out when the server timewarps? Or does it timewarp all the ships to a set time before their arrival? For that matter, do you have hours or minutes before a timewarp finishes?\u003C/p\u003E\n"},{"CreatedByName":"CARROTSAREAWSOME","CreatedById":61645,"CreatedDateTime":"2013-10-04T04:28:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wait, Was That Important?\u0022 data-cite=\u0022Wait, Was That Important?\u0022\u003E\u003Cdiv\u003EHey, just another question that I\u0027d love to see how you dealt with.\u003Cp\u003EIf Prima\u0027s ship is on a 500-day intercept trajectory with Jool, and Secunda\u0027s is on an 80 day intercept trajectory with Duna, how will that work out when the server timewarps? Or does it timewarp all the ships to a set time before their arrival? For that matter, do you have hours or minutes before a timewarp finishes?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that case Secunda is going to pass the intercept by 420 days. Thats why you always should leave your ship to stable orbit.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-10-04T04:28:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022swiftgates24\u0022 data-cite=\u0022swiftgates24\u0022\u003E\u003Cdiv\u003EWait what? Do you mean to tell me that you got the base multiplayer WORKING!?!?!? KSP Weekly nomination if thats true.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, yes. But, there is a bug CARROTSAREAWESOME is working on atm. which causes the server not to work correctly when more than one player is connected with a server. But I am sure he will have fixed it soon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Meatsauce","CreatedById":4499,"CreatedDateTime":"2013-10-04T20:28:13Z","Content":"\n\u003Cp\u003EWell done fellas\u003C/p\u003E\u003Cp\u003EHook us up with a video when you can. Or let me know if you need help making one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-10-04T22:35:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Meatsauce\u0022 data-cite=\u0022Meatsauce\u0022\u003E\u003Cdiv\u003EWell done fellas\u003Cp\u003EHook us up with a video when you can. Or let me know if you need help making one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe are not far enaugh to make a new video, but I will make one as soon as I can! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mrluckypants96","CreatedById":67764,"CreatedDateTime":"2013-10-05T22:24:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarkusA380\u0022 data-cite=\u0022MarkusA380\u0022\u003E\u003Cdiv\u003EWell, yes. But, there is a bug CARROTSAREAWESOME is working on atm. which causes the server not to work correctly when more than one player is connected with a server. But I am sure he will have fixed it soon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, what you\u0027re saying is the multiplayer works, as long as there\u0027s only 1 person playing...\u003C/p\u003E\n"},{"CreatedByName":"Meatsauce","CreatedById":4499,"CreatedDateTime":"2013-10-06T05:47:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mrluckypants96\u0022 data-cite=\u0022mrluckypants96\u0022\u003E\u003Cdiv\u003ESo, what you\u0027re saying is the multiplayer works, as long as there\u0027s only 1 person playing...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s your point?\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-10-06T07:33:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mrluckypants96\u0022 data-cite=\u0022mrluckypants96\u0022\u003E\u003Cdiv\u003ESo, what you\u0027re saying is the multiplayer works, as long as there\u0027s only 1 person playing...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. But we are fixing it atm.\u003C/p\u003E\n"},{"CreatedByName":"DaiVader","CreatedById":59840,"CreatedDateTime":"2013-10-06T12:42:48Z","Content":"\n\u003Cp\u003EBeen following this since it started, really impressed with the progress you\u0027ve made, can\u0027t wait for it working enough to explore laythe with friends. Keep the great work up guys\u003C/p\u003E\n"},{"CreatedByName":"DaRocketCat","CreatedById":32377,"CreatedDateTime":"2013-10-06T14:45:47Z","Content":"\n\u003Cp\u003EGlad to see progress, keep it up.\u003C/p\u003E\n"},{"CreatedByName":"mrluckypants96","CreatedById":67764,"CreatedDateTime":"2013-10-06T15:37:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarkusA380\u0022 data-cite=\u0022MarkusA380\u0022\u003E\u003Cdiv\u003EYes. But we are fixing it atm.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweet, I definitely want to try this out when it\u0027s released.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-10-06T16:05:21Z","Content":"\n\u003Cp\u003Eyou may or may not want to talk to/ read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/47861-Working-Multiplayer-Proof-of-Concept-with-video-proof\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"popeter45","CreatedById":56678,"CreatedDateTime":"2013-10-06T16:11:16Z","Content":"\n\u003Cp\u003Equestion:\u003C/p\u003E\u003Cp\u003Ewhat happens when two players dock each others spacecraft together?\u003C/p\u003E\n"},{"CreatedByName":"swiftgates24","CreatedById":22280,"CreatedDateTime":"2013-10-06T18:37:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003Eyou may or may not want to talk to/ read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/47861-Working-Multiplayer-Proof-of-Concept-with-video-proof\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey already know about it.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-10-09T20:47:58Z","Content":"\n\u003Cp\u003EI was thinking the same thing, what happens on docking? \u003C/p\u003E\u003Cp\u003EI would assume it could be some sort of permission system, the player controlling that module can set who can dock and who can modify the ship perhaps?\u003C/p\u003E\n"},{"CreatedByName":"CaptainBullet","CreatedById":84676,"CreatedDateTime":"2013-10-11T07:14:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI would assume it could be some sort of permission system, the player controlling that module can set who can dock and who can modify the ship perhaps?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would suggest the same. Dockingports will only magnetise if 1) both players allowed each other to dock (could also include some kind of a \u0022friends list\u0022 with \u0022allways allow docking\u0022) and 2) agreed on who is in controll afterwards, so the other one gets into \u0022viewer mode\u0022 or something.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-10-11T09:50:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainBullet\u0022 data-cite=\u0022CaptainBullet\u0022\u003E\u003Cdiv\u003EI would suggest the same. Dockingports will only magnetise if 1) both players allowed each other to dock (could also include some kind of a \u0022friends list\u0022 with \u0022allways allow docking\u0022) and 2) agreed on who is in controll afterwards, so the other one gets into \u0022viewer mode\u0022 or something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy idea was quite the same!\u003C/p\u003E\n"},{"CreatedByName":"CaptainBullet","CreatedById":84676,"CreatedDateTime":"2013-10-11T11:11:30Z","Content":"\n\u003Cp\u003EI still have a fiew questions.\u003C/p\u003E\u003Cp\u003EWhat happens if you want to take controll over a vehicle that is currently playing a log? Will you be able to change the log while its running, or will you switch to the time where the log ends?\u003C/p\u003E\u003Cp\u003EAnd how can I make sure not to miss transfer windows? If the server time runs while I\u0027m in the VAB but does not run in real time, cause at some point it just hops to the point where the next log ends, its not easy to keep track of those windows and rendevous. Flightplanning is very difficoult under those circumstances.\u003C/p\u003E\u003Cp\u003EAlso consider what happens if someone pauses the game. I\u0027d suggest, that you can pause your local universe and once you finished, the log gets fastforwarded to servertime.\u003C/p\u003E\u003Cp\u003EAlso Docking only works in realtime, unless you make sure the other vehicle can\u0027t get it\u0027s log changed until the docking is finished. Else you might dock to a vehicle, that then gets deorbited before you\u0027r log does the actual docking. (damn, messing around with time makes things really complicated.)\u003C/p\u003E\u003Cp\u003EIf I got the the concept right, one has to be very carefull not to leave any ships in transit waititng for maneuvers, cause you have no controll over the actual servertime. Once you left a ship and go back to the VAB, the server might catch up with you. (you can\u0027t just check the clock and think: next maneuver in 10 minutes.. enough time to build another probe). I guess if you know that, its manageble. But you have to keep it in mind. To avoid this problem, people might leave a vehicle on the ground with no log, so the server can\u0027t jump in time, which will annoy everyone else who is waiting for their probes to FINNALY reach Eve (only to crash, because you forgot to open your chutes). That might be a rather social problem, but still worth taking in account.\u003C/p\u003E\u003Cp\u003Esorry, if I repeted something here, I didn\u0027t read all 25 pages :/\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m really exited about this project. If you have a running \u0022work in progress\u0022 version or something playable, I\u0027m more than happy to test it for you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood luck with this.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-10-11T11:17:28Z","Content":"\n\u003Cp\u003EIn response to post #210\u003C/p\u003E\u003Cp\u003EThe problem does sound very similar to grandfather paradox.. which would be a huge problem. However wouldn\u0027t one simple solution be to make other player\u0027s ships/assets non-interactive while they are logged out. Later on in this thread they talk about permissions as well, which would help mitigate this. If you as player B choose to catch up and ram player As ship, that may be a problem. However I\u0027m sure that the server stores player As final coordinates on sign out, so it would simply ignore the vehicles\u0027 history. You could ram other players all day long and the only one losing ships would be you. However you can still allow full interaction by allowing two logged in players to interact with each others\u0027 assets/ships.\u003C/p\u003E\u003Cp\u003EA potential problems? how will these be handled?\u003C/p\u003E\u003Cp\u003EA Troll logs onto the server, proceeds to timewarp at maximum for say 9 hrs real time. Troll logs off. \u003C/p\u003E\u003Cp\u003EPlayer gets disconnected while warping/on planetary transfer. I have an idea for this, allow players to \u0027log their position\u0027 sort of like an F5 in single player. This gets updated if they logout, but if disconnected the server leaves them at their last \u0027log position\u0027.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T11:23:29Z\u0022 title=\u002210/11/2013 11:23  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by gl0ryh0und\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainBullet","CreatedById":84676,"CreatedDateTime":"2013-10-11T12:42:06Z","Content":"\n\u003Cp\u003EIn response to post #210 and #244\u003C/p\u003E\u003Cp\u003EIt basically is the grandfather paradox. And alternate realities are not a solution, cause the number of those wil rapidly explode and ultimately lead to everyone playing in their own version of said universe, which we do right now. \u003C/p\u003E\u003Cp\u003EBut other than for timetravelers, the natuere of virtual reality provides a much simpler solution: You just have to prevent physiks from loading for vehicles that are only \u0022log replays\u0022. That way any interaction is impossible by default. If a player wants other players to be able to dock to his ship/station/whatever (besides the permission thing we coverd earlier) they just need to make sure, the vehicle is flying live in servertime and does not have a log to be replayd. \u003C/p\u003E\u003Cp\u003EWhich brings us back to an earlier mentioned Problem. Any vehicle flying around in realtime (and unless everyone on the server is actively flying all their vehicles with timewarp on a regular base in order to create logs to be replayd, there will be a lot of realtime flying vehicles -\u0026gt; like Debris or abandoned projects) will prevent the Server from timewarping, making it pretty much a realtime server. \u003C/p\u003E\u003Cp\u003EYou\u0027d need the power to timewarp the server, even when someones log has ended and the vehicle is now flying live in servertime. Maybe one could implement a setting on vehicles \u0022allow serve to timewarp\u0022 which you have to uncheck if you want your vehicle to be bound to earth time. Such vehicles could still block timewarp on servers, but that would bring it down to a server-moderating issue (PM to troll: \u0022Check that damn box, if you log out! else you\u0027ll get baned and I\u0027ll delet your -snip- station. It looks ugly anyway\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E )\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T13:50:57Z\u0022 title=\u002210/11/2013 01:50  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003Cbr\u003EPlease don\u0026#039;t post profanity\n\u003C/span\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-10-11T13:43:13Z","Content":"\n\u003Cp\u003EThere isn\u0027t a problem if you can only interact with open ends of the timeline mesh representing vessels on the server. So if you meet any vessel at a time that isn\u0027t its latest state (or later; or you haven\u0027t a permission to interact with) you will have some kind of \u0022ghost\u0022, as you might know from racing games. Also there isn\u0027t really an ingame servertime, since every player can be in its own time. The server only stores histories and may also do some verifications on updates submitted by the client, as well as some other \u0022paperwork\u0022 (progression systems, managing launch windows [some kind of servertime would be useful here], chat, etc)\u003C/p\u003E\u003Cp\u003EThe server does not have to do any calculations if you are timewarping. Once you are done it might verify that haven\u0027t cheated in-between, but doing that for drifting though space is not any harder than doing it for a e.g. burn.\u003C/p\u003E\u003Cp\u003EActually, there is one problem with such an approach. Space stations. So they might need a special solution to allow players to dock even though another player has already dock in the far future (aka will dock some when, from your current ingame pov).\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-10-11T14:10:00Z","Content":"\n\u003Cp\u003EI dont think permission systems and all that should be of concern right now.\u003C/p\u003E\u003Cp\u003ELet\u0027s just first be able to play multiplayer with a few people together, while assuming all participants can be trusted.\u003C/p\u003E\u003Cp\u003EGigantic public multiplayer servers and all required facilities like protection against trolls and griefers are a whole other thing that may follow, but not important right now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T14:37:37Z\u0022 title=\u002210/11/2013 02:37  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by Psycix\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainBullet","CreatedById":84676,"CreatedDateTime":"2013-10-11T14:41:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psycix\u0022 data-cite=\u0022Psycix\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EGigantic public multiplayer servers and all required facilities are a whole other thing that may follow, but not important right now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats right. \u003C/p\u003E\u003Cp\u003EBut while the problem I pointed out might be a minor issue on a server with 2 players, its something you might want to get right in the first place. If you have pinciple problem your system will never be scaleable. \u003C/p\u003E\u003Cp\u003EFurthermore: I have much stuff flying around on a singleplayer universe which would disable a server\u0027s timewarp capability, so its not only a problem that occures on gigantic public mp servers. \u003C/p\u003E\u003Cp\u003ESorry if I\u0027m posting novels about issues of the day after tomorrow, but once I started pondering over something I\u0027m exited about, I\u0027m hard to stop \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-10-11T14:58:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainBullet\u0022 data-cite=\u0022CaptainBullet\u0022\u003E\u003Cdiv\u003E I have much stuff flying around on a singleplayer universe which would disable a server\u0027s timewarp capability\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe server doesn\u0027t really do any timewarp processing but only stores and distributes data, so its not a problem. Much stuff might make it unplayable on the client (just like those kessler bomb guy^^), but\u003C/p\u003E\u003Cp\u003E- thats will require a gigantic lot of stuff\u003C/p\u003E\u003Cp\u003E- a server administrator could do some cleanup or ban people who do it on purpose\u003C/p\u003E\u003Cp\u003E- its easy to add an \u0022you can only have x objects or have to delete sth\u0022 mechanic\u003C/p\u003E\u003Cp\u003E- you could only transmit a selection of parts to clients, so old stuff / derbies might simply not show up on the clients\u003C/p\u003E\u003Cp\u003E- a server will most likely get some automatic cleanup mechanisms as well (orbital decay would be awesome)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T15:27:24Z\u0022 title=\u002210/11/2013 03:27  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by Faark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainBullet","CreatedById":84676,"CreatedDateTime":"2013-10-11T15:26:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003EThe server doesn\u0027t really do any timewarp processing but only stores and distributes data, so its not a problem. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not concerned about processing power of the server. Stuff thats flying around is keeping the server from timewarping because of the rules of that server. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOf course, because noone wants to wait for 400 days, the server time will be updated to the highest vessel-time when noone is controlling a vessel.\u003C/div\u003E\u003C/blockquote\u003E (see first post of this thread)\u003Cp\u003EIf I get that right, the server can only timewarp when every vessel has a prewritten log to skip through. So any vessel that haven\u0027t been used for a while and has no log keeps the server in realtime.\u003C/p\u003E\u003Cp\u003ETell me if I got that wrong, because if so I really don\u0027t understand how this is supposed to work.\u003C/p\u003E\n"}]}