{"TopicId":33045,"ForumId":18,"TopicTitle":"Do you play Flight simulators?","CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-15T01:52:14Z","PageNum":1,"Articles":[{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-15T01:52:14Z","Content":"\n\u003Cp\u003EI\u0027m wondering- do people here at KSP forums play Flight simulators?\u003C/p\u003E\u003Cp\u003EI personally love flying/aviation, hope to be a real pilot sometime.\u003C/p\u003E\u003Cp\u003EAnyway, I play FSX a lot. Not as much as I did a year ago, there is only so much you can do before it gets a little boring... but you can fix that with addons \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ECurrently, I am downloading X-Plane 10 demo. I\u0027ve always seen a war between the two, and I\u0027d like to see if X-Plane is worth it.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-15T02:19:02Z","Content":"\n\u003Cp\u003EI have been using Microsoft Flight Simulator since version 2.02--yep, that\u0027s 2.02, and NOT FS2002. I started flight simming when I was 15 years old, back in 1986. Since then I have owned every version of FS since 2.02. Sometime in May of 2002, a private pilot friend of mine allowed me a few minutes to be PF on a short inter-island hop here in the Philippines--his confidence and trust in my flying abilities was mainly due to the fact that he knew I have been a flight simmer early on.\u003C/p\u003E\u003Cp\u003EStarting 2010, I\u0027ve acquired X-Plane 9 and more recently, X-Plane 10 (which I had to really save a lot for, because it was expensive and overly a luxury item from where I come from), mainly because I wanted to see if I can design my own aircraft, and its blade element theory algorithm is superior than MS\u0027 FD-file system coupled with \u0022stability derivatives\u0022, which basically means, when you design an aircraft in X-Plane, the airflow around the 3D-shape of your designed aircraft will really be modelled by X-Plane, unlike in MSFS, where the aerodynamics is separate to the actual 3D model, and dictated by the parameters found in the FD file.\u003C/p\u003E\u003Cp\u003EIncidentally, I\u0027ve made addons for various versions of MSFS, mostly aircraft repaints, but also scenery, which can be found at flightsim.com and avsim.com\u003C/p\u003E\u003Cp\u003EThen of course, I\u0027ve also used and played an array of combat flight simulators (from World War I to modern) since Falcon 1.0 back in 1987.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-15T03:34:30Z\u0022 title=\u002206/15/2013 03:34  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 15, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-15T03:29:10Z","Content":"\n\u003Cp\u003EI used to be absolutely addicted to the old \u003Cem\u003ERed Baron\u003C/em\u003E back in the days when everything was on floppy disks. I don\u0027t remember ever living through the entire war, but I generally gave as good as I got on my missions.\u003C/p\u003E\u003Cp\u003EAnother one I really loved was \u003Cem\u003ESilent Thunder\u003C/em\u003E, where you piloted an A-10 \u0022Warthog\u0022 on various ground attack missions. I did alright, although I only ever used Mavericks and FAE bombs (talk about overkill, re: the latter).\u003C/p\u003E\u003Cp\u003EAlso bashed around a bit on \u003Cem\u003EFreelancer\u003C/em\u003E and \u003Cem\u003EOolite\u003C/em\u003E (a remake of the old classic \u003Cem\u003EElite\u003C/em\u003E), as well as a few others I have sadly forgotten. I\u0027d \u003Cem\u003Elike\u003C/em\u003E to get into \u003Cem\u003EWar Thunder\u003C/em\u003E, but my shoddy internet connection won\u0027t let me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-06-15T03:34:40Z","Content":"\n\u003Cp\u003EFS 2004, X-Plane 7, X-Plane 8, X-Plane 9, FSX Deluxe Edition...\u003C/p\u003E\u003Cp\u003EI used to be an aviation fan, but then I took a rocket to the knee. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-15T03:40:24Z","Content":"\n\u003Cp\u003EI also had an intense \u0022IL2 Sturmovik 1946 Online Dogfight Battles Phase\u0022 back in 2009-2011, back when I had a decent landline internet connection (right now I am forced to use mobile internet due to my job which makes me move around a lot), and connected via HyperLobby.\u003C/p\u003E\u003Cp\u003EI broke (and repaired) dozens of (mostly cheap) joysticks in the span of my flightsimming life...I really should have kept the older ones and not throw them away, for nostalgia/posterity reasons.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-06-15T04:50:27Z","Content":"\n\u003Cp\u003Eused to fly MSFS for over a decade, but stopped that around the time the ACES team got axed by Microsoft. Guess I just got burned out on it.\u003C/p\u003E\u003Cp\u003EMade addons, repaints, scenery, even an aircraft once (though that never got past the prototype stage.\u003C/p\u003E\u003Cp\u003EAs a tester and customer support tech for Flight1, forum mod for a time at Avsim, flightsim.com (only one of the sub forums, not the main), and Simviation.\u003C/p\u003E\n"},{"CreatedByName":"Frafor","CreatedById":57212,"CreatedDateTime":"2013-06-15T04:52:30Z","Content":"\n\u003Cp\u003EI have been playing flight simulators since I was 6, starting with Microsoft FS98, and I\u0027m thinking of doing flight school next february.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-15T06:31:41Z","Content":"\n\u003Cp\u003EI actually was amazed by these replies- quite indeed...\u003C/p\u003E\u003Cp\u003ESide note: I have FSX Gold. I got original, 1 day later I realised there was gold edition and bought it.\u003C/p\u003E\u003Cp\u003ESo ya, 2 copies of FSX.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-15T08:20:02Z","Content":"\n\u003Cp\u003E*looks at X-Plane 10 and sees a North American X15 being launched.*\u003C/p\u003E\u003Cp\u003EI have to play this thing. It\u0027s possible to play those entirely by keyboard?\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-15T11:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003E*looks at X-Plane 10 and sees a North American X15 being launched.*\u003Cp\u003EI have to play this thing. It\u0027s possible to play those entirely by keyboard?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, but you can try this. \u003Ca href=\u0022https://sites.google.com/site/xplanekeyboardplugin/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://sites.google.com/site/xplanekeyboardplugin/\u003C/a\u003E but I don\u0027t know if that works because I personally use joysticks for X-Plane 10.\u003C/p\u003E\u003Cp\u003EOne caveat re the X-15...the X-15 model in X-Plane 10 is the \u0022-1\u0022 model, the first few of which had the temporary XLR-11 engines, and not the more powerful XLR-99s...as a result, your flight in it, in X-Plane 10,is VERY brief, only about 2 minutes. I was actually quite disappointed with it, because the X-15 package set that was made for FSX was really dynamite--it had ALL variants (but I purchased only one, because of the price, and chose the -2/-3 variants), including the one with augmented thrust/additional fuel tanks (A2 model).\u003C/p\u003E\u003Cp\u003EThis is the X-15 package for FSX: \u003Ca href=\u0022http://www.xtremeprototypes.com/en/product_x15-23.asp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.xtremeprototypes.com/en/product_x15-23.asp\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-15T11:19:11Z\u0022 title=\u002206/15/2013 11:19  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 15, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-15T15:55:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003ENo, but you can try this. \u003Ca href=\u0022https://sites.google.com/site/xplanekeyboardplugin/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://sites.google.com/site/xplanekeyboardplugin/\u003C/a\u003E but I don\u0027t know if that works because I personally use joysticks for X-Plane 10.\u003Cp\u003EOne caveat re the X-15...the X-15 model in X-Plane 10 is the \u0022-1\u0022 model, the first few of which had the temporary XLR-11 engines, and not the more powerful XLR-99s...as a result, your flight in it, in X-Plane 10,is VERY brief, only about 2 minutes. I was actually quite disappointed with it, because the X-15 package set that was made for FSX was really dynamite--it had ALL variants (but I purchased only one, because of the price, and chose the -2/-3 variants), including the one with augmented thrust/additional fuel tanks (A2 model).\u003C/p\u003E\u003Cp\u003EThis is the X-15 package for FSX: \u003Ca href=\u0022http://www.xtremeprototypes.com/en/product_x15-23.asp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.xtremeprototypes.com/en/product_x15-23.asp\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is also some good freeware X-15s for FSX...\u003C/p\u003E\u003Cp\u003EOh wait, I remember- that was Orbiter 2010. Lol\u003C/p\u003E\u003Cp\u003EAnyway, Keyboard is not bad for FSX, but the arrows suck FLUFFY BUNNYS, because its more like a trim than actual full control.\u003C/p\u003E\u003Cp\u003EBefore I had a joystick, I had a mouse. It\u0027s fairly good at manuvering.\u003C/p\u003E\u003Cp\u003EI reccomend Logitech Attack 3. It\u0027s cheap, $17.67 from Wal-Mart. And it lasts, 2 years so far.\u003C/p\u003E\u003Cp\u003EMy only issue is it dosen\u0027t turn for rudder, but that\u0027s ok. I also had a connection problem, where it phased in and out (managed to fix it by one time forcing the computer (power bar) off, and somehow it worked. This house is haunted), so I leave it plugged in at all times.\u003C/p\u003E\u003Cp\u003EAlso, gonna download X-plane 10 demo later, it takes 2 hours to install, lol.\u003C/p\u003E\n"},{"CreatedByName":"IvanTehFennec","CreatedById":26927,"CreatedDateTime":"2013-06-15T16:04:42Z","Content":"\n\u003Cp\u003EI play a lot of FSX, flying the PMDG 737NGX on hops around the USA. You might find me on VATSIM flying in Norway though, I love the controllers.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-15T18:42:36Z","Content":"\n\u003Cp\u003EWell, X-Plane 10 cant run on my machine.\u003C/p\u003E\u003Cp\u003EGonna look for others...Or, try to make my own x15 on KSP.\u003C/p\u003E\n"},{"CreatedByName":"palker","CreatedById":67355,"CreatedDateTime":"2013-06-15T18:48:14Z","Content":"\n\u003Cp\u003EIl 2 1946 and Cliffs of Dover is what i used to play before KSP. Now i cannot stop building and launching rockets.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-17T01:50:40Z","Content":"\n\u003Cp\u003ECrap X-plane 10 trailer looks even better than FSX.\u003C/p\u003E\u003Cp\u003EDemo takes 80 minutes... ._.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XViCj0uqeco?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-17T04:07:54Z","Content":"\n\u003Cp\u003EWhat surprised me about X-Plane 10 is the fact that it actually runs well on my laptop. Granted, I have to really mess with the detail and graphic effects sliders a lot, depending on the area I fly in, but I get decent framerates enough to enjoy the ride. During high altitude tests (i.e. U2, X-15, SR71) even if I had the terrain detail at max, it doesn\u0027t even matter that much, because at altitude, the engine doesn\u0027t render the ground detail (makes sense), so it\u0027s cool.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-17T07:26:05Z","Content":"\n\u003Cp\u003EMy god, X-plane 10 looks awesome and runs great.\u003C/p\u003E\u003Cp\u003EHowever, when I started I literally flew into boeing 747 and into the terminal then took off 90 degrees.\u003C/p\u003E\u003Cp\u003E._.\u003C/p\u003E\u003Cp\u003EI need to assign buttons.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-17T07:41:18Z","Content":"\n\u003Cp\u003EHere\u0027s me flying an SR-71 but back in X-Plane 9.0. Actually, the airframe is an SR-71 but the cockpit is that of the prototype YF-12, and this was done purposely, because you\u0027re actually the only person flying it in X-Plane--if this was a REAL SR-71 cockpit, you need to operate two separate control panels. Even back in 9.0, X-Plane still had lots of things going for it over FS2004 or FSX.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/x4VAP2cBH-s?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"cesarcurado","CreatedById":60073,"CreatedDateTime":"2013-06-17T20:29:45Z","Content":"\n\u003Cp\u003EI used to, Flight Simulator X.\u003C/p\u003E\u003Cp\u003ENow I don\u0027t play it anymore, got too old, missions complete and nothing else to do there.\u003C/p\u003E\u003Cp\u003EHere\u0027s a scenic view of my plane getting ready to land at Sitka airport:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Jq1QYpk.png\u0022 alt=\u0022Jq1QYpk.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-18T20:46:43Z","Content":"\n\u003Cp\u003EYou should try FsPassengersX.\u003C/p\u003E\n"},{"CreatedByName":"Epic DaVinci","CreatedById":58581,"CreatedDateTime":"2013-06-28T12:16:42Z","Content":"\n\u003Cp\u003EI have just reinstalled my copy of FSX Gold, I too have been into Flightsims for many years, since the days of FS98. I was surprised how well it runs at high settings on my I5 laptop with Intel HD3000 onboard graphics.\u003C/p\u003E\u003Cp\u003EI did give Microsoft Flight a go but i think its very dumbed down and aimed at the casual audience.\u003C/p\u003E\u003Cp\u003EAs for X-Plane, i am really impress with what Austin Meyer has achieved, I bought version 8 and was very interested in designing my own craft, Which is a very time consuming yet rewarding process, But unfortunatly, due to my hardware limitations, Xplane 10 will have to wait untill i get a decent PC.\u003C/p\u003E\u003Cp\u003EI have flown in real life aswell in a Cessna 182, and due to me knowing what every guage and dial did straight away from flight simming, the Instructor allowed me to attempt to manualy fly the ILS down and touch down, which he said he doesnt usually let people do.\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2013-06-28T12:50:46Z","Content":"\n\u003Cp\u003EMy first FS was on my GameBoy AdvanceSP called F/A-18 super hornet(still have e GB and the game cartridge). You flew an F-18, did combat missions, landed, even refuelled in the air from a KC-135\u003C/p\u003E\u003Cp\u003EMy latest one was X-Plane and it is great(both on PC and iOS).\u003C/p\u003E\n"},{"CreatedByName":"slam525i","CreatedById":67543,"CreatedDateTime":"2013-06-28T14:06:01Z","Content":"\n\u003Cp\u003ETo everyone who flies flight sims, I heartily encourage you to learn to fly. Go visit your local airport and get a cheap \u0022familiarization flight\u0022. This is especially if you live in North America where flying is much more affordable than in Europe.\u003C/p\u003E\n"},{"CreatedByName":"nats","CreatedById":58316,"CreatedDateTime":"2013-06-29T21:07:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003EI\u0027m wondering- do people here at KSP forums play Flight simulators?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes Ive always loved flight simulators and have played practically all of them at one point or another. My favourite ones were: \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EF117 Stealth Fighter\u003C/strong\u003E - I think I might have played this on my Amiga 600 not a PC cant remember, but this game was set in Norway I think and all I really remember of it was you had to \u0027thread the needle\u0027 ie sneak around the various radar zones either by skirting them or heading straight to and away from them depending on whether they were doppler radars or the other type (which I forget). And I remember the Tomcat plane was a right nightmare to take down because of its 360 degree radar coverage. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGunship 2000\u003C/strong\u003E - Microprose simulation of the apache heicopter but you could fly Scouts and transport heicopters as well - great flying a mission with four helipcopters and I remember flying low down along the river beds where the AA and radar couldtn see you. I alsor emember the medals and promotions you could award got at the end of each mission and the fantastic mission briefings/base.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EB17 Flying Fortress 2\u003C/strong\u003E - Another great Microprose game (most of them were) that simulated what it was like to fly a mission in a B17 and they couldnt have done it any better - you got to manage all the crew during the missions as well as take over any jobs you wanted to, such as shame the bombers were only limited to 12 or so rather than having a massive group and that the fighters against you only came in threes, but either way it was a superb sim and even modelled the entire base for you to walk around, check over your plane, etc. Landing was the best part though where you had to circle, sometimes with engines on fire trying not to overheat them, and turn onto the landing field at the right time which is very tricky in a massive bomber - and then manage to stop it! Great sim one of my all time favourites.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDambusters\u003C/strong\u003E - on the Spectrum this was a simulation of attacking the Ruhr dams where you had to fly past cities with lots of floodlights trying to shoot them out, then attack the dams by getting low enough and using the same instruments the Dambusters used - very atmospheric game for the time I loved it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERowan\u0027s battle of Britain/Battle of Britain 2: Wings of Valour\u003C/strong\u003E - you can still get this game and its still being updated by the BDG fan group. This features a fantastic dynamic campaign of the Battle of Britian which you can mange from either side. But by far the best thing about the game is the sheer numbers of planes in the sky at any one time - hundreds. It really is just like it must have been during the war. The planes are all well modelled and you can even take over the gunners stations in the German bombers. I have played this game loads and its still on my computer, in fact the only flight sim that is.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETornado\u003C/strong\u003E - on the PC, fantastic living world with realisitc mission planner for multiple attack waves on a target and good simulatoion of the low level approach and attacks - I still remember my first ever night attack at 50 feet on an airfield with all the antiaircraft fire raking up - superb game. F16 Fighting Falcon and Hind were two other similar games done by the same people I think, which also featured the great living world with trains and lorries etc all doing their own thing, but Tornado was the best by far simply because of the low level flying and mission planner.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEF2000\u003C/strong\u003E - I loved playing this game for months on end, fantastic recreation of the British Typhoon fighter plane with very atmospherically bleak campaign set in Norway I remember diving down on a hill top radar station and blowing it up using iron bombs, the enemy always hung around your last waypoint before the target so if you missed it out you had an easier ride but it was a superb game anyway. The cockpit view was remarkably good. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETFX\u003C/strong\u003E - EF2000s prerunner was another great sim done by DiD that covered the F117, F18 and the EF2000 planes, it was a bit simpler than EF2000 but the graphics were remarkable for the time it came out and the runway cratering weapon was superb fun!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EF22 Total Air War\u003C/strong\u003E - sequel to EF2000 simulation of the F22 stealth fighter with multiple campaigns and fantastic simulation of the various stealth settings. Loves the scrambling to attack enemy bogies.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFalcon 4.0\u003C/strong\u003E - probably the best ever flight sim and still going strong, I havent played the later versions simply because I played this game for years on end. A nightmare to learn and master but the best dynamic campaign ever, superb flight modelling and ultra realistic depiction of a warzone, this game will probably never be beaten, and you can still get it, and the latest version still looks brilliant.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESilent Hunter 3\u003C/strong\u003E - ok its not a flight sim but this sub sim was the best one I have played, remarkable immersion walking around you sub and repairing it/assigning medals etc to crew and fantastic sense of reward when you found a large convoy after days of looking.\u003C/p\u003E\u003Cp\u003EThere are probably another ten or more flight sims I have played that arent on this list that were very good as well and probably another 20 or so that I have played on my Amiga, ZX81 and Spectrum over the years. Most of the best flight sim games were produced around the \u0027golden era\u0027 of PC games (as I see it) in the early 90s when Microprose ruled. They have never been bettered I feel - some of the best games like European Air War and Combat Flight Sim are still played today in various guises. \u003C/p\u003E\u003Cp\u003EI havent played many flight sims recently and I havent really liked what I have played, either because they are too difficult (Rise of Flight), or too bugged (Cliffs of Dover) or just too complex for my limited time now (A10). \u003C/p\u003E\u003Cp\u003EI am still looking for a new series of approachable flight sims along the lines of Microprose\u0027s great ones!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-29T21:22:06Z\u0022 title=\u002206/29/2013 09:22  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 29, 2013\u003C/time\u003E by nats\u003C/strong\u003E\n\u003C/span\u003E\n"}]}