{"TopicId":33344,"ForumId":16,"TopicTitle":"[Very thoroughly!] Design help?","CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-06-16T21:36:47Z","PageNum":1,"Articles":[{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-06-16T21:36:47Z","Content":"\n\u003Cp\u003EErm, hi.\u003C/p\u003E\u003Cp\u003EI\u0027ve made my first rocket that\u0027s achieved orbit, but it\u0027s very unreliable. Can someone look at the design and tell me what I\u0027m doing wrong? What happens is, I usually reach sub-orbital, but I either run out of fuel, out of power, my second stage engine \u003Cem\u003Ecomes off\u003C/em\u003E (bracers have since been added), or I just can\u0027t complete the circle before I crash. Something that happens very often is my second stage spinning out of control after separation, that costs time to correct.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/5cbkafyauet3k5e/J4-9.craft\u0022 rel=\u0022external nofollow\u0022\u003ECRAFT file link\u003C/a\u003E (very slightly different to images - there is now only one antenna at the top, the I-beam and nosecone have been eliminated, and bracers added between the second stage fuel tank and engine).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/tvbp3qohibldvbt/2013-06-16_00003.jpg\u0022 rel=\u0022external nofollow\u0022\u003ETop-down view\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/dn4e0gmdotg7e3l/2013-06-16_00005.jpg\u0022 rel=\u0022external nofollow\u0022\u003ELower section\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/laigv0f29414iva/2013-06-16_00006.jpg\u0022 rel=\u0022external nofollow\u0022\u003EMiddle section\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/p6593kykc17d0l7/2013-06-16_00007.jpg\u0022 rel=\u0022external nofollow\u0022\u003EUpper section\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/84c0kaw38sbgemy/2013-06-16_00008.jpg\u0022 rel=\u0022external nofollow\u0022\u003EAfter launch\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/yvgwukv7t5n56ox/2013-06-16_00009.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESecond booster separation\u003C/a\u003E (Note: the boosters below separated well before this)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/2tirv44ofcph9b0/2013-06-16_00011.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESecond stage separation\u003C/a\u003E (where things go tits-up)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-16T23:19:09Z\u0022 title=\u002206/16/2013 11:19  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 16, 2013\u003C/time\u003E by Artie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"legoheli","CreatedById":47640,"CreatedDateTime":"2013-06-16T21:54:10Z","Content":"\n\u003Cp\u003EYou\u0027re over-engineering \u003Cem\u003Emassively\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EThe reason your craft falls apart is that it\u0027s not a stable construction, for launching that small a satellite into orbit, you just need something like this, just with 1 meter parts:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DV23jlw.png\u0022 alt=\u0022DV23jlw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis rocket takes that entire space station core into orbit with plenty of fuel to spare.\u003C/p\u003E\n"},{"CreatedByName":"peeri","CreatedById":71099,"CreatedDateTime":"2013-06-16T21:56:42Z","Content":"\n\u003Cp\u003EFirst, You don\u0027t need such many wings... actually do not use any wings or thrusters at all if you have gimbal in your engines.\u003C/p\u003E\u003Cp\u003Esecond, rocket seems to be about 1 stage rocket... and it is quite difficult to reach orbit with that kind of rocket.\u003C/p\u003E\u003Cp\u003Etry to make many stages and dump the extra load away when it is possible.\u003C/p\u003E\n"},{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-06-16T22:06:06Z","Content":"\n\u003Cp\u003EWell, the idea was to make a generic heavy launcher, that could have anything at the top and have enough thrust to put it in orbit. \u003C/p\u003E\u003Cp\u003EThanks for the advice, though!\u003C/p\u003E\u003Cp\u003EErm, before I go, though, what exactly causes that spinning out of control at separation? From your comments, you think that the second stage doesn\u0027t have enough mass?\u003C/p\u003E\n"},{"CreatedByName":"Syhrus","CreatedById":64839,"CreatedDateTime":"2013-06-16T22:13:08Z","Content":"\n\u003Cp\u003EAnother reason for the problems of spinning may be that you have too many wings on the ship. They tend to make things \u003Cem\u003Emore\u003C/em\u003E unstable for the amount of control they give. Try to just launch it with a pair of canards at most, or even none at all. Also, if you\u0027re having trouble when you decouple those SBRs it may have to do with the chutes pulling them into the main rockets, which could explain the loss of control. I personally wouldn\u0027t bother with the chutes, seeing as you can\u0027t reuse parts yet...\u003C/p\u003E\u003Cp\u003ETo give you an idea of what sizes are possible, this craft is capable of reaching Duna:\u003C/p\u003E\u003Cp\u003EIt has no control surfaces, no RCS, and uses a Nuclear engine to power itself once in space. (I hate ion drives).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/921265785231684819/B1965D93472F79F0D42E56C20ED6629BAC9B95D1/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: I just realised it isn\u0027t even set up for asparagus staging either...\u003C/p\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2013-06-16T22:21:36Z","Content":"\n\u003Cp\u003EI guess I can\u0027t add much more than what these two just did. Some sound advice here. \u003C/p\u003E\u003Cp\u003EYou need to play around with small, simple designs and learn about the behavior and capability of parts and part configurations. With the knowledge of performances from small test-designs, you can build a larger rocket that isn\u0027t over-engineered and doesn\u0027t have too little or too much fuel.\u003C/p\u003E\u003Cp\u003EGood luck with future designs! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"starbork","CreatedById":64802,"CreatedDateTime":"2013-06-16T22:27:44Z","Content":"\n\u003Cp\u003EYep -- you\u0027re lifting a LOT of gear up for no purpose other than lifting gear up :-) \u003C/p\u003E\u003Cp\u003EMy advice is this. \u003C/p\u003E\u003Cp\u003E1. Keep your part count as low as you can -- e.g. ONE orange tank instead of TWO half-jumbos (same weight, same fuel count, more stable, less parts). \u003C/p\u003E\u003Cp\u003E2. Lose the RCS systems -- pods and tanks -- for your orbital mission. I landed on the Mun long before I ever learned or added RCS systems. \u003C/p\u003E\u003Cp\u003E3. Drop parts at stages if you can --an engine carried that is NOT thrusting is dead weight! Empty fuel tank is dead weight! \u003C/p\u003E\u003Cp\u003E4. Use fewer engines and keep them burning as long as you can (drop tanks!). \u003C/p\u003E\u003Cp\u003E5. Trust your ASAS, and only add wings and stabilizers as a last resort.\u003C/p\u003E\u003Cp\u003E6. Fresh local ingredients, served simply and sensibly. \u003C/p\u003E\u003Cp\u003ELook at legoheli\u0027s design. It is designed with the mission in mind. It is simple, it is (probably) quite stable in flight. You could simplify it even further and achieve the same orbital result.\u003C/p\u003E\u003Cp\u003EClear skies to you sir. Please keep us informed on your progress!\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-16T22:35:59Z","Content":"\n\u003Cp\u003EYour ambition is impressive, but why not practice getting to orbit with small ships before trying to build an all-purpose jumbo launcher? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-06-17T00:21:59Z","Content":"\n\u003Cp\u003EThanks everyone!\u003C/p\u003E\u003Cp\u003EI did get into orbit quite successfully using a rocket...based on legoheli\u0027s design. \u003C/p\u003E\u003Cp\u003EIt looks like \u003Ca href=\u0022https://www.dropbox.com/s/4vn3nnu7o79ee42/J5-3.png\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EShut up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E.\u003C/p\u003E\n"}]}