{"TopicId":33365,"ForumId":32,"TopicTitle":"Switching Ships In Orbit = KABOOOM!","CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-17T00:32:59Z","PageNum":1,"Articles":[{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-17T00:32:59Z","Content":"\n\u003Cp\u003EI\u0027m jinkxed. I seem to be getting more instances of switching ships in orbit causing the ship you switch to to go BOOOOM since 20.2. I think I have had five instances just tonight. Until 20.2 I don\u0027t think I had more than instance of this happening a week (and I play KSP a lot when I am stuck in bed).\u003C/p\u003E\u003Cp\u003EIt\u0027s totally random too. I can reload the save and switch the same ship and it works fine. Try again and KABOOM. It\u0027s not just switching between ships using the square bracket keys either. Switch to ships from the tracking station causes it too.\u003C/p\u003E\u003Cp\u003EI can\u0027t even submit it to the devs as a bug though because I use a lot of mods which is a shame. \u003C/p\u003E\u003Cp\u003ESo, anyone else getting this or is it just my mod heavy build going NYEH NYEH.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-06-17T00:35:23Z","Content":"\n\u003Cp\u003EMod heavy build I\u0027d guess.\u003C/p\u003E\n"},{"CreatedByName":"ShachonianX","CreatedById":62805,"CreatedDateTime":"2013-06-17T00:44:37Z","Content":"\n\u003Cp\u003EI haven\u0027t experienced this problem at all.\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-06-17T00:45:16Z","Content":"\n\u003Cp\u003EA lot of people get this, though I believe it mostly happens with things on the ground. I had it a few months ago with a rover and a base of mine on Eve, and another explosion last night that shut down an entire colony on one of Laythe\u0027s islands. And Scott Manley\u0027s stuff exploded in one of his videos too. So you\u0027re not the only one experiencing KSP - Michael Bay Edition.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-17T00:53:04Z","Content":"\n\u003Cp\u003EIt\u0027s frustrating as hell... I had just rendezvousing my new moon orbit station next to a lander I had left in moon orbit ready to dock to the station. Switched to the lander and the whole thing went KABOOM. I wanted to dock the lander because it had the booster still attatched and had a bunch of fuel I wanted to steal.... made a nice boom when it went off though lol. Oh well... Thank god for F5/F9 is all I can say.\u003C/p\u003E\n"},{"CreatedByName":"Strategia","CreatedById":68581,"CreatedDateTime":"2013-06-17T00:58:13Z","Content":"\n\u003Cp\u003EI had this happen too, with just MechJeb on an otherwise stock build. I was trying to dock a fuel tank to my custom-built space station core, but the tank was about to run out of electric charge, so I tried to switch to the station with the bracket keys, to use its RCS to finish the dock..... and boom, bits of station everywhere. The only mod I had on either of them was MechJeb.\u003C/p\u003E\n"},{"CreatedByName":"Goatgas","CreatedById":67221,"CreatedDateTime":"2013-06-17T02:44:43Z","Content":"\n\u003Cp\u003Ehad same thing happen to me also but while trying to dock two Gemini capsules using MechJeb however I also had lazor system. took off lazor and still same issue.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-17T02:53:29Z","Content":"\n\u003Cp\u003ESounds like MJ is the common denominator here...\u003C/p\u003E\n"},{"CreatedByName":"Mattasmack","CreatedById":62809,"CreatedDateTime":"2013-06-17T03:05:35Z","Content":"\n\u003Cp\u003EI\u0027ve been having the same problem (or at least a similar problem) with the latest version. I\u0027ve only been flying some pretty simple craft, but consistently if I switch away from a craft in flight and back to it, any LT-1 landing struts on it break off and drift away. I have one craft that\u0027s landed on the Mun on LT-1 struts and it seems to be fine. It\u0027s frustrating; I just sent up a tug that uses the landing struts as a claw to grab some debris around Kerbin to deorbit it, and instead the struts are just adding to the debris! The only mod I have installed is MechJeb.\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-06-17T03:18:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003ESounds like MJ is the common denominator here...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t use Mechjeb modules on my bases, and my Eve base\u0027s explosion was before I even installed Mechjeb. I think it\u0027s a problem with the game.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-17T03:22:14Z","Content":"\n\u003Cp\u003EI have the same problem. My space station is all stock. And when trying to dock with it it will explode if I switch. But I found that in my case it will not detonate if im under 300 meters from it.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-17T03:37:22Z","Content":"\n\u003Cp\u003ESooo... not MechJeb and not mods... Ooooh. Looks like an intermittent problem for SQUAD to trace somehow. Don\u0027t like bugs like that (from a dev\u0027s standpoint).\u003C/p\u003E\n"},{"CreatedByName":"Doc Anderson","CreatedById":59918,"CreatedDateTime":"2013-06-17T03:48:42Z","Content":"\n\u003Cp\u003EI seem to recall hearing something about corrupted parts being linked to view switching exolosions. I will occasionally get parts that don\u0027t show all the connection nodes that should be there when I\u0027m building in the VAB. When I started checking to make sure each part showed all the nodes it should, I stopped having the exploding problem. That may be coincidence and not causation but it\u0027s all I got.\u003C/p\u003E\u003Cp\u003ECan anyone else back this up?\u003C/p\u003E\n"},{"CreatedByName":"praise the suuun","CreatedById":69912,"CreatedDateTime":"2013-06-18T01:04:52Z","Content":"\n\u003Cp\u003Edoc anderson, i regularly get radial attachment points that lose a node at random after removing the thing attached to it. ive only ever had one 1 exploding ship and it was complete stock.\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-06-20T22:34:27Z","Content":"\n\u003Cp\u003EThis started happening to me a while ago. It seems to be related to the distance between the two ships being switched between. An example: I was making a fairly massive ship for a grand tour run of the system which require docking about six large parts. The crew quarters/command module was the first to go up, but whenever I got close enough to render while trying to dock the next piece, switching between the ships would cause the one I was switching to to do \u0027physics\u0027 and explode (thank you F5/F9)... I remedied this by using the tracking station to switch from this point on. However, I did some experimentation and I noticed that the closer I got to the ship before I switched, the less intense the random physics were, down to a point where I determined that around 250-350m seems to be safe for me.\u003C/p\u003E\u003Cp\u003ESo if we are indeed all experiencing the same problem, use the tracking station to switch unless you\u0027ve closed the distance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-20T22:38:08Z\u0022 title=\u002206/20/2013 10:38  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 20, 2013\u003C/time\u003E by espm400\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"acealeam","CreatedById":61964,"CreatedDateTime":"2013-06-20T22:40:56Z","Content":"\n\u003Cp\u003EThis ruined my first space station. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-06-20T22:45:41Z","Content":"\n\u003Cp\u003EYeah I get the Michael Bay special effects when moving Kerbals between ships on Eve that are, according to KSP. landed and not going anywhere..\u003C/p\u003E\n"},{"CreatedByName":"OUScooby","CreatedById":66208,"CreatedDateTime":"2013-06-20T23:16:30Z","Content":"\n\u003Cp\u003EI just had this happen to my ship on Eeloo. It\u0027s been sitting there waiting for a rescue ship since I didn\u0027t have enough fuel to get home. Finally got a rescue craft out there but went to launch to rendezvous with the rescue ship and it exploded when it loaded. MechJeb is the only mod I\u0027ve got installed and yes it is on the ship in question. Anyone got a fix for this yet?\u003C/p\u003E\n"},{"CreatedByName":"Lindy","CreatedById":68803,"CreatedDateTime":"2013-06-20T23:44:10Z","Content":"\n\u003Cp\u003EHmm... I\u0027ve never had explosions happen that weren\u0027t my own bloody fault. Hitting the wrong key at the right time, that sort of thing. I use MechJeb on occasion, and the Lazor System for the docking cam. Could be I\u0027m not pushing the game hard enough. This has my curiosity peaked, guess I\u0027m going to have to push hard, and try to induce a random ka-boom! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2013-06-21T09:41:23Z","Content":"\n\u003Cp\u003EI\u0027ve had it happen once during the construction of my space station. I switched when I was about 1500m away and it exploded. When I reloaded nothing of the sort happened. I\u0027m totally stock.\u003C/p\u003E\u003Cp\u003EI suggest pressing F5 to save before switching, just to be safe...\u003C/p\u003E\n"},{"CreatedByName":"tek_604","CreatedById":59699,"CreatedDateTime":"2013-06-21T11:40:48Z","Content":"\n\u003Cp\u003EI\u0027ve also been suffering from this, mostly (I say mostly as I am not 100% sure) when switching to craft in Kerbol\u0027s SOI. At first, I thought it was the number of mods, so when it first started happening, I removed B9 \u0026amp; LLL (wasn\u0027t using them), and it seemed to be fixed... but... happened again to me last night. Well, I actually get two types of fault, and I have a feeling they are related:\u003C/p\u003E\u003Cp\u003E1) Not exploding, just disassembly. Parts falling off as the ship gets loaded and the physics are calculated (I assume anyway, cause the game goes real slow when loading the view - I have an i7 btw).\u003C/p\u003E\u003Cp\u003E2) NaN errors: ship starts loading (as above), and then everything goes NaN. Broken game at this point, cause the NaN values get saved to persistent, so you need to kill the process to save your save games.\u003C/p\u003E\u003Cp\u003EI have a feeling it is MJ thats doing it, although I doubt the game is helping matters. The disassembly error I had last night was quite funny; the MJ AR case came off, and was floating away on quite a nice fast straight trajectory. Seems the calculations made during the initialisation of the craft as its loaded go totally nuts.\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-06-21T15:35:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tek_604\u0022 data-cite=\u0022tek_604\u0022\u003E\u003Cdiv\u003EI\u0027ve also been suffering from this, mostly (I say mostly as I am not 100% sure) when switching to craft in Kerbol\u0027s SOI. At first, I thought it was the number of mods, so when it first started happening, I removed B9 \u0026amp; LLL (wasn\u0027t using them), and it seemed to be fixed... but... happened again to me last night. Well, I actually get two types of fault, and I have a feeling they are related:\u003Cp\u003E1) Not exploding, just disassembly. Parts falling off as the ship gets loaded and the physics are calculated (I assume anyway, cause the game goes real slow when loading the view - I have an i7 btw).\u003C/p\u003E\u003Cp\u003E2) NaN errors: ship starts loading (as above), and then everything goes NaN. Broken game at this point, cause the NaN values get saved to persistent, so you need to kill the process to save your save games.\u003C/p\u003E\u003Cp\u003EI have a feeling it is MJ thats doing it, although I doubt the game is helping matters. The disassembly error I had last night was quite funny; the MJ AR case came off, and was floating away on quite a nice fast straight trajectory. Seems the calculations made during the initialisation of the craft as its loaded go totally nuts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I previously mentioned, it has to do with the way physics are being loaded upon switching crafts at distance (I don\u0027t know how, as I know nothing about Unity). I doubt this has much if anything to do with MechJeb as my explosive results were repeatable even after removing it and restarting the game (I only use MJ for the dV, TWR, and surface info, not the parts or auto-pilot, so none of those were present on my ships to begin with).\u003C/p\u003E\u003Cp\u003EEDIT: I never experienced any NaN errors though, just varying degrees of annihilation, from just parts broken off at moderate distances to full-on Kraken bitch-slap at full default draw distance and beyond.\u003C/p\u003E\u003Cp\u003EEDIT EDIT: If you are experiencing this problem, just use the tracking station to switch your crafts as this eliminates the problem. I\u0027m fairly certain this is a bug and as such will hopefully be repaired with the next update.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-21T15:42:39Z\u0022 title=\u002206/21/2013 03:42  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 21, 2013\u003C/time\u003E by espm400\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fried","CreatedById":55492,"CreatedDateTime":"2013-06-21T15:44:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sapphire\u0022 data-cite=\u0022Sapphire\u0022\u003E\u003Cdiv\u003EI don\u0027t use Mechjeb modules on my bases, and my Eve base\u0027s explosion was before I even installed Mechjeb. I think it\u0027s a problem with the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyours exploded because of the 2.5 km render distance putting your ship in the ground because the ground wasn\u0027t at its full resolution yet. this was a problem in every version, the spots where this happens are random.\u003C/p\u003E\n"},{"CreatedByName":"Fried","CreatedById":55492,"CreatedDateTime":"2013-06-21T15:46:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022espm400\u0022 data-cite=\u0022espm400\u0022\u003E\u003Cdiv\u003EAs I previously mentioned, it has to do with the way physics are being loaded upon switching crafts at distance (I don\u0027t know how, as I know nothing about Unity). I doubt this has much if anything to do with MechJeb as my explosive results were repeatable even after removing it and restarting the game (I only use MJ for the dV, TWR, and surface info, not the parts or auto-pilot, so none of those were present on my ships to begin with).\u003Cp\u003EEDIT: I never experienced any NaN errors though, just varying degrees of annihilation, from just parts broken off at moderate distances to full-on Kraken bitch-slap at full default draw distance and beyond.\u003C/p\u003E\u003Cp\u003EEDIT EDIT: If you are experiencing this problem, just use the tracking station to switch your crafts as this eliminates the problem. I\u0027m fairly certain this is a bug and as such will hopefully be repaired with the next update.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ecould be a graphics card issue as ksp in not processor heavy but gpu heavy\u003C/p\u003E\n"},{"CreatedByName":"Sangi","CreatedById":71603,"CreatedDateTime":"2013-06-21T16:00:59Z","Content":"\n\u003Cp\u003EI have had a similar experience. Using the [ or ] keys to switch cause my station that I am assembling to go boom. If I go out to the tracking station and come back I don\u0027t have an issue. I did some digging on the forums about it and it appears it is an issue that started in 19 or 20 and supposedly was fixed in 20.1. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/30923-Ship-explode-instantenously/page3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/30923-Ship-explode-instantenously/page3\u003C/a\u003E is the support thread. It appeared related to some docked parts not being attached correctly in the saved files so when they were switched to they were in orbit and collided with the rest of the ship? If other folks are still hitting this I would say we try and get the data Squad needs to debug it and we necro that thread.\u003C/p\u003E\n"}]}