{"TopicId":33385,"ForumId":18,"TopicTitle":"L.A. Noire: Mind=Blown","CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-06-17T03:22:52Z","PageNum":1,"Articles":[{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-06-17T03:22:52Z","Content":"\n\u003Cp\u003ESo I\u0027ve been watching a youtube series on this game, never thought it would be good. When it first came out I discounted it as a GTA clone. Any of you played this game? Any recommendations?\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-17T03:37:29Z","Content":"\n\u003Cp\u003EI played it a bit. I remember it being pretty good. I don\u0027t see why you\u0027d think it was a GTA clone, it\u0027s a detective game.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-06-17T04:05:01Z","Content":"\n\u003Cp\u003EPlayed it when I was visiting a friend. It\u0027s a cool game, until you get a few missions in and realize that it\u0027s pretty much the exact same gameplay for a couple hours. Not a big problem if you play it for the story, but it\u0027s something to keep in mind.\u003C/p\u003E\n"},{"CreatedByName":"maxpower","CreatedById":16625,"CreatedDateTime":"2013-06-17T06:09:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EPlayed it when I was visiting a friend. It\u0027s a cool game, until you get a few missions in and realize that it\u0027s pretty much the exact same gameplay for a couple hours. Not a big problem if you play it for the story, but it\u0027s something to keep in mind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat games can\u0027t you say that about though? Almost all games have the same gameplay from start to finish... even sandbox style games like KSP. I mean LA Noire is a police detective game, so it stands to reason the entire game is going to have you playing as a police detective (gathering evidence, getting in chases/gun fights, and interrogating people). If you happen to find that kind of gameplay boring then its just going to feel boring and reparative, but again that goes for every game. \u003C/p\u003E\u003Cp\u003EAs for the LA Noire itself I thought it was really good. One of the better games I\u0027ve ever played in fact. There\u0027s no doubt that its a story heavy game like Heavy Rain, but the gameplay isn\u0027t bad. Took me about 35 hours to beat the entire thing including the DLC... though I took my time with it. My only complaint with that game is that no matter how bad you screw up a case, you eventually solve it and the story goes on as though you did a great job. Would have been better if, like Heavy Rain, the story changed based on your actions. Its not that big of a deal though. \u003C/p\u003E\u003Cp\u003EIf your not sure about it but really want to give it a try, I\u0027d wait till its on sale on Steam and pick it up (if you want it for the PC). Its one of the games that goes on sale fairly often since its been out for a while now.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-17T06:30:40Z","Content":"\n\u003Cp\u003EI do remember thinking (my memory of the game is foggy) that I wished there was more freedom, like I wished I could peice the mystery together myself more, but it was fairly linear and structured in that respect.\u003C/p\u003E\n"}]}