{"TopicId":33511,"ForumId":51,"TopicTitle":"Sling testing","CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-06-17T21:19:32Z","PageNum":1,"Articles":[{"CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-06-17T21:19:32Z","Content":"\n\u003Cp\u003EHello all, I\u0027ve been playing orbiter (link incoming!) \u003Ca href=\u0022http://orbit.medphys.ucl.ac.uk/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://orbit.medphys.ucl.ac.uk/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd in it there is this one mission, where you sling from Jupiter to Saturn.\u003C/p\u003E\u003Cp\u003EI went to play KSP to try and accomplish something near to that. I figured slinging from Eve to Duna would be a good start, because I didn\u0027t feel like slinging from Jool to Eeloo quite yet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo anyways, here yah go, my first slinging operation test:\u003C/p\u003E\u003Cp\u003EHere is a simple rocket I decided to use, basically an asparagus effect launch stage, and then a second stage with a nuclear engine and tons of droptanks on it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s2xVEyT.png\u0022 alt=\u0022s2xVEyT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, I used asparagus effect. Hate me. I haven\u0027t used it all that much, but I needed something to get me into orbit and then to escape velocity, so asparagus seemed the way to go.\u003C/p\u003E\u003Cp\u003EAnd after my first test, things didn\u0027t go so well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iVu4FZD.jpg\u0022 alt=\u0022iVu4FZD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe parachute even ripped off!\u003C/p\u003E\u003Cp\u003EOn my way up to orbit, I saw something sparkly, took nineteen screenshots of it, and got ONE back. I dunno what it is, but I have circled it, and a man with spaghetti in his mouth is clearly surprised by it as well. You may have to open it in a new tab to see the pixel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TQv8Ccw.png\u0022 alt=\u0022TQv8Ccw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI took a look around the map view to see if there was any debris, or possibly a passing space station that caused it, but instead, I found that Eve was in a perfect position to be seen.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tfFBv07.png\u0022 alt=\u0022tfFBv07.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cdn.meme.li/instances/400x/37774797.jpg\u0022 alt=\u002237774797.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter I got Eve and Kerbin into correct places for a transfer, I used up the rest of the mainsail to reach escape velocity, then jettisoned it. By the way, please never take out those shrouds around the nuclear engine, I love them to pieces (quiet literally).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IazfRLi.jpg\u0022 alt=\u0022IazfRLi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn my first correction burn, I noticed fuel was not draining from my tanks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oCarCNY.jpg\u0022 alt=\u0022oCarCNY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, so that\u0027s it. God damn that symmetry tool!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4mc6wIE.png\u0022 alt=\u00224mc6wIE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter successful getting an encounter that slinged me out to Duna, I decided to call it a day, because I had not aligned Duna for this. I just went for it, and I didn\u0027t have enough fuel to correct it. But anyways. That\u0027s that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bxi4WWZ.png\u0022 alt=\u0022Bxi4WWZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo yeah, I decided to show y\u0027all this for those of you that are looking for a new way to get to far out places (slinging from Jool to Eeloo?) it requires much less delta-V, plus I get a feeling of authenticity whenever I find new ways to go places. Plus, I\u0027ve always wanted to abuse planets for stuff like this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: Has anyone else seen those pixels in the sky sometimes? I see them a lot, just never snapped a good picture of \u0027em. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EPPS: The only mod used was chatterer (link incoming!) \u003Ca href=\u0022http://kerbalspaceprogram.com/chatterer/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/chatterer/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-17T21:21:19Z\u0022 title=\u002206/17/2013 09:21  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 17, 2013\u003C/time\u003E by Spaceisbeautifulul\u003C/strong\u003E\n\u003Cbr\u003EThose small things...\n\u003C/span\u003E\n"}]}