{"TopicId":33526,"ForumId":32,"TopicTitle":"The Mun Incident - a weekend of spectacular failures","CreatedByName":"cwm33","CreatedById":70852,"CreatedDateTime":"2013-06-17T22:34:38Z","PageNum":1,"Articles":[{"CreatedByName":"cwm33","CreatedById":70852,"CreatedDateTime":"2013-06-17T22:34:38Z","Content":"\n\u003Cp\u003EGrab some popcorn, pull up a chair and let me share with you the tail of my most current space administration, and why they\u0027re likely to get their government funding cut. This most current administration is running under the sciencey physics theories established by Ferram Aerospace Research, as well as a mechanical jeb for the purposes of overcoming pilot ineptitude (or adding to it, it would seem), as well as a few civilian industries providing new and innovative parts and wibbly bits to the space program.\u003C/p\u003E\u003Cp\u003EWhat\u0027s the first goal of the space program you say? Why it\u0027s the first goal of many a good and noble space administration, putting a satellite in orbit around Kerbin of course! The engineers are tasked with building a craft capable of the task using the tried and true Kerbal UDT development method. Not familiar with the UDT development method? Why it\u0027s the \u0022Ultra Destructive Testing\u0022 development method! It involves putting together a basic design which looks like it might have a decent chance off accomplishing it\u0027s goal with an unmanned control capsule, putting it on the launch pad, watching it explode before/after it tries to launch and then trying to make it not so explodey!\u003C/p\u003E\u003Cp\u003EWith the first space-worthy looking craft built, and manned with 3 bravel Kerbalnauts, we bravely launch skyward trusting in our autopilot not to bugger things up for us. Things are going well until all of a sudden out the window we see not the black emptyness of space, but land and ocean! What the bloody hell is going on? Did that twat Jebediah decide to take it off of autopilot so he could practice loop de loops? Nope still on auto pilot, and it seems like it\u0027s starting to point back skyward again we should be fi----- well there\u0027s more of that land and ocean stuff. Time to abort and have a few choice words with the engineering team. Herman the engineer in charge of aerodynamics had apparently slept through the class about Center of Mass and Center of Lift, and decided to cover that up with the old fashioned principle of \u0027put wings everywhere because they look spacey and awesome\u0027. In light of this discovery, he has been relegated to construction duty to help assemble the ships rather than buggering up the design process.\u003C/p\u003E\u003Cp\u003EWith the newest revision of the ship (now featuring less horribly placed wings!), blasting skywards without doing any fancy barrel rolls or loops things are actually looking quite successful! We make it up to a decent spot to do a circularization burn, and notice that the ascent hasn\u0027t put us up in a very favorable manner, and that we\u0027ll have to use a fair bit of fuel for the burn. That dingbat Herman must have been in charge of programming the ascent profile for the autopilot, that\u0027ll be on the list of things that need tweaking for our next adventure. Luckily the launch vehicle that was designed by the engineering team was created for much heavier loads than a simple satellite, so there was more than enough fuel to finish off the circularization burn. With the satellite successfully deployed, there was much celebrating, dancing and fireworks at the Space Center, along with a few small fires since one of the chaps decided that fireworks were best launched indoors.\u003C/p\u003E\u003Cp\u003EWith the first goal accomplished, the space administration sets its sights a little higher, and wants a satellite put in orbit around the moon! The design team is approached for a new rocket to meet these lofty goals, to which they tell us \u0022Just use the last one we made, now piss off we\u0027re on coffee break.\u0022 Reminder, put some mood elevators in the coffee grounds, those engineers are mighty grumpy. Well that craft was able to put a satellite in orbit around Kerbin, it should be just fine for the moon! It has plenty of stages, and big thrusty powered engines, and a final stage with that fancy nuclear engine for the long voyages. Off into the wild blue yonder we go! To the Mun! To glory!\u003C/p\u003E\u003Cp\u003EThe crew was able to make it to the Mun without even using the nuclear engines yet, fantastic! Spirits are high in the craft after the satellite is successfully deployed! one of the crewmen peeks out the window at the moon and since there is a bit of fuel left in the final thrusty rocket stages, suggests that \u0027hey I know we were just supposed to deploy a satellite and go home, but I wanna go down and bounce around!\u0027 The other crewmembers apparently don\u0027t see any problem with his idea, and radio back to Space Command to announce their intentions. Space command thinks it is a neat idea, and consults with the engineering team to make sure that the craft is landing capable. It does have landing legs on it, so that means it\u0027s a lander right? Well apparently someone gave the engineering team TOO many mood elevators, so after much gibbering, babbling and talk of nuclear thrust bunnies, command gives up and tells the crew to proceed at their own discretion. The crew discuss it, and decide that since none of them have ever actually landed on the moon before, they should entrust the autopilot to the task. The autopilot makes all sorts of humming and chirping noises, and has flashy lights and dials, so it should be just fine for the task! The crew pick a nice bright spot on the light side, and so begins the de-orbit burn. Things are looking good, so the optimistic crew puts down the landing struts and practice their moon-walks in the cabin. It gets to the point where the deceleration burn starts to kick in, and the last of the fuel goes through the big thrusty engine, and is then staged off for the nuclear engine. The crew watches out the window as the spent tank drifts towards the surface while they\u0027re decelerating towards the surface, until the empty tank crashes into the surface with a satisying kaboom!\u003C/p\u003E\u003Cp\u003EWith the crew now finished watching the lovely explodey fireworks, they notice that the deceleration burn is still happening, and hey look a shadow! We should be landing soo----....and thus ends their great voyage, they landed on the moon alright, but in a far more explodey fashion than they originally thought they would. Rest in peace brave brave foolish explorers. With their sacrifice in mind, the administration decides that the next goal should be to land on the moon, and plant a flag in honor of their bravery. After the design engineers have sobered up from their experience with the goofy juice to raise their morale, they make note that it was probably an awful idea to stage between a super high thrust engine to a wibbly little nuclear engine during a deceleration burn, and get to task building a new Munar lander better suited for the job. After a few test runs a new lander is ready to be crewed and sent to the Mun! \u003C/p\u003E\u003Cp\u003EAll thing go well for the brave crew of Jebediah, Bill, and one other chap. After some tweaking of the ascent profile during testing, the rocket makes it into orbit in a much more fuel efficient manner, and makes for Munar orbit. Deciding that the autopilot was clearly to blame, Jebediah takes the stick and decides to do the Mun landing himself! Everything is going well for the de-orbit burn, and Jebediah even accounts for the staging when doing his deceleration burn and begins it much earlier than the autopilot did. Everything is going well for the landing and the surface is coming into sight, and that\u0027s when they notice they\u0027re landing on a bit of a hill! Well Jebediah has been an excellent pilot so far, so they trust him to carry the day! Jeb manages to get two landing legs on the ground, which is unfortunate because there are indeed FOUR landing legs, so the craft is sitting precociously at a 45 degree angle. A valiant effort is made to put the craft down on all 4 legs, but things were said, errors were made, Kerbals did sneeze, and the craft wound up laying on its side. Bugger. Well that\u0027s no problem, the landing legs should be able to right it if they are retracted and put out again right? Drat, that did not work. I\u0027ll just use the RCS thrusters to try and boost that side into the air a litte bit....except...there are no RCS thrusters on the lander. Well double bugger. Then Bill notes that hey, the lander is pointed UP the hill, so if we thrust enough to get to the top of the hill we should be able to bring it back straight up. At this point they were a bit low on options, so gently gently they increase the throttle...everything looks to be dragging along nicely until KERBLAM! and the capsule begins just tumbling up the hill! Well they made it to the top of the hill alright, the only problem is that both their fuel tank and rocket engine have decided they don\u0027t like being dragged along the dirt and apparently have quite explosive tempers.\u003C/p\u003E\u003Cp\u003EWell the good news is, the crew has successfully---ish, landed on the mun! The bad news is, all that remains of their ship is a capsule and a parachute. Not letting this dampen his spirits, and the intent of the mission Jebediah EVAs and goes for a bounce on the Munar surface. He plants the flag, declaring their first Munar landing and heads back into the capsule. Jebediah being the flag planting hero that he is to the Space Program must be rescued from his current predicament on the moon! The Design Engineers are tasked with their biggest challenge yet, designing a rescue craft capable of hauling the piloting crew plus an additional 3 souls back form the Mun, with a wide enough landing base to not have another falling over incident, and to be quick about it damn you! The design engineers chose to use the same basic launch vehicle once again, because hey it has worked so far right? Then come up with a rather impressive looking rescue craft with wings extending out from the sides with landing struts on them to give it a larger footprint for landing. Great! Fantastic! Let\u0027s get to the moon and bring our boys home! We launch the rescue vehicle, and about 15,000m into the air, the rocket decides to do a loop-de-loop.....Herman! Damn you stay away from the rocket designs! Sigh, abort, and back into the VAB to swap out the wings for structural components to widen the footprint.\u003C/p\u003E\u003Cp\u003EA few launches later to get a half decent ascent profile (I\u0027ve now given up autopiloting the ascent and am doing it by hand now), we\u0027ve gotten our rescue craft to Munar orbit. The craft is a fair bit larger, but surely 4 nuclear engines should have enough thrust for a landing right? One more crater on the moon indicates to my Design Engineers that how I\u0027ve been landing is NOT nuclear engine friendly. 2 more Kerbals to go on to the wall of squashed heroes. Well one suggestion from the design engineers is to switch out 2 of the nuclears for other more thrusty rockets to help out with the braking process, makes sense to me! We take our updated design, toddle back to the Mun, and line up our landing....except the poor stranded crew is now on the DARK side of the moon, and I\u0027m noticing my lander lacking one distinct feature that might help out with a night landing.....lights! Bugger, well Jebediah being the national hero he is, must be brought home! Damn the risk! The ship is de-orbited for landing, everything seems to be going swimmingly until I notice one distinct problem, I can\u0027t see a bloody thing! The landing seemed like it was going well albeit dropping a little fast and then the rescue shuttle just suddenly exploded! I\u0027ve now decreed that monsters live on the dark side of the moon, and that crew was lost to monster attack, and NOT command incompetence. Another 2 more for the wall, ugh. \u003C/p\u003E\u003Cp\u003EThe heroes must be rescued! Another rescue shuttle is sent up (with lights!), back to Munar orbit, and luckily enough we have the landing site sitting in the daylight, so another landing approach is made. Hoping to keep further mishaps to a minimum, the autopilot is used to help keep the lander pointing in the right direction, while one of the crew fiddles the throttle. This was apparently a horrible idea, as just as I was about to touch down, the autopilot decided it\u0027s a good time to go HEY LETS GO THIS WAY! which results in 2 of the landing struts and structural components being sheared right off. Not to be deterred, the crew tries to stick the landing by setting it down on the engines. This seems to be going well until the engines touch the surface of the Mun, at which point 2 of the engines proceed to fall off and roll around on the ground.....oh right....I put Herman on assembly duty....that twit is SOOOOOO going to be a test pilot for awful horrible craft....Undeterred, the rescue crew want to try a test flight, because even with 2 engines, and structural components sheared off it should still fly right? That\u0027s the last that was ever heard from that brave crew, well another 2 more names for the wall of idio----errr...heroes.\u003C/p\u003E\u003Cp\u003EANOTHER rescue shuttle is sent up, this time under strict orders to stop buggering around with the controls, and to try out the landing autopilot again without any use of a big thrusty staging rocket at the first part. The target is set, a short jaunt away from where the poor heroes are sitting patiently waiting. The landing autopilot is set, the de-orbit and braking burns happen successfully, and by some small miracle the lander manages to make it to the surface undamaged! The crew and our poor stranded heroes are extatic! One by one they move from their capsule to the rescue craft, grinning all the while as they get to go home!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cwmftw.com/files/ksp/2013-06-16_00001.jpg\u0022 alt=\u00222013-06-16_00001.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rescue craft makes it back to Munar orbit and under the guiding masterful eye of Jebediah, he notes that while the rescue vehicle does have more than enough fuel to make it back to Kerbin, there wont be enough fuel to circularize the orbit and then do a de-orbit burn for the space center. It\u0027s going to be a one shot from the Mun home for a landing via aerobraking, and a whole lot of luck! After running a number of *ahem* simulations, Space Command tells the intrepid crew to hold off on their burn for one orbital circulation around the Mun or else they will wind up in a very wet landing location. Not wanting to get their shiny space suits wet, the team wait patiently, and then blast homeward bound! The maneuver is a resounding success! The rescue ship makes it back into Kerbin\u0027s atmosphere and turns all sorts of pretty red colors to indicate success or something like that! Parachutes deployed, and apart from landing on its side, and a few parts falling off upon landing the rescue craft makes landfall successfully! The brave and intrepid crew are dumbstruck at being able to see the beautiful verdant fields of Kerbin once more!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cwmftw.com/files/ksp/2013-06-16_00002.jpg\u0022 alt=\u00222013-06-16_00002.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo we leave our intrepid Kerbalnauts stuck relying on civilian options for getting home, or their feet perhaps? Heavens no, they\u0027re 1/3rd of the way around the globe from the space center, they must be brought home in style! A transport craft is quickly assembled and sent to pick up our brave Kerbals! The rescue jet arrives just in time, as the poor chaps are looking quite bored, hungry, and frankly quite ready to find that twat Herman and beat him senseless.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cwmftw.com/files/ksp/2013-06-17_00001.jpg\u0022 alt=\u00222013-06-17_00001.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a bit of a rough take-off, they\u0027re on their way home back to the Space Center! After a while and much ruckus in the crew compartment, we\u0027ve made it most of the way home, I check on the crew compartment count to check on the boys, and the count is sitting at 3/6, which is two less than what I was expecting. Well I\u0027m sure 2 of them are just off doing something during the count, pestering the pilot or some such. The pilot gets the transport plane lined up with the runway nicely and begins his descent. Things are looking well until the pilot notices that he\u0027s getting way too low, way too early and will touch ground before the start of the runway! \u0022Pffft no big deal\u0022 the pilot says, as he continues his path to land and then coast on to the stri----.....apparently mr. Pilot didn\u0027t notice that the landing strip is built up off the ground at that side, and wound up smacking his plane right into the berm of the landing strip. Thus ends the long and terrible journey of our brave Kerbalnauts, so close to home, yet so far away.\u003C/p\u003E\u003Cp\u003EThe space administration unanimously decides that a lander equivalent to that used by our poor 3 stranded heroes should be put up next to the tracking center as a memorial. The memorial craft is constructed under a wheeled vehicle to bring it to its final resting place, and launched to perform its duty. What do I see when I check in on the progress? Why it\u0027s two kerbals sitting in the vehicle grinning their heads off, two kerbals by the name Jebediah and Bill! The sneaky little Kerbalnauts must have gotten wind to how green the pilot was, and decided to \u0027go for a walk\u0027 before the pilot came in for a landing. Well the rescue operation may not have been a COMPLETE success, but at least it managed to bring home Jebediah and Bill!\u003C/p\u003E\u003Cp\u003EOh and I am now under \u0027administrative review\u0027, whatever that means.\u003C/p\u003E\u003Cp\u003EAnyway, such is my epic yarn, I hope you enjoyed it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-06-17T23:21:40Z","Content":"\n\u003Cp\u003EThis was freak\u0027n epic. Awesome story!!\u003C/p\u003E\n"}]}