{"TopicId":33568,"ForumId":35,"TopicTitle":"[WIN/MAC/LINUX] KSP Trajectory Optimization Tool v1.6.9 [New MATLAB Version!]","CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-06-18T04:59:31Z","PageNum":13,"Articles":[{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-19T01:45:48Z","Content":"\n\u003Cp\u003EI just downloaded this today and it looks absolutely amazing. I do have a few questions though:\u003C/p\u003E\u003Cp\u003E- Probably I am overlooking something, but how do you calculate a Kerbin - Munar trajectory? When I set Kerbin as central body I can only select the Mun and Minmus as starting bodies.\u003C/p\u003E\u003Cp\u003E- Is the trajectory always in the plane of the solar system rotation, and the ending orbit always equatorial? I tried to do a polar to polar transfer to save energy for a mapping satellite, but TOT seems to want to do a sideways transfer anyway. It is quite possible that that is the more efficient way to go, but I would like to end up with a polar orbit.\u003C/p\u003E\u003Cp\u003E- Is there any chance this will work with the Real Solar System mod? Or do I need to use NASA/ESA tools for that?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-19T04:34:20Z","Content":"\n\u003Cp\u003ESorry for all the questions, but I am trying to get a firm grip on matters. I hope you do not mind! \u003C/p\u003E\u003Cp\u003E- I found your \u003Ca href=\u0022http://orbiter-forum.com/showthread.php?t=19682\u0022 rel=\u0022external nofollow\u0022\u003EOrbiter TOT\u003C/a\u003E. Am I correct that that one should work with the Real Solar System mod?\u003C/p\u003E\u003Cp\u003E- The KSP TOT is giving me burn times. Am I right in thinking you need to assume a certain engine for burn times? Delta-V is the same for any vehicle, but I believe burn times are not.\u003C/p\u003E\u003Cp\u003E- Somewhat related, but not totally: I am thinking about learning to work with something like MatLab, but as someone starting a business I am concerned with running legal software and costs. Therefore, I am considering using Octave instead of MatLab, as I read that they are very similar and Octave is free. Do you see any major objections to this and what do you think about this?\u003C/p\u003E\u003Cp\u003EFinally, I think I have found a \u0027bug\u0027. When generating a report, the transfer orbit is displayed in white on a white background, making it seem missing. Just a small detail.\u003C/p\u003E\u003Cp\u003EThanks for all the great work, it all looks and works very nicely!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-20T11:12:58Z\u0022 title=\u002212/20/2013 11:12  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 20, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pulsar","CreatedById":83347,"CreatedDateTime":"2013-12-19T15:01:30Z","Content":"\n\u003Cp\u003EThe program looks good, but I can\u0027t run it and got \u0022error in mclfreestacktrace\u0022\u003C/p\u003E\n"},{"CreatedByName":"Jobin","CreatedById":34504,"CreatedDateTime":"2013-12-19T15:03:27Z","Content":"\n\u003Cp\u003EIs it possible to get an intercept without a mid-course correction using this? I\u0027ve found that I always have to play around with the timing of the burn to get the closest approach below 1 Gm. Just want to make sure I\u0027m doing it right. Made sure to plug in all the values Kerbal Engineer is giving me to the nearest certain decimal and was also sure to use the Argument of Periapse (Kerbal Engineer gives Longitude). I\u0027m wondering what others\u0027 results are using this.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-12-19T16:46:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pulsar\u0022 data-cite=\u0022Pulsar\u0022\u003E\u003Cdiv\u003EThe program looks good, but I can\u0027t run it and got \u0022error in mclfreestacktrace\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you try either the v 0.11 pre release (#2) or the debug build I put up a week ago in this thread? Some one else just had this issue and the debug version worked for them.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-12-19T16:47:47Z","Content":"\n\u003Cp\u003EI will answer everyone else soon as I can tonight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-12-19T18:29:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- Somewhat related, but not totally: I am thinking about learning to work with something like MatLab, but as someone starting a bussiness I am concerned with running legal software and costs. Therefore, I am considering using Octave instead of MatLab, as I read that they are very similar and Octave is free. Do you see any major objections to this and what do you think about this?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOctave is a volunteer-maintained open-source attempt to mostly clone the Matlab scripting language. It has almost identical syntax and is designed to allow simple Matlab .m scripts and functions to work with a minimum of changes. It has a lot of deficiencies though: it doesn\u0027t have replacements for many of the toolboxes (notably Simulink), there\u0027s no official GUI, they don\u0027t yet support the revamped object-oriented programming style that Matlab implemented over 5 years ago, etc. Unless you are really attached to Matlab for any reason, I\u0027d say you should avoid Octave. There are better options for free open-source technical computing and general-purpose programming languages. Have a look at either Julia or Python.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-12-20T06:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003ECan this be used to plot a transfer orbit for any time instead of having to wait for the optimal transfer window? I went to Duna and overdid it plenty on the fuel capacity. It has one orange tank and four FL-T800 tanks of fuel it won\u0027t need to tap at all for the return. The four orange tanks and four engines on them will be enough for the optimum return. Tested that in an experimenting save.\u003Cp\u003ESo I\u0027d love to hurry up the return instead of having the crew twiddle their thumbs for almost 150 more days. Once the return boost stage is tapped out, the ship has a Skipper and four LV-T30 engines to slow down to get into an orbit around Kerbin. Doesn\u0027t need to be a particularly good orbit as I have many ways to refuel or just dock a tank to the top of the lander like I did to get back from my very first non-crashing or completely missing the moon Mun trip. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it can. Generate a porkchop plot for the departure and arrival body you desire. Click the compute departure button. Enter the departure time you want (from KSP/MechJeb/whatever). I think I have a button which finds the optimal arrival time for a given departure, so you can use that if you want. Push go and viola, transfer orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Let me know how it works for you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI just downloaded this today and it looks absolutely amazing. I do have a few questions though:\u003Cp\u003E- Probably I am overlooking something, but how do you calculate a Kerbin - Munar trajectory? When I set Kerbin as central body I can only select the Mun and Minmus as starting bodies.\u003C/p\u003E\u003Cp\u003E- Is the trajectory always in the plane of the solar system rotation, and the ending orbit always equatorial? I tried to do a polar to polar transfer to save energy for a mapping satellite, but TOT seems to want to do a sideways transfer anyway. It is quite possible that that is the more efficient way to go, but I would like to end up with a polar orbit.\u003C/p\u003E\u003Cp\u003E- Is there any chance this will work with the Real Solar System mod? Or do I need to use NASA/ESA tools for that?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1) Use the Rendezvous planner to go from a Kerbin orbit to the Mun. Since you never technically leave Kerbin\u0027s SOI (the Mun also being within Kerbin\u0027s SOI), you can\u0027t use the normal techniques as they require a departure from the SOI.\u003C/p\u003E\u003Cp\u003E2) No, the trajectory is not constrained to any plan. However, it happens that those trajectories which do not leave the plane of the solar system are, in general, more efficient, and this is what TOT finds. If you want to enter a polar orbit around a body, use an \u0022equatorial\u0022 solar transfer orbit, then just adjust your orbit to polar by burning normal to the orbital plane as soon as you enter the SOI.\u003C/p\u003E\u003Cp\u003E3) It can work with Real Solar System, but you\u0027d have to generate the bodies.ini file. Maybe I\u0027ll write some code to get the celestial bodies from KSP using the new KSPTOT Connect plugin and have it auto-generate this file... but not for a while. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003ESorry for all the questions, but I am trying to get a firm grip on matters. I hope you do not mind! \u003Cp\u003E- I found your \u003Ca href=\u0022http://orbiter-forum.com/showthread.php?t=19682\u0022 rel=\u0022external nofollow\u0022\u003EOrbiter TOT\u003C/a\u003E. Am I correct that that one should work with the Real Solar System mod?\u003C/p\u003E\u003Cp\u003E- The KSP TOT is giving me burn times. Am I right in thinking you need to assume a certain engine for burn times? Delta-V is the same for any vehicle, but I believe burn times are not.\u003C/p\u003E\u003Cp\u003E- Somewhat related, but not totally: I am thinking about learning to work with something like MatLab, but as someone starting a bussiness I am concerned with running legal software and costs. Therefore, I am considering using Octave instead of MatLab, as I read that they are very similar and Octave is free. Do you see any major objections to this and what do you think about this?\u003C/p\u003E\u003Cp\u003EFinally, I think I have found a \u0027bug\u0027. When generating a report, the transfer orbit is displayed in white on a white background, making it seem missing. Just a small detail.\u003C/p\u003E\u003Cp\u003EThanks for all the great work, it all looks and works very nicely!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI definitely don\u0027t mind questions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E1) It should, but no promises, as I don\u0027t know how real solar system is set up. If the planets are in the wrong place at the wrong time, then it won\u0027t work.\u003C/p\u003E\u003Cp\u003E2) The burn times it\u0027s giving you might be either UT times or time past perigee times. Can you give me an example so I can clarify? Screenshots welcome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E3) Will respond to this below.\u003C/p\u003E\u003Cp\u003E4) Can you take a screenshot for me? Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jobin\u0022 data-cite=\u0022Jobin\u0022\u003E\u003Cdiv\u003EIs it possible to get an intercept without a mid-course correction using this? I\u0027ve found that I always have to play around with the timing of the burn to get the closest approach below 1 Gm. Just want to make sure I\u0027m doing it right. Made sure to plug in all the values Kerbal Engineer is giving me to the nearest certain decimal and was also sure to use the Argument of Periapse (Kerbal Engineer gives Longitude). I\u0027m wondering what others\u0027 results are using this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn theory yes. In practice, no. My code makes a few assumptions which are very very good, but not perfect. Some tweaking of departure burns (a few seconds up or down, or a few m/s prograde dv up or down) should be all you need to hit your target. Let me know if you have trouble.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tavert\u0022 data-cite=\u0022tavert\u0022\u003E\u003Cdiv\u003EOctave is a volunteer-maintained open-source attempt to mostly clone the Matlab scripting language. It has almost identical syntax and is designed to allow simple Matlab .m scripts and functions to work with a minimum of changes. It has a lot of deficiencies though: it doesn\u0027t have replacements for many of the toolboxes (notably Simulink), there\u0027s no official GUI, they don\u0027t yet support the revamped object-oriented programming style that Matlab implemented over 5 years ago, etc. Unless you are really attached to Matlab for any reason, I\u0027d say you should avoid Octave. There are better options for free open-source technical computing and general-purpose programming languages. Have a look at either Julia or Python.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would also avoid Octave. Python is great and there are lots of nice numerical and plotting packages for it. Never heard of Julia until today, but it looks fine too. My recommendation is Python, but explore both options. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBit of a note: So my GPU on this laptop is basically dead, so running KSP is a no-go. I\u0027m still going to get some code created, but everything\u0027s on hold until first week of January. I\u0027ll get something nice and shiny out then. In the mean time, please keep playing with the pre-release #2 and let me know how it works for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If someone wants to try and connect two computers and get TM on both of them from the same KSP session, that would be awesome...\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-20T21:09:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1) It should, but no promises, as I don\u0027t know how real solar system is set up. If the planets are in the wrong place at the wrong time, then it won\u0027t work.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe there was an issue with that, but it is also supposed to be or get fixed soon. The planets should be fine in respect to each other, it is just that the starting time or Earth rotation is not totally right.\u003C/p\u003E\u003Cp\u003EI am also looking into using NASA\u0027s GMAT, but it will be some time before I have enough grasp on it to make it useful. Although I do not fully understand it yet, your application does not seem to have a steep learning curve. Very nice!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2) The burn times it\u0027s giving you might be either UT times or time past perigee times. Can you give me an example so I can clarify? Screenshots welcome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003E4) Can you take a screenshot for me? Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will, when I have reinstalled Windows on my gaming rig. Currently internet access and KSP are physically seperated, making things like uploading a screenshot a bit of a chore.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-12-20T21:35:39Z","Content":"\n\u003Cp\u003EFYI: For v6 of RSS I plan to do as asmi suggested and borrow Orbiter\u0027s orbital info (right now it\u0027s a bit inconsistent, grabbed from wiki and other places), so RSS darn well better have the same stats as Orbiter. Now, KSP doesn\u0027t do \u0026gt;1-body gravity so things will be a little bit wonky, but pretty close I think.\u003C/p\u003E\u003Cp\u003E(Also, of course, KSP doesn\u0027t support axial tilt. But that shouldn\u0027t matter except for launch and landing.)\u003C/p\u003E\n"},{"CreatedByName":"airaria","CreatedById":97881,"CreatedDateTime":"2013-12-21T09:57:00Z","Content":"\n\u003Cp\u003EI\u0027m a little confused with Rendezvous Maneuver Sequencer..\u003C/p\u003E\u003Cp\u003EHow does it know my craft\u0027s and target\u0027s current positions? Is the position calculated from mean anomaly and epoch? \u003C/p\u003E\u003Cp\u003EI\u0027ve checked wiki, but I\u0027m not sure about my understanding about mean anomaly and epoch...\u003C/p\u003E\u003Cp\u003EBesides, I may have found a bug:\u003C/p\u003E\u003Cp\u003EAfter loading a SFS file in the Rendezvous Maneuver Sequencer, the Mean Anomaly and Epoch doesn\u0027t change!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-21T11:34:50Z\u0022 title=\u002212/21/2013 11:34  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 21, 2013\u003C/time\u003E by airaria\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-12-28T04:57:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI will, when I have reinstalled Windows on my gaming rig. Currently internet access and KSP are physically seperated, making things like uploading a screenshot a bit of a chore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, thanks. Let me know when you are able.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022airaria\u0022 data-cite=\u0022airaria\u0022\u003E\u003Cdiv\u003EI\u0027m a little confused with Rendezvous Maneuver Sequencer..\u003Cp\u003EHow does it know my craft\u0027s and target\u0027s current positions? Is the position calculated from mean anomaly and epoch? \u003C/p\u003E\u003Cp\u003EI\u0027ve checked wiki, but I\u0027m not sure about my understanding about mean anomaly and epoch...\u003C/p\u003E\u003Cp\u003EBesides, I may have found a bug:\u003C/p\u003E\u003Cp\u003EAfter loading a SFS file in the Rendezvous Maneuver Sequencer, the Mean Anomaly and Epoch doesn\u0027t change!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPosition is calculated from mean anomaly and epoch, yes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll take a look at the bug when I get home from vacation, thanks for the report.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-01-03T02:30:33Z","Content":"\n\u003Cp\u003EThis doesn\u0027t seem to work on Windows 8. (Pro 64-bit here). \u0022Could not find version 8.1 of the MCR.\u0022\u003C/p\u003E\u003Cp\u003EI have installed both the 32-bit and 64-bit R2013a (8.1) MCRs - originally just the 32-bit one (as that worked just fine in Windows 7 64-bit) but tried the 64-bit as well, for lack of anything else to try.\u003C/p\u003E\u003Cp\u003EAnyone have a solution?\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-03T07:08:56Z","Content":"\n\u003Cp\u003EI\u0027ve not seen this before. Are you running the KSPTOT application as an administrator? Does it work with just the 32-bit MCR on Windows 7? \u003C/p\u003E\u003Cp\u003EI don\u0027t have Windows 8 so I can\u0027t really test, but I can try to troubleshoot as best I can...\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-01-03T07:17:30Z","Content":"\n\u003Cp\u003EYes, I\u0027ve tried running as admin, and there was no difference. It \u003Cem\u003Edid\u003C/em\u003E work on Windows 7 with the 32-bit MCR.\u003C/p\u003E\u003Cp\u003EI think the MCR is failing to install properly... if I do a search for the DLL nothing is coming up at all on my disk.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-03T07:18:36Z","Content":"\n\u003Cp\u003EThat could very well be. Can you run the 32-bit installer as administrator? How about looking in the start menu afterwards, do you see a menu folder for the MCR?\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-01-03T08:49:13Z","Content":"\n\u003Cp\u003EDown the rabbit hole I went... seems I needed to manually start the Windows Installer Module, for some reason. Once done...\u003C/p\u003E\u003Cp\u003E\u0022Product: Microsoft Visual C\u002B\u002B 2008 Redistributable - x86 9.0.30729.6161. The assembly \u0027policy.9.0.Microsoft.VC90.CRT,version=\u00229.0.30729.6161\u0022,publicKeyToken=\u00221fc8b3b9a1e18e3b\u0022,processorArchitecture=\u0022x86\u0022,type=\u0022win32-policy\u0022\u0027 for component \u0027{B4606FC1-ADD6-3F4C-B9A7-BEA4CE07951E}\u0027 is in use. You must restart to update the assembly.\u0022\u003C/p\u003E\u003Cp\u003EThis dependency is not fully installing because of some pending windows updates... doh! I should be fine once I reboot and let those updates do their thing. The MCR installer was just... closing, with zero feedback - I had to dig around in the windows event viewer to spot this.\u003C/p\u003E\u003Cp\u003E(got a backup restoration running for several days, had a system failure recently and part of my picking up the pieces was getting KSPTOT working again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Only another 10 hours left and I can safely reboot... 100gb of data takes a bit of time to move via the internet.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-03T08:53:05Z\u0022 title=\u002201/03/2014 08:53  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 3, 2014\u003C/time\u003E by draeath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-03T18:00:36Z","Content":"\n\u003Cp\u003ESounds good. Please let me know when you get it working. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-01-04T07:43:03Z","Content":"\n\u003Cp\u003EIs it normal for the flyby maneuver sequencer to take a very long time? It\u0027s been about two minutes and it\u0027s at about 10%.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-01-05T00:06:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003ESounds good. Please let me know when you get it working. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, all good. Turns out the installer wasn\u0027t even running, it was dying before showing the UI. I had just assumed the winzip self extractor was doing all the work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs I had thought, rebooting such that the VB Runtime could actually exit with a good status code allowed it to continue on it\u0027s merry way.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-05T00:37:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003EIs it normal for the flyby maneuver sequencer to take a very long time? It\u0027s been about two minutes and it\u0027s at about 10%.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep. It\u0027s a very computationally intensive operation. You should expect it to take anywhere from 3-10 minutes to complete. Please remember that when the real engineers do this kind of thing, they take days to look for good solutions. A few minutes here for a decent approximation isn\u0027t unreasonable. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022draeath\u0022 data-cite=\u0022draeath\u0022\u003E\u003Cdiv\u003EYep, all good. Turns out the installer wasn\u0027t even running, it was dying before showing the UI. I had just assumed the winzip self extractor was doing all the work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EAs I had thought, rebooting such that the VB Runtime could actually exit with a good status code allowed it to continue on it\u0027s merry way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcellent, so it\u0027s all working?\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-05T00:44:40Z","Content":"\n\u003Cp\u003ESo good news, everyone! I have a new build of KSPTOT cooking that includes major changes to the real time MCC code. Basically I\u0027ve done the following since the last test build:\u003C/p\u003E\u003Cp\u003E1) Added the Power/Thermal and Propulsion consoles\u003C/p\u003E\u003Cp\u003E2) Allowed the KSPTOT Connect server to handle multiple connections\u003C/p\u003E\u003Cp\u003E3) Updated the way connecting/disconnecting works on the KSPTOT (matlab) side works\u003C/p\u003E\u003Cp\u003E4) Begun planning for a Simulations console that will allow crafty MCCers to throw in failures/problems that the \u0022mission controllers\u0022 can then help handle. (Note: not yet implemented or even put down on paper yet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E5) \u003Cstrong\u003EVerified that I can connect my desktop\u0027s KSP session with my laptop\u0027s build of KSPTOT MCC.\u003C/strong\u003E It\u0027s pretty cool to see your orbit update from across the room! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKnown issues:\u003C/p\u003E\u003Cp\u003E1) Connecting a second client (and probably more) doesn\u0027t always connect right away. Just reconnect and it\u0027ll work fine.\u003C/p\u003E\u003Cp\u003E2) Lots of write failures in the KSPTOT Connect log when disconnecting. Doesn\u0027t hurt anything though.\u003C/p\u003E\u003Cp\u003E3) General lack of testing with connections other than locally (same PC) and across a network (192.168.0.*).\u003C/p\u003E\u003Cp\u003EI\u0027ll have a test build out this evening, I think. If someone could give it a run and see how it works, that\u0027d be cool. If it looks good, I\u0027ll call this KSP TOT 0.11 and start moving on to 0.12, which will have that Simulations console I mentioned above.\u003C/p\u003E\u003Cp\u003EHow does that sound? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bk2w","CreatedById":99893,"CreatedDateTime":"2014-01-05T01:08:42Z","Content":"\n\u003Cp\u003EArrowstar,\u003C/p\u003E\u003Cp\u003EThanks for making such an awesome tool! It definitely feeds my engineering-side to find elegant solutions.\u003C/p\u003E\u003Cp\u003EHowever, since I play on a Mac, I got tired of running a Windows VM just for this awesomeness. I\u0027ve managed to take the 0.10 source code and compiled a stand-alone application that I can run on my 64-bit OS X machines. I\u0027d like to share it out, if you\u0027d be willing.\u003C/p\u003E\u003Cp\u003EI\u0027d love to help get your 0.11 working on OS X, as well. The KSPTOT Connect sounds \u003Cstrong\u003Every\u003C/strong\u003E interesting.\u003C/p\u003E\u003Cp\u003E-Brian\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-05T01:19:08Z","Content":"\n\u003Cp\u003EHi there bk2w,\u003C/p\u003E\u003Cp\u003EInteresting proposition. Are you just using a Mac version of MATLAB 2013a and using the Matlab compiler? I\u0027d be interested in hearing the process you\u0027re using.\u003C/p\u003E\u003Cp\u003EOnce I know that, then I suspect I\u0027d be interested, yes. I would just have to know that you\u0027d be willing to support the Mac builds (only w.r.t. problems arising directly from building/using the software on a Mac, which it is not designed for at the moment). I\u0027d also need you to perform your own independent testing of the software on Mac, as I don\u0027t have a Mac to test it on.\u003C/p\u003E\n"},{"CreatedByName":"bk2w","CreatedById":99893,"CreatedDateTime":"2014-01-05T02:03:57Z","Content":"\n\u003Cp\u003EArrow,\u003C/p\u003E\u003Cp\u003EI used R2013a running on OSX 10.8.5. \u0027deploytool\u0027 targeting a Standalone Application with projectMain.m as the Main File, everything in src/ as Shared Resources. The biggest hurdle is that the Lambert Arc solver (lambert.mexw32) you have in the source directories was compiled for Win32, and not usable on a Mac. I kept running into problems where Matlab would tap the Map Toolbox instead, getting very confused. I grabbed what I believe is the same source code (\u003Ca href=\u0022http://www.mathworks.com/matlabcentral/fileexchange/26348-robust-solver-for-lamberts-orbital-boundary-value-problem\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.mathworks.com/matlabcentral/fileexchange/26348-robust-solver-for-lamberts-orbital-boundary-value-problem\u003C/a\u003E) and compiled it into a lambert.mexmaci64 that seems to work with TOT. End result is a script and executable that sure looks like KPSTOT on Windows. The script is needed to set environment variables that point to MCR, which is a bit awkward, but all the functionality of the tool seems to be working as I\u0027d expect.\u003C/p\u003E\u003Cp\u003EI\u0027m happy to help out with testing as my time allows. I\u0027m a software/hardware engineer by training and I\u0027ve used Matlab quite a bit through work for modeling and exploring demodulation schemes, error correcting codes, and DSP chains. Don\u0027t have much background with orbital mechanics, sadly, but KSP is so much fun that it\u0027s making me learn like crazy.\u003C/p\u003E\u003Cp\u003E-Brian\u003C/p\u003E\n"}]}