{"TopicId":33683,"ForumId":21,"TopicTitle":"Mobile Operations Centre","CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-06-18T22:52:32Z","PageNum":1,"Articles":[{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-06-18T22:52:32Z","Content":"\n\u003Cp\u003EI plan to stick this on a rocket and fly it to Duna tomorrow. Oh yes.\u003C/p\u003E\u003Cp\u003EThe Goddard Engineering Intrepid T-50 Mobile Operations Centre is a vehicle capable of carrying eight Kerbals [more if extra seats], and speeds of up to 23.8m/s. It is fully lit inside, carries a rooftop communications array, and is reasonably stable during turns. Can also be driven using a probe core at its heart. It is recommended not to attempt piloting the vehicle from the capsules - testing revealed that the controls reverse.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E4WGsSl.png\u0022 alt=\u0022E4WGsSl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WRPwU5B.png\u0022 alt=\u0022WRPwU5B.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/euHThI2.png\u0022 alt=\u0022euHThI2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/snQQlEi.png\u0022 alt=\u0022snQQlEi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ktBYWux.png\u0022 alt=\u0022ktBYWux.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8nvpVeH.png\u0022 alt=\u00228nvpVeH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDownload:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.2shared.com/file/oDxx6b1D/Mobile_Operations_Centre.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.2shared.com/file/oDxx6b1D/Mobile_Operations_Centre.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Procyon","CreatedById":57510,"CreatedDateTime":"2013-06-18T23:46:28Z","Content":"\n\u003Cp\u003Ethat\u0027s great. A motorhome for space. you gotta let us know how the launch goes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-18T23:53:42Z","Content":"\n\u003Cp\u003EWow, impressive looking, and as Procyon said you have to tell us how well it launches with pics of your launchers please!\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-06-19T00:51:21Z","Content":"\n\u003Cp\u003EI\u0027ll probably put it on the same launcher that I use to put Duna transfer vehicles into orbit. I call it the Echo stack.\u003C/p\u003E\u003Cp\u003EOnce the vehicle is in orbit, I\u0027ll swap out the insertion stage for my interplanetary stage - effectively just an RCS tank, a single Jumbo-64 fuel tank with two NTRs, and a probe core with a Senior docking port on top. The mission will, like all previous Duneshot missions, use Munar slingshots to make the transfer to Duna. Munar slingshots, I find, are incredibly useful - I can send a Jumbo-64 tank to Duna using a sixth of its fuel that way.\u003C/p\u003E\u003Cp\u003EI may also add a lander platform for the MOC, fitted with drogues, chutes and retro engines so that I don\u0027t have to put any of those on the vehicle itself. Aesthetics, not to mention shelter would be lost if panels got ripped off on descent by overzealous parachutes.\u003C/p\u003E\u003Cp\u003EThis reminds me, I need to build a VTOL object carrier for Duna. The Lilith spaceplane doesn\u0027t cut it. It\u0027s too heavy with too little lift. Landing it with parachutes next to the Pyramid Anomaly to act as a beacon for the base modules, I still lost one of its LV-45 engines, and it was certainly a hairy touchdown.\u003C/p\u003E\n"}]}