{"TopicId":33827,"ForumId":21,"TopicTitle":"\u0026quot;Extraplanetary Launchpad\u0026quot; Mod - Show us your delivery vehicle!","CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-06-19T19:08:44Z","PageNum":1,"Articles":[{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-06-19T19:08:44Z","Content":"\n\u003Cp\u003EAt present, the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/35217-0-20-x-Extraplanetary-Launchpads-v1-1-v2-alpha\u0022 rel=\u0022external nofollow\u0022\u003Emobile launchpad and runwa\u003C/a\u003Ey are an unwieldy thing to haul across space. This is causing me a bit of headache regarding the most efficient way of getting the thing landed.\u003C/p\u003E\u003Cp\u003EAt the moment, I have two large tanks radially attached with decouplers to the upright parts of the launchpad, with poodles beneath them for re-entry and suicide burn. Basically, the who thing looks like a massive cock and balls coming in for landing. After touchdown, the two tanks are decoupled and fly off to their doom. But this is amateurish, so...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe challenge:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe launchpad and runway have no top attachment node, making a skycrane drop method difficult.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThey aren\u0027t exactly the impact resistant either, so they need a soft landing.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThey are large and linear, meaning that need fairly flat bit of ground.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe launchpad doesn\u0027t handle radial attachments very well, making landing struts difficult/ugly to attach.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHow are people handling this? Would love to see some designs.\u003C/p\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-06-19T20:06:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003E\u003Cul\u003E\u003Cli\u003EThe launchpad and runway have no top attachment node, making a skycrane drop method difficult.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFalse. The launchpad does have a top attachment node.\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2013-06-21T18:57:48Z","Content":"\n\u003Cp\u003Eit does have a top node, yes... but personally I find it next to useless.. decouplers don\u0027t seem to \u0022stick\u0022 very well, and the bits left over from support struts stay up there when you open it up. I wound up just sticking it on top of a big-ass rocket, myself.\u003C/p\u003E\n"},{"CreatedByName":"Srilania","CreatedById":70829,"CreatedDateTime":"2013-06-22T03:00:43Z","Content":"\n\u003Cp\u003Ethere is a top attach point, but for some reason, it gets wild and very unstable trying to attach anything up there like that.\u003C/p\u003E\n"}]}