{"TopicId":33925,"ForumId":51,"TopicTitle":"My First Rover on the Mun!","CreatedByName":"digtron","CreatedById":71565,"CreatedDateTime":"2013-06-20T07:30:04Z","PageNum":1,"Articles":[{"CreatedByName":"digtron","CreatedById":71565,"CreatedDateTime":"2013-06-20T07:30:04Z","Content":"\n\u003Cp\u003EI started off my mission to get a rover on the Mun by first just trying to get a rover that worked well, so i made a spaceship with which I could easily detach the rover and hop onto it so I could drive it around to see how fast it could go, how well it could turn, and how easily it flipped over. After many failed attempts I finally came up with a design I was happy with (picture of it at the end). I then loaded my normal Mun lander ship and made a few adjustments that included taking off the lander and a few other unnecessary parts, and then attaching the rover to the top. This is the part where I messed up a lot and could have avoided a lot of failures with some simple testing. For my first attempt I did a sky crane type approach with 6 of the smallest orange engines. Unfortunately this ended up with my rover smashing into the Mun at 600 m/s as they were not nearly powerful enough and I didn\u0027t have nearly enough fuel. After a couple more failed attempts to land the rover (after each time having flown to the Mun to find out they didn\u0027t work rather than just first testing them on Kerbin), I finally came up with and successfully tested a sky crane for my rover on Kerbin. I set off with this new design and landed on the Mun with minimal fuel to spare. I had no intention for this mission to include any return trips so the lack of fuel was a bit concerning when landing, but after landing it didn\u0027t matter to me. The second part of my mission was to meet up with my first Mun landing which had yet to make it\u0027s return trip to Kerbin as it was intended to do (this isn\u0027t actually my first Mun landing but it was on this game save). My recently landed Kerbal, Edvin, boarded the rover and set off to drive the 20km that separated him from his brother, Bob Kerman. Unfortunately, after only about 300m, Edvin flipped the rover after getting a lit too happy with his driving experience, he had hit a bump and it sent the speeding vehicle into a barrel roll which ended up in the rover being overturned. Fortunately, despite Kerbals evolutionary disadvantage due to short stubby hands that rendered the option of overturning the vehicle by hand useless, he managed to wedge himself under the vehicle to flip it upright again. From there Edvin took precautions by limiting his speed to around 10 m/s and after about 45 minutes, finally arrived met up with Bob at the site of the first Mun landing. Together at last, they celebrated.\u003C/p\u003E\u003Cp\u003EA picture of the final setup for the rocket that got the rover to the Mun. (Explanation of setup below picture)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i530.photobucket.com/albums/dd345/digger514/screenshot34_zpsa9c14b78.png\u0022 alt=\u0022screenshot34_zpsa9c14b78.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis rocket has 4 primary stages. The first stage which gets the rocket out of the Earth\u0027s atmosphere are the 6 engines around the middle of the rocket which each have 3 fuel tanks. After that burns out I am just getting out of the atmosphere so I decouple the first stage and the start at a 45 degree angle with the second stage which is the single engine in the middle of the rocket with 4 engines. This part of the rocket gets me into a stable orbit around Kerbin and then some, but the third stage is what really gets me there. The second stage decouples and then the third stage powers on which consists of the two smaller engines at the top sides of the rocket attached to the rover. This will help me to finish off getting a trajectory to the Mun and then also slow me down enough to safely land. The fourth stage of the rocket is the sky crane type part which is where the third stage of the rocket hovers just over the ground with enough thrust to just keep the height. I then activate the fourth stage which decouples the third stage rockets where upon the rover falls softly to the surface of the Mun and the two engines, now with a lot less weight to carry, blast off into the air to crash land elsewhere on the surface of the Mun.\u003C/p\u003E\u003Cp\u003EA picture of Bob Kerman standing proudly atop the First Mun Lander which he piloted.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i530.photobucket.com/albums/dd345/digger514/KerbalonMunLanderWKerbinBackdrop_zps4399adfd.png\u0022 alt=\u0022KerbalonMunLanderWKerbinBackdrop_zps4399adfd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA side picture of Edvin driving the Rover and a steady pace across the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i530.photobucket.com/albums/dd345/digger514/SideshotofKerbalDrivingMunRover_zpsdecf0f9c.png\u0022 alt=\u0022SideshotofKerbalDrivingMunRover_zpsdecf0f9c.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA picture of Edvin Kerman recklessly driving the Rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i530.photobucket.com/albums/dd345/digger514/CrazyKerbalonMunRover_zps423cc8e7.png\u0022 alt=\u0022CrazyKerbalonMunRover_zps423cc8e7.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-20T23:24:57Z\u0022 title=\u002206/20/2013 11:24  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 20, 2013\u003C/time\u003E by digtron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2013-06-20T16:26:31Z","Content":"\n\u003Cp\u003ENice work! Congrats on the landing and rendezvous! Do you have a picture of the final setup that got the rover to the Mun?\u003C/p\u003E\n"},{"CreatedByName":"Mcxenongamer","CreatedById":62994,"CreatedDateTime":"2013-06-20T16:48:41Z","Content":"\n\u003Cp\u003ENice work better than I could ever do.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"digtron","CreatedById":71565,"CreatedDateTime":"2013-06-20T23:25:27Z","Content":"\n\u003Cp\u003EAdded a picture of it as well as a basic description of the staging.\u003C/p\u003E\n"}]}