{"TopicId":34109,"ForumId":16,"TopicTitle":"How to Stack Damned Robotics Parts?","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-21T14:02:59Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-21T14:02:59Z","Content":"\n\u003Cp\u003EI\u0027m a fireman in real life so I want to make a firetruck, complete with telescoping aerial ladder, to have sitting beside the Launchpad just in case. I\u0027m using the unofficial version of Damned Robotics that works with 0.20. So I put the Rototron on the bed of the truck to aim the ladder in any direction, a hinge on top of the Rototron to raise the ladder, and several hydraulic cylinders stacked on top of the hinge to extend the ladder. Basically, exactly the same arrangement used in real life.\u003C/p\u003E\u003Cp\u003EProblem is, it doesn\u0027t work. All the parts stacked atop the Rototron act like Rototrons instead of what they really are. All of them rotate about the vertical axis instead of doing what they\u0027re supposed to do. In fact, if I put them all in direct contact with each other, only the Rototron on the bottom of the stack shows up on the servo list. If I put small girders or something between the pieces, each piece shows up on the servo list but they all still act like Rototrons.\u003C/p\u003E\u003Cp\u003EAny ideas on how to work around this? Thanks.\u003C/p\u003E\n"},{"CreatedByName":"zanzibar196","CreatedById":67228,"CreatedDateTime":"2013-06-22T00:29:25Z","Content":"\n\u003Cp\u003EAsk this in the thread about this mod... How to? Is for stock KSP...\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-22T03:58:26Z","Content":"\n\u003Cp\u003EWell, I figured it out on my own anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-06-22T05:22:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWell, I figured it out on my own anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe you could tell us?\u003C/p\u003E\n"}]}