{"TopicId":34291,"ForumId":25,"TopicTitle":"Ultimate Kerbal Tank Challenge","CreatedByName":"treesniper12","CreatedById":71673,"CreatedDateTime":"2013-06-22T15:50:28Z","PageNum":1,"Articles":[{"CreatedByName":"treesniper12","CreatedById":71673,"CreatedDateTime":"2013-06-22T15:50:28Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E In this challenge you have to make a tank (DUH) and run it through multiple tests depending on how good it does i will score it. Here are the tests, Requirements and Achievements\u003C/span\u003E \u003C/p\u003E\u003Cp\u003ERequirements 1. Stock only. 2. Must Be able to fire a missile. 3. A kerbal must be able to get in and out of the tank without bugs. 4. Bugs are allowed (accept for making a kerbal glitch out of the tank) like using a active winglet as a missile 5. Must be able to move \u003C/p\u003E\u003Cp\u003ETests Test 1. Time how long it takes for it to get from the start of the runway to the end of the runway (best three times get \u002B5 \u002B10 \u002B15 points)\u003C/p\u003E\u003Cp\u003E Test 2. Try to get the kerbal out of the Tank \u002B 10 points\u003C/p\u003E\u003Cp\u003E Test 3. Launch your missile at the preset Mk4 Plane (i will judge how well it is destroyed MAX 10)\u003C/p\u003E\u003Cp\u003E Test 4. Launch a SRB at the tank and get a direct hit Note: You can shoot it down in midair (i will also judge how well its intact MAX 10)\u003C/p\u003E\u003Cp\u003E Test 5. Repeat all these tests with the damaged tank (Dont do test 4 twice.)\u003C/p\u003E\u003Cp\u003E Max Score Of 80 without any achievements\u003C/p\u003E\u003Cp\u003E PICTURES NEEDED FOR PROPPER SCORING (i cant judge test 3 or 4 without a picture)\u003C/p\u003E\u003Cp\u003E Achievements!!!\u003C/p\u003E\u003Cp\u003E Troop Carrier (Carry more than 7 kerbals in your tank) \u002B 5\u003C/p\u003E\u003Cp\u003E It Swims!! (drive into the ocean without loosing a single part) \u002B10\u003C/p\u003E\u003Cp\u003E It Flies!! (Fly your tank around the KSC) \u002B 15\u003C/p\u003E\u003Cp\u003E Buzzed! (Fly by the tower) \u002B10 \u003C/p\u003E\u003Cp\u003E Pwnage (Have no parts left of the Mk4 after one shot) \u002B20\u003C/p\u003E\u003Cp\u003E Why U No Break! (Survive the SRB without loosing more than 5 parts) \u002B 20\u003C/p\u003E\u003Cp\u003E Not Today (Shoot Down the SRB before it hits you) \u002B25\u003C/p\u003E\u003Cp\u003E Who needs Rover Wheels? ( The tank uses no rover wheels and still moves) \u002B10\u003C/p\u003E\u003Cp\u003E Best Tank EVER \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E (Get all the Achievements using a single tank) \u002B50\u003C/p\u003E\u003Cp\u003E This challenge is possible even with a crappy tank you will still get a score. No Example needed\u003C/p\u003E\u003Cp\u003E Your reward is taking part in the challenge. Plus you now have an awesome tank you can use to clear up junk on the ground and shoot down your rockets.\u003C/p\u003E\u003Cp\u003ETank you!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E Top 5!\u003C/p\u003E\u003Cp\u003E 1st=======\u003C/p\u003E\u003Cp\u003E 2nd=======\u003C/p\u003E\u003Cp\u003E 3rd=======\u003C/p\u003E\u003Cp\u003E 4th=======\u003C/p\u003E\u003Cp\u003E 5th=======\u003C/p\u003E\n"},{"CreatedByName":"ericpar","CreatedById":71934,"CreatedDateTime":"2013-06-22T20:22:14Z","Content":"\n\u003Cp\u003EHey im working on building a tank, First, is the Best Tank EVER achievement even possible, what I am having trouble with is making the tank fly while still carrying two missiles that completely destroy the target. Second, how would you like us to be able to destroy the SRB while it is in mid-flight if switching to different ships is impossible while the SRB is accelerating in the atmosphere. How do I repeat step 3 with only one missile? Can I use the anti srb as a second missile? Can the \u0022It Swims achive be completed by parachuting into the water? Finally do landing gears count as rover wheels? Tanks im having fun with this!\u003C/p\u003E\n"},{"CreatedByName":"treesniper12","CreatedById":71673,"CreatedDateTime":"2013-06-23T18:34:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ericpar\u0022 data-cite=\u0022ericpar\u0022\u003E\u003Cdiv\u003EHey im working on building a tank, First, is the Best Tank EVER achievement even possible, what I am having trouble with is making the tank fly while still carrying two missiles that completely destroy the target. Second, how would you like us to be able to destroy the SRB while it is in mid-flight if switching to different ships is impossible while the SRB is accelerating in the atmosphere. How do I repeat step 3 with only one missile? Can I use the anti srb as a second missile? Can the \u0022It Swims achive be completed by parachuting into the water? Finally do landing gears count as rover wheels? Tanks im having fun with this!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it is will some smart building. It can fly if you put engines on it and control surfaces if its not too heavy. hmmmmm i diddnt think about the srb not working correctly... or you can use whack a kerbal\u0027s defualt projectile ( alt-f12 ).\u003C/p\u003E\u003Cp\u003EYes the anti srb can be used as a regular missile to destroy the plane. If your missile area isnt damaged you can reload the tank for test 3. yes you can parchute into the water. and landing gear dosent count as rover wheels. \u003C/p\u003E\u003Cp\u003ETanks for participating \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2013-06-23T18:55:23Z","Content":"\n\u003Cp\u003EI think Zekes will win this.\u003C/p\u003E\n"},{"CreatedByName":"Kerbies_are_my_Minions","CreatedById":57550,"CreatedDateTime":"2013-06-23T19:07:07Z","Content":"\n\u003Cp\u003EWhat gives you that impression Sbowyer? Maybe I\u0027m pretty good at building tanks?\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2013-06-23T19:51:41Z","Content":"\n\u003Cp\u003E................\u003C/p\u003E\n"},{"CreatedByName":"DaRocketCat","CreatedById":32377,"CreatedDateTime":"2013-06-23T19:57:30Z","Content":"\n\u003Cp\u003EPretty smart how we have to repeat the steps with a damaged tank.\u003C/p\u003E\n"},{"CreatedByName":"treesniper12","CreatedById":71673,"CreatedDateTime":"2013-07-26T23:05:04Z","Content":"\n\u003Cp\u003Eyay this thread is not dead at all :l\u003C/p\u003E\n"}]}