{"TopicId":34295,"ForumId":39,"TopicTitle":"The KSP-TV discussion thread!","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T16:39:52Z","PageNum":1,"Articles":[{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T16:39:52Z","Content":"\n\u003Cp\u003EFor all things KSP-TV! \u003C/p\u003E\u003Cp\u003EHow do you feel about the streams, what can be improved and what do you like already? This is where to discuss it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESchedule\u003C/strong\u003E (Timezone: GMT\u002B0)\u003C/p\u003E\u003Cp\u003E\u003Ciframe src=\u0022https://www.google.com/calendar/embed?src=%2%24s%%40group.calendar.google.com\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=0\u0026amp;%2%24s=AGENDA\u0026amp;%2%24s=600\u0026amp;%2%24s=1\u0026amp;%2%24s=%23FFFFFF\u0026amp;%2%24s=%235229A3\u0026amp;%2%24s=Etc%2FGMT\u0022 style=\u0022border: 0\u0022 width=\u0022800\u0022 height=\u0022600\u0022 frameborder=\u00220\u0022 scrolling=\u0022no\u0022\u003ELoading...\u003C/iframe\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-27T18:55:56Z\u0022 title=\u002206/27/2013 06:55  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 27, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-06-22T16:42:24Z","Content":"\n\u003Cp\u003EWe were under the impression that streams done by members of Squad would be core-only, why was this changed?\u003C/p\u003E\n"},{"CreatedByName":"itisdearflinch","CreatedById":32704,"CreatedDateTime":"2013-06-22T16:47:51Z","Content":"\n\u003Cp\u003EMaxMaps assured us that official streams, ie. streams done by squad employees, would be conducted as purely stock to give a correct impression of the actual game. Obviously mods actively being showcased are exempt from this rule, but Skunky spent most of the stream with mechjeb windows covering half the screen. Additionally, Skunky frequently talked over top of the showcased modder making it impossible to hear what was being said. Any future mod showcases should be conducted by the modder, skunky co-casting did nothing but detract from the point of the show. If a squad member absolutely HAS to be present, at the very least they should follow the already established all stock rules.\u003C/p\u003E\n"},{"CreatedByName":"Bromega","CreatedById":1566,"CreatedDateTime":"2013-06-22T16:50:46Z","Content":"\n\u003Cp\u003E-snip- Skunky\u0027s attitude towards the game and towards Majiir brought down the quality of the stream a whole lot, along with his refusal to honour his instructions to NOT use MechJeb during streams.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T20:08:26Z\u0022 title=\u002206/22/2013 08:08  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-06-22T16:52:18Z","Content":"\n\u003Cp\u003EThis won\u0027t last long. I have to say that this was a pretty poor start for KSPTV. Hardly anything in the Kethane mod was showcased, and half the time I couldn\u0027t hear what Majiir was trying to say (through no fault of his own).\u003C/p\u003E\n"},{"CreatedByName":"whatisthisidonteven","CreatedById":41660,"CreatedDateTime":"2013-06-22T16:53:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022satcharna\u0022 data-cite=\u0022satcharna\u0022\u003E\u003Cdiv\u003EWe were under the impression that streams done by members of Squad would be core-only, why was this changed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, we were told that Squad employees would have to be stock only. Perhaps exceptions for when showcasing a mod, but what Skunky did was awful - He put mechjeb on his craft, told everyone to \u0022suck it\u0022 and effectively challenged them to come at him, and then he got the mods to ban anyone who mentioned the word mechjeb. He kept starting stuff about mechjeb during the stream too, often interrupting Majiir to do so (Another problem - He hardly ever let Majiir get a word in because he would constantly talk over him). The ksptv launch was almost a complete disaster - Luckily the two guys that streamed after Skunky saved it. Schmoog and Yargnit had some really good quality streams. I didn\u0027t stick around for much of PD\u0027s stream, but he looked like it was decent too. That\u0027s the sort of content I\u0027d love to tune in to see on ksptv\u003C/p\u003E\u003Cp\u003EIn my opinion, Skunky has shown time and time again that he is incapable of streaming to any large audience, every time he does there\u0027s always a storm. I would much prefer it if it was only community members who streamed on ksptv unless it\u0027s a dev stream showing off a new update (Something I\u0027d also like to see return - The 0.18 dev streams were really good, but we haven\u0027t seen them since). I think Skunky has some good intentions but he just doesn\u0027t know how to express himself properly, he acted in a really unprofessional way yesterday and the viewers count reflected that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T17:03:58Z\u0022 title=\u002206/22/2013 05:03  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by whatisthisidonteven\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-06-22T16:56:07Z","Content":"\n\u003Cp\u003EThanks for making the thread, too bad it took hundreds of timeouts in the stream and 2 closed threads beforehand.\u003C/p\u003E\u003Cp\u003ENo thanks for deleting one of the messages giving an opinion.\u003C/p\u003E\u003Cp\u003ENow, I didn\u0027t really like skunky\u0027s participation in the stream. His interview capacities are pretty questionable and I\u0027m not even going to talk (because it was already mentioned) of his mechjeb usage. I mean, at least he can fake liking the game, which he doesn\u0027t even do or try.\u003C/p\u003E\u003Cp\u003EAfter that, the stream quality went way up with schmoog and the next streamer which I don\u0027t remember his name (sorry man).\u003C/p\u003E\u003Cp\u003ETo finish, I\u0027m really sorry for Majiir, as his mod-showcase stream got pretty much eclipsed by skunky\u0027s participation, swearing and constant unprofessional and even infant-like behaviour. The mod was looking great and we barely got to see what new features it had, so, good work for you Majiir, even if you couldn\u0027t show it enough or to your hearts content (I really think it would have been a million times better if you alone commanded the stream).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T17:01:38Z\u0022 title=\u002206/22/2013 05:01  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by PDCWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RPharazon","CreatedById":8404,"CreatedDateTime":"2013-06-22T17:04:50Z","Content":"\n\u003Cp\u003EI have to say that Schmoog\u0027s and Yargnit\u0027s segments were pretty good, full of entertaining content. I really appreciated Schmoog\u0027s attempts to explain where he went wrong whenever he messed up, and I think others appreciated the lessons learned.\u003C/p\u003E\u003Cp\u003EThe Kethane showcase was just a complete wash, I\u0027m sorry to say. I couldn\u0027t see the Kethane bits with all the Mechjeb windows in the way, and any meaningful views of the new scanning interface were very sparse, before the concept of actually being in space was abandoned altogether. I felt really bad for Majiir, as you could actually hear his disappointment and frustration increase as the stream went on. I swear that half of it was just building half-working rovers with old parts, a quarter of the stream was obscured by Mechjeb, and the remaining quarter was filled with drama interrupted by having to cheat kethane onto the runway to actually showcase anything.\u003C/p\u003E\u003Cp\u003EIt could have been handled a lot better, and I think it did a disservice both to Majiir\u0027s fine work and the concept of KSPTV itself.\u003C/p\u003E\n"},{"CreatedByName":"STARSTRUCK","CreatedById":31209,"CreatedDateTime":"2013-06-22T17:05:29Z","Content":"\n\u003Cp\u003EI\u0027m going to have to concur with the points previously made.\u003C/p\u003E\u003Cp\u003ESkunky was clearly not up to the task of presenting the game or even the Kethane mod. The mechjeb usage, while not wrong in and of itself, was not representative of the experience of the core game. Also, to be perfectly honest, it was slightly cringeworthy watching him bungle the simplest of launches.\u003C/p\u003E\u003Cp\u003EOn the other hand, Schmoog\u0027s stream was fairly good. I wasn\u0027t around for the other one.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-06-22T17:24:06Z","Content":"\n\u003Cp\u003EI really liked Schmoog\u0027s and Yargnit\u0027s streams, they were fantastic. New users could learn quite a few things from those streams as they not only explained how they changed things in the game, but also how they are used in real life. I really hope they stream more.\u003C/p\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-06-22T17:29:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EI really liked Schmoog\u0027s and Yargnit\u0027s streams, they were fantastic. New users could learn quite a few things from those streams as they not only explained how they changed things in the game, but also how they are used in real life. I really hope they stream more.\u003C/div\u003E\u003C/blockquote\u003EIndeed. Majir\u0027s part of the Skunky stream, Schmoog and Yargnit\u0027s streams were very good, and I hope all three of them return in future streams. I\u0027m just sad that Majir\u0027s attempt at showcasing his mod was hurt by Skunky\u0027s antics, but Majir really did a great job despite the difficult circumstances.\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-06-22T20:46:32Z","Content":"\n\u003Cp\u003EAs the report button may not be used to report this, May I request that this thread gets moved to a more active section?\u003C/p\u003E\n"},{"CreatedByName":"SZDarkhack","CreatedById":57439,"CreatedDateTime":"2013-06-22T20:55:21Z","Content":"\n\u003Cp\u003EShouldn\u0027t ksptv be running currently? I\u0027m looking at the schedule and Chickenkeeper is supposed to be on. Earlier today Dahud was scheduled too, but there was no stream. I understand, of course, that something might have come up, but there was no announcement so i\u0027m just wondering what\u0027s going on...\u003C/p\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-06-22T20:56:37Z","Content":"\n\u003Cp\u003EI can only echo the opinions already expressed so far. The first segment of the stream, the grand opening of the entire KSPTV project, had an utterly unprofessional host who talked over his guest and did a poor job of showcasing the Kethane mod. I feel sorry for Majiir for having to put up with that.\u003C/p\u003E\u003Cp\u003ESchmoo and Yargnit salvaged it though. Schmoo with his utterly excellent launch and Mun landing tutorials, along with his more crazy craft designs, and Yargnit with his extremely professional manner and skill at playing the game. Together they showcased KSP extremely well.\u003C/p\u003E\u003Cp\u003EI didn\u0027t watch PD\u0027s stream as it was getting very late.\u003C/p\u003E\u003Cp\u003EIt is a shame the viewer count dropped so much after the launch, but recent Captain Skunky streams have never commanded a large audience anyway, and the sheer length of the stream in its entirety probably didn\u0027t help. Perhaps over time and with high quality streams and good advertising the viewercount can surpass the old dev streams in popularity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T21:05:46Z\u0022 title=\u002206/22/2013 09:05  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by hoojiwana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T21:07:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SZDarkhack\u0022 data-cite=\u0022SZDarkhack\u0022\u003E\u003Cdiv\u003EShouldn\u0027t ksptv be running currently? I\u0027m looking at the schedule and Chickenkeeper is supposed to be on. Earlier today Dahud was scheduled too, but there was no stream. I understand, of course, that something might have come up, but there was no announcement so i\u0027m just wondering what\u0027s going on...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll look into what\u0027s going on. About Skunky\u0027s stream: I think this point has been covered sufficiently now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-06-22T21:09:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EI\u0027ll look into what\u0027s going on. About Skunky\u0027s stream: I think this point has been covered sufficiently now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003ECould we get some information about whether any action has been or will be taken as a result of our \u0022coverage\u0022 of Skunky\u0027s stream?\n"},{"CreatedByName":"itisdearflinch","CreatedById":32704,"CreatedDateTime":"2013-06-22T21:12:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EI\u0027ll look into what\u0027s going on. About Skunky\u0027s stream: I think this point has been covered sufficiently now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes that mean skunky won\u0027t be doing another stream, or are you just done indulging us?\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T21:12:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022satcharna\u0022 data-cite=\u0022satcharna\u0022\u003E\u003Cdiv\u003ECould we get some information about whether any action has been or will be taken as a result of our \u0022coverage\u0022 of Skunky\u0027s stream?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf there is any such information to be released I\u0027m not the person to do so. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SZDarkhack\u0022 data-cite=\u0022SZDarkhack\u0022\u003E\u003Cdiv\u003EShouldn\u0027t ksptv be running currently? I\u0027m looking at the schedule and Chickenkeeper is supposed to be on. Earlier today Dahud was scheduled too, but there was no stream. I understand, of course, that something might have come up, but there was no announcement so i\u0027m just wondering what\u0027s going on...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think we can blame Twitch: \u003Ca href=\u0022http://blog.twitch.tv/2013/06/site-outage-passwords-and-stream-keys-reset/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blog.twitch.tv/2013/06/site-outage-passwords-and-stream-keys-reset/\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022itisdearflinch\u0022 data-cite=\u0022itisdearflinch\u0022\u003E\u003Cdiv\u003EDoes that mean skunky won\u0027t be doing another stream, or are you just done indulging us?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat I mean is that I think certain opinions on Skunky\u0027s stream have been expressed clearly and that just repeating them won\u0027t add to a discussion.\u003C/p\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-06-22T21:15:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EIf there is any such information to be released I\u0027m not the person to do so.\u003C/div\u003E\u003C/blockquote\u003EThen would you mind fetching someone who actually would release any such information? Right now, this \u0022discussion thread\u0022 is just us talking at you guys, and you guys \u0022moderating\u0022 us. Discussion means that both sides need to actively post, and that just isn\u0027t happening right now.\n"},{"CreatedByName":"SZDarkhack","CreatedById":57439,"CreatedDateTime":"2013-06-22T21:18:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EI\u0027ll look into what\u0027s going on. About Skunky\u0027s stream: I think this point has been covered sufficiently now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Kasper for looking into it. Since KSPTV has officially launched, i would suggest (although i\u0027m sure it\u0027s already considered) the creation of a dedicated forum/subforum where we can discuss the streams, and the streamers could perhaps answer any important questions that were raised but not covered during the stream. It would also act as a hub for all KSPTV info, such as announcements \u002B the schedule. This is hardly an intuitive forum to have this discussion.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EI think we can blame Twitch: \u003Ca href=\u0022http://blog.twitch.tv/2013/06/site-outage-passwords-and-stream-keys-reset/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blog.twitch.tv/2013/06/site-outage-passwords-and-stream-keys-reset/\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am aware of the situation over at twitch. Is there any official word on when the schedule will resume normally though?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T21:22:26Z\u0022 title=\u002206/22/2013 09:22  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by SZDarkhack\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-06-22T21:21:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EWhat I mean is that I think certain opinions on Skunky\u0027s stream have been expressed clearly and that just repeating them won\u0027t add to a discussion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it -should- add on the weight they give to the community at the time of making a decision. I mean, the majority of the community agree on something, the rest is just logical.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T21:23:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022satcharna\u0022 data-cite=\u0022satcharna\u0022\u003E\u003Cdiv\u003EThen would you mind fetching someone who actually would release any such information? Right now, this \u0022discussion thread\u0022 is just us talking at you guys, and you guys \u0022moderating\u0022 us. Discussion means that both sides need to actively post, and that just isn\u0027t happening right now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDiscussions can also take place between users. I\u0027ll ask if a statement will be made but I don\u0027t expect so, because really it\u0027s a small issue that can be handled internally.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EBut it -should- add on the weight they give to the community at the time of making a decision. I mean, the majority of the community agree on something, the rest is just logical.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA few people posting (and lets face it, those people have similar backgrounds) does not give a fair image of what the majority of the community agrees on.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SZDarkhack\u0022 data-cite=\u0022SZDarkhack\u0022\u003E\u003Cdiv\u003Ei would suggest (although i\u0027m sure it\u0027s already considered) the creation of a dedicated forum/subforum where we can discuss the streams, and the streamers could perhaps answer any important questions that were raised but not covered during the stream. It would also act as a hub for all KSPTV info, such as announcements \u002B the schedule. This is hardly an intuitive forum to have this discussion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe discussed such a forum but it was thought that KSP-TV is too narrow a topic to warrant its own forum. I\u0027ll see if I can add information such as the schedule to this thread though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T21:25:45Z\u0022 title=\u002206/22/2013 09:25  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-06-22T21:23:05Z","Content":"\n\u003Cp\u003EShouldn\u0027t this thread be in general discussion?\u003C/p\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-06-22T21:26:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EDiscussions can also take place between users. I\u0027ll ask if a statement will be made but I don\u0027t expect so, because really it\u0027s a small issue that can be handled internally.\u003C/div\u003E\u003C/blockquote\u003EA small issue? I\u0027m sorry, but have you been reading the previous two pages? Practically every post brings up the same point, it\u0027s far from a \u0022small issue\u0022, and we, the community, would definitely like some information on it.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003EShouldn\u0027t this thread be in general discussion?\u003C/div\u003E\u003C/blockquote\u003EIt should, but then people would be able to find it.\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-22T21:26:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003EShouldn\u0027t this thread be in general discussion?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this thread is fine where it is. This forum was created specifically for discussing videos and streams.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EA small issue? I\u0027m sorry, but have you been reading the previous two pages? Practically every post brings up the same point, it\u0027s far from a \u0022small issue\u0022, and we, the community, would definitely like some information on it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee my reply to PDCWolf and like I said: if there is any such information to be released I\u0027m not the person to do so.\u003C/p\u003E\n"}]}