{"TopicId":34411,"ForumId":16,"TopicTitle":"Docking again","CreatedByName":"wayan","CreatedById":58944,"CreatedDateTime":"2013-06-23T11:13:19Z","PageNum":1,"Articles":[{"CreatedByName":"wayan","CreatedById":58944,"CreatedDateTime":"2013-06-23T11:13:19Z","Content":"\n\u003Cp\u003EHello Folks!\u003C/p\u003E\u003Cp\u003EAgain i got a problem with clampotrons.\u003C/p\u003E\u003Cp\u003EI want to assemble a spacecraft in space, so i build a core segment with like this\u003C/p\u003E\u003Cp\u003EO--O\u003C/p\u003E\u003Cp\u003EWhere an \u0022O\u0022 is a six way connector with clampotrons, and the \u0022-\u0022 is an FLT800 tank.\u003C/p\u003E\u003Cp\u003EAs this is exactly the same length as a rockomax 64 tank with two 6 way connectors (incl. clampotrons) as its ends, i tried to connect two of these on 2 opposite sites of my core.\u003C/p\u003E\u003Cp\u003EHere comes the Problem:\u003C/p\u003E\u003Cp\u003EThe first rockomax was easy to dock on one side, bot clapotrons ocked easily and the connection is sturdy.\u003C/p\u003E\u003Cp\u003ENow i wanted to dock the other rockomax, but only the back one of the clapotrons connect, the front one dont even have a magnetic force, nothing.\u003C/p\u003E\u003Cp\u003EIf the back one is docked, you can easily see that the front one is unconnected and wobbles around.\u003C/p\u003E\u003Cp\u003ERedocking or reloading doesn\u0027t solve the problem.\u003C/p\u003E\u003Cp\u003Ehas anyHas anybody any ideas?\u003C/p\u003E\u003Cp\u003EGreetings\u003C/p\u003E\u003Cp\u003EWayan\u003C/p\u003E\n"},{"CreatedByName":"mk78123","CreatedById":63768,"CreatedDateTime":"2013-06-23T11:25:26Z","Content":"\n\u003Cp\u003EYou could try undocking and redocking until all of the ports connect fully\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-06-23T11:34:40Z","Content":"\n\u003Cp\u003ENo matter haw many or in what ever arrangement, \u003Cstrong\u003Eonly one\u003C/strong\u003E port will ever truly dock (any part can only have one parent part). The other ports will only stabilize the array slightly. As a result of the much weaker force between the other ports they must be absolutely perfectly aligned, if not they will not \u0027connect\u0027.\u003C/p\u003E\u003Cp\u003EAs I said; docking port arrays can work but a single port augmented with docking or quantum struts is not only a lot easier, it is also more stable. (Unless you\u0027re a purist and want plain vanilla)\u003C/p\u003E\n"},{"CreatedByName":"WarWyvern","CreatedById":63785,"CreatedDateTime":"2013-06-23T11:36:50Z","Content":"\n\u003Cp\u003EIf I\u0027m understanding this correctly, it sounds like the center structure is slightly longer than the side tanks that you\u0027re trying to dock. This is causing it to flex and compress on the side the first tank docks, leaving the second tank with a bit too much of a gap. I\u0027m not sure how you would go about fixing it, but if you could maybe find a way of compressing the structure towards the second tanks (perhaps with lightweight radial thrusters?), you might be able to secure it.\u003C/p\u003E\u003Cp\u003EHope this helps.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-06-23T19:12:52Z","Content":"\n\u003Cp\u003EWith massive parts of this type, both ports have to be aligned very closely prior to docking in order for each to engage. If only one is close, it will connect and the other will wobble around freely. I would be willing to bet that it\u0027s an alignment problem; I\u0027ve done quite a few dockings of the type you\u0027re describing and it can be a real pain in the butt to get both ends of a massive part to be in the right place at the right time so that both connect. If the two unconnected ports are in the right place, you should be able to do the following: \u003C/p\u003E\u003Cp\u003E1. Undock the active port. This will cause the second set of ports to activate and immediately connect. If they don\u0027t connect then they\u0027re not quite lined up correctly.\u003C/p\u003E\u003Cp\u003E2. Undock the other set of ports. The two ships should be floating inches away from each other in the perfect orientation to dock at this point, but all four of the docking ports are now inactive.\u003C/p\u003E\u003Cp\u003E3. Rapidly switch to the space center, then use the tracking station to go back to your ships. When they reload into physics the ports all become active and both pairs will connect.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003ENo matter haw many or in what ever arrangement, \u003Cstrong\u003Eonly one\u003C/strong\u003E port will ever truly dock (any part can only have one parent part). The other ports will only stabilize the array slightly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is confusing at best. In the parent-child hierarchy of the ship it is true that only one port actually docks. However, in terms of the physical connection made between the parts there is no limit (beyond practicality) to the number of docking connections that can exist between two parts. Each of the additional ports has exactly the same strength as the original and in combination they make the connection much stronger.\u003C/p\u003E\n"}]}