{"TopicId":34674,"ForumId":16,"TopicTitle":"Do I need to have a decoupler before rockets in a stage to auto-fire them?","CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-06-25T05:26:10Z","PageNum":1,"Articles":[{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-06-25T05:26:10Z","Content":"\n\u003Cp\u003ESo I heard from a tutorial that if you have a decoupler in the same stage as a rocket, you can have rockets in that same stage fire once the decoupler fires, and it does work.\u003C/p\u003E\u003Cp\u003EBut I got a question. I can\u0027t seem to get the decoupler to go under the engines in staging. It keeps being above them for some reason. I\u0027m worried that it\u0027ll fire the rockets before decoupling, which I don\u0027t want.\u003C/p\u003E\u003Cp\u003EDoes it \u003Cem\u003Ereally\u003C/em\u003E matter what level the decoupler is, to auto-fire the rockets in that stage? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-06-25T05:30:30Z","Content":"\n\u003Cp\u003EI assume that you are working on some sort of a missile launcher...\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-06-25T06:00:12Z","Content":"\n\u003Cp\u003ENegative. Just a rover \u002B skycrane strapped to a rocket. I just want to know if it\u0027s necessary to have the decoupler before the rockets (not the main rockets, just the skycrane\u0027s).\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-06-25T06:51:28Z","Content":"\n\u003Cp\u003EHave you tried looking at the skycrane that comes with the game?\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-06-25T07:02:34Z","Content":"\n\u003Cp\u003EJust manually sort your staging... Drag and drop the bits you want into different stages, as needed. I have to do that with almost every rocket at one point or another... The game does weird things with the default staging. or perhaps i build weird rockets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-06-25T07:19:45Z","Content":"\n\u003Cp\u003EThe decouplers just have to be in the same staging group. The order inside the staging group doesn\u0027t matter, everything will be fired at the same time.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-06-25T09:32:12Z","Content":"\n\u003Cp\u003EIf you want your engines to fire when you de-couple, put them in the same stage as the de-coupler. If you don\u0027t, put them in a different stage. Simple.\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-25T13:09:51Z","Content":"\n\u003Cp\u003EYep. You can either put the engine in a stage above the decoupler and hit space twice (give it some sep room etc) or you can put the decoupler and engine in the same stage and they will fire simultaneously. It\u0027s irrelevant which ones \u0022on top\u0022 in the staging window, as long as they are both in the same numbered stage.\u003C/p\u003E\n"}]}