{"TopicId":34737,"ForumId":34,"TopicTitle":"[0.90] Magic Smoke Industries Infernal Robotics - 0.19.3","CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-06-25T18:48:35Z","PageNum":99,"Articles":[{"CreatedByName":"bs1110101","CreatedById":58438,"CreatedDateTime":"2014-04-17T21:27:09Z","Content":"\n\u003Cp\u003EThe free docking washers don\u0027t work at all for me, and trying to use 1/2 rotortrons to change rotor pitch totally bugs out.\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-17T21:46:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StoneC0ld\u0022 data-cite=\u0022StoneC0ld\u0022\u003E\u003Cdiv\u003EIn the VAB, hinges are attached correctly:\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/oxu5nBR\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/oxu5nBR.jpg?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/oxu5nBR.jpg?1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOn the launchpad:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/IUffjO6\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/IUffjO6.jpg?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/IUffjO6.jpg?1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBeams are now turned around 180 degrees, with the hinge sections separated until the hinges are motored to extend the beams. Beams with dishes remain turned the wrong way when deployed.\u003C/p\u003E\u003Cp\u003EAre these the hinges that are not yet updated/fixed?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a BETA release for people I test. Stuff Is goin to be broken. Sometimes they work, sometimes they don\u0027t it\u0027s the nature of this \u0022release\u0022 and it is certainly not for production work yet.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-04-17T22:29:50Z","Content":"\n\u003Cp\u003Ei\u0027m not trying to be mean here but if you find a bug please post pictures and or craft files (like sirkut has already said) if you do this then the bugs will be ironed out very quickly (or at least quicker to find)\u003C/p\u003E\u003Cp\u003Eplease don\u0027t post \u0022this doesn\u0027t work cuz i putted it here and it goes there\u0022 it\u0027s not very helpful :/ if you go back a few posts you\u0027ll see lots of people have posted pictures (explaining what is wrong with one sentence) and also included craft files... i thought this was a great idea and would like to see it used instead of half a million people posting \u0022this bugs out\u0022 or \u0022this is buggy... is this really fixed?\u0022 it\u0027s a beta... B.E.T.A.\u003C/p\u003E\u003Cp\u003Esorry for that lil rant also how do i get the dromoman parts working? i got them ingame now do i just install your plugin or is there a .cfg edit i have to download too?\u003C/p\u003E\n"},{"CreatedByName":"jinks","CreatedById":69693,"CreatedDateTime":"2014-04-17T22:31:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EThis is a BETA release for people I test.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo \u003Cstrong\u003Ethat\u0027s\u003C/strong\u003E what this is all about... Human experiments! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-17T22:35:19Z","Content":"\n\u003Cp\u003EI didn\u0027t include the dromoman items due to licensing but all you have to do to get them to work is edit the rotateAxis value where there is a 1 make it a zero and place the 1 in one I the two other placeholders. ie. rotateAxis = 0,0,1 make it 1,0,0 and see what it does. If it\u0027s wrong do 0,1,0 and save the cfg(you will need to reload the database at the space center menu by alt f12 going to database and click reload) if you are unsure just restart your game.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-04-17T22:41:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EI didn\u0027t include the dromoman items due to licensing but all you have to do to get them to work is edit the rotateAxis value where there is a 1 make it a zero and place the 1 in one I the two other placeholders. ie. rotateAxis = 0,0,1 make it 1,0,0 and see what it does. If it\u0027s wrong do 0,1,0 and save the cfg(you will need to reload the database at the space center menu by alt f12 going to database and click reload) if you are unsure just restart your game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eah so it\u0027s \u0022throw it at the wall and see what sticks\u0022 eh? ok ok i\u0027ll be back with my findings to let other people know.\u003C/p\u003E\u003Cp\u003EEDIT: got it working! thanks! but i\u0027m encountering the same problem as the other guys perivously stated. if you have multiple rotatrons (or rotahubs in this case) instead of rotating at their joint they rotate as if the joint is in the middle of the two rotatrons (i\u0027ll get pics up tomorrow but thanks alot for what you\u0027ve done and what your continuing to do!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-17T23:13:29Z\u0022 title=\u002204/17/2014 11:13  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 17, 2014\u003C/time\u003E by AntiMatter001\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Legola","CreatedById":108896,"CreatedDateTime":"2014-04-17T22:44:28Z","Content":"\n\u003Cp\u003EAfter so long lurking around, I finally had to create an account just to try and help out with this wonderful mod. I looked around since you posted the beta and haven\u0027t found anything regarding telescopic piston of 1/4 size.\u003C/p\u003E\u003Cp\u003EEvery telescopic piston seems to work fine though.\u003C/p\u003E\u003Cp\u003EHere goes what I\u0027ve found.\u003C/p\u003E\u003Cp\u003EHere I have a series of tests I ran with the different pistons in their starting position.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mev10m1l.png\u0022 alt=\u0022mev10m1l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext I extended all of them under the same group.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/To7ZX6Bl.png\u0022 alt=\u0022To7ZX6Bl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the front middle pod I have all the three 1/4 pistons individually. The middle piston (1/4 A section) and right piston (1/4 B section) appear to extend backwards while the C section shows to work fine.\u003C/p\u003E\u003Cp\u003EYou can also see the same behavior in the test behind it trying to push up the parachute with the A, B and C pistons on top of each other, where the A and B actually go backwards just having C push it up. This is reproduced without the parachute on the right hand side.\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to reproduce this under different circumstances having the same thing happening.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5158667/ksp/Piston%20Test.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ECraft file here.\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T00:16:15Z\u0022 title=\u002204/18/2014 12:16  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by Legola\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-17T23:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntiMatter001\u0022 data-cite=\u0022AntiMatter001\u0022\u003E\u003Cdiv\u003Eah so it\u0027s \u0022throw it at the wall and see what sticks\u0022 eh? ok ok i\u0027ll be back with my findings to let other people know.\u003Cp\u003EEDIT: got it working! thanks! but i\u0027m encountering the same problem as the other guys perivously stated. if you have multiple rotatrons (or rotahubs in this case) instead of rotating at their joint they rotate as if the joint is in the middle of the two rotatrons (i\u0027ll get pics up tomorrow but thanks alot for what you\u0027ve done and what your continuing to do!)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo need for that one. I know exactly what you mean. If it\u0027s a single robotic part it will work but combined it gets really screwy. Fun fact. If you take a non robotic part and put it between two robotic parts it will work \u0022mostly.\u0022\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-04-17T23:51:12Z","Content":"\n\u003Cp\u003Elol, I see there\u0027s been a few downloads of the pogo stick craft! Just fyi, you need to set the speed setting to around 30 (or more, its your kerbal that\u0027s going to die), then hit action group 1 which is set to return the pistons to fully retracted. Then you have to try to balance it while hitting 9 (or was it 0) at the right moment to bounce. \u003C/p\u003E\u003Cp\u003EI\u0027ve done some more testing with a craft I had built before, a heavy lift orbiter that has a metric crap-ton of IR parts and a whole load of other mods (B9_Aerospace, KAS, KSPX, KWRocketry, MechJeb2, NovaPunch2, RemoteTech2).\u003C/p\u003E\u003Cp\u003EThis is the craft at launch \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/i6JWwgO\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/i6JWwgOl.jpg\u0022 alt=\u0022i6JWwgOl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe orbiters main engines are mounted on hinges which are set inside the body of the craft and its not a standard setup. The are radially set on SAS modules, but so they are inside the module, then the engine connects so the hinge is inside it, this is so the pivot point is not right at the end of the engine. Anyway, point is that odd setup still works perfectly. \u003C/p\u003E\u003Cp\u003EThere is also a hinge that folds the walkway out of the way at lift off. This hinge drops when the craft is loaded onto the runway. I forgot to get a scr-shot of that one before launch.\u003C/p\u003E\u003Cp\u003EThe other main component with IR parts is the Orbiters arm. We know the hydraulic cylinders don\u0027t work so I won\u0027t say anything about that. Right the hinges, interesting.... The arm has 3 hinges and a rotator at either end. The first hinge has problems and seems to have a false pivot point. As it rotates it moves away from its base part. The other 2 hinges work as they should as do the rotatrons.\u003C/p\u003E\u003Cp\u003EClose up of the first hinge;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/lb3bhFZ\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/lb3bhFZl.jpg\u0022 alt=\u0022lb3bhFZl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERest of the arm, showing the other hinges working as they should;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/PYRNFyv\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/PYRNFyvl.jpg\u0022 alt=\u0022PYRNFyvl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOk so that\u0027s kinda preamble (sorry for being long winded). \u003C/p\u003E\u003Cp\u003EI transferred just the Orbiters arm (without its KAS parts) into my stock test install and attached it to a lander can. It behaved in exactly the same way, the initial hinge was distorted and the other two worked fine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/lfYyKZk\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/lfYyKZkl.jpg\u0022 alt=\u0022lfYyKZkl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI then moved the arm so it the first hinge was directly attached to the lander can and presto, all hinges working as intended;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/nwEe3nS\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/nwEe3nSl.jpg\u0022 alt=\u0022nwEe3nSl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow here\u0027s where it gets interesting; I\u0027ve recently have had issues with the small strut cube and that was the part the first hinge was attached to, so I wondered if these pesky little cubes had something to do with it. So I attached the arm to another small cube (directly on the lander can, not to the rotator as before). The instant the craft loaded the arm jumped to one side and was embedded in the middle of the can, its base part still attached to the cube.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/OQtiSIt\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/OQtiSItl.jpg\u0022 alt=\u0022OQtiSItl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETo confirm that the small cube was the cause of this I then attached the arm to an M-beam, this worked correctly, just like when the hinge was directly attached to the can.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/y7i5yVt\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/y7i5yVtl.jpg\u0022 alt=\u0022y7i5yVtl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe next test was to mount the hinge directly to the rotator. This resulted in the hinge being offset right from the start (so this is slightly different to how the cube makes it behave).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/4JhNrfp\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4JhNrfpl.jpg\u0022 alt=\u00224JhNrfpl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI then used a large strut section in-between the hinge and the rotator and all the hinges worked correctly. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/h83bvDn\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/h83bvDnl.jpg\u0022 alt=\u0022h83bvDnl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe interesting thing about the small strut cube is that it has no physics significance. Neither does the octagonal strut so I tried that too. That has the same effect of making the arm jump into the middle of the lander can. \u003C/p\u003E\u003Cp\u003ESo at this point I was thinking that the lack of a physics significance might have something to do with the issues. But that isn\u0027t the whole story. I tried a number of other parts that do have a physics significance. The not-rockomax cube shows what I found the best. The closer to the rotator the hinge is mounted the more it distorts. When attached to the top of the cube it works fine, when attached to the side it is offset by a small amount.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gjSUU4j\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/gjSUU4jl.jpg\u0022 alt=\u0022gjSUU4jl.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://imgur.com/848HeUQ\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/848HeUQl.jpg\u0022 alt=\u0022848HeUQl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo (again apols for being long winded) my conclusion; attaching hinges to parts that don\u0027t have a physics significant causes the hinge to malfunction. Directly attaching hinges to rotators also has issues and that the distance the hinge is from the rotator is a factor. With the same part between a hinge and a rotator, the hinge will malfunction when near the rotator and work correctly when its a certain distance away from it.\u003C/p\u003E\u003Cp\u003EAnother un-related observation about hinges is that quicksaving and loading does really bad things! the hinge gets distorted and is bent at a very different angle to how it was when the save was made. It\u0027s pivot point however seems to stay in the same place, but its notion of its central position will now be set to the angle it was at when the save was made.\u003C/p\u003E\u003Cp\u003EI know you know some of this already, but maybe this will add some light on something, possibly, maybe!\u003C/p\u003E\n"},{"CreatedByName":"Legola","CreatedById":108896,"CreatedDateTime":"2014-04-18T00:02:48Z","Content":"\n\u003Cp\u003EI don\u0027t even know if my previous posts are going to show up... But I kept fiddling with the telescopic pistons and found out I know nothing.\u003C/p\u003E\u003Cp\u003EI\u0027m not certain how to reproduce the thing that makes the pistons extend backwards, some times it happens and sometimes it works fine.\u003C/p\u003E\u003Cp\u003EPosting the pictures in an album here: \u003Ca href=\u0022http://imgur.com/a/gFFSt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/gFFSt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5158667/ksp/Piston%20test%203.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ECraft\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn this test I was able to get the 1/2 and 1/4 pistons to work fine on all 4 different tests, however the big piston only worked once of 5 tests I did. It\u0027s important for me to mention that every piston set is a copy.\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-18T00:13:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003Elol, I see there\u0027s been a few downloads of the pogo stick craft! Just fyi, you need to set the speed setting to around 30 (or more, its your kerbal that\u0027s going to die), then hit action group 1 which is set to return the pistons to fully retracted. Then you have to try to balance it while hitting 9 (or was it 0) at the right moment to bounce. etc etc etc etc\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. This is exactly what I need to see. Thank you a TON!\u003C/p\u003E\n"},{"CreatedByName":"Legola","CreatedById":108896,"CreatedDateTime":"2014-04-18T00:30:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003ENo need for that one. I know exactly what you mean. If it\u0027s a single robotic part it will work but combined it gets really screwy. Fun fact. If you take a non robotic part and put it between two robotic parts it will work \u0022mostly.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know what you mean by mostly... Or I simply don\u0027t know what makes Pistons work because they\u0027re looking like a gamble right now! Which is kind of funny. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/85ulwuol.png\u0022 alt=\u002285ulwuol.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aVqrimQl.png\u0022 alt=\u0022aVqrimQl.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"omgnull","CreatedById":108510,"CreatedDateTime":"2014-04-18T01:21:28Z","Content":"\n\u003Cp\u003EGood to see the new update.\u003C/p\u003E\u003Cp\u003EI\u0027ve make some tests with modifications. Test craf from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37707?p=1098242\u0026amp;viewfull=1#post1098242\u0022 rel=\u0022external nofollow\u0022\u003EObsessedWithKSP\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/D0TA_UdTWU4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAfter more deeper source investigations and unity docs smoking i\u0027ve found one of mistake, we cannot just substract or sum anchor and connectedAnchor vectors, bc they are in different spaces local spaces, anchor is a joint.RiggidBody local and connectedAnchor is a joint.connectetBody space. The thing i don\u0027t understand is why rotating models have sometimes has different behavior on anchor positionint than translating models. Maybe its its models problem, but i dont have models sources, so cant test it, or it\u0027s ksp scene import behavior.\u003C/p\u003E\n"},{"CreatedByName":"omgnull","CreatedById":108510,"CreatedDateTime":"2014-04-18T02:02:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Legola\u0022 data-cite=\u0022Legola\u0022\u003E\u003Cdiv\u003EAfter so long lurking around, I finally had to create an account just to try and help out with this wonderful mod. I looked around since you posted the beta and haven\u0027t found anything regarding telescopic piston of 1/4 size.\u003Cp\u003EEvery telescopic piston seems to work fine though.\u003C/p\u003E\u003Cp\u003EHere goes what I\u0027ve found.\u003C/p\u003E\u003Cp\u003EHere I have a series of tests I ran with the different pistons in their starting position.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/mev10m1l.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/mev10m1l.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENext I extended all of them under the same group.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/To7ZX6Bl.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/To7ZX6Bl.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn the front middle pod I have all the three 1/4 pistons individually. The middle piston (1/4 A section) and right piston (1/4 B section) appear to extend backwards while the C section shows to work fine.\u003C/p\u003E\u003Cp\u003EYou can also see the same behavior in the test behind it trying to push up the parachute with the A, B and C pistons on top of each other, where the A and B actually go backwards just having C push it up. This is reproduced without the parachute on the right hand side.\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to reproduce this under different circumstances having the same thing happening.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5158667/ksp/Piston%20Test.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ECraft file here.\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis happens if parts in SRF_ATTACH attachMode revert it\u0027s translate/rotate axises. That i don\u0027t understand for now. We can simply revert axis for for SRF_ATTACH but its weird xD\u003C/p\u003E\n"},{"CreatedByName":"viperwolf","CreatedById":66190,"CreatedDateTime":"2014-04-18T03:50:21Z","Content":"\n\u003Cp\u003ECan someone point me to the page or thread that explains how to put parts in the tree. So i can use this in career mode.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-18T04:09:17Z","Content":"\n\u003Cp\u003EThey should be in the tree. And if they aren\u0027t, just use sandbox. This is NOT a release you want to use in an actual game you care about.\u003C/p\u003E\n"},{"CreatedByName":"viperwolf","CreatedById":66190,"CreatedDateTime":"2014-04-18T07:11:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EThey should be in the tree. And if they aren\u0027t, just use sandbox. This is NOT a release you want to use in an actual game you care about.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight i understand that, but i have a back up of my career. If it works great, ill continue on. If it does not then ill just reload.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T07:50:38Z\u0022 title=\u002204/18/2014 07:50  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by viperwolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-18T08:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022viperwolf\u0022 data-cite=\u0022viperwolf\u0022\u003E\u003Cdiv\u003ERight i understand that, but i have a back up of my career. If it works great, ill continue on. If it does not then ill just reload.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell as I said they should be there. I think they\u0027re mostly (if not all) under Advanced Construction.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-18T08:46:37Z","Content":"\n\u003Cp\u003EIn the bit of the cfg that has the Title, Description and everything, the editor parameters, add the following:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ETechRequired = XXXXXXX\u003Cbr\u003EentryCost = YYYY\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReplace XXXXXX with whatever \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/22972712/ksp%20forum/tree_trimmed.txt\u0022 rel=\u0022external nofollow\u0022\u003Enode you want the part unlocked at\u003C/a\u003E, and YYYY with a number from 0 to a bajillion.\u003C/p\u003E\n"},{"CreatedByName":"viperwolf","CreatedById":66190,"CreatedDateTime":"2014-04-18T10:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EWell as I said they should be there. I think they\u0027re mostly (if not all) under Advanced Construction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eok ill check that. maybe i missed it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EIn the bit of the cfg that has the Title, Description and everything, the editor parameters, add the following:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ETechRequired = XXXXXXX\u003Cbr\u003EentryCost = YYYY\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReplace XXXXXX with whatever \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/22972712/ksp%20forum/tree_trimmed.txt\u0022 rel=\u0022external nofollow\u0022\u003Enode you want the part unlocked at\u003C/a\u003E, and YYYY with a number from 0 to a bajillion.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for this. I appreciate both your help.\u003C/p\u003E\n"},{"CreatedByName":"Deceptus","CreatedById":107826,"CreatedDateTime":"2014-04-18T12:23:49Z","Content":"\n\u003Cp\u003EI\u0027ve tried multiple stock parts, but they still pop at times. I did notice that the hydro arm and the VTOL are still rotating/translating on wrong axis/in wrong translation, which is a simple fix. Here is the craft, if you want to try it out.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./view/4ky7qb2km2a7trg/Craft.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./view/4ky7qb2km2a7trg/Craft.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOh, and apparently, the 23.5 patch was released as well. Just an FYI.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T12:33:29Z\u0022 title=\u002204/18/2014 12:33  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by Deceptus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-18T13:16:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deceptus\u0022 data-cite=\u0022Deceptus\u0022\u003E\u003Cdiv\u003EOh, and apparently, the 23.5 patch was released as well. Just an FYI.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm...what? That\u0027s what all this testing is about...fixing IR so that it works with 0.23.5.\u003C/p\u003E\u003Cp\u003ESpeaking of which, sorry for not posting but I haven\u0027t actually found anything that hasn\u0027t already been covered. \u0026gt;.\u0026lt;\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T13:21:54Z\u0022 title=\u002204/18/2014 01:21  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-18T13:22:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EUm...what? That\u0027s what all this testing is about...fixing IR so that it works with 0.23.5.\u003Cp\u003ESpeaking of which, sorry for not posting but I haven\u0027t actually found anything that hasn\u0027t already been covered. \u0026gt;.\u0026lt;\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat he means is Squad released a hotfix to 0.23.5\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-18T13:23:56Z","Content":"\n\u003Cp\u003EThere\u0027s another one?\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-04-18T13:30:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EThere\u0027s another one?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAsteroid Redirect Mission (v0.23.5.460\u002B) HOTFIX\u003C/p\u003E\u003Cp\u003EBug Fixes:\u003C/p\u003E\u003Cp\u003E* Fixed an issue with loading existing games, which would cause scenario modules (like R\u0026amp;D) to not load properly.\u003C/p\u003E\u003Cp\u003E* Fixed an issue which caused Kerbals on EVA to become unresponsive after resuming a save.\u003C/p\u003E\n"}]}