{"TopicId":34878,"ForumId":24,"TopicTitle":"Newbie moon problem.","CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-26T18:19:03Z","PageNum":1,"Articles":[{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-26T18:19:03Z","Content":"\n\u003Cp\u003EI recently started playing KSP and i watched scott manley\u0027s videos about orbiting.\u003C/p\u003E\u003Cp\u003EI managed to get into orbit but..\u003C/p\u003E\u003Cp\u003EMy fuel ran out.\u003C/p\u003E\u003Cp\u003EI quite want to get to kerbin\u0027s moon but i cant go there without fuel..\u003C/p\u003E\u003Cp\u003ESo i actually want a good design that can go to kerbin\u0027s moon.\u003C/p\u003E\u003Cp\u003ECan anybody help?\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-06-26T18:22:29Z","Content":"\n\u003Cp\u003EThe Mun requires a lot more Delta-v than Minmus. I suggest trying for Minmus first, and then using Rockomax-size parts to attempt a Mun landing.\u003C/p\u003E\n"},{"CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-06-26T18:28:37Z","Content":"\n\u003Cp\u003EDon\u0027t worry, it took me about a month to learn to get into orbit, and yet another to get something on the Mun.\u003C/p\u003E\u003Cp\u003EAnd yes, minmus is easier, and if your cocky enough, you could try going to Eve first, because you can just do a parachute descent instead of using engines.\u003C/p\u003E\u003Cp\u003EBut I\u0027d advise minmus. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe reason some say you should go to the Mun first is two reasons:\u003C/p\u003E\u003Cp\u003E1. It has no inclination, so you only have to worry about two dimensions.\u003C/p\u003E\u003Cp\u003E2. It is closer to Kerbin (less DV to get up to its orbit, more to land there though)\u003C/p\u003E\n"},{"CreatedByName":"leptoon","CreatedById":71789,"CreatedDateTime":"2013-06-26T19:15:46Z","Content":"\n\u003Cp\u003EI went to the Mun first because I figured since it was closer, it must be easier to get to and land on. Well I was wrong.\u003C/p\u003E\n"},{"CreatedByName":"Sleipnir","CreatedById":58380,"CreatedDateTime":"2013-06-26T19:42:56Z","Content":"\n\u003Cp\u003EHere ya go:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25029-A-moon-rocket-and-moon-trip-walkthrough-for-newbies-(-20)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25029-A-moon-rocket-and-moon-trip-walkthrough-for-newbies-(-20)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eit also has a craft file you can download to try out or to get ideas from\u003C/p\u003E\n"},{"CreatedByName":"1001sd","CreatedById":57737,"CreatedDateTime":"2013-06-26T20:29:04Z","Content":"\n\u003Cp\u003EIt is easier to get to the Moon/Mun, but harder to land on, and it is harder to get to Minmus (and back), but it is easier to land on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E So it\u0027s your choice whether you want to make a heavy stage to get you there, or a heavy stage to land you.\u003C/p\u003E\u003Cp\u003EAnd welcome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lexter","CreatedById":72302,"CreatedDateTime":"2013-06-26T21:30:03Z","Content":"\n\u003Cp\u003EI suggest that you just try with probes in first place, as they are much easier to launch, so you can experimentate some designs, and then go on with manned missions \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kabloosh","CreatedById":72155,"CreatedDateTime":"2013-06-26T21:37:58Z","Content":"\n\u003Cp\u003EI built a rather large shuttle that can get to minimus or the mun and back. I have installed a mod called mech jeb and flight engineer. Mech Jeb is a semi auto pilot system that while you still need to put in the information but it will allow you to relatively take off or land on its own. This isn\u0027t always true because it isn\u0027t always perfect. It is however leagues ahead of me.\u003C/p\u003E\u003Cp\u003EI really only use flight engineer to keep track of my total delta V left, and it helps with building rockets that can take off, and have enough delta V to get places.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-06-27T11:20:31Z","Content":"\n\u003Cp\u003EFinally got serious about sending a probe to MUM. After several maneuvers, I achieved a stable close in orbit. Took several correction burns because one should split all burn time to stay on course. While tricky, you can correct orbital plane misalignment which should be done on the first burn. That is important when traveling to Kerbal\u0027s outer moon which lies on a different plane. Therefore, further fine tuning will only involve very short burn lasting only a few seconds.\u003C/p\u003E\u003Cp\u003EWill send a second probe with landing legs later tonight.\u003C/p\u003E\n"},{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-27T11:28:53Z","Content":"\n\u003Cp\u003EWow, thanks for all the help!\u003C/p\u003E\u003Cp\u003EAnyway, i made a rocket, launched it, and after some KM the rockomax engine overheats and explodes, and thus makes me unable to go further.\u003C/p\u003E\u003Cp\u003EAny help on that?\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-06-27T12:03:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xetalim\u0022 data-cite=\u0022Xetalim\u0022\u003E\u003Cdiv\u003EWow, thanks for all the help!\u003Cp\u003EAnyway, i made a rocket, launched it, and after some KM the rockomax engine overheats and explodes, and thus makes me unable to go further.\u003C/p\u003E\u003Cp\u003EAny help on that?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMust be the Mainsail. Place a small squat tank under the big orange one to resolve the overheating. If it persist, throttle back 5 to 10%.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-06-27T12:19:23Z","Content":"\n\u003Cp\u003EWith a mainsail engine attached directly to the orange jumbo tank, it will overheat if you use full throttle. If you set the throttle two notches above the 2/3 marker (next to the first \u0027T\u0027 in the word Throttle on the display) the engines will start overheating but they never get to the point where they explode.\u003C/p\u003E\u003Cp\u003EAn alternative is to attach one of the smaller tanks to the bottom of the jumbo, and attach the mainsail to that. For some reason that stops them overheating to the point of explosion, but they may need some strut work to keep them stable.\u003C/p\u003E\n"},{"CreatedByName":"Drunken Hobo","CreatedById":52000,"CreatedDateTime":"2013-06-27T12:43:01Z","Content":"\n\u003Cp\u003EKeep it simple with your first launch. You can make it to the Mun with a surprisingly tiny craft.\u003C/p\u003E\u003Cp\u003EA probe is probably the best bet for your first launch. If you can get a probe with an RTG, 3 doughnut fuel tanks \u0026amp; an ant engine into low Kerbin orbit then you can land on the Mun or Minmus easily.\u003C/p\u003E\u003Cp\u003EJust scale things up when ready to have a manned launch.\u003C/p\u003E\n"},{"CreatedByName":"Xiphos","CreatedById":60680,"CreatedDateTime":"2013-06-27T13:27:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunken Hobo\u0022 data-cite=\u0022Drunken Hobo\u0022\u003E\u003Cdiv\u003EKeep it simple with your first launch. You can make it to the Mun with a surprisingly tiny craft.\u003Cp\u003EA probe is probably the best bet for your first launch. If you can get a probe with an RTG, 3 doughnut fuel tanks \u0026amp; an ant engine into low Kerbin orbit then you can land on the Mun or Minmus easily.\u003C/p\u003E\u003Cp\u003EJust scale things up when ready to have a manned launch.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll second this option, but I\u0027d go for the one man pods. (I prefer manned pods for landers because they have more torque, allowing them to handle the weight of the lander) I made a ship a while back that could take off from kerbin, land on mun, then take off and land on minimus, then return back to kerbin. If you\u0027re interested in that craft let me know I\u0027ll post the file. Good luck, and keep things small.\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-06-27T20:21:14Z","Content":"\n\u003Cp\u003Ewhen the mainsail starts to overheat, back off the thrust a bit at a time (CTRL is defult), at about 85%, the temp should hold steady.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-06-27T20:38:39Z","Content":"\n\u003Cp\u003EGreetingz and salutations,\u003C/p\u003E\u003Cp\u003EI would concur with most of the opinions presented so far. A probe would be a good start. something small, with enough delta ( a small positioning stage maybe) to get it into a polar orbit. I would grab the MapSat mod now and beat the rush. Gives you a dish to put on your ship that scans the surface of a given celestial looking for anomalies and such. Polar orbit gives you the fullest scan. \u003C/p\u003E\u003Cp\u003EThis will give you practice with maneuvers nodes, trans orbitals, orbital injections, flight controls, getting orbits, and orbitals inclinations... a one stop training mission as it were.\u003C/p\u003E\u003Cp\u003EFor landers, I have basically given up on building those all on the ground. I send up my lander and dock it and the follow it up with my transfer stages in a second launch and dock to the lander. Easier to build on the design platform since all my big missions require it anyway\u003C/p\u003E\u003Cp\u003EAlacrity Fitz\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-06-28T04:45:37Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-28T15:40:43Z","Content":"\n\u003Cp\u003Ei actually am able to use maneuver nodes, getting into orbit, flying rockets and doing inclinations, the only problem is having a rocket able of getting to kerbin\u0027s moon\u003C/p\u003E\u003Cp\u003ESUCCESS\u003C/p\u003E\u003Cp\u003EI made it to MÃƒÂ¼n, refueled my ship using the kethane pack and got back to kerbin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-28T19:00:40Z\u0022 title=\u002206/28/2013 07:00  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 28, 2013\u003C/time\u003E by Xetalim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-06-28T19:18:31Z","Content":"\n\u003Cp\u003ECongratulations!\u003C/p\u003E\u003Cp\u003EI\u0027ve done a non-kethane Mun mission. My Kethane miners all, um... ran out of fuel in the decent. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E *heh* A redesign is in progress.\u003C/p\u003E\n"},{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-29T09:49:09Z","Content":"\n\u003Cp\u003EI actually am proud of myself, i landed with the Kerbal X, at night in IVA view.......\u003C/p\u003E\n"},{"CreatedByName":"Xiphos","CreatedById":60680,"CreatedDateTime":"2013-06-29T13:16:22Z","Content":"\n\u003Cp\u003E:cool:Wow, Congrats Xetalim! That was no small task! Good job!\u003C/p\u003E\n"},{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-06-29T16:20:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xiphos\u0022 data-cite=\u0022Xiphos\u0022\u003E\u003Cdiv\u003E:cool:Wow, Congrats Xetalim! That was no small task! Good job!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPS:\u003C/p\u003E\u003Cp\u003EWithout Scott Manley(yes him, the KSP hero) i couldn\u0027t have done it.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-06-29T16:35:46Z","Content":"\n\u003Cp\u003ENow that was a fast improvement. Nice!\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-07-02T14:45:12Z","Content":"\n\u003Cp\u003EScott Manley\u0027s videos are not the best for beginner learning because he uses mods too frequently. Try looking at HOC Gaming, Stomp Thomson, Operation Dx1, Trydyingtolive, etc. They don\u0027t use mods and if you look at some of their older videos you may find some Mun landing videos. If you are not an expert at maneuver nodes and orbiting, try figuring that out first. SuperWeegee is right, you can try to land on Minmus first, but it may require an inclination change to get there. I actually landed their first by accident.\u003C/p\u003E\n"},{"CreatedByName":"sanity","CreatedById":33997,"CreatedDateTime":"2013-07-02T14:57:43Z","Content":"\n\u003Cp\u003Ego to minmus first, it takes less fuel to get there and is much more forgiving when your landing, i know it looks like it takes more fuel to get there but it is actually a lot less fuel needed than the mun, also learn to use your maneuver nodes to go places\u003C/p\u003E\n"}]}