{"TopicId":35073,"ForumId":34,"TopicTitle":"[1.6] Davon Throttle Control systems mod [v088]","CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-06-28T00:42:09Z","PageNum":2,"Articles":[{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2013-09-08T21:59:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003EFirst of all thank you for the feedback, it\u0027s always nice to know someone is using your work. \u003Cp\u003EThe effect you mention is a known issue/feature. It could change it back to the normal behavior, but this made the center thrust mode more acute. However from the feedback I\u0027ve gotten from people actually using this mod nobody appears to be using this mode, which is interesting because it was the reason to make the mod in the first place, so I might change it to approach the normal behavior in future updates.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that\u0027s because the people who would use the thrust balancer portion go for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29387-Plugin-0-20-2-KerbCom-Avionics-0-2-0-1-%28July-2013%29-includes-VTOL-balancing\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E mod instead. That being said, the ability to do fine-tuning of specific engines is the thing that is unique about this mod.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-09-11T14:18:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Lone Wolfling\u0022 data-cite=\u0022The Lone Wolfling\u0022\u003E\u003Cdiv\u003EI think that\u0027s because the people who would use the thrust balancer portion go for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29387-Plugin-0-20-2-KerbCom-Avionics-0-2-0-1-%28July-2013%29-includes-VTOL-balancing\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E mod instead. That being said, the ability to do fine-tuning of specific engines is the thing that is unique about this mod.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I\u0027m familiar with the mod and I assumed the same. Already tested Kerbcom Avionics myself and, after ZRM added gimbal support, the behaviour is quite astounding. Unfortunately the stock engines don\u0027t have a big gimbal range so it fell a little short of what i had expected it to be. That said, it\u0027s still far more useful than my solution. It\u0027s always hard to kill your darlings.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdate:\u003C/strong\u003E Modified the mod so the engines follow the natural spool up time for engines on which it applies. Timed it with a stopwatch and acceleration and deceleration times are \u0027identical\u0027.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-10-18T17:06:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUpdate: \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Made mod compatible with KSP .22\u003C/p\u003E\u003Cp\u003EDecided to add the part to the \u0022Specialized Control\u0022 tech tree node for now. Testing showed the the plugin was still functional. Not much more to add. I am planning to update the GUI style and layout to something more pleasing on the eye in the near future. Aside from that I do not have any concrete planned features.\u003C/p\u003E\n"},{"CreatedByName":"TheBard","CreatedById":89636,"CreatedDateTime":"2013-10-21T19:43:03Z","Content":"\n\u003Cp\u003EIs it possible to bind an axis of a joypad/stick/hotas to one of the thruster gauges created with this mod? (Or would at least be possible for a mod to do that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-10-22T12:32:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EIs it possible to bind an axis of a joypad/stick/hotas to one of the thruster gauges created with this mod? (Or would at least be possible for a mod to do that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith the current mod I don\u0027t think it\u0027s possible to do so. I could create action groups for each extra throttle so the user could map a key to the action group. The user could then of course map this key to a button on a joystick, but for an additional throttles to be bound to an axis I wouldn\u0027t know how to facilitate that at this point.\u003C/p\u003E\n"},{"CreatedByName":"Konraden","CreatedById":63585,"CreatedDateTime":"2013-10-22T13:03:54Z","Content":"\n\u003Cp\u003EDo these functions impact fuel economy negatively? \u003C/p\u003E\u003Cp\u003EIf I set the engines to level off at say, 80%, and my throttle is at 100%, does that mean that my engines are 1. still running at 80% and 2. the fuel economy would be the same as if they\u0027re running at 80%?\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-10-23T07:56:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Konraden\u0022 data-cite=\u0022Konraden\u0022\u003E\u003Cdiv\u003EDo these functions impact fuel economy negatively? \u003Cp\u003EIf I set the engines to level off at say, 80%, and my throttle is at 100%, does that mean that my engines are 1. still running at 80% and 2. the fuel economy would be the same as if they\u0027re running at 80%?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, fuel is handled correctly, so in your example fuel would be expended at a level you would expect for an engine running at 80%.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-11-03T21:44:23Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUpdate:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-fixed bug concerning loading of engine profiles\u003C/p\u003E\n"},{"CreatedByName":"TheBard","CreatedById":89636,"CreatedDateTime":"2013-12-13T23:57:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003EWith the current mod I don\u0027t think it\u0027s possible to do so. I could create action groups for each extra throttle so the user could map a key to the action group. The user could then of course map this key to a button on a joystick, but for an additional throttles to be bound to an axis I wouldn\u0027t know how to facilitate that at this point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA bit late, but nonetheless, I felt again the need for that in a plane I was building so I looked a bit around... I noticed that on the sourcode for infernal robotics they call Unity\u0027s Input.GetKey function\u003C/p\u003E\u003Cp\u003Ewould adding on the OnUpdate override something like the line below work? (I\u0027m unsure how you would go about to find the axis name, googling for it)\u003C/p\u003E\u003Cp\u003Eif (joystickIsEnabled) throttle1 = UnityEngine.GetAxis(\u0022axisname\u0022);\u003C/p\u003E\n"},{"CreatedByName":"TheBard","CreatedById":89636,"CreatedDateTime":"2013-12-18T02:56:18Z","Content":"\n\u003Cp\u003EI actually tested out a bit, Input.GetAxis(\u0022axisname\u0022); works, returns a float between -1 and 1 and the AxisName in kerbal has been configurated in InputManager as joyX.Y where X is the number of the joypad in the array you get with Input.GetJoystickNames() and Y is the number of the axis.\u003C/p\u003E\u003Cp\u003EIs it ok if I use the mod code to mess around a bit and see if I can do something with it? I doubt I\u0027ll be able to make anything significant since I never tried modding for KSP before but who knows \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: 0.23 broke the mod\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T03:03:21Z\u0022 title=\u002212/18/2013 03:03  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by TheBard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-20T16:44:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EI actually tested out a bit, Input.GetAxis(\u0022axisname\u0022); works, returns a float between -1 and 1 and the AxisName in kerbal has been configurated in InputManager as joyX.Y where X is the number of the joypad in the array you get with Input.GetJoystickNames() and Y is the number of the axis.\u003Cp\u003EIs it ok if I use the mod code to mess around a bit and see if I can do something with it? I doubt I\u0027ll be able to make anything significant since I never tried modding for KSP before but who knows \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are free to mess around with the code. (The license also permits this.)\u003C/p\u003E\u003Cp\u003EA way to test it would be to go to the throttle window method, aptly named \u0022private void WindowGUITconfig(int windowID)\u0022\u003C/p\u003E\u003Cp\u003Eand add something along the line off:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EThrottleslider1 = (Input.GetAxis(\u0022axisname\u0022) \u002B 1) / 2 * 100;\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eat the top of the method. This would convert the axis value (-1 to 1) to a valid slider value (0 to 100). The rest of the code would then take things from there and apply it to the engines set to throttle1.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EPS: 0.23 broke the mod\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYip, just now downloaded .23. Not completely but there is definitely some new stuff going on: \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-An equivalent to the percentage throttle feature has now become a part of the vanilla game as the Limit thrust setting on individual engines. Because of this the percentage throttle mode in this mod will be eliminated. The other modes will be modified to take into account the limit thrust setting. These modifications have been completed and are currently in testing.\u003C/p\u003E\u003Cp\u003E-Also the center thrust mode will be eliminated altogether. Before the improved SAS I believe this feature would have been welcomed in the absence of better alternatives such as ZRM\u0027s Kerbcom Avionics. However at this point I do not believe many users would put up with the performance this mode delivers in its current state. \u003C/p\u003E\u003Cp\u003EI will try to deliver A 0.23 compatible version with the above adjustments in the weekend.\u003C/p\u003E\n"},{"CreatedByName":"NotCoach","CreatedById":91874,"CreatedDateTime":"2013-12-20T19:47:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003E Lastly there is the center thrust mode which was the original goal of the mod. Unfortunatly this mode has largely made obsolete by other mods. It works by making adjustments to individual engines to balance a ship and should make asymmetrical ships more feasible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbCom Avionics is in limbo right now, and latest release basically makes KSP unplayable in 0.23 (makes reaction wheels inoperable). I don\u0027t know if it will be updated any time soon, but does the above feature basically mirror KerbCom? And if so, are there any known conflicts with MechJeb? KerbCom is known to make MechJeb\u0027s auto-docking feature not work.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-21T13:45:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NotCoach\u0022 data-cite=\u0022NotCoach\u0022\u003E\u003Cdiv\u003EKerbCom Avionics is in limbo right now, and latest release basically makes KSP unplayable in 0.23 (makes reaction wheels inoperable). I don\u0027t know if it will be updated any time soon, but does the above feature basically mirror KerbCom? And if so, are there any known conflicts with MechJeb? KerbCom is known to make MechJeb\u0027s auto-docking feature not work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t mirror Kerbcom Avionics in that it doesn\u0027t balance RCS and doesn\u0027t use gimbal. Also the underlying approach is different; Kerbcom uses a complex mathematical model to calculate necessary thrust of every engine in one solution, this mod makes use of an algorithm to \u0027walk\u0027 the Center of Thrust onto the Center of Mass by making icremental engine adjustments. Previously its performance was slow and it couldn\u0027t work under autopilot and would take some extremely disciplined manual steering to get it to stay on course.\u003C/p\u003E\u003Cp\u003EBUT (really excited \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) based on this comment and some serendipitous insights I gained while bringing the mod on par with 0.23, I\u0027ve, instead of dumping the centre thrust mode, made some MAYOR improvements to it. \u003C/p\u003E\u003Cp\u003E-It is now so stable it can function under SAS (and with that likely also under Mechjeb).\u003C/p\u003E\u003Cp\u003E-It can balance thrust in a few seconds even while on the pad and still fastened in the launch clamps, allowing you to take of straight at the \u003C/p\u003E\u003Cp\u003Eexpense of a little fuel.\u003C/p\u003E\u003Cp\u003EStill testing and making improvements for the moment but it\u0027s starting to look like the mod I initially wanted to make!\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-22T23:11:42Z","Content":"\n\u003Cp\u003E1 Startup\u003C/p\u003E\u003Cp\u003E2 Main window\u003C/p\u003E\u003Cp\u003E3 Individual engine configuration\u003C/p\u003E\u003Cp\u003E4 Center Thrust\u003C/p\u003E\u003Cp\u003E5 Throttles\u003C/p\u003E\u003Cp\u003E6 Creating a ship profile\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#1 Startup\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdd the part \u0022differential thrust module\u0022 to your craft. You can find it under the control tab. It is unlocked with the \u0022Specialized Control\u0022 tech tree node. \u003C/p\u003E\u003Cp\u003EBefore any of the functions of the module can be used it must be activated. The system is initiated by clicking the TC icon in the toolbar or by right clicking on the part and selecting \u0022TC systems\u0022.\u003C/p\u003E\u003Cp\u003EThe module does make a backup of the configuration of the individual engine every ten seconds. When the module is reactivated at a later point, or when switching back to the vessel, it will automatically reload these settings to their respective engines and resume operations. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#2 main \u0022Module\u0022 window\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vlvXynb.png\u0022 alt=\u0022vlvXynb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EActivating the module will automatically open the main window. From this window you can acces a number of functions.\u003C/p\u003E\u003Cp\u003EAll normal: Returns all engines on the craft to normal operation.\u003C/p\u003E\u003Cp\u003ECenter thrust: This button opens the \u0022Center Thrust\u0022 window. This feature allows you to have the module automatically adjust the output of individual engines to bring the Center of Thrust behind the Center of Mass. See paragraph 4.\u003C/p\u003E\u003Cp\u003EThrottle 1-4: This button opens the throttle window. This window will give four additional throttles in the form of sliders. Engines can be slaved to these extra throttles, giving more sophisticated manual control over engines. See paragraph 5.\u003C/p\u003E\u003Cp\u003EProfiles: See paragraph 6\u003C/p\u003E\u003Cp\u003EDeactivate: This button deactivates the entire module. Note that this button is also the only way to completely deactivate the module. Clicking on the TC icon in the toolbar will only close any open windows but the module will keep on functioning.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#3 Individual engine configuration\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BLaSV10.png\u0022 alt=\u0022BLaSV10.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter activation each engine will have a number of additional settings. These settings have been integrated into the right click menu of the engine. From top to bottom.\u003C/p\u003E\u003Cp\u003EThrust Limit: This setting is present in the stock game. This setting will have the engine operate at a percentage of the requested thrust.\u003C/p\u003E\u003Cp\u003ELevel Thrust: This setting will level off the thrust when the engine output reaches the set percentage of the maximum thrust. For example: if this is set at 50% of an engine with a maximum thrust of 150 kN, the engine will operate normally up until 75 kn, above this level the engine will however hold at this thrust.\u003C/p\u003E\u003Cp\u003EThrottle: This setting allows you to select the throttle which should control this engine. 0 is the stock throttle while 1 through 4 correspond to the extra throttles this mod supplies. See parahraph 5 for further information.\u003C/p\u003E\u003Cp\u003ECenter Thrust: This toggle will determines the center thrust mode for the engine. It has three settings:\u003C/p\u003E\u003Cp\u003Eavailable: the default setting. In this setting the engine is available for center thrust mode corrections. \u003C/p\u003E\u003Cp\u003Edesignated: In this setting the engine is designated as a center thrust engine. If the center thrust mode is set to only make use of designated engines, see paragraph 4, only these engines will be adjusted to center the thrust.\u003C/p\u003E\u003Cp\u003Eignore: Engines set to this setting will not be taken into account in center of thrust calculations. This should only be used for engines facing in altogether different directions. This might be the case in certain VTOL designs.\u003C/p\u003E\u003Cp\u003Enet: This setting can toggled between connected and isolated. When set to \u0027Isolated\u0027 the engine will prevent the engine from being effected by the differential thrust module, additional throttles or other engines. By default this setting is set to \u0027Connected\u0027.\u003C/p\u003E\u003Cp\u003ESync all: Copies the settings of this engine to all engines of the same model. (unless these other engines are set to Isolated)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#4 Center Thrust\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3JGLChL.png\u0022 alt=\u00223JGLChL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis mode alters the thrust of individual engines to provide a centered thrust to an otherwise unbalanced craft. Although the mode can be used to successfully balance the thrust with a wide variety of vessels you do need some background information for its correct operation and you should read this section in full. \u003C/p\u003E\u003Cp\u003EThe center thrust window can be opened by right clicking on the part and selecting and selecting \u0022TC systems\u0022 and then clicking the Ã¢â‚¬Å“Center thrust modeÃ¢â‚¬Â button. This opens the center thrust config windwow. (The main \u0022Module\u0022 window can be closed if desired.) \u003C/p\u003E\u003Cp\u003EThe \u0022Center Thrust\u0022 window presents a number of options.\u003C/p\u003E\u003Cp\u003EDesignated/All: This toggle determines whether the center thrust mode uses all engines to center the thrust or only designated engines. See paragraph 3 on how to designate an engine to center thrust mode.\u003C/p\u003E\u003Cp\u003EOff/On: Toggles the center thrust mode on and off. When turned on all or a number of engines, depending on whether the mode is set to Designated or All, will be set to center thrust mode. (After turning on the center thrust mode the \u0022Center Thrust\u0022 window can itself be closed if desired.)\u003C/p\u003E\u003Cp\u003EDirection: This option opens the \u0022Direction\u0022 window. If your engines are facing in another direction then backward in relation to the command module the ship is currently controlled from, you should first try to select another command module or docking port. If this is not possible you can use the this window to select the direction the engines are facing in relation to the command module. \u003C/p\u003E\u003Cp\u003EThis mode makes incremental adjustments to individual engines to over time move the Center of Thrust onto the Center of Mass. In the current version these adjustments are done fast enough to give a near instant corrections when necessary \u003C/p\u003E\u003Cp\u003EThe center thrust mode assumes all active engines are facing the same direction. This might cause issues in certain VTOL designs which have separate engines for vertical and forward movement. For these specific situations the engines facing other directions should be set to \u0022ignore\u0022; this will cause these engines to be ignored in Center of Thrust calculations. \u003C/p\u003E\u003Cp\u003EFor VTOL designs Diazo\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50736-Vertical-Velocity-Control-in-1m-s-increments-with-compensation-for-vessel-angle\u0022 rel=\u0022external nofollow\u0022\u003EAutomated Vertical Velocity and Altitude Control\u003C/a\u003E can be use alongside this mod. It requires the vertical engines to be slaved to the main throttle. This mod can be used to automatically control the main throttle to have the VTOL craft to maintain a hover, or a gradual ascend or descend.\u003C/p\u003E\u003Cp\u003EThrottle Steering: When this option is enabled the center thrust mode will offset the center of thrust based on input from the controls and SAS. It will also be used by SAS to stabilize the craft. \u003C/p\u003E\u003Cp\u003EThe exact amount of torque supplied can be set. The resulting torque will linearly scale with the size of the input. This allows precise control when used in combination with joystick. When used in combination with SAS this will result in a smooth and constant engine output. \u003C/p\u003E\u003Cp\u003EThe possible torque of throttle steering will in many cases be far greater than what can be supplied by other forms of control. \u003C/p\u003E\u003Cp\u003EThe default torque value is relatively low, but when the torque is set sufficiently high it can be used in combination with SAS to balance the thrust in response to drag for large unsymmetrical crafts. This is something which the center thrust functionality alone could not do because it does not compensate for drag and drag forces on unsymmetrical vessels are often to strong to compensate by conventional controls. When using the throttle steering in in combination with SAS, monitor KSP\u0027s control indicators in the lower left of the screen. When any of the these indicators nearing their maximum it is an indication the current torque setting is too low to compensate for drag forces.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#4 Throttles\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yW53mQb.png\u0022 alt=\u0022yW53mQb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe module can supply four additional throttles. To access these throttles right click on the module and select Ã¢â‚¬Å“TC systemsÃ¢â‚¬Â and then click the Ã¢â‚¬Å“ThrottlesÃ¢â‚¬Â button. After setting engines to one of the additional throttles, see paragraph 3, these engines can be controlled by the corresponding sliders in this window.\u003C/p\u003E\u003Cp\u003EControls: this button opens the Controls window:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/buB35CE.png\u0022 alt=\u0022buB35CE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere you can link keyboard keys or joystick axis to a throttle. Select the throttle you want to set. \u003C/p\u003E\u003Cp\u003EEnter the keys for throttle up and throttle down. The names of keys follow this convention (without \u0022): \u003C/p\u003E\u003Cp\u003ENormal keys: \u0022a\u0022, \u0022b\u0022, \u0022c\u0022 ... \u003C/p\u003E\u003Cp\u003ENumber keys: \u00221\u0022, \u00222\u0022, \u00223\u0022, ... \u003C/p\u003E\u003Cp\u003EArrow keys: \u0022up\u0022, \u0022down\u0022, \u0022left\u0022, \u0022right\u0022 \u003C/p\u003E\u003Cp\u003EKeypad keys: \u0022[1]\u0022, \u0022[2]\u0022, \u0022[3]\u0022, \u0022[\u002B]\u0022, \u0022[equals]\u0022 \u003C/p\u003E\u003Cp\u003EModifier keys: \u0022right shift\u0022, \u0022left shift\u0022, \u0022right ctrl\u0022, \u0022left ctrl\u0022, \u0022right alt\u0022, \u0022left alt\u0022, \u0022right cmd\u0022, \u0022left cmd\u0022 \u003C/p\u003E\u003Cp\u003EMouse Buttons: \u0022mouse 0\u0022, \u0022mouse 1\u0022, \u0022mouse 2\u0022, ... \u003C/p\u003E\u003Cp\u003EJoystick Buttons (from any joystick): \u0022joystick button 0\u0022, \u0022joystick button 1\u0022, \u0022joystick button 2\u0022, ... \u003C/p\u003E\u003Cp\u003EJoystick Buttons (from a specific joystick): \u0022joystick 1 button 0\u0022, \u0022joystick 1 button 1\u0022, \u0022joystick 2 button 0\u0022, ... \u003C/p\u003E\u003Cp\u003ESpecial keys: \u0022backspace\u0022, \u0022tab\u0022, \u0022return\u0022, \u0022escape\u0022, \u0022space\u0022, \u0022delete\u0022, \u0022enter\u0022, \u0022insert\u0022, \u0022home\u0022, \u0022end\u0022, \u0022page up\u0022, \u0022page down\u0022 \u003C/p\u003E\u003Cp\u003EFunction keys: \u0022f1\u0022, \u0022f2\u0022, \u0022f3\u0022, ...\u003C/p\u003E\u003Cp\u003EAlternatively enter the joystick number and axis number. This can be usually be accomplished with trial an error. Both joystick number and axis number start of from 0. So if you have one joystick with three axis the joystick number is likely 0 and the correct axis number is either 0, 1 or 2. \u003C/p\u003E\u003Cp\u003EPress \u0027Set\u0027 to commit the chosen controls. If both data for keys and for joystick is enter the throttle will default to keys. \u003C/p\u003E\u003Cp\u003EPress \u0027Clear\u0027 to remove current control settings from a throttle. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E#7 Creating a ship profile\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wTkfKzt.png\u0022 alt=\u0022wTkfKzt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERight click on the module and select Ã¢â‚¬Å“TC systemsÃ¢â‚¬Â and then click the Ã¢â‚¬Å“ProfilesÃ¢â‚¬Â button. In this window you can save and load profiles for use in multiple ships of the same type. In addition to the configuration of individual engines this mode also saves all the other module settings.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPro tips.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-If engines burn a different speed they will run out of fuel a different times.\u003C/p\u003E\u003Cp\u003E-Be carefull when trying to switch engines to different throttles while mid burn. This will hardly never work out exactly like imagined. \u003C/p\u003E\u003Cp\u003E-The configuration of individual engines is only backed up into the central module every ten seconds. This should be taken into account when saving the game. For example: after making prelaunch adjustments to engines configuration you should wait ten seconds before making a your prelaunch quicksave.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-25T19:20:07Z\u0022 title=\u002207/25/2015 07:20  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 25, 2015\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheBard","CreatedById":89636,"CreatedDateTime":"2013-12-23T02:21:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003E1 Startup\u003Cp\u003E2 Main window\u003C/p\u003E\u003Cp\u003E3 Individual engine configuration\u003C/p\u003E\u003Cp\u003E4 Center Thrust\u003C/p\u003E\u003Cp\u003E5 Throttles\u003C/p\u003E\u003Cp\u003E6 Saving and loading\u003C/p\u003E\u003Cp\u003E7 Creating a default ship profile\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat update! And thanks for the Joystick, now I\u0027m out for the holidays so I have no way to test it, if it helps (and you haven\u0027t noticed already) from what I tested before leaving home some axis on the joysticks need an \u0022invert\u0022 options, for example all the throttle levers on the Saitek X65F have a value of 1 on the \u0022off\u0022 state, and decreases to -1 while you throttle up.\u003C/p\u003E\u003Cp\u003EA question out of curiosity, I\u0027ve been looking at the code and I saw that (at least the .22 version) you added a module to the engines when the ship is loaded and saved in some strange way the values. I was wondering why is that, wouldn\u0027t adding the module to all engines using ModuleManager let you save all the configurations you need in the added module normally? Is it because that way you can add it to all engines without making a .cfg file for all engine/mods or is there another reason?\u003C/p\u003E\u003Cp\u003EThanks again for the mod, I can\u0027t wait to test it properly, especially now with the improvements.\u003C/p\u003E\n"},{"CreatedByName":"Absolute Human","CreatedById":73157,"CreatedDateTime":"2013-12-23T07:29:33Z","Content":"\n\u003Cp\u003EThose fancy options are great, but does this mode have the old good throttle steering option?\u003C/p\u003E\u003Cp\u003EI may have missed it somewhere in the thread, then excuse my reading. I remember testing the mentioned Throttle Steering mod, and although it definitelly have had some issues, ASAS seemed to center thrust quite well just by applying inputs without any \u0022center thrust\u0022 options, simply by trial and error. Not to neglect any advantages of having many accessable options, but the simplier is the better, huh? Assymetrical fuel consumption is not a big problem when you have a cluster of engines beneath one tank, or you can use the fuel balancer mod.\u003C/p\u003E\u003Cp\u003EAlso, I remember some other mod, not sure how it was called, that implemented \u0022Isp prioritisation option\u0022 for current throttle. It is harder to make working, but is a good option for final enhanced features.\u003C/p\u003E\u003Cp\u003EAnd the last, it is not entirely related to your mod, but there just aren\u0027t any working thrust correctors for 0.23 since \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37251-0-20-2-Project-Arcturus-Thrust-Corrector-Remission-and-Range-Safety\u0022 rel=\u0022external nofollow\u0022\u003EArcturus\u003C/a\u003E stopped working. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E And no, don\u0027t point me at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52882-0-22-Kerbal-Isp-Difficulty-Scaler-v1-2\u0022 rel=\u0022external nofollow\u0022\u003EKIDS\u003C/a\u003E. It, once again, has a lot of different options but not the desired realistic \u0022smaller thrust in atmosphere instead of enormous fuel consumption\u0022 that was the goal of Arcturus \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So, yeh, once you now how thrust adjustment work in current version, you could probably fix or rework it, I think it just needs a small hotfix, since the new VAB thrust limiting function broke its logic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-23T07:35:40Z\u0022 title=\u002212/23/2013 07:35  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 23, 2013\u003C/time\u003E by Absolute Human\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-23T13:50:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EGreat update! And thanks for the Joystick, now I\u0027m out for the holidays so I have no way to test it, if it helps (and you haven\u0027t noticed already) from what I tested before leaving home some axis on the joysticks need an \u0022invert\u0022 options, for example all the throttle levers on the Saitek X65F have a value of 1 on the \u0022off\u0022 state, and decreases to -1 while you throttle up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the joystick support is still very basic. Will add an invert option soon. Also currently the joystick settings can only be saved in a profile, this will also be changed in later versions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EA question out of curiosity, I\u0027ve been looking at the code and I saw that (at least the .22 version) you added a module to the engines when the ship is loaded and saved in some strange way the values. I was wondering why is that, wouldn\u0027t adding the module to all engines using ModuleManager let you save all the configurations you need in the added module normally? Is it because that way you can add it to all engines without making a .cfg file for all engine/mods or is there another reason?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have thought about using module manager. Module manager does allow you to add a module to for example every part with an engine module so creating a .cfg file for every engine is not required. However the way this mod takes control over engines is a little invasive. It works for the stock engines but I\u0027d hate to be the one to break another mod which gives a specialized engine. This is why I\u0027ve chosen to add to modules to the engine dynamically during flight after activation of the module. This way the mod can be turned on and off. In the current version the central module does make regular backups of the configuration of individual engines and automatically loads this back to the engine if it\u0027s reactivated at a later point or returning to a save. This makes settings to engines persistent.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBard\u0022 data-cite=\u0022TheBard\u0022\u003E\u003Cdiv\u003EThanks again for the mod, I can\u0027t wait to test it properly, especially now with the improvements.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour welcome, I\u0027m quite proud of the last version.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Absolute Human\u0022 data-cite=\u0022Absolute Human\u0022\u003E\u003Cdiv\u003EThose fancy options are great, but does this mode have the old good throttle steering option?\u003Cp\u003EI may have missed it somewhere in the thread, then excuse my reading. I remember testing the mentioned Throttle Steering mod, and although it definitelly have had some issues, ASAS seemed to center thrust quite well just by applying inputs without any \u0022center thrust\u0022 options, simply by trial and error. Not to neglect any advantages of having many accessable options, but the simplier is the better, huh? Assymetrical fuel consumption is not a big problem when you have a cluster of engines beneath one tank, or you can use the fuel balancer mod.\u003C/p\u003E\u003Cp\u003EAlso, I remember some other mod, not sure how it was called, that implemented \u0022Isp prioritisation option\u0022 for current throttle. It is harder to make working, but is a good option for final enhanced features.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis mod does not have a throttle steering option, although Ruffus\u0027s mod might still work .23.\u003C/p\u003E\u003Cp\u003EThe center thrust mode adjust the thrust of individual engines so the CoT lines up with the CoM. ASAS does not do this.\u003C/p\u003E\u003Cp\u003ETo illustrate take the following vessel:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9xsYM70.png\u0022 alt=\u00229xsYM70.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn short this vessel is completely unbalanced. Normally such a vessel would immediately veer off after launch and plow itself into KSP\u0027s lawn maybe a little over thirty meters from the launch pad. No manual steering or SAS would be able to prevent this. The center thrust mod will however downregulate some of the outer engines, in this particular example, in such a way that the combined thrust of all the engines lies directly behind the CoM, which will allow the vessel to take of straight. After decoupling one of the outer engine mid flight the center thrust mod will rebalance the remaining outer engines and central skipper to again produce a centered thrust. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Absolute Human\u0022 data-cite=\u0022Absolute Human\u0022\u003E\u003Cdiv\u003EAnd the last, it is not entirely related to your mod, but there just aren\u0027t any working thrust correctors for 0.23 since \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37251-0-20-2-Project-Arcturus-Thrust-Corrector-Remission-and-Range-Safety\u0022 rel=\u0022external nofollow\u0022\u003EArcturus\u003C/a\u003E stopped working. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E And no, don\u0027t point me at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52882-0-22-Kerbal-Isp-Difficulty-Scaler-v1-2\u0022 rel=\u0022external nofollow\u0022\u003EKIDS\u003C/a\u003E. It, once again, has a lot of different options but not the desired realistic \u0022smaller thrust in atmosphere instead of enormous fuel consumption\u0022 that was the goal of Arcturus \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So, yeh, once you now how thrust adjustment work in current version, you could probably fix or rework it, I think it just needs a small hotfix, since the new VAB thrust limiting function broke its logic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso had some issues with my mod after the .23 update, it was a indeed small hotfix to make it compatible. CaptainArbitrary, hasn\u0027t been around for a few months. I\u0027ll take a look at this and see if it can be fixed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-23T13:57:11Z\u0022 title=\u002212/23/2013 01:57  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 23, 2013\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Absolute Human","CreatedById":73157,"CreatedDateTime":"2013-12-23T19:36:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003ERuffus\u0027s mod might still work .23\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe, the problem is it always worked kinda strange, I\u0027ve tested it few versions ago, and was quite impressed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003ENo manual steering or SAS would be able to prevent this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, I mean Throttle Steering actually could!\u003C/p\u003E\u003Cp\u003EWhen your launched an unbalanced craft with it, ASAS (I mean the computer, not the reaction wheel) started to make corrections and they affected the very throttle steering option, making pointing in the right direction possible. That said, it potentially covered your center thrust AND throttle steering option. If you can steer, so why not to simply steer up? The problem of Ruffus\u0027s mod was in its weird behaviour in certain situations. For example, you were going up slightly swaying from side to side, and then, after one bigger swing ALL your thrusters started to bate thrust and you quickly found your rocket falling rotating to the ground with almost no thrust. At least I remember it happening. Another thing was when you had thrust set to zero and then started to turn with \u0022throttle steering\u0022 on: engines on one side began to burn... or maybe that happened only when you had RCS on. So, \u0022ItÃ¢â‚¬â„¢s like RCS.\u0022 as his spaceport page says. I mean, it didn\u0027t really maintain the summary thrust equal to throttle, that was the problem. If it also has a limiter for the correction value, about 10%-50% but 100%, It would a very-very good plugin, as now it only counts as an experiment. Why am I saying it to you? Well, there is not such mod around here, and your mod is related with thrust adjusments, and seems pretty promising. I can\u0027t believe that thrust correction wouldn\u0027t been accepted and come handy in the community. What is the fun in building big wide skycranes if you can steer them only with reaction wheels or RCS? Yep, consider it.\u003C/p\u003E\u003Cp\u003EAnd It will be great if you can fix Arcturus\u0027s corrector.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-24T08:14:17Z\u0022 title=\u002212/24/2013 08:14  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 24, 2013\u003C/time\u003E by Absolute Human\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-25T21:27:34Z","Content":"\n\u003Cp\u003EOkay, made some small updates to the last update.\u003C/p\u003E\u003Cp\u003E-Aside from joystick support the mod now also has keyboard support for the additional throttles, joystick axis can be inverted.\u003C/p\u003E\u003Cp\u003E-In regard to the center thrust mode an engine can be set to not be taken into account. This can be useful for engines which provide thrust in other directions than the one in which the center thrust mode is currently active. Important for VTOL designs.\u003C/p\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2013-12-26T00:21:31Z","Content":"\n\u003Cp\u003ECool mod! Does it work with dtobi\u0027s shuttle engines mod?\u003C/p\u003E\u003Cp\u003EEdit: did some testing, and no unfortunately... The mod has naturally angled engines(that can be pitched to any angle), which means it\u0027s possible for you to have a fuel tank attached without a rocket, but this mod can\u0027t angle the rockets to stabilise(here\u0027s a pic to help you understand)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8imE3dj.png\u0022 alt=\u00228imE3dj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see when i decouple the boosters there will be a tank full of fuel and no rocket.\u003C/p\u003E\u003Cp\u003EIt would be awesome to see support for this kind of thing!(pitch-able vectoring etc.) Again great mod, just doesn\u0027t like working with shuttles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-26T00:59:39Z\u0022 title=\u002212/26/2013 12:59  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 26, 2013\u003C/time\u003E by Boamere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"evilC","CreatedById":60370,"CreatedDateTime":"2013-12-26T16:51:39Z","Content":"\n\u003Cp\u003EStumbled across this thread and I thought I would chip in...\u003C/p\u003E\u003Cp\u003ERegarding sticks, I have a couple of utilities that could be of some use to users of this mod.\u003C/p\u003E\u003Cp\u003EThe first is called \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/26379-UJR-Universal-Joystick-Remapper-Fixes-problems-with-sticks-in-KSP\u0022 rel=\u0022external nofollow\u0022\u003EUJR \u003C/a\u003E and will allow people to create a virtual joystick with inverted axes if required. This is also useful for other things in KSP, such as making an XBOX pad work better, or combining two racing pedals into a virtual rudder.\u003C/p\u003E\u003Cp\u003EThe second is currently in it\u0027s infancy. It is called \u003Ca href=\u0022http://evilc.com/files/ahk/misc/multithrottle.ahk\u0022 rel=\u0022external nofollow\u0022\u003EMultiThrottle\u003C/a\u003E and is another virtual stick app that is designed to let you emulate multiple throttle levers using one physical throttle. ie in this mod, it would let you control all engines with one throttle, but you hold one button to make your throttle control one engine and a different button to make the throttle control another engine.\u003C/p\u003E\u003Cp\u003EAs it stands, MultiThrottle requires you to install AutoHotkey and my ADHD library, plus configure some values in the source script, but ultimately it should be a stand-alone EXE like UJR, with all options selectable using a GUI. For more information on setting it up, view the source.\u003C/p\u003E\u003Cp\u003EBeing still in it\u0027s infancy, I am open to suggestions as to how the whole thing should work when it is finished.\u003C/p\u003E\u003Cp\u003Eenjoy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lantay77","CreatedById":94971,"CreatedDateTime":"2013-12-29T22:24:21Z","Content":"\n\u003Cp\u003EI have been looking for this mod for a while, searching the forums for \u0022throttle\u0022 and \u0022engine\u0022 because I forgot what it was called. Can you put \u0022throttle\u0022 in the title? It might help people find it. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-30T13:04:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Absolute Human\u0022 data-cite=\u0022Absolute Human\u0022\u003E\u003Cdiv\u003EAnd It will be great if you can fix Arcturus\u0027s corrector.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay finally got around to do this. As I attempted to compile the unaltered code to see how it functions in game and how the new 0.23 ModuleEngine conflicts with the mod which wasn\u0027t apparent from the code, I ended already solving the problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the \u003Ca href=\u0022https://www.dropbox.com/s/7sfi3vld6i2mlsl/ArcturusThrustCorrectorStrawberry.zip\u0022 rel=\u0022external nofollow\u0022\u003Edownload link\u003C/a\u003E. If you or anyone familiar with the mod could verify its correct functioning? In my testing the mod did reduces the max thrust at sealevel which slowly climbed up to close to the normal maximum at around 35.000 meter.\u003C/p\u003E\u003Cp\u003E-The license as provided by the CaptainArbitrary is as follows: \u0022All the source code is available. Anybody\u0027s free to take it and do whatever they want with it. Go nuts.\u0022 \u003C/p\u003E\u003Cp\u003E-Source code is part of the download.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-18T20:53:23Z\u0022 title=\u002201/18/2014 08:53  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 18, 2014\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Desrtfox","CreatedById":80185,"CreatedDateTime":"2013-12-30T15:59:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Absolute Human\u0022 data-cite=\u0022Absolute Human\u0022\u003E\u003Cdiv\u003EThose fancy options are great, but does this mode have the old good throttle steering option?\u003Cp\u003EI may have missed it somewhere in the thread, then excuse my reading. I remember testing the mentioned Throttle Steering mod, and although it definitelly have had some issues, ASAS seemed to center thrust quite well just by applying inputs without any \u0022center thrust\u0022 options, simply by trial and error. Not to neglect any advantages of having many accessable options, but the simplier is the better, huh? Assymetrical fuel consumption is not a big problem when you have a cluster of engines beneath one tank, or you can use the fuel balancer mod.\u003C/p\u003E\u003Cp\u003EAlso, I remember some other mod, not sure how it was called, that implemented \u0022Isp prioritisation option\u0022 for current throttle. It is harder to make working, but is a good option for final enhanced features.\u003C/p\u003E\u003Cp\u003EAnd the last, it is not entirely related to your mod, but there just aren\u0027t any working thrust correctors for 0.23 since \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37251-0-20-2-Project-Arcturus-Thrust-Corrector-Remission-and-Range-Safety\u0022 rel=\u0022external nofollow\u0022\u003EArcturus\u003C/a\u003E stopped working. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E And no, don\u0027t point me at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52882-0-22-Kerbal-Isp-Difficulty-Scaler-v1-2\u0022 rel=\u0022external nofollow\u0022\u003EKIDS\u003C/a\u003E. It, once again, has a lot of different options but not the desired realistic \u0022smaller thrust in atmosphere instead of enormous fuel consumption\u0022 that was the goal of Arcturus \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So, yeh, once you now how thrust adjustment work in current version, you could probably fix or rework it, I think it just needs a small hotfix, since the new VAB thrust limiting function broke its logic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIncidentally, KIDS does have the ISP thrust adjustment option. It\u0027s in the Stock KSP section, and it\u0027s called \u0022Thrust varies with ISP\u0022\u003C/p\u003E\u003Cp\u003EI\u0027ve used Arcturus up until it stopped working, and I\u0027ve always liked it\u0027s simplicity. I\u0027m going to compare KIDS to the updated Arcturus mod and see how they differ.\u003C/p\u003E\n"},{"CreatedByName":"Ratzap","CreatedById":75982,"CreatedDateTime":"2013-12-30T23:37:01Z","Content":"\n\u003Cp\u003EOne thing I noticed trying this out just now is that using the centered thrust stops my sepatrons from firing. A normal run with mechjeb in control they fire off with each staging as usual. I put the control part for this on, configured the booster motors for centered thrust and the sepatrons don\u0027t fire when staging. I tried setting the sepatrons as \u0027ignore\u0027 and the net off but it still doesn\u0027t fire them.\u003C/p\u003E\n"}]}