{"TopicId":35107,"ForumId":21,"TopicTitle":"It Appears to be Powered by Witchcraft","CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2013-06-28T06:43:41Z","PageNum":1,"Articles":[{"CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2013-06-28T06:43:41Z","Content":"\n\u003Cp\u003EBut seriously, this plane is absolutely ridiculous. It has a glide ratio of \u003Cem\u003EI don\u0027t even know\u003C/em\u003E (this may be the result of KSP\u0027s aerodynamics--not sure. Enlighten?). It took me almost 20 minutes to bring it from 3000m to landing--it just insisted on going forward at about 150 m/s and not stopping \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E (I added the air-brakes after that). With that kind of lift, I reckon this thing could get a respectable way around the planet. For an (almost) first try at planes, that\u0027s not half bad, IMO. Also, at only 13.5 tons (and it could really be a lot lighter. Most of that fuel is unnecessary, and I could easily ditch one, or maybe even 2 of the engines) it\u0027d probably work fairly well on Laythe as well. \u003C/p\u003E\u003Cp\u003EThat said, it is a first try, and some pointers to make it a bit more controllable or efficient (or turn it into an SSTO \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E) would be very much appreciated. I\u0027m fairly pleased with the aesthetics--keeping them as similar to the current design as possible would be a plus.\u003C/p\u003E\u003Cp\u003EMods used:\u003C/p\u003E\u003Cp\u003E-Reaction Wheel Mod (beats tacking on random probe cores) \u003C/p\u003E\u003Cp\u003E-Taverio\u0027s Aerospace and Pizza\u003C/p\u003E\u003Cp\u003E-B9 (a little bit)\u003C/p\u003E\u003Cp\u003EIf there\u0027s any interest, I can make the .craft file available.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E It appears that the revised version has a less enormous glide ration. On the other hand, it also seems to be hugely more controllable. Ditching the diagonal tailfin seems to have been what did it. I might be able to lose all those compressed air thrusters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i882.photobucket.com/albums/ac29/TalkingHat/Itappearstorunonwitchcraft.jpg\u0022 alt=\u0022Itappearstorunonwitchcraft.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-28T06:50:27Z\u0022 title=\u002206/28/2013 06:50  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 28, 2013\u003C/time\u003E by Sauron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2013-06-28T21:42:17Z","Content":"\n\u003Cp\u003EActually, I\u0027ve got a request to add as well. How the heck do you get something like this into orbit (WITHOUT making it an SSTO)? It\u0027s too unbalanced to launch even on significantly overporwered rockets. Any thoughts here, guys?\u003C/p\u003E\n"},{"CreatedByName":"deker13","CreatedById":43554,"CreatedDateTime":"2013-06-30T00:14:52Z","Content":"\n\u003Cp\u003Eadd struts to be balancing out the mass. you know, like sticking out a stick? that \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Emight\u003C/span\u003E work. just sayin.\u003C/p\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-06-30T00:19:26Z","Content":"\n\u003Cp\u003EAh.... the inifinite glide phenomona... good times, good times.\u003C/p\u003E\n"},{"CreatedByName":"deker13","CreatedById":43554,"CreatedDateTime":"2013-06-30T00:21:26Z","Content":"\n\u003Cp\u003Ethought it was only in 0.13. guess not.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-06-30T10:06:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003EActually, I\u0027ve got a request to add as well. How the heck do you get something like this into orbit (WITHOUT making it an SSTO)? It\u0027s too unbalanced to launch even on significantly overporwered rockets. Any thoughts here, guys?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPut the rocket on top of the payload. The reason everybody finds so difficult to launch winged vehicles with rockets is that you want the center of lift behind the center of mass, not the other way around. So instead, it usually happens that you are trying to fly an arrow going backwards, with the fins on the front, and of course it then wants to tip over.\u003C/p\u003E\u003Cp\u003EYou could also add more lifting surfaces to the rocket, but if you say this has a lot of lift, it will end up being a lot of parts to do so. I\u0027d go with a \u0022T\u0022 design, with the payload hanging from a big core tank, the engines on pods on the sides of it, and side boosters attached to the top. It will also be more structurally sound if it\u0027s a tractor system (stuff works better at tension regarding structural strengths).\u003C/p\u003E\u003Cp\u003ERune. Basically, a rocket also has to be able to fly straight by being aerodynamically stable, even in KSP\u0027s physics.\u003C/p\u003E\n"},{"CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2013-06-30T18:20:10Z","Content":"\n\u003Cp\u003EI solved the orbiting problem. Because the wings are so big, and because plane and rocket controls don\u0027t always agree when mixed together, launching two planes at the same time so the flaps cancel each other out in the first 30km of the launch has been the easiest solution to the problem so far. I was going to bring two of them to Laythe anyway, so better to do two launches in one. It\u0027s not as if 13 tons (or less--I trimmed the design further to around 10-11 tons) x2 is challenging mass-wise \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been measuring the glide ratio it gets, and have mostly found that Kerbal engineer tends to lie about your vertical speed every now and then. I have an absolute lower bound of 20:1 (probably closer to 40-50), but that\u0027s without repeatedly pulling up and diving. If I had an effective way to measure the distance between landmarks on Kerbin I\u0027d have a better idea. Also, this is one *very* stable plane. Completely idiot-proof, and I\u0027m a dreadful pilot (I think I\u0027m going to run with flying wings at this point. It seems to be working well for me.) It doesn\u0027t freak out at the slightest tap of a key, it\u0027s well balanced (not perfectly--it rolls a little bit when I\u0027m yawing on account of the slightly angled stabilizers at the end of the wings, and it\u0027s very slightly rear-heavy. Neither of these things have much impact on the actual flying). Also, it can land backwards. Don\u0027t ask. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, my experiments at making it into an SSTO seem to be running headfirst into the mass death-spiral. What\u0027s the best way to approach this. Also, how should I configure my jets and fuel? What kinds of ratios work?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-30T18:45:00Z\u0022 title=\u002206/30/2013 06:45  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 30, 2013\u003C/time\u003E by Sauron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-06-30T21:01:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003EHowever, my experiments at making it into an SSTO seem to be running headfirst into the mass death-spiral. What\u0027s the best way to approach this. Also, how should I configure my jets and fuel? What kinds of ratios work?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it is because of flameouts, it\u0027s nice to know that the last engine you place while building will flame out first. So go for uneven number of jet engines, and place the center one last so you have a warning when you are courting disaster. I usually use less than 150l of fuel for each jet on planes, and less on VTOL\u0027s. Also, T/W on jets of about 0,5 for winged stuff, and on rockets it really depends on how much you airhog: you can circularize on ions if you spam intakes to fly on jets until 2,200 m/s, but you want over 1 T/W is your cutoff speed is under 1,500 m/s.\u003C/p\u003E\u003Cp\u003EFor beginners, that\u0027s two LV-909\u0027s for each jet engine or thereabouts. And it is recommended to start with single-jet small SSTOs.\u003C/p\u003E\u003Cp\u003ERune. Now go run some numbers!\u003C/p\u003E\n"}]}