{"TopicId":35196,"ForumId":16,"TopicTitle":"Using gravity of Eve to get to Moho easier.","CreatedByName":"thrashing mad","CreatedById":61251,"CreatedDateTime":"2013-06-28T22:05:49Z","PageNum":1,"Articles":[{"CreatedByName":"thrashing mad","CreatedById":61251,"CreatedDateTime":"2013-06-28T22:05:49Z","Content":"\n\u003Cp\u003EI can perform Mun-\u0026gt;Minmus gravity assist just fine, but is it possible/feasible to use this technique with Eve-\u0026gt;Moho? Real life Mariner 10 probe, en route to Mercury, used Venus\u0027 gravity this way after all. \u003C/p\u003E\u003Cp\u003EAny clues? It doesn\u0027t have to be precise, first approach maneuver since Kerbin, Eve and Moho would have to be in a specific position relative to each other I think. I\u0027m just wondering how to lower my solar orbit to Moho level, by using Eve flyby. Or in other words - how to get to Moho cheaper by using Eve flyby?\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-06-28T22:23:39Z","Content":"\n\u003Cp\u003EThis could work. It would need to be timed perfectly though.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-06-28T22:49:30Z","Content":"\n\u003Cp\u003EYou\u0027d either need to calculate the right launch window to make it happen in one go, or you could launch and get your gravity brake at Eve and set your solar periapsis to the correct altitude. You\u0027d then need to make an adjustment burn at periapsis to get your Moho encounter. It\u0027s that last bit that can be problematic, since the burn is going to be costly at those speeds.\u003C/p\u003E\u003Cp\u003EI haven\u0027t done the math or anything, but I would be surprised if you could save much delta-v with a multiple burn approach. I\u0027ve got no good idea for how to calculate the launch window times for a one shot mission.\u003C/p\u003E\u003Cp\u003EIn any case, if you want to play with it, you\u0027d just need to set up an Eve encounter and play around with the maneuver node until you get an orbit (post Eve encounter) that is sufficiently low. If you do it early enough in the process there shouldn\u0027t be much difference between a gravity brake and gravity assist as far as your initial launch goes.\u003C/p\u003E\n"},{"CreatedByName":"thrashing mad","CreatedById":61251,"CreatedDateTime":"2013-06-29T01:15:46Z","Content":"\n\u003Cp\u003EOK, I\u0027ve done some testing.\u003C/p\u003E\u003Cp\u003ELaunched same probe from Kerbin\u0027s orbit (using quickload)\u003C/p\u003E\u003Cp\u003EFirst up - direct transfer to Moho:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/1_zps73eb6dce.jpg\u0022 alt=\u00221_zps73eb6dce.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext - transfer to Eve first:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/2_zps2588ee57.jpg\u0022 alt=\u00222_zps2588ee57.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlmost there - performed maneuver to bring Pe closer to the planet, and at the correct side of it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/3_zps4af2e6c6.jpg\u0022 alt=\u00223_zps4af2e6c6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt appears that it lowered my new solar orbit with mere 100m/s delta V:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/4_zpse7d945b4.jpg\u0022 alt=\u00224_zpse7d945b4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne more smallish burn planned at Periapsis:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/5_zpsb1473953.jpg\u0022 alt=\u00225_zpsb1473953.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWorked great - with tiny loss of fuel I have my orbit intersecting that of Moho:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/6_zpsa9950ac5.jpg\u0022 alt=\u00226_zpsa9950ac5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd after two solar orbits, and another minor maneuver, I have Moho encounter:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i424.photobucket.com/albums/pp328/thrashing_mad2/7_zps84b4fd5c.jpg\u0022 alt=\u00227_zps84b4fd5c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo yeah - it seems to work. With direct transfer I had 79,9 fuel left, with gravity assist 91,8. Not a large amount of saved fuel, but I think that with more efficient maneuvering effects could be even better. Also, with larger lander/return missions this might be quite significant.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-06-29T01:27:05Z","Content":"\n\u003Cp\u003EWhere you hit Moho in its orbit makes a big difference. One thing I\u0027ve seen a few people do to good effect is using the Eve gravity assist mostly for the plane change (best to hit Eve when it\u0027s at a node relative to Moho). And Moho\u0027s period is so quick, it likely won\u0027t take too long to get the Moho encounter. You also don\u0027t have to do all of the braking while you\u0027re in Moho\u0027s SoI (though you\u0027ll lose a bit of Moho-Oberth effect if you don\u0027t), you can bring your apoapsis down a bit with a node placed when you cross Moho\u0027s orbit even if Moho isn\u0027t there at the same time. You can easily get an encounter by tuning the intermediate orbit period, and this first phasing maneuver will save you on the Moho capture burn.\u003C/p\u003E\n"},{"CreatedByName":"maackey","CreatedById":39248,"CreatedDateTime":"2013-06-29T01:32:19Z","Content":"\n\u003Cp\u003EIdeally you\u0027d have Eve be at/near Moho\u0027s descending/ascending node by the time you get captured, get into a polar orbit/periapse/flyby and boost yourself up/down depending on where you are relative to Moho\u0027s inclination. To time it, you could see how long it takes to get to eve from kerbin, measure the distance, and wait until Eve is approximately the same distance from one of Moho\u0027s inclination nodes. \u003C/p\u003E\u003Cp\u003EI\u0027ve never tried it, this is purely theoretical, but it should work.\u003C/p\u003E\u003Cp\u003Eedit: ninja\u0027d to hell, I\u0027m super slow at posting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bigpapabearxx","CreatedById":30899,"CreatedDateTime":"2013-06-30T04:07:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thrashing mad\u0022 data-cite=\u0022thrashing mad\u0022\u003E\u003Cdiv\u003EI can perform Mun-\u0026gt;Minmus gravity assist just fine, but is it possible/feasible to use this technique with Eve-\u0026gt;Moho? Real life Mariner 10 probe, en route to Mercury, used Venus\u0027 gravity this way after all. \u003Cp\u003EAny clues? It doesn\u0027t have to be precise, first approach maneuver since Kerbin, Eve and Moho would have to be in a specific position relative to each other I think. I\u0027m just wondering how to lower my solar orbit to Moho level, by using Eve flyby. Or in other words - how to get to Moho cheaper by using Eve flyby?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is very inefficient to use the moons as a gravity assist. Scott made it to Jool with gravity assists and save about 1000m/s dv.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lIORB7svhaA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-01T05:16:20Z","Content":"\n\u003Cp\u003EADDIT: watched the Scott video linked above and that did clarify a lot of my questions, but still would love to see more discussion of these issues.\u003C/p\u003E\u003Cp\u003EHow do the real life astrophysicists determine these things? For example, who figured out that the \u0022Grand Tour\u0022 alignment that allowed Voyager 1 and 2 would exist and that the missions needed to when they did?\u003C/p\u003E\u003Cp\u003EI understand the basic premise of a gravity assist and have managed to bumble my way through a few in game; a couple of which actually seemed to help my velocity quite a bit. However, the math for describing one of these interactions is beyond me.\u003C/p\u003E\u003Cp\u003E1. Is it possible to \u0027master\u0027 the art of gravity assists using mostly intuition or is it really necessary to get into the maths?\u003C/p\u003E\u003Cp\u003E2. Also, how does one use the in game map or other tools (mods? addons?) to judge when celestial bodies are in good alignment for a series of fly bys?\u003C/p\u003E\u003Cp\u003E3. I\u0027ve looked around for discussions on the concepts of planning and executing gravity assists in Kerbal and haven\u0027t found anything that clarifies what exactly are the good alignments. Any links to something like that would be much appreciated.\u003C/p\u003E\u003Cp\u003E4. It would appear that approaching for an exact optimum angle (and not simply from behind and slightly orthogonal to the assisting bodies trajectory) can make a big difference to how these work out. Out of the six or so I\u0027ve done (all using Mun) I would say two of them actually seemed to backfire and slow me down else throw me into some crazy escape trajectory that only made matters worse (and no I didn\u0027t approach from the braking angle [from in front of the approaching planet and slightly orthogonal] I don\u0027t think). \u003C/p\u003E\u003Cp\u003EThe ones that seem to have imparted the most delta-V are when I was actually yanked out of my approach trajectory and swung into a new trajectory. In one case, I literally was yanked around in front of the Mun and then approached it nearly head on and achieved about a 5000m periapsis.\u003C/p\u003E\u003Cp\u003EBased on this I have a few working principles on how to perform these but would love to learn more short of getting into the math.\u003C/p\u003E\u003Cp\u003EA. Use a periapsis burn to extend an apoapsis close to the planets orbit: not sure if this apoapsis should be inside its SOI band or just outside it or perhaps even beyond its orbital path? Also not sure if the exact time and place of the periapsis burn can be eyeballed based on the position of the assisting body?\u003C/p\u003E\u003Cp\u003EB. Time warp and wait for an encounter to show on the map (this part seems really amateurish; would love to be able to launch on a specific time and day and know that a particular rendezvous was optimal). When an encounter is plotted, try to use some very minimal burns to get a suitable fly-by setup. I find the map a bit difficult to work with at this stage, and judging whether a particular encounter really is or is not suitable for a fly by seems difficult with the way the periapsis projection markers are shown and do not show up when you shift focus.\u003C/p\u003E\u003Cp\u003EC. Try to shift orbit so that it is more circular around the apoapsis to see if this will improve the fly by, in the sense of reducing the periapsis at the assisting body and giving a good escape trajectory (short of entering the atmosphere I understand the most delta-V will come from the closest fly-by).\u003C/p\u003E\u003Cp\u003ED. I have no idea what to make of the escape trajectories. Is it really possible to eyeball these and the positions of other farther away bodies and judge whether they are good enough or should be adjusted?\u003C/p\u003E\u003Cp\u003EE. Burning at the periapsis, or thereabouts can further augment the \u0027sling shot effect.\u0027 However, in several of my fly bys, the trajectory that I would\u0027ve expected based on the \u0022escape Mun\u0022 and/or \u0022escape Kerbin\u0022 marker seemed irrelevant and I rather quickly just clicked back into an orbit around the sun.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-01T15:11:27Z\u0022 title=\u002208/01/2013 03:11  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 1, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-03-21T01:50:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EADDIT: watched the Scott video linked above and that did clarify a lot of my questions, but still would love to see more discussion of these issues.\u003Cp\u003EHow do the real life astrophysicists determine these things? For example, who figured out that the \u0022Grand Tour\u0022 alignment that allowed Voyager 1 and 2 would exist and that the missions needed to when they did?\u003C/p\u003E\u003Cp\u003EI understand the basic premise of a gravity assist and have managed to bumble my way through a few in game; a couple of which actually seemed to help my velocity quite a bit. However, the math for describing one of these interactions is beyond me.\u003C/p\u003E\u003Cp\u003E1. Is it possible to \u0027master\u0027 the art of gravity assists using mostly intuition or is it really necessary to get into the maths?\u003C/p\u003E\u003Cp\u003E2. Also, how does one use the in game map or other tools (mods? addons?) to judge when celestial bodies are in good alignment for a series of fly bys?\u003C/p\u003E\u003Cp\u003E3. I\u0027ve looked around for discussions on the concepts of planning and executing gravity assists in Kerbal and haven\u0027t found anything that clarifies what exactly are the good alignments. Any links to something like that would be much appreciated.\u003C/p\u003E\u003Cp\u003E4. It would appear that approaching for an exact optimum angle (and not simply from behind and slightly orthogonal to the assisting bodies trajectory) can make a big difference to how these work out. Out of the six or so I\u0027ve done (all using Mun) I would say two of them actually seemed to backfire and slow me down else throw me into some crazy escape trajectory that only made matters worse (and no I didn\u0027t approach from the braking angle [from in front of the approaching planet and slightly orthogonal] I don\u0027t think). \u003C/p\u003E\u003Cp\u003EThe ones that seem to have imparted the most delta-V are when I was actually yanked out of my approach trajectory and swung into a new trajectory. In one case, I literally was yanked around in front of the Mun and then approached it nearly head on and achieved about a 5000m periapsis.\u003C/p\u003E\u003Cp\u003EBased on this I have a few working principles on how to perform these but would love to learn more short of getting into the math.\u003C/p\u003E\u003Cp\u003EA. Use a periapsis burn to extend an apoapsis close to the planets orbit: not sure if this apoapsis should be inside its SOI band or just outside it or perhaps even beyond its orbital path? Also not sure if the exact time and place of the periapsis burn can be eyeballed based on the position of the assisting body?\u003C/p\u003E\u003Cp\u003EB. Time warp and wait for an encounter to show on the map (this part seems really amateurish; would love to be able to launch on a specific time and day and know that a particular rendezvous was optimal). When an encounter is plotted, try to use some very minimal burns to get a suitable fly-by setup. I find the map a bit difficult to work with at this stage, and judging whether a particular encounter really is or is not suitable for a fly by seems difficult with the way the periapsis projection markers are shown and do not show up when you shift focus.\u003C/p\u003E\u003Cp\u003EC. Try to shift orbit so that it is more circular around the apoapsis to see if this will improve the fly by, in the sense of reducing the periapsis at the assisting body and giving a good escape trajectory (short of entering the atmosphere I understand the most delta-V will come from the closest fly-by).\u003C/p\u003E\u003Cp\u003ED. I have no idea what to make of the escape trajectories. Is it really possible to eyeball these and the positions of other farther away bodies and judge whether they are good enough or should be adjusted?\u003C/p\u003E\u003Cp\u003EE. Burning at the periapsis, or thereabouts can further augment the \u0027sling shot effect.\u0027 However, in several of my fly bys, the trajectory that I would\u0027ve expected based on the \u0022escape Mun\u0022 and/or \u0022escape Kerbin\u0022 marker seemed irrelevant and I rather quickly just clicked back into an orbit around the sun.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis are good questions.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-03-21T02:45:19Z","Content":"\n\u003Cp\u003EIn the real world, gravity assists are planned with proper tools and a lot of iterative work. When a probe launch may cost hundreds of millions, it\u0027s really cheap to hire a bunch of PhDs for a few years to plan the mission. In KSP, things are much simpler, but planning the gravity assists still often requires a lot of work.\u003C/p\u003E\u003Cp\u003EThe basic idea is this: Given a delta-v budget for the launch, you have a bunch of launch windows, where you will end up with an encounter with one planet or another. For each launch window, you have a range of possible values for the time and the location of the encounter and the velocity at the encounter. Then, given a delta-v budget for course corrections and a combination of parameter values for the encounter, you have a departure window, which tells when and where you can depart from the planet, and with what velocity. Some of these departure windows contain encounters with some other planet, and these encounters transform into a number of possible departure windows from that planet. Intuition will help to guess, which branches are worth investigating first, but there is still a lot of exploratory work to be done.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-03-21T04:05:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bigpapabearxx\u0022 data-cite=\u0022bigpapabearxx\u0022\u003E\u003Cdiv\u003EIt is very inefficient to use the moons as a gravity assist. Scott made it to Jool with gravity assists and save about 1000m/s dv.\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lIORB7svhaA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003EMun to Minmus is fine, albeit offering only modest savings, since you\u0027re not trying to leave Kerbin\u0027s SOI. Likewise using gravity assists to get around the Jool system.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EADDIT: watched the Scott video linked above and that did clarify a lot of my questions, but still would love to see more discussion of these issues.\u003Cp\u003E\u0026lt;snip\u0026gt;\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E1: Master, probably not without complicated maths and planning. Get competent in, though, yes.\u003Cp\u003E2: It helps to increase your conic patch limit in the configs - letting you see more encounters in advance. In particular, you can see what your orbit will be after the gravity assist.\u003C/p\u003E\u003Cp\u003E4: Indeed the angle of entry is important, along with how close to the assisting body you get - generally you don\u0027t need to get super-close. Typically if you approach from behind and below a body you\u0027ll get a boost, hence why it\u0027s easy to get ejected from Kerbin\u0027s SOI with a Munar gravity assist. I believe if you pass in front of the assisting body you\u0027ll tend to get a drop. In any case, the aforementioned conic patch limit lets you work out these things more easily.\u003C/p\u003E\u003Cp\u003EOther questions: If you\u0027re planning on a burn, you do indeed want a nice low periapsis; the faster you\u0027re moving, the more energy the burn gives (or takes from) you. That\u0027s why it\u0027s not helpful to use the Mun to leave Kerbin\u0027s SOI; you\u0027re going faster in low Kerbin orbit so you\u0027re better just doing a transfer burn there. If you aren\u0027t planning on a burn, a low periapsis isn\u0027t important.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-21T05:32:31Z","Content":"\n\u003Cp\u003EI actually caught a gravity assist off Tylo coming up from Vall to help set up my inclination for Bop, it\u0027s probably one of the better things you can do with gravity assists when they happen to be set up right ... oh, and the Mun actually is of use on the way out from Kerbin, it\u0027s just that it\u0027s not a huge boost and makes things even more touchy in getting where you\u0027re going.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-03-21T23:01:03Z","Content":"\n\u003Cp\u003ENormally I\u0027d close something that\u0027s been raised up from the depths like this, but since it\u0027s still pretty relevant and has sparked a productive discussion, in the words of a popular image macro: \u003Cem\u003E\u0022I\u0027ll allow it.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EGetting back to the topic at hand: I\u0027ve found the Flyby Maneuver Sequencer that comes with Arrowstar\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-11-2-Mission-Architect-Pre-release-1%21\u0022 rel=\u0022external nofollow\u0022\u003ETrajectory Optimization Tool\u003C/a\u003E to be extremely handy for plotting missions that involve using a gravity assist from one body to get to another. From what I gather, though, there\u0027s no easy solution to finding the optimal launch window, so the program has to \u0022brute-force\u0022 a solution by calculating the equations for several different alignments and picking the best from the lot.\u003C/p\u003E\n"},{"CreatedByName":"Gravitas Shortfall","CreatedById":82354,"CreatedDateTime":"2014-03-21T23:27:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EHow do the real life astrophysicists determine these things? For example, who figured out that the \u0022Grand Tour\u0022 alignment that allowed Voyager 1 and 2 would exist and that the missions needed to when they did?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EComputers and and lots of clever math: \u003Ca href=\u0022http://www.esa.int/gsp/ACT/inf/projects/gtop/gtop.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/gsp/ACT/inf/projects/gtop/gtop.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve looked briefly at using \u003Ca href=\u0022http://pagmo.sourceforge.net/pagmo/index.html\u0022 rel=\u0022external nofollow\u0022\u003EPaGMO\u003C/a\u003E to calculate trajectories in KSP, but ran into trouble getting things to compile and run on Windows. I\u0027ll probably give it another try at some point, but I wouldn\u0027t complain if someone with either a Linux machine or more experience with Visual Studio decided to beat me to it.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-03-22T07:02:13Z","Content":"\n\u003Cp\u003EHow about the viability of setting up a fuel station in Eve orbit?\u003C/p\u003E\u003Cp\u003EI\u0027m planning a mission there anyway, and Eve is apparently easy to get to in terms of DeltaV from Kerbin. I figure that topping my Moho mission up there would be effective, and allow me to drag less weight in fuel tanks down into Moho orbit.\u003C/p\u003E\u003Cp\u003EPlus, Gilly has wonderfully low gravity to get Kethane out of.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-22T07:33:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EOther questions: If you\u0027re planning on a burn, you do indeed want a nice low periapsis; the faster you\u0027re moving, the more energy the burn gives (or takes from) you. That\u0027s why it\u0027s not helpful to use the Mun to leave Kerbin\u0027s SOI; you\u0027re going faster in low Kerbin orbit so you\u0027re better just doing a transfer burn there. If you aren\u0027t planning on a burn, a low periapsis isn\u0027t important.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really true.\u003C/p\u003E\u003Cp\u003EIf you\u0027re planning a burn, you need to set up your periapsis so you get deflected the correct way after the burn. Your burn will add kinetic energy to your craft, it will \u0022open\u0022 the slingshot trajectory a little. So you need to set up the slingshot for slightly tighter angle (lower periapsis) than you really need, then open it with your burn.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EHow about the viability of setting up a fuel station in Eve orbit?\u003Cp\u003EI\u0027m planning a mission there anyway, and Eve is apparently easy to get to in terms of DeltaV from Kerbin. I figure that topping my Moho mission up there would be effective, and allow me to drag less weight in fuel tanks down into Moho orbit.\u003C/p\u003E\u003Cp\u003EPlus, Gilly has wonderfully low gravity to get Kethane out of.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re free to build fuel stations anywhere you want. But it does not count as gravity slingshot if you stop there.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-22T13:38:57Z","Content":"\n\u003Cp\u003EA full refuel and relaunch from Eve MIGHT help you out ... it might not, too, it REALLY depends on the launch windows unless you\u0027re willing to aim for the best point then do an adjustment burn to get the right period to your orbit.\u003C/p\u003E\u003Cp\u003EIt does sound easier than plotting out the slingshot, just make sure you use the Oberth effect.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-03-22T15:08:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EHow about the viability of setting up a fuel station in Eve orbit?\u003Cp\u003EI\u0027m planning a mission there anyway, and Eve is apparently easy to get to in terms of DeltaV from Kerbin. I figure that topping my Moho mission up there would be effective, and allow me to drag less weight in fuel tanks down into Moho orbit.\u003C/p\u003E\u003Cp\u003EPlus, Gilly has wonderfully low gravity to get Kethane out of.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI\u0027m going to set up a refuel station for my planned manned mission to Eve surface. I think the main issue is delta-v for the Eve-Gilly burn which, due Gilly\u0027s high inclination, is relatively high. So, if you\u0027re ferrying fuel from Gilly, the lower gravity is compensated by the fact that your tanker needs enough fuel to go back to Gilly from Eve\u0027s orbit.\u003Cp\u003EMe thinks the best location for such a station might actually be in Gilly\u0027s orbit, not Eve\u0027s. And if you\u0027re planning to use it to refuel interplanetary flights, then you have the issue of getting to Gilly to refuel instead of using the fuel to go straight to your destination. So, it might not be worth it.\u003C/p\u003E\u003Cp\u003EBut maybe someone already did something like this and can answer better.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-03-22T15:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022juanml82\u0022 data-cite=\u0022juanml82\u0022\u003E\u003Cdiv\u003EI\u0027m going to set up a refuel station for my planned manned mission to Eve surface. I think the main issue is delta-v for the Eve-Gilly burn which, due Gilly\u0027s high inclination, is relatively high. So, if you\u0027re ferrying fuel from Gilly, the lower gravity is compensated by the fact that your tanker needs enough fuel to go back to Gilly from Eve\u0027s orbit.\u003Cp\u003EMe thinks the best location for such a station might actually be in Gilly\u0027s orbit, not Eve\u0027s. And if you\u0027re planning to use it to refuel interplanetary flights, then you have the issue of getting to Gilly to refuel instead of using the fuel to go straight to your destination. So, it might not be worth it.\u003C/p\u003E\u003Cp\u003EBut maybe someone already did something like this and can answer better.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGilly\u0027s gravity is tiny, and any station would be close to Gilly\u0027s orbital path in order to minimise dV used getting to it. Otherwise, I\u0027m not above simply refueling the interplanetary missions via tanker. They\u0027re usually complex trains of modules hauled by a space tug anyway, and induce a lot of lag BEFORE a station nears them. And they\u0027re a pig to turn.\u003C/p\u003E\n"},{"CreatedByName":"elmarko","CreatedById":27856,"CreatedDateTime":"2014-03-22T18:49:49Z","Content":"\n\u003Cp\u003EThe next trick is to copy the MESSENGER probe and use repeated flybys of Moho to reduce your solar apoapsis gradually to reduce your needed dV to brake at Moho.\u003C/p\u003E\n"},{"CreatedByName":"kinnison","CreatedById":68083,"CreatedDateTime":"2014-03-22T23:02:51Z","Content":"\n\u003Cp\u003EMy dad back in the 60s took a collage physics course and the final exam they had to calculate a Earth, Venus, Earth, mars trip with slide rulers. \u003C/p\u003E\u003Cp\u003EBut honestly, these days they just use a few astrophysicists and some time on a supercomputer.\u003C/p\u003E\n"},{"CreatedByName":"Iansoreta","CreatedById":23122,"CreatedDateTime":"2014-08-24T00:58:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bigpapabearxx\u0022 data-cite=\u0022bigpapabearxx\u0022\u003E\u003Cdiv\u003EIt is very inefficient to use the moons as a gravity assist. Scott made it to Jool with gravity assists and save about 1000m/s dv.\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lIORB7svhaA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, its not a good IDEA to use moons, unfortunately moon encounter happened to me while I performed trans-Duna injection burn, but at least I performed course correction burn to correct that error, even performing plane change maneuver with less delta-v for low altitude approach.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-24T01:31:03Z","Content":"\n\u003Cp\u003ECheck the Times. It take few more years to get to destinations. Compared with direct burn... I rather think of how to get more dv from launch than to save dv.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-24T01:47:12Z","Content":"\n\u003Cp\u003EWell, travel time doesn\u0027t really matter in the game. You can send a Kerbal on a hundred-year trip in a 1-man pod if you want, and even if you\u0027d rather not (or you run a life support mod) there are always unmanned missions.\u003C/p\u003E\n"}]}