{"TopicId":35521,"ForumId":16,"TopicTitle":"How to launch a control a liquid rocket?","CreatedByName":"sonik","CreatedById":72973,"CreatedDateTime":"2013-07-01T20:13:49Z","PageNum":1,"Articles":[{"CreatedByName":"sonik","CreatedById":72973,"CreatedDateTime":"2013-07-01T20:13:49Z","Content":"\n\u003Cp\u003EHi, IÃ‚Â´ve a small problem with the first campaign of the tutorials, the rocket age (yes, I know, the need of help in this early stage itÃ‚Â´s a kind of embarrassing).\u003C/p\u003E\u003Cp\u003ESo... I have the liquid fuel rocket (mk-6XL parachute, RC-001S Remote Guidance Unit, z-500 battery, FL-T400 fuel tank and an LV-T30 engine) and the mission is to lit-off and head eastward but, and here comes the problem, when I try to make a lateral movement (or above 5km) the rocket begin to spin around and itÃ‚Â´s out of control. I\u0027ve try to add some cannards at the bottom but i can do anything.\u003C/p\u003E\u003Cp\u003EI know that de simple way is using a SAS but I want to do it without any computer help.\u003C/p\u003E\u003Cp\u003EThanls\u003C/p\u003E\n"},{"CreatedByName":"Nasakev","CreatedById":72681,"CreatedDateTime":"2013-07-01T23:24:43Z","Content":"\n\u003Cp\u003EIs this the tutorial where you have to calm a spinning craft or one of the scenarios?\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-07-01T23:37:23Z","Content":"\n\u003Cp\u003EAre you spinning like a top (rolling) or flipping end over end? \u003C/p\u003E\u003Cp\u003EIf it\u0027s the former, I don\u0027t know what the problem might be. You could have a keybind messed up or if you have a joystick it might be active at the wrong time (check your roll axis instrument to see if it is pegged to one side or the other.)\u003C/p\u003E\u003Cp\u003EMore likely it\u0027s the latter, and it\u0027s due to a lack of control in the rocket you\u0027ve built. You\u0027ve got a very small probe module for your command module. Without additional help in the form of thrust vectoring, RCS, or control surfaces, it just doesn\u0027t have the power to keep the rocket on track. As a result your angle of attack for maneuvering is very limited (or you\u0027ll spin out.) You might try using an LV-T45 engine, as that will give you thrust vectoring and much much better control over your rocket. You could also replace the probe (or augment it) with a manned capsule, as those have far greater turning power.\u003C/p\u003E\u003Cp\u003EETA:\u003C/p\u003E\u003Cp\u003EI\u0027m assuming you built this rocket yourself, rather than it being supplied by the game. I don\u0027t have any tutorials that feature a rocket of the type you describe.\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2013-07-01T23:47:27Z","Content":"\n\u003Cp\u003EJason\u0027s got it. Put a thrust-vectoring engine on there and you should be fine.\u003C/p\u003E\u003Cp\u003EHere\u0027s the reason for your problem: Once you get to high altitudes, tail fins and winglets don\u0027t have as much authority and all that matters is drag. The parachutes have a higher drag than the other parts, and (with the way the game calculates drag) that means that any vehicle with a parachute on the front is going to have the center of drag ahead of the center of mass, which means it\u0027s aerodynamically unstable (it flips over).\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2013-07-02T00:08:57Z","Content":"\n\u003Cp\u003Ethe trick is, at this stage of the campaign, you can only use a LVT 30 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eone problem with aerodynamically unstable crafts, would be to be more gentle while turning (do not wander too far away from your prograde marker, or your rocket will tumble - typically, high chances of tumbling would be when you go over 20 / 25Ã‚Â° away from your prograde marker. - i\u0027d say, just to be safe, while turning, don\u0027t move farther than 10Ã‚Â° away from your prograde marker - and then let it follow your heading. - don\u0027t go directly to a 45Ã‚Â° heading, make a nice smooth curve instead \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (i was testing with a floating beacon carried by LVT30 with winglets at the bottom of the LVT30\u0027s FLT800 - the beacon was around 4 tons, with quite a lot of parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E, including 4 parachutes and a drogue) \u003C/p\u003E\u003Cp\u003Ean analogy would be to try to make a sharp 90Ã‚Â° turn at high speed with your car - you have all the chance in the world of losing control of it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E - but if you have a nice long curve to make this 90Ã‚Â° turn, you can make this turn with your car easily at high speed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T00:14:59Z\u0022 title=\u002207/02/2013 12:14  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"}]}