{"TopicId":35646,"ForumId":16,"TopicTitle":"Jet engines on rockets; viable?","CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-02T19:03:30Z","PageNum":1,"Articles":[{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-02T19:03:30Z","Content":"\n\u003Cp\u003EI had a thought. Jet engines are more fuel-efficient than rockets, especially at lower altitudes where you need more thrust. So, is it viable to mount them vertically on a rocket in order to get a better fuel economy that way?\u003C/p\u003E\u003Cp\u003EWhen do they cut out?\u003C/p\u003E\u003Cp\u003EAre they better than using mainsail engines?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-03T19:02:08Z\u0022 title=\u002207/03/2013 07:02  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 3, 2013\u003C/time\u003E by Skorpychan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tobmaster","CreatedById":57953,"CreatedDateTime":"2013-07-02T19:09:12Z","Content":"\n\u003Cp\u003EThey do work, I\u0027ve used them for some launches. Rough estimate is that they cut out at 20,000 or so - depending on velocity and # of intakes.\u003C/p\u003E\u003Cp\u003EI usually stick with normal rocket engines for most things.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-02T19:11:38Z","Content":"\n\u003Cp\u003EThat isn\u0027t very high up at all, and barely worth attaching the damned things.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-07-02T19:12:18Z","Content":"\n\u003Cp\u003EJet engine first stages are viable, and allow for vastly higher payload fractions. The downsides are increases in design and ascent profile complexity, and the risk of an asymmetrical flameout causing mission failure. Also, you need rather more parts than a mainsail-based design.\u003C/p\u003E\u003Cp\u003EKwirkyJ\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27113-%28series%29-GORP-lifters\u0022 rel=\u0022external nofollow\u0022\u003EGORP\u003C/a\u003E and especially \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/37842-%28series%29-HELPr-lifters\u0022 rel=\u0022external nofollow\u0022\u003EHELPr\u003C/a\u003E craft provide good examples.\u003C/p\u003E\u003Cp\u003Eedit: My own tests point to a single turbojet \u002B Mk2 fuselage \u002B appropriate intake spam being able to lift 7\u002B tonnes into a 75x30 km orbit. If you wish, you can add 0.2-0.5 tonnes of rockets \u002B oxidizer to circularize without touching the payload.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T19:15:05Z\u0022 title=\u002207/02/2013 07:15  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by UmbralRaptor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-02T20:05:43Z","Content":"\n\u003Cp\u003EWhat, seriously? That\u0027s amazing. It may replace my seven mainsail design for lofting things up.\u003C/p\u003E\u003Cp\u003EAlso, \u0027appropriate intake spam\u0027. That sort of implies \u0026gt;1 intake per engine. What\u0027s the ratio, and the best intake to use?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T20:23:45Z\u0022 title=\u002207/02/2013 08:23  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by Skorpychan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-07-02T20:36:44Z","Content":"\n\u003Cp\u003EI\u0027m actually unsure of the best ratio, just that it\u0027s at least 4 per engine. Probably more if each engine is pushing a lot of mass. Fuel requirement is ~120 units per engine, at least with how I fly. For this, the ram intake is by far the best choice.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-02T21:18:25Z","Content":"\n\u003Cp\u003EJet engines have effective Isp above 10,000s -- they\u0027re crazy efficient. They differ from rockets in a few key ways:\u003C/p\u003E\u003Cp\u003E1. They take time to spin up. I often attach fuel tanks to the launch clamps, along with fuel lines, to spin them up to about 90% thrust.\u003C/p\u003E\u003Cp\u003E2. The thrust changes with your speed. The turbojet has half thrust when you\u0027re stationary, full thrust at 1km/s, and half thrust again at 2 km/s (and down from there).\u003C/p\u003E\u003Cp\u003EIt\u0027s reasonable to slap on basic jets to push you up to 10km -- that\u0027ll save you close to 1 km/s from your rockets. Even better, use turbojets and ride them to 20 km. Now you\u0027ll be at 2% air pressure, basically vacuum conditions.\u003C/p\u003E\u003Cp\u003E1 intake takes you to 21 km. Triple the number of intakes to increase your ceiling by 5 km (3 intakes -\u0026gt; 26 km, 9 intakes -\u0026gt; 31 km, etc). Cut your throttle to 1/3rd to climb another 5km.\u003C/p\u003E\n"},{"CreatedByName":"jgjiscool","CreatedById":5044,"CreatedDateTime":"2013-07-03T00:09:42Z","Content":"\n\u003Cp\u003EI have used jet engines on rockets, but I find SRBs are simpler to use and don\u0027t require as much \u0027preperation\u0027.\u003C/p\u003E\u003Cp\u003EJets:\u003C/p\u003E\u003Cp\u003E\u0026gt; Turn on\u003C/p\u003E\u003Cp\u003E\u0026gt; Wind up\u003C/p\u003E\u003Cp\u003E\u0026gt; Burn some fuel (Less weight is better because, let\u0027s be honest, you ain\u0027t gonna use all that fuel)\u003C/p\u003E\u003Cp\u003E\u0026gt; Fire main stage\u003C/p\u003E\u003Cp\u003E\u0026gt; Lose thrust due to needing to reduce throttle so mainsail engines don\u0027t go bye-bye\u003C/p\u003E\u003Cp\u003ESRBs:\u003C/p\u003E\u003Cp\u003E\u0026gt; Fire everything\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-03T00:37:22Z","Content":"\n\u003Cp\u003EThis is an example of \u0027intake spamming\u0027\u003C/p\u003E\u003Cp\u003EI\u0027m actually quite proud of it regardless \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.catalystservers.com/hoy/ksp/Firebat%200.jpg\u0022 alt=\u0022Firebat%200.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s 36 intakes for 5 turbojets. That\u0027s enough to get me to orbital speeds with an 8t payload on the nose with all 5 engines going, but with a LOT of manual piloting you can shut the outer 4 engines off and use all 36 intakes for the center engine. It puts out a whooping 0.4kn of thrust at 69,400 meters, which is only slightly worse than an ion engine. \u003C/p\u003E\u003Cp\u003EIt\u0027s also got 2 LVN motors mounted on the sides, to get it to an 80km circular orbit only uses 70 meters per second worth of rocket fuel, leaving close to 3500 once the jet fuel tanks are nearly empty. \u003C/p\u003E\u003Cp\u003EI\u0027ve flown this from the launch pad, to orbit, to Laythe,, dropped its 3 t payload in orbit, landed on Laythe, then taken off from Laythe and returned to Kerbin. It required a couple gravity assists between Tylo and Vall on the way out of The Joolian system, and them many years in interplanetary due to the bad exit trajectory and almost no fuel remaing.. But the point is Jets are amazing for Hybrid rockets!!!\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-03T10:34:51Z","Content":"\n\u003Cp\u003EHmm... I\u0027ll have to try slapping my standard upper stages onto them, and see how it works.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-07-03T11:02:20Z","Content":"\n\u003Cp\u003EWhy aren\u0027t they very popular then? I have always wanted to use jets for high payload launches, but their unpopularity led me to believe there is some hidden flaw.\u003C/p\u003E\u003Cp\u003EMaybe they just require manual flying, which I\u0027d love to do?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-03T11:04:02Z","Content":"\n\u003Cp\u003EYeah, I\u0027ve built some experimental SSTOs that use combination of rocket and jet power, but follow the standard ascent profile of a rocket.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhy aren\u0027t they very popular then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause of how many engines and intakes you need to make it work.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-07-03T11:36:52Z","Content":"\n\u003Cp\u003EThis thread could provide some inspiration on jet powered rockets :\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36419-Smallest-Craft-to-Various-Milestones\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/36419-Smallest-Craft-to-Various-Milestones\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMaybe we need a challenge along the lines of highest tonnage to orbit with jet powered rockets?\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-07-03T12:41:36Z","Content":"\n\u003Cp\u003EYou can use jets on lighter spacecraft for the first stage. They should get you to at least 20km, so you can use them for part of your gravity turn as well. If you have a heavy payload, I\u0027d say anything around 100t, then just put more asparagus. To lift 400-500t I needed about 60(!) or so jet engines. They lag a lot more than rocket engines too. You can feed maybe 6-8 jets from one jet fuel tank easily, don\u0027t put one tank per engine.\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-07-03T12:54:58Z","Content":"\n\u003Cp\u003EJet engines compare similarly to SRB\u0027s as a first stage. Except require 4x the part count, plus a bit more manual planning and piloting. SRB\u0027s keep the part count low and the potential for horrible-Kerbal-ending crashes.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-07-03T14:03:19Z","Content":"\n\u003Cp\u003EThe jet fuel tanks tend to hold too much but even if you can\u0027t set it up to run out just before flameout and have to stage manually it still makes a great lightweight first stage to get you past 15-20km. The multiple intakes are only needed if you want to do it plane still and use jets for 60-80% of your DeltaV, for a simple rocket-style flight path 1-2 per engine are pefectly adequate.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-03T15:39:46Z","Content":"\n\u003Cp\u003EOne turbojet engine burns roughly 1/4 unit per second on average during flight, a bit more at very low and very high altitude, a bit less at medium altitude (1km-15km).\u003C/p\u003E\n"},{"CreatedByName":"caddilacbob","CreatedById":13208,"CreatedDateTime":"2013-07-03T15:49:10Z","Content":"\n\u003Cp\u003Edude that is extremely high if you take into account atmospheric density because past 20000 or so the atmosphere gets alot thinner alot more quickly and you need far less power. a excellent example of effective use of jet engines in a launch stage can be seen in scott manleys reusable space program which can be found here:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEkj16QN9poJyRrfAugyiC7W\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003Ealso ram air intakes (the black and blue ones) are by far the best for high altitudes regardless of how you might interperate the in game statistics\u003C/p\u003E\u003Cp\u003Ehope this helps\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-03T15:51:55Z\u0022 title=\u002207/03/2013 03:51  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 3, 2013\u003C/time\u003E by caddilacbob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-07-03T15:53:38Z","Content":"\n\u003Cp\u003EI use them because I think they are cool as a first stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img20/9564/6nm5.png\u0022 alt=\u00226nm5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img266/8332/erl.png\u0022 alt=\u0022erl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img812/948/mo0.png\u0022 alt=\u0022mo0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI use two ram intakes per turbojet and try to get a TWR of 4 or more. Stage them about 20-25K depending on your flight path then use your second stage to get into orbit.\u003C/p\u003E\n"},{"CreatedByName":"mrsinister","CreatedById":66816,"CreatedDateTime":"2013-07-03T17:20:03Z","Content":"\n\u003Cp\u003Eya could make a part that generates intake air.... like an air compressor and have an air tank to store it.... I have done something like this after seeing B9 and their compressed air. So, I made the parts and tested them. I flew around for a bit till the air tank was filled up then went into orbit..... and the jet engines continued to burn..... that\u0027s if you don\u0027t mind \u0022cheating\u0022 a bit....\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-03T17:35:32Z","Content":"\n\u003Cp\u003EThe Firespitter pack comes with intake air cylinders to store it as well, looks like scuba tanks(100 units each)\u003C/p\u003E\u003Cp\u003EI personally downloaded a custom skin air intake off spaceport and literally increased all the stats by 10. So it had 10x the intake area, 10x the intake air storage (still something like 2), 10x the mass and 10x the drag. This way I could have the benefit of the 40 intakes but with only 4 parts being used.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-07-03T18:07:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003EWhy aren\u0027t they very popular then? I have always wanted to use jets for high payload launches, but their unpopularity led me to believe there is some hidden flaw.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeveral reasons: high part count, dangerous flamouts (if using multiple engines), and most designs don\u0027t make full use of the jet engines. Using jets as glorified SRBs is a great deal simpler than flying into orbit on them.\u003C/p\u003E\n"},{"CreatedByName":"longhornchris","CreatedById":70974,"CreatedDateTime":"2013-07-03T18:10:08Z","Content":"\n\u003Cp\u003EJets can work well as part of the 1st stage, but they require a different flight profile. As others have mentioned jets take time to spool up and lose power at high altitude and high speed... so that has to be taken into account. I don\u0027t often use them, but when I do I have them start before I release the launch clamps. Next, I start the turn at a very low altitude to get as much speed out of the jets before I get over 20-25km where the jets start to lose thrust. Jets do better the faster they go... until a point.\u003C/p\u003E\u003Cp\u003ENote: I\u0027ve been using FAR for a while now, so jets behave a bit differently there. Personally I tend to use the SABRE engines in the B9 pack because its fewer engines to deal with.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-07-03T23:54:34Z","Content":"\n\u003Cp\u003EHere\u0027s an example of a high-payload jet lifter:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Hdew6\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThis design essentially requires MechJeb to avoid losing control from flameouts, but you can instead drop or disable engines as you ascend, until you\u0027re down to a single central jet and feathering throttle to ride the edge of flameout. Flying with jets you also want a different ascent trajectory than a rocket-only design, you want to aim to circularize your orbit while still in the atmosphere then keep accelerating to get your apoapsis as high as possible. The delta-V to lift your periapsis out of the atmosphere from there is minimal.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-04T18:36:49Z","Content":"\n\u003Cp\u003ETried a mk2 fuselage with four basic jet engines, radial and ram intakes aplenty. Got me up to 20k before the air ran out, which was fairly impressive. Not enough speed to let the payload get an orbit up, though.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking a semi-spaceplane design could work; mount the rocket on a fast aircraft, get it up to speed and altitude, then separate and kick in the rocket motors.\u003C/p\u003E\n"}]}