{"TopicId":3569,"ForumId":15,"TopicTitle":"Axis all wrong in Blender?","CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-07T15:32:50Z","PageNum":1,"Articles":[{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-07T15:32:50Z","Content":"\n\u003Cp\u003EI\\\u0027ve been having some real trouble with putting anything other than a simple part from Blender into the game. Like parachutes for example. They load up, but come out sideways!\u003C/p\u003E\u003Cp\u003EThe rest of the parts are correct... I mean, my modded boosters are not upside down or anything. But animated parts just go wrong. Struts or chutes are all over the place. I\\\u0027ve finally resorted to adding a separate axis for the mesh, and getting blender to export it with the model. Does anyone know an easy way to fix this?\u003C/p\u003E\n"},{"CreatedByName":"Killerhurtz","CreatedById":320,"CreatedDateTime":"2011-11-07T19:14:17Z","Content":"\n\u003Cp\u003ECheck it. KSP uses a Y-up convention for it\\\u0027s models. If I\\\u0027m not wrong, Blender uses Z-up convention. That\\\u0027s why your parts come up sideways.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-07T19:32:18Z","Content":"\n\u003Cp\u003EIt\\\u0027s strange that the game gets it right on the other parts though.\u003C/p\u003E\u003Cp\u003EJust read on the blender site that it does use a different system. Which is a pain. I am not sure if I can change it inside blender. I will give it a go. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Killerhurtz","CreatedById":320,"CreatedDateTime":"2011-11-07T20:18:51Z","Content":"\n\u003Cp\u003EIt gets it right on the other parts because the other modders had an eye on this, and thus ARE actually right.\u003C/p\u003E\n"},{"CreatedByName":"Epsilon","CreatedById":392,"CreatedDateTime":"2011-11-07T20:20:06Z","Content":"\n\u003Cp\u003EI\\\u0027ve made my models in Blender and exported them to the game, all with z being up and there was no problem whatsoever. I just clicked export to .dae and that was it.\u003C/p\u003E\u003Cp\u003EWhat version of Blender are you using?\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-07T21:01:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Killerhurtz\u0022 data-cite=\u0022Killerhurtz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt gets it right on the other parts because the other modders had an eye on this, and thus ARE actually right.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. I mean my own parts. My parts export correctly. So Blender is either correcting the rotation, or the game is. It\\\u0027s only animated parts (parachutes and strut connector bars) that are rotated 90 degrees as the Z and Y axis are swapped.\u003C/p\u003E\u003Cp\u003EI\\\u0027ve now exported a parachute correctly, but I had to rotate it 90 degrees to the rest of the model (did this by making a separate axis, rotating it 90 degrees and linking it to the \u0027canopy\u0027 part).\u003C/p\u003E\u003Cp\u003EPerhaps Blender is correcting the \u0027scene\u0027 orientation, so the model exports correctly. Each \u0027mesh\u0027 inside the model still has Blenders opposite rotation though. So when the chutes open, they use the \u0027mesh\u0027 axis and not the \u0027scene\u0027 axis\u0027. At a guess, I\\\u0027d say that was the problem. I might be able to go over an change all the mesh axis in my models to fix it. That might be what the other modders have done, but I don\\\u0027t see any of them actually giving any helpful advice on it. only \u0027it\\\u0027s wrong\u0027 and not how to fix it.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2011-11-19T19:35:38Z","Content":"\n\u003Cp\u003EWell, my model is even more special, it decided to invert fully 180 degrees.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Eg2Id.png\u0022 alt=\u0022Eg2Id.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts correct in blender.\u003C/p\u003E\u003Cp\u003EI don\\\u0027t get it.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-19T20:33:32Z","Content":"\n\u003Cp\u003EIs your view up side down in Blender? You can change the axis. Turn it upside down in blender, and see if it\\\u0027s correct in game. \u003C/p\u003E\n"}]}