{"TopicId":35703,"ForumId":34,"TopicTitle":"[1.0.3] Editor Extensions v2.12 - 23 June","CreatedByName":"MachXXV","CreatedById":68210,"CreatedDateTime":"2013-07-03T02:18:16Z","PageNum":14,"Articles":[{"CreatedByName":"AlMacTavish","CreatedById":120147,"CreatedDateTime":"2014-12-16T18:17:24Z","Content":"\n\u003Cp\u003EI agree with everyone above, this is far from obsolete! Waiting patiently for an update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-12-16T18:32:39Z","Content":"\n\u003Cp\u003ESo, things I still miss even with the new awesome gizmos:\u003C/p\u003E\u003Cp\u003E-An easy toggle between clip/noclip. It helps to hide the extra nodes sometimes, sometimes you want to use them.\u003C/p\u003E\u003Cp\u003E-Surface attach toggle. I can\u0027t believe how dependant I was on that!\u003C/p\u003E\u003Cp\u003E-Angle lock. Being able to force 90Ã‚Âº attachment made me able to place parts in places that are otherwise impossible. Great to get correctly aligned builds.\u003C/p\u003E\u003Cp\u003E-Vertical lock. Crucial to measure, it makes balancing stuff much easier, when you can attach thing to the exact middle of a part.\u003C/p\u003E\u003Cp\u003E-Extra symmetry. Probably the most often mentioned one. It\u0027s not so crucial, though.\u003C/p\u003E\u003Cp\u003ERune. Yeah, this mod could be very much relevant still.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2014-12-16T18:55:12Z","Content":"\n\u003Cp\u003EIm really REALLY supprised that the functionality of this mod is not STOCK game functionality by now......\u003C/p\u003E\u003Cp\u003EAnyone with 1/2 a brain can see at first glance EdExt is a far superior set of building tools than what comes with the game.....\u003C/p\u003E\u003Cp\u003EThere is really no reason why Squad shouldnt make this stock.\u003C/p\u003E\n"},{"CreatedByName":"philly_idle","CreatedById":63420,"CreatedDateTime":"2014-12-16T21:27:00Z","Content":"\n\u003Cp\u003EMachXXV, please don\u0027t let this mod die. I don\u0027t want to live in a world without vertical snap \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2014-12-16T21:30:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philly_idle\u0022 data-cite=\u0022philly_idle\u0022\u003E\u003Cdiv\u003EMachXXV, please don\u0027t let this mod die. I don\u0027t want to live in a world without vertical snap \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo joke - let me just echo what the others are saying - PLELEEEEEELELELELEEEAASE don\u0027t let this die. The stock editor, even with the gizmos and whatnot, really feels crippled without Editor Extensions.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-12-16T21:35:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ESo, things I still miss even with the new awesome gizmos:\u003Cp\u003E-An easy toggle between clip/noclip. It helps to hide the extra nodes sometimes, sometimes you want to use them.\u003C/p\u003E\u003Cp\u003E-Surface attach toggle. I can\u0027t believe how dependant I was on that!\u003C/p\u003E\u003Cp\u003E-Angle lock. Being able to force 90Ã‚Âº attachment made me able to place parts in places that are otherwise impossible. Great to get correctly aligned builds.\u003C/p\u003E\u003Cp\u003E-Vertical lock. Crucial to measure, it makes balancing stuff much easier, when you can attach thing to the exact middle of a part.\u003C/p\u003E\u003Cp\u003E-Extra symmetry. Probably the most often mentioned one. It\u0027s not so crucial, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, those are still pretty handy and needed. I use the surface attach toggle so often, it\u0027s nice to have a quick hotkey for noclipping and the various angles for angle snap is so useful for building planes. The vertical lock function would be so nice to have back, it\u0027s a shame Squad removed that ability.\u003C/p\u003E\n"},{"CreatedByName":"philly_idle","CreatedById":63420,"CreatedDateTime":"2014-12-16T21:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EI can tell you from my own private hacking: though the flag is still there, vertical snap as such is now gone from the game, though playing with the offset tool looks promising so far.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can confirm that setting VAB_ANGLE_SNAP_INCLUDE_VERTICAL = True in settings.cfg has no effect. Still workes in .25 though. SQUAD, why did you remove this...all you had to do is keep this feature in!\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-12-16T21:49:50Z","Content":"\n\u003Cp\u003EPresumably because the part attachment code in the editor now works in a considerably different way though, I agree, it was a very useful feature and it would be nice to see it (or an even better snapping system) return as soon as possible...\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2014-12-16T22:26:29Z","Content":"\n\u003Cp\u003EVertical snap can be done with the offset gizmo by leaving angle snap on and making sure to use the absolute reference frame (toggled with the F key).\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-12-16T22:34:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Supernovy\u0022 data-cite=\u0022Supernovy\u0022\u003E\u003Cdiv\u003EVertical snap can be done with the offset gizmo by leaving angle snap on and making sure to use the absolute reference frame (toggled with the F key).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I think eventually I could get used to doing this instead of using the vertical snap like I used to.\u003C/p\u003E\u003Cp\u003EWhat I have been noticing myself missing BY FAR more than anything is the ability to set the angle snap to various different angles. I haven\u0027t used the stock angle snap in well over a year. I constantly used different angles for the snap.\u003C/p\u003E\u003Cp\u003EAlso, does Alt-X not reset symmetry to single in stock KSP?\u003C/p\u003E\u003Cp\u003EI like what Squad did, and I am sure once I get used to it, I will love it, but right now I would rather be using the .25 VAB with this mod than the .90 VAB\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-16T22:38:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003E-Vertical lock. Crucial to measure, it makes balancing stuff much easier, when you can attach thing to the exact middle of a part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor me this one is the most important, it was the primary reason I used E.E. in the first place. In 0.90 you can now vertical snap in increments, but you can\u0027t have a consistent starting point, which... is bad. You can snap onto a random position then move in consistent increments up or down, but the starting position has an infinite level of variation.\u003C/p\u003E\u003Cp\u003EI get it if the mod will be retired (though I do hope it won\u0027t). So if this is the end I just wanted to thank you for all the help this mod has given me over the year. Truly it was one of my go-to, must-have mods for the game.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003E@ Supernovy\u003C/p\u003E\u003Cp\u003ESo... by setting it to absolute reference frame, you can force the part to snap along some... overall height range? As opposed to one set when you set the part down in the first place? Because when the height levels are set like the later, they\u0027re just not going to be consistent from one part to the next.\u003C/p\u003E\u003Cp\u003EEDIT2:\u003C/p\u003E\u003Cp\u003EOh my... I think I got it to work... Thank you novy! This is a glorious day indeed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T23:13:30Z\u0022 title=\u002212/16/2014 11:13  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by PTNLemay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2014-12-17T00:23:30Z","Content":"\n\u003Cp\u003EI\u0027m left wondering what I\u0027ve been missing all this time, having never used vertical snap and not knowing what it\u0027s good for.\u003C/p\u003E\n"},{"CreatedByName":"Deems19","CreatedById":119834,"CreatedDateTime":"2014-12-17T01:05:02Z","Content":"\n\u003Cp\u003EI don\u0027t want to live in a world without EditorExtensions! \u003C/p\u003E\u003Cp\u003EEE is the mod I install first on every single one of my KSP installs (Kerbal Joint Reinforcement is installed second). I am constantly fumbling with the controls in KSP 0.90 now and while the editor has been greatly improved I still find it lacking. My workflow has suffered immensely so I pray for a quick and speedy update/revision of Editor Extensions.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-17T01:16:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022White Owl\u0022 data-cite=\u0022White Owl\u0022\u003E\u003Cdiv\u003EI\u0027m left wondering what I\u0027ve been missing all this time, having never used vertical snap and not knowing what it\u0027s good for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor me the most important issue is where it comes up is when docking land vehicles together. You need a consistent height in order for the docks to connect with one another. \u003C/p\u003E\u003Cp\u003EIt also helps whenever I want to create complex asymmetrical space stations. If you can keep the docks at a consistent height along a given piece, then you can connect lots of those pieces to make the station feel consistent. If not... then it quickly ends up looking like an awkward mish-mash of sticks and discs. It also REALLY helps with multi-point docking. If you have 2 docks on this component that are exactly this distance in height apart, you need the other component to have 2 docks exactly the same distance apart, otherwise they won\u0027t snap together.\u003C/p\u003E\n"},{"CreatedByName":"Jim Meillente","CreatedById":125566,"CreatedDateTime":"2014-12-17T03:19:46Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI would just like to say I already miss not having the features of this MOD in 0.90! I hope you continue development and look forward to any future updates!\u003C/p\u003E\u003Cp\u003EThank You\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-12-17T03:43:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003EFor me the most important issue is where it comes up is when docking land vehicles together. You need a consistent height in order for the docks to connect with one another. \u003Cp\u003EIt also helps whenever I want to create complex asymmetrical space stations. If you can keep the docks at a consistent height along a given piece, then you can connect lots of those pieces to make the station feel consistent. If not... then it quickly ends up looking like an awkward mish-mash of sticks and discs. It also REALLY helps with multi-point docking. If you have 2 docks on this component that are exactly this distance in height apart, you need the other component to have 2 docks exactly the same distance apart, otherwise they won\u0027t snap together.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt also really helped with building an asparagus rocket. I would put on my boosters in pairs of 2 with vertical snap and the angle snap set to 30 degrees. This gave me an easy, perfect 6 outer booster asparagus stage.\u003C/p\u003E\u003Cp\u003EAlso, I loved how I could use it to attach sepratrons to KW\u0027s SRBs. I remember that a pair of the black KW ullage rockets placed on a SRB with verticle snap would be perfectly balanced for decoupling. I believe that this worked for all of KW\u0027s SRBs.\u003C/p\u003E\u003Cp\u003EBut the most important thing for me, BY FAR, was the ability to make things look pretty and neat and orderly.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-17T04:17:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EAlso, I loved how I could use it to attach sepratrons to KW\u0027s SRBs. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed that\u0027s another issue that used to be only remedied by E.E., but that is now covered in the stock editor. You can tell him to perform symmetry around a single part (like a booster) or around the whole rocket like usual. This makes little additions like sepatrons a much simpler task.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s a perfect example where even the slightest imperfection in alignment (due to placing it manually) could have drastic consequences. Because the sepatrons could impart an uncontrolled spin on the booster as it separated.\u003C/p\u003E\n"},{"CreatedByName":"madbadger2742","CreatedById":82240,"CreatedDateTime":"2014-12-17T11:50:53Z","Content":"\n\u003Cp\u003EPlease don\u0027t give this project up. I\u0027ve become far too dependent on EE\u0027s symmetry and angle choices, but above all, the vertical snap. \u003C/p\u003E\u003Cp\u003ESo, if it\u0027s not too much trouble... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for all your work on this amazing mod, BTW.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-12-17T16:42:00Z","Content":"\n\u003Cp\u003Ejust want to add my support for this mod. its still very very relevant. the new stock editor tools, while very welcome, still do not cut it. editor extensions must live!\u003C/p\u003E\n"},{"CreatedByName":"Navy2k","CreatedById":95246,"CreatedDateTime":"2014-12-17T17:55:54Z","Content":"\n\u003Cp\u003EHi, i wan\u0027t to thank you and strongly encourage you to keep on making the editor the best thing we could have. I realy like the additional angle options and the vertical center snap.\u003C/p\u003E\u003Cp\u003EOne example for a new feature i would like is to be able to select angle snap by placement mode. (for example snap at the angles in placement mode but automatically switch to free mode in translation mode)\u003C/p\u003E\u003Cp\u003EGreetings\u003C/p\u003E\u003Cp\u003EBen\u003C/p\u003E\n"},{"CreatedByName":"ola","CreatedById":82138,"CreatedDateTime":"2014-12-17T18:03:47Z","Content":"\n\u003Cp\u003EI, too, just came to realise how much I depend on this wonderful mod. KSP might be wobbly asymmetrical rockets to some, but it isn\u0027t to me. This mod brings elegance to the game. Pretty please continue maintaining it!\u003C/p\u003E\n"},{"CreatedByName":"gardocki","CreatedById":58921,"CreatedDateTime":"2014-12-17T18:09:16Z","Content":"\n\u003Cp\u003EPlease please please maintain this mod! I can\u0027t do with just 8x symmetry!. My ridiculous contraptions depend on you!\u003C/p\u003E\n"},{"CreatedByName":"WarrenSchultz","CreatedById":125481,"CreatedDateTime":"2014-12-17T18:45:02Z","Content":"\n\u003Cp\u003EYup, still love this mod. Please continue the symmetry tools \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DevCo","CreatedById":132305,"CreatedDateTime":"2014-12-17T20:35:20Z","Content":"\n\u003Cp\u003EI registered with this forum just to tell you that this tool is ESSENTIAL to building in KSP. Without vertical snap I feel like KSP is useless, also, more than 8x radial symmetry is important. I don\u0027t understand how these are not features of KSP itself, I was astonished a vertical snap feature didn\u0027t make it into the editor update. Until it does, please continue development of this tool. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"DevCo","CreatedById":132305,"CreatedDateTime":"2014-12-17T20:37:22Z","Content":"\n\u003Cp\u003EI registered with this forum just to tell you that this tool is ESSENTIAL to building in KSP. Without vertical snap I feel like KSP is useless, also, more than 8x radial symmetry is important. I don\u0027t understand how these are not features of KSP itself, I was astonished a vertical snap feature didn\u0027t make it into the editor update. Until it does, please continue development of this tool. Thanks!\u003C/p\u003E\n"}]}