{"TopicId":35757,"ForumId":16,"TopicTitle":"Can\u0026#039;t get to a planet and back","CreatedByName":"Ultermarto","CreatedById":73200,"CreatedDateTime":"2013-07-03T17:48:52Z","PageNum":1,"Articles":[{"CreatedByName":"Ultermarto","CreatedById":73200,"CreatedDateTime":"2013-07-03T17:48:52Z","Content":"\n\u003Cp\u003EI had some kerbals stranded on Duna from my first attempt at a landing on and return from another planet. I sent a rescue-craft designed to bring them back, giving it more fuel, but still the damn thing pretty much used all of its fuel halfway through the journey (it actually crashed into the planet). So after watching some Scott Manley vids, I decided to get a nuclear engine into space, composed of one large orange fuel tank and six nuclear engines, to which I would attach my actual rescue lander. It took forever to get into orbit and was very tedious, but I was convinced that it would get my rescue mission to and from another planet with fuel left to even out the orbit for another run. But oh, I was wrong. Despite the fact that Scott made it to the outermost planet and back with a very similar craft, I had used up all my fuel by the time I had undocked from the nuclear engine and landed on Duna again. One whole orange fuel tank. Six engines. A reasonably small lander. Does not make it to Duna and back. I\u0027m tearing my hair out here.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-07-04T02:52:14Z","Content":"\n\u003Cp\u003EHi, I think I can help.\u003C/p\u003E\u003Cp\u003EFirst and foremost, I would suggest watching the rocket building tutorial in my signature. the first half goes over some design considerations for landers and interplanetary ships. Here\u0027s the meat of it though:\u003C/p\u003E\u003Cp\u003EFor landers, weight is EVERYTHING, and less is more. You want to make it as light as possible so it can land and return to orbit using the smallest amount of fuel. No unnecessary crap. Use a light weight lander can or series of lander cans, or even just external command seats to carry your crew of kerbals to the surface. \u003C/p\u003E\u003Cp\u003EYou have to burn a ton of delta V on landing and ascent from duna, so you don\u0027t want to carry anything you don\u0027t need down to the surface with you, even fuel. Only bring the fuel you need to land and return to orbit. Leave the rest of the fuel up in orbit, and rendezvous with it again after taking off to return home.\u003C/p\u003E\u003Cp\u003ELV-Ns weigh 2.5 tons each. 6 of them is a LOT of dry weight you don\u0027t want or need to carry down to the surface with you. Use less. a smaller lander and crew pod, less fuel, fewer engines, or lighter engines if you need the thrust of more than 2-3 LV-Ns.\u003C/p\u003E\u003Cp\u003Euse kerbal engineer or mechjeb to calculate your delta v for staging in the VAB when designing your rocket. That way you know if you\u0027ll have enough thrust and delta v to make the trip. I cover that in more detail in the tutorial I mentioned.\u003C/p\u003E\u003Cp\u003EFor the interplanetary stage (getting from kerbin to duna and back), again, less is more, and this time, you don\u0027t even need to worry about thrust so much, so you can skimp on the engines even more... in fact, since you\u0027re carrying engines on your lander, the interplanetary stage doesn\u0027t need to be anything more than a fuel tank for your lander engines to draw from, to push it there bad back.\u003C/p\u003E\u003Cp\u003ELearn where to conserve fuel in your transfer. You want to burn to duna from a very low kerbin orbit to maximize the oberth effect. use the phase angle calculator at \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E or a plugin like protractor to get your burn timing right. Always do your inclination changes when moving slowly, far away from the planet (as soon as you enter its sphere of influence) to get a flat, 0 degree inclined orbit, or as close to it as you can. Do your fine tuning for intercept about 1/3 of the way to the target, so you burn less fuel, and fine tune a second time if necessary later.\u003C/p\u003E\u003Cp\u003Euse aerobraking, and a shallow landing descent to conserve fuel by better parachute use.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-04T03:10:36Z\u0022 title=\u002207/04/2013 03:10  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 4, 2013\u003C/time\u003E by Colonel_Panic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-07-04T03:35:46Z","Content":"\n\u003Cp\u003EFor interplanetary thrust, it\u0027s best to use an engine with the highest ISP and just one of them. The burns will take longer but you will save a vast amount of fuel.\u003C/p\u003E\u003Cp\u003EMr Manly uses maximum efficiency burns, so as the Colonel said, use tools to calculate your phase angle and you\u0027ll save fuel.\u003C/p\u003E\u003Cp\u003EFor an accurate landing using parachutes you\u0027ll pretty much need mechjeb to plot the descent burn for you. \u003C/p\u003E\u003Cp\u003EIf you\u0027re concerned about running short of fuel there is always the option of sending some tanks ahead as probes with docking ports, a solar panel or two and a single LV-N to get them there a few days before you depart with the rescue craft.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-07-04T03:41:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falofonos\u0022 data-cite=\u0022falofonos\u0022\u003E\u003Cdiv\u003EFor interplanetary thrust, it\u0027s best to use an engine with the highest ISP and just one of them. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EImportant to note, if you HAVE more than one LV-N with you (such as LV-Ns on your lander), you want to burn with all of them, not just one. The idea specifically is to BRING as few engines as possible with you, so you\u0027re not spending fuel to lug around their extra weight. If you already have LV-Ns on the lander, you don\u0027t need to bring an extra one for your transfer stage, as you can just burn with the lander engines.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-07-04T08:36:41Z","Content":"\n\u003Cp\u003EWait, you launched 1 orange fuel tank using only 6 nuclear rockets? No other staging at all?\u003C/p\u003E\u003Cp\u003Elol\u003C/p\u003E\u003Cp\u003EUse more traditional rockets on lower stages to launch your fuel tank with a single nuclear engine attached. Never launch rockets from the ground with nuclear engines.\u003C/p\u003E\n"},{"CreatedByName":"Ultermarto","CreatedById":73200,"CreatedDateTime":"2013-07-04T13:40:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003EWait, you launched 1 orange fuel tank using only 6 nuclear rockets? No other staging at all?\u003Cp\u003Elol\u003C/p\u003E\u003Cp\u003EUse more traditional rockets on lower stages to launch your fuel tank with a single nuclear engine attached. Never launch rockets from the ground with nuclear engines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat? No, where did you get that idea? It took three mainsails to get the damn thing into orbit.\u003C/p\u003E\n"},{"CreatedByName":"Ultermarto","CreatedById":73200,"CreatedDateTime":"2013-07-04T13:43:47Z","Content":"\n\u003Cp\u003EAlready did the rendez-vous thing and I certainly didn\u0027t take my six nuclear engines down to duna, but I get the message. The thing needs to be lighter. Thanks.\u003C/p\u003E\u003Cp\u003EI think I need to start working out my Delta-V then, however you do that.\u003C/p\u003E\u003Cp\u003EAlso, using less nuclear engines for such a large craft may be more efficient, but it takes SOOOO LOOOONNNGGGG to get you anywhere. Are there any mods that can let me, I don\u0027t know, burn whilst fast-forwarding, because I\u0027ve had this problem so many times before. They don\u0027t let you throttle-up at all in orbit, god forbid.\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2013-07-04T18:51:00Z","Content":"\n\u003Cp\u003EHold \u0022alt\u0022 while hitting the fast forwards. That allows you to warp while throttled up. But, be warned physics that KSP uses my shake your craft apart and brake it to bits. You have been warned and will be so by the game too.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-07-04T21:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ultermarto\u0022 data-cite=\u0022Ultermarto\u0022\u003E\u003Cdiv\u003EAlready did the rendez-vous thing and I certainly didn\u0027t take my six nuclear engines down to duna, but I get the message. The thing needs to be lighter. Thanks.\u003Cp\u003EI think I need to start working out my Delta-V then, however you do that.\u003C/p\u003E\u003Cp\u003EAlso, using less nuclear engines for such a large craft may be more efficient, but it takes SOOOO LOOOONNNGGGG to get you anywhere. Are there any mods that can let me, I don\u0027t know, burn whilst fast-forwarding, because I\u0027ve had this problem so many times before. They don\u0027t let you throttle-up at all in orbit, god forbid.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome burns take a while. hit Alt\u002B. to enter physics warp 2x. Ding 3-4x though will amplify wobble a lot. Use maneuver nodes to plan your burns, and get an estimate of burn time... then start your burn early enough that you\u0027re halway through at the midpoint (aka, if it says a burn will be 4 minutes, start it at T-2 minutes.) Longer burns will be less efficient and require more adjustments after the fact. Try and fire ALL of your LV-Ns at once though when transfer burning (and ONLY LV-Ns) to maximize acceleration and efficiency. It helps to design your lander to have its engines mounted out from the center where they can burn with the lower stage still attached.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-04T22:50:54Z","Content":"\n\u003Cp\u003EIf your launcher can handle additional weight, don\u0027t be afraid to take some droppable fuel tanks, or even engines. Connect extra tanks with fuel lines to your main tank, and jettison them away as soon as they are empty. Same goes for aditional engines (only if you really need that extra \u0027oomph\u0027). Use couple of LV-T30 or 45 to get out of Kerbin\u0027s SoI and into transfer trajectory, and then get rid of them. Duna is less power demanding due to lower mass, so LV-Ns will be more than enough for all maneuvers in Duna\u0027s SoI. Another fuel saving measure to take is aerobraking in Duna\u0027s atmo. But due to it being so thin, you would have to dive really deep to be captured. Risky for a beginner, but it saves you a lot of dV if done properly.\u003C/p\u003E\n"}]}