{"TopicId":36002,"ForumId":25,"TopicTitle":"A VTOL race using KerbCom Avionics.","CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-07-05T15:28:07Z","PageNum":1,"Articles":[{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-07-05T15:28:07Z","Content":"\n\u003Cp\u003ETo showcase the latest release of my mod, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29387-Plugin-0-20-2-KerbCom-Avionics-0-2-0-1-%28July-2013%29-includes-VTOL-balancing\u0022 rel=\u0022external nofollow\u0022\u003EKerbCom Avionics\u003C/a\u003E, I propose a race to park in one of the island hangars using my example VTOL craft. You can download the craft in the release thread. It requires B9 Aerospace, my mod and MechJeb 2. MechJeb is only required for the AR202 part to use as a host for my avionics module. You may remove the AR202 from the craft if you have installed KCA to a part other than MechJeb. Make sure you install my mod, as the craft will not fly well without it.\u003C/p\u003E\u003Cp\u003EUsing my mod, the craft is very easy to control, and should be no trouble for anyone who has flown helicopters (either in a simulator or in real life), as it works on a similar principle.\u003C/p\u003E\u003Cp\u003EDetailed rules:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EYou may use FAR. There will be two leaderboards.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou must use exactly the example craft, with the exception of the MechJeb part, which is optional.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou must produce evidence of your attempt in an Imgur album, documenting at least the stage just before takeoff, on approach to the island, and landed in the hangar. The GUI must not be hidden.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYour flight must end with the craft undamaged and completely within a hangar - no broken landing gear.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERank is determined purely by the time taken to get there - the time in the last screenshot.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\u003Cp\u003EI may also add a leaderboard for landing on the island tower, if someone manages to do it.\u003C/p\u003E\u003Cp\u003EFAR Leaderboard:\u003C/p\u003E\u003Cp\u003E1. ZRM - 7:27\u003C/p\u003E\u003Cp\u003E2. ...\u003C/p\u003E\u003Cp\u003E3. ...\u003C/p\u003E\u003Cp\u003E4. ...\u003C/p\u003E\u003Cp\u003E5. ...\u003C/p\u003E\u003Cp\u003EMy second successful attempt (the first was not documented):\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/CkmeG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should be able to get there much faster than this. I wasted a lot of time stabilising after the descent from cruising. I have since managed to do this a lot more efficiently.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T16:31:53Z\u0022 title=\u002207/05/2013 04:31  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by ZRM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"deker13","CreatedById":43554,"CreatedDateTime":"2013-07-06T22:18:07Z","Content":"\n\u003Cp\u003Ewouldn\u0027t it be easier to put wings on the VTOL? that way u could transition from vtol to jet mode.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-07-06T22:28:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deker13\u0022 data-cite=\u0022deker13\u0022\u003E\u003Cdiv\u003Ewouldn\u0027t it be easier to put wings on the VTOL? that way u could transition from vtol to jet mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis craft is just an example designed to demonstrate the capabilities of my plugin for balancing VTOLs. The point of the challenge is show how well it flies without wings. It is true that a more practical example would have wings and transition to forward flight.\u003C/p\u003E\n"}]}