{"TopicId":36079,"ForumId":25,"TopicTitle":"EVA Kerbal Planetscraping Challenge","CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-06T02:36:56Z","PageNum":1,"Articles":[{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-06T02:36:56Z","Content":"\n\u003Cp\u003EIt is time to gather your bravest and/or stupidest kerbals in order to make Felix Baumkerbal look like a sissy. The challenge:\u003C/p\u003E\u003Cp\u003E* Get a spacecraft into orbit around any body\u003C/p\u003E\u003Cp\u003E* Make your periapsis stupidly close to the body\u003C/p\u003E\u003Cp\u003E* EVA your kerbal, fly him as close as possible to touching the planet/moon without getting him killed and then return him safely to his vessel.\u003C/p\u003E\u003Cp\u003E* Post a video. (Photos ok if you absolutely can\u0027t do video but this challenge only shines with video proof)\u003C/p\u003E\u003Cp\u003ERules: \u003C/p\u003E\u003Cp\u003E* This has to be an orbital or high-speed planet-pass, eva, not a landing etc.\u003C/p\u003E\u003Cp\u003E* Your vessel can have mods, but please nothing that makes this challenge really easy or meaningless. \u003C/p\u003E\u003Cp\u003E* Kerbal must get close enough to the surface of the planet or moon that you can clearly see his shadow on the ground.\u003C/p\u003E\u003Cp\u003E* Kerbal must return safely to his craft once the periapsis has passed. I will allow a few exceptions to this. For example, if you have two crafts in near identical orbits, one can be set low enough to crash and the kerbal can return to the second one. Kerbal must return to the craft within 4 minutes of the periapsis passing. \u003C/p\u003E\u003Cp\u003E* No debug menu\u003C/p\u003E\u003Cp\u003EThe people will be the judge of who has the most badass Planetscrape. But, here are some general guidelines which will surely give you bonus rep:\u003C/p\u003E\u003Cp\u003E* Choosing a body with lots of altitude changes.\u003C/p\u003E\u003Cp\u003E* Length of hugging the ground without flinching.\u003C/p\u003E\u003Cp\u003E* Flying under an arch, under a cave, down a trench.\u003C/p\u003E\u003Cp\u003E* Near misses with other landmarks or with ground structures you have set up.\u003C/p\u003E\u003Cp\u003E* Somehow pulling this off on duna\u003C/p\u003E\u003Cp\u003E* Insane speed\u003C/p\u003E\u003Cp\u003E* Any other ways to make this more crazy that you can think of.\u003C/p\u003E\u003Cp\u003EHere is my starting attempt. I\u0027m sure this will end up being pretty pedestrian compared to what some will end up pulling off:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SqXnlcpmUi8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-06T03:08:36Z\u0022 title=\u002207/06/2013 03:08  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 6, 2013\u003C/time\u003E by Dweeb of Kerbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DJEN","CreatedById":61378,"CreatedDateTime":"2013-07-06T03:24:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dweeb of Kerbin\u0022 data-cite=\u0022Dweeb of Kerbin\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SqXnlcpmUi8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice Tylo pass there!\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-07-06T03:27:08Z","Content":"\n\u003Cp\u003EWow that is amazing, I love the shadows moving across the ground so fast.\u003C/p\u003E\u003Cp\u003EI haven\u0027t done this with an EVA\u0027d kerbal, but I have this screenshot from some lithobraking challenge.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wgv9I1n.png\u0022 alt=\u0022Wgv9I1n.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2013-07-06T03:34:52Z","Content":"\n\u003Cp\u003ETasty challenge! For some reason, my shadows have stopped working..\u003C/p\u003E\u003Cp\u003EHere\u0027s an insane idea: periapsis on the NIGHT SIDE, and you use their little head torches to light up the ground.\u003C/p\u003E\u003Cp\u003EShould give you an idea of how close.\u003C/p\u003E\u003Cp\u003EThis would be epic in first-person EVA... (EVA IVA?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-06T03:40:23Z\u0022 title=\u002207/06/2013 03:40  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 6, 2013\u003C/time\u003E by kahlzun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-06T03:35:31Z","Content":"\n\u003Cp\u003ENo video, but doing this is awesome fun.\u003C/p\u003E\u003Cp\u003EI\u0027ll be watching with interest, and may have another go later.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EAlKhff.jpg\u0022 alt=\u0022EAlKhff.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/c45wsdq.jpg\u0022 alt=\u0022c45wsdq.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-06T07:33:06Z","Content":"\n\u003Cp\u003EI like the idea about using lights on the dark side to expose a shadow. You could also build the lights into the ship the kerbal EVAs from, or build a little custom EVA \u0022suit\u0022 with just lights, a seat, and RCS. Another thing that would be great, is using the mod with the buran arms with cameras - I don\u0027t currently have them installed, but in my past experience, when you get near a craft that has them, they automatically show up in your view. So you could place on on the ground where you are going to pass and get a recording from the ground of your high speed encounter. \u003C/p\u003E\u003Cp\u003EAnyway, I took a go at passing under one of my structures on the mun. To be honest, I\u0027m not sure if it was truly a clean pass underneath, or if the combination of the kerbal\u0027s tiny size and the ultra high speed meant that the game just didn\u0027t notice a collision - but the recording is below! The exciting stuff is about 3 minutes in. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uZXWuhgvF5U?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Superseaslug","CreatedById":71246,"CreatedDateTime":"2013-07-06T13:08:57Z","Content":"\n\u003Cp\u003EI hate to post anything that is not specifically an answer to the challenge, but I built a colony ship in LKO that I was going to use to land a grand total of 32 kerbals onto the surface of Tylo, but while circularizing my orbit, I brought my perigee a bit too close to the planet, blowing up only half of my ship on the side of the planet, and losing 16/32 kerbals. Needless to say, I was unable to land at this point, but I figured this story was relevant enough to post.\u003C/p\u003E\u003Cp\u003Eand in case anyone cares, the colony ship\u0027s assembly took a total of 17 launches (not including failures)\u003C/p\u003E\n"},{"CreatedByName":"JacobT11","CreatedById":11673,"CreatedDateTime":"2013-07-06T14:32:26Z","Content":"\n\u003Cp\u003EDefinitely going to give this a go when I get home. Just one possibly stupid question. For some reason my shadows don\u0027t work anymore. Is there an edit to the settings.cfg to restore them?\u003C/p\u003E\n"},{"CreatedByName":"Coneshot","CreatedById":69785,"CreatedDateTime":"2013-07-06T15:05:45Z","Content":"\n\u003Cp\u003EWhat video software is good for this?\u003C/p\u003E\n"},{"CreatedByName":"Bystander","CreatedById":73603,"CreatedDateTime":"2013-07-07T04:45:15Z","Content":"\n\u003Cp\u003EInspired by Dweed I thought I\u0027d take a go at one of the Mun Arches - so I give you Threading the Eye of the Needle.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/YQYv-z_uksE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EPerhaps the hardest bit is that the arches mostly face north/south meaning you need a polar orbit and have to wait till it coincides with the arch.\u003C/p\u003E\u003Cp\u003EWas using the free Fraps and missed the getting back into the ship part - though I did do it on the first run, after that a was using a reload and not bothering.\u003C/p\u003E\u003Cp\u003EStock parts \u002B Mechjeb.\u003C/p\u003E\n"},{"CreatedByName":"Coneshot","CreatedById":69785,"CreatedDateTime":"2013-07-07T12:52:40Z","Content":"\n\u003Cp\u003ENice video Bystander, I love how you added the different camera angles as well as a \u0022Blooper reel\u0022 at the end.. :-)\u003C/p\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-08T05:23:01Z","Content":"\n\u003Cp\u003EThe calm headfirst approach is a nice touch. Very peaceful. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn reply to the question about video capture, I use fraps on pc. If on Mac, I\u0027m not sure what is best for games. There is a good capture program called snapz pro, but I,ve never tried it while running a full screen game.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-17T17:18:43Z","Content":"\n\u003Cp\u003EShadow. Damn. I knew I\u0027d forgot something.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/V75J8\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Jackpot_Corndog","CreatedById":3662,"CreatedDateTime":"2013-07-17T18:25:19Z","Content":"\n\u003Cp\u003EBYSTANDER, that was tit\u0027s out awesome.\u003C/p\u003E\n"}]}