{"TopicId":36156,"ForumId":44,"TopicTitle":"Can magnetic fields be used to build a protective bubble that keeps out hot plasma?","CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-07-06T23:03:12Z","PageNum":1,"Articles":[{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-07-06T23:03:12Z","Content":"\n\u003Cp\u003EThe combination of several poloidal and toroidal superconducting electromagnets can confine hot plasma into a torus in a device known as a tokamak. Can the same principle be used to create a protected bubble that keeps hot plasma out? Perhaps if such a device could be created and powered, it could serve as a shield for ships venturing into extreme environments such as the corona of the sun.\u003C/p\u003E\u003Cp\u003EWhat would such a device look like?\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-07T01:04:26Z","Content":"\n\u003Cp\u003EIn theory yes, however you would has to use plenty of energy to get it running, result would be that you would overheat anyway after some time. \u003C/p\u003E\u003Cp\u003EYou would probably also get leaks where slower and cooler plasma would get by.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-07-07T01:39:44Z","Content":"\n\u003Cp\u003Eiirc plasmas like to follow magnetic flux lines. problem is the flux lines will intersect your ship at the poles of your magnet. this is why earths poles get a bigger dose of background radiation than you get at the equator. what you can do is utilize passive radiation shielding in those areas, while the rest of the ship is protected by the magnetic field. if your ship has a rotating section, it might prove useful to put the coils in the hub so that the field geometry matches that of the ring so that no flux lines intersect it, completely eliminating the need for passive shielding. problems are these systems need constant power, they need to use superconducting magnets, so you also need to bring coolant along with you (easy if your using lox/lh2), and you only need a little bit of passive shielding rather than a lot. there are other issues, like maintaining orientation in a planet\u0027s magnetosphere, but thats easily done by tweaking the magnetic field geometry.\u003C/p\u003E\u003Cp\u003Ei googled and got this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/directorates/spacetech/niac/2012_phaseII_fellows_westover.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/directorates/spacetech/niac/2012_phaseII_fellows_westover.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eas for what it would look like, pretty much just your typical superconducting electromagnet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E the article has a picture.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-07T01:55:08Z\u0022 title=\u002207/07/2013 01:55  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 7, 2013\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-07T04:07:55Z","Content":"\n\u003Cp\u003ENo, you cannot build a protective magnetic bubble, because divergence of magnetic field is zero. That means there exists no arrangement of magnetic fields that is spherically symmetric.\u003C/p\u003E\u003Cp\u003EIt is, however, possible to protect one side of the ship, for example, for re-entry. The biggest problem is that of practicality. I\u0027m afraid, the hardware necessary to create such a magnetic field would be heavier than a conventional shield. The other application is shielding for hyper speed travel in space. Most of the interstellar matter is going to be in form of plasma, so a magnetic shield would drastically reduce amount of ionizing radiation to which crew or electronics are subjected.\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-07-07T04:36:00Z","Content":"\n\u003Cp\u003EWell, you can\u0027t build a protective \u0022bubble\u0022. You can however build a potective Donut!\u003C/p\u003E\u003Cp\u003EAll you need to do is build a toroidal spacecraft and send a current through it. This way you get a nice magnetic field and the flux lines never cross your ship.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-07T05:28:30Z","Content":"\n\u003Cp\u003EThat works. Flux will go through the hole, along with a good chunk of the plasma. It wouldn\u0027t be 100% effective, of course, but it should be pretty good. Nice idea.\u003C/p\u003E\n"}]}