{"TopicId":36160,"ForumId":50,"TopicTitle":"Advanced Air/Spaceplane Construction","CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-07-06T23:32:49Z","PageNum":1,"Articles":[{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-07-06T23:32:49Z","Content":"\n\u003Cp\u003EMany people have trouble with airplanes, and particularly their construction. Well, if you\u0027ve ever wanted to fly with the birds, here are some tips to keep you aloft.\u003C/p\u003E\u003Cp\u003EWARNING: This guide assumes that you know the basics of the game, including knowledge of what the respective engines need for flight, how to make fine-adjustments to part angling, and knowledge of what the values in part descriptions mean. This guide was not written for Ferram Aerospace, and was written during build 0.20.2 of Kerbal Space Program.\u003C/p\u003E\u003Cp\u003EChapter One: Basic airplane construction\u003C/p\u003E\u003Cp\u003EPick a command module, and start building your plane. Right now it doesn\u0027t matter if you picked a rocket engine or a jet engine for your plane, and it is slightly simpler to add a rocket engine. However, this also means that your plane will fly for less time than a jet powered plane, due to overall lower specific impulse.\u003C/p\u003E\u003Cp\u003EENGINES THAT ARE NOT RECOMMENDED:\u003C/p\u003E\u003Cp\u003ESolid rocket boosters, including the Sepratron, RT-10, and the Rockomax BACC, due to extreme acceleration and change in weight\u003C/p\u003E\u003Cp\u003EIon Engines, due to extreme power usage and low thrust\u003C/p\u003E\u003Cp\u003ERockomax-sized engines, such as the \u0022Skipper,\u0022 \u0022Mainsail,\u0022 or \u0022Poodle,\u0022 due to difficulties in attaching landing gear.\u003C/p\u003E\u003Cp\u003ENow, before putting horizontal wings on, put everything else you\u0027d like to put on the plane, on the plane, including landing gear and a rudder. This is vitally important later on to prevent having to fiddle around with the wings as you add more stuff. After you\u0027ve added everything you want, click the \u0022Center of Mass\u0022 button and the \u0022Center of Lift\u0022 button. You will see a blue spherical marker and a yellow spherical marker. Now, add two wings, using symmetry, on either side of the craft. Add a control surface to to both wings. If the Blue marker is slightly behind or inside of the craft, you\u0027re set to fly. If not, move the wings so they are. Congratulations! You\u0027ve built your first airplane.\u003C/p\u003E\u003Cp\u003EMore coming soon...\u003C/p\u003E\n"},{"CreatedByName":"Euel","CreatedById":74093,"CreatedDateTime":"2013-07-11T21:41:33Z","Content":"\n\u003Cp\u003EThanks kindly for that tip! Guess I\u0027ll be checking out the plane section of the game...\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-07-12T01:57:15Z","Content":"\n\u003Cp\u003EQuick point, the aircraft landing gear, the unpowered ones, have no mass in flight. They do move the centre of mass indicator, though, so I recommend putting landing gear on last.\u003C/p\u003E\n"}]}