{"TopicId":36248,"ForumId":16,"TopicTitle":"Going waaay too fast on Moho intercepts.","CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-07T20:24:15Z","PageNum":1,"Articles":[{"CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-07T20:24:15Z","Content":"\n\u003Cp\u003EI don\u0027t know about you guys, but I don\u0027t think 8K\u002B m/s is necessary to get into a Moho orbit, especially not according to the Dv maps I\u0027ve looked at. Am I doing something wrong with my intercepts? I timed it with protractor, and I successfully intercept at the AN of Moho\u0027s orbit. How can I slow down enough to not require ultra massive Dv to get caught by Moho\u0027s gravity?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-08T01:12:52Z\u0022 title=\u002207/08/2013 01:12  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 8, 2013\u003C/time\u003E by painking\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-07-07T20:31:42Z","Content":"\n\u003Cp\u003EWell, you\u0027re coming deep into Kerbol\u0027s gravity well, and as our buddy Hermann Oberth said, you\u0027ll be going fast as hell when you intercept Moho. There\u0027s really nothing you can do. :/\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-07T20:32:46Z","Content":"\n\u003Cp\u003EI don\u0027t know about moho specifically since I\u0027ve never been there myself, but you could consider using a gravity assist from one of its moons(does it have moons??) to help slow you down. (Or change your trajectory more correctly) thus needing a little less to actually capture\u003C/p\u003E\n"},{"CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-07T20:33:49Z","Content":"\n\u003Cp\u003EI understand going fast, but it really seems excessive. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u0022 alt=\u0022KerbinDeltaVMap.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat Dv map says it takes 2200 m/s to get into Moho\u0027s gravity after intercept, but my own maneuver burn would\u0027ve been 8400 m/s. It just really feels like I did something wrong.\u003C/p\u003E\u003Cp\u003Eedit: @hoy, Moho doesn\u0027t have any moons.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-07T20:37:17Z","Content":"\n\u003Cp\u003EYeah that\u0027s showing as only needing 2200m/s to circularize. Needing nearly 3.5x that sounds suspect..\u003C/p\u003E\u003Cp\u003EAre you positive your maneuver burn isn\u0027t set to circularize you in the opposite orbit that the one you come in at? Ie, coming in prograde but pulling the retrograde marker so far that it zeros out your orbital speed then circularize a you in the opposite direction?\u003C/p\u003E\u003Cp\u003EEdit: probably a no, because based on the numbers on that chart it would still o ly cost around 5500m/s to do what I just said.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-07T20:50:58Z\u0022 title=\u002207/07/2013 08:50  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 7, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-07-07T21:22:32Z","Content":"\n\u003Cp\u003EMoho intercepts are tricky and the standard Hohmann calculation fails pretty badly due to Moho\u0027s inclination, eccentricity, and orbital velocity. If you don\u0027t hit a good window, your intercept will come in at a large angle which means a lot of delta-v since you\u0027re so close to the sun. A good launch window can get you from LKO to 100km Moho orbit in ~5000m/s delta-v. This exact problem is one of the main reasons I made my launch window planner: \u003Ca href=\u0022http://alexmoon.github.io/ksp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-07T22:31:09Z","Content":"\n\u003Cp\u003EDelta V maps can\u0027t take account of Moho\u0027s rather high inclination or eccentricity, so yeah, it\u0027s normal. From LKO, a Moho orbit is 4,5km/s in theroy, but really you should expect something more like 7-8km/s :l\u003C/p\u003E\n"},{"CreatedByName":"esinohio","CreatedById":57681,"CreatedDateTime":"2013-07-08T03:41:20Z","Content":"\n\u003Cp\u003EShew, I guess I don\u0027t feel so bad about slinging past Moho on numerous occasions. I can\u0027t count how many times I was looking at that exact DeltaV map above wondering just what I was doing wrong. Although now armed with alexmun\u0027s nice window planner I think I\u0027ll give Moho some more attention with my minimalist rockets/probes. Love trying to get the fuel planned down to the last drop to keep those costs down.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-07-08T05:14:55Z","Content":"\n\u003Cp\u003EThe basic principle is that as your kerbol periapsis gets lower, the faster you slingshot around the sun. Given moho\u0027s orbital eccentricity, how close to kerbol you have to come, and therefore how fast you\u0027ll be moving on capture, will vary with what point on moho\u0027s orbit you intercept. If you can plan your transfer to intercept at moho\u0027s apoapsis, you\u0027ll need the least delta v to capture.\u003C/p\u003E\u003Cp\u003EDue to moho\u0027s eccentricity and inclination, it may be worth considering abandoning a traditional injection burn from kerbin, and instead launching when kerbin is at moho\u0027s ascending or descending node, thereby eliminating the inclination change burn, and leaving your kerbol periapsis above moho\u0027s orbit. Then you can wait and plan the most efficient hohmann transfer to moho, by intercepting at it its kaerbol apoapsis.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-07-08T08:11:10Z","Content":"\n\u003Cp\u003E8k is too much, most I\u0027ve seen is 5400 if you burn too much and lower the Pe way under Moho\u0027s own. Basically if you have an intercept on the second intersection between your orbit and Moho\u0027s then it\u0027ll be a lot more since you\u0027re catching up with your lower orbit. Best is to intercept Moho at the first node, either ascending or descending don\u0027t remember which, then you\u0027ll need around 2900 to circularise.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-07-08T08:25:24Z","Content":"\n\u003Cp\u003EAre you orbiting Kerbol retrograde from Moho when you enter its SOI by any chance?\u003C/p\u003E\u003Cp\u003EYou want to be going in the same direction as the target you are intercepting.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-07-08T08:42:50Z","Content":"\n\u003Cp\u003EI had to get my crafts orbit closer to Moho\u0027s orbit before pulling off a successful intercept, the dV required was just way to high to get into orbit around Moho otherwise.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-07-08T09:47:00Z","Content":"\n\u003Cp\u003ESurprisingly getting captured at moho PE requires less DV than at AP. You are moving faster but so is the planet.\u003C/p\u003E\u003Cp\u003ECapture DVs higher than predicted are normally caused by intercepting Moho while not traveling parallel to its direction of travel. At the speed the ship and Moho are both travelling around the sun at that distance a difference of a few degrees in direction of travel can work out to km/s of relative velocity.\u003C/p\u003E\u003Cp\u003ETo avoid all this use the launch planner above and make sure that your intercepts happen when paths are parallel.\u003C/p\u003E\n"}]}