{"TopicId":36379,"ForumId":32,"TopicTitle":"What haven\u0026#039;t you accomplished yet?","CreatedByName":"Spades_Neil","CreatedById":20304,"CreatedDateTime":"2013-07-09T00:33:47Z","PageNum":1,"Articles":[{"CreatedByName":"Spades_Neil","CreatedById":20304,"CreatedDateTime":"2013-07-09T00:33:47Z","Content":"\n\u003Cp\u003E(Please no posts like \u0022I\u0027ve done everything! Brag brag brag.\u0022 That\u0027s not interesting.)\u003C/p\u003E\u003Cp\u003EAnything in Kerbal Space Program you\u0027ve attempted to do, but haven\u0027t yet accomplished? My list includes traveling to the outer moons of Jool beyond Vall and making manned return trips from every world. I think Eve will be the hardest for obvious reasons.\u003C/p\u003E\u003Cp\u003EI also suck at SSTO.\u003C/p\u003E\u003Cp\u003EBut, really, I think the most fun I have in KSP is when I fail!\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2013-07-09T00:35:53Z","Content":"\n\u003Cp\u003EI have yet to return from Moho. I\u0027ve redocked with the station after landing, I just got lazy and haven\u0027t done it yet.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-07-09T00:44:55Z","Content":"\n\u003Cp\u003EGoing to any Planet and coming back, Landing a rover on Duna. (I tried a manned Dunar mission, but the rover garage broke away, causing me to plummet with nothing but a command pod and a drogue chute. Of course they survived)\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-07-09T00:45:05Z","Content":"\n\u003Cp\u003EReturn from Moho? I haven\u0027t even been to Moho. Or made a return mission from Duna\u0027s surface (The Dunebeam spacecraft currently in orbit around Kerbin is destined to do that.)\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-09T00:47:07Z","Content":"\n\u003Cp\u003EI\u0027m contemplating a round-trip to Eeloo because, while the landing is well within my capabilities, I\u0027ve never built an inter-planetary two-way craft and I want to start big.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-07-09T00:52:11Z","Content":"\n\u003Cp\u003EI\u0027ve launched several Jool bound missions with multiple probes (The Deep System Explorer or \u0022Joolbus\u0022), but there\u0027s always something wrong with it and it doesn\u0027t make it, the latest one had the fuel lines accidentally hit the radial separators instead of the tanks, and I didn\u0027t notice until it was on its way to a Jool intercept\u003C/p\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-09T00:56:42Z","Content":"\n\u003Cp\u003EI also have yet to return from anywhere despite having gone to most of the planets. Many of the flights even have the fuel to return, I can just never bring myself to bring them back and remove the evidence. Save wipe might finally motivate me to bring a few back.\u003C/p\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-07-09T00:59:36Z","Content":"\n\u003Cp\u003EYou should still be able to save that one by manually transferring the fuel with the docking fuel transfer method. (@mrbond)\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2013-07-09T01:02:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EI\u0027ve launched several Jool bound missions with multiple probes (The Deep System Explorer or \u0022Joolbus\u0022), but there\u0027s always something wrong with it and it doesn\u0027t make it, the latest one had the fuel lines accidentally hit the radial separators instead of the tanks, and I didn\u0027t notice until it was on its way to a Jool intercept\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust make sure you check everything before you leave!\u003C/p\u003E\u003Cp\u003EOh, and @Dweeb of Kerbin, please don\u0027t double post. Just edit your last post.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-07-09T01:03:25Z","Content":"\n\u003Cp\u003EEvery single planet. Oh, and docking. And returning a Kerbal from the Mun, but I\u0027m working on that.\u003C/p\u003E\n"},{"CreatedByName":"ManaaniWanderer","CreatedById":28850,"CreatedDateTime":"2013-07-09T01:04:51Z","Content":"\n\u003Cp\u003ELeaving the Kerbin-Mun-Minmus system other then a few Kerbol escape probes.\u003C/p\u003E\n"},{"CreatedByName":"Basilo1146","CreatedById":69489,"CreatedDateTime":"2013-07-09T01:10:27Z","Content":"\n\u003Cp\u003EI have yet to go to any other planet. However, I have sent something on an escape trajectory from Kerbol. Apparently the kraken still lives on Minmus.\u003C/p\u003E\n"},{"CreatedByName":"Grim187","CreatedById":73571,"CreatedDateTime":"2013-07-09T01:16:04Z","Content":"\n\u003Cp\u003Ethe things i can think of...\u003C/p\u003E\u003Cp\u003Efinding an easter egg.\u003C/p\u003E\u003Cp\u003Ecompleting a space/refueling station.\u003C/p\u003E\u003Cp\u003Eputting a base on another planet/moon.\u003C/p\u003E\u003Cp\u003Edoing a successful man\u0027d mission from start to finish.\u003C/p\u003E\u003Cp\u003Efinish a single design...I don\u0027t think i will ever do this, there will always be something i can improve on my design(s).\u003C/p\u003E\u003Cp\u003Eeverything above in a new universe without using quick save or killing a kerbin.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-07-09T01:20:58Z","Content":"\n\u003Cp\u003EBases... anywhere.\u003C/p\u003E\u003Cp\u003EI\u0027ve designed some things and tested them on Kerbin but I\u0027ve yet to send them out to colonize the planets. \u003C/p\u003E\u003Cp\u003ETo do that I\u0027ll have to put some refueling stations around the worlds first. That I have done around Kerbin and the Mun and don\u0027t expect it to be too much harder to get them to their destination. \u003C/p\u003E\u003Cp\u003EI haven\u0027t done any \u0022there and back again\u0022 missions. I also don\u0027t plan on doing any of them. I\u0027m not interested in only visiting the planets... I want to go and stay. \u003C/p\u003E\u003Cp\u003EI haven\u0027t been to all the Easter eggs. I have been to one of the Mun arches... completely on accident. \u003C/p\u003E\u003Cp\u003EI have not gotten a plane off the ground. ... I have run many planes into the ocean...\u003C/p\u003E\n"},{"CreatedByName":"JacobT11","CreatedById":11673,"CreatedDateTime":"2013-07-09T01:25:44Z","Content":"\n\u003Cp\u003EI\u0027ve still yet to return from Eeloo or the two inner planets. Though I would like to get a practical SSTO design too.\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-07-09T02:03:18Z","Content":"\n\u003Cp\u003EI have yet to successfully land ANY aircraft.\u003C/p\u003E\u003Cp\u003EI haven\u0027t actually TRIED to dock yet... Only did one docking as a test, and that was MechJeb... all it did was give me respect for how tricky it will be, and a determination not to have MK do it again.\u003C/p\u003E\u003Cp\u003EI have yet to get a probe to another planet. The Kraken is eating them... But I\u0027m working on it, and onow only switching to those probes on a clean game load, not after a long run of other things.\u003C/p\u003E\u003Cp\u003EI haven\u0027t yet landed on Minmus.\u003C/p\u003E\u003Cp\u003EI HAVE: Built some nice rovers, they test well on Kerbin.\u003C/p\u003E\u003Cp\u003EI have been manned to the Mun and back.\u003C/p\u003E\u003Cp\u003EI have orbited many one-piece stations, and probes around all three kerbin-based Bodies.\u003C/p\u003E\u003Cp\u003ENothing else yet, really. I spend more time reading forums than playing, it seems.\u003C/p\u003E\n"},{"CreatedByName":"firebos7","CreatedById":62012,"CreatedDateTime":"2013-07-09T02:07:53Z","Content":"\n\u003Cp\u003EWell I\u0027ve now been to mun and back, put a probe on the south pole of Laythe and been to Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E those were some of my initial plans\u003C/p\u003E\u003Cp\u003EAlso flew some of the little buggers up to the north pole.\u003C/p\u003E\u003Cp\u003EJust did my first dock tonight.\u003C/p\u003E\u003Cp\u003EI think from here I\u0027m going to work on getting a rover somewhere (probably mun) and after that maybe a mun base.\u003C/p\u003E\u003Cp\u003EI should probably visit Minmus as well at some point, and eventually I\u0027d like to see if I can get a return trip to Eeloo.\u003C/p\u003E\n"},{"CreatedByName":"CtrlAltEL1TE","CreatedById":2847,"CreatedDateTime":"2013-07-09T02:11:07Z","Content":"\n\u003Cp\u003EInterplanatery SSTO (What im working on right now)\u003C/p\u003E\u003Cp\u003EA satelite (IS maps) at every body (Also working on this)\u003C/p\u003E\u003Cp\u003ELand at Eeloo or Dres. On my list for a long long time.\u003C/p\u003E\n"},{"CreatedByName":"Penguinhero","CreatedById":42632,"CreatedDateTime":"2013-07-09T02:11:43Z","Content":"\n\u003Cp\u003Ei have yet to land to moho, Eeloo, and any of the moons in the joolian system\u003C/p\u003E\n"},{"CreatedByName":"Coneshot","CreatedById":69785,"CreatedDateTime":"2013-07-09T02:24:11Z","Content":"\n\u003Cp\u003EAfter many attempts, poor Jebediah and Bill are still stuck on Eve. I have sent several missions and they add to the growing population of my Eve colony.\u003C/p\u003E\n"},{"CreatedByName":"Chrisd857","CreatedById":57291,"CreatedDateTime":"2013-07-09T02:26:17Z","Content":"\n\u003Cp\u003ELanding a plane on a runway (main one or island). I can take off and fly okay, but landing? I have landed, but on the flat ground of KSC and not the runway.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-07-09T02:29:59Z","Content":"\n\u003Cp\u003EThe only thing left on my to-do list for the current features of KSP is to make a spaceplane that actually gets into orbit. I think I\u0027ll wait for the improved SAS in 0.21 before I try that...\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-07-09T03:00:59Z","Content":"\n\u003Cp\u003EI have not yet made a cyclogyro (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Cyclogyro\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Cyclogyro\u003C/a\u003E).\u003C/p\u003E\n"},{"CreatedByName":"SleepyWacKo","CreatedById":72826,"CreatedDateTime":"2013-07-09T03:05:18Z","Content":"\n\u003Cp\u003Ei haven\u0027t accomplished anything really yet other than getting into orbit than i heard about 0.21 so currently waiting on it before i do anything other than blow up kerbals.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-09T03:09:01Z","Content":"\n\u003Cp\u003EI have yet to land on Moho (I\u0027ve only managed an orbital probe) and I have not landed a kerbal on Eeloo (All I have done is lane a tiny probe there). Soon I will attempt to return from Eve.\u003C/p\u003E\n"}]}