{"TopicId":36458,"ForumId":36,"TopicTitle":"SteamGauges Beta release 1.6.1b [27 Dec]","CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-09T18:23:50Z","PageNum":1,"Articles":[{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-09T18:23:50Z","Content":"\n\u003Cp\u003EVersion 1.6.1b release is now available!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60863-0-23-0-Toolbar-1-3-0-Common-API-for-draggable-resizable-buttons-toolbar\u0022 rel=\u0022external nofollow\u0022\u003EBlizzy\u0027s Toolbar included\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBeta Changes:\u003C/p\u003E\u003Cp\u003EThis version fixes an issue with the node gauge and the new building upgrade mechanics. Also, I have added a navigation gauge.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oj2XzNk.png\u0022 alt=\u0022oj2XzNk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECurrently, the nav gauge only appears when a waypoint is selected via the KSP map. There are four main components. The first is the rotating compass card in the middle of the gauge. It rotates so that the active vessel\u0027s current heading is always at the top of the gauge. The yellow needle is a bearing pointer that will point towards the active waypoint. To head towards the waypoint, just move the needle to the top of the gauge. In the upper left corner is a block labeled \u0022DME\u0022 (distance measuring equipment) that gives the distance to the active waypoint in km. And in the bottom left is a time block labeled \u0022ETE\u0022 (estimated time enroute), which gives you the time it would take to reach the active waypoint if you moved directly there at your current ground speed. \u003C/p\u003E\u003Cp\u003ETired of all of those compact, precise, and easily interpretable digital readouts cluttering up your orbital maneuvers? Do you look back to days when needles arced gracefully accross illegible numbers with irregularly spaced dividing lines? Then SteamGauges is the plugin for you! Bringing a variety of analog instruments to a space program near you.\u003C/p\u003E\u003Cp\u003ESteamGauges is a plugin for KSP that adds a number of analog-style gauges based mostly around aircraft instrumentation. Simply drop the SteamGauges folder into your GameData directory, and then click the gauge icon to bring up a menu of available gauges. Toggle on or off the gauges you want, then close the menu again. All the gauges are draggable, and remember their positions. Please note, as this is a plugin and not a part-based mod, it is global and not vehicle specific.\u003C/p\u003E\u003Cp\u003EGauges in V1.6\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAir Gauge\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe outer ring displays calibrated airspeed in hundreds of meters per second. Note that CAS is pressure dependent, and will decrease with altitude. The HUD can be toggled between CAS and TAS (KSP\u0027s reported surface velocity).\u003C/p\u003E\u003Cp\u003EThe current Mach number is displayed at the top of the inner gauge.\u003C/p\u003E\u003Cp\u003EBellow that is the current Angle of Attack. Based on the critical AoA (default 25, editable in the settings window), the STALL warning will illuminate.\u003C/p\u003E\u003Cp\u003EAt the bottom of the gauge is the air intake efficiency. The green portion of the gauge is 200% to 600% of the current required amount of intake air. The yellow portion is 100% to 200%, and the red portion is below 100%. If the needle falls into the red, expect an engine flameout is immanent.\u003C/p\u003E\u003Cp\u003EThis gauge is only active in atmosphere, and is probably only meaningful in Kerbin\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERadar Altimeter:\u003C/span\u003E \u003C/p\u003E\u003Cp\u003E- This radar altimeter displays the active vehicle\u0027s current height above the terrain in meters, on a variable scale from 5,000 down to 0\u003C/p\u003E\u003Cp\u003E- The red needle displays the minimum altitude for a suicide burn on airless worlds.\u003C/p\u003E\u003Cp\u003E- The two buttons allow for automatic start and stop of suicide burns on airless worlds.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMagnetic Compass:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - This compass is just that: a compass. It displays your heading in degrees.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EFuel Gauge:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - This dual purpose gauge displays the remaining rocket fuel (not oxidizer) remaining as a percentage of total fuel carried on board, as well as the amount of monopropellant remaining.\u003C/p\u003E\u003Cp\u003E - There is a two color indicator light for both gauges. It turns yellow when the quantity is below 25%, and red when below 1%. \u003C/p\u003E\u003Cp\u003E - If people are interested, I might add a toggle switch for total/stage fuel, and possible an oxidizer needle that would be drawn on the same scale as the fuel needle.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EElectrical Gauge:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - Displays current battery charge as a percent, as well as draw or charge. Unlike the stock UI gauge, negative values are showing usage, and positive values show charge.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EOrbital Gauge:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - This display has everything you need to get to orbit!\u003C/p\u003E\u003Cp\u003E - Digital readouts of Apoapsis, Periapsis, and orbital period (HHH:MM:SS)\u003C/p\u003E\u003Cp\u003E - There are 4-color lights next to the AP and PE indicators. They are normally off, but illuminate under the following conditions:\u003C/p\u003E\u003Cp\u003E * AP Red = Apoapsis below atmosphere\u003C/p\u003E\u003Cp\u003E * AP Yellow = Vessel is on an escape trajectory from current SOI\u003C/p\u003E\u003Cp\u003E * AP Green = Apoapsis is above to 20% above the atmosphere\u003C/p\u003E\u003Cp\u003E * AP Blue = Apoapsis and Periapsis are within 1% of each other\u003C/p\u003E\u003Cp\u003E * PE Red = Periapsis is below ground level\u003C/p\u003E\u003Cp\u003E * PE Yellow = Periapsis is below the top of the atmosphere\u003C/p\u003E\u003Cp\u003E * PE Green = Periapsis is above to 20% above the atmosphere\u003C/p\u003E\u003Cp\u003E * PE Blue = Periapsis and Apoapsis are within 1% of each other\u003C/p\u003E\u003Cp\u003E - There are two green \u0022B\u0022 lights next to the AP/PE readouts. These indicate the optimal burn window for that node.\u003C/p\u003E\u003Cp\u003E- Analog inclination gauge (KSP only gives positive inclination values, so the bottom half of the gauge isn\u0027t used)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERendezvous Gauge:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - This is a stack of three gauges in one! It is intended for vessel rendesvous rather than planetary rendesvous, although many of the elements will still be accurate.\u003C/p\u003E\u003Cp\u003E - The left gauge displays the target vessel\u0027s Apoapsis, Periapsis, Period, and the active vessel\u0027s relative inclination.\u003C/p\u003E\u003Cp\u003E - The center gauge displays relative velocity in meters per second. The cross represents horizontal and vertical drift, while the number in the upper left corner is forward motion.\u003C/p\u003E\u003Cp\u003E - The right gauge displays target distance, the approximate closest approach in the next orbit, and how long until that approach will occur.\u003C/p\u003E\u003Cp\u003E - The distance indicator has a tri-color, normally dark light that illuminates when:\u003C/p\u003E\u003Cp\u003E * Green = Target is within 1km\u003C/p\u003E\u003Cp\u003E * Yellow = Target is within 100m\u003C/p\u003E\u003Cp\u003E * Red = Target is within 10m\u003C/p\u003E\u003Cp\u003E - I am still looking for additional useful information to display in the right gauge.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EHUD\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E - This is a Heads Up Display, which is the exact opposite of a steam gauge. It displays lots of precise information in a small-ish space.\u003C/p\u003E\u003Cp\u003E - The HUD can be toggled on or off by pressing the \u0027H\u0027 key.\u003C/p\u003E\u003Cp\u003E - The center of the HUD is dominated by the pitch ladder which shows vessel pitch and (in chase/IVA) roll against the horizon. Each 10 degree line is labeled, while the 5 degree lines are not.\u003C/p\u003E\u003Cp\u003E - Within the pitch ladder you will see a flight path vector like the NavBall. If you have a target selected, it will be indicated by a box. A maneuver node is indicated by a diamond. The opposite direction for all indicators is marked with an \u0027X\u0027 through the symbol.\u003C/p\u003E\u003Cp\u003E - At the top of the pitch ladder is a bank indicator for times when the horizon is not a valid reference. The top arrow is \u0022Up\u0022, and the bottom arrow is where the top of your craft is pointing. Line them up to be level, and bank to move the arrow in the direction you want it to move (If it is left of center, roll right to center it). There are marker lines at 10, 30, 45, 60, 90, 120, 150, and 180 degrees.\u003C/p\u003E\u003Cp\u003E - To the left of the pitch ladder is an air speed tape (surface velocity). Below this is a groundspeed readout.\u003C/p\u003E\u003Cp\u003E - To the right of the pitch ladder is an altitude tape. Below this is radar altitude.\u003C/p\u003E\u003Cp\u003E - At the bottom of the gauge is a compass card.\u003C/p\u003E\u003Cp\u003E - Around the outside of the tapes are additional readouts like Ap, Pe, throttle, etc.\u003C/p\u003E\u003Cp\u003E - TTAp/TTPe are the time to Apoapsis and Periapsis\u003C/p\u003E\u003Cp\u003E - Incl is inclination.\u003C/p\u003E\u003Cp\u003E - TD is target distance, TAp/TPe are target Apoapsis/Periapsis, TAlt is target altitude.\u003C/p\u003E\u003Cp\u003E - RVel is relative velocity. The last digit is 1/10th of a m/s, but I think the . is misplaced.\u003C/p\u003E\u003Cp\u003E - CAppr is closest approach, and TTCA is time until closest approach. RIncl is relative inclination.\u003C/p\u003E\u003Cp\u003E - Delta V and DeltaVRem are self explanatory. BurnT is burn time, and TTBurn is time to burn.\u003C/p\u003E\u003Cp\u003E- Warnings are displayed on the HUD when electrical charge, monopropellant, or total fuel falls below 5% of vessel maximum.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAdvanced Settings Menu\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe Advanced Settings menu allows users to fine tune the gauges to their liking. Each gauge has a Scale slider that can increase or decrease the size of the gauge. Several gauges have additional options:\u003C/p\u003E\u003Cp\u003ERadar Altimeter:\u003C/p\u003E\u003Cp\u003E* Green Light - Below this altitude and above the Yellow Light altitude, the green light illuminates.\u003C/p\u003E\u003Cp\u003E* Yellow Light - Below this altitude and above the Red Light altitude, the yellow light illuminates.\u003C/p\u003E\u003Cp\u003E* Red Light - Below this altitude, the red light illuminates.\u003C/p\u003E\u003Cp\u003EFuel Gauge:\u003C/p\u003E\u003Cp\u003E* Fuel Lights R, Y, G - The red, yellow, and green lights on the fuel gauge light up below these values.\u003C/p\u003E\u003Cp\u003E* Mono Lights R, Y, G - The red, yellow, and green lights on the mono propellant gauge light up below these values.\u003C/p\u003E\u003Cp\u003EOrbital Gauge:\u003C/p\u003E\u003Cp\u003E* Safe Altitude - The green light illuminates from the top of the atmosphere up to this altitude above the atmosphere. For Kerbin, a value of 1.2 means the green light is on from 70,000m to 84,000m.\u003C/p\u003E\u003Cp\u003E* Circularization Threshold - The AP and PE lights illuminate blue when they are within this percent of each other. \u003C/p\u003E\u003Cp\u003E * Burn Window - The burn lights illuminate this many seconds before and after the associated node.\u003C/p\u003E\u003Cp\u003ERendezvous Gauge:\u003C/p\u003E\u003Cp\u003E* Distance Lights R,Y,G - The red, yellow, and green lights illuminate as the target closes past the given distances.\u003C/p\u003E\u003Cp\u003ENav Gauge:\u003C/p\u003E\u003Cp\u003ECurrently, the nav gauge only appears when a waypoint is selected via the KSP map. There are four main components. The first is the rotating compass card in the middle of the gauge. It rotates so that the active vessel\u0027s current heading is always at the top of the gauge. The yellow needle is a bearing pointer that will point towards the active waypoint. To head towards the waypoint, just move the needle to the top of the gauge. In the upper left corner is a block labeled \u0022DME\u0022 (distance measuring equipment) that gives the distance to the active waypoint in km. And in the bottom left is a time block labeled \u0022ETE\u0022 (estimated time enroute), which gives you the time it would take to reach the active waypoint if you moved directly there at your current ground speed. \u003C/p\u003E\u003Cp\u003EHUD:\u003C/p\u003E\u003Cp\u003E * Scale\u003C/p\u003E\u003Cp\u003E * The various buttons enable or disable different portions of the HUD if you want a more decluttered look, or prefer a different gauge for looking at some info.\u003C/p\u003E\u003Cp\u003E * HUD Color: Use the Red, Green, and Blue sliders to make the HUD your favorite shade of orange, red, or puce.\u003C/p\u003E\u003Cp\u003EDownloads\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://1drv.ms/1r8A5Sy\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E Download 1.5.6a\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://1drv.ms/1vnQIA2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESource Code\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESteamgauges is far from finished, so I am looking for any constructive feedback. Enjoy.\u003C/p\u003E\u003Cp\u003EStable release at \u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/223151-steamgauges\u0022 rel=\u0022external nofollow\u0022\u003ECurse\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-28T01:58:02Z\u0022 title=\u002212/28/2014 01:58  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 28, 2014\u003C/time\u003E by Trueborn\u003C/strong\u003E\n\u003Cbr\u003EVersion 1.6.1b update.\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-09T18:36:46Z","Content":"\n\u003Cp\u003ELooks great! Is it possible to resize the windows?\u003C/p\u003E\u003Cp\u003EA suggestion: If possible incoperate the \u0027low level\u0027 warning lights from the fuel gauge into radar altimeter. Make when each light goes off set by user. Then it could be set up to signal yellow at braking burn point and red for final decent burn. Just a though.\u003C/p\u003E\u003Cp\u003EYou may also want to consider posting that screenshot in imgur or something and actually puttin pic in OP. Some may pass over this not being able to see it right away =P\u003C/p\u003E\u003Cp\u003EThey do look amazing, well done!\u003C/p\u003E\n"},{"CreatedByName":"Dave7","CreatedById":70552,"CreatedDateTime":"2013-07-09T18:59:18Z","Content":"\n\u003Cp\u003ESize and opacity settings would be handy. Looks good.\u003C/p\u003E\n"},{"CreatedByName":"Hyratel","CreatedById":4486,"CreatedDateTime":"2013-07-09T19:22:26Z","Content":"\n\u003Cp\u003Eno! bad maker! bad! no cookie! your pictures go in the post, not in the download\u003C/p\u003E\n"},{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2013-07-10T11:31:48Z","Content":"\n\u003Cp\u003EI don\u0027t want to be picky but you spelled rendezvous wrong on the menu.\u003C/p\u003E\u003Cp\u003EAnd it looks like the textures aren\u0027t sharp either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-10T11:47:07Z\u0022 title=\u002207/10/2013 11:47  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 10, 2013\u003C/time\u003E by MK3424\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CERVERUS","CreatedById":15589,"CreatedDateTime":"2013-07-10T12:19:03Z","Content":"\n\u003Cp\u003EI like it,please continue with updates if you can.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-11T03:32:13Z","Content":"\n\u003Cp\u003EAlright, I have a new beta release up and available for download \u003Ca href=\u0022http://sdrv.ms/12Bv7AN\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E I\u0027ll be editing the main post as well, but here are the major updates:\u003C/p\u003E\u003Cp\u003E* Advanced Settings menu now available. This allows users to scale individual gauges down to 25% and up to 200% of the original size. Additionally, there are settings for individual gauges.\u003C/p\u003E\u003Cp\u003E* A global transparency slider has been added to the main menu. I\u0027m not really pleased with it because of the way it is exposing the texture layers, but I\u0027ve left it in for now. I\u0027ll be working on improving the layering (along with higher res textures) in a future release.\u003C/p\u003E\u003Cp\u003E* The radar altimeter now has a simple tri-color light that (when descending) goes from green to yellow to red.\u003C/p\u003E\u003Cp\u003EPlan going forward:\u003C/p\u003E\u003Cp\u003EIncrease texture resolution, and improve transparency.\u003C/p\u003E\u003Cp\u003EUse maximum terrain values for worlds w/out atmospheres.\u003C/p\u003E\u003Cp\u003EReplace Radar Altimeter textures to fit in with the rest of the gauges.\u003C/p\u003E\n"},{"CreatedByName":"CERVERUS","CreatedById":15589,"CreatedDateTime":"2013-07-11T04:19:18Z","Content":"\n\u003Cp\u003EGreat,i like \u0022drive\u0022 my capsule to IVA mode and these instruments gauges give me the joy !!!\u003C/p\u003E\u003Cp\u003EAll are so awesome!\u003C/p\u003E\u003Cp\u003EKeep it up my friend!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-07-11T11:30:59Z","Content":"\n\u003Cp\u003EWould that be possible to make an IVA instrument version of these?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-11T15:17:50Z","Content":"\n\u003Cp\u003EThe gauges look great on full resolution, unfortunatly they become blurry and almost unreadable if your playing with your graphic settings turned down a bit.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-12T01:29:30Z","Content":"\n\u003Cp\u003E@Dragon01: I\u0027m not really much of a modeler, so I probably won\u0027t be straying into 3d versions of these gauges. That being said, with their scalability you should be able to use them in your favorite IVA pretty easily as-is.\u003C/p\u003E\u003Cp\u003E@KhaosCorp: I\u0027m done doubling the base resolution of the textures, but I have to update some hard-coded numbers before I release them. I\u0027ll take a look at lower graphics settings, though. What specifically was causing them to be unreadable? Were they blurring at lower resolutions, or some other global setting?\u003C/p\u003E\u003Cp\u003EThanks everyone for the suggestions and encouragement. Let me know if there is a readout you are really missing and I\u0027ll see if I can fit it in.\u003C/p\u003E\n"},{"CreatedByName":"TerranCmdr","CreatedById":23552,"CreatedDateTime":"2013-07-12T02:37:29Z","Content":"\n\u003Cp\u003EThis is so awesome, thanks for making this! Definitely going to use it to monitor my fuel and monopropellant. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-12T03:02:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trueborn\u0022 data-cite=\u0022Trueborn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@KhaosCorp: I\u0027m done doubling the base resolution of the textures, but I have to update some hard-coded numbers before I release them. I\u0027ll take a look at lower graphics settings, though. What specifically was causing them to be unreadable? Were they blurring at lower resolutions, or some other global setting?\u003C/p\u003E\u003Cp\u003EThanks everyone for the suggestions and encouragement. Let me know if there is a readout you are really missing and I\u0027ll see if I can fit it in.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn \u0027half res\u0027 with render speed set \u0027fast\u0027 they are just blurry, and it was really just the text/numbers. I have my settings turned down so I can have more mods installed =P\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-14T02:45:54Z","Content":"\n\u003Cp\u003ENew release! Version 0.4b is now available for \u003Ca href=\u0022http://sdrv.ms/12Bv7AN\u0022 rel=\u0022external nofollow\u0022\u003Edownload.\u003C/a\u003E The major change is in the textures. They are all now twice the original resolution, so when scaled up should be nice and sharp. There are numerous other changes including:\u003C/p\u003E\u003Cp\u003E* Totally new Rader Altimeter textures, should fit in better with the rest.\u003C/p\u003E\u003Cp\u003E* AP/PE Burn Window on the orbital gauge. During the user defined (30 second default) window before and after Apoapsis/Periapsis, a green \u0022B\u0022 will illuminate next to the appropriate window. You should be able to circularize an orbit from launch just by referencing the orbital gauge.\u003C/p\u003E\u003Cp\u003E* When orbiting worlds without an atmosphere, the orbital gauge should now give correct red, yellow, and green lights based on that body\u0027s maximum terrain elevation.\u003C/p\u003E\u003Cp\u003E*And many bug fixes.\u003C/p\u003E\u003Cp\u003EI plan on this being the last beta release, after which the mod will be set loose on the spaceport. So again, any bugs or glitches that anyone finds would be appreciated. Thanks, and enjoy.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-14T03:47:12Z","Content":"\n\u003Cp\u003EJust loaded up 0.4 and everything looks good. With the new textures I can read and see everything on the various gauges even on the low settings I use. The radaralt looks great now. Is there a way to move the location of menu button?\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-14T03:56:10Z","Content":"\n\u003Cp\u003EYes, there is. You should just be able to grab the small, outer border of the button and move it that way. That\u0027s another planned change for the final release though. I want to make it work more like Kerbal Alarm Clock, where the whole thing is clickable and dragable.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-19T17:59:52Z","Content":"\n\u003Cp\u003ENew beta release! After some feedback from the wider v1.0 release, v1.1b is now available \u003Ca href=\u0022http://sdrv.ms/12Bv7AN\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EChanges are mostly cosmetic, but hopefully make the gauges more usable.\u003C/p\u003E\u003Cp\u003EFirst, the larger, square bezels can now be toggled on or off from the main menu.\u003C/p\u003E\u003Cp\u003ESecond, the main and advanced settings menu should now scale themselves better to fit all information. Please let me know if you don\u0027t see the \u0022Close\u0022 button at the bottom of the advanced settings window.\u003C/p\u003E\u003Cp\u003EFinally, each gauge now displays its current scale value below the scale slider, so you can set them to approximately the same scale (please note, you can\u0027t change the value in the text box, it is read only).\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-29T03:40:11Z","Content":"\n\u003Cp\u003ENew beta version 1.2b available!\u003C/p\u003E\u003Cp\u003EThere is a new beta, and really preview, version of SteamGauges available now.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/CHNFf\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAs usual, it can be downloaded at \u003Ca href=\u0022http://sdrv.ms/12Bv7AN\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://sdrv.ms/12Bv7AN\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo, the new gauge is...a HUD! I know this totally goes against the theme of rest of the mod, but I think its pretty slick none the less. This is a work in progress just demonstrating the proof of concept so far. I\u0027ll be adding airspeed and altitude tapes, fixing the compass and more before release. I was hoping to get a little feedback on how people might like to use this. It is based off my experience with aircraft HUDs, and makes the most sense from a horizontal frame of reference. Besides simply replicating the NAVBALL (which isn\u0027t so simple without a 3d model, which I\u0027m not currently doing), what do you think would be useful for vertical flight?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-29T03:57:22Z","Content":"\n\u003Cp\u003EI love it! Perfect for jets! This will make carrier landings alot smoother. \u003C/p\u003E\u003Cp\u003EMy only suggestion would be change the coloring a bit. The shade of green is almost invisible over the grass terrain of Kerbin, even hard to see if over the water. Maybe it just needs to be a bit darker?\u003C/p\u003E\u003Cp\u003EAwesome update!!\u003C/p\u003E\n"},{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2013-07-29T10:16:31Z","Content":"\n\u003Cp\u003EMe too! i love the HUD!\u003C/p\u003E\u003Cp\u003Eand also: can you release the HUD as a seperate plugin and also make it display in the center of the screen only.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T13:38:02Z\u0022 title=\u002207/29/2013 01:38  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by MK3424\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-29T13:58:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MK3424\u0022 data-cite=\u0022MK3424\u0022\u003E\u003Cdiv\u003EMe too! i love the HUD!\u003Cp\u003Eand also: can you release the HUD as a seperate plugin and also make it display in the center of the screen only.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI may release a standalone HUD if it gets complex enough, but you can just turn off all the gauges you don\u0027t want. And while auto-centering is nice in theory, I would like it to work in a wide variety of IVAs as well, so it needs to be freely movable and scalable to fit in whatever space people have. The HUD is actually quite a bit wider than the outputs you\u0027re seeing now, so if I don\u0027t use all that extra horizontal space the window will get a bit smaller, so you shouldn\u0027t be dragging it around as much on accident.\u003C/p\u003E\n"},{"CreatedByName":"Swifty","CreatedById":57822,"CreatedDateTime":"2013-07-29T17:04:05Z","Content":"\n\u003Cp\u003EThe HUD looks awesome! Its exactly what KSP needs. \u003C/p\u003E\u003Cp\u003EOne comment based solely on your screenshot- Can you move the altitude values a little further to the right to be outside of the pitch meter thingy similar to were the values are on the left\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-08-03T21:31:40Z","Content":"\n\u003Cp\u003ENew beta version is available! Much improved HUD functionality, as well as a couple of bug fixes. The biggest improvements are airspeed and altitude tapes, and additional information positioned around the HUD. There are three new options in the advanced menu. You can disable pitch ladder rotation (good for some external views), turn off the smaller, interior airspeed/altitude readouts, and disable the external information. Downloads are on the first page. Next up should be the various markers like prograde, target, etc.\u003C/p\u003E\n"},{"CreatedByName":"WedgeJAntilles","CreatedById":67191,"CreatedDateTime":"2013-08-07T16:26:49Z","Content":"\n\u003Cp\u003EYes! The HUD looks amazing, and I\u0027ll be especially happy once it gets prograde \u0026amp; target markers. One suggestion, I would love a HUD mode that\u0027s relative to the orbit rather than the surface. I\u0027m thinking the Orbital mode of the HUD in Orbiter, if you\u0027re familiar with that. It would make it much easier to figure out which direction to point when I want to do a normal or radial burn; right now the only way is to use a maneuver node, which is inconvenient, or guess, which is really hard when you\u0027re not in an equatorial orbit already.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-08-08T00:21:07Z","Content":"\n\u003Cp\u003EThe markers will come first, but that sounds very interesting. From some brief research, that mode would essentially display (0, 0, 0) (pitch, yaw, roll) as the prograde vector? Thus, to burn prograde you just burn at (0, 0, 0), and retrograde would be (0, 180, 0). To increase inclination (0, 90, 0), etch. That sound about right?\u003C/p\u003E\n"}]}