{"TopicId":36516,"ForumId":16,"TopicTitle":"If you...","CreatedByName":"flowen8","CreatedById":4069,"CreatedDateTime":"2013-07-10T03:07:18Z","PageNum":1,"Articles":[{"CreatedByName":"flowen8","CreatedById":4069,"CreatedDateTime":"2013-07-10T03:07:18Z","Content":"\n\u003Cp\u003EIf you have a 5km high craft landed on the mun, have the same orbital velocity as something in a 5km orbit? This would be for a 5km orbital fuel line for the kethane mod, so i don\u0027t have to land on the mun everytime.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-10T03:24:50Z\u0022 title=\u002207/10/2013 03:24  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 10, 2013\u003C/time\u003E by flowen8\u003C/strong\u003E\n\u003Cbr\u003Eto clarify\n\u003C/span\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-10T03:12:08Z","Content":"\n\u003Cp\u003ENo, it won\u0027t be moving at all (relative to the Mun). What horizontal force would there be to set it in motion? Ordinarily, you provide that by burning prograde. And even though the Mun doesn\u0027t have drag, you\u0027d still experience friction. Does the Great Wall of China move at the same speed as something in a 6000 kilometer-high orbit?\u003C/p\u003E\u003Cp\u003EI\u0027m not sure I fully understand your question.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-10T03:12:38Z","Content":"\n\u003Cp\u003EErr, it would move at the speed of the ground. But that\u0027s IF you could make such a craft. I believe that anything longer than 2.5 Km wont fully render, and that\u0027s excluding the part count...\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-07-10T03:37:16Z","Content":"\n\u003Cp\u003EIf orbital speed were at all related to rotational speed, then the rocks and suchlike on planetary bodies would be at or near freefall. Now that would be exciting!\u003C/p\u003E\n"},{"CreatedByName":"PixelStache","CreatedById":73900,"CreatedDateTime":"2013-07-10T03:59:45Z","Content":"\n\u003Cp\u003EIt would, but only if synchronous orbit around the mun was 5km. Unfortunately it\u0027s much higher (it\u0027s so high it isn\u0027t even possible) and an object orbiting around the moon at 5km would scream past your tower. That being said, I\u0027m not even sure it\u0027s possible to build such a large tower in KSP.\u003C/p\u003E\u003Cp\u003EIf you\u0027re ever curious about your speed, test it for yourself! You can click on your orbital velocity panel (just above the nav ball) to cycle to surface speed. If you\u0027re in a stationary orbit, the speed will be zero, and at low altitude orbits it will be much higher.\u003C/p\u003E\n"},{"CreatedByName":"firerider521","CreatedById":60860,"CreatedDateTime":"2013-07-10T05:18:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003ENo, it won\u0027t be moving at all (relative to the Mun). What horizontal force would there be to set it in motion? Ordinarily, you provide that by burning prograde. And even though the Mun doesn\u0027t have drag, you\u0027d still experience friction. Does the Great Wall of China move at the same speed as something in a 6000 kilometer-high orbit?\u003Cp\u003EI\u0027m not sure I fully understand your question.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the Great Wall of China 6000 kilometers high?\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-10T06:18:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022firerider521\u0022 data-cite=\u0022firerider521\u0022\u003E\u003Cdiv\u003EIs the Great Wall of China 6000 kilometers high?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBefore the edit, the original post used the word \u003Cem\u003Elong\u003C/em\u003E, which gave me an incorrect mental image...hence my confusion.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-10T06:39:47Z","Content":"\n\u003Cp\u003EIf the gravitational force is applied to individual modules, tidal forces will rip a 5km long ship apart. Though, that should happen long before you manage to land.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-07-10T06:56:10Z","Content":"\n\u003Cp\u003EBesides, ship parts are only fully simulated within a range of 2.25kms of your current POV, so that\u0027s as tall as any tower can get. Not to mention that it would be quite a trick simply keeping the thing from collapsing under its own weight. flowen8, what you\u0027re suggesting is like a space elevator, which only works if you build it up to the geostationary altitude of the world in question, which for Mun, is more than its ~2200km SOI radius.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-07-10T07:28:15Z","Content":"\n\u003Cp\u003EWhat you are describing is similar to the Space Elevator concept. You basically want a tower that reaches up to geostationary orbit.\u003C/p\u003E\u003Cp\u003EThis is not possible on the Mun, because the altitude of a geostationary orbit is beyond the Mun\u0027s SOI. On Kerbin, it would need to be 2868km tall, which poses quite a challenge, as anything larger than 2.5km cannot be rendered by the graphics engine. On Earth, it would need to be 36000km tall, which poses all sorts of structural problems. \u003C/p\u003E\u003Cp\u003EI suggest reading up on the Space Elevator idea.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-07-15T17:31:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pebble_garden\u0022 data-cite=\u0022pebble_garden\u0022\u003E\u003Cdiv\u003EIf orbital speed were at all related to rotational speed, then the rocks and suchlike on planetary bodies would be at or near freefall. Now that would be exciting!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECompletely possible on a resonably quickly spinning munlet/large asteroid. walk in the wrong direction and you attain escape velocity...\u003C/p\u003E\n"}]}