{"TopicId":36600,"ForumId":24,"TopicTitle":"Getting started","CreatedByName":"zak233","CreatedById":73995,"CreatedDateTime":"2013-07-10T20:37:28Z","PageNum":1,"Articles":[{"CreatedByName":"zak233","CreatedById":73995,"CreatedDateTime":"2013-07-10T20:37:28Z","Content":"\n\u003Cp\u003EHey all, I just got KSP yesterday and have been tryin to learn how to do things\u003C/p\u003E\u003Cp\u003EI did the tutorials and whatnot, and tried a scenario or two. I don\u0027t know much about the rocket building. I tried starting with this campaign guide \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Campaign:_Age_of_Rocketry\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Campaign:_Age_of_Rocketry\u003C/a\u003E and did ok til the liquid fuel engine part, I couldn\u0027t figure out how to point it east, and I definitely wasn\u0027t able to do the last part of landing on a particular island. A lot of times my liquid fuel rocket starts to veer off and sometimes do flips in the air lol\u003C/p\u003E\u003Cp\u003ESo anyways, if you all have tips on where to start learning stuff I\u0027d appreciate it - I kinda suck hard right now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-07-11T00:42:12Z","Content":"\n\u003Cp\u003EDo you have a screenshot of the rocket you\u0027re using?\u003C/p\u003E\u003Cp\u003ESuggestions: FINS. to steer, wasd, with qe to handle rotation. yeah, hitting a particular island will take some practice. pick a big one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIIRC, that campaign asks you to use \u0022primitive\u0022 measures... but if plain fins aren\u0027t enough, try the fins with active control tabs, like the AV8.\u003C/p\u003E\n"},{"CreatedByName":"zak233","CreatedById":73995,"CreatedDateTime":"2013-07-11T15:50:13Z","Content":"\n\u003Cp\u003EOkay I started using this guide here \u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=152678470\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=152678470\u003C/a\u003E which has been pretty helpful so far. I\u0027m down to Step 3 which is achieving orbit. I\u0027ve yet to be able to orbit around the planet, let alone make it to the moon. Here is a screenshot of my rocket\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903253714778367284/37D7532BB9C9CFE315FDF90DD2562E3567A95CEC/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003E It\u0027s quite wobbly, which the guide said would happen and I tried to stabilize it some with connectors...\u003C/p\u003E\u003Cp\u003EOnce I get out of the atmosphere and disengage my last main rocket, the remaining ship starts spinning and is very difficult to control. I actually made a video of my latest, and so far best, attempt and put it on youtube. \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/3BW3ZPNpn-Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAs you can see, with SAS on the flaps just start goin nuts...not sure if it\u0027s supposed to do that. \u003C/p\u003E\u003Cp\u003EIs there not a way to plot a course to get into orbit and have an autopilot execute it? I\u0027m doin pretty bad steering myself\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-11T18:00:44Z\u0022 title=\u002207/11/2013 06:00  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 11, 2013\u003C/time\u003E by zak233\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"roosterr","CreatedById":61317,"CreatedDateTime":"2013-07-11T19:07:32Z","Content":"\n\u003Cp\u003ETo go east, simply tap your D button just after launch so your heading bug drives down the line marked 90. Toggle your ASAS on/off between turns.\u003C/p\u003E\u003Cp\u003EAlso realize the difference between SAS and ASAS. \u003C/p\u003E\u003Cp\u003ESAS uses a torque method of internal mechanisms (I think pendulums and/or internal motors) of rotating your command module. This is more effective if you are in orbit on smaller craft.\u003C/p\u003E\u003Cp\u003EASAS will actually steer your rocket motors and/or fins and work best in atmosphere on larger craft.\u003C/p\u003E\n"},{"CreatedByName":"zak233","CreatedById":73995,"CreatedDateTime":"2013-07-11T20:31:01Z","Content":"\n\u003Cp\u003EI actually managed to make it to the moon. I got into orbit, the problem I was having before is I wasn\u0027t executing the burn to extend my orbit out soon enough. I used up a lot of fuel though, more than I should have. When I got to the moon I ran out of fuel just above the surface, crash landed and thought that was it. But the capsule with the kerbals actually stayed in tact and I did some EVAs. I took some screenshots \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EMade it into orbit and plotted my way to the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903253720461951351/C1BC093E68ADAC680B99F1F124A20346F6957822/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003ELeaving Kerbin and heading for the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud.steampowered.com/ugc/903253720461938767/00DFF2116053547A961F70BD1475B5B780C85607/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903253720461967614/6ED58C47575DBFF63C1C7A27198DCBC0DFA05A00/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EComing in to land, note the low fuel. Came down on the dark side of the moon, no real choice because of fuel shortage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud.steampowered.com/ugc/903253720461969441/CBBAD6EFC8460579402C55A53365C0D9E69F2D8D/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Crash) Landing on the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903253720461974592/2086D94620CF2074141AA548E9A1C5EDD2B42356/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe surviving capsule and the EVA\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903253720461981319/014FB95E062B5446FD0C1AAC7F904E662B73294E/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903253720461982703/A09266CD993688A7C74A2151A750958FE0508443/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EI saw that some people have planted flags on the Mun, how do you do that? Also, will the Kerbin astronauts die being stranded there? I guess I could try to mount a rescue mission, but obviously I barely made it to the Mun that time lol.\u003C/p\u003E\u003Cp\u003EI\u0027d like to work on some satellites, probes, and maybe a space station soon.\u003C/p\u003E\u003Cp\u003EThat Mun landing was very intense and scary. I can\u0027t imagine how they were actual able to do this back in 1969, it\u0027s insane.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-11T21:08:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zak233\u0022 data-cite=\u0022zak233\u0022\u003E\u003Cdiv\u003EThat Mun landing was very intense and scary. I can\u0027t imagine how they were actual able to do this back in 1969, it\u0027s insane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup. I\u0027ve landed everywhere, and landings are still that way.\u003C/p\u003E\u003Cp\u003EAs for the original moon landings, even though computers were primitive, they still had a fly by wire system that provides more help than you get from stock KSP. Not to mention the fact that they were actual pilots, had all the math done ahead of time, etc.\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-07-12T04:23:38Z","Content":"\n\u003Cp\u003EHmm. Big stability issue:\u003C/p\u003E\u003Cp\u003EIt looks like the \u0022fins\u0022 you\u0027re using are actually Canards. they LOOK a lot alike, but Canards go in FRONT of the Center of mass, Fins/winglets BEHIND it. Otherwise, they\u0027re moving contrary to what the SAS thinks they\u0027ll do. That\u0027s the source of most of your early wobble.\u003C/p\u003E\u003Cp\u003EPoint Two: use your RCS to get into angle/position, then turn it off and turn on ASAS. Almost never (until .21, at least) should they both be on. Supposedly ASAS won\u0027t overcorrect so badly in .21, fixing much of the wobble and ASAS wasting.\u003C/p\u003E\u003Cp\u003EPoint three: the problem with the canards/fins crops up again when you lose the last big stage (about 7 minutes into the video). It\u0027s more pronounced there because the rocket is so tiny... but you appear to be out of the atmosphere?\u003C/p\u003E\u003Cp\u003E...I\u0027d put those canards on the top of the main stage you just lost, so they go with it. and replace the original ones, on the 4 asparagus tanks, with fins.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-07-12T11:51:56Z","Content":"\n\u003Cp\u003EStart small with probes. Then, as you gain experience, you can switch to Kerbals.\u003C/p\u003E\u003Cp\u003EExample;\u003C/p\u003E\u003Cp\u003EProbe Stage\u003C/p\u003E\u003Cp\u003E1. Stayputnik Mk 2\u003C/p\u003E\u003Cp\u003E2.Advanced SAS\u003C/p\u003E\u003Cp\u003E3. FL-R25 RCS Fuel Tank\u003C/p\u003E\u003Cp\u003E4.RV-105 RCS thruster pack - use 4\u003C/p\u003E\u003Cp\u003E5. Stack coupler TA-18A\u003C/p\u003E\u003Cp\u003E6. add antennas, some fixed solar panels and whatever other scientific instruments you want, but be mindful of symmetry and balance.\u003C/p\u003E\u003Cp\u003ESecond Stage; \u003C/p\u003E\u003Cp\u003E1. T-400 Fuel Tank\u003C/p\u003E\u003Cp\u003E2. T-200 Fuel Tank\u003C/p\u003E\u003Cp\u003E3. LV 909 engine\u003C/p\u003E\u003Cp\u003E4. Stack coupler TA-18A\u003C/p\u003E\u003Cp\u003EFirstd Stage;\u003C/p\u003E\u003Cp\u003E1. Two stacked T-800 fuel tanks\u003C/p\u003E\u003Cp\u003E2. LV-T45 engine\u003C/p\u003E\u003Cp\u003E3. four Delta Deluxe Winglets\u003C/p\u003E\u003Cp\u003E4. Pair of launch stabilizers.\u003C/p\u003E\u003Cp\u003EI have got away using the non steerable LV-30 with slightly more power, but the design is harder to steer into gravity turn on the winglets alone. It wants to go straight up. Also, you don\u0027t use RCS for launch and flight, you use it for maneuvers and landing once the second stage fuel supply is used up. The ASAS will give you plenty of torque for orientation.\u003C/p\u003E\u003Cp\u003EThis design not only will get you in orbit once you get good at doing the Gravity turn, there will be sufficient fuel left in the second stage to reach Mun or Minmus orbit with a possibility of using the thrusters on the probe stage to land the probe on Minmus and maybe Mun\u003C/p\u003E\u003Cp\u003EIf you want to send Kerbals to Mun or Minmus, add a set of 4 RT-10 boosters connected to a set of TT-38K radical decouplers. This is because replacing the probe with another decoupler, the one Kerbal caspule, and parachute adds an additional 1/2 ton to the probe stage of this design. The four boosters alone have sufficient power to lift your rocket to over 5,000 meters before staging them and switching to the LV-45 engine. Don\u0027t land the Kerbals on Mun or Minmus with this design. It will be a one way trip. Build a proper lander or use one of the proven designs for that purpose.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T12:12:05Z\u0022 title=\u002207/12/2013 12:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zak233","CreatedById":73995,"CreatedDateTime":"2013-07-12T15:10:13Z","Content":"\n\u003Cp\u003EVery helpful info. Will give all those a try. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-07-13T03:12:21Z","Content":"\n\u003Cp\u003EConfirmed that the probe stage can be landed on Mun safely with plenty of thruster fuel left. Use the Second Stage to deorbit and slow horizontal speed to zero, then ditch it at about 1000 feet above the actual surface, note, don\u0027t depend on the altimeter. Then, thrusters can be used to guide the probe the rest of the way. Use the surface textures and shadow as you land in high shadow lighting to get a visual on altitude and horizontal speed.\u003C/p\u003E\u003Cp\u003ENote design tweaking. Be sure that the thruster pack is close to the probe center of mass, place near the base of the ASAS, and keep the solar panels above the fuel tank. I lost several on landing. For this second attempt, crashed the first as I had no idea where the surface was and came down too fast, I had over 75% thruster fuel left.\u003C/p\u003E\u003Cp\u003ETurn Sticky Keys off or Windows will ruin the landing with one of its stupid alerts as thrusters are not throttled.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-07-15T20:29:52Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}