{"TopicId":36728,"ForumId":16,"TopicTitle":"making connections in orbit other than using docking collar?????","CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-11T21:08:40Z","PageNum":1,"Articles":[{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-11T21:08:40Z","Content":"\n\u003Cp\u003EIs there any other way to \u0027stick parts together\u0027 in orbit other than by using docking collars? I want to build some larger structures that do not have the wobble that is associated with the docking collars. any help and or suggestions would and will be greatly appreciated.\u003C/p\u003E\u003Cp\u003EDrTedAstro.\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2013-07-11T21:15:41Z","Content":"\n\u003Cp\u003ENo. You could use landing legs to \u0022grab\u0022 other objects, but thats very glitchy and won\u0027t stay together if you warp or switch to another vessel.\u003C/p\u003E\u003Cp\u003EThe large docking ports are fairly devoid of wobble, try using those.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-11T21:22:35Z","Content":"\n\u003Cp\u003ESomebody a little while back had a design for \u0022petals\u0022 around their docking ports; basically it involved a quad of structural panels up near the port. The idea was to help two ships align properly for docking. I never heard if it cut down on wobble or not, but I imagine it would.\u003C/p\u003E\u003Cp\u003EOther than that, use senior docking ports or use multiple ports. A lot of folks have gotten good use out of a stack tri-coupler with three ports attached; guarantees the things will align to one another.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-11T21:23:47Z","Content":"\n\u003Cp\u003Egreat ideas, thanks to all.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-11T21:23:51Z","Content":"\n\u003Cp\u003E\u0026gt;If you are ready to use mods, you have two choices. Quantum Struts will make your docking connections a lot more stable. Else, KAS will allow you to connect two crafts through a cable. Else, there is no other way I\u0027m afraid.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-11T21:57:40Z","Content":"\n\u003Cp\u003EAgain, thanks for the responses.\u003C/p\u003E\n"}]}