{"TopicId":37052,"ForumId":39,"TopicTitle":"CONTACT - The First Voyage to Talaoon","CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T18:02:18Z","PageNum":1,"Articles":[{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T18:02:18Z","Content":"\n\u003Cp\u003EThis a fiction about my planet idea, Talaoon. If you\u0027d like to know more about my idea, here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/40218-Shinji-s-Planet-Ideas\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/40218-Shinji-s-Planet-Ideas\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESome things: \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EThis is sarcasm mode.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThis is an action.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EThis is a date.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAlso, there will be at least one image per chapter.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChapter 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EJanuary 1, 2035\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EObservatory Worker 1: I swear! It\u0027s true! I saw another planet!\u003C/p\u003E\u003Cp\u003EObservatory Worker 2: Yeah, right, liar.\u003C/p\u003E\u003Cp\u003EObservatory Worker 1: I\u0027ll even prove it to you through the telescope!\u003C/p\u003E\u003Cp\u003EObservatory Worker 2: \u003Cem\u003ESigh.\u003C/em\u003E \u003Cspan style=\u0022color:#0000FF;\u0022\u003EFine...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jR3v8tV.png\u0022 alt=\u0022jR3v8tV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EObservatory Worker 1: See? Right there! Close to Jool!\u003C/p\u003E\u003Cp\u003EObservatory Worker 2: In the name of Jebediah Kerman...send this image to the space center!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFor the next few weeks after the reveal of the planet, the presses were berserk about this new planet, causing many conspiracy theories, protests to send a spacecraft to the planet, and \u003C/em\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cem\u003Eworst of all\u003C/em\u003E\u003C/span\u003E\u003Cem\u003E, coffee consumption went up by 666%. After about four months of this madness, they sent a probe to the newly-dubbed Talaoon. It orbited the planet for 4 days, and then mysteriously disappeared without a trace. The next day, there were reports of probe wreckage on Minmus. It was later revealed the wreckage was of the probe that went missing after four days of orbiting Talaoon. It was assumed that one of Talaoon\u0027s moons contained a wormhole, and that it got sent into Minmus, destroying it.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAt the space center\u0027s headquarters...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EMay 8, 2035\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Damn it! Billions of kerbits wasted to only have a probe get destroyed by the kraken!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb slams the table hard.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: I swear! It\u0027s not our fault that it happened!\u003C/p\u003E\u003Cp\u003EJeb: \u003Cspan style=\u0022color:#0000FF;\u0022\u003EWell isn\u0027t \u003C/span\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ETHAT\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E fine and dandy!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EKSP CEO: Well, what if we send a manned orbiter to orbit Talaoon and it\u0027s moon system?\u003C/p\u003E\u003Cp\u003EJeb: Sure, why not? After all, it\u0027ll prevent another incident from happening...\u003C/p\u003E\u003Cp\u003EBill: Well then, we need to get this started.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe space center got to work constructing the largest, most powerful and strongest space rocket in history: Orbiter Hope. Day after day, they spent testing, building, changing, re-editing, and programming to create a lander/orbiter capable of reaching Talaoon and still having half of it\u0027s resources. The next day, they sent a prototype to activate a satellite in order to map the gas giant and it\u0027s moons, revealling Minthay, Maxmus, Goliyu and Colossoid. But then it spotted something suspicious...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EJune 6, 2035\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Wait...they said there were five moons, but we\u0027ve only found four...where\u0027s the fifth?\u003C/p\u003E\u003Cp\u003ESpace Center Worker: We\u0027ve found another moon! It\u0027s...it\u0027s...\u003C/p\u003E\u003Cp\u003EJeb: It\u0027s what?\u003C/p\u003E\u003Cp\u003ESpace Center Worker: It\u0027s Eeloo?\u003C/p\u003E\u003Cp\u003EJeb: WHAT THE HELL? WE DIDN\u0027T EVEN \u003Cstrong\u003EKNOW\u003C/strong\u003E THAT EELOO WAS ACTUALLY A MOON?!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb facepalms.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Let me see a screenshot.\u003C/p\u003E\u003Cp\u003ESpace Center Worker: This is an above-angle shot from the satellite.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KfplAi5.png\u0022 alt=\u0022KfplAi5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb: Just...unbelievable...what\u0027s the status on Orbiter Hope?\u003C/p\u003E\u003Cp\u003ESpace Center Worker: Test complete! Returned from Jool orbit via Tylo Gravity Assist with about half of it\u0027s resources left.\u003C/p\u003E\u003Cp\u003EJeb: Perfect! Now we just need some pilots for it. I\u0027ll do it.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBob walks into the control room.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: Hopefully it\u0027s slow, and I\u0027d really want to see it all!\u003C/p\u003E\u003Cp\u003EJeb: Now we just need one more pilot...how about Shinji Kerman?\u003C/p\u003E\u003Cp\u003ESpace Center Worker: That\u0027d be a good idea...if we knew where he was.\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T21:59:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EChapter 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji Kerman is watching the television news, with the usual news as the hype of Orbiter Hope being launched to Talaoon when a third member is obtained.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EReporter: And that concludes it! See you next day, same time, same hour!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji gets up and hears some knocking on the door. He goes to open the door and opens it.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: Jeb?\u003C/p\u003E\u003Cp\u003EJeb: Shinji, we need a third crewmember for the Orbiter, and we thought that you would be the best choice.\u003C/p\u003E\u003Cp\u003EShinji: Okay...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb and Shinji head for the space center, and enter the control room. All the screens on the wall have a camera feed of the orbiter.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: What do you think?\u003C/p\u003E\u003Cp\u003EShinji: Just...wow...I want to get things started!\u003C/p\u003E\u003Cp\u003EJeb: Heh, you\u0027re right. Now plugsuit up, this\u0027ll be a long ride.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ELater...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESC Worker: All three pilots ready for liftoff. Here goes.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003EIgnition! 2.\u003C/p\u003E\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe clamps detach and the rocket goes flying up at a starting speed of 359.8 m/s.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESC Worker: WE HAVE LIFTOFF OF ORBITER HOPE TO TALAOON!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tpHV9v6.png\u0022 alt=\u0022tpHV9v6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWithin 15 minutes, Orbiter Hope has already exited Kerbin\u0027s atmosphere. Within an hour, Orbiter Hope has gotten halfway to it\u0027s destination, having used gravity assists to get further.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E------\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb looks out the porthole, showing a magnificent view of Duna.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Nice view, isn\u0027t it?\u003C/p\u003E\u003Cp\u003EShinji: Yeah...what do you think awaits us at Talaoon?\u003C/p\u003E\u003Cp\u003EJeb: Probably something we\u0027ve never seen before.\u003C/p\u003E\u003Cp\u003EBob: Guys? We\u0027re close to Dres.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb and Shinji get back into their control seats.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Here goes. Gravity assist time!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe ship approaches the celestial body from behind. It then makes a turn to the front and flings it towards Jool.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: We\u0027re closer than we thought we were.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ETalaoon is in view, a bit far behind Jool.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: Here.\u003C/p\u003E\u003Cp\u003EJeb: Goes.\u003C/p\u003E\u003Cp\u003EShinji: Nothing.\u003C/p\u003E\n"},{"CreatedByName":"Rainbowtrout","CreatedById":60253,"CreatedDateTime":"2013-07-16T15:50:51Z","Content":"\n\u003Cp\u003EQuite good. Like the idea of the planet!\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-16T19:38:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rainbowtrout\u0022 data-cite=\u0022Rainbowtrout\u0022\u003E\u003Cdiv\u003EQuite good. Like the idea of the planet!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. Here\u0027s Chapter 3. No pictures, as I am posting this from the computer I don\u0027t do my art on.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChapter 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EJuly 20, 2035\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb looks out the porthole. From there, he can see Pol, Talaoon, Maxmus and Eeloo within sight.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: Let\u0027s try opening the communication channels and see if anyone\u0027s there.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji flicks some switches and the communication pieces activate.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: This is Shinji Kerman. Awaiting response!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENo response for twenty minutes. Then a red targeting laser comes over the command pod...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E???: ...that is not advisable.\u003C/p\u003E\u003Cp\u003EShinji: Huh? What\u0027s going on? Why is the communication channel swapping frequencies?!\u003C/p\u003E\u003Cp\u003ESpace Center: Shin------thi----s----K----space----center. We\u0027------losing----you----what\u0027s-\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWords light up on the communication screen: COMMUNICATION TERMINATED. REASON: DAMAGE TO COMMUNICATION MODULES.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb turns around and looks at the screen.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: What the hell? Who did that?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESuddenly, the error message breaks up and turns into \u0022ALL THESE WORLDS ARE YOURS EXCEPT MAXMUS. ATTEMPT NO LANDING THERE\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: That\u0027s bullcrap! Show yourself, saboteur!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EA probe, armed with a laser cannon and four targeting lasers flies by.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: WHAT THE HELL IS THAT?!\u003C/p\u003E\u003Cp\u003E???: This is Cthulhu Probe 10813-6664. Target identified as Kerbal spacecraft. Scanning pilots...\u003C/p\u003E\u003Cp\u003EShinji: Darn...Bob\u0027s quite a heavy sleeper. Let\u0027s just try NOT to provoke it, otherwise we\u0027ll have to abort the mission, use the HyperEdit warp program, and get back to Kerb-\u003C/p\u003E\u003Cp\u003ECthulhu Probe: Data recorded. Homeplanet is Kerbin.\u003C/p\u003E\u003Cp\u003EShinji: Crap! It knows where our homeworld is!\u003C/p\u003E\u003Cp\u003EJeb: You REALLY shouldn\u0027t have done that, Shinji. You really shouldn\u0027t.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Cthulhu Probe aims it\u0027s targeting lasers at the LV-909 Engines.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: I know what you\u0027re doing. \u003Cspan style=\u0022color:#0000FF;\u0022\u003EHave fun trying to catch us!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji steers the craft towards the Cthulhu Probe and rockets it into the probe. It sends both craft flying.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ECthulhu Probe: Target locked. Summoning reinforcements.\u003C/p\u003E\u003Cp\u003EShinji: JUST USE THE HYPEREDIT PROGRAM BEFORE WE\u0027RE SCREWED!!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji\u0027s panicking wakes Bob up, and Jeb tries to start the program.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: H-huh...what\u0027s going on?\u003C/p\u003E\u003Cp\u003EShinji: Don\u0027t you understand?! We\u0027re being attacked by a probe! And it\u0027s going to kill us all!\u003C/p\u003E\u003Cp\u003ECthulhu Probe: Not so fast.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe probe unleashes an EMP that shuts the ship\u0027s systems down.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: We\u0027re boned.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMore Cthulhu Probes appear and they all aim their targeting lasers at the engines and fuel tanks of Stage 4.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EProbe 10813-6664: Please hold fire until timer is completed.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EProbe 10813 shows a timer. It starts from 10 and begins counting down.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EProbe 13664-7777: Timing is perfect.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe timer reaches zero. They all fire, causing the fuel tanks and engines to explode violently, taking out stages 6-3.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Crap! If they blow up Stage 1, the landing stage, it\u0027s over!\u003C/p\u003E\u003Cp\u003EProbe 10813-6664: Not advisable in the slightest. Capture craft and move to Talaoon.\u003C/p\u003E\u003Cp\u003EJeb: \u003Cspan style=\u0022color:#0000FF;\u0022\u003EGreat.\u003C/span\u003E They\u0027re feeding us to the space kraken.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe probes use pincers to grab the spacecraft, slightly crushing the fuel tanks on stage 2. The probes fly towards Talaoon.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: WE\u0027RE GONNA DIE!!\u003C/p\u003E\u003Cp\u003EShinji: \u003Cspan style=\u0022color:#0000FF;\u0022\u003ENice job breaking it, Jeb.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EJeb: It ain\u0027t my fault we got ourselves fed to the space kraken!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe probes breach the gas giant\u0027s cloud...and it reveals, through the clouds, a planet somewhat similar to Kerbin.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb, Shinji and Bob: WHAT THE?!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Space Center manages to contact them.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESpace Center: Orbiter Hope, this is Kerbal Space Center. What\u0027s going on?\u003C/p\u003E\u003Cp\u003EJeb: Looks like we just got captured by some probes.\u003C/p\u003E\u003Cp\u003ESpace Center: We weren\u0027t alone after all...what\u0027s your status?\u003C/p\u003E\u003Cp\u003EProbe 10813-6664: I know you\u0027re contacting your \u0022friends\u0022.\u003C/p\u003E\u003Cp\u003ESpace Center: Uh oh. How much information did you give it?\u003C/p\u003E\u003Cp\u003EShinji: It knows the homeworld.\u003C/p\u003E\u003Cp\u003ESpace Center: \u003Cspan style=\u0022color:#0000FF;\u0022\u003EWell done. Well done.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe probes drop the spacecraft onto a small launchpad.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESpace Center: The other systems are shut down...we\u0027-re losin-----g con-----tac----\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe communication terminates...again.\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T20:20:20Z\u0022 title=\u002207/16/2013 08:20  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by Shinji-The-Kerbonaut\u003C/strong\u003E\n\u003Cbr\u003EAdded chapter. Enjoy.\n\u003C/span\u003E\n"},{"CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-07-17T22:17:07Z","Content":"\n\u003Cp\u003EMOAAAAAAAR\u003C/p\u003E\u003Cp\u003E\u0027Nuff said.\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-18T21:02:12Z","Content":"\n\u003Cp\u003EI won\u0027t bother with imagery, as it\u0027s painstaking to do and pushes back the date.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChapter 4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe launchpad opens up in between and allows the craft to fall down into a large shaft.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji curses.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: BAIL! QUICKLY!!!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBob opens the hatch and jumps, enabling his EVA jetpack and flying up.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Great. Bob freaked out and now there\u0027s just the two of us. Let me try initiating the HyperEdit warp drive now.\u003C/p\u003E\u003Cp\u003EShinji: Systems online! This should buy us time! Teleport to Eeloo!\u003C/p\u003E\u003Cp\u003EJeb: On it!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb starts the program, edits co-ordinates to Eeloo, and activates the warp drive. The ship turns white and disappears, re-appearing in low Eeloo orbit. The inertia carries over.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: At least we can land...\u003C/p\u003E\u003Cp\u003EJeb: Great. Where\u0027s Bob?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMeanwhile...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: Where the heck am I...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe atmosphere is surprisingly breathable, containing a vast amount of oxygen. Bob is exploring near a river\u0027s edge.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: Where did everyone go...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EUnbeknownst to him, a Cthulhu Probe is stalking him.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBob: And why do I have the feeling I\u0027m being watched?\u003C/p\u003E\u003Cp\u003EProbe 13845-832: Because you are.\u003C/p\u003E\u003Cp\u003EBob: Crap.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBack on Eeloo, Jeb and Shinji have landed on the surface.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: I\u0027ll go explore. Let\u0027s hope none of those Cthulhu Probes are out there.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji suits up.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Just so you know, we have a 10-minute delay of comms. They\u0027re probably not going to send help until the situation becomes critical.\u003C/p\u003E\u003Cp\u003EShinji: How critical?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EA massive explosion erupts close to them.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: THAT CRITICAL!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe craft goes flying.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EShinji: Screw this, I\u0027m outta here!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EShinji bails.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe craft slides towards a fissure and stops.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: That was too close for comfort. What happened out there, anyway?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMeanwhile, somewhere in high Eeloo orbit...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EProbe 10813-6664: Particle cannon has damaged Eeloo surface. Condition of target unknown.\u003C/p\u003E\u003Cp\u003EProbe 12345-6789: Fire again. Target locked and identified as Shinji Kerman. Avoid murder of subject and instead capture him.\u003C/p\u003E\u003Cp\u003EProbe 10813-6664: Do you remember the manual of the Kraken-Class Battleships? The particle beam cannon takes four minutes to recharge. Still, keep the lock-on on the subject.\u003C/p\u003E\u003Cp\u003EProbe 12345-6789: Affirmative. Soon, we shall conquer Kerbin and become supreme rulers of the Kerbol System. Then we\u0027ll go for Sol and annihilate mankind.\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-10-12T02:50:47Z","Content":"\n\u003Cp\u003EI realized I haven\u0027t updated this in quite a while. Hopefully I\u0027ll make Chapter 5...one day.\u003C/p\u003E\u003Cp\u003EWhat I plan to do is to cause as much mayhem as possible. Mayhem = Well...\u003C/p\u003E\u003Cp\u003E-Stuff blowing up\u003C/p\u003E\u003Cp\u003E-Someone dies\u003C/p\u003E\u003Cp\u003E-Cthulhu probes nuke a moon to pieces\u003C/p\u003E\u003Cp\u003E-Purpose of probes and Talaoon is figured out\u003C/p\u003E\u003Cp\u003E-Many more things.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-12T03:05:10Z\u0022 title=\u002210/12/2013 03:05  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 12, 2013\u003C/time\u003E by Shinji-The-Kerbonaut\u003C/strong\u003E\n\u003C/span\u003E\n"}]}