{"TopicId":37095,"ForumId":16,"TopicTitle":"How to make an SSTO that puts 40t in orbit.","CreatedByName":"Ohfive30","CreatedById":74380,"CreatedDateTime":"2013-07-14T23:17:56Z","PageNum":1,"Articles":[{"CreatedByName":"Ohfive30","CreatedById":74380,"CreatedDateTime":"2013-07-14T23:17:56Z","Content":"\n\u003Cp\u003EI just got my first SSTO of my own design into orbit and back again, I was fairly pleased with myself.\u003C/p\u003E\u003Cp\u003ENow, I want to put a decent payload in Orbit, preferably about 40 tons (the giant orange fuel tank with a Clamp-o-tron Sr. at each end) which has got to be able to dock with my space station\u003C/p\u003E\u003Cp\u003EHas anyone got tips and advice?\u003C/p\u003E\u003Cp\u003EI\u0027ve seen a couple of videos of some massive SSTO spaceplanes on youtube that look very impressive, but I believe are from older versions of KSP, has or is anyone doing this in the current version?\u003C/p\u003E\u003Cp\u003EI\u0027m trying to avoid using too many addons, although I do have mechjeb, kethane, mapsat and Kerbal Attachment system.\u003C/p\u003E\n"},{"CreatedByName":"Teirusu","CreatedById":65301,"CreatedDateTime":"2013-07-15T02:51:04Z","Content":"\n\u003Cp\u003EWhile space planes can have a rather bigger payload fraction then rockets when built right, you\u0027ll still looking at around (Or more) 120 tons for the whole thing. That\u0027s a massive plane to be building, and balancing, with a rather high part-count. So, those massive SSTOs you see on youtube are really still \u0027it\u0027 as far as stock parts go.\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking to try more mods, then the first things I\u0027d recommend are the B9 aero-space parts and the procedural wing plug-in.\u003C/p\u003E\n"},{"CreatedByName":"Ohfive30","CreatedById":74380,"CreatedDateTime":"2013-07-15T02:57:55Z","Content":"\n\u003Cp\u003EThanks, I\u0027ll have a look at those two plugins, I think I\u0027ll try and start with a small payload first, maybe a little satellite.\u003C/p\u003E\n"}]}