{"TopicId":37225,"ForumId":39,"TopicTitle":"\u0026quot;Landing\u0026quot; - KSP Animation Progress Thread","CreatedByName":"outflowphil","CreatedById":74494,"CreatedDateTime":"2013-07-15T20:28:28Z","PageNum":1,"Articles":[{"CreatedByName":"outflowphil","CreatedById":74494,"CreatedDateTime":"2013-07-15T20:28:28Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EBackstory\u003C/strong\u003E: \u003Cem\u003EAfter a year and a half of playing around in Cinema 4D and getting the hang of modeling, lighting, camera work, and character rigging/animation, I\u0027ve dedicated the rest of my summer to working on a Kerbal Space Program animation. What better place to share the grueling process but on the KSP forums? Consider this thread a progress thread where everything that can and will be shared about this project. Those with 3D modeling experience feel free to chime in and give any advice you can.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cem\u003EStep 1: Modeling the Rocket\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe first step I decided to take on was modeling the rocket/lander that was going to be used in the video. While I wanted to design my own awesome lander, I figured that it would be better to take the lander right from the game (with slight modifications). Since I wanted to make this video fit the trailer/advertisement theme I figured having a vehicle that\u0027s modeled off of one people can fly in-game would be a nice touch. \u003Ca href=\u0022http://i.imgur.com/RYLzp9I.png\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E the lander I will be using for those who haven\u0027t explored the stock craft included in the game.\u003C/p\u003E\u003Cp\u003EJust as a side note, I do not know what Squad\u0027s policy on taking 3D models right from the game and using them in animation and I could not find any concrete statement that said yes so I will be recreating all these parts from scratch (with some creative license taken) so I don\u0027t violate any of their IP. \u003C/p\u003E\u003Cp\u003EStep one was modeling the Mk. 2 Lander Can, which is possibly one of the most complex parts of this whole lander, either way here\u0027s what I settled on. It\u0027s not perfect and there are things that I would change but otherwise, for the purposes of this video it will do. [\u003Cstrong\u003ENote: TEXTURES WILL COME LATER\u003C/strong\u003E]\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kHSKcL6.png\u0022 alt=\u0022kHSKcL6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have a few more parts finished but a bit of work needs to be done before they are 100% ready. Texturing is going to happen as soon as all the parts are done being modeled. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003EMore to this post coming soon!\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"POTKC","CreatedById":57600,"CreatedDateTime":"2013-07-16T11:46:45Z","Content":"\n\u003Cp\u003EI have bookmarked this thread and am looking forward to the end result, old luck sir!\u003C/p\u003E\n"},{"CreatedByName":"Bluer22","CreatedById":162686,"CreatedDateTime":"2018-03-30T20:18:55Z","Content":"\n\u003Cp\u003E\nHey, this looks awesome! Have you done any progress since then? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ItCameFromDuna","CreatedById":177164,"CreatedDateTime":"2018-03-31T23:14:08Z","Content":"\n\u003Cp\u003E\nIn case you don\u0027t want to have to go through all the work modeling the parts, here\u0027s a .mu importer for Blender. I don\u0027t know what sort of IP this would or wouldn\u0027t violate, but, since Blender is free, you could just use it as an import program.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5889138699\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/40056-12-14-blender-mu-importexport-addon/\u0026amp;\u0026amp;do=embed\u0022 style=\u0022height:212px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2018-04-06T20:02:42Z","Content":"\n\u003Cp\u003E\nSadly the last time he visted the site was October, 2014. So im guessing we will never see the finished product\n\u003C/p\u003E\n"}]}