{"TopicId":37326,"ForumId":20,"TopicTitle":"Mech Jeb","CreatedByName":"PhatZilla","CreatedById":42369,"CreatedDateTime":"2013-07-16T17:38:16Z","PageNum":1,"Articles":[{"CreatedByName":"PhatZilla","CreatedById":42369,"CreatedDateTime":"2013-07-16T17:38:16Z","Content":"\n\u003Cp\u003EAm I the only one not using the newest MJ? I tried it and found it overly compliciated. I used it for probably three launches before reverting back to the previous version. Admittedly I do use it to launch and achieve orbit, though I CAN do it by hand. I also use the smart ASS features for aiming at nodes etc and I use it to circularize orbits after an encounter. Any features outside of that, I don\u0027t mess with personally. What\u0027s everyone\u0027s take on this?\u003C/p\u003E\n"},{"CreatedByName":"killer420","CreatedById":36177,"CreatedDateTime":"2013-07-16T17:41:58Z","Content":"\n\u003Cp\u003EI love the new one. The custom window editor is great as well as the auto docking. It just takes all the tediousness out of it but also teaches you how to do it. Id give it another shot if I were you.\u003C/p\u003E\n"},{"CreatedByName":"Coneshot","CreatedById":69785,"CreatedDateTime":"2013-07-16T17:44:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI love the new one. The custom window editor is great as well as the auto docking. It just takes all the tediousness out of it but also teaches you how to do it. Id give it another shot if I were you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I think the Rover Autopilot is the only feature I don\u0027t use.\u003C/p\u003E\n"},{"CreatedByName":"AfailingHORSE","CreatedById":57657,"CreatedDateTime":"2013-07-16T17:45:50Z","Content":"\n\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003EAs for the the new one, the info panels are great, I stay away from the translatron though (just cant make it work for me). I mainly use the Ascent Guidance for repetitive launches but the first launch of a design I take a personal responsibility to launch by hand (sort of like back in the Roman Empire where the architect stood under the arch as the keystone was put in and the scaffolding was removed), and I can not be bothered to dock by hand, though I can do it if I need too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T20:09:35Z\u0022 title=\u002207/16/2013 08:09  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlteranEmpire","CreatedById":34035,"CreatedDateTime":"2013-07-16T17:46:56Z","Content":"\n\u003Cp\u003EAll I use mechjeb for is holding course for planes when I get bored of constant course corrections, and more importantly the information displays. Love \u0027em.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-07-16T17:47:02Z","Content":"\n\u003Cp\u003EI wouldn\u0027t ever consider going back to the older version. MJ2 has a wealth of informational features all in one plugin, and that\u0027s valuable to me.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-16T17:49:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PhatZilla\u0022 data-cite=\u0022PhatZilla\u0022\u003E\u003Cdiv\u003EAm I the only one not using the newest MJ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. I don\u0027t use MechJeb at all.\u003C/p\u003E\n"},{"CreatedByName":"Leveller","CreatedById":70427,"CreatedDateTime":"2013-07-16T17:50:08Z","Content":"\n\u003Cp\u003EActually, mechjeb and some Scott Manley tutorials teached me how to play this game. Althou i just mostly use it for stuff i already know how to do, and now when im a little more comfortable with the game, focus on learning new stuff by hand myself. I mostly use it for launches and other tedious stuff. But learning all new things by hand. I.e now im working on rendevous. Looking how mechjeb does it, Quickload, and try myself over and over untill i get it.\u003C/p\u003E\n"},{"CreatedByName":"killer420","CreatedById":36177,"CreatedDateTime":"2013-07-16T17:52:04Z","Content":"\n\u003Cp\u003EWe know you don\u0027t use mechjeb regex lol.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-16T17:52:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DChurchill\u0022 data-cite=\u0022DChurchill\u0022\u003E\u003Cdiv\u003ENevermind. I was gonna be snarky, but nevermind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s an idea: try being snarky.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-16T18:09:12Z","Content":"\n\u003Cp\u003EOne thing I find is it tends to be too obsessed with precision. I\u0027d rather be a few mm/s of the target speed than have it drain the batteries on my solar powered rover.\u003C/p\u003E\u003Cp\u003EI love the new landing guidance though. I wish that panel was the one that kept its functions on.\u003C/p\u003E\u003Cp\u003EIt\u0027s very useful for landing things manually, but accurately. \u003C/p\u003E\u003Cp\u003EThe new ascent guidance, which often seems of but still auto-stages, etc, is many accidents waiting to happen.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-16T18:15:16Z","Content":"\n\u003Cp\u003ENo, your not the only one. Maybe I\u0027ve not given the new one enough time but initially I\u0027m not a fan off it. Yes the window editor is great but there are somethings that just don\u0027t work for me.\u003C/p\u003E\u003Cp\u003EI never use the auto pilot features, but I make heavy use of the smartASS and particularly the SURF function. One of the things I liked about the previous implementation was being able to work with MJ. So I\u0027d set a heading and a pitch in SURF and then I could use Q and E to make slight manual adjustments to roll. That doesn\u0027t work anymore you need to enter a specific roll value. So I tried that and a rocket that used to go up straight and true while doing a roll now deviated a whole load from its course. It seems that while straight up changing the heading achieved the roll I wanted, but once pitched over a little I needed to quickly reset the heading and then set the roll. I\u0027m prob just not using it right and have some re-learning to do.\u003C/p\u003E\u003Cp\u003EThis may seem overly picky, but now to go from SURF to say Prograde or TGT\u002B now requires an extra click, I prefered the tall slim layout of the old SmartASS which showed all actions at once. Just seems less elegant (in terms of use-flow, not appearance, I\u0027m not really fussed about appearance, its a rocket not a sports car).\u003C/p\u003E\u003Cp\u003EI used to use the landing autopilot as a way of picking out a location on the map. Ie I\u0027d read co-ordinates from the kethane detector and then mouse over the map in \u0022select target on map mode\u0022 to find those co-ordinates. But now if I accidentally click on the map while doing that it plants a massive marker and I\u0027m yet to figure out how to tell that marker to go away. Anyone know how to dismiss it?\u003C/p\u003E\u003Cp\u003EAlso can\u0027t have windows partly off the screen anymore. There are some windows that are too wide, like rendezvous info window that I always pushed slightly off the screen so it just showed me what I needed. MechJeb says no now and tbh that just seems a little too bossy for my tastes. \u003C/p\u003E\u003Cp\u003EBut as I\u0027ve said, I\u0027 prob just need to re-adjust and re-learn. The ability to define custom windows and change what is shown in them is very cool and that might get round a lot of my woes with it. I will give it another test drive but for now I\u0027m sticking with good ol\u0027 1.9.5.\u003C/p\u003E\n"},{"CreatedByName":"sierra_seven_","CreatedById":72072,"CreatedDateTime":"2013-07-16T18:37:46Z","Content":"\n\u003Cp\u003EMechJeb 1 did everything I wanted. I use 2.0 now because I want the mod to stay up to date, but I don\u0027t really use anything more than Smart A.S.S and sometimes the launch countdown timer to rendezvous with something in orbit. I have no need for all these new-fangled autopilots and RCS balancers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-16T18:39:28Z","Content":"\n\u003Cp\u003EQuestion for the MechJeb users:\u003C/p\u003E\u003Cp\u003EI recall reading that MechJeb had a manual maneuver node entry system. Does this system show the ejection angle of the maneuver node in relation to the orbited body?\u003C/p\u003E\u003Cp\u003EThere are a few mods out there that can show me my current ejection angle but I want one that shows future ejection angle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T18:47:29Z\u0022 title=\u002207/16/2013 06:47  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IllicitMedic","CreatedById":66677,"CreatedDateTime":"2013-07-16T18:45:18Z","Content":"\n\u003Cp\u003EI love MechJeb personally. Use it for every launch and I love the maneuver planner, beats having to sit there and try to fine tune a node.\u003C/p\u003E\u003Cp\u003EEDIT: Smooth throttle and orbit info...love that too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T18:51:39Z\u0022 title=\u002207/16/2013 06:51  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by IllicitMedic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AfailingHORSE","CreatedById":57657,"CreatedDateTime":"2013-07-16T19:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EQuestion for the MechJeb users:\u003Cp\u003EI recall reading that MechJeb had a manual maneuver node entry system. Does this system show the ejection angle of the maneuver node in relation to the orbited body?\u003C/p\u003E\u003Cp\u003EThere are a few mods out there that can show me my current ejection angle but I want one that shows future ejection angle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI could have miss read your question very easily, but I believe the answer is no at this time\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-16T19:20:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AfailingHORSE\u0022 data-cite=\u0022AfailingHORSE\u0022\u003E\u003Cdiv\u003EI could have miss read your question very easily, but I believe the answer is no at this time\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlright, thanks.\u003C/p\u003E\n"},{"CreatedByName":"SleepyWacKo","CreatedById":72826,"CreatedDateTime":"2013-07-16T19:22:04Z","Content":"\n\u003Cp\u003Ei love the new mechjeb personally, i use it for roleplaying purposes. Until Squad introduces their Autopilot system that uses kerbal skills to do crew tasks than at this time mechjeb is the only way to simulate that.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-16T19:27:34Z","Content":"\n\u003Cp\u003EThe new one adds a bunch of additional stuff from the old one, it\u0027s really worth it. It\u0027s an improvement from the first one without a doubt.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Rogue Ace","CreatedById":68632,"CreatedDateTime":"2013-07-16T19:30:56Z","Content":"\n\u003Cp\u003EI suffer from texture errors because of a lack of a nice enough graphics card, so Mechjeb makes things easier for me.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-07-16T20:06:22Z","Content":"\n\u003Cp\u003EThread locked temporarily. Also moved to general Add-on affairs.\u003C/p\u003E\u003Cp\u003EThread unlocked. I would like to request that people do not derail threads, but report posts that don\u0027t belong instead.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T20:12:56Z\u0022 title=\u002207/16/2013 08:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"}]}