{"TopicId":37352,"ForumId":21,"TopicTitle":"All craft from my Constellation mission vid","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-16T20:37:13Z","PageNum":3,"Articles":[{"CreatedByName":"NeoLegends","CreatedById":66258,"CreatedDateTime":"2013-07-28T09:47:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Immashift\u0022 data-cite=\u0022Immashift\u0022\u003E\u003Cdiv\u003E@Neolegends - That\u0027s pretty damn decent. I was a fan of the way Katateochi clipped his VTOL engines into one of the tanks to hide them really well, yours sort of stick out a bit more obviously.\u003Cp\u003EIn my own testing I can suggest the LF-A30 engines from I believe KW Rocketry. Actually it might be from NovaPunch. In any case it has 285 thrust with a 375/380 ISP in air/vacuum, which is insanely good for the pile of power the engine provides. 4 of those, 2 on each end of a VTOL craft can lift almost anything. Lot better than the 120 thrust 290 ISP crappy radial stock engines you\u0027ve got there.\u003C/p\u003E\u003Cp\u003EI REALLY love the way you used tricouplers. I think I\u0027m gonna have to play with them a bit more in my designs. I know that Katateochi used NovaPunch adapter plates, which are the same thing, except much more compact. The stock couplers look really good though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor landing on Duna, those engines are enough as the TWR already is somewhere around 6. They only burn for something like 15s, but that\u0027s enough to slow you down enough to prevent the parachutes from getting ripped off. I actually only used half of the fuel available in those little newly added (0.21) tanks. Other than that, I\u0027m not a fan (I actually am, but it kinda annoys me) of such big mod packs that add ALOT of parts to the game as most parts just double over time (like there\u0027s multiple engines which all have similar ISP, thrust and weight) and mess up the known part layout you got used to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E (I do have NovaPunch installed, but I\u0027m kinda unsure about B9 Aerospace and KW Rocketry)\u003C/p\u003E\u003Cp\u003EI really gotta make a website at some point that allows you to customize your part packs using checkboxes and custom .zip generation. If anyone could point me to a free ASP.NET hoster, please. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor the ship design, I actually used quadcouplers, you just can\u0027t see it in the screenshots. My biggest problem with getting the whole package as tight and compact as possible was that you can\u0027t bend the hinges from DR in the editor. If I could, would\u0027ve gotten the rover into a much better position than it is now. I\u0027m still amazed at how kateochi got his ship so tightly packaged. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2013-07-28T14:24:43Z","Content":"\n\u003Cp\u003EAh. I see what you mean. I only usually see thrust to weight to ISP ratios when I look at an engine, just as I only see mass to fuel storage when looking at tanks. Practicality or looks generally take a back seat to efficiency with me. Something I need to work on changing.\u003C/p\u003E\u003Cp\u003EI use far, far too many mods. With kw, np, and b9 installed (along with many others) I have something like 8-10 pages of parts on each tab. It gets a little silly. But I love all the parts, though I don\u0027t find myself using np very much.\u003C/p\u003E\u003Cp\u003ERecently I put together a grand tour ship combining most of the mods I have installed, and I realized when it made its first hop to the mun how bad the lag had gotten. I think the biggest problem is when you run tons of plugins, especially Mechjeb. I get these huge lag spikes in game that sort of drop frames for half a second every 10 seconds or so. I\u0027m also running this on a good quad core with a GTX 690 so I doubt it\u0027s my computer as much as congesting the game engine with piles of stuff.\u003C/p\u003E\u003Cp\u003ESo I decided tonight to start over, and rebuild my grand tour ship with as few parts and mods as possible. I\u0027m still using Kethane, cause I love the logistics of it, and it saves time. Also using the procedural fairings mod, and then KAS and TAC fuel balancer and that\u0027s it. \u003C/p\u003E\u003Cp\u003EI think it\u0027ll be fun for once flying a serious mission without Mechjeb or any other assistance using 95% stock parts. Interestingly, stock designs very often have a way of looking more elegant than mod heavy ones.\u003C/p\u003E\u003Cp\u003EMost of my interplanetary stuff is all Swiss Army knife type craft that I throw attachments on for specific things, or rather, carry everything I could possibly need out there, and then decide what I wanna do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway my whole point is less mods is probably better overall. I\u0027m really on the fence about the b9 cockpit though - the one with the offset node and the cab with all the windows. I absolutely love using it - especially IVA docking with it, but it\u0027s part of the massive pack, and looks out of place on stock craft \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also a fan of how he packed his craft so tightly together. Guess that\u0027s what happens when you design a ship for one specific mission rather than cobble it together out of an existing design. Even his grand tour vessel was tightly packed.\u003C/p\u003E\u003Cp\u003E@Katateochi - if you have something like raw footage of the VAB design stages of your crafts, I\u0027d love to see stuff like that. Great for ideas and I\u0027d be interested in knowing exactly how long you spent designing and building that whole mission. I know you stated that the one landing you did took you a week to master (which was damn impressive by the way... Must have been painful at 10 FPS). The design of that setup must have taken at least close to that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T14:52:29Z\u0022 title=\u002207/28/2013 02:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by Immashift\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeoLegends","CreatedById":66258,"CreatedDateTime":"2013-07-28T15:22:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Immashift\u0022 data-cite=\u0022Immashift\u0022\u003E\u003Cdiv\u003EI use far, far too many mods. With kw, np, and b9 installed (along with many others) I have something like 8-10 pages of parts on each tab. It gets a little silly. But I love all the parts, though I don\u0027t find myself using np very much.\u003Cp\u003ERecently I put together a grand tour ship combining most of the mods I have installed, and I realized when it made its first hop to the mun how bad the lag had gotten. I think the biggest problem is when you run tons of plugins, especially Mechjeb. I get these huge lag spikes in game that sort of drop frames for half a second every 10 seconds or so. I\u0027m also running this on a good quad core with a GTX 690 so I doubt it\u0027s my computer as much as congesting the game engine with piles of stuff.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is exactly what annoys me, having to click through tons of part pages and finding the exact right part out of houndreds.\u003C/p\u003E\u003Cp\u003E(I\u0027m assuming you have little to no knowledge in programming, I apologize if I\u0027m wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003EThose laggs are a common problem in KSP, it\u0027s not because of the mods, it\u0027s because how KSP and Unity process the physics: It\u0027s not threaded / computed parallely but processed part by part, one by one. That is what makes KSP lagg when you go over ~150 parts. (KSP will be \u0022blocked\u0022 until the calculations are done, that\u0027s what you experience as laggs)\u003C/p\u003E\u003Cp\u003EParallelizing the calculations would remove the laggs, but that won\u0027t be possible in the near future as it\u0027s not safe to use Unity\u0027s API in parallel, so the devs would have to write LOTS of code to bypass the problems. This is a common topic over in the Unity developers community. Sadly, the Unity devs are relatively silent about that topic. :/\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EI redid my cargo flight:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe vehicle standing by for launch on the KSC:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://neolegends.tk/wordpress/wp-content/uploads/2013/07/KSP-2013-07-28-15-32-41-89.png\u0022 alt=\u0022KSP-2013-07-28-15-32-41-89.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBurning my way to Duna:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://neolegends.tk/wordpress/wp-content/uploads/2013/07/KSP-2013-07-28-15-49-37-39.png\u0022 alt=\u0022KSP-2013-07-28-15-49-37-39.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAerobraking in Duna\u0027s athmospehere, burning a little:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://neolegends.tk/wordpress/wp-content/uploads/2013/07/KSP-2013-07-28-16-07-37-14.png\u0022 alt=\u0022KSP-2013-07-28-16-07-37-14.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDunabase management:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/li_pffaHCwQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe finished base:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://neolegends.tk/wordpress/wp-content/uploads/2013/07/KSP-2013-07-28-17-04-31-49.png\u0022 alt=\u0022KSP-2013-07-28-17-04-31-49.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T15:48:48Z\u0022 title=\u002207/28/2013 03:48  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by NeoLegends\u003C/strong\u003E\n\u003Cbr\u003EAdding content\n\u003C/span\u003E\n"},{"CreatedByName":"jrsteensen","CreatedById":3174,"CreatedDateTime":"2013-07-28T21:01:09Z","Content":"\n\u003Cp\u003EAwesome!!!!! Would you mind doing a checklist for each ship/lander?\u003C/p\u003E\n"},{"CreatedByName":"WoWo_Soldier","CreatedById":76139,"CreatedDateTime":"2013-07-28T21:20:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EAre you using the parts from the part bundle I provided? It\u0027s odd that Kopernicus doesn\u0027t work but the others do, they are more complex than Kopernicus.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey\u003C/p\u003E\u003Cp\u003EI know, that\u0027s really odd. I will answer on your questions:\u003C/p\u003E\u003Cp\u003EYes, I use your craft bundle. I downloaded and tested 2 packs (old \u0026amp; new mechjeb edition), from KSP Store I downloaded .20.2 and .21.1. First I unpack clear KSP and on this clear game I copied and overwrite files from bundle (MJ1.9.5). I was very hapy, because can play on this amazing ships from nasa presentation where people in future can get the mars ground. First run game, select orion, set on launch pad -\u0026gt; start -\u0026gt; worked -\u0026gt; next ship. All ship I tested on this algoritm. When I come to kopernicus craft and one big WHAT??? (screen on previous post). I solved problem with kopernicus (works good on bundle with new MJ 2.0.9). But Cargo.craft still does not work. Tomorrow or the next day I\u0027ll record a video where You can see this problem. I can\u0027t edit ship from the game - notepad only.\u003C/p\u003E\u003Cp\u003EMy question:\u003C/p\u003E\u003Cp\u003ECan you check your bundle, because I don\u0027t know what is. My mistakes or mistake in package or system -.-, but if B0bby and Xzabath have no problem ... I\u0027m powerless.\u003C/p\u003E\u003Cp\u003ESummation:\u003C/p\u003E\u003Cp\u003EIn cargo.craft parts are, I see profil of rocket, but can\u0027t add, remove and move parts from the rocket. When I load craft all buttons on top right are disactive. The only way to exit game is alt\u002Bf4 or task manager. I can move camera, zoom, up, down, rotate. In my opinion these parts \u0022wait\u0022 for command pod, but in notepad I see used command pod: part = probeStackSmall. \u003C/p\u003E\u003Cp\u003EPeople please help, Ludzie pomÃƒÂ³Ã…Â¼cie\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-28T22:23:03Z","Content":"\n\u003Cp\u003ESorry for the delay in replying guys (I\u0027ve been crashing SSTOs in 21.1 and not getting very far with them). \u003C/p\u003E\u003Cp\u003EThis is so cool to have you guys taking aspects of my designs and then doing your own variations on it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@NeoLegends;\u003C/p\u003E\u003Cp\u003EThat\u0027s very cool, I like the way you\u0027ve connected the modules to the lander and nice use of the tri couplers, that would make yours have less parts than my design I think (certainly compared to my hab lander!). In the cargo lander I just used girders from a girder pack and they are attached straight down the middle, which actually caused me some issues fitting the modules round it, so I really like the way your girder runs above everything. In the hab lander I used the stock strut parts and small cube thing to make the L-shaped mount that the ascent modules sits on, I think tri or quad adapters might be the way forward for that next time!\u003C/p\u003E\u003Cp\u003EIs your rover\u0027s arm made of RTG\u0027s?! That\u0027s different! I also had to really weight my rover down, initially I just used a couple RCS tanks at the back, but then later I added the two command pods and then it was much more stable. Also I\u0027ve used the large RTG\u0027s which I think where once part of NovaPunch but don\u0027t seem to exist any more, but I\u0027m still using them as legacy parts.\u003C/p\u003E\u003Cp\u003EThanks for the vid of your rover assembly process, very nice to see it being done differently and as effectively. With your way of mounting the modules on the lander, could you pick them up again and re-attach them to the lander for a totally movable system? That would be epic!\u003C/p\u003E\u003Cp\u003E@Immashift;\u003C/p\u003E\u003Cp\u003EThe engine that I used on both main landers and the little ascent lander was the little RMA-3 engine from NovaPunch. It has an ISP of 410 (in vac) and a thrust of 75 and its nice and compact. I think it\u0027s one of my most used the engines for landers, mounted on the stock radial attachment point thing. It\u0027s been changed in the new NovaPunch, same stats just different shape, not sure I like it as much as the previous style.\u003C/p\u003E\u003Cp\u003EAh, so you\u0027re taking the rover back with you, nice, but yeah your going to run foul of the docking doom. oh, wait...I\u0027ve got a rover, little folding thing (see my Apollo vid) that uses DR joints to fold up, and (in another craft) I\u0027ve been re-docking it to a lander and taking off again without issue. I think (not 100% sure) that the problem only happens when there are hinges in between the docking port and the core part of what ever your attaching. So if you had a docking port, or another KAS connector, attached directly the rovers root part or via parts that don\u0027t have hinges between them and the root part then I think it will be ok. My folding rover has a KAS connector a couple parts away from the root part, but without hinges in between and I can winch it up and put it in docked mode without horrific exploding. \u003C/p\u003E\u003Cp\u003EI like your GT ship. Would definitely like to see the pics of that in action, do PM me when you post them and let me know (I\u0027m crap at keeping track of what goes on on the forum!). I\u0027d really recommend just doing pics rather than trying to vid the whole thing. That turned into more of a mission than the mission itself and took up a ridiculous amount of HD space!\u003C/p\u003E\u003Cp\u003EI\u0027m really not sure how my stuff ends up being so tightly packed, it really isn\u0027t a concious design goal that I set out with, if just kinda happens. I don\u0027t have any footage of the actual building or testing, that would be a very long vid!! The whole thing took a very long time, I actually started building the hab lander in 0.19, I was doing other missions then too, but in 0.20 it became the main focus. Building the cargo lander took a lot less time, thou it took prob around a week of mucking about to workout the KAS and docking port setup to get round the DR issues. For a long time I was just using the KAS magnets to connect to the modules but that was not reliable and would often break things. I actually did the whole mission once before the vid that I eventually made and that was before I\u0027d got the KAS\u002Bdocking port setup. That was just so much better and I\u0027d made a few other changes so I scrapped that vid and started the whole mission a second time. And before that I did many many test runs on the Mun and a lot of testing just on the runway.\u003C/p\u003E\u003Cp\u003ESo, you both run with too many mods (I can relate) and want to cut the parts down eh? I might have something that may interest you (and I need testers for it!). \u003C/p\u003E\u003Cp\u003EI\u0027ve written a little program, its just a command line tool for now, but I hope to make a more user friendly interface for it at some point.\u003C/p\u003E\u003Cp\u003EBasically you point it at 1 or more craft files in your KSP save dir and tell it to build a bundle (you can tell it do to other things too). \u003C/p\u003E\u003Cp\u003EIt reads the craft file and looks at all the parts you have installed and complies a zip containing just what is needed for the given craft. that\u0027s what I used to make the zips you can download for these craft.\u003C/p\u003E\u003Cp\u003Efor example;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Emod_bundler.exe r:\\games\\KSP\\saves\\Katateochi\\**\\*Constellation* --bundle --include-craft --include-mod-CrewManifest --include-mod-Romfarer-plugins\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou could tell it to look at all the craft you have and then it would build a zip that was tailor made for your current craft. You can get it to include stock parts or not (default is not to include stock parts) and include additional mods (ie crewmanifest), or just plugins from certain mods, that won\u0027t be reference by the craft files. It can also include the craft if you want.\u003C/p\u003E\u003Cp\u003EIt can also just be used to tell you what mods a craft uses or if a craft is missing parts. It has some limited support for legacy parts and plugins, the parts are not a problem, its the plugins, it can work some out, for example if you use the old mechjeb parts it will realise it needs the mumechlib.dll from Plugins but it can only do that if the name of the parts and plugins share a common word. With the new GameData structure its much easier.\u003C/p\u003E\u003Cp\u003EIts still a WIP, but if you want the current version of it send me a PM and I\u0027ll give you a DL link and tell you how to use it. I\u0027d really like to release it as a tool for the community and I need a few test users for it so that would be great.\u003C/p\u003E\n"},{"CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2013-07-28T22:50:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoLegends\u0022 data-cite=\u0022NeoLegends\u0022\u003E\u003Cdiv\u003EThat is exactly what annoys me, having to click through tons of part pages and finding the exact right part out of houndreds.\u003Cp\u003E(I\u0027m assuming you have little to no knowledge in programming, I apologize if I\u0027m wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003EThose laggs are a common problem in KSP, it\u0027s not because of the mods, it\u0027s because how KSP and Unity process the physics: It\u0027s not threaded / computed parallely but processed part by part, one by one. That is what makes KSP lagg when you go over ~150 parts. (KSP will be \u0022blocked\u0022 until the calculations are done, that\u0027s what you experience as laggs)\u003C/p\u003E\u003Cp\u003EParallelizing the calculations would remove the laggs, but that won\u0027t be possible in the near future as it\u0027s not safe to use Unity\u0027s API in parallel, so the devs would have to write LOTS of code to bypass the problems. This is a common topic over in the Unity developers community. Sadly, the Unity devs are relatively silent about that topic. :/\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m a comp science major but only in my second year. I have no knowledge of the way Unity works no, you got that right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI thought it had to be parts chugging the engine and thus the game waits for part calculations or whatever to do its thing. So when I have 500 parts laying around (not even anything built with them, just loaded into the game) the engine just bogs down to the point where that lag spike every ten seconds lasts nearly a full second, making the game rather unplayable. Running 16 gigs of ram so it can\u0027t be the issue. It\u0027s definitely a processing problem.\u003C/p\u003E\u003Cp\u003EThe basic solution for me would be to get a better processor. I\u0027m runnung a 2.4Ghz Phenom 9750. It\u0027s a great processor, but it\u0027s dated and nowhere near top of the line. Granted if Unity was more optimized my issue would dissolve completely, but until then....\u003C/p\u003E\u003Cp\u003EOne of the issues is it happens in editors too, which I thought was weird, since it\u0027s not calculating phsics... Then again, perhaps background flights and such still chug it. I don\u0027t have enough knowledge to do anything other than theorize, but thanks a lot for narrowing it down for me. I\u0027ve always wondered what caused those spikes, as a stock install plays more or less perfectly for me. Now I know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EANYWAY, my new, mostly stock grand tour design!\u003C/p\u003E\u003Cp\u003EI MAY STILL use the heavily modded install GT design I showed here earlier. I love that design so much, but like I said I\u0027m not sure how much the lag would irritate me, given how I\u0027ll have to dock that lander to it a billion times over the course of the grand tour. I burned out to the mun as a test with the GT rig, and I noticed a couple problems... \u003C/p\u003E\u003Cp\u003EFirst off, the lander\u0027s drills bugged out and wouldn\u0027t mine anything, had to reposition them and ship the new lander over.... Then I realized that the lander can only take about 1k units of fuel back up to the IP stage in addition to what it spends to get back up there, which is really crappy. \u003C/p\u003E\u003Cp\u003EThe TWR of the craft is really low, and without quantum struts on it flips out at 3x physwarp, which is an issue when your burns are 15 min long. The final problem is that the entire craft doesn\u0027t quite carry enough ÃŽâ€v. I realized that problem when my mun injection burn used a quarter of my fuel.\u003C/p\u003E\u003Cp\u003EIt also had a power problem, which I realized trying to do a burn on the dark side of the mun. I had slapped a token RTG somewhere and assumed it was good enough..\u003C/p\u003E\u003Cp\u003EThis is .21.1 baby! Everything nom nom noms through power! God forbid I install IronCross and try a grand tour... death by breathing his own Co2 sounds like a poor way for Jeb to go.\u003C/p\u003E\u003Cp\u003ETylo (and LKO in one stage) capable lander, similar to the one Scott Manley used, cause I really liked how well his worked. One thing you can see with most of my designs, especially my landers, is that I HATE dropping bits of it during ascent. I\u0027d rather bring the entire thing back up so I can leave it in orbit and use it again, rather than drop stages:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/a/img18/5969/1iy.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/medium/18/1iy.png\u0022 alt=\u00221iy.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EInterplanetary stage - I wanted a puller design with enough oomph to get between any two planets. Lander will sit in the back, and there will be four small probes connected to that hub I plan on dropping at various places:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/a/img708/7256/j8ka.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/medium/708/j8ka.png\u0022 alt=\u0022j8ka.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow to refuel the lander and connect it all together and begin my voyage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EALSO, Katateochi - If you want testers for that command line tool feel free to PM me anything you want.\u003C/p\u003E\u003Cp\u003E@NeoLegends - So you\u0027re iffy on the B9 pack hmm? Let me attempt to sell it to you with this cockpit\u0027s IVA \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy docking-fu is a little rusty and out of practice here, but it\u0027s still a pretty view:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=mHaruLzNCY8\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=mHaruLzNCY8\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T00:05:58Z\u0022 title=\u002207/29/2013 12:05  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by Immashift\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-28T23:11:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrsteensen\u0022 data-cite=\u0022jrsteensen\u0022\u003E\u003Cdiv\u003EAwesome!!!!! Would you mind doing a checklist for each ship/lander?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you mean a specific list for each craft separately? There is a full list for all the craft together in the first post and you can download a bundle containing everything you need.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WoWo_Soldier\u0022 data-cite=\u0022WoWo_Soldier\u0022\u003E\u003Cdiv\u003EHey\u003Cp\u003EI know, that\u0027s really odd. I will answer on your questions:\u003C/p\u003E\u003Cp\u003EYes, I use your craft bundle. I downloaded and tested 2 packs (old \u0026amp; new mechjeb edition), from KSP Store I downloaded .20.2 and .21.1. First I unpack clear KSP and on this clear game I copied and overwrite files from bundle (MJ1.9.5). I was very hapy, because can play on this amazing ships from nasa presentation where people in future can get the mars ground. First run game, select orion, set on launch pad -\u0026gt; start -\u0026gt; worked -\u0026gt; next ship. All ship I tested on this algoritm. When I come to kopernicus craft and one big WHAT??? (screen on previous post). I solved problem with kopernicus (works good on bundle with new MJ 2.0.9). But Cargo.craft still does not work. Tomorrow or the next day I\u0027ll record a video where You can see this problem. I can\u0027t edit ship from the game - notepad only.\u003C/p\u003E\u003Cp\u003EMy question:\u003C/p\u003E\u003Cp\u003ECan you check your bundle, because I don\u0027t know what is. My mistakes or mistake in package or system -.-, but if B0bby and Xzabath have no problem ... I\u0027m powerless.\u003C/p\u003E\u003Cp\u003ESummation:\u003C/p\u003E\u003Cp\u003EIn cargo.craft parts are, I see profil of rocket, but can\u0027t add, remove and move parts from the rocket. When I load craft all buttons on top right are disactive. The only way to exit game is alt\u002Bf4 or task manager. I can move camera, zoom, up, down, rotate. In my opinion these parts \u0022wait\u0022 for command pod, but in notepad I see used command pod: part = probeStackSmall. \u003C/p\u003E\u003Cp\u003EPeople please help, Ludzie pomÃƒÂ³Ã…Â¼cie\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wasn\u0027t sure if they\u0027d work in 21.1 and I\u0027ve finally got round to trying it out. Sadly I get the exact same issue you\u0027ve had when loading any of the craft in 21.1, the VAB just freezes and you can\u0027t do anything except hit alt-f4. \u003C/p\u003E\u003Cp\u003EI have also re-tested them all in a completely fresh install of 20.2, and everything worked just fine. I just got a fresh copy of 20.2 and un-packed it, then into it I put the Parts and Plugins folder from my zip and then I opened the GameData file and copied the contents of the GameData folder from the zip. The only thing I did not copy was the Squad folder from the zip, as that only has a couple resource files (it shouldn\u0027t really be in the zip). So everything from the zip except the Squad folder in GameData. Then I started the game, made a new save and once I was in the VAB I then alt-tabbed out and copied the craft into the VAB folder of the newly created save. All the craft worked fine without the VAB freeze that you are getting.\u003C/p\u003E\u003Cp\u003EThe odd thing is, the freeze that I got when trying them in 21.1 looks just like the one you have in that pic you posted from 20.2. The notable thing is that all the icons from the staging list are off to one side slightly and not in staging, like they were disconnected parts. That exact same thing happens in 21.1 for all the craft. What\u0027s odd is that other craft I\u0027ve made in 20.2 work just fine in 21.1 so I\u0027m a bit puzzled.\u003C/p\u003E\u003Cp\u003EI\u0027m going to keep investigating this cos I want these craft working in 21.1 without having to build them from scratch again! I\u0027ll let you know if I find a solution.\u003C/p\u003E\n"},{"CreatedByName":"NeoLegends","CreatedById":66258,"CreatedDateTime":"2013-07-28T23:26:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003E@NeoLegends;\u003Cp\u003EThat\u0027s very cool, I like the way you\u0027ve connected the modules to the lander and nice use of the tri couplers, that would make yours have less parts than my design I think (certainly compared to my hab lander!). In the cargo lander I just used girders from a girder pack and they are attached straight down the middle, which actually caused me some issues fitting the modules round it, so I really like the way your girder runs above everything. In the hab lander I used the stock strut parts and small cube thing to make the L-shaped mount that the ascent modules sits on, I think tri or quad adapters might be the way forward for that next time!\u003C/p\u003E\u003Cp\u003EIs your rover\u0027s arm made of RTG\u0027s?! That\u0027s different! I also had to really weight my rover down, initially I just used a couple RCS tanks at the back, but then later I added the two command pods and then it was much more stable. Also I\u0027ve used the large RTG\u0027s which I think where once part of NovaPunch but don\u0027t seem to exist any more, but I\u0027m still using them as legacy parts.\u003C/p\u003E\u003Cp\u003EThanks for the vid of your rover assembly process, very nice to see it being done differently and as effectively. With your way of mounting the modules on the lander, could you pick them up again and re-attach them to the lander for a totally movable system? That would be epic!\u003C/p\u003E\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003ESo, you both run with too many mods (I can relate) and want to cut the parts down eh? I might have something that may interest you (and I need testers for it!). \u003C/p\u003E\u003Cp\u003EI\u0027ve written a little program, its just a command line tool for now, but I hope to make a more user friendly interface for it at some point.\u003C/p\u003E\u003Cp\u003EBasically you point it at 1 or more craft files in your KSP save dir and tell it to build a bundle (you can tell it do to other things too). \u003C/p\u003E\u003Cp\u003EIt reads the craft file and looks at all the parts you have installed and complies a zip containing just what is needed for the given craft. that\u0027s what I used to make the zips you can download for these craft.\u003C/p\u003E\u003Cp\u003Efor example;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Emod_bundler.exe r:\\games\\KSP\\saves\\Katateochi\\**\\*Constellation* --bundle --include-craft --include-mod-CrewManifest --include-mod-Romfarer-plugins\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou could tell it to look at all the craft you have and then it would build a zip that was tailor made for your current craft. You can get it to include stock parts or not (default is not to include stock parts) and include additional mods (ie crewmanifest), or just plugins from certain mods, that won\u0027t be reference by the craft files. It can also include the craft if you want.\u003C/p\u003E\u003Cp\u003EIt can also just be used to tell you what mods a craft uses or if a craft is missing parts. It has some limited support for legacy parts and plugins, the parts are not a problem, its the plugins, it can work some out, for example if you use the old mechjeb parts it will realise it needs the mumechlib.dll from Plugins but it can only do that if the name of the parts and plugins share a common word. With the new GameData structure its much easier.\u003C/p\u003E\u003Cp\u003EIts still a WIP, but if you want the current version of it send me a PM and I\u0027ll give you a DL link and tell you how to use it. I\u0027d really like to release it as a tool for the community and I need a few test users for it so that would be great.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually had real problems getting my crafts around the girder in the middle, or getting the girder out of the way before 0.21, but those quad-couplers just work wonderful, they bring that U-shape into your craft with only three parts.\u003C/p\u003E\u003Cp\u003EThat reusable design is totally what I\u0027m aiming for, however those engines do not have enough fuel for an actual takeoff, (TWR of 9, but only 15s burning time) so I\u0027d have to mount the modules somewhere else to take them with me. At some point, I\u0027d also consider an entire redesign of the cargo \u0026amp; crew module, probably when I\u0027ll try landing that baby on Laythe. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately, I didn\u0027t add counterweights to my rover. (As you can see two times in the video where it just tips over and \u0022lands\u0022 on the module) I really should\u0027ve tried out my design before I was heading to Duna with it, but I didn\u0027t figure out any way to try out my craft without messing with the launcher part. The arm is not made of RTGs, instead it\u0027s a 1m steel beam with four RTGs attached. Admittedly, your idea of using RTGs is brilliant, it\u0027s gonna save up some parts and reduce the lagg a little (that\u0027s also why I used 1x1 plates to mount the docking ports for the modules on instead of multiple small girders). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ll give it a try as soon as I get my next mission launched.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Immashift\u0022 data-cite=\u0022Immashift\u0022\u003E\u003Cdiv\u003E@NeoLegends - So you\u0027re iffy on the B9 pack hmm? Let me attempt to sell it to you with this cockpit\u0027s IVA \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EMy docking-fu is a little rusty and out of practice here, but it\u0027s still a pretty view:\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I already know that cockpit from Scott Manley\u0027s reusable space program... It\u0027s AWESOME. And I\u0027m not directly iffy on B9 Aerospace, I just don\u0027t like having houndreds of parts in my KSP part list. If I uninstalled NovaPunch2, I\u0027d install B9 for sure.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EI\u0027d really like to take a closer look at your packaging tool. What language is it written in? I think it\u0027d be a really nice idea to put that features onto a website at some point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T09:04:57Z\u0022 title=\u002207/29/2013 09:04  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by NeoLegends\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tupin","CreatedById":27762,"CreatedDateTime":"2013-07-29T04:17:12Z","Content":"\n\u003Cp\u003ENone of these load for me...just freezes my game whenever I load a craft.\u003C/p\u003E\u003Cp\u003EI\u0027m on 21.1.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-07-29T08:48:42Z","Content":"\n\u003Cp\u003EI\u0027ve just watched your Constellation video - this is one of the best KSP missions I\u0027ve seen so far. Amazing designes - kudos for you, sir!\u003C/p\u003E\n"},{"CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2013-07-29T09:20:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EI like your GT ship. Would definitely like to see the pics of that in action, do PM me when you post them and let me know (I\u0027m crap at keeping track of what goes on on the forum!). I\u0027d really recommend just doing pics rather than trying to vid the whole thing. That turned into more of a mission than the mission itself and took up a ridiculous amount of HD space!\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeen taking screenshots all along, and will be making a thread for it eventually once complete, I\u0027ll definitely PM you. My design changed to a more stock-centric one, but the goal is still the same, and I may well take the other one along too. \u003C/p\u003E\u003Cp\u003EFor now, here\u0027s how not to do a Moho injection - through shear brute force I made orbit, probably shoulda paid attention to phase angle a bit more :/ and have around 2k liquid fuel left. Absolutely no idea if it\u0027s enough to land on Moho, but it\u0027s all I got. Took about 1k for the mun landing I think. We\u0027ll see soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://img543.imageshack.us/img543/1042/2isw.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/medium/543/2isw.png\u0022 alt=\u00222isw.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think getting a Moho injection is somewhat like trying to find a place to park at the shopping mall while driving past it at mach 2.\u003C/p\u003E\u003Cp\u003EEDIT: SUCCESS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E 100ish units of fuel left.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T09:39:50Z\u0022 title=\u002207/29/2013 09:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by Immashift\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-07-29T09:38:22Z","Content":"\n\u003Cp\u003EWatched your video and read the thread, DANG I\u0027m impressed! Wish I had that kind of imagination!\u003C/p\u003E\u003Cp\u003ERunning 21.1 and downloaded your \u0022zip\u0022 file (for latest MechJeb) which includes everything needed and ran into an issue or two.\u003C/p\u003E\u003Cp\u003E1. ALL of the \u0022parts\u0022 in the \u0022PARTS\u0022 directory needed to have the \u0022PARTS {}\u0022 edited onto the config files. (or at least I did so since they did not have it)\u003C/p\u003E\u003Cp\u003E2. I CANNOT get the \u0022DSL_Head\u0022 to show up in my parts listing! Even after adding the step above, still does not show up. \u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cstrong\u003E(RESOLVED)\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E3. Successfully loaded all craft with the exception of the cargo ship \u003Cspan style=\u0022color:#e6e6fa;\u0022\u003Ebecause it requires the DSL_Head. (Part IS in my \u0022parts\u0022 directory, just not loading into KSP)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHave not tested the plugins yet, although they do not appear to be causing an issue. Concern was that the supplied plugins were not \u002221.1\u0022 compatible, but I have not witnessed that yet. Since I was already running several of the latest used plugins, I only installed the ones I was missing. I\u0027m thinking that some of the posts (above) may be compatibility issues. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003EUPDATE:\u003C/span\u003E\u003C/strong\u003E I did follow through and discovered that since I was trying to avoid a conflict issue with potential incorrect plugins, (concerned that the zip file had \u0022older\u0022 versions not compatible with 21.1) I did not install the Romfarer dll and that was keeping the \u0022DSL_Head\u0022 part from being loaded. The DSL_Head issue is resolved.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003EBUT\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003ENow what I\u0027m dealing with \u003C/span\u003E\u003C/strong\u003Eis (again) all .craft files are loading now with the exception of the Cargo ship! What happens is the screen \u0022freezes\u0022. I have a moveable mouse, but unable to click on anything, including exit, parts, ... The stack on the right side does not look correct either. So something still isn\u0027t correct. NO parts issues, (or rather it loads the ship and gives no part issue preventing it from loading), but after that, nothing. ANY help would be appreciated!\u003C/p\u003E\u003Cp\u003EAnd this is the ship I was hoping to play with! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EAgain, cant\u0027 thank you enough for sharing this with us! \u003C/p\u003E\u003Cp\u003ETBryson2\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T11:25:48Z\u0022 title=\u002207/29/2013 11:25  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by TBryson2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WoWo_Soldier","CreatedById":76139,"CreatedDateTime":"2013-07-29T11:50:39Z","Content":"\n\u003Cp\u003EHey, hey, hey\u003C/p\u003E\u003Cp\u003ENow, for me cargo works perfectly for .20.2 -\u0026gt; solved. I always copied craft to %gamedir%ships/vab. When I copied craft (cargo) to %gamedir%saves/%profile%/ships..... (my stupid mistake)\u003C/p\u003E\u003Cp\u003Ebegan to work. And now:\u003C/p\u003E\u003Cp\u003EWoWo propably find problem for incompatible for .21.\u003C/p\u003E\u003Cp\u003E1. to correct work we need Mech Jeb 2.0.9 -\u0026gt; 2.0.8 is incompatible\u003C/p\u003E\u003Cp\u003E2. Cargo doesn\u0027t load properly because use incompatible version of Kethane for .21. Only Cargo.craft have inside parts from this mod. When I deleted (in .20.2) kethane parts -\u0026gt; saved -\u0026gt; and copied to .21 ship began work.\u003C/p\u003E\u003Cp\u003E#katateochi if you can update the bundle (mods and crafts) for .21 I will be very happy, because IMO .21 looks better than .20 and have upgraded ASAS.\u003C/p\u003E\u003Cp\u003Etip -\u0026gt; in .20 remove kethane parts save and only in .21 add back this parts because:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kethane\u0022 data-cite=\u0022Kethane\u0022\u003E\u003Cdiv\u003EWarning: This is a CRAFT-BREAKING RELEASE. Crafts and save files with Kethane parts from previous versions are unlikely to work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-1-3-Find-it-mine-it-burn-it!-%28project-has-a-new-home%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-1-3-Find-it-mine-it-burn-it!-%28project-has-a-new-home%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe modpack will work I plan to add Constellation Lunar Lander (replica from nasa video) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is 100% Kethane error\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-29T16:03:52Z","Content":"\n\u003Cp\u003E@WoWo ah, glad you got it working in 20.2! \u003C/p\u003E\u003Cp\u003E@everyone\u003C/p\u003E\u003Cp\u003EI\u0027m currently updating the craft to work in 21.1 and with updated mods (including the kethane one). Basically most parts worked fine with updated mods, just kethane had to go and be different, so I did a find and replace for part names in the craft file and now the cargo loads up just fine. \u003C/p\u003E\u003Cp\u003EIt\u0027s not as stable as it should be thou. The module wobbles around like a crazy thing during launch, so I\u0027m doing a bit of open-craft strut surgery on them. Of Course I\u0027m supposed to be at work right now, but...the rockets, they keep calling me. \u003C/p\u003E\u003Cp\u003ESo hopefully I should have a 21.1 compatible version for you all to DL by this evening.\u003C/p\u003E\u003Cp\u003EJust out of curiosity I used the previous version of kethane in 21.1 and all kinda of things went weird, it wouldn\u0027t let me attach the drill to anything (just on a simple test craft) and then suddenly everything just slowed right down, even the sounds of selecting parts went weird. I think it was the kethane mod that caused odd issues when using my 20.2 part bundle in 21.1. So that should soon be fixed.\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2013-07-29T18:41:29Z","Content":"\n\u003Cp\u003ECan all this be done with little to no actual in-game flight skill using MJ2, or should I start practicing in stock?\u003C/p\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-07-29T19:36:46Z","Content":"\n\u003Cp\u003EWell, it\u0027s definitely the Kethane mod killing me! I loaded the latest (0.7.4) and anytime I try to load ANY ship it crashes to the desktop now. \u003C/p\u003E\u003Cp\u003EI spent the time to update the TAC Fuel manager, Protractor, KAS, and the latest Kethane MOD. Hopefully someone will find an answer. I\u0027ll keep digging.\u003C/p\u003E\u003Cp\u003ETBryson2\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T19:42:38Z\u0022 title=\u002207/29/2013 07:42  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by TBryson2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-29T20:32:00Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/9436261/ConstellationCraft/Constellation_craft%2821.1compatible%29.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E0.21.1 Compatible Version Now Available!\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve now updated the craft to work in 21.1 and with the up-to-date versions of the mods it uses. Kethane was the only one that was problematic one, but a bit of craft file editing sorted it.\u003C/p\u003E\u003Cp\u003EI\u0027ve also replaced some of the parts like the BobCat SAS units with NovaPunch ones (as they are more up-to-date with the SAS changes). For some reason the attachment of the modules to the LV was much weaker than it used to be so some more struts had to be added. They lift of fine thou so long as you are really gentle with the throttle, don\u0027t go about 1/4 throttle initially and then slowly ease it up to 1/2, as the boosters come away increase to 2/3 and then gradually bring it up to almost full as you climb into the thinner atmo. Once the first stage has dropped away you can ram it to full throttle. \u003C/p\u003E\u003Cp\u003EI\u0027ve done basic tests with the craft, taken them all to LKO but didn\u0027t dock them and send them to Duna. Tested both hab and Cargo modules landing process and the cargo assembly process. Things seem to be working ok! The rover shakes a bit more than it used to, you might want to strut it some more. I also noticed that some of the craft might need to have more power added to them to compensate for the new requirement the control system has. I\u0027ve added extra batteries to the Kopernicus escape pods, they might want some panels too but I didn\u0027t add them as the part count is already high. If you can handle more parts then add \u0027em.\u003C/p\u003E\u003Cp\u003EI\u0027ve not tested if they can still make it to Duna thou. They should I would think, but there have been some part changes, but nothing big. I will be running this mission again but as I\u0027ve started my space program over again I still have to get sat-nets setup first. I\u0027ll continue to update these craft as I use them and would like to hear if you guys spot any issues with them in 21.1\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TBryson2\u0022 data-cite=\u0022TBryson2\u0022\u003E\u003Cdiv\u003EWell, it\u0027s definitely the Kethane mod killing me! I loaded the latest (0.7.4) and anytime I try to load ANY ship it crashes to the desktop now. \u003Cp\u003EI spent the time to update the TAC Fuel manager, Protractor, KAS, and the latest Kethane MOD. Hopefully someone will find an answer. I\u0027ll keep digging.\u003C/p\u003E\u003Cp\u003ETBryson2\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the Kethane issue is plaguing your other craft and you want to update to the new version then what I did was to do a find and replace in a text editor (I use Vim, but notepad will do). If you search in the craft file for \u0022MMI.K\u0022 and then look at the rest of the name that comes after it, IGNORING the long number, then find the updated part in the new kethane and look in its part.cfg to find what the new name is. Only thing to note is that in the part.cfg the name might have underscores, but in the craft the underscores need to be replaced with fullstops.\u003C/p\u003E\u003Cp\u003ESo for example in the current craft you might have; \u0022MMI.K FuelTank - External_4293450386\u0022\u003C/p\u003E\u003Cp\u003EThe new name in the part.cfg is \u0022kethane_tankExternal\u0022\u003C/p\u003E\u003Cp\u003ESo you need to do a find and replace for \u0022MMI.K FuelTank - External\u0022 and replace all instances with \u0022kethane.tankExternal\u0022\u003C/p\u003E\u003Cp\u003Eif you don\u0027t mess with the long identifying number then everything should go ok.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fox62\u0022 data-cite=\u0022Fox62\u0022\u003E\u003Cdiv\u003ECan all this be done with little to no actual in-game flight skill using MJ2, or should I start practicing in stock?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome of it could be done with MJ I guess. I use MJ as an assistant, I don\u0027t ever let it go full auto, I pretty much only use the SURF function and its info about orbits. The ascent autoP will explode most of the craft, they have to be launched quite gently. You can prob do the rendezvous and docking with MJ and the transfers (I don\u0027t know tbh, never tried). It will land the craft and get them close, but I doubt that it could land the ascent module back inside the hab module for you. \u003C/p\u003E\u003Cp\u003EI would really recommend practicing maneuvers like docking and targeted landing yourself, they take a bit of a knack to start with but its really satisfying when you get it and the game is way more rewarding than just using MJ.\u003C/p\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-07-29T23:37:36Z","Content":"\n\u003Cp\u003EThank you for your help and for taking the time to help \u0022us\u0022 and share your project. I was able to get the cargo container to work, but ONLY after removing a lot of other parts and mods. I have 8 Gb of RAM and a screaming computer, but I guess KSP really has some limits! Too bad.\u003C/p\u003E\u003Cp\u003EAnyway, All is well on my end. Issues have been resolved, although I will probably install the full MODs of the ones you included so I can learn how to use them. \u003C/p\u003E\u003Cp\u003EAgain, thanks for the assistance!\u003C/p\u003E\u003Cp\u003ETB\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-07-31T05:54:49Z","Content":"\n\u003Cp\u003EKatateochi, \u003C/p\u003E\u003Cp\u003Ejust learned from the RemoteTech thread that you can set the flight computers for multiple ships as long as there are within the draw limit of each other. So, with careful planning, and figuring out correct throttle %s for both ships so their TWR are almost matching, you can have the Hab and Cargo modules launched at the same time. Though, if the ship that isnt in focus leaves that draw distance, the engines shut off, so it can be a little tricky. Using the lazor mod and increasing the distance would help out with this.\u003C/p\u003E\u003Cp\u003EI did a test for them to both burn 1000m/s delta-v, and they drifted about 800m apart upon completing the burns.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lfFyyD6.jpg\u0022 alt=\u0022lfFyyD6.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Swifty","CreatedById":57822,"CreatedDateTime":"2013-07-31T10:49:40Z","Content":"\n\u003Cp\u003EAwesome video and amazing designs!\u003C/p\u003E\n"},{"CreatedByName":"Voli","CreatedById":76795,"CreatedDateTime":"2013-07-31T13:43:15Z","Content":"\n\u003Cp\u003EWould you have the coordinates on duna where the surface is flat?\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-07-31T20:08:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gracae86\u0022 data-cite=\u0022gracae86\u0022\u003E\u003Cdiv\u003EKatateochi, \u003Cp\u003Ejust learned from the RemoteTech thread that you can set the flight computers for multiple ships as long as there are within the draw limit of each other. So, with careful planning, and figuring out correct throttle %s for both ships so their TWR are almost matching, you can have the Hab and Cargo modules launched at the same time. Though, if the ship that isnt in focus leaves that draw distance, the engines shut off, so it can be a little tricky. Using the lazor mod and increasing the distance would help out with this.\u003C/p\u003E\u003Cp\u003EI did a test for them to both burn 1000m/s delta-v, and they drifted about 800m apart upon completing the burns.\u003C/p\u003E\u003Cp\u003E*snip*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Egracae that is awesome!!! I didn\u0027t know that, thanks for telling me, OMG the possibilities that opens up! Too cool! I really should RFTM sometimes! \u003C/p\u003E\u003Cp\u003EI want to try and control a small fleet of tiny fighter craft with that!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voli\u0022 data-cite=\u0022Voli\u0022\u003E\u003Cdiv\u003EWould you have the coordinates on duna where the surface is flat?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe coordinates I landed at are;\u003C/p\u003E\u003Cp\u003E0, 7\u002722\u0022 North by 205, 10\u002758\u0022 West\u003C/p\u003E\u003Cp\u003EThat area is very flat and there is a large expanse of very flat land just over the ridge from there.\u003C/p\u003E\u003Cp\u003EThat was in 0.20.2 thou, I\u0027ve not been to Duna yet in 21.1 so don\u0027t know how/if its changed.\u003C/p\u003E\n"},{"CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2013-07-31T21:21:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fox62\u0022 data-cite=\u0022Fox62\u0022\u003E\u003Cdiv\u003ECan all this be done with little to no actual in-game flight skill using MJ2, or should I start practicing in stock?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty easily in fact. Just watch his video again and set with MJ the maneuvers he does.\u003C/p\u003E\u003Cp\u003EIf you\u0027re really really new to the game I\u0027d advise using MJ for what you don\u0027t think you can do, but don\u0027t use it as a crutch, or you\u0027ll never really learn. But watching it do something a couple times and then doing it yourself is how I learned.\u003C/p\u003E\u003Cp\u003E@Katateochi - Definitely wish I could use that landing site... If there was any bloody kethane on Duna.... I swear I\u0027ve done all the way up to 50 degrees of inclination scanning for kethane with my grand tour ship, and there wasn\u0027t a single deposit... I\u0027m not sure whether I want to reset the deposit maps or not. This could make a Duna base sort of interesting if I have to haul fuel in from Ike.\u003C/p\u003E\n"},{"CreatedByName":"NNYGamer","CreatedById":57725,"CreatedDateTime":"2013-08-01T00:13:01Z","Content":"\n\u003Cp\u003ECongratulations on one of the most thought out and innovative KSP videos I have ever seen. The designs are beautifully complicated yet so atheistically pleasing. \u003C/p\u003E\u003Cp\u003EI could never attempt such a feat at the moment due to my POS computer but your designs are inspirational.\u003C/p\u003E\n"}]}