{"TopicId":37449,"ForumId":34,"TopicTitle":"[1.0.5] TAC Life Support v0.11.2.1 [12Dec]","CreatedByName":"TaranisElsu","CreatedById":57742,"CreatedDateTime":"2013-07-17T16:20:54Z","PageNum":103,"Articles":[{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2015-01-13T01:27:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aedile\u0022 data-cite=\u0022Aedile\u0022\u003E\u003Cdiv\u003EWe have talked about this many times.\u003Cp\u003EIt is normal and realistic that water is created.\u003C/p\u003E\u003Cp\u003EFood when metabolized, do in fact produce large amount of water and CO2. In reality you\u0027d be losing between half and two thirds of your oxygen to water (I don\u0027t think TAC actually does this).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but you\u0027re replying to the wrong person - I wasn\u0027t arguing against the point you\u0027re making.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rayder\u0022 data-cite=\u0022Rayder\u0022\u003E\u003Cdiv\u003EI\u0027ve actually been trying to do the calculations to figure out the numbers, but I think I\u0027m hitting a roadblock. The process is C6H12O6 \u002B 6 O2 \u0026gt; 6 CO2 \u002B 6 H2O. So if my numbers are correct, you should have:\u003Cp\u003E1kg Glucose \u002B 1.07kg Oxygen --\u0026gt; 1.47kg CO2 \u002B 0.6kg H2O\u003C/p\u003E\u003Cp\u003EAccording to NASA\u0027s numbers, 0.62kg food and 0.84kg Oxygen is consumed per day per astronaut. But here\u0027s my problem. Even if you assumed that the whole 0.62kg food / day is glucose, the Oxygen needed is only ~0.66kg. So where is that other oxygen going? What happens to it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere\u0027s your water? Also, you have a chemical reaction between Glucose and O2 becoming CO2 and H2O, but that\u0027s only 1/3-1/2 of \u0022food\u0022 - the rest is lipids and proteins.\u003C/p\u003E\u003Cp\u003ENASA\u0027s most recent published numbers:\u003C/p\u003E\u003Cp\u003EInput:\u003C/p\u003E\u003Cp\u003E\u0022Food\u0022 - 0.617kg/d\u003C/p\u003E\u003Cp\u003EWater - 3.909 kg/d\u003C/p\u003E\u003Cp\u003EO2 - 0.835 kg/d\u003C/p\u003E\u003Cp\u003EOutput:\u003C/p\u003E\u003Cp\u003E\u0022Waste\u0022 (solids) - 0.109 kg/d\u003C/p\u003E\u003Cp\u003E\u0022Wastewater\u0022 - 4.254 kg/d\u003C/p\u003E\u003Cp\u003ECO2 - 0.998 kg/d\u003C/p\u003E\u003Cp\u003ESource: Advanced Life Support Baseline Values and Assumptions, NASA 1994\u003C/p\u003E\u003Cp\u003EGlucose should be about 0.3kg/d, not 1kg, and it\u0027s only 1 of several metabolic pathways involved.\u003C/p\u003E\n"},{"CreatedByName":"Rubber Ducky Space","CreatedById":100172,"CreatedDateTime":"2015-01-13T14:12:45Z","Content":"\n\u003Cp\u003EHey, was just dropping by to say great mod, I feel it\u0027s essential to my game. But I also needed containers for Waste after making a station that recycled air and water. I tweaked the files a bit and \u0022painted over\u0022 the Life Support Waste container to make the Organic Waste Container (3 sizes).\u003C/p\u003E\u003Cp\u003EIf anyone needs them they\u0027re \u003Ca href=\u0022http://www.rubberduckynetwork.com/ksp.html\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2015-01-13T20:41:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rayder\u0022 data-cite=\u0022Rayder\u0022\u003E\u003Cdiv\u003EI\u0027ve actually been trying to do the calculations to figure out the numbers, but I think I\u0027m hitting a roadblock. The process is C6H12O6 \u002B 6 O2 \u0026gt; 6 CO2 \u002B 6 H2O. So if my numbers are correct, you should have:\u003Cp\u003E1kg Glucose \u002B 1.07kg Oxygen --\u0026gt; 1.47kg CO2 \u002B 0.6kg H2O\u003C/p\u003E\u003Cp\u003EAccording to NASA\u0027s numbers, 0.62kg food and 0.84kg Oxygen is consumed per day per astronaut. But here\u0027s my problem. Even if you assumed that the whole 0.62kg food / day is glucose, the Oxygen needed is only ~0.66kg. So where is that other oxygen going? What happens to it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually I was \u0022a bit\u0022 out of it, you don\u0027t lose half to two thirds of oxygen to water.\u003C/p\u003E\u003Cp\u003EBut roughly 15-20%.\u003C/p\u003E\u003Cp\u003E Note that glucose already contains all it\u0027s water, so you need oxygen only for the carbon (theoretically anyway things are much more complicated). Lipids and proteins to large extent (like most organic compounds) are mostly CH2 chains, so metabolizing them takes roughly 30% extra oxygen. However, since they don\u0027t contain the oxygen, in the same weight they would contain roughly twice as much carbon and hydrogen. A kg of pure fat would require around 160% extra oxygen compared to kg of pure glucose. So there\u0027s where your oxygen goes.\u003C/p\u003E\u003Cp\u003EThis is obviously a severe oversimplification. For example the urea cycle (removes hydrogen), the microflora metabolism (methane production) - but these are rather small part of the whole process (unless kerbals operate more like cows, which would explain frequent explosions).\u003C/p\u003E\u003Cp\u003EThe important part is that the result of what comes out need to weigh the same of what comes in (assuming no variance in kerbal weight), or at least not gain extra (we can imagine something was lost to space)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-13T21:05:43Z\u0022 title=\u002201/13/2015 09:05  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 13, 2015\u003C/time\u003E by Aedile\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2015-01-14T04:58:17Z","Content":"\n\u003Cp\u003EYeah I know what you mean and where you\u0027re coming from. I was just trying to account for all the mass. Turns out if you weigh up the molecular masses of those compounds, they balance out perfectly. I merely used 1kg to try to demonstrate my point as it\u0027s easier to compare the other values, starting from 1.\u003C/p\u003E\u003Cp\u003EMy concern was where all the other compounds go. I\u0027m no nutritionist or scientist or whatever, but I was curious why I was coming up short with the Oxygen, and where the rest of it was going.\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2015-01-14T10:09:18Z","Content":"\n\u003Cp\u003EMe neither. \u003C/p\u003E\u003Cp\u003EA kilogram actually makes good sense. This is what was trying to explain, that major difference between carbs and fats/proteins is that they got roughly twice as much carbon (in addition to the hydrogen which also needs external oxygen).\u003C/p\u003E\u003Cp\u003EI suppose all the other compounds go to waste/waste water (eg the urea ends up in your pee). There is this implied trace contaminant removal and CO2 removal working on electricity\u003C/p\u003E\u003Cp\u003EMost of the real LS systems actually capture water condensate. In a lot of cases it which goes directly to potable water. Lots of them split some of the extra water, releasing some oxygen. The resulting hydrogen can further be used in Sabatier process, in turn recycling CO2 and producing methane. \u003C/p\u003E\u003Cp\u003ESo in any case the amount of water\u002Bwaste water should increase. (never bothered to see if TACLS does this).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-14T10:13:17Z\u0022 title=\u002201/14/2015 10:13  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 14, 2015\u003C/time\u003E by Aedile\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketScientistsSon","CreatedById":83151,"CreatedDateTime":"2015-01-16T16:31:22Z","Content":"\n\u003Cp\u003EI am having trouble getting the build aid menu to come up in the VAB. It also is not draining resources when I am flying a rocket. The parts show up in my build menus though. \u003C/p\u003E\u003Cp\u003EI know there have been some posts about this next problem But I am struggling as I am not a developer or any good with computer coding. But, the parts zoom in until they dissappear in the build menus. Is there a workaround I could implement? If not its not a big deal I can still get the parts on my ship.\u003C/p\u003E\u003Cp\u003EI hear this is important for some reason so...\u003C/p\u003E\u003Cp\u003Eoutput log: \u003Ca href=\u0022https://www.dropbox.com/s/ug9gw1anjsq1g14/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ug9gw1anjsq1g14/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am also running the windows 32 bit version on a 64 bit computer for what its worth.\u003C/p\u003E\u003Cp\u003Eany help would be great!\u003C/p\u003E\n"},{"CreatedByName":"CorBlimey","CreatedById":134058,"CreatedDateTime":"2015-01-16T18:06:19Z","Content":"\n\u003Cp\u003Ewhoops - realised i was replying to an ancient post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-16T18:08:32Z\u0022 title=\u002201/16/2015 06:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 16, 2015\u003C/time\u003E by CorBlimey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TaranisElsu","CreatedById":57742,"CreatedDateTime":"2015-01-17T21:11:04Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EWarning: it looks like the ModularFuelTanks mod changed something that makes my compatibility configs not work with it anymore. A fix will be coming soon.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThanks to @AccidentalDisassembly and others for bringing it to my attention.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sarxis\u0022 data-cite=\u0022Sarxis\u0022\u003E\u003Cdiv\u003EI am still trying to adjust my kerbal\u0027s EVA electricity counts. I\u0027d like for them to have ~100 units of electricity when they go on EVA, but right now they have ~367max, which is just too much for my default battery and pod counts. \u003Cp\u003EWhat is the difference between ElectricityConsumptionRate and BaseElectricityConsumptionRate in the LifeSupport.cfg? \u003C/p\u003E\u003Cp\u003EAlso, is changing the kerbal electricity rate the only way to get my kerbals to have a flat 100e on EVA? Thanks for any help! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbals on EVA are given 6 hours worth of electricity. The only way to change that is to change the consumption rate (EvaElectricityConsumptionRate) or the amount given (EvaDefaultResourceAmount) but that will affect food and water supplies also.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tomf\u0022 data-cite=\u0022tomf\u0022\u003E\u003Cdiv\u003ETo change the EVA electicity you will need to adjust the eva electivity rate. A kerbal is given enough to last eactly 1 day so to force that to be 100 the eva rate should be set to 0.00463 (100/(6*60*60)).\u003Cp\u003EFor crewed ships the electicity consumption rate is BaseElectricityConsumptionRate * totalCapacity \u002B ElectricityConsumptionRate * number of kerbals.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery close, but the total consumption rate (for ships) is actually just: \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003EBaseElectricityConsumptionRate * number of occupied parts \u002B ElectricityConsumptionRate * number of kerbals\u003C/span\u003E. The total consumption rate for Kerbals is just \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003EEvaElectricityConsumptionRate\u003C/span\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sarxis\u0022 data-cite=\u0022Sarxis\u0022\u003E\u003Cdiv\u003EI got it to work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But, are the Kerbals supposed to die once they run out of resources and go past their \u0027expiration limits\u0027? While I was testing my custom rates, my kerb just did not expire from the lack. \u003Cp\u003Eedit: maybe because I was testing on the surface of Kerbin? I only went past the electricity expiration (oxygen is fine on the surface).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI changed it a while back so that running out of electricity does not kill if on Kerbin below a reasonable altitude. Oxygen is not required in that situation either. Kerbals do always need food \u0026amp; water because they could be in the desert, or at one of the poles, or deep in a jungle, or some place where there aren\u0027t any grocery stores around. It is easy enough to give them years worth of resources so I have not addressed that. Maybe someday.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tirello\u0022 data-cite=\u0022Tirello\u0022\u003E\u003Cdiv\u003EI wonder is i have messed up my setting some how. But a small hex life support can has enough to supply my kerbal for 29 days.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs others have said, you do not need much more than what is contained in the command pod for a quick trip to the Mun and back. Minmus will require more, and an interplanetary mission will require a lot more -- especially if you are nice and don\u0027t send a single Kerbal on such a long trip all by himself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eightiesboi\u0022 data-cite=\u0022eightiesboi\u0022\u003E\u003Cdiv\u003EWould you mind posting (or sending me a link) to your LifeSupport.cfg file from your game? I\u0027d like to compare it with mine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mod will recreate the file for you with default values if you: rename the file (to get it out of the way), launch KSP to the Space Center scene and exit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lextacy\u0022 data-cite=\u0022lextacy\u0022\u003E\u003Cdiv\u003EHey, can someone help me out with a problem. I had TAC life support kill off all my crew when it still had food,oxygen,water. So to revive my crew back onboard I edited the save file. Now I got the crew back on the station by using the \u0022assign\u0022 trick. However TAC will not register them as valid members of consumers.\u003Cp\u003E\u003Ca href=\u0022http://i1164.photobucket.com/albums/q561/chadro_6963/Kerbal/screenshot39.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i1164.photobucket.com/albums/q561/chadro_6963/Kerbal/screenshot39.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see on the bottom, the TAC window for Life Support Crew Roster says 0:00 for everything. Although the KISS has 400\u002B days of resources. I might have missed something in the save file that I need to edit. I hope someone can help me getting these crew members TAC compliant.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry for the late reply. I do not see anything wrong in that picture. The main Life Support Monitoring window shows the amount of each resource that is remaining. The Life Support Crew Roster shows the time since the Kerbal last consumed the resource. Note that the \u0022Last food\u0022 and \u0022Last water\u0022 values should always match \u0022Last updated\u0022, otherwise they have no food/water available and are going to die at some point.\u003C/p\u003E\u003Cp\u003EIf you ever see the mod kill off your crew when you think it should not have, then please \u003Cem\u003E\u003Cstrong\u003Eimmediately\u003C/strong\u003E\u003C/em\u003E alt\u002Btab out of the game, make a copy of the log file, and upload the log file to Dropbox or somewhere that I can look at it? See my signature for instructions on where to find the log file. I have not seen or heard of that happening in a long time, but if you hit a special case then I would really like to know about it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CorBlimey\u0022 data-cite=\u0022CorBlimey\u0022\u003E\u003Cdiv\u003EIs it possible to install this in the middle of a career game? I am already on a 2nd restart and don\u0027t quite fancy the grind to get 2M funds to unlock some toys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI read somewhere that Kerbals don\u0027t start consuming resources until the first time they are loaded into the 2.5km active range, so I am hoping I can install -\u0026gt; despatch a supply ship -\u0026gt; wait a few hundred days -\u0026gt; land supply ship -\u0026gt; feed them.\u003C/p\u003E\u003Cp\u003EIt sounds like yes, but if you have any tips for a first-time TAC\u0027er then...! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are correct, ships have to be loaded into the current scene (i.e. be within 2.5 km) before the mod does anything with them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tomf\u0022 data-cite=\u0022tomf\u0022\u003E\u003Cdiv\u003EStarting mid career is fine. I would make sure you don\u0027t have any interplanatary missions actively going on as they might find they are a long way from Kerbin with only 3 days of supplies. Get ready to send out supply ships to long term space stations. Anything that you can\u0027t dock a supply carrying module to is going to be a pain to keep supplied too so either evacuate the kerbals or end the mission. Keeping ground based stations that weren\u0027t specifically designed for wheeled docking supplied is also problematic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does not matter where your other ships are, do not get within 2.4 km of them without supplies. That is when the mod \u0022detects\u0022 the other ship and starts calculating consumption. Nothing is done with the ship until then.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E@Aedile, @Rayder, @panarchist, @Maelztrom\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHave you seen my spreadsheet where I did all the calculations?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/spreadsheet/ccc?key=0Aioc9ek3XAvwdGNsRlh3OVhlbTFBR3M4RW0zLUNTRFE\u0026amp;usp=sharing#gid=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheet/ccc?key=0Aioc9ek3XAvwdGNsRlh3OVhlbTFBR3M4RW0zLUNTRFE\u0026amp;usp=sharing#gid=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that I assume the food is not completely dehydrated, so there is some water contained in the food. Similar to what they currently ship to the ISS. See the spreadsheet for calculations and sources.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketScientistsSon\u0022 data-cite=\u0022RocketScientistsSon\u0022\u003E\u003Cdiv\u003EI am having trouble getting the build aid menu to come up in the VAB. It also is not draining resources when I am flying a rocket. The parts show up in my build menus though. \u003Cp\u003EI know there have been some posts about this next problem But I am struggling as I am not a developer or any good with computer coding. But, the parts zoom in until they dissappear in the build menus. Is there a workaround I could implement? If not its not a big deal I can still get the parts on my ship.\u003C/p\u003E\u003Cp\u003EI hear this is important for some reason so...\u003C/p\u003E\u003Cp\u003Eoutput log: \u003Ca href=\u0022https://www.dropbox.com/s/ug9gw1anjsq1g14/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ug9gw1anjsq1g14/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am also running the windows 32 bit version on a 64 bit computer for what its worth.\u003C/p\u003E\u003Cp\u003Eany help would be great!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like an install problem. Please completely remove the mod, make sure that you downloaded the version from the Dropbox link in the thread OP (the file should be TacLifeSupport_0.10.1.1320.zip), and \u003Ca href=\u0022https://github.com/taraniselsu/TacLifeSupport/wiki/Tutorial#installation-tutorial\u0022 rel=\u0022external nofollow\u0022\u003Ereinstall using these instructions\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThat should fix it. Let me know if it doesn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"dueb","CreatedById":65409,"CreatedDateTime":"2015-01-18T04:59:16Z","Content":"\n\u003Cp\u003EHello TaranisElsu !\u003C/p\u003E\u003Cp\u003EAbout your spreadsheet, could you explain me how do you get the mass (kg) in your recyclers calculations, please ?\u003C/p\u003E\u003Cp\u003EI\u0027m trying to add the Hydrogen to my recyclers. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: I figured out what is it. Don\u0027t bother answering me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-28T13:28:28Z\u0022 title=\u002201/28/2015 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 28, 2015\u003C/time\u003E by dueb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-01-18T13:24:06Z","Content":"\n\u003Cp\u003EI enjoyed TAC-LS immensely when conducting long-duration missions in .24 last year. \u003C/p\u003E\u003Cp\u003EI am patiently waiting for TAC to be updated to .90 before starting a \u0027serious\u0027 career game in the current version \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eightiesboi","CreatedById":133828,"CreatedDateTime":"2015-01-18T21:04:11Z","Content":"\n\u003Cp\u003EHey all!\u003C/p\u003E\u003Cp\u003EI could really use some help here. Although my config file matches another players (thanks Aedile), my amounts seem off. According to the Life Support Build Aid, in the VAB, my Mark I shows the following:\u003C/p\u003E\u003Cp\u003EFood: 1 day, 1 minute, 4 seconds\u003C/p\u003E\u003Cp\u003EWater: 5 hours, 15 minutes, 53 seconds\u003C/p\u003E\u003Cp\u003EOxygen: 4 hours, 32 minutes, 1 second\u003C/p\u003E\u003Cp\u003EElectricity: 53 minutes, 29 seconds\u003C/p\u003E\u003Cp\u003ECan anyone confirm or reject these values for me? If they are right, something seems wrong that a base capsule has more food than oxygen, and the electricity definitely seems really low to me.\u003C/p\u003E\u003Cp\u003EHelp? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comwarrior","CreatedById":101751,"CreatedDateTime":"2015-01-20T02:26:48Z","Content":"\n\u003Cp\u003EGreetings all,\u003C/p\u003E\u003Cp\u003ERunning KSP 0.90 and TACLS V0.10.1.1320 and i think i have ether a bug or compatibility problem (or something)...\u003C/p\u003E\u003Cp\u003EThe oxygen does not deplete and CO2 does not increase on any pod/hab... Water, food, waste, waste water are all fine.\u003C/p\u003E\u003Cp\u003EOther mods installed are (take deep breath)...\u003C/p\u003E\u003Cp\u003EB9_Aerospace_Pack-R5.2.8\u003C/p\u003E\u003Cp\u003EDeadlyReentry_v6.4.0\u003C/p\u003E\u003Cp\u003EHex_Truss-0.3\u003C/p\u003E\u003Cp\u003EKAS_0.4.10\u003C/p\u003E\u003Cp\u003EKSPAlternateResourcePanel_2.6.3.0\u003C/p\u003E\u003Cp\u003ELLL-13.1\u003C/p\u003E\u003Cp\u003EMechJeb2-2.4.2.0\u003C/p\u003E\u003Cp\u003ENear_Future_Construction-0.4.0\u003C/p\u003E\u003Cp\u003ENear_Future_Solar-0.4.0\u003C/p\u003E\u003Cp\u003EProceduralParts-0.9.21\u003C/p\u003E\u003Cp\u003ERemoteTech-v1.5.1\u003C/p\u003E\u003Cp\u003ESCANsat-8.1\u003C/p\u003E\u003Cp\u003ESIL_25 (modified to be compatible)\u003C/p\u003E\u003Cp\u003ETacFuelBalancer_2.4.1.1008\u003C/p\u003E\u003Cp\u003ETAL_Spherical_Toroidal_Pack_V3.12\u003C/p\u003E\u003Cp\u003ETrajectories-1.1.2\u003C/p\u003E\u003Cp\u003ETweakScale_1.50\u003C/p\u003E\u003Cp\u003EUbioWeldContinued-2.1.1\u003C/p\u003E\u003Cp\u003EUniversal_Storage-1.0.90.1\u003C/p\u003E\u003Cp\u003ETold ya to take a deep breath...\u003C/p\u003E\u003Cp\u003EI\u0027m going to setup another KSP 0.90 with only LS installed to see if it\u0027s a mod compatability issue tomarrow... thaught i\u0027d throw this up to see if anyone else has noticed it?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-01-20T02:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comwarrior\u0022 data-cite=\u0022Comwarrior\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe oxygen does not deplete and CO2 does not increase on any pod/hab... Water, food, waste, waste water are all fine.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy chance you aren\u0027t doing your testing of this on Kerbin, are you? Because Kerbin has oxygen so they don\u0027t need external oxygen. I believe the same is true for Laythe.\u003C/p\u003E\n"},{"CreatedByName":"Comwarrior","CreatedById":101751,"CreatedDateTime":"2015-01-20T03:54:47Z","Content":"\n\u003Cp\u003EI thought you had to have an air intake and an air filter to do this????\u003C/p\u003E\u003Cp\u003EI will test this with a rocket then...\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2015-01-20T09:15:05Z","Content":"\n\u003Cp\u003EYou need the intakes and filters the stored supplies of Oxygen on the craft.\u003C/p\u003E\u003Cp\u003EAlso the Oxygen on Laythe isn\u0027t usable without air intakes and filters to purify it.\u003C/p\u003E\n"},{"CreatedByName":"Comwarrior","CreatedById":101751,"CreatedDateTime":"2015-01-20T13:15:13Z","Content":"\n\u003Cp\u003EWell that\u0027s embarrassing...\u003C/p\u003E\u003Cp\u003EStuck a mk1 on a rocket and as soon as it got past 1.5K the oxygen started being used...\u003C/p\u003E\u003Cp\u003EIs there a CFG setting so that i can turn it off so that is HAS to have an air intake / filter before it will replenish O2?\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2015-01-20T17:16:45Z","Content":"\n\u003Cp\u003ENo, the Kerbin surface thing is hard coded, the idea is that if they are in a breathable atmospher they can just open the door to replenish the oxygen in the capsule without having ot use up their resources.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2015-01-21T13:44:57Z","Content":"\n\u003Cp\u003ESo how to get this running on 0.90? Do I need 0.10.1 and the drop box zip files? Or just the zip files? Or is it just busted and I should wait?\u003C/p\u003E\n"},{"CreatedByName":"eightiesboi","CreatedById":133828,"CreatedDateTime":"2015-01-22T04:42:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022togfox\u0022 data-cite=\u0022togfox\u0022\u003E\u003Cdiv\u003ESo how to get this running on 0.90? Do I need 0.10.1 and the drop box zip files? Or just the zip files? Or is it just busted and I should wait?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am using the regular install with the quickfix noted on the front page I haven\u0027t had any problems yet. I didn\u0027t wait for the fix to become official, although I am hoping it happens soon... TAC LS is the only mod I can\u0027t install with CKAN right now! \u003C/p\u003E\u003Cp\u003EAlso, if anyone would mind looking at my post (2561) above, I\u0027d really appreciate some feedback. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2015-01-22T04:48:58Z","Content":"\n\u003Cp\u003ESo I install 0.10.1 and then apply the five zip files in drop box? Just trying to spell this out for dummies like me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Patrick Kerbivan","CreatedById":114804,"CreatedDateTime":"2015-01-22T06:44:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022togfox\u0022 data-cite=\u0022togfox\u0022\u003E\u003Cdiv\u003ESo I install 0.10.1 and then apply the five zip files in drop box? Just trying to spell this out for dummies like me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf all you\u0027re using is TAC Life Support (the other zip files in the dropbox are for other TAC mods) then you just need to extract the contents of the TacLifeSupport_0.10.1.1320.zip file and copy the contained GameData folder into your Kerbal Space Program directory, allowing it to overwrite any existing files.\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-01-23T04:42:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eightiesboi\u0022 data-cite=\u0022eightiesboi\u0022\u003E\u003Cdiv\u003EI am using the regular install with the quickfix noted on the front page I haven\u0027t had any problems yet. I didn\u0027t wait for the fix to become official, although I am hoping it happens soon... TAC LS is the only mod I can\u0027t install with CKAN right now! \u003Cp\u003EAlso, if anyone would mind looking at my post (2561) above, I\u0027d really appreciate some feedback. Thanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a quickfix link on the opening post of this thread but when I click on it, nothing happens. Could someone be kind enough to repost a working link here please?\u003C/p\u003E\n"},{"CreatedByName":"Andrewmacor","CreatedById":82259,"CreatedDateTime":"2015-01-23T04:54:28Z","Content":"\n\u003Cp\u003EHow can you change the amount of electricity the recyclers use to process?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2015-01-23T04:55:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere is a quickfix link on the opening post of this thread but when I click on it, nothing happens. Could someone be kind enough to repost a working link here please? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a link to a drop box that has 7 zip files. Not sure if this helps, maybe try a different browser?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ehttps://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Olympic1","CreatedById":79730,"CreatedDateTime":"2015-01-23T04:57:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022togfox\u0022 data-cite=\u0022togfox\u0022\u003E\u003Cdiv\u003EIt\u0027s a link to a drop box that has 7 zip files. Not sure if this helps, maybe try a different browser?\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ehttps://www.dropbox.com/sh/3emtoeyky6c3w8v/AAAj-5dHf8POF8QI6bEOSSAla?dl=0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/3emtoeyky6c3w8v/AACeKCYqv4NGnloOUMrl-kZla/TacLifeSupport_0.10.1.1320.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/3emtoeyky6c3w8v/AACeKCYqv4NGnloOUMrl-kZla/TacLifeSupport_0.10.1.1320.zip?dl=0\u003C/a\u003E is the fix for 0.90\u003C/p\u003E\n"}]}