{"TopicId":37483,"ForumId":44,"TopicTitle":"Lagrange Points?","CreatedByName":"sammoe","CreatedById":61421,"CreatedDateTime":"2013-07-17T20:46:58Z","PageNum":1,"Articles":[{"CreatedByName":"sammoe","CreatedById":61421,"CreatedDateTime":"2013-07-17T20:46:58Z","Content":"\n\u003Cp\u003EWhat are they? I\u0027ve heard people like Scott Manley and others throwing this term around but I need a simple explanation without to many technical terms.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-07-17T21:05:32Z","Content":"\n\u003Cp\u003EBasically they are points where the gravity pulling on you from different bodies balances out, so say the earth and the moon are pulling on you equally, you don\u0027t fall toward either, you simply sit there.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-17T21:08:40Z","Content":"\n\u003Cp\u003EThis isn\u0027t exactly right. The forces in the rotating frame balance out. In other words, you stay in the same place in relation to the two bodies. This doesn\u0027t mean that the gravitational force is zero, since staying at the same point relative to two orbiting objects requires acceleration.\u003C/p\u003E\u003Cp\u003EThese points aren\u0027t all stable, either. So you wouldn\u0027t stay at that point indefinitely. A very small perturbation would result in you eventually leaving the Lagrange point. There are, however, some dynamically stable arrangements, like the Halo Orbits and Lissajous Orbits.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-07-17T21:11:45Z","Content":"\n\u003Cp\u003EI was going for simple. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-17T21:19:52Z","Content":"\n\u003Cp\u003EMore precisely, they are points where a vessel, using gravity alone (no propulsion) can maintain a fixed orbital position relative to two larger bodies, like the Earth and the Moon. If you can stay in a Lagrangian orbit, the Earth and the Moon would both appear stationary. There are 5 points for any two-body system, but only two of them, L4 and L5, can be stable. (L1, L2, and L3 are unstable in the way that a ball balancing on the top of a sphere is unstable.)\u003C/p\u003E\u003Cp\u003EEDIT: Ninja\u0027d by K\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\n"},{"CreatedByName":"sammoe","CreatedById":61421,"CreatedDateTime":"2013-07-18T02:35:23Z","Content":"\n\u003Cp\u003EThanks! Possible to set one up in KSP?\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-18T02:39:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sammoe\u0022 data-cite=\u0022sammoe\u0022\u003E\u003Cdiv\u003EThanks! Possible to set one up in KSP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, because KSP only takes influence from one astronomical body (sphere of influence) at a time to save memory.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-18T04:01:06Z","Content":"\n\u003Cp\u003EAnd if you\u0027re in a single sphere of influence, a Lagrange point (which for the sun and Kerbin, might be considered an orbit with an orbital period of one year) will always lie outside of the body\u0027s sphere of influence. I asked a question about this, and someone used fancy mass to prove that it\u0027s not possible for an orbit with a period of one year to lie inside the sphere of influence of a body with a mass less than the sun.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-18T04:43:06Z","Content":"\n\u003Cp\u003EIt should be noted that Lagrangian points are mostly a mathematical concept. It\u0027s much easier to stay in them on paper where zero actually exists.\u003C/p\u003E\n"},{"CreatedByName":"Yourself","CreatedById":4465,"CreatedDateTime":"2013-07-18T04:49:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbface\u0022 data-cite=\u0022Kerbface\u0022\u003E\u003Cdiv\u003ENo, because KSP only takes influence from one astronomical body (sphere of influence) at a time to save memory.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be specific it\u0027s so time warping doesn\u0027t introduce larger errors into the trajectories (and additionally doesn\u0027t take significantly more computational power). It has pretty much nothing to do with memory.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-18T05:03:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cheebsta\u0022 data-cite=\u0022Cheebsta\u0022\u003E\u003Cdiv\u003EIt should be noted that Lagrangian points are mostly a mathematical concept. It\u0027s much easier to stay in them on paper where zero actually exists.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure what you are trying to say, but if you are saying that they have no practical use, it is incorrect. L\u003Csub\u003E1\u003C/sub\u003E of Earth-Sun system is used by some solar observation stations, and L\u003Csub\u003E2\u003C/sub\u003E is going to be used for Webb telescope. Other points are, indeed, not terribly practical. They do, however, have some astronomical significance. The L\u003Csub\u003E4\u003C/sub\u003E and L\u003Csub\u003E5\u003C/sub\u003E of Jupiter, for example, hold a lot of asteroids. While one of such points for Earth-Sun system may have been the source of the object resulting in Giant Impact.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yourself\u0022 data-cite=\u0022Yourself\u0022\u003E\u003Cdiv\u003ETo be specific it\u0027s so time warping doesn\u0027t introduce larger errors into the trajectories (and additionally doesn\u0027t take significantly more computational power). It has pretty much nothing to do with memory.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you wouldn\u0027t be able to use conic sections to describe trajectories of other ships and debris, which might actually be a bigger issue. You might throw more processing power at predicting path of one simulated ship, but if you had to simulate all of the ships and debris in the system it\u0027d be a huge hike in necessary computational power.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-18T05:05:44Z\u0022 title=\u002207/18/2013 05:05  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 18, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-18T05:46:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EI\u0027m not sure what you are trying to say, but if you are saying that they have no practical use, it is incorrect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can always add more zeros behind the decimal in the real world. That makes it impossible to hit Lagrange with absolute precision. \u0022Really really close\u0022 is not the same thing, that is why they are considered theoretical points.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-07-18T06:25:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cheebsta\u0022 data-cite=\u0022Cheebsta\u0022\u003E\u003Cdiv\u003EYou can always add more zeros behind the decimal in the real world. That makes it impossible to hit Lagrange with absolute precision. \u0022Really really close\u0022 is not the same thing, that is why they are considered theoretical points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Econcepts stop being theoretical when They are involved In practical applications with real life consequences. Like he said, NASA has placed actual satellites in your theretical regions of space with orbital calculations that depend on math that ceased being theoretical.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-18T07:34:24Z","Content":"\n\u003Cp\u003ELagrange points are *exact* locations. The precision simply does not exist in the natural world to find an exact position. Of course you can put something very close to where these points should be, and gain most of the benefits, but you\u0027re still not directly on it. The satellites using them, orbit them, and most of them do indeed require regular burns to maintain position. Trojan asteroids also drift. Even if it takes them a billion years to fall out of orbit, they drift. If not, how would an object fall out of L4 to collide with Earth in the first place?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-18T08:56:05Z","Content":"\n\u003Cp\u003EYou are completely wrong. L\u003Csub\u003E4\u003C/sub\u003E and L\u003Csub\u003E5\u003C/sub\u003E are stable. That means that if you put something sufficiently close, it will stay there indefinitely. The only reason things fall out of real L\u003Csub\u003E4/5\u003C/sub\u003E is that real systems are not 3-body systems. We don\u0027t have just Sun and Earth. We also have the Moon in Earth\u0027s orbit and all the other planets. The other objects will cause equilibrium points to shift periodically and that does, occasionally, knock something out of the L\u003Csub\u003E4/5\u003C/sub\u003E. This is not a matter of precision. Something \u003Cem\u003Eprecisely\u003C/em\u003E at that point would still be knocked out. And without such perturbation, something practically close would never be knocked out.\u003C/p\u003E\u003Cp\u003EThe other Lagrangian points are not stable, but they have stable orbits around them. So again, you can put something very close and make it stay there. And again, the reason these orbits aren\u0027t permanent is largely due to other objects.\u003C/p\u003E\u003Cp\u003EUltimately, none of these are \u0022just points\u0022. While true equilibrium only exists at a point, there is an attractor region around that point. So in practice, you are interested in a finite region of space. Not in just one point.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-18T09:31:49Z","Content":"\n\u003Cp\u003EDo you possibly mean you only stay there indefinitely on paper? As in a mathematically equation says it\u0027s possible, but it doesn\u0027t actually work in the real world?\u003C/p\u003E\u003Cp\u003EStrange, I vaguely recall saying that in the first place.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-07-18T10:17:24Z","Content":"\n\u003Cp\u003EI have a follow up question about those points:\u003C/p\u003E\u003Cp\u003EHow would one put an object in them? Would it be like rendevous, in that you adjust your orbit to intercept the point, and than adjust your speed to match?\u003C/p\u003E\u003Cp\u003ESecond question: With \u0027unstable point\u0027 do you mean they drift? I can\u0027t imagine them stopping to exist at some point, as the bodys are there, so I asume it\u0027s drifting. But I have a hard time understanding how exactly they would drift\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-07-18T11:09:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cheebsta\u0022 data-cite=\u0022Cheebsta\u0022\u003E\u003Cdiv\u003EDo you possibly mean you only stay there indefinitely on paper? As in a mathematically equation says it\u0027s possible, but it doesn\u0027t actually work in the real world?\u003Cp\u003EStrange, I vaguely recall saying that in the first place.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it works in the real world, or would if the real world were as simple as the mathematical model.\u003C/p\u003E\u003Cp\u003ENo doubt Lagrange points (or their equivalents) can exist in multi body systems as well, but the computations required to resolve them are much more involved and likely beyond what we can (or ever will be able to) muster for a system the complexity of the universe.\u003C/p\u003E\u003Cp\u003EAs is, building something in earth-moon L5 does not need a lot of power to remain stable there, which is where it becomes useful.\u003C/p\u003E\u003Cp\u003EWhile not in the real world requiring zero energy, it requires a lot less to maintain station at L5 and compensate as L5 shifts position than it would holding a fixed position between earth and moon anywhere else.\u003C/p\u003E\n"},{"CreatedByName":"eRe4s3r","CreatedById":35705,"CreatedDateTime":"2013-07-18T12:37:09Z","Content":"\n\u003Cp\u003EThere is no such thing as a \u0022stable\u0022 Lagrange \u0022point\u0022 in space \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E And because of that you don\u0027t put ships *on* the point, you have em orbit around it (halo orbits), since it has a gravitational sphere of influence you can make your vessel fall towards the lagrange point indefinitely (unlike staying on the point, an orbit makes it an defacto stable arrangement) VERY slight curse corrections might be needed over time, but a lot less than if you stayed in the center of the sphere of influence or anywhere else really. You might have noticed, but if you are in orbit you travel with the object you are orbiting. This is why Lagrange points are super useful to \u0022orbit\u0022 around, not so useful to park \u0022on\u0022\u003C/p\u003E\u003Cp\u003EOne of the posters asked how you get to them, and that\u0027s how you get to them. You don\u0027t exactly. You orbit lagrange points just like any other gravitational sphere of influence.. like planets or moons, just a lot smaller sphere of influence and a *lot* slower ;p And of course this means getting there is identical to getting to a planet, super lots of delta-v required to establish orbit and the same principles of lowering and raising it apply.\u003C/p\u003E\u003Cp\u003ESomeone slap me if something I posted now was factually incorrect. That\u0027s what I gathered from my astronomy classes which were quite a while ago.\u003C/p\u003E\u003Cp\u003EBecause it could be handled like a weirdly moving sphere of influence, I don\u0027t understand why KSP doesn\u0027t have them. Even the simplest approximation would be enough to make them super useful for certain projects ;p\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-18T12:39:48Z\u0022 title=\u002207/18/2013 12:39  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 18, 2013\u003C/time\u003E by eRe4s3r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-18T15:49:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cheebsta\u0022 data-cite=\u0022Cheebsta\u0022\u003E\u003Cdiv\u003EDo you possibly mean you only stay there indefinitely on paper? As in a mathematically equation says it\u0027s possible, but it doesn\u0027t actually work in the real world?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are hundreds of asteroids at the Jupiter-Sun L4 and L5 points that have been there nearly since the beginning of the solar system.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-18T16:05:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cheebsta\u0022 data-cite=\u0022Cheebsta\u0022\u003E\u003Cdiv\u003EYou can always add more zeros behind the decimal in the real world. That makes it impossible to hit Lagrange with absolute precision. \u0022Really really close\u0022 is not the same thing, that is why they are considered theoretical points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis strikes me as overly pedantic. There are real objects at the real Lagrange points that stay there. What you\u0027re saying is nonsensical. You could just as easily say that 0 degrees latitude is an abstraction of mathematical precision, but it is absolutely possible to stand with my left foot on one side of the equator and my right foot on the other side.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-07-18T16:23:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThere are hundreds of asteroids at the Jupiter-Sun L4 and L5 points that have been there nearly since the beginning of the solar system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly since Minerva exploded, which was a heck of a lot more recently than the beginning of the solar system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-18T16:37:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EOnly since Minerva exploded, which was a heck of a lot more recently than the beginning of the solar system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI confess my ignorance. I\u0027m not sure what Minerva is/was. Here is my source, for reference: \u003Ca href=\u0022http://www.lpi.usra.edu/books/AsteroidsIII/pdf/3007.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.lpi.usra.edu/books/AsteroidsIII/pdf/3007.pdf\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-07-18T17:45:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EI confess my ignorance. I\u0027m not sure what Minerva is/was. Here is my source, for reference: \u003Ca href=\u0022http://www.lpi.usra.edu/books/AsteroidsIII/pdf/3007.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.lpi.usra.edu/books/AsteroidsIII/pdf/3007.pdf\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, it was a tongue in cheek reply anyway. But Minerva is a fictional name for a theoretical planet that existed between Mars and Jupiter that exploded and resulted in the asteroid belt.\u003C/p\u003E\u003Cp\u003ENow that I think about it though, it might have come from a novel I read once. Part of the story was set in our present and part in the distant past... dealing with the inhabitants of doomed Minerva. The end of the story has some archeologist finding some artifact from Minerva and tossing it aside because he thinks it was planted there as a joke by a colleague. (looked too modern)\u003C/p\u003E\u003Cp\u003EYup here it is... so, not sure that anyone has ever seriously used the name \u0027Minerva\u0027 to refer to a theoretical planet that broke up and caused the asteroid belt. (though such a planet has been theorized)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Giants_series\u0022 rel=\u0022external nofollow\u0022\u003EInherit the Stars\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-18T17:50:17Z\u0022 title=\u002207/18/2013 05:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 18, 2013\u003C/time\u003E by Starwaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-18T18:27:48Z","Content":"\n\u003Cp\u003EDoes this perfect 2 body system where Lagrange points work so perfectly actually exist in the universe?\u003C/p\u003E\n"}]}