{"TopicId":37978,"ForumId":16,"TopicTitle":"Avoid my rocket from spinning?","CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T07:52:37Z","PageNum":1,"Articles":[{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T07:52:37Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI have modified my launcher with the remote guidance unit instead of the 3 man command pod, but now it start spinning because the torque is not enough I think, but why the spinning at all?\u003C/p\u003E\u003Cp\u003EHere is the craft file ( stock ): \u003Ca href=\u0022https://www.dropbox.com/s/so25q5bsb7s1fm0/Lewis%20%26%20Clark%20-%20Station%20Core.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/so25q5bsb7s1fm0/Lewis%20%26%20Clark%20-%20Station%20Core.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe spinning start to be uncontrollable after the first stage\u003C/p\u003E\u003Cp\u003Eedit: clustering engine is bad for rotation anyway, symmetric or not, this version without the clustering do not rotate like crazy \u003Ca href=\u0022https://www.dropbox.com/s/9pejy5mmptjvnno/Lewis%20%26%20Clark%20-%20test.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/9pejy5mmptjvnno/Lewis%20%26%20Clark%20-%20test.craft\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-21T08:34:49Z\u0022 title=\u002207/21/2013 08:34  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 21, 2013\u003C/time\u003E by brusura\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T07:59:18Z","Content":"\n\u003Cp\u003EUhm...actually I think to have found the reason just now, because I am using a 3 engines configuration and the mirroring thing put the engines in the opposite direction...\u003C/p\u003E\u003Cp\u003EUhm...answered myself sorry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T08:13:50Z","Content":"\n\u003Cp\u003EWell...it went way better until out of atmosphere then it starts a little rotation and when hit last stage again uncontrollable rotation, but the cluster in the last stage is symmetric uhm...\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-21T08:54:43Z","Content":"\n\u003Cp\u003EYou had the right idea with the fuel lines for an asparagus staging system. But your actual stages and their order are all messed up. What i imagine, is that you were decoupling everything below the nuclear engine before the main central stack was finished burning. So you had this huge rocket pushing you from behind, but since you decoupled it, you had no control over it at all.\u003C/p\u003E\u003Cp\u003ETry this setup. Everything is exactly the same, i just fixed your staging problems. You should hit the spacebar when the first 2 booster stacks burn out, then hit it again when the second 2 booster stacks burn out. That will leave you with the main central stack still burning and under control. After the staging fix, i had no problems with stability and it flew dead straight all the way to orbit.\u003C/p\u003E\u003Cp\u003E::edited link:: I gave the raw format the first time.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/62x51hudakoc9va/Lewis%20%26%20Clark%20-%20Station%20Core%20Fix.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/62x51hudakoc9va/Lewis%20%26%20Clark%20-%20Station%20Core%20Fix.craft\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-21T09:02:44Z\u0022 title=\u002207/21/2013 09:02  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 21, 2013\u003C/time\u003E by dave4002000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T10:21:16Z","Content":"\n\u003Cp\u003EHi dave,\u003C/p\u003E\u003Cp\u003EI missed the last decoupler yeah, but that unfortunatly do not change things a bit, the last stage seems to be the problem, the first two first stages overcome the rotation force from the central one, when the first stage is gone I start to see a little compensation from ASAS on the roll axis, then when the second stage is gone the ASAS full compensate on the roll axis, if I turn ASAS off in the last stage it\u0027s just spinning without control on the roll axis, if I turn engines off or throttle down and ASAS back on the rocket stabilze, so it\u0027s something with le cluster configuration on the last stage.\u003C/p\u003E\u003Cp\u003EI dunno how you could flight it straight all the way to orbit without noticing this uhm, maybe it\u0027s the way am I flying it? I have ASAS always on and hit F to do the course correction\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-21T10:23:19Z\u0022 title=\u002207/21/2013 10:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 21, 2013\u003C/time\u003E by brusura\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-21T10:36:09Z","Content":"\n\u003Cp\u003EWell, i let mechjeb fly it before when i was testing and it had no issues, at all. After reading your comment, i just flew the entire launch manually(mechjeb wasn\u0027t even installed) and i still didn\u0027t have any issues. It did want to roll a little bit, but nothing that i couldn\u0027t control by using the \u0027Q\u0027 and \u0027E\u0027 keys. How are you flying your ascent? When do you start your gravity turn?\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T15:54:11Z","Content":"\n\u003Cp\u003EI have uploaded a video to better explain it, the last stage just keep spinning, if you see, in the video I used the rcs to kill momentum and then let the rocket free without using asas or rcs, it just start spinning again Ã‚Â°_Ã‚Â°\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ttXF2c_j7A8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EDuring the whole flight when I disable asas with F it always want to roll\u003C/p\u003E\u003Cp\u003Eps: I have no mods on this installation\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-21T16:55:15Z","Content":"\n\u003Cp\u003EEvery time I use fins on my rockets that happens. I thought maybe it was because the fins have lift, and are all applying that force in the same direction, since they don\u0027t realize this is actually a rocket and not a plane. This is a completely off the top of my head guess though.\u003C/p\u003E\n"},{"CreatedByName":"MrTaxman","CreatedById":70450,"CreatedDateTime":"2013-07-21T17:05:28Z","Content":"\n\u003Cp\u003EI think Cheebsta is correct. I find I have the same problem (spinning) when I use fins on my final stages. I figure it trades atmospheric maneuverability for rock-steady directionality in LKO. *shrug* I figure it\u0027s a small problem for a large benefit.\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-21T18:17:32Z","Content":"\n\u003Cp\u003EI get the same issues all the time, cant work out what it is... often the usual advice is put on \u0027moar struts\u0027 .\u003C/p\u003E\u003Cp\u003EWanted to make a basic lifter, center stack (engine \u002B duel = stack ) and 6 radially mounted stacks in asparagus staging ... that\u0027s it, each tank is strutted, each engine is strutted , the radial mounts have struts to strengthen the connection between center and outer stacks... all symmetrical and balanced, yet the craft spins. \u003C/p\u003E\u003Cp\u003EBy the time the bugger is in orbit its spinning like crazy and totally ignore Q and E inputs (expected though as it only has ASAS and a Probe).\u003C/p\u003E\u003Cp\u003EDone all the usual tricks, disabled gimbals on the outer engines, tried strutting the stacks together, then only to the center, no struts at all (between stacks), cross strutting, checking no strut is in contact with another... \u003C/p\u003E\u003Cp\u003EI gave up and added AV-R8 winglets which controlled the spin while in the atmosphere and until I went to do my gravity turn... the second I touched F (Disables SAS if you hold F down) the craft jumped at the opportunity to enter the spinning top competition (and damn it is a good contender for that competition). \u003C/p\u003E\u003Cp\u003EIt annoys me no end as there isnt a logical reason why, if I had a extra part on the side I could get that... balance was off, or if it wasn\u0027t symmetrical I could get that too, but there isnt a logical reason ... just a vague notion I need \u0027moar struts\u0027 ...\u003C/p\u003E\u003Cp\u003E... so I gave up until the update, no point in getting more annoyed with the work in progress software until I check out the updates, for all I know the ASAS / SAS / Rotation Rings / Whatever will sort out most the crap I am having with spinning so all the swearing and calling the game everything under the sun will be for naught.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-21T18:44:57Z","Content":"\n\u003Cp\u003EThe thing you need to watch with \u0022MOAR STRUTS\u0022 is that if you are putting on struts that are not parallel to the rocket up and down, drag on those angles is going to induce a spin if you don\u0027t put another strut at an opposing angle to balance it out. Fuel lines also cause this. It typically happens once you stage and struts start to vanish.\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-21T18:56:07Z","Content":"\n\u003Cp\u003EOk, i played around with this a little more. It\u0027s not the engine cluster that\u0027s giving you issues. Because i replaced all those engines with 5 mainsails and the roll problem increased tremendously. What i noticed though, was that you didn\u0027t use 4-way symmetry to mount your radial boosters. I know this because i couldn\u0027t use 4-way symmetry to mount the mainsails. I had to use 2-way symmetry, twice. I would advise you to start from scratch and use 4-way symmetry on your boosters. With all those random cubic\u0027s and struts everywhere, the game probably didn\u0027t line up something correctly with the divided symmetry and that\u0027s what is causing your roll issue.\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-07-21T19:15:59Z","Content":"\n\u003Cp\u003EActually I have removed the clustering and used 4 skipper and 1 mainsail and the rolling was gone, anyway I am going to try out the cluster with 4-way symmetry also I am going to do another test without the fins/winglets ( without touching the symmetry ) and see the outcome.\u003C/p\u003E\u003Cp\u003EThanks all for the answers\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-07-21T19:25:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brusura\u0022 data-cite=\u0022brusura\u0022\u003E\u003Cdiv\u003EActually I have removed the clustering and used 4 skipper and 1 mainsail and the rolling was gone\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, alright then. I have no idea why our experiences of the same craft differ so much. But as long as you figured it out, that\u0027s all that matters\u003C/p\u003E\n"}]}