{"TopicId":3805,"ForumId":15,"TopicTitle":"Leetle Question (Bout reskinning)","CreatedByName":"Jackuul","CreatedById":11095,"CreatedDateTime":"2011-11-13T00:54:36Z","PageNum":1,"Articles":[{"CreatedByName":"Jackuul","CreatedById":11095,"CreatedDateTime":"2011-11-13T00:54:36Z","Content":"\n\u003Cp\u003EAaaanyways, I have found LOTS of wonderful parts, which work together really well, but don\\\u0027t match up skin-wise (I know I know, Kerbal tech is kinda junkyard techie in a way \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) but i was wondering if I did a reskin and tweaked config files of various parts to make a smooth (ish) looking setup, would that be considered okay? I would attempt to contact any modeler or person in the config files first of course, and leave them with the original author title in the file (just a Modded by Jack after). \u003C/p\u003E\u003Cp\u003EBasically I wanted to know if this was acceptable? I don\\\u0027t want to make anyone angry or anything or suddenly have a hive of angry bees descend upon me ._.\u003C/p\u003E\n"},{"CreatedByName":"Killerhurtz","CreatedById":320,"CreatedDateTime":"2011-11-13T09:09:09Z","Content":"\n\u003Cp\u003EThat depends entirely on the author of the parts. Ask them directly. Some of them (if not most) should be okay, but there might be some people uncomfortable with that. \u003C/p\u003E\u003Cp\u003EPS: if my material is part of what you wish to edit, go right ahead. I\\\u0027d love to see a better-done texture for them.\u003C/p\u003E\n"},{"CreatedByName":"Omnivore","CreatedById":10470,"CreatedDateTime":"2011-11-14T06:54:21Z","Content":"\n\u003Cp\u003EYeah same here, I\\\u0027m slowly getting the hang of 3D modeling simpler things and making them work in KSP but my artistic talent was given to someone else at birth. In fact, I\\\u0027m getting ready to put out a \\\u0027Space 1999 Eagle\\\u0027 lookalike command pod that really needs better textures.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-14T10:51:01Z","Content":"\n\u003Cp\u003ENice! I\\\u0027ve already thought about adding the thrusters as really long gimble range rockets. Hope it goes well!\u003C/p\u003E\n"},{"CreatedByName":"Omnivore","CreatedById":10470,"CreatedDateTime":"2011-11-14T11:23:52Z","Content":"\n\u003Cp\u003EHere\\\u0027s where I\\\u0027m at currently, the Command pod is more or less done except needs much better texture, the utility pods on the sides I turned into RCS fuel tanks - they\\\u0027re done except for tinkering with the cfg perhaps, texture could be much improved - just using blank all white lol. Need to do landing struts - C7\\\u0027s shockpads aren\\\u0027t a good fit for this. Of course, scaling is probably off a bit, and I\\\u0027m unsure how far I want to go with doing a full out Eagle like body. I\\\u0027m thinking I\\\u0027ll do the lift thrusters as unidirectional RCS modules with rocket flame effects - following up on C7\\\u0027s approach to VTOL.\u003C/p\u003E\u003Cp\u003EI\\\u0027m not 100% happy with the proportions of the command pod, but I\\\u0027m going with the story that Jeb picked up some strange EMR (Space 1999 rerun) while crossing the dark side of the Mun and it\\\u0027s his conception of it that\\\u0027s being modeled. I extruded/bent/banged/beat a simple cylinder into the pod model so I\\\u0027m not too unhappy with the result. Learned quite a bit in the process \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll probably put up a zip file tomorrow with the prototype parts and a texture-uvmap png for each part included.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-14T12:24:42Z","Content":"\n\u003Cp\u003ECool. Great to see it works!\u003C/p\u003E\u003Cp\u003EI don\\\u0027t like cheating with RCS engines on everything really, unless it\\\u0027s suppose to be an RCS type craft. Can you changed them to Gimbled rockets instead?\u003C/p\u003E\n"},{"CreatedByName":"DYJ","CreatedById":8636,"CreatedDateTime":"2011-11-14T13:06:32Z","Content":"\n\u003Cp\u003EUsing thrust vectorable engines for Vtol would be cool, but the problem is that they wouldn\\\u0027t operate independently of your main engines .\u003C/p\u003E\n"},{"CreatedByName":"Omnivore","CreatedById":10470,"CreatedDateTime":"2011-11-14T13:36:02Z","Content":"\n\u003Cp\u003EThe not being separated from the main engines is what had me looking at a \\\u0027fake lift thruster RCS\\\u0027 solution. I think you could make a rocket that pointed and thrust in the right direction for the lift thrusters but without separate control... I suppose you could make your belly thrusters highly gimbaled LFEs but then you\\\u0027d me messed up for normal spaceflight. In most of the film clips I remember seeing, the belly thrusters were used only during takeoff and landing - just as RCS is used by many players now for that, or at least partially that, on Mun landers.\u003C/p\u003E\u003Cp\u003EI\\\u0027m wondering if its possible to make a front section and rear section similar to the transporter version with the backbone being either 1m tanks, allowing for jettisonable cargoes or with 2m tanks and no cargo - well, none with any landing clearance below. Would have two attachment points in the rear of the front section and the front of the back section - only one pair of which would be used at a time - top pair for 1m tank backbone, center pair for 2m tank backbone. Might need many many struts lol.\u003C/p\u003E\n"},{"CreatedByName":"SmiteZero","CreatedById":10862,"CreatedDateTime":"2011-11-14T13:57:14Z","Content":"\n\u003Cp\u003EHonestly, are you planning to release the skin back to the community? Then definitely seek permission from the authors. If it\\\u0027s for you and you alone.. I say this as an artist myself. If I made something for this game and someone wanted a different look.. well, honestly *I* would like to make it for them, because I\\\u0027m an ego-driven ahole (artists, huh? :\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E), but if someone made something just for themselves, it was never distributed nor even screenshotted, what difference to me does it \u003Cem\u003Eliterally\u003C/em\u003E make?\u003C/p\u003E\u003Cp\u003EI\\\u0027ve reskinned the vanilla LOX tanks several times because.. WTH are they even made from? But it was purely for my own game. I don\\\u0027t think I\\\u0027ve even flashed a screenshot. I\\\u0027ve found all the skins for 3rd-party parts to be of an acceptably high quality, however and wouldn\\\u0027t ever even want to change them.\u003C/p\u003E\n"},{"CreatedByName":"DYJ","CreatedById":8636,"CreatedDateTime":"2011-11-14T14:18:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmiteZero\u0022 data-cite=\u0022SmiteZero\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E I\\\u0027ve found all the skins for 3rd-party parts to be of an acceptably high quality, however and wouldn\\\u0027t ever even want to change them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\\\u0027ve seen my radially attached jet engine I call bullshit on that statement \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-14T15:08:54Z","Content":"\n\u003Cp\u003ESame here! ;D\u003C/p\u003E\n"},{"CreatedByName":"SmiteZero","CreatedById":10862,"CreatedDateTime":"2011-11-15T01:04:02Z","Content":"\n\u003Cp\u003Elawl. Oh you guys!\u003C/p\u003E\n"}]}