{"TopicId":38092,"ForumId":32,"TopicTitle":"What if KSP was sold to EA?","CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-07-22T02:05:54Z","PageNum":10,"Articles":[{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-23T15:25:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sir Nahme\u0022 data-cite=\u0022Sir Nahme\u0022\u003E\u003Cdiv\u003EDerp so it\u0027s alright to be evil, all the cool kids are doing it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you consider evil? A honestly don\u0027t consider what they do evil in anyway. It\u0027s simply just business.\u003C/p\u003E\u003Cp\u003EYou most certainly are entitled to what you want to think, but don\u0027t make it out to be as if they are actually evil. Unless you want me to describe to you what I believe evil is, and then we can compare the differences. I would also like to point out if you consider EA evil, you are evil as well. Or are you going to say you never lied ever in your entire life?\u003C/p\u003E\u003Cp\u003EBasically, all you are doing is turning this into a discussion this really doesn\u0027t need to be. So if I where you, I would quit while you are ahead.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-07-23T15:57:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003EXD If you say so. If that was the case, I think computers you play KSP on wouldn\u0027t exist. Microsoft and apple have done just as bad things as EA, if not worse. Actually most major corporations do this crap, it\u0027s really nothing new. A company is in business to make money, if you think other wise, you are kidding yourself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think that a serious appraisal of their business policy would actually derive a result of of EA being objectively the worst company in America but you also have to consider the sector of the market that they operate in. EA are involved in a business venture where the consumer base are relatively tech-savvy and social media enabled, if you irritate the consumer base, these are the kinds of responses that you will get.\u003C/p\u003E\u003Cp\u003ERegardless, the relative value of the decisions that EA has made is largely irrelevant. They are worthy of criticism and are certainly the prime example of a company within their sector of the market that is widely disliked and are, as such, open to heavy criticism from anyone with an interest in computer gaming. I\u0027m sure that other demographics dislike other companies a great deal more.\u003C/p\u003E\u003Cp\u003EFinally, making money and providing a good consumer experience are not mutually exclusive. Annoying your consumers and squeezing your workforce might be one way of making money but ultimately probably not a very effective one. I may not entirely understand the appeal of many Apple products, for example, but never have I seen them evoke such anger amongst their consumer base as EA regularly manages, they would not be where they are today if they did.\u003C/p\u003E\n"},{"CreatedByName":"Crusher8000","CreatedById":25151,"CreatedDateTime":"2013-07-23T16:01:22Z","Content":"\n\u003Cp\u003EGaming companies are a business but their customers are one of the most demanding people out there because alot of game devs stay in contact with their fans, it createst a bond but the more fans you have the more you will disappoint, you could try to focus more on the community and get some of their ideas in the game or focus on earning money and try to reach as much people as possible.\u003C/p\u003E\u003Cp\u003EPersonally I dislike anything that\u0027s focused at a big audience, movies, games, food, clothes. The only way to reach a big audience is to smooth out the character of your product. Games lose their challenge because some people just don\u0027t have the attentionspan to play it for more than an hour, movies all look shiny and smooth because it\u0027s easier to be impressed by visuals instead of a story, etc.\u003C/p\u003E\u003Cp\u003EThere\u0027s a reason why I prefer to play indie games or at least games from smaller companies. If you go for the money your product loses its character and that happens to be the thing that make people fall in love with. A game full of character certainly won\u0027t please everyone but the people that do will love it and I appreciate a company to rather goes for a game with character instead of a golden turd.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-23T16:09:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EI don\u0027t think that a serious appraisal of their business policy would actually derive a result of of EA being objectively the worst company in America but you also have to consider the sector of the market that they operate in. EA are involved in a business venture where the consumer base are relatively tech-savvy and social media enabled, if you irritate the consumer base, these are the kinds of responses that you will get.\u003Cp\u003ERegardless, the relative value of the decisions that EA has made is largely irrelevant. They are worthy of criticism and are certainly the prime example of a company within their sector of the market that is widely disliked and are, as such, open to heavy criticism from anyone with an interest in computer gaming. I\u0027m sure that other demographics dislike other companies a great deal more.\u003C/p\u003E\u003Cp\u003EFinally, making money and providing a good consumer experience are not mutually exclusive. Annoying your consumers and squeezing your workforce might be one way of making money but ultimately probably not a very effective one. I may not entirely understand the appeal of many Apple products, for example, but never have I seen them evoke such anger amongst their consumer base as EA regularly manages, they would not be where they are today if they did.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, but look at the comments, it isn\u0027t criticism, it is out rate hate and immaturity at it\u0027s best.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-23T16:16:51Z","Content":"\n\u003Cp\u003EDoes anyone actually think that letter is real?\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-23T16:21:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EDoes anyone actually think that letter is real?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t think so, though EA has written something similar in an article. To me it also isn\u0027t far from the truth. While EA may not have had some of the best practices, it\u0027s stupid that people over react and rate it worst company in America.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-07-23T16:38:25Z","Content":"\n\u003Cp\u003ESo much random hate for EA when they aren\u0027t even the worst video game company out there, nor are they personally responsible for half the reasons people hate them.\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-07-23T16:43:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003EDon\u0027t think so, though EA has written something similar in an article. To me it also isn\u0027t far from the truth. While EA may not have had some of the best practices, it\u0027s stupid that people over react and rate it worst company in America.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t have the exact quote, but Totalbiscuit said something like:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere\u0027s no way in hell that EA is worse than BP.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Killerdude8","CreatedById":73130,"CreatedDateTime":"2013-07-23T17:09:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003ESo much random hate for EA when they aren\u0027t even the worst video game company out there, nor are they personally responsible for half the reasons people hate them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you name a Company worse than EA?\u003C/p\u003E\u003Cp\u003EThe only one I know that can even come close is THQ, and they\u0027re gone now.\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-07-23T18:04:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Killerdude8\u0022 data-cite=\u0022Killerdude8\u0022\u003E\u003Cdiv\u003ECan you name a Company worse than EA?\u003Cp\u003EThe only one I know that can even come close is THQ, and they\u0027re gone now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s plenty worse. BP and Bank Of America, for example. They just catch the most hate because the voters live on the internet. Gamers tend to live on the internet too.\u003C/p\u003E\u003Cp\u003EGoing back to the \u0022they just want to make a profit by appealing to a broader audience\u0022 thing; that could be another reason why people hate EA, or more for what they represent. Do you understand the significance of \u0022appealing to a broader audience\u0022? \u0022We did it to make the game appeal to the broader audience\u0022 is the polar opposite of \u0022We did it because we felt that it would make the game more fun\u0022. If someone\u0027s trying to appeal to the broader audience, they don\u0027t care if you enjoy their game or not, they just want to sell as many copies as possible. Just a cold impersonal business practice. Sadly it looks like it\u0027s becoming really common these days.\u003C/p\u003E\n"},{"CreatedByName":"benjiful9000","CreatedById":38135,"CreatedDateTime":"2013-07-23T18:09:55Z","Content":"\n\u003Cp\u003E\u0022Great work Dave, you\u0027ve reached 69,000 feet! Continue into space for only Ã‚Â£5! We have more offers...\u003C/p\u003E\u003Cp\u003E- Explore Kerbin\u0027s moons for Ã‚Â£3!\u003C/p\u003E\u003Cp\u003E- Explore other planets for Ã‚Â£8!\u003C/p\u003E\u003Cp\u003E- Upgrade to 2m parts for Ã‚Â£25!\u0022\u003C/p\u003E\u003Cp\u003E\u0022But EA, I want to do all this without paying!\u0022\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m sorry Dave. I\u0027m afraid I can\u0027t let you do that...\u0022\u003C/p\u003E\u003Cp\u003EAnd I did not just write that whole thing for the 2001 joke. At all.\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-07-23T21:23:56Z","Content":"\n\u003Cp\u003EWhat would happen...\u003C/p\u003E\u003Cp\u003EFor starters, EA would probably lace KSP with Toxins (SecuROM), fill it with un-necessary Paid DLC Packs, and use DRM grenades on it. It would also force you to be online, use multiplayer, add weapons, aliens, etc.\u003C/p\u003E\u003Cp\u003EI would probably enter a level of rage equivalent to that of the destructive force of every type of natural disaster, along with many other people, and (although unlikely) start a riot outside of EA\u0027s many offices.\u003C/p\u003E\u003Cp\u003EI\u0027d personally spare the companies which EA bought. I\u0027d probably liberate them.\u003C/p\u003E\n"},{"CreatedByName":"bones2oo21","CreatedById":75342,"CreatedDateTime":"2013-07-23T22:10:28Z","Content":"\n\u003Cp\u003EEA upgrading the name of a game by one while reusing the same engine, gfx, and other components of the previous title while charging another 60 dollars to play it. AKA Battlefield 3 to Battlefield 4 . Also should i mention the required usage of there partner game client Origin which has lost my bf3 account 10 times to Russians. Origin doesn\u0027t offer any way to lock down a account to prevent email or personal info from being changed also they refused to tell the email address that my account kept getting changed to. Sorry if i don\u0027t find EA to be a model game company. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E I find that this would be a horrible idea and hope the current DEVs keep it and keep working to make this an even better gaming experience.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-23T22:11:27Z","Content":"\n\u003Cp\u003EGrraaah! I takes this thread with my teeths and I bite it and shake it until it is pieces!\u003C/p\u003E\n"},{"CreatedByName":"Mode7","CreatedById":40585,"CreatedDateTime":"2013-07-23T22:17:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sapphire\u0022 data-cite=\u0022Sapphire\u0022\u003E\u003Cdiv\u003E\u0022Pay $5 to instantly refuel your craft anywhere!\u0022\u003Cp\u003E\u0022Resource system, day-one DLC!\u0022\u003C/p\u003E\u003Cp\u003EOn the bright side, we\u0027d at least get multiplayer. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy is anyone even posting in this thread after this guy knocked it out of the ballpark?\u003C/p\u003E\n"},{"CreatedByName":"AntonioAJC","CreatedById":16486,"CreatedDateTime":"2013-07-23T22:48:41Z","Content":"\n\u003Cp\u003EThey would remove the orbital mechanics and you actually have to keep the engine on to thrust one place to another. Of course, this would be an incentive to buy fuel with actual money so you can at least get to Mun.\u003C/p\u003E\n"},{"CreatedByName":"Audiopulse","CreatedById":8838,"CreatedDateTime":"2013-07-24T00:47:58Z","Content":"\n\u003Cp\u003EWhat would happen ... Id say Sales drop down to a third and piracy increases.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2013-07-24T07:09:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntonioAJC\u0022 data-cite=\u0022AntonioAJC\u0022\u003E\u003Cdiv\u003EThey would remove the orbital mechanics and you actually have to keep the engine on to thrust one place to another. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. Scale of solar system would be ruined. Distances would be lower compared to planet\u0027s sizes and there would be no gravity but some kind of friction in space. And you should dodge asteroids, avoid some kind of magic gravity anomalies, collect points and maybe shoot alien\u0027s ships all the time. Actually I hope that this is too nerdy game so that this will never be too popular. Because in such case it would eventually be sold to some large company which removes all the mathematical rocket science from game to increase sells.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-07-24T10:51:41Z","Content":"\n\u003Cp\u003EI will probably never buy another ea game, but before this goes anywhere, I like some ea games, I\u0027ve enjoyed wing commander, simcity ( not the new one) the sims at a core is good, I like bioware\u0027s olde rstuff, baldur\u0027s gate, the original mass effect, and such, and yes the sims is okay. \u003C/p\u003E\u003Cp\u003EBut Extruding Arsehole\u0027s drm shenanigans, mass-market appeal for maximum profits would knacker this game.\u003C/p\u003E\u003Cp\u003EAnd expel all (your money) are charging 55 F*** POUNDS over in Britain, which means that I will be not playing any new ea games.\u003C/p\u003E\u003Cp\u003EI don\u0027t have that sort of money for video games.\u003C/p\u003E\n"},{"CreatedByName":"frash23","CreatedById":69988,"CreatedDateTime":"2013-07-24T13:36:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jdsutton\u0022 data-cite=\u0022jdsutton\u0022\u003E\u003Cdiv\u003EIf anything bad happens to KSP, I\u0027ll lead a team of rebel programmers to sneakily acquire the Unity file and continue development in secret.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould i be a co-leader?\u003C/p\u003E\n"},{"CreatedByName":"Killerdude8","CreatedById":73130,"CreatedDateTime":"2013-07-25T06:51:39Z","Content":"\n\u003Cp\u003EAs long as Rockstar is still around, they\u0027re the shining example of a company doing it right.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2014-02-11T04:54:36Z","Content":"\n\u003Cp\u003ENecro Thread, closed.\u003C/p\u003E\n"}]}