{"TopicId":38174,"ForumId":44,"TopicTitle":"Deja Vu","CreatedByName":"Buzzkil88","CreatedById":62134,"CreatedDateTime":"2013-07-22T15:09:34Z","PageNum":1,"Articles":[{"CreatedByName":"Buzzkil88","CreatedById":62134,"CreatedDateTime":"2013-07-22T15:09:34Z","Content":"\n\u003Cp\u003EAnother thread in the Science Labs got me started on Deja Vu.... this was my reply on that thread. \u003C/p\u003E\u003Cp\u003EHave you ever had deja vu? its very strange, and anyone who has had deja vu will swear up and down that they remember the particular event like it already happpened. In the Matrix it is a glitch in the program (which causes Neo to see the black cat twice and he thought it was deja vu). Which makes more sense than the current explanation.... which is \u0022idk\u0022... How can anyone explain it? Deja Vu seems so real, just like a memory of anything else. But we all know that it never happened before. \u003C/p\u003E\u003Cp\u003E Maybe we all have a destiny and we are just along for the ride, and deja vu is just a quick glimpse of whats to come... maybe we are in a program and its a glitch... maybe the human brain is the most complex system of atoms we will ever know of and it will never be fully explainable. What do you think?\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-22T16:17:42Z","Content":"\n\u003Cp\u003EI didn\u0027t want to hijack there, lol. This is massively laymanified:\u003C/p\u003E\u003Cp\u003EGeneral consensus is usually that an unknown situation stimulates a neural path associated to a known situation. Rather than freak out and go nuts your brain simply stuffs the unknown situation in the back there somewhere with the rest, and you end up with the sensation that it already happened before instead of right then.\u003C/p\u003E\u003Cp\u003EAs was said in the other thread, our brains are not as reliable as they might seem, and we certainly have very limited control over function. I mean, yes, we can walk, and think, but try to tell your lunch when to digest, or your heart when to beat. Our brain can easily convince us of things that aren\u0027t really there, as well as prevent our perception of things that are. Consciousness is pretty much kicked back riding around on autopilot.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-07-22T16:52:29Z","Content":"\n\u003Cp\u003EOnce you realize that your own brain is CONSTANTLY lying to you, life gets very interesting.\u003C/p\u003E\u003Cp\u003EOur perception of reality is so filtered, People asked to count bounces from a group of basketball players never see the gorilla walking thru the video, change blindness can hide really big things, optical illusions, etc.\u003C/p\u003E\u003Cp\u003EIt\u0027s all really fun to think about how much we imagine the world we live in.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-22T17:15:45Z","Content":"\n\u003Cp\u003EIt is also curious that the conscious mind allows you to imagine anything you want, but then forcibly restricts us to experience the same general reality... Without losing the ability to manifest \u0022imaginary\u0022 emotions into a physical form (Yeah, I like Goswami, lol). Now if only I could figure out how to do that with $10,000,000.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2013-07-23T04:03:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022\\\u0022\u003E\u003Cp\u003Ehttp://science.howstuffworks.com/science-vs-myth/extrasensory-perceptions/deja-vu4.htm)\u0022 data-cite=\u0022\\\u0022(Quote from HowStuffWorks: \u003C/p\u003E\u003Ca href=\u0022http://science.howstuffworks.com/science-vs-myth/extrasensory-perceptions/deja-vu4.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://science.howstuffworks.com/science-vs-myth/extrasensory-perceptions/deja-vu4.htm\u003C/a\u003E\u003Cp\u003E)\u0022\u0026gt;\u003C/p\u003E\u003Cdiv\u003EAnother theory is based on the way our brain processes new information and how it stores long- and short-term memories. Robert Efron tested an idea at the Veterans Hospital in Boston in 1963 that stands as a valid theory today. He proposed that a delayed neurological response causes dÃƒÂ©jÃƒÂ  vu. Because information enters the processing centers of the brain via more than one path, it is possible that occasionally that blending of information might not synchronize correctly.\u003Cp\u003EEfron found that the temporal lobe of the brain\u0027s left hemisphere is responsible for sorting incoming information. He also found that the temporal lobe receives this incoming information twice with a slight (milliseconds-long) delay between transmissions -- once directly and once again after its detour through the right hemisphere of the brain. If that second transmission is delayed slightly longer, then the brain might put the wrong timestamp on that bit of information and register it as a previous memory because it had already been processed. That could explain the sudden sense of familiarity.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe brain processes things multiple times, very quickly in different parts of the brain. Sometimes these don\u0027t get synced up and you experience the moment multiple times, making you think it\u0027s happened before (because you \u003Cem\u003Edid\u003C/em\u003E experience it before, only milliseconds ago.\u003C/p\u003E\n"}]}