{"TopicId":3844,"ForumId":16,"TopicTitle":"Some questions of mine.","CreatedByName":"Eddy","CreatedById":11103,"CreatedDateTime":"2011-11-13T22:07:39Z","PageNum":1,"Articles":[{"CreatedByName":"Eddy","CreatedById":11103,"CreatedDateTime":"2011-11-13T22:07:39Z","Content":"\n\u003Cp\u003EOk I have a few of things I need to figure out how to tweak on my spaceship designs.\u003C/p\u003E\u003Cp\u003E1. Sometimes when I build a larger ship the parts all start to wobble and sometimes they break off and crash into the ship itself, thus destroying it.\u003C/p\u003E\u003Cp\u003E2. How am I supposed to build a ship that has a smooth control to it? Most of the ships I build wobble slightly as I go into orbit and I can\\\u0027t maintain the right heading (e.g. going east to get to the mun)\u003C/p\u003E\u003Cp\u003E3. How much is really needed? The addons that I used have ridiculously big fuel tanks etc, and sometimes when I build a large ship it just doesn\\\u0027t work out. \u003C/p\u003E\u003Cp\u003EIf anyone could help me I would greatly appreciate it.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2011-11-13T22:19:18Z","Content":"\n\u003Cp\u003E1. Appropriately placed struts, and/or parts with large connection strengths help. Also, IIRC, HarvesteR is looking into redoing joints.\u003C/p\u003E\u003Cp\u003E2. Tuned ASAS may help.\u003C/p\u003E\u003Cp\u003E3. Very little, especially if you\\\u0027re not lofting giant payloads. Many problems that people try to solve with extra boosters and/or stages can be better solved with slightly more tankage.\u003C/p\u003E\n"},{"CreatedByName":"PeriapsisPrograde","CreatedById":33,"CreatedDateTime":"2011-11-14T01:02:53Z","Content":"\n\u003Cp\u003EGeneral rule of thumb: your rockets should be longer as opposed to wider. Adding boosters adds drag and (this is the bigger one) reduces delta v from the other engines firing in the same stage. That means that there is a maximum efficiency per stage, period, no ifs ands or buts. Adding a fuel tank is usually better than adding more boosters. (This goes against lots said on the forum, but that is more joking than real advice). You should only add boosters to the very bottom stages of your rocket, and only if they are needed to get the thing off the ground.\u003C/p\u003E\u003Cp\u003ETL;DR? Your rocket should be thin at the top and bloated at the bottom.\u003C/p\u003E\n"},{"CreatedByName":"SmiteZero","CreatedById":10862,"CreatedDateTime":"2011-11-14T02:17:47Z","Content":"\n\u003Cp\u003EAs others say, not much is actually needed. Smaller is generally easier. Smaller means less weight to both support on the pad and loft, it means more control. More boosters means more fuel which means you need more boosters and fuel to loft the extra boosters and fuel, and so on it goes down the slipperly slope.\u003C/p\u003E\u003Cp\u003EAs an example, this is one of my vanilla very bog standard designs from a few versions ago. It\\\u0027s a solid workhorse and always performs wonderfully.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/19231999/K1.png\u0022 alt=\u0022K1.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ivan Ivanovich","CreatedById":8977,"CreatedDateTime":"2011-11-14T07:50:18Z","Content":"\n\u003Cp\u003EThe short answer: Struts, SAS and Wings.\u003C/p\u003E\u003Cp\u003EThe long answer:\u003C/p\u003E\u003Cp\u003EWhy the wobbling?\u003C/p\u003E\u003Cp\u003EBecause your rocket is not stable. It\\\u0027s not \u0027stiff\u0027 enough, and what\\\u0027s not stiff tends to oscillate. Due to the laws of physics, the longer your rocket gets, the higher the leverage of the point of action (the engine) vs. the center of gravity. And that wobbling gets worse with more thrust. To counter this, you can attach struts to your rocket. Especially between different, horizontally connected parts (like boosters or multiple legs, e.g. when using tri-couplers) they can make a huge difference, both connected to the main trunk in the middle as well as connected to each other.\u003C/p\u003E\u003Cp\u003EWhy the lack of control?\u003C/p\u003E\u003Cp\u003EBecause your rocket is long. The longer the rocket gets, the harder it is to pitch and tilt. The wider the rocket gets, the harder it is to roll it. You can counter this by using wings to get more control over your rocket (for the price of more drag). Wings are not the magical solution for everything, and they won\\\u0027t let a rocket the size of a Saturn V handle like a tiny suborbital hopper, but they will keep the rocket manageable.\u003C/p\u003E\u003Cp\u003EWhy the spinning and out of control behaviour?\u003C/p\u003E\u003Cp\u003EBecause of the lack of SAS. SAS is what allows your auto pilot to work. The heavier the rocket, the more SAS you should be using. Think of it as a gyroscope to keep your rocket upright.\u003C/p\u003E\u003Cp\u003EAlso, a lot of the addon parts have their center of gravity off center. By juuuust a tiny little bit, but given the forces we deal with here, a tiny little bit already has a lot of impact. I would recommend trying to stick with stock parts as much as you can, I usually just replace the rather weak stock boosters with something with more oumph.\u003C/p\u003E\n"},{"CreatedByName":"SmiteZero","CreatedById":10862,"CreatedDateTime":"2011-11-14T13:36:27Z","Content":"\n\u003Cp\u003EOh, has H. replaced the botched tricoupler in the standard install with his re-done symmetrical one? Does anyone know?\u003C/p\u003E\u003Cp\u003EIf not I HIGHLY recommend you download the re-made part from the space repository.\u003C/p\u003E\n"},{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2011-11-14T15:33:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmiteZero\u0022 data-cite=\u0022SmiteZero\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOh, has H. replaced the botched tricoupler in the standard install with his re-done symmetrical one? Does anyone know?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIDK, but I almost always flew rockets with three-tube core stages, and they always handled very smoothly provided that the \u0027tubes\u0027 are bound with struts near to the engines. Since the introduction of gimbals, I don\\\u0027t even use winglets or SAS, just a single ASAS in the upper stage (and RCS for coasting phases).\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2011-11-15T00:11:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmiteZero\u0022 data-cite=\u0022SmiteZero\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOh, has H. replaced the botched tricoupler in the standard install with his re-done symmetrical one? Does anyone know?\u003C/p\u003E\u003Cp\u003EIf not I HIGHLY recommend you download the re-made part from the space repository.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThe Tricoupler is still subtly asymmetrical. ASAS and a bit of control authority are enough to counteract it, at least...\n"},{"CreatedByName":"SmiteZero","CreatedById":10862,"CreatedDateTime":"2011-11-15T00:38:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe Tricoupler is still subtly asymmetrical. ASAS and a bit of control authority are enough to counteract it, at least...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh good! It\\\u0027s not just me that noticed it!\u003C/p\u003E\n"},{"CreatedByName":"Luigibro606","CreatedById":8700,"CreatedDateTime":"2011-11-15T02:01:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eddy\u0022 data-cite=\u0022Eddy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2. How am I supposed to build a ship that has a smooth control to it? Most of the ships I build wobble slightly as I go into orbit and I can\\\u0027t maintain the right heading (e.g. going east to get to the mun)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have this problem a lot too, usually solve it though. For a rocket that\\\u0027ll definitely get you into orbit and maybe even a one way Munar landing, use this pack-\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=3684.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=3684.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Intrepid Ares I is very smooth flying. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}