{"TopicId":38532,"ForumId":32,"TopicTitle":"Come back old ASAS - all is forgiven!","CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2013-07-24T19:29:23Z","PageNum":9,"Articles":[{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-07-25T01:02:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EFor the umpteenth time, there is plenty of torque available (gimbals, reaction wheels, even RCS is I turn it on). It takes the tiniest manual adjustment to hold a heading. SAS simply isn\u0027t using it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree to a point. It will use all of the force available, but you\u0027re pretty much out of control by that time. I tested ASAS using RCS on one of my station pieces in orbit by spinning it and turning on ASAS with RCS on. When spinning at a rate that most of us would use for orbital maneuvers, ASAS never appeared to use RCS, and the force indicators (roll, pitch, and yaw in lower left screen) would barely move. However, if I held down D and got it spinning about as fast as I think it would go, then turn on ASAS, the yaw indicator would move all the way left and it would use RCS to stop the spin.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-25T01:03:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EFor the umpteenth time, there is plenty of torque available (gimbals, reaction wheels, even RCS is I turn it on). It takes the tiniest manual adjustment to hold a heading. SAS simply isn\u0027t using it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis.\u003C/p\u003E\u003Cp\u003EWhat is the point of SAS if not to hold heading? If it won\u0027t use the tools available what is the point of even turning it on?\u003C/p\u003E\n"},{"CreatedByName":"roosterr","CreatedById":61317,"CreatedDateTime":"2013-07-25T01:05:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSylvester\u0022 data-cite=\u0022SpaceSylvester\u0022\u003E\u003Cdiv\u003EHave you guys just been hitting the T key to lock in place? That will only dampen control forces - look in the control list. You have to now hit F to have the SAS lock on a certain bearing. Its been working perfectly for me. You hit F to lock the bearing with SAS on, then if you turn, the lock disengages, but SAS still keeps the other axis neutral if you\u0027re moving just one. Once you have a new heading, hit F again.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am at work right now (ssshhhhhhhh....) and dont have my KSP in front of me. But has anyone of you having problems confirmed this to be a solution to your problem? If so, this could end this discussion.\u003C/p\u003E\n"},{"CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2013-07-25T01:08:40Z","Content":"\n\u003Cp\u003EHmm, this is all pretty interesting feedback. We tested innumerable designs during Testing and the SAS was refined an immense number of times. Could folks that are having issues with the SAS, where it doesn\u0027t even attempt to hold the heading, provide a video of it? That would be a massive help to us. Thanks.\u003C/p\u003E\u003Cp\u003EPlease note that a stock install and new save file for 0.21 is highly recommended for severe issues.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T01:18:55Z\u0022 title=\u002207/25/2013 01:18  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by Ted\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"asae","CreatedById":65680,"CreatedDateTime":"2013-07-25T01:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThis.\u003Cp\u003EWhat is the point of SAS if not to hold heading? If it won\u0027t use the tools available what is the point of even turning it on?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe point of SAS is NOT to hold heading, it\u0027s a stability system, it\u0027s to aid manual flying not to make you point in just one direction, that\u0027s what an autopilot does, and before people go off on me, yes that\u0027s what an autopilot is meant to do, maintain heading.\u003C/p\u003E\n"},{"CreatedByName":"Murmur","CreatedById":20688,"CreatedDateTime":"2013-07-25T01:13:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ted\u0022 data-cite=\u0022Ted\u0022\u003E\u003Cdiv\u003EHmm, this is all pretty interesting feedback. We tested innumerable designs during Testing and the SAS was refined an immense number of times. Could folks that are having issues with the SAS, where it doesn\u0027t even attempt to hold the heading, provide a video of it? That would be a massive help to us. Thanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy problem is that the SAS is \u003Cem\u003Eattempting\u003C/em\u003E to hold the heading, but it\u0027s not using enough force to do it. As in, if I watch my pitch, roll, and yaw indicators they only move a little tiny bit. Once the craft is pointing far enough away from the initial position, more force is applied, but still not enough.\u003C/p\u003E\u003Cp\u003EEDIT: Is this by design? I mean, it IS still affecting the craft. If I turn the SAS off, the craft will lose control. So is the new SAS not designed to hold a heading like before?\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-07-25T01:14:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ted\u0022 data-cite=\u0022Ted\u0022\u003E\u003Cdiv\u003EHmm, this is all pretty interesting feedback. We tested innumerable designs during Testing and the SAS was refined an immense number of times. Could folks that are having issues with the SAS, where it doesn\u0027t even attempt to hold the heading, provide a video of it? That would be a massive help to us. Thanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInsanely late here, I\u0027ll run one off tomorrow (the more people the better) My Moho Redstone might be a good example, very small, simple rocket but ASAS wont keep it straight for more than a hundred feet before it begins to pitch... and maybe my gemini which wobbles like crazy now for the first 20km\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-25T01:16:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EFor the umpteenth time, there is plenty of torque available (gimbals, reaction wheels, even RCS is I turn it on). It takes the tiniest manual adjustment to hold a heading. SAS simply isn\u0027t using it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I just said. The SAS is being a lot gentler to prevent flipping out or wobble. The problem comes when you need it to really put some force down and use what you\u0027ve given it. IT won\u0027t do it. It has been configured not to bite so it just isn\u0027t applying much (by not much I mean hardly any) of the force you\u0027ve provided it.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-07-25T01:16:30Z","Content":"\n\u003Cp\u003EI have asas,sas,a mk 1 cockpit,4 probes...and it still went off course by about 20 degrees in about 30 seconds.If only there was a way to toggle between versions as the new asas is love/hate.\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-07-25T01:16:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asae\u0022 data-cite=\u0022asae\u0022\u003E\u003Cdiv\u003EThe point of SAS is NOT to hold heading, it\u0027s a stability system, it\u0027s to aid manual flying not to make you point in just one direction, that\u0027s what an autopilot does, and before people go off on me, yes that\u0027s what an autopilot is meant to do, maintain heading.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut why in hell would Squad think we wanted that feature removed? removing a function is downgrade not an update.... or are we really supposed to get excited that KSP no longer does something?\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2013-07-25T01:17:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EGuys, the SAS systems have gotten a massive rollback on aggressiveness, mainly because it was burning through RCS fuel and snapping ships in half. But this means it doesn\u0027t bite like it used to. It can holld a heading (if enough control surfaces and/or torque) but it won\u0027t snap to a point and rigidly not move whether you fight it or not. For lack of a better description, the new SAS is lazier than yall are used to. This is great for preventing rotation in orbit but in atmosphere, it does need to be more aggressive with the initial application of force.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah. Prefer it if it snapped the ship in half to not doing anything till I reach 10 km and up. Just got finished putting a probe up. with just One S.A.S. and A.S.A.S.. Add to keep my speed down around 30 m/s just to be able to manually fly it as with S.A.S. engaged it was fighting me to much or if not using it might as well say I never added it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/1119427776392993154/5DD19A9346A908D576EA352FA7C38A725B927774/\u0022 alt=\u00225DD19A9346A908D576EA352FA7C38A725B927774\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-07-25T01:17:33Z","Content":"\n\u003Cp\u003EI have to admit, I don\u0027t even know where to start to record a video.\u003C/p\u003E\u003Cp\u003EOTOH, I think the only fix for what we\u0027re seeing is a compromise. Dial up the ASAS a bit, but not to where it was. Meet in the middle so to speak. However, I have no idea what other problems that may create.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2013-07-25T01:18:03Z","Content":"\n\u003Cp\u003EI\u0027m rendering a video now, it has some failures and some successes, the first time SAS worked so far.\u003C/p\u003E\u003Cp\u003EEdit: Here\u0027s the video:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/94ZweJFTygI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T01:26:51Z\u0022 title=\u002207/25/2013 01:26  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by dharak1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"asae","CreatedById":65680,"CreatedDateTime":"2013-07-25T01:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mulbin\u0022 data-cite=\u0022Mulbin\u0022\u003E\u003Cdiv\u003EBut why in hell would Squad think we wanted that feature removed? removing a function is downgrade not an update.... or are we really supposed to get excited that KSP no longer does something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI respect you greatly there mulbin with your creations but Squad did what they thought was best, fixing the actually buggy \u0027point here and get stuck or ripped apart\u0027 ASAS with something that is closer to what it should have been. This is what they invisioned to begin with, we just got used to the bad implimentation.\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-07-25T01:20:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003Eyou need it to really put some force down and use what you\u0027ve given it. IT won\u0027t do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen it\u0027s a pointless part. I either have the option of flying completely manually... or adding a heavy part that allows me to continue flying completely manually. Nice bit of kit...\u003C/p\u003E\n"},{"CreatedByName":"Nimaci","CreatedById":57635,"CreatedDateTime":"2013-07-25T01:21:37Z","Content":"\n\u003Cp\u003EOddly, when I switch ASAS off on my lander it starts to tumble (with increasing speed), in a vacuum, without any input.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-25T01:22:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mulbin\u0022 data-cite=\u0022Mulbin\u0022\u003E\u003Cdiv\u003EBut why in hell would Squad think we wanted that feature removed? removing a function is downgrade not an update.... or are we really supposed to get excited that KSP no longer does something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would be saying \u0022Hell yeah! Take that, game maker!\u0022 But in all reality, it\u0027s their game. And I\u0027ve learned over the years of multiple games, that if the devs do something that upsets people but makes others praise them (like this), there\u0027s nothing really you can do about it except play another game.\u003C/p\u003E\u003Cp\u003EI seriously doubt they did this to piss people off. I mean, think about it, this game, like Minecraft was, is the first of its kind. There\u0027s always going to be awesome things that are added, and some awesome things will break (or in this case, stop working to make it the way the devs wanted it to be). That\u0027s how development works.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-25T01:22:38Z","Content":"\n\u003Cp\u003EI do think it does need some more bite I mean now it is useless. The goal of SAS is that it holds an orientation so you can sit back for a moment but if it can\u0027t hold jack****, what\u0027s the point? Then you have to manually override it and you might as well just to full manual flight and that gets tedious after a while \u0026lt;insert_mechjeb\u0026gt; Oh wait, mechjeb is busted! Just like Ferram! Squad, cut R4m0n a day off so he can fix FAR for us!\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2013-07-25T01:22:47Z","Content":"\n\u003Cp\u003EAre you using a joystick? If so, make sure to add deadzone.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-25T01:23:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asae\u0022 data-cite=\u0022asae\u0022\u003E\u003Cdiv\u003EThe point of SAS is NOT to hold heading, it\u0027s a stability system, it\u0027s to aid manual flying not to make you point in just one direction, that\u0027s what an autopilot does, and before people go off on me, yes that\u0027s what an autopilot is meant to do, maintain heading.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould you explain to me what a stability system is supposed to do on a rocket to aid manual flight?\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-07-25T01:23:55Z","Content":"\n\u003Cp\u003EI cannot provide a video, I can only talk about what I\u0027ve seen. Originally I thought the system might just take some getting used to but it appears to fight you. During takeoff it has this habit of pitching over, not completely mind you, just veering off straight up and down until about ten or eleven kilometers. In space it feels more manageable but overall I\u0027m fighting with it a lot. It cancels out minute adjustments, so I spend a lot of time correcting. It also seems to drift slowly, in that it\u0027s apparently far from cancelling out all motion but perhaps I just do not have sufficient torque. It refuses to hold a heading, even if I put a kaibosh on it manually then engage, it just doesn\u0027t seem to be able to reduce drift to zero.\u003C/p\u003E\u003Cp\u003EI\u0027ve flown a successful stock mission to the Mun, landing, takeoff and safe return using the new system so I know it\u0027s manageable, it\u0027s just FAR more hands-on than the previous. I think it\u0027s a combination of being completely different and needing tuning that makes it difficult to use. ASAS previously was an end all solution to bad piloting, the new system is clearly an assistant (turn it off, I ASSURE you it does something). I can see why there would be a lot of contention over a changed feature that, well, makes the game more difficult than it was. I personally see good things in the future, but I\u0027m certain tweaks will be incoming.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T01:30:03Z\u0022 title=\u002207/25/2013 01:30  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by Hyomoto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-07-25T01:25:05Z","Content":"\n\u003Cp\u003EI\u0027ve turned it off... it\u0027s more stable now and the rocket stopped wobbling....\u003C/p\u003E\n"},{"CreatedByName":"mtsp","CreatedById":66657,"CreatedDateTime":"2013-07-25T01:27:03Z","Content":"\n\u003Cp\u003EReally disappointed with the new ASAS. Please please please add an option to use the old ASAS....please!\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-07-25T01:30:34Z","Content":"\n\u003Cp\u003EThe thing is you can build a ship which withstands the shaking of the old ASAS but you can\u0060t build around ASAS which lets itself to tour around the nav-ball.\u003C/p\u003E\n"},{"CreatedByName":"Nimaci","CreatedById":57635,"CreatedDateTime":"2013-07-25T01:31:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Caelib\u0022 data-cite=\u0022Caelib\u0022\u003E\u003Cdiv\u003EAre you using a joystick? If so, make sure to add deadzone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo joystick, and no trim.\u003C/p\u003E\u003Cp\u003EI went back to space centre then reloaded the flight, and the phantom input is now gone.\u003C/p\u003E\n"}]}