{"TopicId":38532,"ForumId":32,"TopicTitle":"Come back old ASAS - all is forgiven!","CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2013-07-24T19:29:23Z","PageNum":12,"Articles":[{"CreatedByName":"Nodrak","CreatedById":69231,"CreatedDateTime":"2013-07-25T03:50:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022carazvan\u0022 data-cite=\u0022carazvan\u0022\u003E\u003Cdiv\u003EOk after much testing for me at least I think I have identified the 3 key issues that current 0.21 ASAS has:\u003Cp\u003E\u003Cstrong\u003EProblems\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1) After setting a course ASAS doesn\u0027t always hold it if it\u0027s not level flight -\u003Cem\u003Eit seems like the ASAS is just a little too slow to react\u003C/em\u003E \u003C/p\u003E\u003Cp\u003E2) Manually inputing direction to ASAS turn both other control directions to 0* - \u003Cem\u003Ethis is likely a bug since it was stated that new ASAS shouldn\u0027t interfere with the other axes you were not touching\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E3) After manual input to a direction in ASAS control moves it to 0 then slowly tries to move it back to a direction to counter - \u003Cem\u003Ethis is especially bad for trying to do gravity turns or pitch adjustments to precise locations\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESolutions\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1) After looking at the imputs I think a 2x adjustment to the input it provides should be enough to stop this from showing up and it shouldn\u0027t make for a huge change to fuel use\u003C/p\u003E\u003Cp\u003E2) Do what was said where only the axis you touch get changed others keep under ASAS control\u003C/p\u003E\u003Cp\u003E3) The 0.20 system isn\u0027t great here either to where the needle moves like crazy around the direction once you let go (wobble cause most likely) but maybe instead of starting with 0* as the default search for the ASAS start with the last position of the control input.\u003C/p\u003E\u003Cp\u003EAnd an album to show off how problems can arise ... didn\u0027t mean for it to be night/day between 0.21 and 0.20 but it does work nicely ... look at the bottom left control surfaces input and at the bottom center for the navball:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are trying to compare .21 and .20 with those pictures, you should probably make sure they happen within the same magnitude of atmosphere... All this is showing is the obvious? Space plane in low atmo without RCS having slightly harder time controlling pitch in plane that wants to pitch down. AKA, you have less magic torque.\u003C/p\u003E\u003Cp\u003EI just flew to the moon with Kerbal X to test, works like a charm even though Kerbal X is tiny off balance. Only issue is SAS is slow to respond to manual input, as you noticed. Nothing crippling, and actually works exactly how the OLD ASAS did, you just expected it because its this T button you hit...\u003C/p\u003E\n"},{"CreatedByName":"Sathurn","CreatedById":58040,"CreatedDateTime":"2013-07-25T03:51:13Z","Content":"\n\u003Cp\u003EFirst impression of the new asas, not a clean install but with stock parts. Using a small orbitor\u003C/p\u003E\u003Cp\u003EI feels weird, I caught myself turn in on and off.\u003C/p\u003E\u003Cp\u003ETrilateral symmetry seems to introduce a spin when you try to change just one axis. Easily canceled out.\u003C/p\u003E\u003Cp\u003EASAS does not stop rotation very well, but does prevent unwanted rotation from starting just fine. So when you turn to a heading you must cancel the rotation manually.\u003C/p\u003E\u003Cp\u003EUsing intentionally out of balance rcs, Heading change 1-2 degrees during translations burns. Returned to proper heading when burn ceased.\u003C/p\u003E\u003Cp\u003EIt feels weird to me, but I like it.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-07-25T04:05:14Z","Content":"\n\u003Cp\u003EI\u0027ve been having various issues with the new SAS. However, I\u0027ve found that the old ASAS still exists. \u003Ca href=\u0022https://docs.google.com/file/d/0Bxef3KjILrVrdlVXeUV3cDBCUm8/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EAs such, I\u0027ve thrown together a part that brings it back\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThis version is tuned differently from 0.20.2\u0027s to reduce overshoot and jitter, but I\u0027ve included instructions if you dislike it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T05:52:07Z\u0022 title=\u002207/25/2013 05:52  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by UmbralRaptor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlternNocturn","CreatedById":17872,"CreatedDateTime":"2013-07-25T04:07:27Z","Content":"\n\u003Cp\u003EI\u0027m building a miniature space station in orbit around the Mun, and not once have I had a problem with the new SAS regardless of the fact that I\u0027m still getting used to it. I don\u0027t understand the complaints.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-07-25T04:09:47Z","Content":"\n\u003Cp\u003ESo far I have few complaints; most of the designs I tested that had trouble were probes that relied on the pod having gyros. Since they don\u0027t anymore, that\u0027s expected behaviour. I\u0027ll write those probes off and start anew.\u003C/p\u003E\u003Cp\u003EThe only design that perplexes me is the RATO I used to boost a solar glider in 0.20 now induces a consistent slow yaw to port that will plant the glider firmly into the VAB\u0027s door unless I jettison the RATO early. Since the RATO had no guidance logic or control surfaces, I guess this shouldn\u0027t surprise me; I\u0027ll do a quick redesign with some fins and see if the problem persists.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"EdisonTrent","CreatedById":41559,"CreatedDateTime":"2013-07-25T04:13:19Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/frj8dyqbvb2i0oh/_21%20SAS%20Test.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/frj8dyqbvb2i0oh/_21%20SAS%20Test.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is an example rocket.\u003C/p\u003E\u003Cp\u003EThe first stage it looks like the 4 fins are just not cutting it. Probably working as intended.\u003C/p\u003E\u003Cp\u003EThe second stage on the other hand, with 4 gimbaling engines has plenty of controlability when flown manually. If you fling the rocket a certain direction you can easily slow down the movement and correct it by imputing controls in the opposite direction. \u003C/p\u003E\u003Cp\u003EBut the SAS can\u0027t. It sluggishly does do it eventually when movement has slowed to a certain point (while rolling slightly) but clearly not as easily as manual correction. Maybe the SAS is not using gimbaling enough and is relying on capsule torque. \u003C/p\u003E\u003Cp\u003EBecause the last stage works wonderfully and if it was always like that then I think everyone in this thread would be happy.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-07-25T04:17:44Z","Content":"\n\u003Cp\u003EThe new ASAS works flawlessly for me. I have found that any failure of the ASAS to hold heading and pitch are due to design errors or unsustainable flight parameters. As for those who want the old ASAS back...I simply fail to understand it. It is an inferior system and the New ASAS-bugs and all-is an improvement upon the old one.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2013-07-25T04:22:02Z","Content":"\n\u003Cp\u003Ecurious if this is a clipping issue with people using vessels with lots of clipping.. Not to sure.. i used HalsFury Gemini 2.. And it works pretty dam near perfect.. Some of my other vessels I noticed a drift though.. But I combat it with turning on SAS and back on like the old days. Seems to work.\u003C/p\u003E\n"},{"CreatedByName":"Oxydin","CreatedById":75581,"CreatedDateTime":"2013-07-25T04:22:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EThis is a plane. It\u0027s got control surfaces and is a very stable aircraft. It also has reaction wheels because I pulled it over from 0.20 and its ASAS unit magically became reaction wheels.\u003Cp\u003EIt\u0027s doing \u003Cstrong\u003Esomething\u003C/strong\u003E when I turn it on, but that something isn\u0027t doing the job of holding a heading.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom what I\u0027ve heard, SQUAD have tried to facilitate earlier crafts, but have stated that some may not work. Maybe try a fresh build? I\u0027ve honestly not tested 0.21 yet (I\u0027m about to) so this is just speculation.\u003C/p\u003E\u003Cp\u003EI do find the posts about 0.21 abit ironic though. We have all shouted at squad for the last 3 weeks to release 0.21 and now that it\u0027s releasesd, we\u0027re complaining about it.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-25T04:34:41Z","Content":"\n\u003Cp\u003EWell this is weird, how do some people have working SASs and others not? I know, how about we all post pictures of the ships we are using to find out if there is a problem or not. Because I\u0027m convinced that there really is something wrong.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-25T04:36:06Z","Content":"\n\u003Cp\u003EFrom what I just read in a well-written tutorial (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/41941-New-SAS-functionality-and-You!\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E), ASAS is gone. We\u0027ve pretty much gone back in time before it even existed. It shouldn\u0027t even be called \u0022ASAS\u0022 anymore. \u003C/p\u003E\u003Cp\u003EReaction Wheels are realistic, but this is supposed to be a Sandbox game where you can do what \u003Cem\u003Eyou\u003C/em\u003E want. We\u0027ve all been used to ASAS doing the flying for us (in a sense). This is not a bug. I think this was an intended feature of what\u0027s to come in the future of this game. I just wish they could had explained better than \u0022ASAS holds your heading nomatter what you do! Fly cheat mode for our community! Woot!\u0022, causing hype for the beloved change. Even I was fooled by it (what I said is how I feel, going by a video I saw somewhere in this forum).\u003C/p\u003E\u003Cp\u003EI personally don\u0027t like hearing this when I saw this thread pop up, but I can\u0027t do anything about it. Whining and complaining to SQUAD isn\u0027t going to do any good. Yes, we could boycott, but what good would it do? As I said before, and I\u0027ll say again, this is their game.\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2013-07-25T04:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003EFrom what I just read in a well-written tutorial (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/41941-New-SAS-functionality-and-You!\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E), ASAS is gone. We\u0027ve pretty much gone back in time before it even existed. It shouldn\u0027t even be called \u0022ASAS\u0022 anymore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are reaction wheels, which will give you torque, and then there is the \u0022advanced stabilizer\u0022 which actually does the controlling for you like the ASAS did before. Or, at least it seems to do it for me.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-07-25T04:44:31Z","Content":"\n\u003Cp\u003EThis is such a confusing issue. First, raise your hand if you know what the letters S.A.S. stand for. It\u0027s stability augmentation system. What does it mean to augment stability? Usually such systems are effectively dampers designed to suppress unwanted oscillations and not autopilots. Historically KSP SAS \u0026amp; ASAS were exactly autopilots which instantly starts everyone off on the wrong foot in terms of expectations. We\u0027ve departed traditional vernacular at right angles already months ago.\u003C/p\u003E\u003Cp\u003EPrevious versions were a motley collection of controls, control channels, and controllers. \u0022SAS\u0022 parts were controllers only available to the control channel used by the \u0022T\u0022 SAS controller. The manual controller actuated all available controls except the SAS torque which was reserved for hands off input. The ASAS simply expanded the set of controls that the SAS controller had available to it beyond pod torque and the exclusive SAS wheel parts. To top off the confusion you could have multiple controllers in operation simultaneously with manual control channels operating one set of controls and the automatic SAS channel(s) operating a partially overlapping set. What a mess!\u003C/p\u003E\u003Cp\u003EIn any case all automatic inputs were effectively PID controlled. Things wobbled with any sort of automatic input because 1. the PID coefficients were terrible and 2. they were static.\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EWhat does the new system do? Surely it is a PID contoller as well. My fear is that despite making \u0022better coefficients\u0022 the PID factors are still static and thus unsuitable beyond some range of use cases. My hope would be that the PID coefficients would be autotuned if not outright fully configurable manually. Are the PID numbers autotuned or not?\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EUltimately the typical user will want both stability enhancement for maneuvers and autopilot functionality for non-maneuvers. Before we had A, it seems now we have B. Living without both available is going to be unsatisfactory.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T04:47:15Z\u0022 title=\u002207/25/2013 04:47  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by Frederf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nodrak","CreatedById":69231,"CreatedDateTime":"2013-07-25T04:51:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdisonTrent\u0022 data-cite=\u0022EdisonTrent\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://www.dropbox.com/s/frj8dyqbvb2i0oh/_21%20SAS%20Test.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/frj8dyqbvb2i0oh/_21%20SAS%20Test.craft\u003C/a\u003E\u003Cp\u003EHere is an example rocket.\u003C/p\u003E\u003Cp\u003EThe first stage it looks like the 4 fins are just not cutting it. Probably working as intended.\u003C/p\u003E\u003Cp\u003EThe second stage on the other hand, with 4 gimbaling engines has plenty of controlability when flown manually. If you fling the rocket a certain direction you can easily slow down the movement and correct it by imputing controls in the opposite direction. \u003C/p\u003E\u003Cp\u003EBut the SAS can\u0027t. It sluggishly does do it eventually when movement has slowed to a certain point (while rolling slightly) but clearly not as easily as manual correction. Maybe the SAS is not using gimbaling enough and is relying on capsule torque. \u003C/p\u003E\u003Cp\u003EBecause the last stage works wonderfully and if it was always like that then I think everyone in this thread would be happy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDownloaded, tested. Flew fine. First 2 stages have slight instability from their design (ie, old SAS would have destroyed that ship if it was heavier). I didn\u0027t turn with the SRB only stage, because well that\u0027s crazy, you would rely on your Pod Torque to counter drag. Fins on the end of a ship, (like an arrow) are for flying straight, not turning and maneuvering. Once you drop the Fins, all roll control is from your Torque, you added an inline which shows when you punch it in Stage 2, which would roll out of control in .20 ASAS no doubt.\u003C/p\u003E\u003Cp\u003EFor a craft that is basically 4 stilts with rockets on the end of them, the SAS did wonderful, far better than than it would have in .20\u003C/p\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2013-07-25T04:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EWell this is weird, how do some people have working SASs and others not? I know, how about we all post pictures of the ships we are using to find out if there is a problem or not. Because I\u0027m convinced that there really is something wrong.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow this is much more like it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also suspecting from all the reports that \u003Cem\u003Esomething\u003C/em\u003E, could be a mod, could be a bad settings file, could be old parts lingering about the KSP/Parts folder, might be interfering with normal SAS operation. \u003C/p\u003E\u003Cp\u003EThe new SAS might be a lot of things, but it most definitely isn\u0027t a thing that requires constant input to maintain attitude. It\u0027s been pretty consistently doing that on all the test cases we did here, and there were a lot of them. \u003C/p\u003E\u003Cp\u003EIf the SAS isn\u0027t holding attitude properly for you, then it very well may be in a buggy state, because that is certainly not the intended behaviour.\u003C/p\u003E\u003Cp\u003EFirst things first though, we need a proper baseline to compare different cases here. So how about we use the Aeris 3A spaceplane as a benchmark? It\u0027s easy to fly and it\u0027s got a few particular flight characteristics that are easy to spot.\u003C/p\u003E\u003Cp\u003ESo, the test is as follows.\u003C/p\u003E\u003Cp\u003E* Launch a new Aeris 3A from the runway, set it at full throttle and try to maintain level flight.\u003C/p\u003E\u003Cp\u003E* Do not adjust trim. On neutral trim, the 3A has a slight tendency to pitch down when the tanks are full. \u003C/p\u003E\u003Cp\u003E* Climb out to 1000m altitude and verify that it\u0027s doing that. Let go of the controls and make sure this tendency to drop the nose is there.\u003C/p\u003E\u003Cp\u003E* Ok, that\u0027s our control. If you\u0027ve observed anything else at this point, something is already wrong with your game and you should be doing a complete reinstall.\u003C/p\u003E\u003Cp\u003E* Now, let\u0027s test the SAS. From level flight, engage it with T and don\u0027t apply any input. Verify that it\u0027s maintaining attitude.\u003C/p\u003E\u003Cp\u003E* If that didn\u0027t happen, then something is wrong with your game. Reinstall.\u003C/p\u003E\u003Cp\u003E* Now, a few more tests. Apply some slight pitch up input without disengaging SAS. Pitch up to about 30Ã‚Â° and watch the aircraft maintain the new attitude.\u003C/p\u003E\u003Cp\u003E* If that didn\u0027t happen, then something is wrong with your game. Reinstall.\u003C/p\u003E\u003Cp\u003EIf you spotted something wrong by doing this test, please list all your mods if any, and check the KSP/Parts folder to see if there\u0027s anything in there (on a stock install it should be empty). Also, try deleting your settings.cfg file and running the game again. It\u0027s unlikely, but not impossible that a bad config would mess things up.\u003C/p\u003E\u003Cp\u003EThat should be enough to spot most cases where things are very obviously wrong. We can start with that for now.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"carazvan","CreatedById":73074,"CreatedDateTime":"2013-07-25T04:55:30Z","Content":"\n\u003Cp\u003EAdded a new set of pictures at a lower altitude ... some problems might be amplified at higher altitudes (here it actually looks like the opposite with the 45* climb being worse at lower altitude) ... but I will grant you the level to 20* seems to be a bit better .. maybe only 15* or so instead of 10*\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nodrak\u0022 data-cite=\u0022Nodrak\u0022\u003E\u003Cdiv\u003EIf you are trying to compare .21 and .20 with those pictures, you should probably make sure they happen within the same magnitude of atmosphere... All this is showing is the obvious? Space plane in low atmo without RCS having slightly harder time controlling pitch in plane that wants to pitch down. AKA, you have less magic torque.\u003Cp\u003EI just flew to the moon with Kerbal X to test, works like a charm even though Kerbal X is tiny off balance. Only issue is SAS is slow to respond to manual input, as you noticed. Nothing crippling, and actually works exactly how the OLD ASAS did, you just expected it because its this T button you hit...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Feldynn","CreatedById":64102,"CreatedDateTime":"2013-07-25T05:00:02Z","Content":"\n\u003Cp\u003EI think what I\u0027m seeing with the new SAS system is a general inconsistency across different craft, it seems like there are differing limits to how effective it is based on the size of the craft, amount of torque and thrust. For the first time ever I tried a few of the stock space planes, the bigger Ravenspear ones seemed generally to be the least likely to throw a fit I think because they had a decent thrust / weight / torque ratio. \u003C/p\u003E\u003Cp\u003EI tried the Aries 3A too and while it was a little twitchy to begin with but wasn\u0027t too bad once I got used to it (again, first time flyer here), it\u0027s still got a reasonably thrust / weight / torque ratio but is obviously a lot lighter so it can be twitchy and was sticking to it\u0027s course like glue once I stopped messing with it. I did manage to send it into a SASsy spin cycle / face plant a couple of times but that was mostly me turning too hard.\u003C/p\u003E\u003Cp\u003EI think the worst plane I tried was the Raven Mk1, not a huge plane but it has 3 engines (two turbo and one basic I think) which just seemed like too much and would cause the SASsy flippage a lot while trying to turn. Shutting down the central engine seemed to help somewhat, it would still wig out on occasion but it was much easier to control with just the 2 engines running.\u003C/p\u003E\u003Cp\u003ERockets are a bit different again but still show a similar kind of inconsistency, at certain stages they seem to hold course with SAS fairly well (I found landing on Mun MUCH easier with new SAS though it could have been a little more snappy about holding the course once I ceased control input) but at other times not so much and I\u0027d find I was making far too many manual corrections.\u003C/p\u003E\u003Cp\u003EWith the old ASAS it was a very singular system, if ON then you\u0027re on \u0022this\u0022 heading and that\u0027s the end of it for the most part and if OFF then you drift / spin around freely until you do something, I actually like the way the new system works when you find something it works well in but it just doesn\u0027t seem to have the consistency across a multitude of craft that the old system had and I think that\u0027s what\u0027s causing a lot of the distress right now.\u003C/p\u003E\n"},{"CreatedByName":"Naelo","CreatedById":14384,"CreatedDateTime":"2013-07-25T05:01:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003ENow this is much more like it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI\u0027m also suspecting from all the reports that \u003Cem\u003Esomething\u003C/em\u003E, could be a mod, could be a bad settings file, could be old parts lingering about the KSP/Parts folder, might be interfering with normal SAS operation. \u003C/p\u003E\u003Cp\u003E[snip]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Aeris 3A has a slight tendency to pitch up in my install. The ASAS takes ~5 seconds to lock into a new heading and doesn\u0027t really compensate for the upward pitch. I\u0027ll redownload full from the store and report afterwards.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2013-07-25T05:03:08Z","Content":"\n\u003Cp\u003EI take back what I said about liking it. I\u0027m having to micromanage my ships to keep them stable, and I haven\u0027t tried, but docking must be a huge pain in the butt, now. I\u0027ll reinstall my game and see how it goes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T05:05:11Z\u0022 title=\u002207/25/2013 05:05  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by Pingonaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-25T05:05:24Z","Content":"\n\u003Cp\u003EErr, why does the Aeris 3A have a functioning SAS when nothing else does? I\u0027ll try re-downloading tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"Naelo","CreatedById":14384,"CreatedDateTime":"2013-07-25T05:09:31Z","Content":"\n\u003Cp\u003EQuick side-question: Is the Avionics package now the same SAS as the ASAS? (Excluding reaction wheels of course)\u003C/p\u003E\n"},{"CreatedByName":"Nodrak","CreatedById":69231,"CreatedDateTime":"2013-07-25T05:11:39Z","Content":"\n\u003Cp\u003E3A in a fresh .21 off the store is slightly pitching up after taking off and doing 180 back over KSC. By slightly I mean, 30s for 1 pixel on navbal. If you take off from the runway asap and fly straight, it noses down slightly, but is nose up slightly by the end of the runway. SAS off, landing gear up/down same, torque on/off same.\u003C/p\u003E\n"},{"CreatedByName":"naloxone","CreatedById":23786,"CreatedDateTime":"2013-07-25T05:14:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022purpletarget\u0022 data-cite=\u0022purpletarget\u0022\u003E\u003Cdiv\u003EBe sure to read the pod descriptions. Only Manned pods are \u0022SAS equipped\u0022 by default. So if you have a probe controlled craft, the SAS functionality will do nothing, just like 0.20 ships without ASAS installed. If you want SAS to do anything with a probe body, then you have to add one of the other SAS equipped parts, which include the Old ASAS 1m \u0026amp; 2.5m parts, or the Avionics nosecone thingy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESay again? If we want \u0022SAS\u0022 we are supposed to add parts that used to be \u0022ASAS\u0022?\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/TM-G0bkl8MQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"EdisonTrent","CreatedById":41559,"CreatedDateTime":"2013-07-25T05:18:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022naloxone\u0022 data-cite=\u0022naloxone\u0022\u003E\u003Cdiv\u003ESay again? If we want \u0022SAS\u0022 we are supposed to add parts that used to be \u0022ASAS\u0022?\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/TM-G0bkl8MQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EParts that have \u003Cstrong\u003ESAS-Equipped\u003C/strong\u003E are the parts that give you new ASAS and \u003Cstrong\u003EContains Reaction Wheels\u003C/strong\u003E are the new SAS. (New as in .21)\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-07-25T05:20:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003ENow this is much more like it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI\u0027m also suspecting from all the reports that \u003Cem\u003Esomething\u003C/em\u003E, could be a mod, could be a bad settings file, could be old parts lingering about the KSP/Parts folder, might be interfering with normal SAS operation. \u003C/p\u003E\u003Cp\u003EThe new SAS might be a lot of things, but it most definitely isn\u0027t a thing that requires constant input to maintain attitude. It\u0027s been pretty consistently doing that on all the test cases we did here, and there were a lot of them. \u003C/p\u003E\u003Cp\u003EIf the SAS isn\u0027t holding attitude properly for you, then it very well may be in a buggy state, because that is certainly not the intended behaviour.\u003C/p\u003E\u003Cp\u003EFirst things first though, we need a proper baseline to compare different cases here. So how about we use the Aeris 3A spaceplane as a benchmark? It\u0027s easy to fly and it\u0027s got a few particular flight characteristics that are easy to spot.\u003C/p\u003E\u003Cp\u003ESo, the test is as follows.\u003C/p\u003E\u003Cp\u003E* Launch a new Aeris 3A from the runway, set it at full throttle and try to maintain level flight.\u003C/p\u003E\u003Cp\u003E* Do not adjust trim. On neutral trim, the 3A has a slight tendency to pitch down when the tanks are full. \u003C/p\u003E\u003Cp\u003E* Climb out to 1000m altitude and verify that it\u0027s doing that. Let go of the controls and make sure this tendency to drop the nose is there.\u003C/p\u003E\u003Cp\u003E* Ok, that\u0027s our control. If you\u0027ve observed anything else at this point, something is already wrong with your game and you should be doing a complete reinstall.\u003C/p\u003E\u003Cp\u003E* Now, let\u0027s test the SAS. From level flight, engage it with T and don\u0027t apply any input. Verify that it\u0027s maintaining attitude.\u003C/p\u003E\u003Cp\u003E* If that didn\u0027t happen, then something is wrong with your game. Reinstall.\u003C/p\u003E\u003Cp\u003E* Now, a few more tests. Apply some slight pitch up input without disengaging SAS. Pitch up to about 30Ã‚Â° and watch the aircraft maintain the new attitude.\u003C/p\u003E\u003Cp\u003E* If that didn\u0027t happen, then something is wrong with your game. Reinstall.\u003C/p\u003E\u003Cp\u003EIf you spotted something wrong by doing this test, please list all your mods if any, and check the KSP/Parts folder to see if there\u0027s anything in there (on a stock install it should be empty). Also, try deleting your settings.cfg file and running the game again. It\u0027s unlikely, but not impossible that a bad config would mess things up.\u003C/p\u003E\u003Cp\u003EThat should be enough to spot most cases where things are very obviously wrong. We can start with that for now.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat throttle setting is this \u0027nose-down tendency\u0027 at, since you don\u0027t mention throttle at all. On mine, it holds almost perfectly stable at full throtle, and gains a nose-down tendency when the throttle is cut. The SAS *is* able to hold...eventually.\u003C/p\u003E\u003Cp\u003EI\u0027ve admittedly only tried to use the stock SAS once since the update, and I experienced pretty much what they were complaining about: Constantly having to make adjustments to keep doing what I was trying to do (point prograde). Admittedly my target was probably moving slightly(Prograde in the middle of a maneuver), but what it seemed like was happening was that when I released the controls while still moving, it would take several seconds to start trying to stabilize that movement. And it would frequently seem to stabilize at a point a short distance AFTER I let go. It DID seem to be stabilizing, but not where I wanted it to, and there did seem to possibly be some drift, necessitating a lot of manual corrections. It wasn\u0027t long before I got frustrated and hit \u0027prograde\u0027 on the SMART A.S.S. again.\u003C/p\u003E\u003Cp\u003EThe craft in question had very low torque and no other control surfaces, but there\u0027s a slight element of this visible in the Aries3A behavior too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T05:24:20Z\u0022 title=\u002207/25/2013 05:24  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by Tiron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}