{"TopicId":38621,"ForumId":51,"TopicTitle":"The Tale of Melley Kerman","CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-07-25T01:42:58Z","PageNum":1,"Articles":[{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-07-25T01:42:58Z","Content":"\n\u003Cp\u003EWhen the Space Centre was renovated by Kerbal builders to look nicer, the first thing Mission Control did was send up an SS core to be used for scientific purposes - so they chose 4 brave Kerbonauts (and Bob, who was seen here peering in at the scientists) who had very low stupidity to go up and do science in LKO. \u003Cimg src=\u0022http://gyazo.com/488fac9b2d3861e812ab1fd5d37eacd6.png\u0022 alt=\u0022488fac9b2d3861e812ab1fd5d37eacd6.png\u0022\u003EHowever, there was one Kerbonaut who was dissapointed when his name wasn\u0027t on the list - Melley Kerman. His stupidity was off the charts and he was about as brave as a fridge, so he was given the simple task of pushing the core into an orbit and then delivering all of its modules, piece by piece. He was essentially a lorry driver who had to fall back down to Kerbin every now and then.\u003C/p\u003E\u003Cp\u003EWhen a Mun mission was announced, Melley threw his name in there, despite the nagging thought that Mission Control would never pick him - he was too stupid and cowardly. So you can imagine his surprise when he saw his name alongside two of the most legendary Kerbonauts in the Centre - Bill Kerman and Jebediah Kerman. Eager to get going, he strapped himself in and with the help of his crew they got into a very low Mun orbit, roughly about 10km off the surface. From the beginning, Melley never really thought he would be the one chosen to jump in the 1 man lander, but clearly he had made an impression on the Mission Controller. He hopped into his 1 man lander after his very first EVA and followed the instructions Jeb had scrawled on a snack wrapper, only to see 4 full radial fuel tanks, complete with lander lags, float off into the distance. Melley was stuck - either hop back in with Bill and Jeb, land back at KSC and face the wrath of Mission Control, or risk his life being the hero and being the first ever Kerbal to land on the Mun.\u003C/p\u003E\u003Cp\u003EStories had been flowing around the Centre that Melley was a coward and that he must have bribed his way onto the Munar mission using snacks or something, and even though Melley pleaded he was innocent, he still received painful stares as he was walking up to his command capsule. It was because of this that Melley thought if he did give up, he would definitely be sacked, forced to scrub Kerbal toilets and be humiliated for the rest of his life - so with no landing gear, little fuel and one tiny engine to land on, he would try and go where no Kerbal has gone before. Slowing down was the easy part, so Melley picked a relatively flat spot and began to retro burn. He fell closer and closer to the surface of the Mun, definitely not in favour of Lithobraking, and with roughly half his fuel left he made the final decent. As he came down, he wondered if his death would be quick or if he would suffer, and whilst in this tranquil state of mind, he realised he was on the surface of the Mun. Upright. Landed on the engine. \u003C/p\u003E\u003Cp\u003EHe wasn\u0027t dead - in fact very much the opposite, so he leapt down and planted his flag and leapt back up, wondering if he did have enough fuel to get back in to orbit. He had gone this far - he may as well try and dock with Bill and Jeb, right? So he did, and ran out of fuel on the ascent. Melley sighed, jumped out of his lander and turned on his jet pack. He didn\u0027t think it would be anywhere near enough to keep him alive, and even if he was in orbit he was orbiting the wrong way for Bill and Jeb to come and get him. So he waited. He thought what kind of funeral they would give him. If anybody would even care. And then he fell asleep. And then he woke up to see Bill and Jeb waving at him from the 3 man capsule.\u003C/p\u003E\u003Cp\u003EAlmost in tears, he made his way in to the capsule with 10% EVA fuel left and they set off for Kerbin, where he was fished out of the ocean and given the heroes welcome he deserved. Melley was now Mission Control\u0027s go to guy, and despite talk of him being relocated to a luxury Space Station in a 300km orbit, for now he remains lying on a sun bed on the beach, laughing as snacks are delivered to him by those who mocked him.\u003C/p\u003E\u003Cp\u003E^^^ All this genuinely just happened in my latest Mun mission - Melley Kerman is now my all time favourite Kerbal. Thanks for reading!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T01:45:03Z\u0022 title=\u002207/25/2013 01:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by WillHop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbEagle 6","CreatedById":72552,"CreatedDateTime":"2013-07-25T01:48:31Z","Content":"\n\u003Cp\u003EMelley would be the classic \u0022Underdog\u0022 character in a Hollywood movie.\u003C/p\u003E\u003Cp\u003E... Why isn\u0027t there a Hollywood movie about him?\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-07-25T01:55:28Z","Content":"\n\u003Cp\u003EThey already tried - his story was too fantastic to put into film and the camera exploded, although that may have been the Kerbal engineering..\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-25T02:20:32Z","Content":"\n\u003Cp\u003ESo what\u0027s he do for an encore? EVA back to Kerbin from Gilly? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-07-25T10:37:25Z","Content":"\n\u003Cimg src=\u0022http://gyazo.com/55a61eb873609e90fd76da98164f7392.png\u0022 alt=\u002255a61eb873609e90fd76da98164f7392.png\u0022\u003E As soon as I saw his stats I felt very very sorry for him\n"}]}