{"TopicId":38777,"ForumId":55,"TopicTitle":"Ideas for new features or mods","CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-07-25T14:33:41Z","PageNum":1,"Articles":[{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-07-25T14:33:41Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing for a couple of months now and have some ideas that I think will improve KSP:\u003C/p\u003E\u003Cp\u003EWind Tunnel. A feature where you can see how much drag your craft has. Could also include off-centre drag warnings or other drag issues that would make your craft unstable.\u003C/p\u003E\u003Cp\u003EG-force mode. Click two parts of your craft to display the force needed to break them apart.\u003C/p\u003E\u003Cp\u003ESecond screen support to display a large navball, mechjeb stuff etc.\u003C/p\u003E\u003Cp\u003ECraft Balancer. An automatic method to assess your craft, see where it is unbalanced and add small weights to balance it out.\u003C/p\u003E\u003Cp\u003EHeight adjust. Select one object then make other objects the same height/rotation/etc.\u003C/p\u003E\u003Cp\u003ERadar. A basic downward facing radar to assist landings, just displays distance to ground.\u003C/p\u003E\u003Cp\u003ESlower time warp. Slow down time for fine tuning maneuvers. 50%, 25% and 10% of normal speed.\u003C/p\u003E\u003Cp\u003EMission history. After a mission is done, show a map with each maneuver on it, course corrections etc.\u003C/p\u003E\u003Cp\u003EBlueprints. Create a cool looking exploded diagram of your favourite craft, possibly showing stages, delta-v etc.\u003C/p\u003E\u003Cp\u003EInflatable heat shield. Like the aerobraking shield used in the movie \u00222010\u0022\u003C/p\u003E\u003Cp\u003EMaglev launch track. Put your craft on a sled that speeds up on a circular track before being flung up into orbit. Saving a bunch of delta-v would be nice.\u003C/p\u003E\u003Cp\u003EHydrogen Ramscoop. A large magnetic funnel for the front of your craft that scoops up hydrogen fuel for your nuclear thermal engine.\u003C/p\u003E\u003Cp\u003ESolar Sail. Deployable large foil panels to catch the solar wind.\u003C/p\u003E\u003Cp\u003EStatic lagrange points. I know we can\u0027t simulate \u0022real\u0022 lagrange points, but maybe 2 static ones X km in front of and behind a body\u0027s orbit?\u003C/p\u003E\u003Cp\u003ECargo bays with support for embedded ships. Some mods already have cargo bays, but I\u0027d like to see vibration dampeners and docking clamps.\u003C/p\u003E\u003Cp\u003EHopefully some of those aren\u0027t too silly. I\u0027d welcome comments \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}