{"TopicId":39044,"ForumId":32,"TopicTitle":"How do they fit the wheels in there?","CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-07-26T08:22:45Z","PageNum":1,"Articles":[{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-07-26T08:22:45Z","Content":"\n\u003Cp\u003EHi all. So, I\u0027ve just been contemplating the new system, which has been working flawlessly for me since 0.21.1 came out (thanks devs!). However, some random question popped into my head that begged asking. Now, keep in mind that I am no expert on reaction wheels and have only a vague understanding of how they work, but it seems to me like you\u0027d need one wheel on each axis in order to be able to apply torque in any direction, like the wheels do now. With the reaction wheel itself being about 0.5 meters tall, how do they fit the two wheels that aren\u0027t pointing along the axis of the part? Am I overthinking this, misunderstanding how reaction wheels work at all, or am I just imagining things?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-26T08:24:33Z","Content":"\n\u003Cp\u003EThey must have different reaction wheels inside the capsules. Reaction wheels are a little simplified in game, to make things easier.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-07-26T08:43:32Z","Content":"\n\u003Cp\u003EThe force exertable by a gyroscope is proportional to its mass and rotational speed. So it\u0027s possible to have a series of smaller wheels that do the same thing as one large one. The flat reaction wheel modules likely contain a series of small wheels as well, instead of just one big wheel - probably a bigger RW in the center for roll, and matched pairs of smaller RWs for pitch and yaw. It\u0027s not the most plausible explanation, but it\u0027s quite possible.\u003C/p\u003E\n"},{"CreatedByName":"Crass","CreatedById":24532,"CreatedDateTime":"2013-07-26T08:46:43Z","Content":"\n\u003Cp\u003EInstead of wheels the size of the diameter of the module, imagine several smaller wheels mounted inside of it.\u003C/p\u003E\n"},{"CreatedByName":"TwoHedWlf","CreatedById":7163,"CreatedDateTime":"2013-07-26T09:07:55Z","Content":"\n\u003Cp\u003EThe truest answer would probably be, Yes, ideally there would be a large wheels for each axis and the shape and size of the module only allows for 2. But this they\u0027re fudging it in the name of gameplay/dev time vs realism at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-07-26T09:12:43Z","Content":"\n\u003Cp\u003ETheir reaction wheels are made of neutronium. That\u0027s why capsules made of tinfoil and balsa wood weigh as much as loaded fuel tanks.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2013-07-26T15:59:14Z","Content":"\n\u003Cp\u003ELike this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lro.gsfc.nasa.gov/images/hardware/01212008-1.gif\u0022 alt=\u002201212008-1.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can get away with three but then they need to be oriented as on each axis explicitly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}