{"TopicId":3906,"ForumId":25,"TopicTitle":"The \u0026quot;Race\u0026quot; to Space","CreatedByName":"Sofa499","CreatedById":2246,"CreatedDateTime":"2011-11-15T19:37:39Z","PageNum":1,"Articles":[{"CreatedByName":"Sofa499","CreatedById":2246,"CreatedDateTime":"2011-11-15T19:37:39Z","Content":"\n\u003Cp\u003EThe Kerbal Space Program\\\u0027s administrative staff have found themselves in a pickle. While they now have a nigh-bottomless supply of different moon rockets, courtesy of the numerous firms to whom they outsource design and construction, they have nonetheless received complaints from kerbonaut Bill Kerman, who claims that, in most lunar missions, he ends up missing his favorite TV show, \u0027Crispin, the Teleporting Worm\u0027. To remedy this problem, the KSP had offered incentives (a free T-shirt and a pen) to whomever can design a rocket that, to quote KSP Administrator Steve Kerbowski, \u0027can take off and circle the moon and then come back really really fast\u0027.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Challenge:\u003C/strong\u003E Launch, complete a single orbit of the mun, and then return to Kerbin (with your kerbonauts alive) in the shortest MET possible! Post a video of the mission and/or state your total mission time with a screenshot of the abort screen. If someone tops your time, feel free to try and one-up them with another go or a new design. Just think of that beautiful pen!\u003C/p\u003E\u003Cp\u003EPermitted parts include vanilla, Silisko, SundayPunch, and any other balanced sets (BFE-5K, warp nacelles, etc. are forbidden).\u003C/p\u003E\n"},{"CreatedByName":"Ronox","CreatedById":3693,"CreatedDateTime":"2011-11-15T20:27:45Z","Content":"\n\u003Cp\u003ESo, here\\\u0027s my entry. I have to point out something that I don\\\u0027t understand, the mun orbits at about 11,400,000 or so correct? My abort screen shows I never passed 10,000,000! Or, is that where it switches to the mun\\\u0027s alt meter? Either way, here\\\u0027s my go \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ET\u002B:05:39:15\u003C/p\u003E\n"},{"CreatedByName":"Fabri91","CreatedById":17,"CreatedDateTime":"2011-11-16T14:23:44Z","Content":"\n\u003Cp\u003ENot such a great attempt, but here it goes.\u003C/p\u003E\u003Cp\u003ET\u002B 08:39:14\u003C/p\u003E\n"}]}