{"TopicId":39139,"ForumId":32,"TopicTitle":"MainSail vs Skipper vs 5 x LV-T45s: Fundamentals of Rocket Construction Question","CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T17:05:31Z","PageNum":1,"Articles":[{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T17:05:31Z","Content":"\n\u003Cp\u003EI\u0027ve watched a bunch of tutorial vids but have some fundamental questions as to when / why to use different engine configurations (primarily I\u0027m having trouble getting a 10Mg payload into high orbit without an absurdly enormous rocket). My question is, how do I know which config to use depending on my payload. I\u0027m using Kerbal Engineer to look at stats.\u003C/p\u003E\u003Cp\u003ETWR: I know I need \u0026gt; 1 to get off the ground in atmosphere\u003C/p\u003E\u003Cp\u003EdV: Change in velocity achievable\u003C/p\u003E\u003Cp\u003EISP: Engine efficiency\u003C/p\u003E\u003Cp\u003ETime: I think this is a bigger factor than I\u0027m giving it credit for\u003C/p\u003E\u003Cp\u003ESo how should I be reading these to ensure my rocket can get a payload into high orbit Or is dV the only number that really matters? Here are the stats for the 3 engines listed with just an orange tank and an okto2.\u003C/p\u003E\u003Cp\u003E[table=width: 600, class: grid]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESkipper\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETWR: 1.66\u003C/p\u003E\u003Cp\u003EdV: 4725m/s\u003C/p\u003E\u003Cp\u003EISP: 300s\u003C/p\u003E\u003Cp\u003ETime: 2:24s\u003C/p\u003E\u003Cp\u003EThrust: 650kN\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EdV w/10Mg: 3003m/s\u003C/em\u003E[/td]\u003C/p\u003E\u003Cp\u003E [td]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E5 x LV-T45\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETWR: 2.34\u003C/p\u003E\u003Cp\u003EdV: 4168m/s\u003C/p\u003E\u003Cp\u003EISP: 320s\u003C/p\u003E\u003Cp\u003ETime: 1:40s\u003C/p\u003E\u003Cp\u003EThrust: 1000kN\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EdV w/10Mg: 2858m/s\u003C/em\u003E[/td]\u003C/p\u003E\u003Cp\u003E [td]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMainSail\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETWR: 3.64\u003C/p\u003E\u003Cp\u003EdV: 3934m/s\u003C/p\u003E\u003Cp\u003EISP: 280s\u003C/p\u003E\u003Cp\u003ETime: 58s\u003C/p\u003E\u003Cp\u003EThrust: 1500kN\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EdV w/10Mg: 2621m/2\u003C/em\u003E[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003EFrom all appearances, the T45s seem to strike a balance between the MainSail and the Skipper in terms of Thrust, burn time, TWR and dV, but have the advantage of a higher atmospheric ISP. \u003C/p\u003E\u003Cp\u003EWhen I add load (I\u0027ve added 10Mg just to look at numbers). The only thing that changes is dV. Looking at an \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Cheat_Sheet\u0022 rel=\u0022external nofollow\u0022\u003Eonline dV calculator / charts\u003C/a\u003E suggests that I need ~4500dV to get into a low Kerbin orbit. This suggests that a single orange tank with a MainSail can\u0027t even get into orbit (adding a 2nd tank gets me to 4700dV, just barely making low orbit). \u003C/p\u003E\u003Cp\u003ESo some questions:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ECan I just add up the dV from my stages to know if I\u0027m going to make it? \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAre there other atmospheric factors to consider? \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhy would anyone ever use anything but a Skipper on an orange tank? (and a follow-up, why ever use a MainSail?)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhat are good targets for my stages? I assume getting to 70K is a priority then I want to stage out to an engine that has a more efficient ISP in vacuum. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf dV is the only number I need and the only number that changes, why am I looking at ISP and the other values at all?\u003C/p\u003E\u003Cp\u003EThanks, any illumination appreciated!\u003C/p\u003E\n"},{"CreatedByName":"footman04","CreatedById":15367,"CreatedDateTime":"2013-07-26T17:13:32Z","Content":"\n\u003Cp\u003E1. Yep. I did some experiments with vertical SSTO probe launchers and this was an important factor in the success of them.\u003C/p\u003E\u003Cp\u003E2. Terminal velocity. You lose some d/v to air friction, but it hasn\u0027t been an issue for me yet.\u003C/p\u003E\u003Cp\u003E3. I\u0027ve always used Mainsails to get large loads to orbit. The Skipper has proven to be a very good upper stage engine.\u003C/p\u003E\u003Cp\u003E4. It depends on how many stages you\u0027ve got. Asparagus staging is important. On a quad booster setup, I eject the first two at 3-5k, the second two somewhere beyond 10k, when they run out. The center stage is usually sufficient to circularize most crafts.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-26T17:24:08Z","Content":"\n\u003Cp\u003E\u0022Why would anyone ever use anything but a Skipper on an orange tank? (and a follow-up, why ever use a MainSail?)\u0022\u003C/p\u003E\u003Cp\u003EYou could use 2 T30s and a T45 to get the same mass as a skipper (4t), almost the same thrust (660 kN rather than 650 kN), and higher Isp. Or, you could add more fuel to get the same TWR and actually be able to use all the thrust at your disposal from the 5 T45s or the mainsail.\u003C/p\u003E\u003Cp\u003EI normally wouldn\u0027t use so many T45s; the T30 is lighter and has more thrust, so I only use as few T45s as I can get away with while still having enough control authority. One T45 and four T30s is lighter and has better thrust, so it can haul up more fuel for itself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-26T17:26:21Z\u0022 title=\u002207/26/2013 05:26  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 26, 2013\u003C/time\u003E by numerobis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2013-07-26T17:25:20Z","Content":"\n\u003Cp\u003EOnce you are out of the atmosphere it\u0027s your dV that really matters, though extra weight may make maneuvering more annoying.\u003C/p\u003E\u003Cp\u003EHowever for your first stage (in atmosphere) you want more thrust even if the dV is lower, as it gets you up and out of drag and gravity quicker.\u003C/p\u003E\n"},{"CreatedByName":"Rastaman","CreatedById":34602,"CreatedDateTime":"2013-07-26T17:35:49Z","Content":"\n\u003Cp\u003EThrust in important in space too - you need it for cleaner escape burns that utilize the Oberth effect.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-07-26T17:48:22Z","Content":"\n\u003Cp\u003ESince I am at work and have limited time I will try to give you a short observation of mine.\u003C/p\u003E\u003Cp\u003EThe rocket equation used to calculate Delta-v is:\u003C/p\u003E\u003Cp\u003EdV=9.81*Isp*ln(Mi/Mf)\u003C/p\u003E\u003Cp\u003EdV is delta v\u003C/p\u003E\u003Cp\u003EIsp is Specific impulse of that stage\u003C/p\u003E\u003Cp\u003EMi is mass of stage when fuel is full\u003C/p\u003E\u003Cp\u003EMf is mass of stage when empty.\u003C/p\u003E\u003Cp\u003EBecause the only vaiables in this equation are Mi and Mf I usually consider (Mi/Mf) as one variable \u0022R\u0022\u003C/p\u003E\u003Cp\u003ESo now the equation is\u003C/p\u003E\u003Cp\u003EdV=9.81*Isp*ln®\u003C/p\u003E\u003Cp\u003EHere it is easy to see two things. One, the ONLY way to increase Delta v for a stage is to increase Isp or to increase R. Isp is increased by using more efficient engines whereas R is increased by putting more fuel (Increasing Mi) or decreasing payload (Decrease Mf) please note that payload means everything above the stage you are calculating.\u003C/p\u003E\u003Cp\u003EThe second thing one notices is that doubling Isp doubles your delta v but doubling your fuel ,\u0022R\u0022 does not. In fact, because Ln is a logarithmic function to the base \u0022e\u0022 you experience diminishing returns especially after R=2.72\u003C/p\u003E\u003Cp\u003EWhat does this all mean? That there is only a specific range where an engine should be used. If you like I could post something on TWRs later on when I have more time\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T18:02:04Z","Content":"\n\u003Cp\u003EThanks all... following-up...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003Ethe ONLY way to increase Delta v for a stage is to increase Isp or to increase R. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would imply that you should always use the engine with the highest ISP for your environment (atmosphere or vacuum), therefore, that the 5xT45s are always the way to go out of the 3 I listed above. But, as you imply later in your post, TWR is a significant factor. The Skipper and the 5xT45s just don\u0027t have the thrust to lift the heavy loads, which I think is why so many people use MainSails, which are horribly inefficient. Then does it become a space and weight constraint? You can\u0027t fit 7.5 T45s onto the bottom of an orange tank so you can\u0027t get to the thrust of a MainSail with the efficiency of a T45.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-26T18:04:08Z\u0022 title=\u002207/26/2013 06:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 26, 2013\u003C/time\u003E by Oddible\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2013-07-26T18:10:36Z","Content":"\n\u003Cp\u003EVery Good Explanation AmpsterMan but I think he wanted a handy Guideline instead of difficult equations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bengsch85","CreatedById":75728,"CreatedDateTime":"2013-07-26T18:15:32Z","Content":"\n\u003Cp\u003EThe reason adding fuel only works to a point in adding delta-v is that at some point its using more thrust to lift the mass of the fuel then adding delta-v.\u003C/p\u003E\n"},{"CreatedByName":"vidboi","CreatedById":60555,"CreatedDateTime":"2013-07-26T18:27:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003EThanks all... following-up...\u003Cp\u003EThis would imply that you should always use the engine with the highest ISP for your environment (atmosphere or vacuum), therefore, that the 5xT45s are always the way to go out of the 3 I listed above. But, as you imply later in your post, TWR is a significant factor. The Skipper and the 5xT45s just don\u0027t have the thrust to lift the heavy loads, which I think is why so many people use MainSails, which are horribly inefficient. Then does it become a space and weight constraint? You can\u0027t fit 7.5 T45s onto the bottom of an orange tank so you can\u0027t get to the thrust of a MainSail with the efficiency of a T45.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMainsails have the best thrust-weight ratio out of all the engines, so for lower delta-v stages using a mainsail can actually be more efficient. Given that it is often more efficient to stage quickly rather than have high delta-v stages (especially in asparagus set-ups) using mainsails can actually be more efficient as the engine contributes less to the overall mass of the stage. Very efficient launchers such as the Nova use mainsails for the asparagus boosters and T30s/T45s for the central stack to make the most out of this behaviour. Another good example is how below a certain delta-v requirement (I think it\u0027s around 800m/s) 24-77s are more efficient than LV-Ns.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-07-26T18:34:12Z","Content":"\n\u003Cp\u003ETo summarize AmpsterMan\u0027s post:\u003C/p\u003E\u003Cp\u003EMOAR thrust = less delta-v, more TWR\u003C/p\u003E\u003Cp\u003EMOAR Isp = more delta-v, usually less TWR\u003C/p\u003E\u003Cp\u003EMOAR engines = less delta-v, more TWR (but usually less so than adding purely more thrust)\u003C/p\u003E\u003Cp\u003EMainsails are generally used for their insane thrust. If your payload is too heavy for a Skipper to lift, use these massive engines. That being said, I prefer using a mixture; a Mainsail on my central stage, with two Skippers on side boosters. I found that using three Mainsails is simply too much thrust (for an optimal ascent, try to keep your velocity below 200 m/s before 10 km), and I had to throttle down to halfway. The Skippers are much more fuel efficient, which helps a lot in terms of delta-v.\u003C/p\u003E\u003Cp\u003EIn the end, you don\u0027t want a TWR that is over 2 when you start your initial ascent, however a higher one is always helpful after the gravity turn, in case you pitch down too much. Hope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2013-07-26T18:36:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003E[*]Why would anyone ever use anything but a Skipper on an orange tank? (and a follow-up, why ever use a MainSail?)\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause you don\u0027t just want to send an engine and its fuel into orbit - you want to launch a payload as well. That high TWR on the Mainsail allows you to stick a lot of extra mass on top. Your first stage is going to have to carry a lot of rocket (second stage, maybe even third stage) if you\u0027re launching a significant payload and that\u0027s where the Mainsail really shines.\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T18:38:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MalfunctionM1Ke\u0022 data-cite=\u0022MalfunctionM1Ke\u0022\u003E\u003Cdiv\u003EVery Good Explanation AmpsterMan but I think he wanted a handy Guideline instead of difficult equations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely not, I have plenty of blunt goals from the cheat sheet I posted. What I\u0027m looking for is clearer rational of why I\u0027m choosing certain engines. I was just looking at Temstar\u0027s Zenith rocket designs and he seems to use 2 T30s and 1 T45 on the bottom of his core as opposed to the 5 T45s. This is a significant gap in my knowledge. Why use 3 engines and not 5? I think one fundamental I\u0027m missing here is speed / vertical velocity and finding some balance between velocity and fuel efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T18:42:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003Efor an optimal ascent, try to keep your velocity below 200 m/s before 10 km\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere, that\u0027s a piece I was missing. So either build a lower thrust rocket or throttle down? A little of both? Do engines change efficiency based on their throttle?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003EIn the end, you don\u0027t want a TWR that is over 2 when you start your initial ascent, however a higher one is always helpful after the gravity turn, in case you pitch down too much. Hope this helps!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting. This is exactly the kind of help I\u0027m looking for. Ideally I want to build small efficient rockets not behemoths that consume ungodly resources.\u003C/p\u003E\n"},{"CreatedByName":"RRoan","CreatedById":733,"CreatedDateTime":"2013-07-26T19:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003EYou can\u0027t fit 7.5 T45s onto the bottom of an orange tank so you can\u0027t get to the thrust of a MainSail with the efficiency of a T45.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can get 12 T30s and 4 T45s onto a single orange. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T19:09:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RRoan\u0022 data-cite=\u0022RRoan\u0022\u003E\u003Cdiv\u003EI can get 12 T30s and 4 T45s onto a single orange. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScreenshot or it didn\u0027t happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo seriously... structures please!\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-07-26T19:12:50Z","Content":"\n\u003Cp\u003EChoosing between less thrust and throttling down - less thrust is most likely better, because it means you won\u0027t overstress your rocket nearly as easily, and it allows you to control the speed more accurately.\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2013-07-26T19:13:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003EScreenshot or it didn\u0027t happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003ENo seriously... structures please!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso, how much mass does the absurd strutting arrangement add to the ship? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-26T19:23:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003EWhy use 3 engines and not 5?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause 3 engines is less mass than 5. Your optimal speed at low altitude, when you are going vertically, is the terminal velocity at that altitude: the faster you go, the less you lose to gravity [linearly so], but the more you lose to drag [quadratically so], thus the optimal speed is where gravity = drag. So you need a TWR of about 2 on average: one for gravity, one for drag. Any more thrust than that, and you should throttle back to save fuel. Or, even better, drop an engine so you no longer need to haul it up.\u003C/p\u003E\u003Cp\u003EAfter you start turning, the optimal speed is still a matter of discussion, but again, you generally want to have as little engine mass as possible.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-26T19:31:19Z","Content":"\n\u003Cp\u003EI find the Skipper to be an excellent short-range interplanetary engine; it gets a decent fuel economy and the burn times aren\u0027t painful like you get from nuclear engines. I wouldn\u0027t use it going to Jool or Moho, though.\u003C/p\u003E\u003Cp\u003EI also find it useful when the ascent stage ends up having way too much TWR for the delta-V I need.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-07-26T19:40:25Z","Content":"\n\u003Cp\u003EWell keep in mind, the Skipper\u0027s relatively new. The Mainsail\u0027s been around a lot longer.\u003C/p\u003E\u003Cp\u003EBut also, the reason why you\u0027d use 3 engines rather than 5 if you can get away with it? The engines themselves have weight, and that weight detracts from your delta-V. For the same setup with the same engines with the same Specific Impulse (what Isp stands for), fewer engines will generate more delta-V, but less thrust. This is why the small radials can be more efficient than a LV-N: The LV-N is really freaking heavy (2.5 tons if I recall).\u003C/p\u003E\u003Cp\u003EOne other thing to keep in mind is that Isp isn\u0027t static: It changes as you climb. The two values specified for our engines are \u0027at 1 atm\u0027 (Sealevel pressure), and \u0027In Vacuum\u0027. It ramps smoothly between the two as the pressure changes...and the pressure decreases logarithmically as you climb. If I\u0027ve done the math right here, on Kerbin you\u0027re down to 0.135 atmospheres or so by the time you get to 10000m. It really doesn\u0027t take much altitude before your engines are closer to the \u0027vacuum\u0027 efficiency than the \u0027Atmosphere\u0027 efficiency...which is also lower on the mainsails and the skippers than the smaller engines.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027ve had up to 7 engines on the bottom of an orange tank before. I lack patience.\u003C/p\u003E\n"},{"CreatedByName":"Pbhead","CreatedById":64465,"CreatedDateTime":"2013-07-26T19:46:24Z","Content":"\n\u003Cp\u003EFor me the Thrust to lag ratio is more important for my lifters.\u003C/p\u003E\u003Cp\u003EMainsails just plain have the best thrust for the lowest part count.\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2013-07-26T19:53:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oddible\u0022 data-cite=\u0022Oddible\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E[*]Why would anyone ever use anything but a Skipper on an orange tank? (and a follow-up, why ever use a MainSail?)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are times when I just need the Mainsail\u0027s thrust to get something up. I prefer the skipper but sometimes it just won\u0027t do the job.\u003C/p\u003E\u003Cp\u003EBy the way, what are you using to get 5 engines? I know the core parts only has pieces to allow attaching 4 medium engines to a big tank as far as I\u0027m aware\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-07-26T19:54:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EThere are times when I just need the Mainsail\u0027s thrust to get something up. I prefer the skipper but sometimes it just won\u0027t do the job.\u003Cp\u003EBy the way, what are you using to get 5 engines? I know the core parts only has pieces to allow attaching 4 medium engines to a big tank as far as I\u0027m aware\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a lot of ways. The \u0027original\u0027 method was to use the small strut cubes as an attachment point, but you can also use reversed tail connectors (which look quite good) or the new-ish radial connector port as well.\u003C/p\u003E\u003Cp\u003EPeople have been doing engine clusters for awhile now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-26T20:08:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003ESo you need a TWR of about 2 on average: one for gravity, one for drag. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is news. So I\u0027m not looking for a TWR of 1.xx, I\u0027m looking for a TWR of 2 in atmosphere? This explains a lot.\u003C/p\u003E\n"}]}