{"TopicId":39228,"ForumId":16,"TopicTitle":"What mods should I get?","CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-26T22:10:50Z","PageNum":1,"Articles":[{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-26T22:10:50Z","Content":"\n\u003Cp\u003EBrand new to the game, and I would like to know what mods I should get?\u003C/p\u003E\u003Cp\u003EI see that no one is using just stock parts, so some links would be awesome.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-07-26T23:27:20Z","Content":"\n\u003Cp\u003EThe kethane mod allows you to detect kethane in deposits from space. You can then land there, drill for it and convert it into fuel. This allows unlimited hopping between planets/moons. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-7-4-Find-it-mine-it-burn-it%21-Compatible-with-KSP-0-21?highlight=kethane\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/23979-Kethane-Pack-0-7-4-Find-it-mine-it-burn-it%21-Compatible-with-KSP-0-21?highlight=kethane\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-26T23:44:13Z","Content":"\n\u003Cp\u003EThe most base mods you could get is KW rocketry for rocket parts, B9 Aerospace for (mostly) plane parts, Kerbal Engineer for flight info, and Mechjeb for the same\u002Bautopilot functionality. There\u0027s a whole heaping ton of mods, you should really go on a case-by-case basis, i.e, which mod fulfills your current parts/plugin needs.\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-27T00:25:26Z","Content":"\n\u003Cp\u003EI did a list not too long ago in response to a similar question, but can\u0027t find it. Oh well... Off the top of my head, here\u0027s a few that I use:\u003C/p\u003E\u003Cp\u003E(Names in parenthesis () are the short names of the mods that are generally understood in the forums) \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EPLUGINS\u003C/strong\u003E\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/20451-0-21-Ferram-Aerospace-Research-v0-9-5-4-Aerodynamics-Fixes-For-Planes-Rockets\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFerram Aerospace Research (FAR)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E comes to mind as a must have. Especially if you plan on trying your hand at spaceplane design. The base game has a really poorly implemented aerodynamic and drag model. FAR basically just adds a proper one.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24636-0-20-X-Kerbal-Crew-Manifest-v0-5-4-0-Released!-Create-Edit-Remove-Kerbals?highlight=crew\u002Bmanifest\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ECrew Manifest\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: It hasn\u0027t been updated for the new release yet, but very handy. The recent KSP update implemented some of what was in this mod, but it also allows you to name your Kerbals and adjust their stats. Not to mention the most important part; if your ship has more than one crewed pod (e.g. space stations), it allows you to move the crew around without requiring them to do an EVA.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24786-0-21-Kerbal-Alarm-Clock-v2-5-0-0-(July-27)\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerbal Alarm Clock\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: I\u0027ve never used this one before, but I\u0027ve heard good things. Prevents you from time-warping past maneuver nodes and such.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25367-0-21-Chatterer-v-0-5\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EChatterer\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E: Really small mod, but can add some really good immersion. Just simulates communication between ground control and your ship.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12384-PART-0-21-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-0-9\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMechJeb\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E: This one does it all. It provides any form of in-game information you could ever ask for. I would recommend that you don\u0027t use any of the autopilots it provides (add it provides a lot of them) until you\u0027ve gotten yourself a firm grasp on the game. I\u0027ve been playing for near to a year, and I personally never use them.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EPARTS\u003C/strong\u003E\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33168-20-2-KW-Rocketry-2-4?highlight=rocketry\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKW Rocketry (KW)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E and/or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/35383-0-20-2-AIES-Aerospace-v1-3\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAIES Aerospace (AIES)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: Both of these are fairly large part mods that just increase your options when it comes ship building. Huge amount of new parts, from fuel tanks, to engines, to fairings, etc. You really should have one of these (I use KW).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25241-0-20-2-B9-Aerospace-Pack-R3-2-New-pods-IVAs-engines-fuselages-structures\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EB9 Aerospace (B9)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: If you want to build spaceplanes or SSTOs, this pack is a must. Like what KW and AIES do for rockets, this one does for spaceplanes (plus a bunch of really cool cockpits to boot). Just another huge amount of parts in your inventory.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29862-0-21-Procedural-Dynamics-Procedural-Wing-0-5\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EProcedural Wings (pWings)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/39512-0-21-Procedural-Fairings-2-0-first-inline-fairings?highlight=procedural\u002Bfairings\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EProcedural Fairings\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: Two mods by different authors. pWings allows you to create your own wing shapes and Procedural Fairings creates a set of fairings molded to your payload. Very handy.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25563-0-20-KAS-v0-3-1-Kerbal-Attachment-System\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerbal Attachment System (KAS)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: It\u0027s basically just a couple winches with almost limitless possibilities. You can use them for cranes, as a method for resource transfer in bases, or even just as a trailer hitch.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/9396-0-20-ISA-MapSat-4-0-Dev-Build\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EISA MapSat\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: A part/plugin mod that allows you to create mapping satellites to make topographical maps of any body in the Kerbol system. It\u0027s still under development, so you might need to tinker a bit to get it working properly, but usually it works just fine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/16925-0-21-Aviation-Lights-v3-3-(20JUN13)\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAviation Lights\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: Exactly what it says. Navigation lights for your aircraft (red, green, white, blue, and a couple strobes).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/9923-0-21-Lazor-System-v29-(Jul-26)\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERomfarer\u0027s Lazor System\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: This is actually a series of mods. I\u0027ve been using it for months and have barely scratched the surface of it. I mainly use it for the \u0027Robotic Arms Pack,\u0027 but the missile pack is great for clearing unwanted debris.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/35043-0-20-FusTek-Station-Parts-Expansion\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFusTek Station Parts Expansion\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: Just a bunch of really awesome space station/base building parts. The mod page can give you a much better explaination than I can\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFOR A LITTLE LATER\u003C/strong\u003E\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003EThese mods, you might want to hold off on until you have a fairly firm grasp on the basic concepts of the game, as they can be quite game changing. Also don\u0027t do what I did and install them all at once, unless you want to have a very confusing (see: Kerbal Massacre) night...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/16347-0-20-RemoteTech-Relay-Network-%C3%83%C2%A2%C3%A2%E2%80%9A%C2%AC%C3%A2%E2%82%AC%C5%93-V-0-5-0-1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERemoteTech\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: This one requires you to setup a proper communications relay system in order to use your unmanned probes. Comes with a bunch of parts.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26935-0-20-Ioncross-Crew-Support-Plugin\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EIonCross Crew Support\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: This mod basically requires you to put a functioning life support system (parts are included) on your craft to provide your crew with oxygen and remove carbo dioxide. If you don\u0027t, your Kerbals will die, simple as that.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/32342-0-20-Deadly-Reentry-2-3-reentry-heat-plus-thermal-and-g-force-damage-to-parts\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EDeadly Re-entry (DRE)\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E: Again, just like what it sounds like: if you don\u0027t put a heat shield on your craft, or slow yourself down during re-entry, like I said above, your Kerbals will die (while on fire), simple as that. It now also models g-forces, so you also have to keep that in mind when taking off and re-entering. Some parts will break at different g-loads, but it\u0027s best to keep them low (I\u0027ve pulled 6gs in an Extra, it\u0027s a rush, but not very fun in the long run...)\u003C/p\u003E\u003Cp\u003EI\u0027m sure I\u0027ve overlooked a few, but I hope this list helps you on your way. \u003C/p\u003E\u003Cp\u003EOh, and welcome to KSP.\u003C/p\u003E\u003Cp\u003EEDIT: When I get some more time tonight, I\u0027ll update this post with links to all of these. Right now though, I need me some chicken wings.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT Mk II: I didn\u0027t mention Kethane, but even though it\u0027s mentioned above, I\u0027ll iterate it again. Very good mod.\u003C/p\u003E\u003Cp\u003EEDIT Mk III: I gots me my chicken wings... Anyways, I\u0027ve linked all of the mods to their respective mod thread. Also added FusTek\u0027s Station Parts Expansion, because it\u0027s awesome. Please note, if you want ISAMapSat you\u0027ll have to follow the link to the authors blog at the bottom of the first page of the mod thread. Mmmm chicken wings...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-27T01:17:00Z\u0022 title=\u002207/27/2013 01:17  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 27, 2013\u003C/time\u003E by espm400\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-07-27T00:33:43Z","Content":"\n\u003Cp\u003EI recommend KSPX (Kerbal stock part expansion) \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/30472-KSPX-Kerbal-Stock-Part-eXpansion-mod-reposted\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/30472-KSPX-Kerbal-Stock-Part-eXpansion-mod-reposted\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBasically another parts mod but it does it\u0027s best to capture the look of the game and balanced accordingly. That\u0027s why it\u0027s referred as unofficial stock parts. It won\u0027t hold that title for long because it\u0027s so good that it\u0027s being slowly assimilated into the game. That\u0027s where we got the cupola pod and MK I lander can, and all of the new parts this patch.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-07-27T00:37:06Z","Content":"\n\u003Cp\u003EThe two I fell in love with are Mechjeb and Quantum Struts (no more ugly struts, just a beam of light and less struts needed overall). As for parts I keep uninstalling mods that add them to the game because I decide I don\u0027t like the parts and I hate sifting through pages of stuff to get at what I want.\u003C/p\u003E\u003Cp\u003EThat said I did find a parts package that I like is NovaPunch.\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-27T00:48:05Z","Content":"\n\u003Cp\u003EKerbal Attachment System\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock\u003C/p\u003E\u003Cp\u003EKethane\u003C/p\u003E\u003Cp\u003EISAMapSat\u003C/p\u003E\u003Cp\u003EMechJeb\u003C/p\u003E\u003Cp\u003EKW Rocketry or Nova Punch 2\u003C/p\u003E\n"},{"CreatedByName":"luchelibre","CreatedById":61140,"CreatedDateTime":"2013-07-27T01:22:35Z","Content":"\n\u003Cp\u003EAm I missing something? I find Subassembly Manager the greatest thing since sliced bread but I don\u0027t see it mentioned much at all here lately in these sorts of threads.\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-27T01:35:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022luchelibre\u0022 data-cite=\u0022luchelibre\u0022\u003E\u003Cdiv\u003EAm I missing something? I find Subassembly Manager the greatest thing since sliced bread but I don\u0027t see it mentioned much at all here lately in these sorts of threads.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t used it, otherwise, from what I\u0027ve heard anyway, it would probably be on my list. Personally, I don\u0027t really need it since I\u0027ve got a set of very stable lifters that I just build my payloads on top of. With the exception of my X-15 dropship (never finished it), I\u0027ve never really needed to import one ship onto another.\u003C/p\u003E\n"},{"CreatedByName":"JunkyardDog","CreatedById":75610,"CreatedDateTime":"2013-07-27T01:47:52Z","Content":"\n\u003Cp\u003EMy 2 cents.\u003C/p\u003E\u003Cp\u003EEvery mod brings along many changes, I personally install them one or two at a time and get used to them before installing another to make it manageable.\u003C/p\u003E\u003Cp\u003EQuite a few mods still haven\u0027t been updated for the newest patch, and there are a LOT of mods to choose from. So;\u003C/p\u003E\u003Cp\u003EEssential information; you\u0027re playing blind without this.\u003C/p\u003E\u003Cp\u003EMechJeb - It\u0027s mind bendingly enormous in what it can do, including displaying any and every single piece of information about you, your craft, and your surroundings you could ask for. It\u0027s also an autopilot in many shapes and forms.\u003C/p\u003E\u003Cp\u003EKerbal Engineer - A slightly simplified form of MechJeb, provides essential information during construction and flight including your weight, thrust, delta-v, bearing and many, many more invaluable bits of information. I prefer it over MechJeb personally as I find it\u0027s easier to read. Does not have an autopilot, and I find flying manually is more fun.\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock - You can set yourself alarms of any kind. Must have if you are planning on one or several interplanetary flights.\u003C/p\u003E\u003Cp\u003EProtractor - Provides invaluable information for interplanetary flights, transferring from one planet to another is painful and inefficient without it.\u003C/p\u003E\u003Cp\u003ESubassembly Manager - A mod that allows you to save specific sections of your craft. Want to switch your payload from an unmanned probe to a manned rover? You no longer have to rebuild the entire craft.\u003C/p\u003E\u003Cp\u003EEssential utilities; you\u0027re relatively limited with what you can do without these.\u003C/p\u003E\u003Cp\u003EISAMapSat - Create detailed maps of planets and moons including height maps, allows you to plan for certain if your glorious Kerbal mun base will sit atop a plateau, or dead centre in a crater.\u003C/p\u003E\u003Cp\u003EKethane - Introduces an entirely new concept to the game; mining for resources, in particular Kethane, a fuel you can use to refuel your crafts. Suddenly long term expeditions and bases are viable without having to endlessly ferry heavy fuel from home.\u003C/p\u003E\u003Cp\u003EKerbal Attachment System - Hooks, connectors, anchors and more. You can now drag objects with cables, anchor yourself to ground, create utility vehicles and much, much more. How does a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/39569-KAS-Crossbow-Constant-escalation-of-insanity\u0022 rel=\u0022external nofollow\u0022\u003Ehighly unorthodox Kerbal transportation launcher system\u003C/a\u003E sound?\u003C/p\u003E\u003Cp\u003EParts;\u003C/p\u003E\u003Cp\u003EPartCatalog - Creates additional menus and tabs for your parts. Absolutely must have if you\u0027re installing several part packs and do not enjoy listing through several pages just to find that one part you want from the stock game.\u003C/p\u003E\u003Cp\u003EB9 Aerospace Pack - Introduces plenty of new plane parts, high quality and recommended.\u003C/p\u003E\u003Cp\u003EKW Rocketry - The go-to pack for more and a few bigger quality rocket parts. Includes fairings.\u003C/p\u003E\u003Cp\u003ENova Punch 2 - Similar to Rocketry, a huge parts pack with plenty of everything.\u003C/p\u003E\u003Cp\u003EAviation Lights - Exactly what it says. Introduces \u0027realistic\u0027 lights with several modes. Also good for disco parties.\u003C/p\u003E\u003Cp\u003EHooliganLabs Airships - Introduces balloons and airships. \u003C/p\u003E\u003Cp\u003EFlavour; \u003C/p\u003E\u003Cp\u003EChatterer - Space is awfully quiet save for the roaring of engines. This mod introduces radio chatter between crafts, mission control, and remote probes. \u003C/p\u003E\u003Cp\u003ECompletely overhauls the game;\u003C/p\u003E\u003Cp\u003EFerram Aerospace Research - Introduces proper aerodynamics into the game. Nose cones and farirings have a significant purpose now. Wildly rebalances the game, and takes quite a bit of time to learn.\u003C/p\u003E\u003Cp\u003EDeadly Re-entry - Introduces proper re-entry, your crafts risk overheating and disintegrating when re-entering atmosphere. As far as I know is designed to work alongside with Ferram Aerospare Research. Makes the game \u003Cspan style=\u0022font-size:8px;\u0022\u003Emuch\u003C/span\u003E harder.\u003C/p\u003E\u003Cp\u003Eand to a lesser extent,\u003C/p\u003E\u003Cp\u003EIonCross Crew Support - Kerbals actually use their lungs now; introduces life support to your craft. One more thing to manage and take care of.\u003C/p\u003E\u003Cp\u003EThese are just off the top of my head, there are many more. Search around and try them for yourself.\u003C/p\u003E\n"}]}