{"TopicId":39307,"ForumId":20,"TopicTitle":"Bye Bye mechjeb","CreatedByName":"KWilkiePJ","CreatedById":73880,"CreatedDateTime":"2013-07-27T02:50:01Z","PageNum":1,"Articles":[{"CreatedByName":"KWilkiePJ","CreatedById":73880,"CreatedDateTime":"2013-07-27T02:50:01Z","Content":"\n\u003Cp\u003EAfter a few months of playing with mechjeb, the latest release has been, shall I say more of a hindrance than a help. Thus far I have reverted back to manual as its far quicker and more reliable, which is the only reason I used it in the first place. I there was a delta V monitor in the VAB I wouldn\u0027t need to use it at all!\u003C/p\u003E\u003Cp\u003EWhat are your thoughts? so far, I have had wonky take offs, a docking autopilot that doesn\u0027t work at all and to boot a precision landing autopilot that is no longer precise.\u003C/p\u003E\u003Cp\u003Eanother piece of food for thought, for me precision landing is far more difficult than docking\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-27T03:23:55Z","Content":"\n\u003Cp\u003E*hugs 0.20* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeriously, though. I don\u0027t think this means MechJeb is useless. Hopefully the author will look into these issues when he has time, and release an update.\u003C/p\u003E\u003Cp\u003EMJ still has dev builds. Have you checked those?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-27T03:27:54Z\u0022 title=\u002207/27/2013 03:27  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 27, 2013\u003C/time\u003E by Benie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-07-27T03:42:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KWilkiePJ\u0022 data-cite=\u0022KWilkiePJ\u0022\u003E\u003Cdiv\u003EI there was a delta V monitor in the VAB I wouldn\u0027t need to use it at all!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that\u0027s all you needed it for then you could have just used Kerbal Engineer.\u003C/p\u003E\n"},{"CreatedByName":"msyblade","CreatedById":69250,"CreatedDateTime":"2013-07-27T03:45:07Z","Content":"\n\u003Cp\u003EI\u0027ll be honest, I was using mechjeb for the last couple of months. The \u0022lazy\u0022 way too. . .Click \u0022Eve\u0022 and minimize while checking my messages, lazy. But with the update I\u0027ve been flying full manual control, and I\u0027ve learned the what they say is true: The damn thing taught me how to fly. \u003C/p\u003E\u003Cp\u003EDont think I\u0027ll install it again even if it\u0027s updated. I really enjoy flying it now that I know what to do.\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-07-27T03:50:23Z","Content":"\n\u003Cp\u003EI did a one shot semi-precision landing on Duna today. Just a few small corrections from the edge of its sphere of influence and landed with 20km from my target (basically, Curiosity-style). That was way harder than docking.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-07-27T03:52:49Z","Content":"\n\u003Cp\u003ELanding I can do. Precision landing? well that involves planetary rotation... maybe atmospheric deceleration... \u003C/p\u003E\u003Cp\u003EUsually what I do is just land close enough... then take off again to move it where I need it.\u003C/p\u003E\u003Cp\u003EDocking I can do. It\u0027s not hard once you figure out how the docking controls effect the symbols on the navball... and what the symbols on the navball mean.\u003C/p\u003E\n"},{"CreatedByName":"dlmarti","CreatedById":70037,"CreatedDateTime":"2013-07-27T03:54:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KWilkiePJ\u0022 data-cite=\u0022KWilkiePJ\u0022\u003E\u003Cdiv\u003EAfter a few months of playing with mechjeb, the latest release has been, shall I say more of a hindrance than a help. Thus far I have reverted back to manual as its far quicker and more reliable, which is the only reason I used it in the first place. I there was a delta V monitor in the VAB I wouldn\u0027t need to use it at all!\u003Cp\u003EWhat are your thoughts? so far, I have had wonky take offs, a docking autopilot that doesn\u0027t work at all and to boot a precision landing autopilot that is no longer precise.\u003C/p\u003E\u003Cp\u003Eanother piece of food for thought, for me precision landing is far more difficult than docking\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am a little confused. In your post you state you only used it for delta V monitoring, but then you go into all of the automatic stuff that is not working?\u003C/p\u003E\u003Cp\u003EWas this really a post about you \u0022graduating\u0022, or a plea to be considered elite?\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-27T03:55:47Z","Content":"\n\u003Cp\u003EI actually just started doing precision landings the day before .21 was released, and despite the fact that I picked up non-atmospheric landings pretty quick (as long as I timed the suicide burn right...), I\u0027m still having some issues with touching down a rocket at KSP. Just need a bit more practice, but that\u0027s what probe cores are for.\u003C/p\u003E\u003Cp\u003EDocking, on the other hand, I picked up within about an hour (after watching a video and realizing what all the icons on the navball meant). \u003C/p\u003E\u003Cp\u003EAs for MechJeb, I\u0027ve used only one of the autopilots, and only once. Back in .19 I decided to try out the docking autopilot, but considering it used about five times the monoprop that I would have used, that was the also the last time it got used. For me, MechJeb is all about the wealth of information.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-07-27T04:07:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003E*hugs 0.20* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003Cp\u003ESeriously, though. I don\u0027t think this means MechJeb is useless. Hopefully the author will look into these issues when he has time, and release an update.\u003C/p\u003E\u003Cp\u003EMJ still has dev builds. Have you checked those?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am still running 0.20x and having issues with MechJeb now and then. For instance today I was trying to put a lander on the moon (after my new moon base went poof). I loaded up my favorite Mun rocket made minor changes to it (hitchhiker can, extra booster to make up for the weight) and went to launch. MechJeb failed to get it into orbit 4 times in a row and I couldn\u0027t figure out what was going on.\u003C/p\u003E\u003Cp\u003ETurned off MechJeb and did it myself, no problem. Used MechJeb to get it to the Mun, no problem, set up orbit, no problem. Go for landing.. problem. For whatever reason at about 350m above the mun MechJeb decided it would be a good idea to flip my lander around and kick the thrusters into full power slamming it into the surface. I tried to save it, as soon as I saw it flip around and start burning I canceled the auto land and tried to flip it around and start a burn myself but before my thrusters got to half power my lander slammed into the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Ironwatsas","CreatedById":61128,"CreatedDateTime":"2013-07-27T04:11:33Z","Content":"\n\u003Cp\u003EWell, I mostly use MechJeb for calculating Delta-V during construction, ascent guidance, and setting up maneuver nodes. Typically I use the smartASS function to align spacecraft for docking, but use RCS thrusters manually. I find that MechJeb tends to eat up Monoprop when it does it on it\u0027s own.\u003C/p\u003E\u003Cp\u003EAs for landings... well... I haven\u0027t tried landing with mechjeb. Aside from ejecting capsules, but those are easy...\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2013-07-27T04:14:08Z","Content":"\n\u003Cp\u003EDocking seems pretty straight forward now. I use docking camera to help me align, but even if I didn\u0027t use that, it wouldn\u0027t be that bad. Precision landing...oy. I\u0027ve tried that several times and at best got to within maybe 5km (which if you\u0027re talking about modular base pieces, isn\u0027t very close. Maybe if I was just trying to hit a general target on a planet it would be)\u003C/p\u003E\u003Cp\u003EI just float way too much over the surface, and the direction I go as a result of corrections still seems too unpredictable to me to be able to make at truly precision landing.\u003C/p\u003E\u003Cp\u003EI suppose the theory behind both things - docking and precision landing - are largely the same, but I just think there are more variables to consider doing landings than dockings.\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-27T04:45:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022annallia\u0022 data-cite=\u0022annallia\u0022\u003E\u003Cdiv\u003ETurned off MechJeb and did it myself, no problem. Used MechJeb to get it to the Mun, no problem, set up orbit, no problem. Go for landing.. problem. For whatever reason at about 350m above the mun MechJeb decided it would be a good idea to flip my lander around and kick the thrusters into full power slamming it into the surface. I tried to save it, as soon as I saw it flip around and start burning I canceled the auto land and tried to flip it around and start a burn myself but before my thrusters got to half power my lander slammed into the Mun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do admit, MechJeb doesn\u0027t see what is a \u0022pinpoint landing\u0022. I did a \u0022test\u0022 (well, trying an idea to use Hooligan Labs Landing Pads (the 8x8 ones) at scattered locations on Laythe).\u003C/p\u003E\u003Cp\u003EIt always lands about 80-90m away from where I want it to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for your problem, hate to say this, but it\u0027s saying your rocket design \u0022isn\u0027t good enough\u0022. \u003C/p\u003E\u003Cp\u003EI\u0027ve only had a few botched MechJeb landings, and that was either because it was trying to constantly set its angle of approach (while landing) and not doing the final approach burn to slow it down and coming in too fast, or it spinning end over end when it tries to set the angle of approach.\u003C/p\u003E\u003Cp\u003EBoth had to do with the design of the rocket. And I am using Build #69.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-07-27T04:57:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003EI do admit, MechJeb doesn\u0027t see what is a \u0022pinpoint landing\u0022. I did a \u0022test\u0022 (well, trying an idea to use Hooligan Labs Landing Pads (the 8x8 ones) at scattered locations on Laythe).\u003Cp\u003EIt always lands about 80-90m away from where I want it to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for your problem, hate to say this, but it\u0027s saying your rocket design \u0022isn\u0027t good enough\u0022. \u003C/p\u003E\u003Cp\u003EI\u0027ve only had a few botched MechJeb landings, and that was either because it was trying to constantly set its angle of approach (while landing) and not doing the final approach burn to slow it down and coming in too fast, or it spinning end over end when it tries to set the angle of approach.\u003C/p\u003E\u003Cp\u003EBoth had to do with the design of the rocket. And I am using Build #69.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh, sometimes I think it is a problem with MechJeb working on my PC. I find that if I botch a landing like that. Save my vessel close the game restart the game and launch the same vessel again and MechJeb will do it right. \u003C/p\u003E\u003Cp\u003EAs evidence I did just that, not only did MechJeb get it into orbit successfully it transfered to Munar orbit and landed safely without spinning it around and slamming head first into the Mun.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-07-27T05:08:43Z","Content":"\n\u003Cp\u003EOne of the things I love about doing things manually is thr wait/reward. I just landed on the face on Duna from within half a kilometer today.\u003C/p\u003E\u003Cp\u003EFelt like awesome\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2013-07-27T05:31:27Z","Content":"\n\u003Cp\u003EHonestly the in game waypoint system is good enough for any macro scale planning I\u0027ve needed. The only thing I really use it for is the flight data and for quickly orienting myself without having to spin in circles until I spot the marker I\u0027m looking for with each step of the flight.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-27T06:06:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benie\u0022 data-cite=\u0022Benie\u0022\u003E\u003Cdiv\u003EI do admit, MechJeb doesn\u0027t see what is a \u0022pinpoint landing\u0022. I did a \u0022test\u0022 (well, trying an idea to use Hooligan Labs Landing Pads (the 8x8 ones) at scattered locations on Laythe).\u003Cp\u003EIt always lands about 80-90m away from where I want it to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for your problem, hate to say this, but it\u0027s saying your rocket design \u0022isn\u0027t good enough\u0022. \u003C/p\u003E\u003Cp\u003EI\u0027ve only had a few botched MechJeb landings, and that was either because it was trying to constantly set its angle of approach (while landing) and not doing the final approach burn to slow it down and coming in too fast, or it spinning end over end when it tries to set the angle of approach.\u003C/p\u003E\u003Cp\u003EBoth had to do with the design of the rocket. And I am using Build #69.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMechjeb has an CPM of around 70-100 meter I think, that is most landings come within that distance, however Laythe has always been very inaccurate and more like 500 meters.\u003C/p\u003E\u003Cp\u003EAn know bug is that the function who tries to kill vertical speed before final decent freaks out on low gravity worlds like Gilly, Bop, Pol and Minmus with some rare landers. \u003C/p\u003E\u003Cp\u003ESolution is to disable autopilot then it display killing vertical speed and do the decent manually. This is anyway an good idea for pinpoint accuracy. \u003C/p\u003E\u003Cp\u003EAnother issue is that mechjeb is not very smart, one recent experience, sending an ion powered probe to Moho, an 15 minutes burn from LKO, now as I started in 200 km attitude and dropped down to 130 km during the burn before the node I got extra boost because of lower and faster orbit and this sent me far inside Moho orbit. However the same would have happened if you let it fly on ASAS, mechjeb just make sure you point in the right direction and burn the required m/s.\u003C/p\u003E\n"},{"CreatedByName":"KWilkiePJ","CreatedById":73880,"CreatedDateTime":"2013-07-27T17:07:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlmarti\u0022 data-cite=\u0022dlmarti\u0022\u003E\u003Cdiv\u003EI am a little confused. In your post you state you only used it for delta V monitoring, but then you go into all of the automatic stuff that is not working?\u003Cp\u003EWas this really a post about you \u0022graduating\u0022, or a plea to be considered elite?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot to be considered elite, such things don\u0027t bother me. It was interesting to see how mechjeb did its work, it taught me a hell of a lot.\u003C/p\u003E\n"}]}