{"TopicId":39450,"ForumId":16,"TopicTitle":"EVA Operations","CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-07-27T18:30:11Z","PageNum":1,"Articles":[{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-07-27T18:30:11Z","Content":"\n\u003Cp\u003ESo I took Jeb out for a little spacewalk the other day, and this might be old but I noticed the blue buttons that said \u0022no damage\u0022 next to certain parts, and which didn\u0027t do anything so I assume that on EVA kerbals could fix stuff. Additionally using Ioncross Life Support I completely forgot pods needed electricity and stupidly ejected my electricity deprived pod with him in it from the rest of the ship for re-entry. I managed to save Jeb though, by EVA-ing him in the upper atmosphere just before it became too thick for him to hold onto the outside, manually releasing the chute\u0027s auto deploy (again, right click on the part) and it worked like a charm.\u003C/p\u003E\u003Cp\u003EWhat other parts can kerbals activate from EVA? I have a hitch-hiker survival pod on the Mun with a decorative undeployed radar dish, would my eva kerbals be able to deploy that? What about solar panels? Generators? Solid Fuel Boosters? I like the mental image of Jeb clinging tightly to a ladder as he puts a lighter inside the booster \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-27T18:50:32Z","Content":"\n\u003Cp\u003EIf I recall correctly, kerbonauts can repair rover wheels, repack or deploy parachutes, toggle solar panels, and extend radar dishes/antennas as well. No boosters or engines, though.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-27T19:34:02Z","Content":"\n\u003Cp\u003EDid you install Deadly Reentry by any chance?\u003C/p\u003E\n"},{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-07-27T20:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003EDid you install Deadly Reentry by any chance?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I\u0027ve got deadly re-entry but I seem to recall the repair buttons still being there in stock. Could be wrong though, why?\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-07-27T21:02:50Z","Content":"\n\u003Cp\u003EDRE has part damage based on heat/acceleration which can be fixed in IVA. It shouldn\u0027t in stock except for broken wheels.\u003C/p\u003E\n"}]}