{"TopicId":39549,"ForumId":32,"TopicTitle":"Excavating Assets","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-28T00:19:55Z","PageNum":1,"Articles":[{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-28T00:19:55Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to update my old Save file to 0.21.1 today. I finally got the minimum number of mods updated that I needed (so that ships wouldn\u0027t refuse to load because of missing parts). There were some weird problems there...but it worked out in the end. So when I started up version 0.21.1 with the old Save file in its folders, the game offered to update the file for me...and all appeared to be well.\u003C/p\u003E\u003Cp\u003EThen I went to check on my assets that I have stationed on the bodies that had gotten surface updates, fearing that I would find them underground. But when I switched to an ancient rover that I had parked on the MÃƒÂ¼n next to a mÃƒÂ¼nar arch, there was a very long pause in black screen.......and then the rover appeared by the arch (a little bit further away than I had left it, but intact. The other newer rover that I had parked NEXT to it was not there, however......but there was an icon that appeared to show that it was located a few kilometers UNDERGROUND. So, with trepidation, I switched to that rover from the Tracking Station...and after a long pause, it appeared on the surface next to the other rover. Cool. So apparently if you have a ship underground, when you load it the program will try to move it to the surface. Very nice, Squad.\u003C/p\u003E\u003Cp\u003EHere is the mÃƒÂ¼nar arch now, by the way. It used to sit on a long ridge. Now it sits on a very narrow and steep sided ridge. Good thing I got the rovers up there before, since it would be a much harder time driving there now. I\u0027ve enhanced the brightness and contrast of the image since the MÃƒÂ¼n\u0027s surface (and space in general) seem quite dark and dull in version 0.21.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IqY8ZjF.jpg\u0022 alt=\u0022IqY8ZjF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOver on Duna I checked on the rover that I had used to circumnavigate around the planet. After a long pause, it appeared. Also, unlike what happened with the two rovers on the MÃƒÂ¼n, its carrier lander also appeared to have been positioned on the new surface. But the rather interesting valley that used to be there is now rather dull looking. Below: After (version 0.21.1) and Before (0.19) pictures of the valley...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/58KFxoi.jpg\u0022 alt=\u002258KFxoi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2U0htgc.jpg\u0022 alt=\u00222U0htgc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEve continues to be a freaking weird place. When I called up the first rover I landed on that planet, there was again a very long delay.......and then the rover appeared just above a sea, flying upward rapidly. But it slowed down, fell back, and smashed into the sea. OK, let\u0027s undo that for now and see if I can fix it later.\u003C/p\u003E\u003Cp\u003ESo I was very worried about Desdin, my plucky long-term colonist on Eve. Would his landing site also be awash? As it turned out....no. His Eve Base was safe on dry land. But the large lake that he was located near has vanished...with only a small remnant lake in the distance. Worse for Desdin, however, is that icon you see floating above the horizon in the distance in the picture below. THAT is the marker probe left by the lander that was tested to see if it could remove Desdin from Eve. But the ground level there is no longer at 4,100 meters... when I switched over to that probe, the program happily settled onto the surface.....now located at 2,319 meters. And the lander can\u0027t make it back to orbit from THAT elevation. Sigh. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ut1PQAO.jpg\u0022 alt=\u0022Ut1PQAO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd even weirder...when I went to check on Eve Base 2, which had been dropped later for Desdin\u0027s use a few kilometers away. The base module was there...and there was another Desdin inside of it. OK...that\u0027s too weird. What happens when these two meet? Does it cause a rift in timespace that destroys the Kerbol system? ANd now I\u0027ll have to send TWO rescue landers...assuming I can find a high enough elevation site in the region. Sigh.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T00:25:02Z\u0022 title=\u002207/28/2013 12:25  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-07-28T00:50:42Z","Content":"\n\u003Cp\u003EPerhaps Desdin was destined to stay there.\u003C/p\u003E\u003Cp\u003ESomeone should break the news to him.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-28T00:52:34Z","Content":"\n\u003Cp\u003EAnd I see that the Astronaut Center did not pick up on all my kerbals stationed in various ships around the Kerbol system, only finding Bob, Bill, and Jeb that I have in exile on a space station, and ONE of the Desdins on Eve. Worse, there were some active astronauts I had in the previous game that appear to have vanished (they are not in the available list).\u003C/p\u003E\u003Cp\u003EI\u0027ll have to figure out how to edit those guys back into the save file.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-28T03:55:04Z","Content":"\n\u003Cp\u003EOK... So I went to each of my ships in the newly converted game, and now the Astronaut Center has all of the crew members of those ships listed properly in the \u0022Assigned\u0022 list.\u003C/p\u003E\u003Cp\u003EAnd a couple of the guys I thought were supposed to be available were actually sitting in some ships I was using for testing, so they have been recovered and are on the \u0022Available\u0022 list.\u003C/p\u003E\u003Cp\u003ESo...if you convert an old Save file, be sure to visit each of your ships so the crew can be properly catalogued.\u003C/p\u003E\n"}]}