{"TopicId":39570,"ForumId":32,"TopicTitle":"Cant land two things at once.","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-28T02:18:01Z","PageNum":1,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-28T02:18:01Z","Content":"\n\u003Cp\u003EBig problem here. Im trying to get both a lander and a rover to the surface of Laythe. Ive been building and testing for a few days now with a rover that dethatched after the parachutes deploy, spins around then deploys its own parachutes. Now at this point it now says I cant change vessels in atmosphere which is BS. Im guessing it means with the parachutes open? But that\u0027s not the problem. Its the fact that the vessel im not focused on disappears and the crew shows up as lost. Bummer...so wtf? The previous attempt allowed me to switch vessels in atmosphere, but it was a water landing so I had to retry. And to top it all off the game crashes to desktop when I tried to go back to the KSC screen. Which brings me here. Im having a blast building this thing, but this is an annoying road block.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-28T02:20:58Z","Content":"\n\u003Cp\u003EHm, the core of your problem comes from the 2,5km physics loading distance in low atmosphere. Any craft or part that goes beyond 2.5km from your focused ship is automatically deleted by the game. If you want to land it, just keep it close and it should stay there. And for switching vessels in atmospheres, it\u0027S more precisely switching from a vessel moving in an atmosphere. For some reason the game doesn\u0027t like it. Either try to keep it close or land one at a time I guess.\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2013-07-28T02:24:37Z","Content":"\n\u003Cp\u003Ewhy do you need the rover to detach? why not just land both?\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-07-28T02:42:06Z","Content":"\n\u003Cp\u003ELike what stupid_Chris says, you need to keep the distance between the ships smaller than 2.5 km otherwise the other ship will despawn. My suggestion is to keep them both attached, and deploy parachutes as normal, but when the parachutes fully deploy detach the rover, and you will have both landed on the surface!\u003C/p\u003E\n"},{"CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-28T03:48:29Z","Content":"\n\u003Cp\u003EI\u0027ve actually landed in this same manner on Eve. I had a rover with its own parachute on top of my lander with radially mounted parachutes. All 3 open up up when appropriate, then I decouple the rover and shake it off. You just need to keep it within that 2.5km distance so it doesn\u0027t go away, which means just letting your parachutes drift you down for a bit before detaching the rover and letting it float down.\u003C/p\u003E\n"},{"CreatedByName":"msyblade","CreatedById":69250,"CreatedDateTime":"2013-07-28T03:59:36Z","Content":"\n\u003Cp\u003EI have a \u0022dual lander\u0022 that is 2 landers back to back, and even mounted a tiny rover on the tip of lander 1. However, in order to use it I have to establish a stable orbit, and detach the two landers. the 2nd lander is fine while I land (fail) the first. Funny part is, I usually just end up getting 2 shots at landing and one of them (usually) survives. Poor little green guys, I need counseling.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-28T04:53:12Z","Content":"\n\u003Cp\u003EThe reason for the mid-air separation is because the lander is a return module aswell. Im doing this Apollo style and the lander is far to complex as it is. I figured it out.. I just gotta be quick with the parachutes. I gotta quickly switch to the rover and deploy before it gets too far. But now im having a different problem all together. ...rampant crashing. Every time I exit back to the KSC or try to Launch the game is crashing all of a sudden about 80 percent of the time. I guess this could be a support issue now.. All stock.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-28T04:57:55Z","Content":"\n\u003Cp\u003ELikely, I invite you to drop a line in the support forums with logs and crash dumps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}