{"TopicId":39572,"ForumId":16,"TopicTitle":"General tips for construction in the SPH/VAB","CreatedByName":"PsilocybicSuperFunk","CreatedById":76231,"CreatedDateTime":"2013-07-28T02:34:57Z","PageNum":1,"Articles":[{"CreatedByName":"PsilocybicSuperFunk","CreatedById":76231,"CreatedDateTime":"2013-07-28T02:34:57Z","Content":"\n\u003Cp\u003EHello All,\u003C/p\u003E\u003Cp\u003EI have been playing KSP for a little while and I am starting to get further along in the learning curve. However after having a browse through the Rovers megathread I was full of inspiration and ready to get started on a sweet rover design. however i found it a little difficult to construct one in the SPH. The main issue I had was when I was trying to connect two structural plates end to end. Trying to get the plate to connect flat required the most miniscule of mouse movements. It seems in the central point of the structural plates there is a tiny little point there that allows a lot of different connection axis options. However to do something like connect them end to end is pretty frustrating.\u003C/p\u003E\u003Cp\u003EAm I missing something here? Like a lock rotation key, to allow me to place them in the right position? I see designs of rovers that have heaps of these plates put end to end. Or are you fulla\u0027s just some really persistent and patient lads?\u003C/p\u003E\u003Cp\u003EI know about the shift key to move in 5 degree increments.\u003C/p\u003E\u003Cp\u003EAny help or advice if of course much appreciated, and feel free drop any hints and tips you use for construction. whether it is in the SPH or VAB. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DangerDave","CreatedById":69244,"CreatedDateTime":"2013-07-28T05:25:24Z","Content":"\n\u003Cp\u003ESo far as I know, it\u0027s all in the wrist... You just have to finesse it. The only time parts will \u0022Lock\u0022 into a specific spot is when you put the green checkered connector nodes together. I\u0027m a bit new myself, so I could be wrong, of course.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-07-28T05:47:40Z","Content":"\n\u003Cp\u003EThe hexagon/circle \u0022snap to angle\u0022 button can change placement ease often. In the \u0022smooth\u0022 mode you have better control over orientation but no real snap lock to attachment position and vice-e-verza.\u003C/p\u003E\n"},{"CreatedByName":"decimal-simplex","CreatedById":76184,"CreatedDateTime":"2013-07-28T14:57:07Z","Content":"\n\u003Cp\u003EIt can also help if you change the angle from which you\u0027re viewing the part you want to place. Especially for things you want to put end-to-end, it might not snap if you\u0027re looking at it straight on, but if you look at it from the side, it will.\u003C/p\u003E\n"}]}