{"TopicId":39664,"ForumId":55,"TopicTitle":"Custom scenery for all planets and moons","CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2013-07-28T16:13:58Z","PageNum":1,"Articles":[{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2013-07-28T16:13:58Z","Content":"\n\u003Cp\u003EI see that many suggestions about buildings have to do with modifying the scenery. Why not give the control to the modders? With custom scenery, modders will be able to place custom buildings in the Space Center, fill the area around KSC with buildings and houses, and make new airfields and bases where planes and other spacecraft can land. The answer is not \u0022Why?\u0022 but \u0022Why not?\u0022\u003C/p\u003E\n"},{"CreatedByName":"sytaline","CreatedById":64225,"CreatedDateTime":"2013-07-28T17:09:33Z","Content":"\n\u003Cp\u003EWhy, not is because it would be very hard to code but other then that it is a brilliant idea!\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-07-28T17:28:22Z","Content":"\n\u003Cp\u003E..Because modders can already do that if they wanted to. In-fact, I think I already saw a mod that lets you place buildings around KSC and customize the look of your launch center. I didn\u0027t really look too much into it because I\u0027m not all that interested in that as a feature. I mean, it\u0027ll be nice when Kerbin has cities and what-not, but I\u0027d much rather have them focusing on adding more and more depth to the gameplay, especially when it comes to career mode.\u003C/p\u003E\u003Cp\u003EBut even with that one mod or other mods allowing you to change the scenery...well, that\u0027s not part of the vanilla game. There\u0027s many people who will only play the vanilla game and not ever touch mods. Can\u0027t really have an empty home planet for those folks. Well, I suppose you can but SQUAD don\u0027t seem to want to do that. Anyways, mods are mods and that\u0027s a planned feature for the vanilla game.\u003C/p\u003E\n"}]}