{"TopicId":39783,"ForumId":24,"TopicTitle":"Greetings!","CreatedByName":"TxmKlees","CreatedById":76543,"CreatedDateTime":"2013-07-29T01:46:27Z","PageNum":1,"Articles":[{"CreatedByName":"TxmKlees","CreatedById":76543,"CreatedDateTime":"2013-07-29T01:46:27Z","Content":"\n\u003Cp\u003EJust purchased this game a few days ago. I\u0027m really loving it so far! There is a LOT of potential. I went through all the tutorials and scenarios multiple times and now my next goal is to safely land on the Mun. I\u0027d love to see more official tutorials:cool:\u003C/p\u003E\n"},{"CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2013-07-29T02:47:35Z","Content":"\n\u003Cp\u003EWelcome! Glad to see you\u0027re enjoying the game and I (and Jeb) hope you can land on the Mun without blowing up.\u003C/p\u003E\u003Cp\u003EI hope to see you around the forums!\u003C/p\u003E\u003Cp\u003E-Deejay\u003C/p\u003E\n"},{"CreatedByName":"Jabippy","CreatedById":76558,"CreatedDateTime":"2013-07-29T03:35:10Z","Content":"\n\u003Cp\u003EWelcome. I am new as well, got it about a week ago. So far I have pit up a sat, around the main planet and the Mun and Minimus, landed a probe on Minimus and just put my space station in orbit tonight and just finished docking its first shipment of fuel. \u003C/p\u003E\u003Cp\u003EBeing a tool I jumped in without reading anything, which is why my space station first went up with the docking ports on backwards and my first fuel ship had a nose cone over its docking port that I couldn\u0027t get off, so I got to do those both twice lol.\u003C/p\u003E\u003Cp\u003EOh well, it\u0027s up there now with a few thousand gallons of liquid goodness in it, can\u0027t wait to use it to explore the farther planets. And hello.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-07-29T06:03:24Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}