{"TopicId":39812,"ForumId":29,"TopicTitle":"Prograde (and other) vectors","CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-29T04:30:33Z","PageNum":1,"Articles":[{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-29T04:30:33Z","Content":"\n\u003Cp\u003EI\u0027ve finally started work on a HUD, and I\u0027ve got everything I need except for one thing. I can\u0027t for the life of me get any useful information about where the prograde vector (or any other navball marker) is. I\u0027ve been using the FlightUIController\u0027s NavBall as the source for pitch and roll, which come out of a Quaternion called relativeGymbal. I can just extract the Euler angles to get pitch, roll, and yaw. Works great. Then there are Transforms for progradeVector, progradeWaypoint, and target. Unfortunately I can\u0027t seem to do anything with them. I would think I would do\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E progradeTransform.rotation\u003C/pre\u003E\u003Cp\u003E and be able to use that directly, or use something like \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EQuaternion.Angle(vesselRot, ball.progradeVector.rotation)\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eto get at least an angle between them, but I can\u0027t seem to work out a combination that provides useful data. Ideally, I want to get the pitch and yaw (x and y Euler angles) for the progradeVector. Does anyone have any recommendations? Thanks for your help.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-08-08T17:08:13Z","Content":"\n\u003Cp\u003EDon\u0027t really understand Quaternions so I can\u0027t give you help on them.\u003C/p\u003E\u003Cp\u003EIn the \u003Ca href=\u0022https://github.com/Anatid/XML-Documentation-for-the-KSP-API/blob/master/FlightGlobals.cs\u0022 rel=\u0022external nofollow\u0022\u003E KSP documentation\u003C/a\u003E you can find the following variables:\u003C/p\u003E\u003Cp\u003Epublic static Vector3d ship_tgtVelocity;\u003C/p\u003E\u003Cp\u003EVector3 vesselTargetDelta;\u003C/p\u003E\u003Cp\u003EVector3 vesselTargetDirection;\u003C/p\u003E\u003Cp\u003ETransform vesselTargetTransform;\u003C/p\u003E\u003Cp\u003EAnd maybe can be use to get the prograde an therefore retrograde vector from Vector3d ship_obtVelocity.\u003C/p\u003E\u003Cp\u003EYou might get the data you need out of these things (Possibly in combination with some part.transform.InverseTransformDirection(Vector3d)) I\u0027m certainly not an expert on this so this might not make much sense in the end but this is where i would start looking for an alternative way.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-08-11T12:10:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trueborn\u0022 data-cite=\u0022Trueborn\u0022\u003E\u003Cdiv\u003EIdeally, I want to get the pitch and yaw (x and y Euler angles) for the progradeVector.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERelative to what? The planet/navball orientation?\u003C/p\u003E\u003Cp\u003EYou could try progradeTransform.localEulerAngles - if squad have made those transforms children of the GameObject that the navball is attached to then they should give you the angles relative to the navball orientation (or localRotation if you want the quaternion).\u003C/p\u003E\n"}]}