{"TopicId":39828,"ForumId":55,"TopicTitle":"Structiral Integrity Check","CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-07-29T07:52:12Z","PageNum":1,"Articles":[{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-07-29T07:52:12Z","Content":"\n\u003Cp\u003EI think we\u0027ve all had the experience of having a seemingly fine rocket disintegrate on the pad, or shortly after launch. Since career mode will presumably penalize this in someway, it would be good to have utility to determine if this is going to happen before launch is attempted. I\u0027ve seen some discussion on the forum of implementing a \u0027simulation\u0027 mode. Since that might not be a good, or practical, I suggest this:\u003C/p\u003E\u003Cp\u003EA \u0027structural integrity check\u0027 function in the VAB that will background simulate the physics of the rocket on the pad and/or shortly after launch, and provide either an \u0027ok\u0027 message, or a visual or textual indication of what parts have failed.\u003C/p\u003E\n"},{"CreatedByName":"rakutenshi","CreatedById":40086,"CreatedDateTime":"2013-07-29T08:58:04Z","Content":"\n\u003Cp\u003EYis .. Might even have it as a post-render overlay for the rocket, colour coded with stress levels (think like thermal imaging but showing structural load instead of heat). As a side note, please make it colour blind friendly, red-yellow-green gradients are really really difficult to differentiate if you can\u0027t tell the difference between red and green and yellow. I\u0027d suggest a yellow-blue gradient with yellow being the high stress points. \u003C/p\u003E\u003Cp\u003EAnd also.. wind tunnel. I don\u0027t seen being in career mode and being able to afford to see the plane explode 50 times before you finally get it \u0022just right\u0022 .. wind tunnels and Visual Stress Indicators would be awesome.\u003C/p\u003E\n"},{"CreatedByName":"jeti140973","CreatedById":61447,"CreatedDateTime":"2013-07-29T14:47:54Z","Content":"\n\u003Cp\u003EI would like a simulation mode as well, but I don\u0027t think it will happen since the \u0022revert to assembly\u0022 option will prevent you from loosing ships, crew and resources. I still think we need some way of testing landers, though.\u003C/p\u003E\n"},{"CreatedByName":"IvanTehFennec","CreatedById":26927,"CreatedDateTime":"2013-07-29T16:51:30Z","Content":"\n\u003Cp\u003EI\u0027d imagine it\u0027d be pretty hard to code something like this to work with any/all designs, but it\u0027d be pretty neat to have. Sounds like something a mod-maker could throw together.\u003C/p\u003E\n"}]}