{"TopicId":39959,"ForumId":16,"TopicTitle":"Engine Flameouts, why are they so violent?","CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-07-29T22:55:42Z","PageNum":1,"Articles":[{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-07-29T22:55:42Z","Content":"\n\u003Cp\u003EI\u0027m not a big fan of spaceplanes, just can\u0027t seem to have much success with them no matter how many tutorials I\u0027ve tried. However I have used the jet engines like rocket boosters on my rocket ships as they are light and very effective. One thing I\u0027ve come to notice, however, is that as soon as you get an engine flameout, the nose immediately flips around despite any forward thrust you may have going. I can\u0027t imagine this is a real life physics event just because you\u0027re engine has lost it\u0027s \u0022push\u0022 power, especially if you still surface control features like wings to guide the direction of the craft (though admittedly the atmosphere is thinner and may no longer have enough atmosphere to assist with direction control). Is this a true to life condition where if you suffer an engine flameout you instantly start to spin madly about or is this just a game mechanic that intentionally spins you nose down just because you\u0027re engine has failed?\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-07-29T23:02:08Z","Content":"\n\u003Cp\u003EIt\u0027s physics. If your thrust is off the centre of mass (as is the case with, say, two jets mounted left and right of the fuselage), then if one of the engines stops producing thrust, the offsetting yaw which both engines provide in equal measure becomes an unequal force and you produce a net turning force into your plane.\u003C/p\u003E\u003Cp\u003EUnfortunate, but true. This does, can, and would happen in real life.\u003C/p\u003E\n"},{"CreatedByName":"Somerled","CreatedById":13610,"CreatedDateTime":"2013-07-29T23:03:20Z","Content":"\n\u003Cp\u003EIt largely depends on the craft, the asymmetry of the flameout, the available lift and thrust before and after, the balance of the CoM, etc. Since flameouts can be so violent, it\u0027s best to set up action groups to turn off jet engines before they flameout.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-07-29T23:08:42Z","Content":"\n\u003Cp\u003EAsymmetric compressor stalls were a big problem with real-life X-planes, killing a lot of test pilots, though I\u0027m not enough of an aerospace engineer to state why.\u003C/p\u003E\u003Cp\u003EIn KSP, I try to play cautiously and shut down the jets when IntakeAir shows 0.15 on the Resources display; the theoretical flame-out threshold is 0.10, but I\u0027ve had flameouts when the indicator showed 0.12 overall but (I gather, as it happens so quickly) one engine was receiving less. This may be the reason I have yet to achieve \u0022once around\u0022 back to KSC, let alone orbit, with my designs.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-07-29T23:17:09Z","Content":"\n\u003Cp\u003ESo it really is about the lack of atmosphere for control features, be they thrust or control. Thanks for the clarification.\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2013-07-29T23:17:47Z","Content":"\n\u003Cp\u003EJust so it\u0027s clear, both jet engines don\u0027t flame out at the same time. If they did, nothing would happen. But in general one runs out of air before the other (it\u0027s kind of random) so that causes your craft to spin around, as if you had an off-center engine on your rocket and nothing to counterbalance the thrust it produces.\u003C/p\u003E\u003Cp\u003EA good way to prevent this is to only have one engine on the main axis, so that nothing can happen if it flames out and you don\u0027t have to sweat about that. Another good method is to gradually throttle down the engines as you get higher in the atmosphere (less flameouts) and when you\u0027re down to 1/3 thrust, shut everything off and activate those rocket engines. I\u0027ve found you can get up to nearly 40k altitudes with good throttling and enough intakes and still be thrusting enough to make a difference.\u003C/p\u003E\n"},{"CreatedByName":"Cal\u0026#039;Mihe","CreatedById":65567,"CreatedDateTime":"2013-07-29T23:21:55Z","Content":"\n\u003Cp\u003EI think this is more or less precisely what got Goose killed in Top Gun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnstable air intake for one of the engines after they get too close to the slipstream of another plane, produce an unrecoverable flat spin.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-07-29T23:25:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bacterius\u0022 data-cite=\u0022Bacterius\u0022\u003E\u003Cdiv\u003EAnother good method is to gradually throttle down the engines as you get higher in the atmosphere (less flameouts) and when you\u0027re down to 1/3 thrust, shut everything off and activate those rocket engines. I\u0027ve found you can get up to nearly 40k altitudes with good throttling and enough intakes and still be thrusting enough to make a difference.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am definitely going to have to try that on my next spaceplane run, though I suspect I\u0027ll be giving my ejector capsule design a fair work-out until I get it right...\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-07-30T02:57:15Z","Content":"\n\u003Cp\u003EThe key to efficient spaceplanes is intakes. Lots and lots of air intakes. With 10 intakes per engine you can still run the engine at low throttle up to ~60 km and 2300 m/s.\u003C/p\u003E\u003Cp\u003ETo practice preventing flameouts, try a design with a single engine so that flame-outs don\u0027t really affect it, and see how far down you should have the throttle at each altitude to prevent flameouts. Then you can fly the same design with more engines with the same ratio of intakes-to-engines and be much better at throttle control.\u003C/p\u003E\n"},{"CreatedByName":"longhornchris","CreatedById":70974,"CreatedDateTime":"2013-07-30T03:51:42Z","Content":"\n\u003Cp\u003EWell, in real life a compressor stall is a very, very bad thing. At the most basic level, jets work by having the air exiting move faster than it entered. When a compressor stall happens out air stops flowing through the engine - essentially you go from providing thrust to providing drag near instantly. If the engine is centerlined then you just slow down... if its off center you have a serious yaw moment applied which is BAD.\u003C/p\u003E\u003Cp\u003EFor more detail, if the intake (for supersonic aircraft) or compressor stalls then the pressure in the combustion chamber drops rapidly. This cuts the air available for combustion, which in turn causes the air-fuel ratio to go rich and thus the engine flames out. Additionally, the pressure and temperature drop reduces the energy the turbine can extract which cuts the input power to the compressor. Finally, the temperature/pressure at the nozzle drops and thus the thrust falls off. Dealing with compressor stall and intake instability were major design problems for high speed aircraft. Today the subsonic intake is pretty well mastered but supersonic intakes are still complicated.\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-07-30T04:40:54Z","Content":"\n\u003Cp\u003ENot directly related to improving anyone\u0027s ability to play KSP, but if I remember somewhat correctly, out of about 32 SR-71s constructed, 12 were lost in accidents related to their never-solved tendency to flameout...so don\u0027t feel too bad about getting it wrong yourself.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-07-30T05:13:01Z","Content":"\n\u003Cp\u003EOne thing I haven\u0027t seen mentioned in this thread (great thread to read btw), is that the jets at high altitude have really miniscule amounts of thrust. Despite this, dropping 1 kN or so of thrust off of one side still puts the plane in a flat spin. It just goes to show what little control surfaces and wings are able to do in such thin atmosphere.\u003C/p\u003E\u003Cp\u003EAirliners are made to be able to still fly a ways with only one engine, and when one does cut out mid-flight, the air is still reasonably thick enough to hold the plane forward, the engine doesn\u0027t usually cut out as abruptly as a flameout at high altitude, and the pilot has plenty of time to react and cut thrust, add rudder, etc. to keep the plane flying mostly straight and stable.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2013-07-30T05:42:39Z","Content":"\n\u003Cp\u003EAsymmetrical flameouts occurs because how the resources work in the game, specially regarding air intakes. It\u0027s not a physics issue but a coding one.\u003C/p\u003E\u003Cp\u003EThis is what I believe is happening:\u003C/p\u003E\u003Cp\u003EWe have two engines requesting 2 units of air each per physics tick, because the request is sequential one engine is always served first. Things go alright as long as we have air, but at high altitudes we get to a point where air intakes provide only 3 units. The first engine request its 2 units and the second gets only one and flames out. At the next physics tick there\u0027s again 3 units of air and again the same engine flameouts.\u003C/p\u003E\u003Cp\u003ESo really KSP isn\u0027t simulating it, is just a consequence of how resources work, and IMO it should be fixed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T05:52:27Z\u0022 title=\u002207/30/2013 05:52  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by m4v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-30T06:13:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003EOne thing I haven\u0027t seen mentioned in this thread (great thread to read btw), is that the jets at high altitude have really miniscule amounts of thrust. Despite this, dropping 1 kN or so of thrust off of one side still puts the plane in a flat spin. It just goes to show what little control surfaces and wings are able to do in such thin atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat really kills you is if you are off autopilot: you start with just barely not enough IntakeAir to keep both engines happy, so one of them weakens -- asymmetrically for the reason m4v notes. Then you start to yaw. Now you have turned a bit, so your intakes don\u0027t gather quite as much air, and the asymmetric thrust gets worse. A few frames of this and you\u0027re spinning uncontrollably.\u003C/p\u003E\u003Cp\u003EThe autopilot can fight this pretty effectively by noticing small deviations and starting to yaw against the tendency (via reaction wheels or, in previous versions, pod torque). At high altitude, that gives the human enough time to say some impolite words, and then throttle back or switch to rockets. I\u0027ve recovered with about 20kN thrust on my engines, and mechjeb\u0027s smartASS trying to fly straight.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-07-30T06:23:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EWhat really kills you is if you are off autopilot: you start with just barely not enough IntakeAir to keep both engines happy, so one of them weakens -- asymmetrically for the reason m4v notes. Then you start to yaw. Now you have turned a bit, so your intakes don\u0027t gather quite as much air, and the asymmetric thrust gets worse. A few frames of this and you\u0027re spinning uncontrollably.\u003Cp\u003EThe autopilot can fight this pretty effectively by noticing small deviations and starting to yaw against the tendency (via reaction wheels or, in previous versions, pod torque). At high altitude, that gives the human enough time to say some impolite words, and then throttle back or switch to rockets. I\u0027ve recovered with about 20kN thrust on my engines, and mechjeb\u0027s smartASS trying to fly straight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup! I was just trying to explain another way of how it\u0027s mainly the low atmosphere, but it is a series of combined things that makes it completely unrecoverable in the majority of situations. I\u0027m sure in real life it\u0027s due to more physics being at play, but it\u0027s (possibly inadvertently) simulated quite well in KSP!\u003C/p\u003E\n"},{"CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2013-07-30T06:25:09Z","Content":"\n\u003Cp\u003EYou can use Action Groups to shut down a few engines controlled while having the others still throttled up. e.g. on a 4-engine design, when reaching too low air intake, shut down 2 of the engines so the other 2 will work on for a while - now having the double number of air intakes for themselves.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2013-07-30T06:45:10Z","Content":"\n\u003Cp\u003EAs proposed in a design i have seen once, you also can angle your jet engines so their thrust vector is lined up with the center of mass - so if one engine flame out, the remaining engine will only make you strafe instead of inducing a spin.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-07-30T08:49:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003EAs proposed in a design i have seen once, you also can angle your jet engines so their thrust vector is lined up with the center of mass - so if one engine flame out, the remaining engine will only make you strafe instead of inducing a spin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. It was a fantastic design. It had 3 engines angled at 120 degrees each, all pointing through the centre of mass. Definitely one of the best designs I\u0027ve ever seen.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-07-30T09:15:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anton P. Nym\u0022 data-cite=\u0022Anton P. Nym\u0022\u003E\u003Cdiv\u003E when IntakeAir shows 0.15 on the Resources display; the theoretical flame-out threshold is 0.10, but I\u0027ve had flameouts when the indicator showed 0.12\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure how you worked out the theoretical flameout threshold, but the IntakeAir on the resources display is actually consistent and reliable, despite some people saying it is not. The threshold value is just different for different craft. A test flight will indicate what it is, then you just fly it with a margin of error as you already do. If you change the craft in *any* way, you will need to re-test the threshold.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bacterius\u0022 data-cite=\u0022Bacterius\u0022\u003E\u003Cdiv\u003EAnother good method is to gradually throttle down the engines as you get higher in the atmosphere (less flameouts) and when you\u0027re down to 1/3 thrust,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou only get that with lots of air intakes (ie. airhoggin). For lower intake:jet ratios, you will reach velocity-drag equilibrium at full thrust and max flight ceiling on jets. Reducing thrust will just cause your velocity to fall.\u003C/p\u003E\u003Cp\u003EEDIT... and one last thing.\u003C/p\u003E\u003Cp\u003EIf you make the craft very long and have the engines close together, you can recover from flameouts. On test flights with the craft below, it flamed out several times, but recovered from all since it did not go into a spin... it\u0027s just too long.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7285/8738327166_06e16caaa6_z.jpg\u0022 alt=\u00228738327166_06e16caaa6_z.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T09:18:24Z\u0022 title=\u002207/30/2013 09:18  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by bsalis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-07-30T11:39:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI think this is more or less precisely what got Goose killed in Top Gun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I remember he smashed into the cockpit canopy using his ejection seat. But the thing about that flame-out seems correct.\u003C/p\u003E\n"}]}