{"TopicId":40021,"ForumId":55,"TopicTitle":"More Alpha (Beta) Testers Needed","CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-30T06:26:01Z","PageNum":1,"Articles":[{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-07-30T06:26:01Z","Content":"\n\u003Cp\u003EI know that \u0027supposedly\u0027 this is the beta, yadda yadda, we were all using GMail while it was in beta for 5 years too, semantics... but...\u003C/p\u003E\u003Cp\u003EThe latest release .21 had some significant additions that didn\u0027t get tested enough and really could have used a more healthy beta test to exercise the new features. Case in point, the fact that Crew assignments don\u0027t save when you revert a flight is a rather significant hiccup to have missed the test (and likely not a significant amount of coding to resolve). Seems a rather small and easily fixable issue with a rather high annoyance factor to be missed in this release. Hence my suggestion to get a few more people into the beta *cough* er Alpha program.\u003C/p\u003E\n"},{"CreatedByName":"providus","CreatedById":43660,"CreatedDateTime":"2013-07-30T06:59:20Z","Content":"\n\u003Cp\u003Ewe all are testers. A simple bug report thread would have helped.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-07-30T07:17:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022providus\u0022 data-cite=\u0022providus\u0022\u003E\u003Cdiv\u003Ewe all are testers.\u003C/div\u003E\u003C/blockquote\u003E^ this.\u003Cp\u003EThe game\u0027s sold as \u0022early access\u0022, and we are all testing it and helping its development. The preliminary testing is just to weed out the crashes and glaring gamebreakers, finding the rest is \u003Cem\u003Eour\u003C/em\u003E job.\u003C/p\u003E\n"},{"CreatedByName":"zxcvb55","CreatedById":12874,"CreatedDateTime":"2013-07-30T07:33:51Z","Content":"\n\u003Cp\u003EI\u0027ve actually been seeing this brought up a lot lately on several different forums, so I\u0027ve formed my own opinions on the subject. Don\u0027t mind the lengthy post. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027ll give the tl;dr up front: Squad knows how to learn from each release, and if they think they need to pick more testers or change their whole testing system completely, I\u0027m confident in their ability to do that.\u003C/p\u003E\u003Cp\u003ENow for my own opinion on the matter. The issue with adding more testers is that there\u0027s a certain degree of diminishing returns. For example, the first 20 testers to make the team might prevent 10 big bugs from making it through. 20 more are added and that will prevent 5 additional bugs from making it into the release, and so on and so forth. However, each batch of testers added is another that needs to be managed by Ted and the developers, and the cost of that management (wading through more minor bug reports, getting everyone to work together, teaching new testers how to do their job, etc) will eventually outweigh the benefits. If a few updates pass, and the need for new testers was very apparent, then it might make sense to take that gamble, but applications for the newest batch of testers \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/38710-KSP-Experimental-Team-Applications-are-closed!?p=504898#post504898\u0022 rel=\u0022external nofollow\u0022\u003Eclosed just three weeks ago.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIndeed, regardless of how many testers you add, there\u0027s always a chance that a bug will slip through the cracks, but saying that crew resetting is a \u0022significant hiccup\u0022 is a bit of an overstatement. Perhaps if reverting your flight caused the terrain to disappear, reset the entire craft, or maybe\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/t_0l-0tWzu4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E then yes, that would be quite a mistake. It being a \u0022small and fixable issue\u0022 actually means it\u0027s more likely to make it into the .21 release, especially if it were found late in testing. Why waste time on something like that when there are bigger bugs to fix?\u003Cp\u003EAll that said, I can\u0027t seem to replicate the bug itself. Moving any part on the vessel in the VAB will reset the crew to default, which may be what you\u0027re experiencing, but that\u0027s just an unfortunate side-effect of the current crew management implementation. Remember, crew management is still in it\u0027s infancy, so there will be kinks to work out. But this isn\u0027t like the GMail beta, or any alpha/beta testing system really, it\u0027s a product where game changing features are added regularly in large quantities, so early access customers have to expect some bugs.\u003C/p\u003E\n"},{"CreatedByName":"dlmarti","CreatedById":70037,"CreatedDateTime":"2013-07-30T11:03:51Z","Content":"\n\u003Cp\u003EAs much as I know this thread is going to end badly, I will add my 2 pesos.\u003C/p\u003E\u003Cp\u003EThis lastest release has confirmed what Oddible said.\u003C/p\u003E\u003Cp\u003EEither Squad does not have enough beta testers, or they had bad ones. \u003C/p\u003E\u003Cp\u003EThe SAS bugs are so glaring it is ridiculous, even now I do not have a high confidence that Squad believes they are real.\u003C/p\u003E\u003Cp\u003EI think they were all testing the same type of crafts, and they were mostly using joysticks.\u003C/p\u003E\u003Cp\u003EEven now:\u003C/p\u003E\u003Cp\u003E1. Reaction wheels ignore fine controls.\u003C/p\u003E\u003Cp\u003E2. New SAS forgets heading slowly (see the aero problem).\u003C/p\u003E\u003Cp\u003E3. New SAS has a dead spot around the desired vector, where it will not apply force (I assume to save SAS).\u003C/p\u003E\u003Cp\u003E4. New SAS does not change its feedback parameters based on vehicle size/shape.\u003C/p\u003E\u003Cp\u003ECommence fan boy flaming in... 3 2 1\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-07-30T11:14:25Z","Content":"\n\u003Cp\u003EHeya there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEverything that is to be said has already been said: It\u0027s entirely up to Squad and nobody outside can make a reasonable claim about the amount of testers. The quality? Perhaps, but that should be dealt with by \u003Cem\u003Eposting detailed bug reports\u003C/em\u003E, rather than publically discussing the testing team. With that said, I\u0027m closing this thread.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\n"}]}