{"TopicId":40122,"ForumId":51,"TopicTitle":"Project Atlantis: Floating Eve Ocean Base","CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-07-30T20:05:01Z","PageNum":1,"Articles":[{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-07-30T20:05:01Z","Content":"\n\u003Cp\u003EI have decided to build a base on Eve because it looks awesome from orbit and i want to see some close-ups. A small team of kerbals will be sent there to explore the world and its metallic-gleaming oceans. For now, i do not plan to return them home, but don\u0027t tell them yet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I want to keep them supplied with drops from orbit.\u003C/p\u003E\u003Cp\u003EWhen building the base, i decided that it should be able to lift itself out of the water and fly to another nearby location. Trips to nearby land masses will be done by smaller boats. Without further ado, here are the images of my first interplanetary base-building mission.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProject Atlantis Part 1: Getting there\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JdmdH\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAll designs have only been tested on kerbin in my \u0022simulator\u0022 savegame, mission pics are from my main \u0022permadeath\u0022 savegame. So far, the mission is coming along quite well, but the launch window to Eve is closing, so i cannot waste a lot of time anymore. I can only hope that the preparations were good enough. I have planned to bring two expendable lightweight \u0022aerocapture testing probes\u0022 along, which will enter Eves atmosphere at different altitudes to find a good aerobraking altitude for the core stage. The stage will orbit Eve for some time to scan for a good landing point. Landing behaviour will also be probed with lightweight dummies.\u003C/p\u003E\u003Cp\u003ENext up: interplanetary drive stage, refueling missions, crew completion and utility delivery\u003C/p\u003E\u003Cp\u003E(to be continued)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-07T20:24:03Z\u0022 title=\u002208/07/2013 08:24  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 7, 2013\u003C/time\u003E by SirJodelstein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-08-02T22:42:51Z","Content":"\n\u003Cp\u003ESuccessful delivery of the drive stage, refuelling and crew completion. Started a separate orbiter for the atmospheric testing probes because of lag (and i put the wrong-sized docking ports on the first set of probes that went with the refuelling craft. Both crafts are on their way to Eve. All images are in the album in the first post, here are some highlights\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BMBEu6J.jpg\u0022 alt=\u0022BMBEu6J.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CdZ4MDC.jpg\u0022 alt=\u0022CdZ4MDC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Enew galaxy backdrop powered by the great \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44135-0-21-x-Universe-Replacer\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EUniverse Replacer\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E \u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-08-07T20:35:50Z","Content":"\n\u003Cp\u003EIt is done! The base has safely landed on Eve! My screenshot folder is overflowing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Added some entry and landing pictures to the album in the first post, and starting a new one for surface operations.\u003C/p\u003E\u003Cp\u003EThe orbiter arrived 3 days earlyier than the base, deployed two probes for aerobraking and began to scan the planet for a nice landing spot. The entry/landing probes turned out to be incredibly useful for finding good aerobraking altitudes and for testing landing profiles. I managed to land the base 15 km from the second lander probe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WbySqQB.png\u0022 alt=\u0022WbySqQB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U3bJ8Nm.jpg\u0022 alt=\u0022U3bJ8Nm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SJykh9n.png\u0022 alt=\u0022SJykh9n.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProject Atlantis Part 2: Surface operations\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/zoDIY\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-07T20:49:41Z","Content":"\n\u003Cp\u003EThis is awesome! Tell me though, how are they going to do any research about land and such... in water?\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-08-07T21:42:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhyunix\u0022 data-cite=\u0022Rhyunix\u0022\u003E\u003Cdiv\u003EThis is awesome! Tell me though, how are they going to do any research about land and such... in water?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExamination of land masses are not the primary focus of this mission. The next flight will however bring a small raft that will be used to reach the shoreline and the surrounding islands. I have also \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44398-Request-Manned-Eve-Rover\u0022 rel=\u0022external nofollow\u0022\u003Erequested an Eve-capable person-transport rover in the rocket builder forum\u003C/a\u003E (my rover designs usually lead to explosions, crashes and dead kerbals)\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-08T10:14:56Z","Content":"\n\u003Cp\u003EWhat is the main focus then?\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-08-08T10:31:01Z","Content":"\n\u003Cp\u003EPresumably, that radioactive soup of blutonium salts and Harv knows what else pretending to be a proper ocean...\u003C/p\u003E\n"},{"CreatedByName":"OUScooby","CreatedById":66208,"CreatedDateTime":"2013-08-08T16:48:17Z","Content":"\n\u003Cp\u003EIs that all stock parts?\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-08T18:36:52Z","Content":"\n\u003Cp\u003EI don\u0027t think so - look at the life rings and the sensory equipment on the base. Apart from that I think its mod free\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-08-08T19:38:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhyunix\u0022 data-cite=\u0022Rhyunix\u0022\u003E\u003Cdiv\u003EWhat is the main focus then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022 data-cite=\u0022Commander Zoom\u0022\u003E\u003Cdiv\u003EPresumably, that radioactive soup of blutonium salts and Harv knows what else pretending to be a proper ocean... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mission objective is to promote the awesomeness of interplanetary space exploration. The crew consists of one astronaut/flight engineer (Seegee Kerman) and four social media specialists. There won\u0027t be much science happening anytime soon. Most of the time, the crew will be occupied with taking pictures and videos to post on their mission website :-)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OUScooby\u0022 data-cite=\u0022OUScooby\u0022\u003E\u003Cdiv\u003EIs that all stock parts? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlmost stock, with the exception of the aforementioned life rings from the \u0022Sea Sickness Cure\u0022 mod (to allow Kerbals to walk on the floating base), a Kerbal Engineering Redux Chip for flight data readouts, and some red lights from the \u0022Aviation Lights\u0022 mod for the central antenna. The orbiter satellite has a ISA Mapsat Antenna. Apart from that, its stock.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T19:44:24Z\u0022 title=\u002208/08/2013 07:44  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by SirJodelstein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-08-21T21:47:16Z","Content":"\n\u003Cp\u003EWell, this project has been going way too well for too long, it was about time that i screw up somehow. Here is the story of flight \u0022Atlantis Mobility\u0022:\u003C/p\u003E\u003Cp\u003EThe objective of the first support flight to the recently established base was to bring crew-relocation vessels to the base. So, the asymmetrical yet perfectly balanced pair \u0022Heek\u0022 (short-range raft) and \u0022Vole\u0022 (rover) were mounted on an interplanetary drive stage and sent to Eve.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ce17M8i.jpg\u0022 alt=\u0022Ce17M8i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rHhzG9u.png\u0022 alt=\u0022rHhzG9u.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, it turns out that i need to work on my precision landing skills. Heek overshot the base and landed 150km away (at least i managed to land in water). Problem: the raft has a maximum range of about 100km. The engineers at KSC are now doing night shifts to develop a precision lander to drop a fuel buoy on the course. So, the boat is not lost, just delayed! A test of it\u0027s drive characteristics in the violet soup that makes up Eves oceans show a minor reduction in top speed (25m/s) compared to Kerbin, but apart from that it handles really great.\u003C/p\u003E\u003Cp\u003EThe rover landed a little bit closer to the base and luckyly managed to miss the water. It went down 60km from it\u0027s targeted landing zone. Next problem: Two wheels and the rear lights broke off during the backflip rollcage test that was 100% safe on Kerbin. To my surprise, i found out that Vole can drive completely stable on just four wheels :-) Next stop: Coast near the base. Then shutdown the systems and wait until the crew from the base has a boat to reach the shoreline (20km distance)\u003C/p\u003E\u003Cp\u003EFull album\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jmIPR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-09-13T18:54:14Z","Content":"\n\u003Cp\u003EWell, that was quite a long journey. A little bit damaged, Vole has arrived on the shoreline after covering over 80km of hills and mountains. The rover has lost its two rear wheels, but should still be funtional. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CdOd7BW.jpg\u0022 alt=\u0022CdOd7BW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHalfway through the treck, I decided that i need a mod to keep track of the covered distances, so i took a break from active playing and dipped into the realm of KSP modding. The result can be seen in the image, the mod behind it is here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/49216-Persistent-Trails-record-and-share-your-track-data!-(Beta-0-7)\u0022 rel=\u0022external nofollow\u0022\u003EPersistent Trails Mod\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow, the Atlantis crew needs to wait for the arrival of the refuelling buoys that will allow the distant boat to reach the base.\u003C/p\u003E\n"}]}