{"TopicId":40129,"ForumId":16,"TopicTitle":"When I try to get into orbit, at the 45Ã‚Â° stage, my rocket turns.","CreatedByName":"Twan","CreatedById":76817,"CreatedDateTime":"2013-07-30T20:48:05Z","PageNum":1,"Articles":[{"CreatedByName":"Twan","CreatedById":76817,"CreatedDateTime":"2013-07-30T20:48:05Z","Content":"\n\u003Cp\u003EHi !\u003C/p\u003E\u003Cp\u003ESo i\u0027m a beginner on KSP, and I try to get into orbit but I have a problem.\u003C/p\u003E\u003Cp\u003EWhen I\u0027m at 18KM (sorry I\u0027m french), I drop few reactors and I use \u0022D\u0022 key (default) to go on 45Ã‚Â°, but my rocket turns, and don\u0027t want to go where I want. I have 2 RCS (one on the top and one on the bottom) and four wings. \u003C/p\u003E\u003Cp\u003EHere is a picture of my rocket. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/zTpO2U7.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/zTpO2U7.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESorry If I made some errors but I\u0027m french so be cool please \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-07-30T21:04:44Z","Content":"\n\u003Cp\u003EHey twan,\u003C/p\u003E\u003Cp\u003ENo need to apologize for being french. If you are not sure about writing/understanding english, you do have a specific french forum now, and we will be happy to help you there too.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forumdisplay.php/62-French\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/forumdisplay.php/62-French\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ea few things I see are:\u003C/p\u003E\u003Cp\u003E- The delta wings on the center piece of the rocket are useless, they do no provide control. try adding canard instead.\u003C/p\u003E\u003Cp\u003E- Check your electricity, you may run out of it and that is why you can\u0027t control your rocket anymore.\u003C/p\u003E\u003Cp\u003E- are you using the sas (key T to toggle) to help stabilize the rocket?\u003C/p\u003E\u003Cp\u003EPS: to avoid spam, the first 5 messages a new account post need to be accepted by moderator, you don\u0027t need to write them twice, just give us the time to check and accept them.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-07-30T21:08:15Z","Content":"\n\u003Cp\u003EAlso, you should put active control surfaces at the \u003Cstrong\u003Ebottom\u003C/strong\u003E of the rocket. The center of lift should be \u003Cstrong\u003Ebehind\u003C/strong\u003E the center of mass.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-30T21:09:34Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EHere are some suggestions:\u003C/p\u003E\u003Cp\u003E1) Move your lower RCS thrusters down to the very bottom of the central rocket. Right now, they\u0027re both above the center of mass, so they won\u0027t be able to help you turn. To activate RCS in flight, you have to push the \u0022R\u0022 key, and the green light on the left side of your NavBall will turn on.\u003C/p\u003E\u003Cp\u003E2) Use the new stability assist system to help you maintain course. Just push \u0022T\u0022 before you launch. The light should go on to the right of your NavBall.\u003C/p\u003E\u003Cp\u003E3) It looks like you\u0027re set up for asparagus staging, but I don\u0027t see any fuel lines connecting your outer fuel tanks to the inner ones. You want to add those, so the outer tanks get drained first.\u003C/p\u003E\u003Cp\u003E4) The wings on your central rocket are meant for airplanes. They\u0027re not movable, and so won\u0027t be able to help you maintain course. Likewise the winglets on your outer fuel tanks are meant more to create lift rather than to steer. You want to replace all of those with the AV-R8 Winglets.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-07-30T21:10:25Z","Content":"\n\u003Cp\u003EUse the winglets that can move instead of rigid wings, and put them further down the spacecraft. When you stage the first four boosters, your center of lift might be moving ahead of your center of mass, resulting in tumbling. Also, make sure you have a tank of RCS fuel to use with those RCS thrusters.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-30T21:13:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EAlso, you should put active control surfaces at the \u003Cstrong\u003Ebottom\u003C/strong\u003E of the rocket. The center of lift should be \u003Cstrong\u003Ebehind\u003C/strong\u003E the center of mass.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven if they\u0027re just there to steer it?\u003C/p\u003E\u003Cp\u003EI find my heavy lifter works fine with moveable winglets for steering most of the way up, and static ones on the very bottom of the boosters, to stop it spinning around.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-07-30T21:14:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EI find my heavy lifter works fine with moveable winglets for steering most of the way up, and static ones on the very bottom of the boosters, to stop it spinning around.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy have two sets of wings when you can go with one?\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-30T21:19:20Z","Content":"\n\u003Cp\u003EI\u0027m not seeing an RCS fuel tank anywhere on that design; am I just missing it? I\u0027d also recommend replacing the delta wings with delta-deluxe winglets; that way you can use them to steer.\u003C/p\u003E\u003Cp\u003EEDIT: Damn. Seriously ninja\u0027d...\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-07-30T22:14:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EEven if they\u0027re just there to steer it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, because that\u0027s \u003Cem\u003Ehow \u003C/em\u003Ethey steer it! It isn\u0027t magic, it\u0027s aerodynamics. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYour winglets at the top are working because you also have some on the bottom generating lift. Take those bottom ones off and I\u0027ll bet your lifter loses a lot of stability and turns worse to boot.\u003C/p\u003E\n"},{"CreatedByName":"Swifty","CreatedById":57822,"CreatedDateTime":"2013-07-30T23:06:51Z","Content":"\n\u003Cp\u003EA common reason for losing control of rockets when pitching them over is a lack of rigidity. If you rocket wobbles lots don\u0027t be surprised if it spins when you pitch it over. To fix this add struts and pitch over much more gently\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-07-30T23:53:55Z","Content":"\n\u003Cp\u003EInstead of turning 45Ã‚Â° abruptly at 18 km, begin the turn earlier, like 5 km, and doing it more gradually.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-07-31T08:55:00Z","Content":"\n\u003Cp\u003EI notice you have 1500kn engines, then 650kn then a 1500kn with double fuel at the centre which would make them drain in the right order. If you have all 1500Kn engines but put fuel lines from the outside to the middle then the middle to the centre it will fly better, you will drop engines sooner and your ship will be more efficient. As has been said, lose the large wings near the middle, add some more struts on the side to stop wobble and it should fly a lot better.\u003C/p\u003E\u003Cp\u003EAlso your rocket is way overpowered. If you simply lose the extra tanks and engines at the bottom you will still have plenty of power to get into orbit. Then the mun. Then back again.\u003C/p\u003E\u003Cp\u003EIf you put some movable winglets on the bottom at that point then your rocket will be much more controllable\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-07-31T10:21:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EYes, because that\u0027s \u003Cem\u003Ehow \u003C/em\u003Ethey steer it! It isn\u0027t magic, it\u0027s aerodynamics. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cp\u003EYour winglets at the top are working because you also have some on the bottom generating lift. Take those bottom ones off and I\u0027ll bet your lifter loses a lot of stability and turns worse to boot.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I put wiggly winglets on the boosters, the whole thing wobbles like crazy and disintegrates. At least, it did with the old ASAS.\u003C/p\u003E\u003Cp\u003ECurrently, the static winglets just serve to stabilise it and stop it spinning on the way up, and are dumped with the boosters since they\u0027re no longer needed. The upper set are still useful right the way out the atmosphere, as they do their wiggly thing.\u003C/p\u003E\u003Cp\u003EGranted, the whole thing DID shed a booster the other day and destroy the first and second stages, so it\u0027s not totally perfect.\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-07-31T12:08:43Z","Content":"\n\u003Cp\u003EI don\u0027t understand a few things in this thread myself:\u003C/p\u003E\u003Cp\u003E1) Why should winglets be on the bottom of a rocket? Does it really matter where they generate lift when they just turn the rocket back and forth? They can turn it just as well on top of the rocket, can\u0027t they?\u003C/p\u003E\u003Cp\u003E2) Why should RCS ports be on the bottom? Again, basically the same question. I don\u0027t get why I should move my RCS ports closer to my gimballing engines.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-07-31T13:12:18Z","Content":"\n\u003Cp\u003EControl surfaces at the top of a rocket will provide turning power, but they will also tend to make the rocket unstable. Aerodynamic surfaces in front of the center of mass will want to flip the rocket and make it fly backwards, whereas surfaces at the back will stabilize it.\u003C/p\u003E\u003Cp\u003EFor rotational control RCS ports should be as far away from the center of mass as possible to provide the greatest moment. It won\u0027t make any difference whether they are at the top or bottom, except that the center of mass is likely to be nearer the bottom.\u003C/p\u003E\u003Cp\u003EFor using RCS for translation (sideways movement) they want to be at the center of mass or symmetrical around it.\u003C/p\u003E\n"}]}