{"TopicId":40183,"ForumId":34,"TopicTitle":"(KSP 1.10 \u002B 1.12 ) Mission Controller 3.2.0 (Final Version) (Updated 6/25/2021)","CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2013-07-31T01:19:13Z","PageNum":80,"Articles":[{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-07-16T21:59:19Z","Content":"\n\u003Cp\u003EThe problem concerning actual payout and the log still exists. In the following, I received the payout of $210,000. The log shows $150,000. the bottom of the image shows the log entries.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QJCZ2ve.jpg\u0022 alt=\u0022QJCZ2ve.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-07-16T22:02:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BioHaZarD.PT\u0022 data-cite=\u0022BioHaZarD.PT\u0022\u003E\u003Cdiv\u003EThey say the available missions depend on your reputation, so maybe other missions become available as you go along. Still... I imagine there will be plenty of room for improvement via MCE.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP 0.24 will NOT provide funds for parts that are parachuted back to Kerbin. MCE does pay for recycling/recovery.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Coffee_Zombie\u0022 data-cite=\u0022Coffee_Zombie\u0022\u003E\u003Cdiv\u003ESo I\u0027m confused by that because the .zip file states BSP missions not supported! Are you referring to those or another .zip file?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe missions do work. However, if there is a bug in the mission, malkuth WILL NOT modify MCE to prevent the bug. I\u0027ve found only one bug in the BSP missions; the repair mission. When completed, you are not paid. The workaround is simply to add the funds to your cash total after closing the KSP program.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-16T22:06:21Z\u0022 title=\u002207/16/2014 10:06  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 16, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2014-07-18T06:48:56Z","Content":"\n\u003Cp\u003Ei was literally just starting to build my own personal twin custom story missions in mission controller when this update came out. i have finally worked out my tech tree. as others have stated misison controller can definitely fill in some glaring gaps i\u0027ve seen. i think it\u0027s interesting how the stock contract system resembles mission controller at some core levels (auto-loaning, and such). i still see a future in sandbox mode, as not everyone wants to do the tech grind but still wants to run a space program. absolutely loved this mod it has been integral to my entire approach to ksp as an engineering and strategy game.\u003C/p\u003E\n"},{"CreatedByName":"slay_mithos","CreatedById":76152,"CreatedDateTime":"2014-07-18T09:37:18Z","Content":"\n\u003Cp\u003EIt just occured to me what \u0022RSS\u0022 from the mission pack meant, it\u0027s for the real solar system mod.\u003C/p\u003E\u003Cp\u003EThis explains why it made no sense with the altitudes and coordinates.\u003C/p\u003E\u003Cp\u003EIt might be good to state what this stands for in the first post, for people that might not know what abbreviations might mean.\u003C/p\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2014-07-18T15:37:19Z","Content":"\n\u003Cp\u003EMalkuth, NEW stagerecovery mod! \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86677-0-24-StageRecovery-Recover-Funds-from-Dropped-Stages-v1-0-%287-18-14%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86677-0-24-StageRecovery-Recover-Funds-from-Dropped-Stages-v1-0-%287-18-14%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think all you need worry about is custom missions now. Unless you want a more complex recovery system. Just heads up. Cheers.\u003C/p\u003E\u003Cp\u003EHere\u0027s another that looks a bit more refined. DebRefund \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86691-0-24-DebRefund\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86691-0-24-DebRefund\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-18T17:44:05Z\u0022 title=\u002207/18/2014 05:44  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 18, 2014\u003C/time\u003E by UAL002\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StarLiner","CreatedById":64071,"CreatedDateTime":"2014-07-18T17:58:58Z","Content":"\n\u003Cp\u003EI\u0027d enjoy recovery of funds being an unlockable tech like in MCE, it makes you feel more accomplished.\u003C/p\u003E\u003Cp\u003EI\u0027m hoping whatever becomes of MCE after .24 makes the game more difficult as well, getting funds is a breeze at the moment.\u003C/p\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2014-07-18T22:25:59Z","Content":"\n\u003Cp\u003EI do agree that part recovery should have to be unlockable. My previous post was merely a heads up.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-07-18T23:50:33Z","Content":"\n\u003Cp\u003EWish I could play. Won\u0027t have internet house until sat night. Still have not played .24.\u003C/p\u003E\u003Cp\u003EOr had a look.\u003C/p\u003E\n"},{"CreatedByName":"Artophwar","CreatedById":65084,"CreatedDateTime":"2014-07-19T01:49:20Z","Content":"\n\u003Cp\u003EIm hoping this mod continues in some form. I would like to see some of the mission types that MCE had added to the new contracts system. Maybe MCE could also add difficulty settings to the stock game. Currently it is way to easy to make money and it becomes irrelevant quickly. I understand that the new update will probably require a lot of reworking and potentially starting over but I think the the name should continue on even it really has little of the code from the original.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-07-19T02:13:02Z","Content":"\n\u003Cp\u003EOh it will continue. Reading how easy it is might be a good idea to keep mce price algorithm in place and call it something like hard mode. And up all the part prices automatically.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T02:15:17Z\u0022 title=\u002207/19/2014 02:15  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2014-07-19T13:10:14Z","Content":"\n\u003Cp\u003EI like having more money in stock, it gives me more spending cash to blow on stupid rockets every now and again. Then back to the grind.\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-07-19T13:14:08Z","Content":"\n\u003Cp\u003EI suggest that that the parts recovery/recycling either be removed from MCE or made optional via the settings. DebRefund mod (see UAL002\u0027s post #1980) now performs that function very well and is integrated into the stock Mission messages panel. I would prefer that DebRefund not conflict with MCE, whereby, I would either be refunded twice or the functions would get confused and not refund at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T13:17:46Z\u0022 title=\u002207/19/2014 01:17  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"slay_mithos","CreatedById":76152,"CreatedDateTime":"2014-07-19T13:23:20Z","Content":"\n\u003Cp\u003EHum, if MCE kept the refund, then what would be the point in installing an other mod for refunds?\u003C/p\u003E\u003Cp\u003EI\u0027m a bit confused...\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-07-19T15:16:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022slay_mithos\u0022 data-cite=\u0022slay_mithos\u0022\u003E\u003Cdiv\u003EHum, if MCE kept the refund, then what would be the point in installing an other mod for refunds?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDebRefund and MCE use different algorithms to determine payout. DebRefund is integrated into the stock message queue; MCE is not.\u003C/p\u003E\u003Cp\u003EKSP refunds for parts that you land with, such as the command module and probes; MCE does this as well. Therefore, MCE and stock KSP will conflict. At the least, that payout needs to be removed from MCE.\u003C/p\u003E\u003Cp\u003EMy suggestion is to give players a choice of DEBRIS payout algorithms when they want to use MCE\u0027s mission generation capabilities, but not payout. Or, by removing from MCE entirely, malkuth can concentrate on mission generation, which is the core function of MCE.\u003C/p\u003E\u003Cp\u003ESee...nothing to be confused about.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T20:20:23Z\u0022 title=\u002207/19/2014 08:20  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2014-07-19T15:39:59Z","Content":"\n\u003Cp\u003EYea, and there is still plenty of custom missions for MCE to add. Im really looking forward to more realistic MCE style missions like before. Some of the stock missions are a bit silly. Fun, but silly. Its nice to have choice though. Apollo13, now we just need to pester the DebRefund guy to make a config option to make the recycling purchasable with science.\u003C/p\u003E\n"},{"CreatedByName":"StarLiner","CreatedById":64071,"CreatedDateTime":"2014-07-19T21:39:15Z","Content":"\n\u003Cp\u003EI personally dislike DebRefund style systems. Reusability should be challenging and rewarding. Something you design your launch vehicle around. Merely strapping parachutes on boosters feels a bit cheap because it requires little effort even with basic low tech parts. That\u0027s just my POV though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI like having more money in stock, it gives me more spending cash to blow on stupid rockets every now and again. Then back to the grind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why I think difficulty levels like MCE had would be perfect. I personally prefer orbital or Mun missions to net a relatively small profit, encouraging you to spend your own hard earned funds on infrastructure to make them cheaper and more profitable as you go. Others prefer higher payout to reduce grind. Difficulty levels let players play as they wish.\u003C/p\u003E\u003Cp\u003EPart of me loves the idea of having the old price algorithm back, but the beauty of the new fund system is it\u0027s universal. Modders can add in prices they feel are balanced, without MCE spitting out a ludicrous price as it would for certain mods.\u003C/p\u003E\u003Cp\u003EWhat about difficulty levels in the form of multipliers on prices and rewards?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T21:45:00Z\u0022 title=\u002207/19/2014 09:45  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by StarLiner\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-07-20T04:32:16Z","Content":"\n\u003Cp\u003EDevelopment update:\u003C/p\u003E\u003Cp\u003EAlright had a chance to look at ksp .24 real quick and have come to this conclusion. I will completely rewrite mce. \u003C/p\u003E\u003Cp\u003EI will be releasing at first preview versions.\u003C/p\u003E\u003Cp\u003EPreview 1 I will try to get out by end of this week. Will focus on the economics of mce. \u003C/p\u003E\u003Cp\u003EIncluding.\u003C/p\u003E\u003Cp\u003EHire of kerbals: kerbals cost money.\u003C/p\u003E\u003Cp\u003ESalaries of astronauts based on rep. The better rep u have cheaper astronauts pay is. The worse rep the higher the pay.\u003C/p\u003E\u003Cp\u003EMaintance. Keeping a space center running cost money again better rep you have the cheaper maintenance cost, bad rep means higher cost.\u003C/p\u003E\u003Cp\u003EKerbal support personnel. For every kerbal astronaut you have a certain amount of support personnel are needed: (maybe will be included)\u003C/p\u003E\u003Cp\u003EDifficulty levels I will use my experience with editing part prices and add a multiplier to all parts. For instance.\u003C/p\u003E\u003Cp\u003EEasy mode: default ksp prices.\u003C/p\u003E\u003Cp\u003EModerate mode: all part prices modifier of 1.5x or higher (take some testing)\u003C/p\u003E\u003Cp\u003EHardcore mode: all part prices modifier of 2x or higher. Higher kerbal hire cost, maintenance and support.\u003C/p\u003E\u003Cp\u003EReturn of test flights. Want to test your rockets first? Well revert will cost you money testing(Maybe included not sure)\u003C/p\u003E\u003Cp\u003EI know that a few mods have added auto recycle but I plan on including my autoreycle in mce. But will give you options of turning it off in favor of one of the other mods.\u003C/p\u003E\u003Cp\u003EAuto recycle will include parachutes and rocket assisted.\u003C/p\u003E\u003Cp\u003EThat will most likely be it for prerelease 1.\u003C/p\u003E\u003Cp\u003EMight not be much I can do about ksp recover being available right away, but for sure mce autoreycle will require a tech level purchase! And rocket assisted will be a higher tier!\u003C/p\u003E\u003Cp\u003EPrerelease 2 will start converting mce missions to ksp 24 contracts. Fleshing out any other issues that might exist.\u003C/p\u003E\u003Cp\u003EIncluding \u003C/p\u003E\u003Cp\u003Erepair missions\u003C/p\u003E\u003Cp\u003EDocking\u003C/p\u003E\u003Cp\u003ESatellite delivery\u003C/p\u003E\u003Cp\u003EMce orbital research\u003C/p\u003E\u003Cp\u003EMce rover research\u003C/p\u003E\u003Cp\u003EEva missions\u003C/p\u003E\u003Cp\u003EAgain as mce will require a rewrite the time frame might be a little off, matters how much time I have to get it done.\u003C/p\u003E\u003Cp\u003EAny questions feel free to ask or make suggestions.\u003C/p\u003E\u003Cp\u003EThanks malkuth.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-20T04:36:03Z\u0022 title=\u002207/20/2014 04:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 20, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2014-07-20T04:38:46Z","Content":"\n\u003Cp\u003EIf you need artwork, you have my fingers... wait that doesn\u0027t sound right.\u003C/p\u003E\n"},{"CreatedByName":"veryinky","CreatedById":71372,"CreatedDateTime":"2014-07-20T05:49:22Z","Content":"\n\u003Cp\u003EThe missions I miss the most in .24 are MCE\u0027s satellite missions. I loved placing satellites in orbit, especially geostationary ones. \u003C/p\u003E\u003Cp\u003ERemotetech 2 and SCANsat missions would be my suggestion. \u003C/p\u003E\u003Cp\u003EThat and EVA missions to anomalies, should be a fun challenge to land near one.\u003C/p\u003E\n"},{"CreatedByName":"slay_mithos","CreatedById":76152,"CreatedDateTime":"2014-07-20T06:00:55Z","Content":"\n\u003Cp\u003EWhat I\u0027d love to suggest is the ability to take on multiple missions, by locking the current one to a specific vessel.\u003C/p\u003E\u003Cp\u003EAt the start, it doesn\u0027t have much use, but as you get missions to other planets, there is all the wait for a transfer window and right now, you need to name the vessel in order to remember what mission to take when the time comes.\u003C/p\u003E\u003Cp\u003EAs I understand it, it should be possible, seeing that the \u0022ownership change\u0022 missions keep a text in the mission box afterwards.\u003C/p\u003E\n"},{"CreatedByName":"BioHaZarD.PT","CreatedById":106836,"CreatedDateTime":"2014-07-20T07:05:34Z","Content":"\n\u003Cp\u003EI miss satellite missions too, and I\u0027d like to see them in .24. Also missions to launch a space station and then resupply and replace the Kerbals aboard it once in a while. You know... more realistic type of missions. Personally I find all the part testing contracts in .24 to be mostly annoying. \u003C/p\u003E\u003Cp\u003EIn terms of UI Squad could have learned a thing or two with MCE. A cost break down window would be useful. As would some way to check contract rewards without going to the Mission Control building. When you complete a contract you don\u0027t even get a reminder of how much you made. MCE put all those numbers front and center. Made them seem important. In KSP .24 I even forget about the money after a while.\u003C/p\u003E\u003Cp\u003EHere\u0027s another idea: contracts to land on a specific biome (on Kerbin, Moon or Minmus) to collect science. Instead of just landing wherever we want.\u003C/p\u003E\n"},{"CreatedByName":"TheDamDog","CreatedById":110766,"CreatedDateTime":"2014-07-20T07:10:25Z","Content":"\n\u003Cp\u003EAny plans for MCE to expand on vanilla contracts? I\u0027ve been using MCE for a while and quite enjoy some of the missions available. It\u0027d be great to see them integrated into vanilla KSP!\u003C/p\u003E\u003Cp\u003EOr would that be a separate mod?\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-07-20T08:01:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDamDog\u0022 data-cite=\u0022TheDamDog\u0022\u003E\u003Cdiv\u003EAny plans for MCE to expand on vanilla contracts? I\u0027ve been using MCE for a while and quite enjoy some of the missions available. It\u0027d be great to see them integrated into vanilla KSP!\u003Cp\u003EOr would that be a separate mod?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi damdog read the development update a few post above this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-07-20T15:49:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003EI know that a few mods have added auto recycle but I plan on including my autoreycle in mce. But will give you options of turning it off in favor of one of the other mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am looking forward to MCE vers. 2.0.\u003C/p\u003E\u003Cp\u003EHowever, the above quote concerns me. As I mentioned above, KSP 0.24 also includes recovery/recycling of parts that you land with (not parachuted debris). MCE must account for this core feature , unless MCE can modify it directly as well.\u003C/p\u003E\n"},{"CreatedByName":"slay_mithos","CreatedById":76152,"CreatedDateTime":"2014-07-20T20:17:23Z","Content":"\n\u003Cp\u003EKnowing that he is doing a full rewrite, it would be odd not to take into account what vanilla KSP provides.\u003C/p\u003E\n"}]}