{"TopicId":40183,"ForumId":34,"TopicTitle":"(KSP 1.10 \u002B 1.12 ) Mission Controller 3.2.0 (Final Version) (Updated 6/25/2021)","CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2013-07-31T01:19:13Z","PageNum":37,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-01-15T05:30:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003Eyup just delete the PartGoal Try to keep the hashes in place for the other goals though. I will go through these and fix them myself for next update. Hopefully coming soon.\u003Cp\u003EI want to add support for realfuels, and the LifeSupport mods before I upload.. Oh and Intersteller and warp.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks malkuth. I deleted most in stock and random. But as for Bootstraps ( which so far has been working for me ).. its a wall of text unfortunately and theres ALOT. So.. would it be possible to make a module manager config that can delete PartGoal?\u003C/p\u003E\u003Cp\u003EEDIT ... Would deleting the text PartGoal be enough to disable them? ( or not break the mod ) If I can leave the other text in then I can Delte All\u0026gt;PartGoal.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-15T05:35:10Z\u0022 title=\u002201/15/2014 05:35  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 15, 2014\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-15T06:07:02Z","Content":"\n\u003Cp\u003EThe Stuff Colored Bold Red is what you want to delete.. The first case is the LaunchGoal that is giving everyone issues in Bootstrap.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMission\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Kerra I\u003Cbr\u003E\t\tdescription = Launch from the Kerbal Space Center (KSC), climb high within Kerbin\u0027s atmosphere, and safely land. \u003Cbr\u003E\t\treward = 30000\u003Cbr\u003E\t\tcategory = MANNED, AVIATION\u003Cbr\u003E\t\tpackageOrder = 1\u003Cbr\u003E\u003Cbr\u003E\t\t[B][COLOR=\u0022#FF0000\u0022]LaunchGoal\u003Cbr\u003E\t\t{\u003Cbr\u003E\t\t\tdescription = Launch from the surface. \u003Cbr\u003E\t\t\tlaunchZone = Kerbin\u003Cbr\u003E\t\t}[/COLOR][/B]\u003Cbr\u003E\u003Cbr\u003E\t\tOrbitGoal\u003Cbr\u003E\t\t{\u003Cbr\u003E\t\t\tdescription = Reach an altitude between 10 and 60 kilometers. \u003Cbr\u003E\t\t\tbody = Kerbin\u003Cbr\u003E\t\t\tcrewCount = 1\u003Cbr\u003E\t\t\tminAltitude = 10000\u003Cbr\u003E\t\t\tmaxAltitude = 60000\u003Cbr\u003E\t\t}\u003Cbr\u003E\u003Cbr\u003E\t\tLandingGoal\u003Cbr\u003E\t\t{\u003Cbr\u003E\t\t\tdescription = Safely land the vessel. \u003Cbr\u003E\t\t\tbody = Kerbin\u003Cbr\u003E\t\t}\u003Cbr\u003E\t}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis next part is for partGoals. Again in red delete. This is from the Default mission pack \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMission\u003Cbr\u003E    {\u003Cbr\u003E        name = Sputnik IV\u003Cbr\u003E        description = A special mission has been requested by a climate research facility on Kerbin. Limited data is available on the north pole of Kerbin itself, but a space-based probe would provide us a unique opportunity to fully map and analyze its topology.\\n\\nConstruct such a probe and place it into a circular polar orbit, maintaining stability for at least 2 hours in order to capture sufficient data.\u003Cbr\u003E\u003Cbr\u003E        reward = 65000\u003Cbr\u003E\t\tscienceReward = 30\u003Cbr\u003E        category = ORBIT, PROBE\u003Cbr\u003E\u003Cbr\u003E        requiresMission = Mun I\u003Cbr\u003E        packageOrder = 8\u003Cbr\u003E\u003Cbr\u003E        SubMissionGoal\u003Cbr\u003E        {\u003Cbr\u003E            description = Bring a sensor package into a high circular polar orbit around Kerbin.\u003Cbr\u003E\u003Cbr\u003E            OrbitGoal\u003Cbr\u003E            {\u003Cbr\u003E                body = Kerbin\u003Cbr\u003E\u003Cbr\u003E                minPeA = 300000\u003Cbr\u003E                maxApA = 350000\u003Cbr\u003E                maxEccentricity = 0.01\u003Cbr\u003E\u003Cbr\u003E                minInclination = 87\u003Cbr\u003E                maxInclination = 93\u003Cbr\u003E            }\u003Cbr\u003E\u003Cbr\u003E            [B][COLOR=\u0022#FF0000\u0022]PartGoal\u003Cbr\u003E            {\u003Cbr\u003E                partName = longAntenna\u003Cbr\u003E                partCount = 3\u003Cbr\u003E            }\u003Cbr\u003E\u003Cbr\u003E            PartGoal\u003Cbr\u003E            {\u003Cbr\u003E                partName = sensorAccelerometer\u003Cbr\u003E                partCount = 1\u003Cbr\u003E            }\u003Cbr\u003E\u003Cbr\u003E            PartGoal\u003Cbr\u003E            {\u003Cbr\u003E                partName = sensorBarometer\u003Cbr\u003E                partCount = 1\u003Cbr\u003E            }\u003Cbr\u003E\u003Cbr\u003E            PartGoal\u003Cbr\u003E            {\u003Cbr\u003E                partName = sensorGravimeter\u003Cbr\u003E                partCount = 1\u003Cbr\u003E            }\u003Cbr\u003E\u003Cbr\u003E            PartGoal\u003Cbr\u003E            {\u003Cbr\u003E                partName = sensorThermometer\u003Cbr\u003E                partCount = 1\u003Cbr\u003E            }[/COLOR][/B]\u003Cbr\u003E        }\u003Cbr\u003E    }\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA Goal Starts Like This\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EPartGoal\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe parts under it are also part of the goal in the hashes.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E        {\u003Cbr\u003E                partName = sensorThermometer\u003Cbr\u003E                partCount = 1\u003Cbr\u003E         }\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAs long as this is all you delete you should be all set.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-15T06:47:57Z","Content":"\n\u003Cp\u003EOne thing I\u0027ve found this mod does is make me appreciate solid fuel boosters a lot more. They\u0027re so darn CHEAP, and that makes it worth it to put up with their annoyances. I\u0027ve been launching my payloads in such a fashion that liquid fuel is only used for the uppermost stage (where you start to need the control and the ability to adjust throttle to fine tune things).\u003C/p\u003E\u003Cp\u003EAlthough, this is probably just a \u0027broken\u0027 thing about KSP\u0027s stock parts game balance. Once SQUAD issues the next update where money starts to matter in the stock game, I can imagine they will find a need to redress this imbalance.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-15T23:35:03Z","Content":"\n\u003Cp\u003EWhen writing your own mission files for this mod, is there support for writing a \u0022NOT\u0022 condition?\u003C/p\u003E\u003Cp\u003EFor example, I might like to make a mission file which has the condition \u0022Must NOT contain an LV-N nuclear engine\u0022, or \u0022Must NOT contain one of the following command core modules...\u0022.\u003C/p\u003E\u003Cp\u003EThe reason I\u0027m asking is that I\u0027m considering what it would take to make a suite of missions designed for people using the kOS mod, which provides a way to make automated scripts to run robotic probes without the player\u0027s manual input. I\u0027d like to be able to make missions that contain conditions that require craft to be robotic and prevent manual control.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-01-16T04:12:45Z","Content":"\n\u003Cp\u003EI added that, IIRC. NOT and OR. They\u0027re not nestable though, they work like submission goals (the NOT or OR must be root, under which can only be regular goals).\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-17T05:03:20Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ERelease 1 DeveloperVersion2 For Mission Controller Extended.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell I have been working on this all week. And well even though its not done totally, I think its ready for more testing. (can\u0027t stand to look at screen anymore). So in the case of this new release, i\u0027m releasing it as a Developer version for anyone that want to can test. I don\u0027t want to make it official until I know for sure all the bugs are squashed, and finish it up a little more.\u003C/p\u003E\u003Cp\u003EAnyway whats New? The list is long.\u003C/p\u003E\u003Cp\u003E1. New Contract System. The contract system gives you random missions. At this moment there is only 4 Base Missions, 3 Sat Deliveries and a repair mission. The base missions are just that. What makes the contracts different is that\u003C/p\u003E\u003Cp\u003Eeach contract is funded by a company. And every company has a different view on what it pays you. In the case of this release we are only worried about 2. Payments and Science. At this moment there is only 5 Companies. But each one is different and pays different.\u003C/p\u003E\u003Cp\u003E2. Repair Goal is completely rewritten. It now requires a resource called repair parts. You still need the RepairStation to actually be able to complete the missions. The basic jist of it.\u003C/p\u003E\u003Cp\u003E a. You launch satellites into orbit with repairStations and your choice of docking ports. (contract missions). Every once in awhile you get a contract to repair a vessel. You construct a repair vessel. Make sure it has docking ability. Get into space and capture the target vessel (dock, or whatever you use to grab and dock). You then need to transfer the repair parts from you Repair Canisters to the RepairStation Located on the Satellite. After transfer is complete (takes 1 repair part) you go EVA and get near the RepairStation and select Repair in the right click context menu. Mission Complete. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E b. Yes mission controller at this time can and will find vessels with the repairStation on them. The sad news is that Im having issues getting this random part of the system working correct. So it only selects the First Vessel in the list (usually the last one you launched) I will fix this at a later date. But for now you don\u0027t really have to worry about what vessel you repair.. Its not tracked. (you still see the vessel listed in contract though).\u003C/p\u003E\u003Cp\u003E3. Contracts are generated every in game 24 hours (this will be increased later to 1 week) so basically 4 kerbal days.. (or is it 2?)\u003C/p\u003E\u003Cp\u003E4. For career players the contracts are meant for mid game use. When the system is complete it will infact be another research item for MCE research tree. But for now it is open. But you do need Unmanned ability to actually take advantage of contracts.\u003C/p\u003E\u003Cp\u003E5. Contracts payout a pretty good amount money. Eventually this will have a draw back. Because contracts come with Binding terms. If fail pay full price contract \u002B company %. (not yet implemented)\u003C/p\u003E\u003Cp\u003E6. Lots of new regular missions added. Tweaked some of the Early missions for career mode. Think you will like the first one now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Hope.\u003C/p\u003E\u003Cp\u003EFixed a bunch of bugs like science not getting payed out.\u003C/p\u003E\u003Cp\u003EOh about contracts they are based on a weight system. Meaning that certain contracts have a chance to appear (only 1 at a time right now). Also there is a chance of no contracts appearing also. This is important. Don\u0027t report you don\u0027t see contracts! There is a 30% chance per the 24 Hour check you won\u0027t even get one!!\u003C/p\u003E\u003Cp\u003EHighly suggest you backup any current game you are using right now. Thats why this is not an official release.!!\u003C/p\u003E\u003Cp\u003ECan\u0027t think of anything else.. Tired. GoodNite!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/2a8qqo44vayw75z/MissionControllerDevBuild2.rar\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EMissionController Dev Build 2.\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/i625yHeif-U?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-18T21:50:27Z\u0022 title=\u002201/18/2014 09:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 18, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-17T05:53:34Z","Content":"\n\u003Cp\u003EI just installed the dev2 version. I\u0027ve noticed in the Current Mission Window that I can\u0027t select the \u0022Contracts\u0022 package when I push the Package button. It\u0027s grayed out:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/upaWXxI.jpg\u0022 alt=\u0022upaWXxI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m a bit new to the mod, just installed it tonight (but loving it so far!). Could you explain what I should be seeing? Which package should I select?\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-17T06:57:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003EI just installed the dev2 version. I\u0027ve noticed in the Current Mission Window that I can\u0027t select the \u0022Contracts\u0022 package when I push the Package button. It\u0027s grayed out:\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/upaWXxI.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/upaWXxI.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m a bit new to the mod, just installed it tonight (but loving it so far!). Could you explain what I should be seeing? Which package should I select?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a new icon for contracts. Its the one right next to the down arrow. First on left in the picture. You can\u0027t open contracts with the Mission Browser. Contracts are there own new system. Even though they both use the same values, I had to keep them separate for people could not just select them.\u003C/p\u003E\u003Cp\u003EThe contracts are only available every 24 hours in game time. And sometimes they can be skipped. At this time only 1 can show. But in the future I will have them categorized into a bunch where maybe 2 or 4 at a time. Matters how much of a chug the random system puts on the game. Stuff like that has to be tested. (should be very minimal, since its called at only certain times)\u003C/p\u003E\u003Cp\u003EI will put a video together to help people out with the new system and how it works.\u003C/p\u003E\u003Cp\u003EAlso the best mission package is random one. If your in career mode it helps you get off your feet. Contracts is meant more for Mid Game when you get Unmanned Vessels. If your in sandbox it doesn\u0027t matter since there is not science or things to research.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-17T07:56:15Z\u0022 title=\u002201/17/2014 07:56  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 17, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-17T09:22:02Z","Content":"\n\u003Cp\u003EWhat is the reference direction used to calculate the Longitude of the Ascending Node in KSP?\u003C/p\u003E\u003Cp\u003ESome of the missions for Comsat satellites require specific orbits with specific inclinations and a required LAN for the inclination is specified. But without knowing what the KSP universe uses as it\u0027s reference direction, I\u0027m just guessing randomly as to when I should launch to get near the target LAN.\u003C/p\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2014-01-17T12:12:34Z","Content":"\n\u003Cp\u003EI\u0027ve gone through MCContracts to fix some grammar and stuff as the random capitalized words were starting to bug me.\u003C/p\u003E\u003Cp\u003EHere\u0027s the cfg file if you\u0027re okay with using it for the release\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/kv66lko4kzff1kf/MCContracts.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/kv66lko4kzff1kf/MCContracts.cfg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-17T17:08:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theSpeare\u0022 data-cite=\u0022theSpeare\u0022\u003E\u003Cdiv\u003EI\u0027ve gone through MCContracts to fix some grammar and stuff as the random capitalized words were starting to bug me.\u003Cp\u003EHere\u0027s the cfg file if you\u0027re okay with using it for the release\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/kv66lko4kzff1kf/MCContracts.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/kv66lko4kzff1kf/MCContracts.cfg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E replaced it in the download.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-17T17:13:48Z\u0022 title=\u002201/17/2014 05:13  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 17, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snillum101","CreatedById":34419,"CreatedDateTime":"2014-01-18T01:09:11Z","Content":"\n\u003Cp\u003EI\u0027ve been playing the new DevBuild and I love the contract system. Its a far more immersive way to get satellite missions. I\u0027ve not found any bugs (other than those mentioned in the update post) however I do have some feedback about the new systems:\u003C/p\u003E\u003Cp\u003E-It would be great to have several contracts pop up at once but you are only able to choose one to fulfil. This could represent the player with more choice whilst still requiring a decision. \u003C/p\u003E\u003Cp\u003E-A readout/countdown timer that tells you when the next chance of getting a contract is going to come up would be cool.\u003C/p\u003E\u003Cp\u003E-Some multi-stage contracts would be good. Have say a company ask you to launch 3 satellites into different orbits and you only get paid at the end.\u003C/p\u003E\u003Cp\u003EThese are just my opinions though. Thanks for the great update.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-18T03:34:23Z","Content":"\n\u003Cp\u003EThanks for the feedback. I will be adding more missions to it for next update and the ability to have more than 1 at a time. I plan on seperate bg them into catagories. Service contracts. Satellite missions. And I plan on doing research type missions like land in this biome with rover. So it will be expanded.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-18T03:38:41Z","Content":"\n\u003Cp\u003ETonight while playing with the dev build, I noticed that when I reverted back to the VAB from one flight, I still lost all of my money for starting that flight. Is this intended behavior? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TomatoSoup","CreatedById":59394,"CreatedDateTime":"2014-01-18T05:28:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003ETonight while playing with the dev build, I noticed that when I reverted back to the VAB from one flight, I still lost all of my money for starting that flight. Is this intended behavior? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. You should always use the Revert to VAB button provided by the mod itself.\u003C/p\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2014-01-18T05:29:11Z","Content":"\n\u003Cp\u003EOh, got it. Bit of a newbie question here... where is that button? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-18T05:31:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003ETonight while playing with the dev build, I noticed that when I reverted back to the VAB from one flight, I still lost all of my money for starting that flight. Is this intended behavior? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes the revert button sets your save back to right before you first entered the van before launch. This is how it works. The revert button is not an mce feature but a ksp feature. All I have done is make sure the ksp save and mce save stay in sync. \u003C/p\u003E\u003Cp\u003ESo basically revert is the magic this did not really happen button. Including any recycling or bonus payments you might of received during that flight.\u003C/p\u003E\u003Cp\u003ENow if your losing money from other flights that you already finished. Might be a problem.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-18T05:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003EOh, got it. Bit of a newbie question here... where is that button? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s with the icons in flight mode only. And looks like an arrow doing a reverse.\u003C/p\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2014-01-18T18:09:40Z","Content":"\n\u003Cp\u003EI can report that the MCE settings and MCE current Budget guibuttons dont work in the devbuild\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at MissionController.MissionController.OnGUI () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E(Filename:  Line: -1)\u003Cbr\u003E\u003Cbr\u003EArgumentException: Getting control 0\u0027s position in a group with only 0 controls when doing Repaint\u003Cbr\u003EAborting\u003Cbr\u003E  at UnityEngine.GUILayoutGroup.GetNext () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayoutUtility.BeginLayoutGroup (UnityEngine.GUIStyle style, UnityEngine.GUILayoutOption[] options, System.Type LayoutType) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout.BeginVertical (UnityEngine.GUIContent content, UnityEngine.GUIStyle style, UnityEngine.GUILayoutOption[] options) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout.BeginVertical (UnityEngine.GUILayoutOption[] options) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at MissionController.MissionController.drawbudgetwindow (Int32 id) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout\u002BLayoutedWindow.DoWindow (Int32 windowID) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUI.CallWindowDelegate (UnityEngine.WindowFunction func, Int32 id, UnityEngine.GUISkin _skin, Int32 forceRect, Single width, Single height, UnityEngine.GUIStyle style) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis nre happens only once but the Buttons dont respond\u003C/p\u003E\u003Cp\u003ERunning no mods other than the toolbar plugin mce and texture compressor(overriding mce folder) plugin ill try without it completly later just to rule it out\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-18T18:26:00Z\u0022 title=\u002201/18/2014 06:26  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 18, 2014\u003C/time\u003E by landeTLS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-18T20:42:39Z","Content":"\n\u003Cp\u003EMission 6 from \u0022random\u0022 pack has the following minor problem:\u003C/p\u003E\u003Cp\u003EThe text of the mission description claims it\u0027s a mission to explore the crater-like formation on Kerbin. BUT the actual latitutde numbers the mission uses to decide if you\u0027ve succeeded are off if that\u0027s the goal. Half the crater is too far south to fit in the latitude range given.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-18T21:11:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022landeTLS\u0022 data-cite=\u0022landeTLS\u0022\u003E\u003Cdiv\u003EI can report that the MCE settings and MCE current Budget guibuttons dont work in the devbuild\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at MissionController.MissionController.OnGUI () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E(Filename:  Line: -1)\u003Cbr\u003E\u003Cbr\u003EArgumentException: Getting control 0\u0027s position in a group with only 0 controls when doing Repaint\u003Cbr\u003EAborting\u003Cbr\u003E  at UnityEngine.GUILayoutGroup.GetNext () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayoutUtility.BeginLayoutGroup (UnityEngine.GUIStyle style, UnityEngine.GUILayoutOption[] options, System.Type LayoutType) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout.BeginVertical (UnityEngine.GUIContent content, UnityEngine.GUIStyle style, UnityEngine.GUILayoutOption[] options) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout.BeginVertical (UnityEngine.GUILayoutOption[] options) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at MissionController.MissionController.drawbudgetwindow (Int32 id) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUILayout\u002BLayoutedWindow.DoWindow (Int32 windowID) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at UnityEngine.GUI.CallWindowDelegate (UnityEngine.WindowFunction func, Int32 id, UnityEngine.GUISkin _skin, Int32 forceRect, Single width, Single height, UnityEngine.GUIStyle style) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis nre happens only once but the Buttons dont respond\u003C/p\u003E\u003Cp\u003ERunning no mods other than the toolbar plugin mce and texture compressor(overriding mce folder) plugin ill try without it completly later just to rule it out\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDelete your config.xml file. Your windows have somehow gone off screen. And since MCE saves screen positions, they have been saved off screen.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-19T06:32:38Z","Content":"\n\u003Cp\u003EIn the devbuild\u0027s randommissions configuration there seems to be a bug with the prerequisites for several of the missions. It seems that the requiredMission field needs to be an exact string match with the title of the earlier mission. If a mission\u0027s title text changes in a release, all other future missions that required it for a prerequisite become impossible to ever unlock unless they change their requireMission field to use the new title. There\u0027s several places I saw in the devbuild where mission prerequisites are broken and I think it\u0027s because mission titles changed:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 16 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 11 - Mid Years Station Construction\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut mission 11 is now called \u002211 - Early Manned Missions Landing Minmus\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 15 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Station Construction\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 17 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 11 - Mid Years Station Construction\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut mission 11 is now called \u002211 - Early Manned Missions Landing Minmus\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 15 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Station Construction\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 19 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 7 - Early Manned Missions Landing Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 7 is now called \u0022Early Missions Landing Trails\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 9 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 9 - Early Manned Missions Landing Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 20 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 9 - Early Manned Missions Landing Minmus\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 9 is now called \u0022Early Manned Missions Landing Mun\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 11 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 11 - Early Manned Missions Landing Minmus\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 34 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 27 - Launch Satellite Into High Orbit\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 27 is now called \u0022Random Minmus Probe\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 33 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 33 - Launch Satellite Into High Orbit\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 35 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 36 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 37 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 38 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 39 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission 40 cannot be unlocked:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 15 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut Mission 15 is now called \u002215 - Mid Years Station Construction\u0022.\u003C/p\u003E\u003Cp\u003EProposed correction: Change prerequisite to mission 19 instead:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\trequiresMission = 19 - Mid Years Large Manned Mission Mun\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-19T07:51:50Z\u0022 title=\u002201/19/2014 07:51  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 19, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-19T09:17:16Z","Content":"\n\u003Cp\u003EOh these are my fault I added about 5 new missions to the random missions and forgot to change the numbers on requirements part of missions. Right now they are set to the old numbers.\u003C/p\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2014-01-19T12:20:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003EDelete your config.xml file. Your windows have somehow gone off screen. And since MCE saves screen positions, they have been saved off screen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyep, that was it. i guess i saw myself blind on the nre\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-01-19T21:06:44Z","Content":"\n\u003Cp\u003EOk guys I fixed the wrong refrence names in the random missions pack. Updated the dev download with new file. Should be able to work them now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}