{"TopicId":40309,"ForumId":32,"TopicTitle":"new to the game - why no multiplayer?","CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T18:00:22Z","PageNum":1,"Articles":[{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T18:00:22Z","Content":"\n\u003Cp\u003ESo i was looking through the \u0022suggestion\u0022 area of the forum, and noticed the thread \u0022what not to suggest\u0022 and it had multiplayer listed as \u0022never part of the game\u0022\u003C/p\u003E\u003Cp\u003E...Why?\u003C/p\u003E\u003Cp\u003EThis game seems like such a natural for at least a co-op, not to mention the realism of having multiple people controlling multiple things. I dunno, I play with a couple of friends, and we just end up streaming each others screens.. but the game would be 100% better with some sort of multiplayer (IMO)\u003C/p\u003E\n"},{"CreatedByName":"bowdlerize","CreatedById":31701,"CreatedDateTime":"2013-07-31T18:04:26Z","Content":"\n\u003Cp\u003EEmail received from \u003Ca href=\u0022/cdn-cgi/l/email-protection#ebcedca9849b9f828485cedcaf\u0022\u003E\u003Cspan class=\u0022__cf_email__\u0022 data-cfemail=\u0022365f585059765d534454575a45465755534644595144575b1855595b\u0022\u003E[email\u0026#160;protected]\u003C/span\u003E\u003C/a\u003E 07/26/2013 states: \u0022We haven\u0027t officially discussed anything concrete about multiplayer, everything posted on the forums are just user\u0027s opinions, speculation and gossip.\u0022 While thread is marked \u0022Official\u0022 response from customer support indicates information is incorrect. Multiplayer has been stated in the past as \u0022after release\u0022 which is too far away to declare this feature dead.\u003C/p\u003E\u003Cp\u003ESquad has however mentioned multiplayer as a possible option for a future DLC.[8]\u003C/p\u003E\u003Cp\u003EIt has been suggested to death \u0026amp; is on the \u0022do not suggest\u0022 list.\u003C/p\u003E\n"},{"CreatedByName":"BigBoy734","CreatedById":58483,"CreatedDateTime":"2013-07-31T18:05:07Z","Content":"\n\u003Cp\u003EIt will NEVER be added until the singleplayer portion is actually done,Sorry,you may have to wait like 10 years or so \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003Cp\u003EBut thanks for not \u0027suggesting\u0027 multiplayer like those others like; \u0022WHERSA MULTYIPPLAEYARA I WANT IT KNAOW\u0022\u003C/p\u003E\u003Cp\u003ESo,yeah.\u003C/p\u003E\n"},{"CreatedByName":"KAO","CreatedById":30795,"CreatedDateTime":"2013-07-31T18:05:16Z","Content":"\n\u003Cp\u003Ethere is no reason to beat a dead horse, that\u0027s why. Squad has openly stated \u0022we shall not be incorporating multiplayer until the game is done\u0022\u003C/p\u003E\u003Cp\u003Ewanna talk about multiplayer? there\u0027s several threads in the add-ons section for that\u003C/p\u003E\n"},{"CreatedByName":"moronplays","CreatedById":47962,"CreatedDateTime":"2013-07-31T18:05:40Z","Content":"\n\u003Cp\u003EThe problem is time warp because when you time warp all the planets move causing the game to de-sync, so if you time warp every one else has to and somebody could be doing something like docking which cant be at 100000X time warp i mean have you tried that ?!\u003C/p\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2013-07-31T18:06:02Z","Content":"\n\u003Cp\u003EI think you\u0027ll find the answer to your questions is that any thread that brings it up will proceed in the exact same fashion yours is about to.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-07-31T18:07:46Z","Content":"\n\u003Cp\u003ELock the Casbah.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-31T18:12:22Z","Content":"\n\u003Cp\u003ESP \u0026gt; MP. Multiplayer games draw in bad crowds.\u003C/p\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T18:13:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022moronplays\u0022 data-cite=\u0022moronplays\u0022\u003E\u003Cdiv\u003EThe problem is time warp because when you time warp all the planets move causing the game to de-sync, so if you time warp every one else has to and somebody could be doing something like docking which cant be at 100000X time warp i mean have you tried that ?!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are definitely ways of fixing that (could treat it like sleeping in minecraft) where all users have to \u0022agree\u0027 to the warp before it happens..\u003C/p\u003E\u003Cp\u003EAnyways, just saying there are ways around small issues.\u003C/p\u003E\u003Cp\u003EBut I also understand the dev. team wanting to finish singleplayer first.\u003C/p\u003E\n"},{"CreatedByName":"bogpad","CreatedById":70927,"CreatedDateTime":"2013-07-31T18:14:37Z","Content":"\n\u003Cp\u003Eposting in a locked thread!\u003C/p\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T18:16:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003ESP \u0026gt; MP. Multiplayer games draw in bad crowds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would disagree, alot of games (like minecraft) would be dead in the water without multiplayer.\u003C/p\u003E\u003Cp\u003EEven this game, I\u0027ve only had it for around a week, and I\u0027m having a blast playing it.. but I can only see it lasting maybe a month at most. \u003C/p\u003E\u003Cp\u003EMinecraft would have been the same way, fun for around a month or so, but I had people to play with.. so I ended up playing it for 2\u002B years.\u003C/p\u003E\u003Cp\u003E(Why do I use MC as an example? small dev team, indy game, sandbox)\u003C/p\u003E\n"},{"CreatedByName":"dlmarti","CreatedById":70037,"CreatedDateTime":"2013-07-31T18:27:03Z","Content":"\n\u003Cp\u003E1st f-u to all the people that shat on the guy.\u003C/p\u003E\u003Cp\u003E2nd I can guarantee that if this game survives infancy it will have multiplayer, there is just too much money in it.\u003C/p\u003E\n"},{"CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-07-31T18:40:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dewm\u0022 data-cite=\u0022Dewm\u0022\u003E\u003Cdiv\u003EI would disagree, alot of games (like minecraft) would be dead in the water without multiplayer.\u003Cp\u003EEven this game, I\u0027ve only had it for around a week, and I\u0027m having a blast playing it.. but I can only see it lasting maybe a month at most. \u003C/p\u003E\u003Cp\u003EMinecraft would have been the same way, fun for around a month or so, but I had people to play with.. so I ended up playing it for 2\u002B years.\u003C/p\u003E\u003Cp\u003E(Why do I use MC as an example? small dev team, indy game, sandbox)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would disagree as well. I\u0027ve been playing since April and don\u0027t seen a point where I would quit playing. That\u0027s not to say that multiplayer would be a bad thing, but as has been said its just alpha right now. It\u0027s easier for them to concentrate on getting the core of the game completed before adding multiplayer. Also there are some who have basically made it multiplayer by passing around the save/persistence file to a group of people who take turns contributing to whatever their mission is.\u003C/p\u003E\u003Cp\u003EI can see instances where multiplayer, depending on how its implemented, could be a bad thing as it tends to attract hackers who try to get things they shouldn\u0027t have. If it were IP/LAN based multiplayer that may be a different story though. For now I\u0027m more than happy with where the game is, as are others.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-07-31T18:45:34Z","Content":"\n\u003Cp\u003EIt has been suggested quite a lot.\u003C/p\u003E\u003Cp\u003EIf you really want it, try Kerbal Live Feed.\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-07-31T18:48:25Z","Content":"\n\u003Cp\u003EThe reason why no Multiplayer:\u003C/p\u003E\u003Cp\u003E1 - The physics engine can\u0027t handle to have to think about more than 1 person with a single craft flying at once, that\u0027s why debris get deleted and you can\u0027t switch craft in atmosphere, as well how you can switch craft while under acceleration\u003C/p\u003E\u003Cp\u003E2 - Timewarp, if one were to time warp you would see them flying at about 100,000X there original speed, and the planets wouldn\u0027t be in the same position as they were when you started warping unless if you were host\u003C/p\u003E\u003Cp\u003E3 - \u0022Griefers\u0022, sure you can invite friends but what if you host a public server? Then the forums would be filled with: \u0022X Blew up meh spase staton can u ban him plz\u0022\u003C/p\u003E\u003Cp\u003EThat is why I think MP will never be added\u003C/p\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2013-07-31T19:06:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlmarti\u0022 data-cite=\u0022dlmarti\u0022\u003E\u003Cdiv\u003E1st f-u to all the people that shat on the guy.\u003Cp\u003E2nd I can guarantee that if this game survives infancy it will have multiplayer, there is just too much money in it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy first response was basically, \u0022Why didn\u0027t he heed the warning? Ok, well...you\u0027re going to see why.\u0022\u003C/p\u003E\u003Cp\u003EYour response make me want to give a full response.\u003C/p\u003E\u003Cp\u003EDo you really want to know why multiplayer is not going to happen for a long time? Because the developer said they want to focus on their development roadmap. They have hinted that it may come in the future as an expansion, but in the meantime they plainly request that people not bring it up because it starts some of the worst kinds of thread. The special snowflakes in the world don\u0027t care and bring it up anyway.\u003C/p\u003E\u003Cp\u003EIts a pretty common thing for people to have the lightbulb go on and suggest something they think would make a game immensely better. \u0022Wouldn\u0027t it be cool if we had a persistent server where everyone could log in and launch and every is flying. When you go to the map screen you see all these ships flying around!\u0022 It is a cool idea. It would be fun to be piloting ships with friends.\u003C/p\u003E\u003Cp\u003EBut bolting it onto a game designed for singleplayer involves challenges. For instance, Unity uses scenes to handle what is displayed. Right now the game is coded around having a single scene and moving it around to where the user changes it to. Since I don\u0027t know the backend, I don\u0027t know how hard this would be. others include: how do you sequence who gets to take off? Will we have multiple space centers and go to the first open one? \u003C/p\u003E\u003Cp\u003EStill many have what seem like completely logical offers coming from people, ala using the sleep method from Minecraft. This is fine and all when it comes to Minecraft where generally everyone goes straight to a bed once nightfall hits. I don\u0027t know about you but I hit timewarp all the time just on a trip to the Mun. I did one last night and warped probably 8 times. What if you miss a critical burn during my warp time? In Minecraft the sleep cycle moves the world ahead to dawn. No one can interrupt it. Thats why they make everyone agree to it. Will you have a way to be able to tell how long someone\u0027s warp is going to take?\u003C/p\u003E\u003Cp\u003EAll of this requires intense discussion and scrutiny because multiplayer games have to be handled completely different from singleplayer games. Parts of game engines can be reused, but in general it requires a LOT of coding to make it work.\u003C/p\u003E\u003Cp\u003EThe fun part of these threads is the number of people who don\u0027t have a clue how things are coded in the background (myself included) and proceed to wax philosophically about how it worked in one game and there has to be a way to make it work in this one.\u003C/p\u003E\u003Cp\u003ETLDR: I for one think we should respect the developer wish to develop the main game first before tackling multiplayer. Therefore we should also respect the wish to not bring it up in threads all the time where people get into heated discussions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-31T19:11:28Z\u0022 title=\u002207/31/2013 07:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 31, 2013\u003C/time\u003E by air805ronin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Daniboo","CreatedById":53786,"CreatedDateTime":"2013-07-31T19:17:57Z","Content":"\n\u003Cp\u003EOkay so, people are saying the game can\u0027t handle this or that, or this is impossible or that is impossible..\u003C/p\u003E\u003Cp\u003EBut during the last KSP dev team livestream the devs said the multiplayer subject for KSP won\u0027t be serious until the singleplayer version of KSP is 100% done.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-07-31T19:18:40Z","Content":"\n\u003Cp\u003EI think one of the reasons is the amount of work that goes into building a space station or something. If I did build one and logged back in to find a massive debris field and a message like \u0022I smashed your station for teh lulz\u0022 then I would be fairly miffed, to put it lightly.\u003C/p\u003E\u003Cp\u003EThe only way I think multiplayer would work is in letting people control individual Kerbals when on EVA, but then again what would be the benefit from this..?\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-07-31T19:27:09Z","Content":"\n\u003Cp\u003EAnd now OP you should understand why we don\u0027t talk about multiplayer. The same things gets hashed over and over again, people get upset, then the personal attacks start and everything just goes downhill from there.\u003C/p\u003E\u003Cp\u003EAs it has been stated, Multiplayer is not something Squad is going to even consider looking at until much further down the road and most likely not until after the release of KSP v1.0.\u003C/p\u003E\u003Cp\u003ESo before this goes any further and things get said that people may regret, we\u0027ll just end the show here. We thank you for your input.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}