{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":466,"Articles":[{"CreatedByName":"oktav","CreatedById":96645,"CreatedDateTime":"2014-09-27T06:28:05Z","Content":"\n\u003Cp\u003EI have taken pictues or the issues I am having with tritium and He-3 decay.\u003C/p\u003E\u003Cp\u003EI have a clean install with just Interstellar and I tried generating tritium in background and he-3 decay.\u003C/p\u003E\u003Cp\u003EI tried with both a vessel that never leaves the ground and then with one that launches and land (same spot though).\u003C/p\u003E\u003Cp\u003EI can\u0027t get the deuterium to be generated in the background and the he-3 to decay in both cases at all. it stays absolutely the same. Am I doing something wrong?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://imgur.com/a/pTOfl\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/pTOfl\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-09-27T07:29:09Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@FractalUK\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOne last thing:\u003C/p\u003E\u003Cp\u003EWhat are the chances I could convince you to integrate a EC --\u0026gt; MJ converter into the solar panels module (using Module Manager, like is already done for WasteHeat production from solar), so that I could power my plasma thrusters with the NearFuture solar blanket panels, or ISRU refineries at a low rate with Gigantors built right onto the spacecraft?\u003C/p\u003E\u003Cp\u003EThere was a hackish fix to implement this using the KethaneConverter module posted on this thread a while back, but I don\u0027t know if it still works with this version of Interstellar...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003EWarning: Tangent Follows\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhatever converter module you develop might also theoretically be useful for an Ec --\u0026gt; Thermal Power module that could be added to Thermal Receivers (no need to build a separate part for this) at some point in the future as well, so we can build Solar Thermal Rockets (without having to rely on Microwave Power transmission networks- even if this improves performance) if we so desired... Internally these work in real life (though never yet deployed on a spacecraft, these technologies are well-tested on the ground) either by heating a highly resistive material with electricity produced from photovoltaics in a heat exchanger fuel can flow through, or by heating absorptive materials and the fuel stream itself with lasers, or a combination of both- which tends to allow even higher temperatures to be reached... (the electricity can also come from a nuclear reactor *NOT* exposed directly to the fuel stream)\u003C/p\u003E\u003Cp\u003EAnother version of Solar Thermal uses mirrors focusing light on a heat exchanger- possibly this could be implemented using the mirror parts talked about for thermal solar power satellites. Simply re-use the Solar Sail texture (possibly thickened a little) or re-texture solar panels to be shiny (and upsize them) for the mirrors, and re-name the Thermal Receiver parts to \u0022Heat Exchanger\u0022 parts (to reflect what they actually do, and that heat exchangers be heated with electricity of mirrored light as well as Microwaves- although obviously real ones would only be designed for one of these three applications, not all of them at once...) and you\u0027ve got an instant Solar Thermal Rocket system.\u003C/p\u003E\u003Cp\u003ESolar Thermal Rockets, like Nuclear Thermal Rockets, can potentially heat up to very high temperatures- even higher than that which can easily be achieved with Microwaves, due to the materials limitations of microwave-absorptive materials (though the higher ISP comes at the expense of thrust- only a small section of the Heat Exchanger can be heated with light or electricity). Thus they could provide a non-nuclear high-ISP low-thrust fuel mode, and could potentially even be an alternate mode for a spacecraft with both a Thermal Receiver and a Microwave Receiver (turn the Microwaves into electricity first, and you can achieve higher temperatures and ISP- though at the expense of thrust)\u003C/p\u003E\u003Cp\u003EKeep in mind that all Solar Thermal propulsion systems tend to be rather limited in thrust. Thus, they would tend to form a middle-ground between electrodynamic/electrothermal propulsion systems and Microwave Thermal rocketry, as a higher-ISP but much lower-thrust option than Microwave Thermal (the efficiency is also lower, and there is a lot more generation of waste heat). TWR also suffers if the electricity is locally-generated or mirrors are used to concentrate light on the HX, due to having the solar mirrors/PV\u0027s on the spacecraft, rather than a \u0022stationary\u0022 solar microwave beamed-power satellite that simply shoots lasers at a lightweight Thermal Receiver.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T08:19:43Z\u0022 title=\u002209/27/2014 08:19  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fordskydog","CreatedById":123493,"CreatedDateTime":"2014-09-27T08:47:52Z","Content":"\n\u003Cp\u003EI am having a problem starting the fusion reaction in the larger sizes. The two small reactors work. The two large ones just wont fire. I put on the launch pad a 3.75 m fusion reactor and generator, stacks and stacks of 2.5 m batteries, and three of the large black triangular radiators. The gen is set to solid state, but i have tried with two generators, one set to each mode also. I have tried smaller fission reactors and microwave power from fission power stations to start the reaction to no avail.\u003C/p\u003E\u003Cp\u003EI have many mods installed but i used the Mod Admin to install all of them.\u003C/p\u003E\u003Cp\u003EI feel like this is a bug or a broken install somewhere, but am I just missing something?\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-09-27T11:43:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fordskydog\u0022 data-cite=\u0022fordskydog\u0022\u003E\u003Cdiv\u003EI am having a problem starting the fusion reaction in the larger sizes. The two small reactors work. The two large ones just wont fire. I put on the launch pad a 3.75 m fusion reactor and generator, stacks and stacks of 2.5 m batteries, and three of the large black triangular radiators. The gen is set to solid state, but i have tried with two generators, one set to each mode also. I have tried smaller fission reactors and microwave power from fission power stations to start the reaction to no avail.\u003Cp\u003EI have many mods installed but i used the Mod Admin to install all of them.\u003C/p\u003E\u003Cp\u003EI feel like this is a bug or a broken install somewhere, but am I just missing something?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou might be missing fuel? The large fusion reactors only have Lithium now, they need an external supply of Deuterium/Tritium fuel. If you right click on the reactor, it should tell you if you are missing fuel.\u003C/p\u003E\n"},{"CreatedByName":"MaLuS","CreatedById":116251,"CreatedDateTime":"2014-09-27T12:33:17Z","Content":"\n\u003Cp\u003E@\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/63336-Fractal_UK\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EFractal_UK\u003C/strong\u003E\u003C/a\u003E I am wondering if you seen my post of \u0022More Bugs\u0022 2 pages back? Particle FX issues with the Plasma and ATTILA Engines (pictures in the post). My mod list can be found in the description of my stream, im live now btw if you wanted me to show what i see live.\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-09-27T13:56:00Z","Content":"\n\u003Cp\u003EHello and welcome back \u003Cem\u003EFractal_UK\u003C/em\u003E! (Yeah, I know you are here for almost two weeks already, but still)\u003C/p\u003E\u003Cp\u003EI would like to report a problem.\u003C/p\u003E\u003Cp\u003EI\u0027m experiencing an issue with a \u003Cem\u003ENuclear Fission Reactor\u003C/em\u003E and \u003Cem\u003EThermal Turbojet\u003C/em\u003E. The problem is, that when I attach the reactor with turbojet in double symetry, the reactor is not symetrically controling the output power. The first one is OK, but the second one is just stucked at 25.000% of the 500MW power, which should be available, which is then causing asymetrical thrust and that doesn\u0027t improve controlability too much. It happens to me since I updated to 0.12 from the WaveFunctionP\u0027s version (that before Lite).\u003C/p\u003E\u003Cp\u003EFurthermore, I suggest a tweak to the system for making the radiators glow. Now, the whole radiator is turning red, not just the radiation section.\u003C/p\u003E\u003Cp\u003EI thing images will make it more clear.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/UUghd\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T13:58:05Z\u0022 title=\u002209/27/2014 01:58  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by Magion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kc8hnz","CreatedById":88386,"CreatedDateTime":"2014-09-27T15:37:23Z","Content":"\n\u003Cp\u003EI\u0027m having an issue where the loading screen stops at WarpPlugin\\Spaces\\sci\\model. I downloaded and replaced the TGA files with the high res ones provided from Fractal but its still freezing. any insights?\u003C/p\u003E\n"},{"CreatedByName":"Nittany Tiger","CreatedById":123570,"CreatedDateTime":"2014-09-27T17:20:39Z","Content":"\n\u003Cp\u003EI\u0027m not sure if this bug has been reported, or if it is a bug, but when playing science mode, when you unlock KSP Interstellar parts, you get them upgraded from the start instead of the base versions (e.g. Unlocking the first fission reactor node gets you Gas Core Reactors, not Molten Salt Reactors).. It\u0027s not a huge deal, but it takes the fun out of unlocking upgrades for the parts. I wonder if this issue is going to be addressed in a future release.\u003C/p\u003E\n"},{"CreatedByName":"Thorbane","CreatedById":76234,"CreatedDateTime":"2014-09-27T17:30:52Z","Content":"\n\u003Cp\u003EFractal, I\u0027m having a problem getting the alternate fuel modes on the inertial fusion reactors to work. The D-He3 shuts down instantly, and the He3 mode produces no power.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T19:35:32Z\u0022 title=\u002209/27/2014 07:35  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by Thorbane\u003C/strong\u003E\n\u003Cbr\u003EHe3 not H\n\u003C/span\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-09-27T18:49:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kc8hnz\u0022 data-cite=\u0022kc8hnz\u0022\u003E\u003Cdiv\u003EI\u0027m having an issue where the loading screen stops at WarpPlugin\\Spaces\\sci\\model. I downloaded and replaced the TGA files with the high res ones provided from Fractal but its still freezing. any insights?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERAM limit? You may try Active texture management but that just defeats the purpose of using the High Res version. You may just need to us Low Res\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-09-27T18:51:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nittany Tiger\u0022 data-cite=\u0022Nittany Tiger\u0022\u003E\u003Cdiv\u003EI\u0027m not sure if this bug has been reported, or if it is a bug, but when playing science mode, when you unlock KSP Interstellar parts, you get them upgraded from the start instead of the base versions (e.g. Unlocking the first fission reactor node gets you Gas Core Reactors, not Molten Salt Reactors).. It\u0027s not a huge deal, but it takes the fun out of unlocking upgrades for the parts. I wonder if this issue is going to be addressed in a future release.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have the right tech tree installed? Did you copy the one from the WarpPlugin folder into your save?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thorbane\u0022 data-cite=\u0022Thorbane\u0022\u003E\u003Cdiv\u003EFractal, I\u0027m having a problem getting the alternate fuel modes on the inertial fusion reactors to work. The D-H shuts down instantly, and the H3 mode produces no power.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have D/T or H3 Cryostat on your vessel?\u003C/p\u003E\n"},{"CreatedByName":"Lotabeer","CreatedById":123011,"CreatedDateTime":"2014-09-27T18:53:09Z","Content":"\n\u003Cp\u003E@Magion: I\u0027ve had some weird issues with reactors not outputting to their full abilities too, not even in an asymmetrical setup like that. Usually switching fuel modes to LFO or something briefly and then back helps. Sometimes I need to have the reactor shut down instead, which is easier said than done with the fission reactors.\u003C/p\u003E\u003Cp\u003E@Thorbane: I had my 2.5m fusion reactor work like a charm on a long mission with all fuel modes the other day... Can I ask what size you are using and if you have been sure to add H3 cryostats to your craft?\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-09-27T18:54:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thorbane\u0022 data-cite=\u0022Thorbane\u0022\u003E\u003Cdiv\u003EFractal, I\u0027m having a problem getting the alternate fuel modes on the inertial fusion reactors to work. The D-H shuts down instantly, and the H3 mode produces no power.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe reactors don\u0027t have D/T in them anymore. do you have a source of Deuterium on the ship?\u003C/p\u003E\u003Cp\u003EHelium-3 is a byproduct of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Helium-3#Fusion_reactions\u0022 rel=\u0022external nofollow\u0022\u003EDeuterium\u003C/a\u003E and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tritium\u0022 rel=\u0022external nofollow\u0022\u003ETritium\u003C/a\u003E, or \u003Ca href=\u0022https://www.iter.org/mach/tritiumbreeding\u0022 rel=\u0022external nofollow\u0022\u003Ecan be bred from Lithium\u003C/a\u003E. do you have lithium on the ship?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T18:55:47Z\u0022 title=\u002209/27/2014 06:55  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by AetherGoddess\u003C/strong\u003E\n\u003Cbr\u003Euse the right name\n\u003C/span\u003E\n"},{"CreatedByName":"Thorbane","CreatedById":76234,"CreatedDateTime":"2014-09-27T20:49:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AetherGoddess\u0022 data-cite=\u0022AetherGoddess\u0022\u003E\u003Cdiv\u003Ethe reactors don\u0027t have D/T in them anymore. do you have a source of Deuterium on the ship?\u003Cp\u003EHelium-3 is a byproduct of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Helium-3#Fusion_reactions\u0022 rel=\u0022external nofollow\u0022\u003EDeuterium\u003C/a\u003E and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tritium\u0022 rel=\u0022external nofollow\u0022\u003ETritium\u003C/a\u003E, or \u003Ca href=\u0022https://www.iter.org/mach/tritiumbreeding\u0022 rel=\u0022external nofollow\u0022\u003Ecan be bred from Lithium\u003C/a\u003E. do you have lithium on the ship?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I have fuel. These are the smaller 1.25 and .625 meter reactors that do this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LkPzQno.png\u0022 alt=\u0022LkPzQno.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPure He3 mode does this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fUcwheO.png\u0022 alt=\u0022fUcwheO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe3-D mode deactivates instantly.\u003C/p\u003E\u003Cp\u003EEdit: And the D-T fuel mode works fine except it shuts down when you timewarp.\u003C/p\u003E\u003Cp\u003EEdit2: Oh and the 0.625 meter Plasma thruster does this, while inactive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Si55MtP.png\u0022 alt=\u0022Si55MtP.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T20:57:08Z\u0022 title=\u002209/27/2014 08:57  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by Thorbane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-09-27T23:18:39Z","Content":"\n\u003Cp\u003EORSX integration pack is up. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94876-0-24-2-Community-Resource-Pack-integration-for-KSPI-0-12-%28ORSX-version%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94876-0-24-2-Community-Resource-Pack-integration-for-KSPI-0-12-%28ORSX-version%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jbernady8","CreatedById":123608,"CreatedDateTime":"2014-09-28T02:47:45Z","Content":"\n\u003Cp\u003ETried installing the add-on and nothing is showing up in the tree loader and I get a box saying that there\u0027s an update to interstellar. Checked the FAQ and tried searching this thread for answers already, I haven\u0027t seen any posted.\u003C/p\u003E\n"},{"CreatedByName":"NeoAcario","CreatedById":24645,"CreatedDateTime":"2014-09-28T04:06:16Z","Content":"\n\u003Cp\u003EFractal_UK,\u003C/p\u003E\u003Cp\u003EEven though I\u0027m currently taking a break from KSP at the moment.. I just wanted to take a second and thank you for coming back. Sincerely... thank you. I don\u0027t think I can play KSP without this mod, and I am ecstatic to see that when I do play again... KSP Interstellar will be here.\u003C/p\u003E\u003Cp\u003E~Steve\u003C/p\u003E\n"},{"CreatedByName":"Lotabeer","CreatedById":123011,"CreatedDateTime":"2014-09-28T08:26:05Z","Content":"\n\u003Cp\u003EHave to copy the tree.cfg file from the WarpPlugin folder in the mod file directly into your save file and delete the notree.cfg file. Not sure why Fractal hasn\u0027t put this on the front page/FAQ since it\u0027s been this way since 0.12. Any way about it, it\u0027s a quick fix. Ignore the treeloader update stuff. Apparently Treeloader is still needed for the mod to work right, even though it doesn\u0027t load the tree cfg at all, if I understnad correctly.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-09-28T12:43:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lotabeer\u0022 data-cite=\u0022Lotabeer\u0022\u003E\u003Cdiv\u003EHave to copy the tree.cfg file from the WarpPlugin folder in the mod file directly into your save file and delete the notree.cfg file. Not sure why Fractal hasn\u0027t put this on the front page/FAQ since it\u0027s been this way since 0.12. Any way about it, it\u0027s a quick fix. Ignore the treeloader update stuff. Apparently Treeloader is still needed for the mod to work right, even though it doesn\u0027t load the tree cfg at all, if I understnad correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETreeloader is what reads the tree.cfg in the save folder and applies it to the in-game tree. So even though the retrieve/update part is broken, we still need the plugin around for that other part that works.\u003C/p\u003E\n"},{"CreatedByName":"Haifi","CreatedById":108817,"CreatedDateTime":"2014-09-28T15:30:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E I\u0027d be happy to make something like that at some point, though getting my hands on suitable 3D models for that could be tricky!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is just an idea, but the solar sail is basically a mirror, and the inline radiators are heat exchangers, you could even use them for both microwave and solar rays by simply extending the part config...\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2014-09-28T16:54:06Z","Content":"\n\u003Cp\u003EHas anyone successfully converted from Interstellar Lite back to this Insterstellar? I shamefully jumped ship when I thought this mod was going to languish, and now that it\u0027s back I find I\u0027m missing some of the depth of the full version. I already added quite a few vessels, including many space stations and probes, with Lite parts and they get destroyed if I load up a save on the full Interstellar. \u003C/p\u003E\u003Cp\u003EI\u0027m willing to edit my save file, I just need to know what to edit. Mostly I need to swap out the radiators and the power receiver. I have one power station in orbit that I\u0027ll lose otherwise, but I\u0027m not too concerned.\u003C/p\u003E\n"},{"CreatedByName":"DianonForce","CreatedById":121367,"CreatedDateTime":"2014-09-28T17:18:32Z","Content":"\n\u003Cp\u003EJust a question, since treeloader causes weird bug on my game (parts form other mods missing in the R\u0026amp;D if i start with a tree.cfg and reappear if i start with notree.cfg) Will i have access to all KSPI Parts if i use the stock tree?\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-09-28T17:46:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DianonForce\u0022 data-cite=\u0022DianonForce\u0022\u003E\u003Cdiv\u003EJust a question, since treeloader causes weird bug on my game (parts form other mods missing in the R\u0026amp;D if i start with a tree.cfg and reappear if i start with notree.cfg) Will i have access to all KSPI Parts if i use the stock tree?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKinda? there are certain parts that only work out past the stock tree locations (specifically fusion, antimatter, White-Alcubierre drives) and there are upgrades that look for those trees to be unlocked (like Quantum Vacuum fuel mode on electric thrusters). without the tree adjustments, those things will either be inaccessible or fail to function. in short: go carefully: unsupported grey zone,\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-09-28T17:47:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jordanjay29\u0022 data-cite=\u0022jordanjay29\u0022\u003E\u003Cdiv\u003EHas anyone successfully converted from Interstellar Lite back to this Insterstellar? I shamefully jumped ship when I thought this mod was going to languish, and now that it\u0027s back I find I\u0027m missing some of the depth of the full version. I already added quite a few vessels, including many space stations and probes, with Lite parts and they get destroyed if I load up a save on the full Interstellar. \u003Cp\u003EI\u0027m willing to edit my save file, I just need to know what to edit. Mostly I need to swap out the radiators and the power receiver. I have one power station in orbit that I\u0027ll lose otherwise, but I\u0027m not too concerned.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEditing your save file is never recommended. Bad things can happen. Really bad things. Worse than just craft disappearing, like KSP itself not functioning at all in the intro menu. You should copy your KSP install and roll back to Lite. Figure out how you built the craft you want to keep and use a 2nd install with regular Interstellar. Rebuild your craft and use HyperEdit to put them where they were. Or you can start from scratch.\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2014-09-28T17:55:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EEditing your save file is never recommended. Bad things can happen. Really bad things. Worse than just craft disappearing, like KSP itself not functioning at all in the intro menu. You should copy your KSP install and roll back to Lite. Figure out how you built the craft you want to keep and use a 2nd install with regular Interstellar. Rebuild your craft and use HyperEdit to put them where they were. Or you can start from scratch.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that would have happened, I had backup saves. Also, I could always just stick with Lite or start with full from scratch. It\u0027s not the end of the world if KSP crashes once. \u003C/p\u003E\u003Cp\u003EAlso, I did a bit of investigating on my own and matched up the radiators with their cousins from the lite version. That and one power reciever, and I was in the clear. A couple of ships have oversized receivers now, but I\u0027ll phase them out and replace them eventually. No explosions, no crashes, and KSP is happy as a clam.\u003C/p\u003E\n"}]}