{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":417,"Articles":[{"CreatedByName":"MrWizerd","CreatedById":106063,"CreatedDateTime":"2014-07-25T00:37:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndreyATGB\u0022 data-cite=\u0022AndreyATGB\u0022\u003E\u003Cdiv\u003EI disagree with having to grind out every single experiment in the game. Collecting science at the moment is a pretty tedious thing to do, and in no way fun if you go to such extremes. Maybe a kind of alternate way to unlock the node like have a ship land and take off of 3-4 planets rewards you a few thousand science (assuming 50k warp). I\u0027d much rather see big rewards for setting up a functional colony and sat network through MKS and RT2 respectively, though I really doubt Fractal wants to make this mod dependent on others to get its trademark feature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI sort of agree with you on that point, in both points actually, it is frustrating that setting up a Satellite network doesn\u0027t get ANY reward. I mean I drop four sats in geosync orbit, to give perfect coverage off of my really sad sack of com sats (four com32\u0027s and four 90mm dishes with two large solar panels and an engine and control wheels) My normal setup has the giga deployable dish, and 8 KR 14\u0027s around Kerbin, and these little pissant ones set me back all of my 150k or 1500k I dont remember were the decimal point was, but suffice to say, I launched these sats as soon as I could because I need to setup planetary mining facilities to gain money if I am going to be setting up sat networks and such and need the coverage to just START to do this! So I go to look at my missions trying to find out why there not completing and I find that the only way I am going to pass the chute tests is with a Spaceplane, beacuse I am not sure I can make these altitudes at these speeds, after trying for 4 or so hours I am positive that I cannot get a pod to do under 700ms at 23-19k alt. So making more grinding is a bad thing I think... long story short.\u003C/p\u003E\n"},{"CreatedByName":"Dangerous_Beans","CreatedById":78059,"CreatedDateTime":"2014-07-25T00:54:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrWizerd\u0022 data-cite=\u0022MrWizerd\u0022\u003E\u003Cdiv\u003EI think there has to be a way to upgrade still but there be a cost of some sort involved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eif you can make it require resources, you could have an upgrade pod that contains the resources needed to upgrade other things? you could also link the upgrade functionality to the pod.\u003C/p\u003E\u003Cp\u003Eso once you can build gas core fission reactors, you send up an upgrade pod, dock it to the craft with the old reactors and use the pod to upgrade it. the pod can only do the upgrades available when you launched it, so you can\u0027t have a pod launched before the gas core upgrade was researched do a gas core upgrade. make each pod only able to do one ship, or maybe some number of parts, and also require a kerbal on EVA. also have most of the cost be the resource, not the pod part. \u003C/p\u003E\u003Cp\u003Eso instead of clicking on my reactor out in Eeloo orbit and upgrading it, i have to send a kerbal out with a box of parts. it also costs money instead of science, and requires you to design craft capable of being upgraded.\u003C/p\u003E\n"},{"CreatedByName":"Lubergo","CreatedById":116643,"CreatedDateTime":"2014-07-25T01:32:28Z","Content":"\n\u003Cp\u003EIs anyone having some major problems with the .24.1 update today and interstellar? Engines appear to be firing but aren\u0027t, similar to the old b9 sabre bug, except engine flames fire out in two directions. Also the interstellar parts don\u0027t seem to have collision, they just fall through the launch pad, and ships that have interstellar parts float apart in space. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3hOK5Xw.jpg\u0022 alt=\u00223hOK5Xw.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-07-25T02:14:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dangerous_Beans\u0022 data-cite=\u0022Dangerous_Beans\u0022\u003E\u003Cdiv\u003Ean upgrade pod...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI usually avoid prescribing things because 1) it feels somewhat disrespectful to the creator\u0027s artistic license and original conception, and 2) i\u0027m usually much more impressed by what that authors come up with independently. Fractal and Wavefunction have consistently surprised and impressed me with what this mod provides. now, ignoring all of that, I think this particular idea has merit. \u003C/p\u003E\u003Cp\u003EI like the idea of an \u0022Retrofit Kit\u0022, containing all the tools, parts, materials, etc to retrofit gear on orbit. you could create a new resource for retrofitting parts, only purchasable from the VAB/SPH (mining improved \u003Ca href=\u0022http://en.memory-alpha.org/wiki/Heisenberg_compensator\u0022 rel=\u0022external nofollow\u0022\u003EHeisenberg compensators\u003C/a\u003E? not a thing; but field manufacturing maybe?) and each part that was upgraded could consume a certain amount of this resource, based on the tech level from and to, and the size and complexity of the part. maybe the 3.5m dusty plasma fusion reactor takes 1000 retrofit parts, say 10 1 meter retrofitting kits, but a small graphite heat radiator only takes 10 parts, 1/10th of a full sized kit, maybe a small side mount thing? There seems to be \u003Ca href=\u0022http://www.nasa.gov/mission_pages/hubble/servicing/\u0022 rel=\u0022external nofollow\u0022\u003Esufficent preceident\u003C/a\u003E. \u0022outside\u0022 parts like radiators, solar panels, sensors, etc might require EVA, whereas inside parts like generators, reactors, etc could be done without getting off the boat. \u003C/p\u003E\u003Cp\u003EObviously the computer core would still require only science and time, because the poetry of that is undeniable. Sentience requires only sufficient knowledge refined by introspection and reflection.\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-25T02:17:28Z","Content":"\n\u003Cp\u003EWhile were being inventive, to get the antimatter parts, Make a probe at 750 AU call it an alien craft, and its where you get the technology from. Bring it home, and it unlocks the AM capabilities. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Excavus","CreatedById":116521,"CreatedDateTime":"2014-07-25T04:20:46Z","Content":"\n\u003Cp\u003EHaving the same problems here. Tried to put a science lab on one of my rockets, and it just fell through the launch pad. Luckily I hadn\u0027t used many Interstellar parts since then.\u003C/p\u003E\n"},{"CreatedByName":"Nightdagger","CreatedById":115918,"CreatedDateTime":"2014-07-25T04:33:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lubergo\u0022 data-cite=\u0022Lubergo\u0022\u003E\u003Cdiv\u003EIs anyone having some major problems with the .24.1 update today and interstellar? Engines appear to be firing but aren\u0027t, similar to the old b9 sabre bug, except engine flames fire out in two directions. Also the interstellar parts don\u0027t seem to have collision, they just fall through the launch pad, and ships that have interstellar parts float apart in space. \u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/3hOK5Xw.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/3hOK5Xw.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I scratched my head repeatedly over why my microwave transceiver that I was putting into my new nuclear transmitter was falling through and crashing into the landing pad when I tried to launch it. Then, I went to scrap an old nuclear satellite I had in orbit and watched it fly into three separate pieces even though it was still considered one part by KSP. And just now I built a new nuclear transmitter (with the transceiver strapped on with about half a dozen struts) and got it settled in only to find out that not only is it not producing any power, but none of the statistics are there, any of the fields with a gauge are there but the core temp, the power production, any field that\u0027s a digital display are completely blank, it doesn\u0027t even display. Also, a retrofit button was available on the reactor, and when I clicked it, it ate 200 science and told me it was a gas core reactor (interesting since I don\u0027t have fusion power unlocked yet...) but still did nothing but sit there like a gigantic, expensive tin can.\u003C/p\u003E\u003Cp\u003EPatch seems to have broke stuffs.\u003C/p\u003E\n"},{"CreatedByName":"NeoAcario","CreatedById":24645,"CreatedDateTime":"2014-07-25T04:39:30Z","Content":"\n\u003Cp\u003EMy initial thought was to raise the price of upgraded parts to something like 4x cost... but then I had to consider the fact that you cannot use un-upgraded parts once you unlock the upgrade. Would it be at all possible to add a tweakable setting to use an item un-upgraded?\u003C/p\u003E\u003Cp\u003E~Steve\u003C/p\u003E\n"},{"CreatedByName":"Dal","CreatedById":97340,"CreatedDateTime":"2014-07-25T06:18:48Z","Content":"\n\u003Cp\u003ESame 24.1 issue, looking forward (patiently and gratefully) for a fix.\u003C/p\u003E\n"},{"CreatedByName":"Kesselya","CreatedById":116661,"CreatedDateTime":"2014-07-25T06:27:53Z","Content":"\n\u003Cp\u003EI\u0027m having similar issues, plus I can\u0027t get any amount of power to be put out by my reactors, and my helium-cooled IR Telescope has shut down because I can never get the 8kw of power to be recognized.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-25T06:48:15Z","Content":"\n\u003Cp\u003ENew compile for .24.1\u003C/p\u003E\u003Cp\u003EAPI for resources changed a bit, I had to edit the plugin code to fix the error. It compiled, hopefully that will be good enough. I did no testing.\u003C/p\u003E\u003Cp\u003ELet me know if there are any issues.\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-07-25T07:12:07Z","Content":"\n\u003Cp\u003EI\u0027ll try your new compile soon as I to was haveing some weird issues. Some parts would fall through ships or fall off ships. The small reactors were particularly bad. I was trying to launch a new station module with a small nuke reactor instead of other power methods and the ship would suffer a spontanious dissassembly at 6km. Another ship out in solar orbit had its reactor just fall off when I switched to it to perform a manuver. Swaping out the reactor on the station module for conventional solar pannles allowed it to launch although there wasnt much else from KSPI on the thing.\u003C/p\u003E\u003Cp\u003ETo be clear these issues were with your 24.0 compile after .24.1 update dropped, haven\u0027t tried your new one yet.\u003C/p\u003E\n"},{"CreatedByName":"Excavus","CreatedById":116521,"CreatedDateTime":"2014-07-25T07:36:16Z","Content":"\n\u003Cp\u003ETried your update, Wave, seems to work so far. The science lab isn\u0027t falling through the launchpad anymore which is good news. Haven\u0027t tried anything else yet.\u003C/p\u003E\n"},{"CreatedByName":"Kesselya","CreatedById":116661,"CreatedDateTime":"2014-07-25T07:43:07Z","Content":"\n\u003Cp\u003EThank you, Wave. My Interstellar parts are working as intended again. They aren\u0027t doing what I want them to do, but that\u0027s because I suck at designing space stations, and not because the mod is broken \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-07-25T08:00:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WaveFunctionP\u0022 data-cite=\u0022WaveFunctionP\u0022\u003E\u003Cdiv\u003ENew compile for .24.1\u003Cp\u003EAPI for resources changed a bit, I had to edit the plugin code to fix the error. It compiled, hopefully that will be good enough. I did no testing.\u003C/p\u003E\u003Cp\u003ELet me know if there are any issues.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried your new release and it doesn\u0027t seem to have solved the reactor issue. It seems like nothing will produce megajoules. I was having issues with my reactors collapsing into the spacecraft before, but I forgot to take the clamps off while testing it here. \u003C/p\u003E\u003Cp\u003EIt\u0027s kind of funny. I had just unlocked the Vista engines, this playthrough, so this was one of the first ships to actually use reactors. I was going crazy trying to get them to work earlier. Glad to see I am not the only one having the same issues. \u003C/p\u003E\u003Cp\u003EHas anybody noticed the aerodynamics being weird too? I know FAR updated very quickly, but spaceplanes that were working for me perfectly last night are flipping around crazily today. I wonder if it has anything to do with the Firespitter.dll still posting as being out of date.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-25T08:27:51Z","Content":"\n\u003Cp\u003EYou\u0027ll have to be more specific about your issue if I am to investigate it. \u0022nothing will produce megajoules\u0022 leads me to believe user error. No offense. Bonus points if you post a log of the errors, preferably with no other addons installed.\u003C/p\u003E\n"},{"CreatedByName":"Stage","CreatedById":110363,"CreatedDateTime":"2014-07-25T09:00:53Z","Content":"\n\u003Cp\u003EI would like to see KSPI use Water (like TACLS) instead of LqdWater for compatability.\u003C/p\u003E\u003Cp\u003EWould it be possible for you to change that one ressource of KSPI?\u003C/p\u003E\u003Cp\u003EThere was a MM config for this, but native support would be much better.\u003C/p\u003E\u003Cp\u003EOtherwise thanks for updating \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-07-25T10:42:54Z","Content":"\n\u003Cp\u003EHi, same here more or less. At first i had the problem that the small fission reactor in my orbital station was slowly drifting away after the game loaded the vessel. Not good. But i had a savegame, so no biggy. And your last update fixed this. But now the reactor is still running and in place, but the generator says \u0022no reactor\u0022 and shuts down. Granted, the reactor and the generator are NOT directly connected (one part is between them) but up until yesterday that worked without problems. \u003C/p\u003E\u003Cp\u003EHope i could help and a fix is possible .. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: Your last fix was fast and a godsend for my really expensive Station. Thank you for that!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022merendel\u0022 data-cite=\u0022merendel\u0022\u003E\u003Cdiv\u003EI\u0027ll try your new compile soon as I to was haveing some weird issues. Some parts would fall through ships or fall off ships. The small reactors were particularly bad. I was trying to launch a new station module with a small nuke reactor instead of other power methods and the ship would suffer a spontanious dissassembly at 6km. Another ship out in solar orbit had its reactor just fall off when I switched to it to perform a manuver. Swaping out the reactor on the station module for conventional solar pannles allowed it to launch although there wasnt much else from KSPI on the thing.\u003Cp\u003ETo be clear these issues were with your 24.0 compile after .24.1 update dropped, haven\u0027t tried your new one yet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-25T11:38:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smart013\u0022 data-cite=\u0022smart013\u0022\u003E\u003Cdiv\u003EHi, same here more or less. At first i had the problem that the small fission reactor in my orbital station was slowly drifting away after the game loaded the vessel. Not good. But i had a savegame, so no biggy. And your last update fixed this. But now the reactor is still running and in place, but the generator says \u0022no reactor\u0022 and shuts down. Granted, the reactor and the generator are NOT directly connected (one part is between them) but up until yesterday that worked without problems. \u003Cp\u003EHope i could help and a fix is possible .. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: Your last fix was fast and a godsend for my really expensive Station. Thank you for that!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your generator was working while not directly connected to a reactor then that was a bug.\u003C/p\u003E\n"},{"CreatedByName":"Nightdagger","CreatedById":115918,"CreatedDateTime":"2014-07-25T12:14:22Z","Content":"\n\u003Cp\u003EI\u0027ll load up a save game (unfortunately it won\u0027t be with Interstellar as the only mod, but I\u0027m running minimal others) and set up a quick and dirty reactor so I can get you an error log.\u003C/p\u003E\n"},{"CreatedByName":"Nightdagger","CreatedById":115918,"CreatedDateTime":"2014-07-25T12:24:57Z","Content":"\n\u003Cp\u003ENevermind - your patch seems to have fixed the reactor bug for me, I tested multiple sizes and types of fission reactor (unfortunately I do not have fusion or AM to test with yet) and all seem to work.\u003C/p\u003E\u003Cp\u003EThank you very much for the quick fix, WaveFunctionP! KSPI has quickly become one of my \u0022must have\u0022 mods for this game and having it broken trashes the desire to play for me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-25T12:26:42Z\u0022 title=\u002207/25/2014 12:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 25, 2014\u003C/time\u003E by Nightdagger\u003C/strong\u003E\n\u003Cbr\u003EKudos\n\u003C/span\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-07-25T12:58:53Z","Content":"\n\u003Cp\u003EEach generator directly attached to the reactor?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nightdagger\u0022 data-cite=\u0022Nightdagger\u0022\u003E\u003Cdiv\u003ENevermind - your patch seems to have fixed the reactor bug for me, I tested multiple sizes and types of fission reactor (unfortunately I do not have fusion or AM to test with yet) and all seem to work.\u003Cp\u003EThank you very much for the quick fix, WaveFunctionP! KSPI has quickly become one of my \u0022must have\u0022 mods for this game and having it broken trashes the desire to play for me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Nightdagger","CreatedById":115918,"CreatedDateTime":"2014-07-25T14:10:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smart013\u0022 data-cite=\u0022smart013\u0022\u003E\u003Cdiv\u003EEach generator directly attached to the reactor?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I didn\u0027t try it without the generators attached directly to the reactors, since that\u0027s not how they\u0027re supposed to work to begin with. I was testing to see if they worked at all, because prior to this patch nuclear reactors did absolutely nothing, they weren\u0027t even properly recognized as reactors.\u003C/p\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-07-25T14:57:00Z","Content":"\n\u003Cp\u003EAh, i see. So my working reactor is a bug thats now fixed, aka not working \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOk, time to unpack the solar panels.\u003C/p\u003E\n"},{"CreatedByName":"Physic","CreatedById":62232,"CreatedDateTime":"2014-07-25T15:47:16Z","Content":"\n\u003Cp\u003EThe experimental build crashes my game on the 64 bit version but not the 32 bit. Anyone else getting this?\u003C/p\u003E\u003Cp\u003EThanks for all the work on this mod.\u003C/p\u003E\n"}]}