{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":378,"Articles":[{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T21:59:03Z","Content":"\n\u003Cp\u003EWatch WaveFunction\u0027s tutorials...or read the wiki. Or wait for someone else. My brain isn\u0027t quite working right now. I can\u0027t recall the exact minutiae of this mod. \u0026gt;.\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"xeon_1","CreatedById":34120,"CreatedDateTime":"2014-05-18T22:27:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENot to sound like a **** but, feelings don\u0027t matter. What matters is the license. Fractal has explicitly allowed others to do play with his code, and more to the point, has expressed no objection to WaveFunction\u0027s meddling in this thread. Asking might be nice, but it is far from required.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry but you do sound like an ******* and the kind i don\u0027t get along with in RL.\u003C/p\u003E\u003Cp\u003ETaking somebody\u0027s work and saying its your own is just wrong no matter what legal papers you hold.\u003C/p\u003E\u003Cp\u003EAlway\u0027s get the creators permission or don\u0027t spread your modifications.\u003C/p\u003E\u003Cp\u003EThat is my view on it anyway.\u003C/p\u003E\u003Cp\u003EUnfortunately most people like you just steal other peoples work.\u003C/p\u003E\u003Cp\u003ESorry if this is hugely off topic but people like that just make my hair stand up strait with rage\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T22:45:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xeon_1\u0022 data-cite=\u0022xeon_1\u0022\u003E\u003Cdiv\u003ETaking somebody\u0027s work and saying its your own\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that\u0027s not what I suggested, nor did I give any indication of that. Please point me to exactly where I said that and I will clarify.\u003C/p\u003E\u003Cp\u003ENor do I understand why you\u0027re resorting to ad hominem attacks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI would point-out that your reasoning is flawed. The whole point of providing a license agreement is to make it clear what is and is not permissible use of intellectual property, for the very purpose of \u003Cstrong\u003Enot\u003C/strong\u003E requiring that every person wanting to use that property contact the creator directly to ask for permissions. Taken to its logical extreme, you are suggesting a world in which one would have to contact the developer of every piece of software before using it at all, to say nothing of other mediums such as print, sculpture, video, various tools, hardware, appliances...the list goes on practically without end.\u003C/p\u003E\u003Cp\u003EAs a content-creator myself, I\u0027m actually very, very annoyed with people who badger me about using my work when I have clearly licensed it under a very permitting license such as CC-BY-NC, or even just CC-BY.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-18T23:00:27Z\u0022 title=\u002205/18/2014 11:00  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 18, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2014-05-18T23:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EBecause I have no idea how the stuff works... And one generator doesn\u0027t make more juice if I turn off the other. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EBtw, does one know how much heat microwave receivers actually produce?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGenerators have a thing called efficiency that tells how much of the reactors THERMAL power they can convert to MegaJoules. Best efficiency is from KTEC generator with proper radiators, when it will be around 58%. Another generator on an ordinary reactor doesn\u0027t help anything.\u003C/p\u003E\u003Cp\u003EAnd when it comes to power a small satellite, just use solar panels if the power need isn\u0027t huge. Thermal rocket nozzle powered via the microwave thermal receiver doesn\u0027t produce any wasteheat (if i recall correct) as it will be fired out of the nozzle... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlasma thrusters create some waste heat and they need radiators for \u0027storage\u0027, aka time when engine is running and those times aren\u0027t usually very long.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-05-18T23:08:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xeon_1\u0022 data-cite=\u0022xeon_1\u0022\u003E\u003Cdiv\u003ESorry but you do sound like an ******* and the kind i don\u0027t get along with in RL.\u003Cp\u003ETaking somebody\u0027s work and saying its your own is just wrong no matter what legal papers you hold.\u003C/p\u003E\u003Cp\u003EAlway\u0027s get the creators permission or don\u0027t spread your modifications.\u003C/p\u003E\u003Cp\u003EThat is my view on it anyway.\u003C/p\u003E\u003Cp\u003EUnfortunately most people like you just steal other peoples work.\u003C/p\u003E\u003Cp\u003ESorry if this is hugely off topic but people like that just make my hair stand up strait with rage\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe license contains a specific requirement: \u0022If You use our Work, You must acknowledge Us.\u0022 As long as we\u0027re talking about exercising the permission that\u0027s given in the license, we\u0027re not talking about claiming credit for Fractal\u0027s work.\u003C/p\u003E\u003Cp\u003EAnd please don\u0027t insult the mod author\u0027s intelligence by suggesting that his expectations wouldn\u0027t be accurately reflected in the license he chose.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-18T23:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EGenerators have a thing called efficiency that tells how much of the reactors THERMAL power they can convert to MegaJoules. Best efficiency is from KTEC generator with proper radiators, when it will be around 58%. Another generator on an ordinary reactor doesn\u0027t help anything.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESooo, let us see if I get this straight.\u003C/p\u003E\u003Cp\u003E3.75m KTEC Solid State Generator(currently sitting in orbit, so... not a small satellite \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003E- Efficiency 50,5%\u003C/p\u003E\u003Cp\u003E3.75m \u0022Aegletes 2\u0022 Fission Reactor\u003C/p\u003E\u003Cp\u003E- Thermal Power 9GW\u003C/p\u003E\u003Cp\u003EThis would mean, the Generator should generate around 4,45 GW, right?\u003C/p\u003E\u003Cp\u003EI tested a little bit... I think you\u0027re... kinda right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E- the tooltip inflight says max 4,53 GW and does this when I shut down the second generator.\u003C/p\u003E\u003Cp\u003E- with only one generator online, the transceiver only transmits only 4,525 GW\u003C/p\u003E\u003Cp\u003E- with the second generator online, they both produce 2.26 GW, but the transceiver transmits 8,956 GW (there are no Megajoules stored in the satellite, it\u0027s completely drained)\u003C/p\u003E\u003Cp\u003EIf the second generator shouldn\u0027t \u0022do\u0022 anything, why does the transceiver send nearly twice as much juice around?\u003C/p\u003E\u003Cp\u003EIs this a bug or do I still not understand something? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-05-19T00:17:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003ESooo, let us see if I get this straight.\u003Cp\u003E3.75m KTEC Solid State Generator(currently sitting in orbit, so... not a small satellite \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003E- Efficiency 50,5%\u003C/p\u003E\u003Cp\u003E3.75m \u0022Aegletes 2\u0022 Fission Reactor\u003C/p\u003E\u003Cp\u003E- Thermal Power 9GW\u003C/p\u003E\u003Cp\u003EThis would mean, the Generator should generate around 4,45 GW, right?\u003C/p\u003E\u003Cp\u003EI tested a little bit... I think you\u0027re... kinda right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E- the tooltip inflight says max 4,53 GW and does this when I shut down the second generator.\u003C/p\u003E\u003Cp\u003E- with only one generator online, the transceiver only transmits only 4,525 GW\u003C/p\u003E\u003Cp\u003E- with the second generator online, they both produce 2.26 GW, but the transceiver transmits 8,956 GW (there are no Megajoules stored in the satellite, it\u0027s completely drained)\u003C/p\u003E\u003Cp\u003EIf the second generator shouldn\u0027t \u0022do\u0022 anything, why does the transceiver send nearly twice as much juice around?\u003C/p\u003E\u003Cp\u003EIs this a bug or do I still not understand something? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a bug, but it may or may not be actually transmitting that much power. I\u0027ll look at the code later.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-19T00:21:30Z","Content":"\n\u003Cp\u003EWhee, I found a bug \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAaand, okay, the last satellite (3/4 already launched \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) will only feature one generator. Even if the transmitter would transmit twice as much, I don\u0027t like bug-using and (probably) after the next KSPI-update it would be useless anyway.\u003C/p\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-19T00:36:56Z","Content":"\n\u003Cp\u003EThings I would do to simplify KSPI and/or improve it from a gameplay perspective:\u003C/p\u003E\u003Cp\u003E1. Remove generators, incorporate their functionality (and weight, if necessary) into the reactors themselves. MAYBE allow switching between thermal and charged-particle generation as a VAB tweakable, but I would just presume both types of generator are present in the reactor, and scale power level to balance if necessary.\u003C/p\u003E\u003Cp\u003E2. Scale the power of the smaller reactor types up to match the TWR of the larger reactor/thermal rocket combos. As someone just mentioned a few posts back, it is extremely disappointing to get access to badass manly nuclear reactors and find out that the only one that isn\u0027t wholly inferior to the LV-N is the giant massive one that\u0027s bigger than your mom and not going anywhere fast anyway. Sometimes you just want to land a dude on Minmus, not arm-wrestle an asteroid and win.\u003C/p\u003E\u003Cp\u003E3. Roll thermal power and charged particles into KJ. KSPI has three different types of what is basically usable energy, and that\u0027s ridiculous, especially considering we already had a usable energy resource in the stock game. I appreciate there are reasons for megajoules to continue existing, but there really aren\u0027t any for TP and CP. Get rid of them with the generators.\u003C/p\u003E\u003Cp\u003E4. Remove the need to correctly orient microwave receivers. Power reception should be based on distance (and line of sight re: planetary bodies) to the transmitting relay/source, not the position of the receiver on the craft. Trying to maintain usable power levels in every orientation leads to part creep and unwelcome surprises when it turns out that the direction you need to burn to prevent a high-energy rendezvous is the one direction your receivers aren\u0027t pointing in. Also frustrating for new players to figure out.\u003C/p\u003E\u003Cp\u003EOR\u003C/p\u003E\u003Cp\u003E4. Consider removing or massively reworking the microwave system. Right now there is no incentive to carry reactors on craft, because with even a moderate microwave infrastructure in place, a receiver will \u0022produce\u0022 a zillion times the power of most reactors with a fraction of the weight. Launch enough fusion reactors around and you can produce 10 times the power of the largest fusion reactor with a 1 ton part. This makes a lot of stuff superfluous, like - radiators, fissionable/fusionable ISRU, lab reprocessing, having 20 different reactor types in the first place, etc. There is no incentive to gather resources when it\u0027s easier to just build stuff on Kerbin and beam energy from there. \u003C/p\u003E\u003Cp\u003EBut, of course, if you\u0027re going to fix the microwave system, the reactors would need to be buffed. I would very, very happily mine some fuggin Thorium if a nuclear reactor could give me launch thrusts from Eve without being 85% of my lander weight. This would also be nice because I wouldn\u0027t have to hope relays are in the right position to send the Kerbin/Jool power to that part of Eve\u0027s surface.\u003C/p\u003E\u003Cp\u003E5. Remove Tritium. Roll it into Deuterium as D-T fuel. \u003C/p\u003E\u003Cp\u003E6. Either remove or massively boost Helium-3.\u003C/p\u003E\u003Cp\u003E7. Argon doesn\u0027t really need to be a thing. Methane needs to either get a full set of engines/tanks, or be removed. Same with Aluminum. The AlO2 rocket is too unwieldy a piece of crap to care about. Uranium Nitride? Doesn\u0027t need to be a thing. Just call it Uranium. Hydrogen peroxide doesn\u0027t need to exist either. It is itself a monopropellant. Just go straight from water to monoprop. It\u0027s crap compared to hydrazine but this is a gaaaaaaaame. We also have liquid hydrogen that never boils off and RTGs that never lose power. Just do it.\u003C/p\u003E\u003Cp\u003E8. Let us melt down reactors to self-destruct stuff because that would be AWESOME.\u003C/p\u003E\u003Cp\u003E9. Unupgraded radiators need to not completely suck nuts. Make them tungsten filament or something if you want. Similar operating temperature, higher weight? Maybe? I wouldn\u0027t do the calculations even if I knew how to. There\u0027s no need it\u0027s a gaaaaaaame.\u003C/p\u003E\u003Cp\u003E10. A smaller version of the DT Vista would be hot. There\u0027s a niche for that kind of high isp decent thrust thing that doesn\u0027t require microwaves in the lander weight class.\u003C/p\u003E\u003Cp\u003E\u0022But Dere, muh SCIENCE, this isn\u0027t accurate!!!??\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v228/PIKARAPTOR/Internet%20reactions/tumblr_lollkblH5q1qafrh6.gif\u0022 alt=\u0022tumblr_lollkblH5q1qafrh6.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-19T06:25:17Z\u0022 title=\u002205/19/2014 06:25  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 19, 2014\u003C/time\u003E by Deredere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whovian","CreatedById":101923,"CreatedDateTime":"2014-05-19T01:35:25Z","Content":"\n\u003Cp\u003ESorry, just found a minor bug while playing around with the thermal rocket nozzles today. If they aren\u0027t attached to a reactor, they produce a small pulse of delta-v and use a little fuel before they realize there\u0027s no reactor; thus assigning an action group to \u0022activate engine\u0022 and spamming away allows reactor-free delta-v from them. I deorbited a tiny vehicle from a 100k orbit around Kerbin using this. No idea why anyone would use this, given that the isp is horrible and it requires button-spamming.\u003C/p\u003E\u003Cp\u003EJust wanted to point this out. It probably doesn\u0027t need fixing all that badly.\u003C/p\u003E\u003Cp\u003EEDIT: Oh. The isp is actually quite impressive; spamming 4 \u0022activate engine\u0022 action groups (my fingers aren\u0027t all that fast) resulted in a 2200 m/s burn on a 3.3-ton ship (lander can, FL-T400, 1.25 m thermal rocket nozzle) using only 70 liters of fuel. The g-force during said burn oscillated between usually 1 and 4 and sometimes went as high as 6. So, basically, quite an exploit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-19T01:46:42Z\u0022 title=\u002205/19/2014 01:46  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 19, 2014\u003C/time\u003E by Whovian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"the grue","CreatedById":111332,"CreatedDateTime":"2014-05-19T02:17:13Z","Content":"\n\u003Cp\u003EApologies if this has already been asked before.\u003C/p\u003E\u003Cp\u003EIs there any benefit to attaching two generators to either end of one reactor? Or is it just better to install additional radiators?\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-19T02:45:34Z","Content":"\n\u003Cp\u003EI asked something similar a page ago:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43839-0-23-5-KSP-Interstellar-%28Toolbar-Integration-New-Models-New-Tech%29-Version-0-11?p=1166027\u0026amp;viewfull=1#post1166027\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43839-0-23-5-KSP-Interstellar-%28Toolbar-Integration-New-Models-New-Tech%29-Version-0-11?p=1166027\u0026amp;viewfull=1#post1166027\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"bonesbro","CreatedById":104036,"CreatedDateTime":"2014-05-19T02:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022the grue\u0022 data-cite=\u0022the grue\u0022\u003E\u003Cdiv\u003EApologies if this has already been asked before.\u003Cp\u003EIs there any benefit to attaching two generators to either end of one reactor? Or is it just better to install additional radiators?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAttaching two generators of the same type to a reactor is pointless. The only time it\u0027s useful is when the reactor emits both thermal power AND charged particles, and you attach one direct conversion generator (which uses charged particles) and one thermal generator (which uses thermal power). That will get you some extra electricity production at the cost of additional weight.\u003C/p\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-19T02:52:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EI asked something similar a page ago:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43839-0-23-5-KSP-Interstellar-%28Toolbar-Integration-New-Models-New-Tech%29-Version-0-11?p=1166027\u0026amp;viewfull=1#post1166027\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43839-0-23-5-KSP-Interstellar-%28Toolbar-Integration-New-Models-New-Tech%29-Version-0-11?p=1166027\u0026amp;viewfull=1#post1166027\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah but that guy is wrong, mostly.\u003C/p\u003E\u003Cp\u003EIf a generator produces both thermal power and charged particles (Fusion reactors running D-T or D-He3 or upgraded particle bed fission reactors) then attaching two generators, one thermal and one direct conversion, will have a benefit.\u003C/p\u003E\u003Cp\u003ERegular fission reactors and antimatter reactors produce only thermal power and only benefit from a sterling/Ktec generator. Pure He3 fusion reactors produce only charged particles and only benefit from a direct conversion generator.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-05-19T05:14:59Z","Content":"\n\u003Cp\u003EYou will want to use both types of generators for reactors that output both types of energy. Assuming you want the extra efficiency of the charged particle conversion. And they you are willing to sacrifice TWR for that extra generator.\u003C/p\u003E\u003Cp\u003EThe sticky part is that right now thermal generators and thermal nozzles are able to utilize charged particles if demand exceeds that of the available thermal power. This is problem since there is no detection of whether or not there is a more efficient generator available. So what happens is that both generators think they have access to all of the charged particles exclusively and report their output accordingly. This discrepancy is large enough to shut down a fusion reactor due to no power being left available for confinement.\u003C/p\u003E\u003Cp\u003EIn my experience, it won\u0027t shut down while focused, but it will always shut down in the background when it is handed over to Open Resource Manager for persistence maintenance.\u003C/p\u003E\n"},{"CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-05-19T05:25:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deredere\u0022 data-cite=\u0022Deredere\u0022\u003E\u003Cdiv\u003EThings I would do to simplify KSPI and/or improve it from a gameplay perspective:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1 on everything Dere said.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-19T12:49:37Z","Content":"\n\u003Cp\u003EMhm, for some reason i\u0027m unable to reprocess nuclear fuel... Tried it once in orbit and now on the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i4.minus.com/iblP0h13R71gaz.png\u0022 alt=\u0022iblP0h13R71gaz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere is new UHF4, there is space for DepletedFuel and there are 156 Actinides. Halp?\u003C/p\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-05-19T17:37:31Z","Content":"\n\u003Cp\u003EI see no space for Kerbals on those things. I may be mistaken, but I think you must have at least one (possibly two) Kerbals onboard to reprocess the nuclear fuel, or an upgraded computer core.\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2014-05-19T17:48:53Z","Content":"\n\u003Cp\u003E156 actinides...oh dear, world will come to an end. Seriously, there is still plenty of fuel on those reactors. Also, for some reason one needs to click twice on the reprocess button on the gui.\u003C/p\u003E\u003Cp\u003EAnd for Deredere: first thanks for kind words, secondly, all you need is an hypereditengine and all is good for you. So, game over and on to next game, eh?\u003C/p\u003E\n"},{"CreatedByName":"Pure","CreatedById":111369,"CreatedDateTime":"2014-05-19T18:56:25Z","Content":"\n\u003Cp\u003ESo, I installed this great looking mod and ran into a few issues.\u003C/p\u003E\u003Cp\u003EIf I add a Science Lab to ANY rocket (with kerbals, without kerbals, makes no difference), my staging is gone upon launch, and I cannot launch at ALL. Do I need a reactor to power this thing from the get go? I can\u0027t figure out what I am doing wrong.\u003C/p\u003E\u003Cp\u003EAlso, I flung a fission reactor into orbit (with a generator, plenty of UF4 tanks and radiators) and it doesn\u0027t produce any power. I cannot right click it to start it either. I tried EVA with a kerbal, nothing appears in the right click menu or anywhere else.\u003C/p\u003E\u003Cp\u003EBesides that, there is no way for me to unfold the radiators (I tried all three models), just shows me waste heat in the right click menu, nothing else.\u003C/p\u003E\u003Cp\u003ESooo.. not so succesful so far..\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EPure\u003C/p\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-19T19:06:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EAnd for Deredere: first thanks for kind words, secondly, all you need is an hypereditengine and all is good for you. So, game over and on to next game, eh?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMan, if you\u0027re trying to imply I want to make KSPI easier, you totes didn\u0027t read a thing I wrote.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-19T19:35:34Z","Content":"\n\u003Cp\u003E@Einarr: The orbital test was done by a two-kerbal-crew.\u003C/p\u003E\u003Cp\u003E@Makeone: It was a test, want how/if it works.. Well, didn\u0027t \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But that \u0022click twice\u0022 might be the solution\u003C/p\u003E\u003Cp\u003E@Pure: Kinda sounds as if you didn\u0027t install the plugin, only the parts.\u003C/p\u003E\n"},{"CreatedByName":"Pure","CreatedById":111369,"CreatedDateTime":"2014-05-19T19:40:38Z","Content":"\n\u003Cp\u003E@cy-one\u003C/p\u003E\u003Cp\u003EI downloaded the archive (from the first post in this thread), and moved all the files into the GameData folder, as the installation instructions told me to (so, I did not copy GameData into GameData). Basically, I followed the instructions.\u003C/p\u003E\u003Cp\u003EI also started a new (career) game, and selected the proper science tree.\u003C/p\u003E\u003Cp\u003EI installed it initially together with a bunch of other mods. When I ran into the issues from the previous post I made a clean install of KSP (0.23.5.464) with just the Interstellar mod and ran into the same issues.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EPure\u003C/p\u003E\n"},{"CreatedByName":"Pure","CreatedById":111369,"CreatedDateTime":"2014-05-19T19:52:36Z","Content":"\n\u003Cp\u003EAargh.. Nevermind..\u003C/p\u003E\u003Cp\u003EI redownloaded the archive. Unzipped it again and compared the old installation vs the new one.. 20 megs of difference.. I was missing some files apparently (no clue how that happened).\u003C/p\u003E\u003Cp\u003EIt seems to work now..\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2014-05-19T20:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deredere\u0022 data-cite=\u0022Deredere\u0022\u003E\u003Cdiv\u003EMan, if you\u0027re trying to imply I want to make KSPI easier, you totes didn\u0027t read a thing I wrote.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did read it, and i read it again and...\u003C/p\u003E\u003Cp\u003EYes, you seem to wish that the mod would be easier, isn\u0027t it? I mean, you are asking that most of the core parts of the mod would be removed, like the tritium that is required for proper fusion that would any serious power. Fractal mentioned that he created the interstellar resource manager just so that mod would have some reason to work. There is no such thing as free lunch, right?\u003C/p\u003E\u003Cp\u003EI do agree that 1.25m fission reactor fitted with rocket nozzle should give some better thrust as it is closes to LV-N (aka stock NERVA) that i am currently trying NOT to use on my current career save, all good so far.\u003C/p\u003E\u003Cp\u003EAlso, i case of anti matter reactors, an integrated generator would be handy so that it output could be upgraded with science (in career mode, that is), up to, say, 85-90% of the thermal power.\u003C/p\u003E\u003Cp\u003EBut you probably know the basic rule in these kind cases, if you can\u0027t cope with it, uninstall it.\u003C/p\u003E\n"}]}