{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":32,"Articles":[{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-26T23:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Yes, I had to do a bit of rescaling, part physical, part imaginary in order to get black body radiation values (via Stefan-Boltzmann) closer to the kind of values that my reactors actually produce.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EI completely not mean you doing something wrong with it. I have some basic understanding (and usually do some investigations about things I try to make). Surely it must to have huge area to give any noticeable effect, it\u0027s not very effective process. It was more about how it looks rather than how reasonable it is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-26T23:44:41Z\u0022 title=\u002209/26/2013 11:44  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 26, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-26T23:53:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zzz\u0022 data-cite=\u0022zzz\u0022\u003E\u003Cdiv\u003EI completely not mean you doing something wrong with it. I have some basic understanding (and usually do some investigations about things I try to make). Surely it must to have huge area to give any noticeable effect, it\u0027s not very effective process. It was more about how it looks rather than how reasonable it is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it must be fairly large but we can minimise the area by going to high temperatures. The radiated power scales with temperature^4 so moderate increases in temperature lead to massive increases in radiated power.\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-27T10:52:21Z","Content":"\n\u003Cp\u003EOk, now something completely different. I don\u0027t know how some one could to use it and to fly with such thing, I\u0027m usually try to keep placeholders bounds for parts to not change exsised rocket designs too much but do not in this case. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rSwwsJG.jpg\u0022 alt=\u0022rSwwsJG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell It\u0027s microwave transmitter and receiver and it\u0027s far not as handy as current dish. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PSj8iFj.jpg\u0022 alt=\u0022PSj8iFj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMaybe just not use it or halve size of it, I don\u0027t know. But I wanted to make it this way.\u003C/p\u003E\u003Cp\u003E Just read how epic actual size of such things must to be\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://2ch.hk/spc/src/1379970578172.jpg\u0022 alt=\u00221379970578172.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway - there the link \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/d34iua26he140zy/microwave.7z\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/d34iua26he140zy/microwave.7z\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2013-09-27T11:22:16Z","Content":"\n\u003Cp\u003Ezzz your models are amazing - will you ever work on doing a more sci-fi, advanced-looking thermal rocket?\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-27T11:58:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Eadvanced-looking thermal rocket?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you mean this nozzles? Yes, I thought about it for some time and planned it next. I\u0027m actually in this moment was going to ask about it. I have some ideas but not sure how will be better to make it (and how much \u0022advanced-looking\u0022 it must to be) , there can be several approaches. Maybe you know some picture of how you want it to look(\u003Cem\u003Enot sure is this correct words order to make it to be a question\u003C/em\u003E)?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-27T12:21:17Z\u0022 title=\u002209/27/2013 12:21  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 27, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xentoe","CreatedById":80083,"CreatedDateTime":"2013-09-27T12:24:30Z","Content":"\n\u003Cp\u003ETo be true I got still not how this damn Thermal ROcket works (that is is acceptable strong).\u003C/p\u003E\u003Cp\u003E(Yes Reactor direct and so... but this helps not real mutch (yes I have updated it).\u003C/p\u003E\u003Cp\u003EStays still more or less a \u0022farty\u0022 strength.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-27T12:32:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zzz\u0022 data-cite=\u0022zzz\u0022\u003E\u003Cdiv\u003EDo you mean this nozzles? Yes, I thought about it for some time and planned it next. I\u0027m actually in this moment was going to ask about it. I have some ideas but not sure how will be better to make it, there can be several approaches. Maybe you know some picture of how you want it to look(\u003Cem\u003Enot sure is this correct words order to make it to be a question\u003C/em\u003E)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess it would look fairly simple because it is just a simple rocket nozzle, the most likely shape for it is a simple Bell nozzle. Which is just the type that we have lots of in the game already. It could also be something like an expansion deflection nozzle but the difference is fairly subtle anyway (as far as I can tell, externally, the expansion deflection nozzle is just a bit shorter and fatter).\u003C/p\u003E\u003Cp\u003EThere is more room for creativity with the thermal turbojet which could be a (typical aircraft) plug nozzle engine, it could be an aerospike or it could also be an expansion deflection type nozzle.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zzz\u0022 data-cite=\u0022zzz\u0022\u003E\u003Cdiv\u003EOk, now something completely different. I don\u0027t know how some one could to use it and to fly with such thing, I\u0027m usually try to keep placeholders bounds for parts to not change exsised rocket designs too much but do not in this case. \u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rSwwsJG.jpg\u0022 alt=\u0022rSwwsJG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell It\u0027s microwave transmitter and receiver and it\u0027s far not as handy as current dish. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PSj8iFj.jpg\u0022 alt=\u0022PSj8iFj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMaybe just not use it or halve size of it, I don\u0027t know. But I wanted to make it this way.\u003C/p\u003E\u003Cp\u003E Just read how epic actual size of such things must to be\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://2ch.hk/spc/src/1379970578172.jpg\u0022 alt=\u00221379970578172.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are plenty of things I could do with these, I could use the huge receiver to make a bigger receiver that lets you receive much more power (i.e. less distance losses) for surface bases and that sort of thing. Having one of these attached off to the side of your moon base would look very nice, I think.\u003C/p\u003E\u003Cp\u003EIf anyone has other suggestions though, I\u0027m open to ideas.\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-27T12:33:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETo be true I got still not how this damn Thermal ROcket works (that is is acceptable strong).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you cut out NERVA (lv-n)nozzle - you will got this thing. But if LV-N have predefined reactor there you can to choose which one will be used.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI guess it would look fairly simple because it is just a simple rocket nozzle, the most likely shape for it is a simple Bell nozzle. Which is just the type that we have lots of in the game already.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thoght similar, but there is what I call \u0022several approaches\u0022. Make it to be reasonable simple bell nozzle or make it something I don\u0027t know what advanced cool looking. But even with bell I still not sure how to make it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-27T13:19:21Z\u0022 title=\u002209/27/2013 01:19  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 27, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-27T15:16:33Z","Content":"\n\u003Cp\u003EJust been playing around with the glow effects, I think the radiators look much nicer with some of these added:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ijPppbo.png\u0022 alt=\u0022ijPppbo.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-27T15:46:04Z","Content":"\n\u003Cp\u003EWhen you are using a thermal rocket, you don\u0027t need to worry about radiating heat, what you have in this case is open cycle cooling. That means, if you just want to run a nuclear or antimatter reactor without a generator attached and just use it to power a thermal rocket engine, you don\u0027t need to worry about cooling. You use the reactor to heat up the propellant and then throw it out of the back of your ship, at which point that heat is no longer your problem.\u003C/p\u003E\u003Cp\u003EMy rocket here has the generator turned off but is running on an antimatter reactor, it isn\u0027t generating any heat because all of the heat that is being produced is being dissipated by the engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zsKlvqm.jpg\u0022 alt=\u0022zsKlvqm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf I then turn on the generator and tell the alcubierre drive to start charging, my engines are no longer dissipating all of the heat and my waste heat starts to build up once again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/45Sxnvc.png\u0022 alt=\u002245Sxnvc.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Krevsin","CreatedById":83150,"CreatedDateTime":"2013-09-27T15:55:37Z","Content":"\n\u003Cp\u003EI have to say, good work on this mod. I\u0027ve been enjoying it immensely (after removing the antimatter and warp things. Too handwavy for my tastes). Keep it up.\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-27T23:22:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EJust been playing around with the glow effects\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you to control emmisive color.a (0-1.5) by the plugin or it\u0027s will be too hard?\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-27T23:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zzz\u0022 data-cite=\u0022zzz\u0022\u003E\u003Cdiv\u003ECan you to control emmisive color.a (0-1.5) by the plugin or it\u0027s will be too hard?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know, if I can figure out how to get the glow effect itself from the code then it should be easy because I can just modify its transparency. Is there a specific name that I can address this layer by, do you know?\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-09-27T23:49:37Z","Content":"\n\u003Cp\u003EHow serious do you plan to make the negative effects of heat buildup? I tend to build things for aesthetic appeal, and i\u0027d rather not have giant panels sticking out of my ships.\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-28T00:15:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIs there a specific name that I can address\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know barely nothing about unity coding. \u0022emmisive color.a\u0022 is how called emissive map alpha(transparency) multiplier in material, I use it in animation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T00:17:08Z\u0022 title=\u002209/28/2013 12:17  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-28T00:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003EHow serious do you plan to make the negative effects of heat buildup? I tend to build things for aesthetic appeal, and i\u0027d rather not have giant panels sticking out of my ships.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not entirely sure how I\u0027m going to handle the negative effects just yet but ultimately, not dissipating heat is one of those things that would be a very effective way of killing anyone aboard your ships and, if you continue, cooking your ship as well. I\u0027ll likely add more safety features anyway so that things shut down automatically before bad consequences result meaning that the likely worst consequence is that your reactors continue to function but with vastly diminished capacity.\u003C/p\u003E\u003Cp\u003EAdditionally, the open cycle cooling I mentioned above makes a huge difference because almost nothing requires the reactors to be run anywhere near close to full power other than thermal rocket engines, plasma engines, alcubierre drives, DT-vistas and science lab antimatter production. Thermal engines dissipate their own heat, so you don\u0027t need radiators to cool them so it\u0027s really just plasma engines, alcubierre drives, DT-vistas and science labs producing antimatter that require extensive radiative cooling. Anything else and you should be able to cope with one or two small radiators.\u003C/p\u003E\u003Cp\u003EYou can still manage the heat even with small radiators because you can now control whether the warp drive will charge or not, so if you turn everything that uses power off you can spend some time dissipating excess heat then turn everything back on for a while while you have spare Waste Heat capacity.\u003C/p\u003E\u003Cp\u003EThe point is, it won\u0027t be hard to avoid the negative effects but it will give you an extra thing to have to plan to deal with. I also think that this can, in fact, be a good thing for spacecraft aesthetics - retracted radiators function pretty effectively convectively so you generally don\u0027t need to actually deploy them until you\u0027re actually in orbit, which I think helps keep everything looking appropriate to its setting.\u003C/p\u003E\u003Cp\u003EIn an ideal world, it\u0027d also be nice to make open cargo bay doors from the likes of B9 function as radiators (like the space shuttle\u0027s did) but that may be a pipe dream.\u003C/p\u003E\n"},{"CreatedByName":"GabrielG.A.B.Fonseca","CreatedById":13436,"CreatedDateTime":"2013-09-28T01:04:02Z","Content":"\n\u003Cp\u003EIdea: Being nearer the sun reduces the efficiency of heat dissipation. Shadowing the Radiators helps a little to increase it.\u003C/p\u003E\u003Cp\u003EIt would be darn awesome to have to design a Solar Relay Station that way. Solar panels around a Hexagon-shaped transmitter, with huge radiator panels glowing red-hot over the station\u0027s shadow, shielded from the sun\u0027s own radiation emissions.\u003C/p\u003E\u003Cp\u003EAll of that compressed into seven words: AWESOME!!!\u003C/p\u003E\n"},{"CreatedByName":"curiousepic","CreatedById":60039,"CreatedDateTime":"2013-09-28T01:08:18Z","Content":"\n\u003Cp\u003EWoo finally a mod with thermal management! This looks amazing.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-28T01:45:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022curiousepic\u0022 data-cite=\u0022curiousepic\u0022\u003E\u003Cdiv\u003EWoo finally a mod with thermal management! This looks amazing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s funny actually, thermal management was the first idea for a KSP mod that I had, it\u0027s also something I\u0027ve seen brought up time and time again by people on the forums as something they\u0027d like to see included in the stock game. As soon as I had the models to do this, this was always going to be a top priority.\u003C/p\u003E\u003Cp\u003EIn my opinion, KSP is a pretty neat educational tool, teaching people about many aspects of space travel so I do think it\u0027s a real shame that heat management, which is both one of the most important but also least publicly acknowledged aspects of space travel, is excluded from the stock game.\u003C/p\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2013-09-28T02:16:31Z","Content":"\n\u003Cp\u003EFractal, your progress with updates is as always amazing. When can we expect to have this next beauty?\u003C/p\u003E\n"},{"CreatedByName":"Xentoe","CreatedById":80083,"CreatedDateTime":"2013-09-28T02:32:10Z","Content":"\n\u003Cp\u003EThis Question is mostly to the Modelmakers here.\u003C/p\u003E\u003Cp\u003EI wonder if it would be ok when I announce little design Problem I got (I made me a work around but it is not a realistic one).\u003C/p\u003E\u003Cp\u003Eyou know the warpdrive is a fully ring.\u003C/p\u003E\u003Cp\u003EThis works fine for the standart ship / Rocket.\u003C/p\u003E\u003Cp\u003EBut it is a (if we wanna stay realistic) dessaster for a Spaceplane based ship.\u003C/p\u003E\u003Cp\u003ENo landinggear is high enougth that the Ring does not break on the runway.\u003C/p\u003E\u003Cp\u003EI made now with Magic Smoke a Swingable Ring.\u003C/p\u003E\u003Cp\u003EWhat means it can change between horizontal and vertical alignment \u003C/p\u003E\u003Cp\u003E(see screenshots)\u003C/p\u003E\u003Cp\u003EHorizontal:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/855/xelx.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img855/9402/xelx.th.png\u0022 alt=\u0022xelx.th.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVertical:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/189/jyhg.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img189/5594/jyhg.th.png\u0022 alt=\u0022jyhg.th.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo the Point is now, this is technical not impossible. The ring does move through the solid shipstructure (Works because glitch) but in real life it is impossible.\u003C/p\u003E\u003Cp\u003Eso I thought now about one additional model for the warpringdrive.\u003C/p\u003E\u003Cp\u003ELeT\u0060s say an advanced construct, but only the small capacety one).\u003C/p\u003E\u003Cp\u003EThe follwing:\u003C/p\u003E\u003Cp\u003EThe Ring has 2 \u0022states\u0022 \u003C/p\u003E\u003Cp\u003EIn the let\u0060s call it offline state, it is rotated like on Picture 1, but it is not a full ring, only more like (on eatch side) 2 nearly halfrings like this: (-|-).\u003C/p\u003E\u003Cp\u003EThan you set it online, and the 2 parts swing into vertical mod (like Picture 2) and connect both to be again a Ring. \u003C/p\u003E\u003Cp\u003EKnows someone the Episode \u0022The timemashine2 in Captain Future? There the Comet has too a Ringshaped shipaddition, that extends from a kind of narcels. \u003C/p\u003E\u003Cp\u003EIt is like said only an idea.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T05:51:50Z\u0022 title=\u002209/28/2013 05:51  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by Xentoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-28T02:47:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E) 2 nearly halfrings like this: (-|-).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see. I can to make it. I like moving things and it can to used as model for small\\tiny sized version instead just rescale. Something simple. But I need to finish with engines(thermal\\plasma\\jet) at first before to take something else.\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2013-09-28T05:06:12Z","Content":"\n\u003Cp\u003EAny reason why my science station isn\u0027t producing science.. It is on Minmus, has 2 kerbals, and is powered. Yet when I activate \u0022do research\u0022 it animates but doesn\u0027t produce anything. Does it have to be farther away from Kerbin or is it glitched?\u003C/p\u003E\n"},{"CreatedByName":"Conti","CreatedById":79105,"CreatedDateTime":"2013-09-28T05:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere are plenty of things I could do with these, I could use the huge receiver to make a bigger receiver that lets you receive much more power (i.e. less distance losses) for surface bases and that sort of thing. Having one of these attached off to the side of your moon base would look very nice, I think.\u003C/p\u003E\u003Cp\u003EIf anyone has other suggestions though, I\u0027m open to ideas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe large one would be ideal for relay receiver or surface receiver (to reduce range and atmospheric losses). This would give the relays an advantage in improving efficiency.\u003C/p\u003E\u003Cp\u003EI also have a model for a new microwave receiver, it is for receiving microwave energy as thermal power to drive an assortment of thermal engines I have created. I have also been thinking for smaller microwave energy receivers, for small rovers and probes, we could actually use a rectenna model (think rabbit ears) and reduce the amount of energy they can receive. This would be in keeping with realistic real world microwave energy receivers. Transmitters should be masers, not dishes, that much is certain.\u003C/p\u003E\u003Cp\u003EPS: I haven\u0027t put my preliminary relay/nuclear transmitter code up yet because I\u0027ve discovered a couple of bugs that I have to iron out first. I will hopefully have the time to get to it by next week.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T05:16:22Z\u0022 title=\u002209/28/2013 05:16  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by Conti\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xentoe","CreatedById":80083,"CreatedDateTime":"2013-09-28T05:44:59Z","Content":"\n\u003Cp\u003ESure no problem:-) I wanted only suggest it :-) Because like said would look sure coole r(for people who build spaceplanelike ships)\u003C/p\u003E\u003Cp\u003EAhh additional I found a Bug:\u003C/p\u003E\u003Cp\u003EFollowing:\u003C/p\u003E\u003Cp\u003EI have an Antimatter reactor (tried with all scales).\u003C/p\u003E\u003Cp\u003EAnd one of these Electricity / Megajule Generators.\u003C/p\u003E\u003Cp\u003ENow when I Update the Antimatter Reactor (Retrofit).\u003C/p\u003E\u003Cp\u003EThe Electricity Generator says: No Thermal Power connected\u003C/p\u003E\u003Cp\u003E(It does than behave like there is no AM Reactor anymore and stops working, but the AM does still make Thermal Output power (like it should)).\u003C/p\u003E\n"}]}