{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":79,"Articles":[{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T19:19:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003EInstead of wasting all that exotic matter you could just reduce the storage size.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReducing the storage size reduces the range. Doing it the way I suggested will leave the drive with the same range but limit you to a single jump before recharging.\u003C/p\u003E\u003Cp\u003EJust explain it as exotic matter being volatile once tapped for propulsion so it must be vented into space and regenerated.\u003C/p\u003E\n"},{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2013-10-16T19:20:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEC/MJ conversion\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have tried to find useful information in this hyperinflating thread, as well as the Wiki, both to no avail.\u003C/p\u003E\u003Cp\u003ENone of my contraptions seem to be able to deliver MJ, even though there should be more than enough solar power coming in:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/aEyfXai\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/aEyfXai.jpg\u0022 alt=\u0022aEyfXai.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022http://pastebin.com/8gV6gdNU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/8gV6gdNU\u003C/a\u003E (Using stock 0.21.1 \u002B Interstellar. Action group 1 - toggle Gigantor folding.)\u003C/p\u003E\u003Cp\u003EPlease, what am I doing wrong?\u003C/p\u003E\u003Cp\u003EMany thanks,\u003C/p\u003E\u003Cp\u003EA.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T19:22:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andersenman\u0022 data-cite=\u0022Andersenman\u0022\u003E\u003Cdiv\u003EI have tried to find useful information in this hyperinflating thread, as well as the Wiki, both to no avail.\u003Cp\u003ENone of my contraptions seem to be able to deliver MJ, even though there should be more than enough solar power coming in:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/aEyfXai\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/aEyfXai.jpg\u0022 alt=\u0022aEyfXai.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022http://pastebin.com/8gV6gdNU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/8gV6gdNU\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPlease, what am I doing wrong?\u003C/p\u003E\u003Cp\u003EMany thanks,\u003C/p\u003E\u003Cp\u003EA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is currently NO WAY to convert electric charge to MJ on a single vessel. Its something we\u0027ve suggested a few times.\u003C/p\u003E\u003Cp\u003EYou CAN transmit the power and receive it and that will convert it to MJ but thats the only way I know of.\u003C/p\u003E\n"},{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2013-10-16T19:27:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003Eon a single vessel\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf only that information were included in the Wiki, which writes so boldly, \u0022the mod will freely convert between the standard ElectricCharge and MegaJoules at no extra charge\u0022\u003C/p\u003E\u003Cp\u003EThanks for the reply!\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T19:37:07Z","Content":"\n\u003Cp\u003EI can see where that would be misleading.\u003C/p\u003E\n"},{"CreatedByName":"NeoAcario","CreatedById":24645,"CreatedDateTime":"2013-10-16T20:00:10Z","Content":"\n\u003Cp\u003EHey \u003Cstrong\u003EFractal_UK\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAny plans to have the heat sinks work with the 2.5m Kethane converters which use their own sort of radiators to keep efficiency up?\u003C/p\u003E\u003Cp\u003ECould be useful\u003C/p\u003E\u003Cp\u003E~Steve\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-16T20:18:03Z","Content":"\n\u003Cp\u003E0.22 is out now! i\u0027m looking forward to see how this mod uses the science system\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-16T20:31:05Z","Content":"\n\u003Cp\u003EYeah, it\u0027d be nice to see it converted to the new system. The current implementation is somewhat rudimentary.\u003C/p\u003E\n"},{"CreatedByName":"redshift690","CreatedById":84838,"CreatedDateTime":"2013-10-16T20:36:03Z","Content":"\n\u003Cp\u003EReally enjoying your mod Fractal_UK! Thank you, and zzz and everyone else working on this for the time and effort that your putting in this! I to am excited to see how this works with the 0.22 science system. Now if I can just get 0.22 downloaded... as there server currently seems to be a bit overwhelmed for one reason or another. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bibblejw","CreatedById":56076,"CreatedDateTime":"2013-10-16T20:42:14Z","Content":"\n\u003Cp\u003EI\u0027d imagine that part of the issue with conversion would be that the new stuff is capital. You collect and spend it once, Fractal\u0027s is revenue, it\u0027s a resource that it generated and spent continuously.\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-16T20:49:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bibblejw\u0022 data-cite=\u0022Bibblejw\u0022\u003E\u003Cdiv\u003EI\u0027d imagine that part of the issue with conversion would be that the new stuff is capital. You collect and spend it once, Fractal\u0027s is revenue, it\u0027s a resource that it generated and spent continuously.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrouble is, it doesn\u0027t make sense to spend science every time you upgrade a single part. Why build a subpar reactor when you know exactly how to build a better one?\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-10-16T21:10:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003ETrouble is, it doesn\u0027t make sense to spend science every time you upgrade a single part. Why build a subpar reactor when you know exactly how to build a better one?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECost?\u003C/p\u003E\u003Cp\u003EI can see Fractal_UK making early non upgraded parts and then more expensive upgraded parts in the later half of a tech tree. But really im sure he is playing with 0.22 and totally ignoring the thread, like I will be doing once I get home:)\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-10-16T21:20:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027d imagine that part of the issue with conversion would be that the new stuff is capital. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not most intresting part of issue. \u003C/p\u003E\u003Cp\u003EScience tree is work only in Career mode - is this will be \u0022career only\u0022 mod or make last version of parts from start(or only basic) in sandbox?\u003C/p\u003E\u003Cp\u003E Node tree, seems like, only make \u0022unhide in vab\u0022 without changes in stats but Fractal did opposite - is this will be automatic upgrades depending on node unlock, all variants of parts in vab or hybrid system where tree unlocks parts(now you have antimatter tech) but upgrades is handled in old way?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T21:24:55Z\u0022 title=\u002210/16/2013 09:24  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-16T21:20:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003ECost?\u003Cp\u003EI can see Fractal_UK making early non upgraded parts and then more expensive upgraded parts in the later half of a tech tree. But really im sure he is playing with 0.22 and totally ignoring the thread, like I will be doing once I get home:)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, let me give you an example of what the plan is:\u003C/p\u003E\u003Cp\u003ELet\u0027s say you research the Nuclear Propulsion tech. That will give you access to Solid Core Nuclear reactors and Thermal Rockets. Let\u0027s say you research a later tech that gives you access to Gas Core Reactors (let\u0027s say Metamaterials for now but I haven\u0027t actually decided on this finally yet) then the idea is that all future Nuclear Reactors you build in the VAB will automatically be Gas Core designs but if you have older Solid Core still flying in space, you can upgrade them as you could before with the retrofit option.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure this works in theory but I\u0027m madly working out what I need to do to get the mod properly integrated with 0.22.\u003C/p\u003E\u003Cp\u003EAlso, I fear I\u0027m going to be short on tech nodes unless I figure out a way to add more.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-10-16T22:07:04Z","Content":"\n\u003Cp\u003EFractal_UK take some time to enjoy KSP while your at it;)\u003C/p\u003E\n"},{"CreatedByName":"Xentoe","CreatedById":80083,"CreatedDateTime":"2013-10-16T22:37:05Z","Content":"\n\u003Cp\u003ESo, there is a limit of Texchtree spots? (additional to the damn memorylimt?)\u003C/p\u003E\u003Cp\u003EHell... another modlimiter .-(\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-10-16T22:53:16Z","Content":"\n\u003Cp\u003Efrom what i gather to add more nodes to tech tree u have to create some type of .dll. did u check the mod dev thread thout they updated the mod part about .22 might have the info u need\u003C/p\u003E\n"},{"CreatedByName":"SeventhArchitect","CreatedById":80982,"CreatedDateTime":"2013-10-16T23:39:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003ECheers. Eeloo is a great destination for developing science infrastructure, good luck with the mission!\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EOh and by the way, just wanted to share a cool little imagine I produced during development. When I was saying to be careful of antimatter explosions, well, I meant it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGoodbye Kerbal Space Centre and thanks for all the rockets!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/e650aSf.png\u0022 alt=\u0022e650aSf.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe architect gives you seven thumbs up. gimme the files so I can have this too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-17T00:43:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003ETrouble is, it doesn\u0027t make sense to spend science every time you upgrade a single part. Why build a subpar reactor when you know exactly how to build a better one?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt should be noted that our current technological capabilities far outstrip what\u0027s commonly available, or even what\u0027s used most frequently in higher-order applications. A lot of that is cost, some of it is politics (hence, no nuclear engines, even though we essentially completed their development decades ago), and some of it is what I consider a kind of scientific \u0022fear\u0022 for lack of a better word. Scientists today are terrified of not living up to their predecessors, those idols who inspired them to become scientists in the first place. It\u0027s hard to push the envelope when your primary concern is whether or not your contribution will measure up to the ground-breaking work of those who are the reason for your entering the field in the first place.\u003C/p\u003E\u003Cp\u003EGranted, none of that matters in the game...but in those terms, it could be a meta-explanation.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-17T00:45:07Z","Content":"\n\u003Cp\u003EIn any case, he said he\u0027d like it to auto-upgrade parts once you have the research completed so that sounds awesome.\u003C/p\u003E\n"},{"CreatedByName":"Chase","CreatedById":69765,"CreatedDateTime":"2013-10-17T02:04:43Z","Content":"\n\u003Cp\u003EI hope no one lynches me for this, but I will be as honest and straight forward as I can. This is all \u003Cstrong\u003Emy personal opinion\u003C/strong\u003E, so grains of salt. Some of these have probably been touched on in the last 200 pages. But that is 200 pages, and I think it should be touched on again, even if it has.\u003C/p\u003E\u003Cp\u003EI hope he integrates this well with the new Science system in 0.22. I can see the research lab staying around, but converted to use the science system, while the research system just goes away (since the Science system is far more evolved it seems like, it even varies on biome!). I think this would be a major benefit to this mod, since it already had a research system and should have at least a small head start on other mods at implementing it.\u003C/p\u003E\u003Cp\u003EI personally think old parts in space should remain old parts in space unless there is a Kerbal nearby that can make adjustments, which is the best way to go about upgrading old stuff in KSP, since that is how real astronauts do it to say... Hubble. But even then the amount they can upgrade an old something should be limited. The more complex something probably the easier it is to justify being able to retrofit it (see chaos theory, a small change in a complex system achieves a larger end change then a large change in a very simple system). You don\u0027t seem them upgrading Voyager 1 or 2 with new reactors/engines! But they find new ways to use the old scientific instruments, but it doesn\u0027t mean the spacecraft itself changed in any way.\u003C/p\u003E\u003Cp\u003EThat said, I still think he should take this opportunity to make adjustment to some of the core attributes of the mod. Such as reducing the scale of some of the numbers he uses, and possibly switching MJ to stock EC.\u003C/p\u003E\u003Cp\u003EI don\u0027t really understand the need for two types of electricity, and while such things exist in reality (AC vs DC, Hertz, Voltage, etc), I think there is major benefit to keeping things simple. One less thing for people to learn. But I can see some of this mods stuff using a completely ludicrous amount of EC. Which would mean things that consume a lot of power would rely on active generation rather then stored power (but we already do that with ion engines, so no big issue). But it would also mean we could use a boatload of solar panels to power a Alcubierre Drive if we wanted (and why not, this is KSP right?) despite being very slow to charge.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-17T02:06:46Z\u0022 title=\u002210/17/2013 02:06  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 17, 2013\u003C/time\u003E by Chase\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-17T02:09:53Z","Content":"\n\u003Cp\u003EThe point behind the use of MJ as I recall was that electriccharge as a resource cannot be touched by his custom resource handler which allows the reactors to dynamically scale their output for example.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-17T02:17:23Z","Content":"\n\u003Cp\u003EHey Fractal:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/53192-0-22-TreeLoader-Custom-Career-Tech-tree-Loader-1-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/53192-0-22-TreeLoader-Custom-Career-Tech-tree-Loader-1-0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-17T02:23:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chase\u0022 data-cite=\u0022Chase\u0022\u003E\u003Cdiv\u003EI hope no one lynches me for this, but I will be as honest and straight forward as I can. This is all \u003Cstrong\u003Emy personal opinion\u003C/strong\u003E, so grains of salt. Some of these have probably been touched on in the last 200 pages. But that is 200 pages, and I think it should be touched on again, even if it has.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo lynching, but keep in mind, an opinion without some foundation of evidence or fact, isn\u0027t much of an opinion and probably won\u0027t be taken seriously. Not saying that\u0027s the case here, but we\u0027ll see. It\u0027s just a caveat I apply to all statements of opinion.\u003C/p\u003E\u003Cp\u003EIt has been touched on briefly a number of times throughout the thread, but typically only for very selfish and unproductive reasons. Rarely are they articulated particularly well, either. But constructive discussion on any topic is always a good thing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chase\u0022 data-cite=\u0022Chase\u0022\u003E\u003Cdiv\u003EI hope he integrates this well with the new Science system in 0.22. I can see the research lab staying around, but converted to use the science system, while the research system just goes away (since the Science system is far more evolved it seems like, it even varies on biome!). I think this would be a major benefit to this mod, since it already had a research system and should have at least a small head start on other mods at implementing it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think this is a particular concern. Most of what he\u0027s considered doing to merge the two is quite encouraging. Removing the research system he put in place might be necessary, but unfortunate. I actually prefer his version to .22. His system is more challenging, better suited to skilled players.\u003C/p\u003E\u003Cp\u003EBut I\u0027m confident he\u0027ll figure out the best of both worlds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chase\u0022 data-cite=\u0022Chase\u0022\u003E\u003Cdiv\u003EI personally think old parts in space should remain old parts in space unless there is a Kerbal nearby that can make adjustments, which is the best way to go about upgrading old stuff in KSP, since that is how real astronauts do it to say... Hubble. But even then the amount they can upgrade an old something should be limited. The more complex something probably the easier it is to justify being able to retrofit it (see chaos theory, a small change in a complex system achieves a larger end change then a large change in a very simple system). You don\u0027t seem them upgrading Voyager 1 or 2 with new reactors/engines! But they find new ways to use the old scientific instruments, but it doesn\u0027t mean the spacecraft itself changed in any way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can somewhat agree to that. Though there\u0027s a world of difference between upgrading a permanent station or base, an interplanetary ship, and a simple deep space probe. So while you\u0027re not wrong, the position isn\u0027t really relevant. At no point in this mod is it implied that you should always upgrade everything that\u0027s upgradable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chase\u0022 data-cite=\u0022Chase\u0022\u003E\u003Cdiv\u003EThat said, I still think he should take this opportunity to make adjustment to some of the core attributes of the mod. Such as reducing the scale of some of the numbers he uses, and possibly switching MJ to stock EC.\u003Cp\u003EI don\u0027t really understand the need for two types of electricity, and while such things exist in reality (AC vs DC, Hertz, Voltage, etc), I think there is major benefit to keeping things simple. One less thing for people to learn. But I can see some of this mods stuff using a completely ludicrous amount of EC. Which would mean things that consume a lot of power would rely on active generation rather then stored power (but we already do that with ion engines, so no big issue). But it would also mean we could use a boatload of solar panels to power a Alcubierre Drive if we wanted (and why not, this is KSP right?) despite being very slow to charge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe numbers are fine for the most part, although they should be adjusted to make things more difficult. It\u0027s been clearly demonstrated how easily abused the warp drive can be. Fortunately that should soon cease to be an issue.\u003C/p\u003E\u003Cp\u003EThere are two types of \u0022electrical power\u0022 for the sake of resource control. It\u0027s intended to force players to more carefully use what they have, planning for each need, rather than simply \u0022hogging\u0022 a certain part to acquire excessive power or whatnot. Contrary to (unfortunately) popular belief, that is NOT the purpose of KSP. If you thought the game would be like that by the time it was finished, you were always in for a rude shock then. It\u0027s meant to be a major challenge, with almost as much of the headaches and triumphs of running a real space program. Fractal wants to make it more interesting and more challenging. So it\u0027s just a fact you\u0027ll have to accept.\u003C/p\u003E\u003Cp\u003EAnd no, a warp drive should not be powered by solar panels, unless it\u0027s a large array of very special panels designed for maximum efficiency, clear of planetary zones. Much like the solar collectors from the Battletech universe. That might not be such a bad idea then.\u003C/p\u003E\u003Cp\u003EThis has been a pretty good conversation. Now we can sit back and see what happens.\u003C/p\u003E\n"},{"CreatedByName":"Chase","CreatedById":69765,"CreatedDateTime":"2013-10-17T02:55:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EThe numbers are fine for the most part, although they should be adjusted to make things more difficult. It\u0027s been clearly demonstrated how easily abused the warp drive can be. Fortunately that should soon cease to be an issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFortunatelt the drive here is fairly balanced, a few tweaks to keep it from being used for excessively short hops might be in order.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EThere are two types of \u0022electrical power\u0022 for the sake of resource control. It\u0027s intended to force players to more carefully use what they have, planning for each need, rather than simply \u0022hogging\u0022 a certain part to acquire excessive power or whatnot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EContrary to (unfortunately) popular belief, that is NOT the purpose of KSP. If you thought the game would be like that by the time it was finished, you were always in for a rude shock then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat isn\u0027t the purpose, to be simple? I didn\u0027t say the game was suppose to be simple, I just see no reason to further complicate the game with \u0027yet another resource\u0027 that does pretty much the same thing as something we already have, and no need to get rude.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EIt\u0027s meant to be a major challenge, with almost as much of the headaches and triumphs of running a real space program. Fractal wants to make it more interesting and more challenging. So it\u0027s just a fact you\u0027ll have to accept.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the game is suppose to be challenging, and it is. What it isn\u0027t suppose to be is a boring grind. So it\u0027s just a fact you\u0027ll have to accept. (This phrase is rather hostile for me, but I hope you realize it yourself and decide to say things in a nicer way from now on.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EAnd no, a warp drive should not be powered by solar panels, unless it\u0027s a large array of very special panels designed for maximum efficiency, clear of planetary zones. Much like the solar collectors from the Battletech universe. That might not be such a bad idea then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course it would be a large array, that is, if you want to get anywhere in any useful period of time. But there is no reason you can\u0027t just charge it up for a year before use and then fire away.\u003C/p\u003E\n"}]}