{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":44,"Articles":[{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2013-10-04T02:33:48Z","Content":"\n\u003Cp\u003EYeah, I reckon when wasteheat is accumulated to a bad level efficiency of your parts should decrease dramatically - to the point where they simply don\u0027t function at all. Then maybe, for the hell of it, once it gets REALLY extreme, just have everything explode.\u003C/p\u003E\u003Cp\u003EI do believe though that you should add a configurable option somewhere to just flat-out disable this game feature. I fear it would turn into something such as the life-support system mods that are already around. It becomes more of a chore than an actual gameplay enhancer (more of an annoyance than a challenge).\u003C/p\u003E\n"},{"CreatedByName":"Mzxs","CreatedById":52969,"CreatedDateTime":"2013-10-04T02:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theSpeare\u0022 data-cite=\u0022theSpeare\u0022\u003E\u003Cdiv\u003EYeah, I reckon when wasteheat is accumulated to a bad level efficiency of your parts should decrease dramatically - to the point where they simply don\u0027t function at all. Then maybe, for the hell of it, once it gets REALLY extreme, just have everything explode.\u003Cp\u003EI do believe though that you should add a configurable option somewhere to just flat-out disable this game feature. I fear it would turn into something such as the life-support system mods that are already around. It becomes more of a chore than an actual gameplay enhancer (more of an annoyance than a challenge).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei like your idea it was what i was thinking\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2013-10-04T02:57:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EVersion 0.6 Released\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! I\u0027ve got it fired up. Glaring problem I see with my current setup is that my ships don\u0027t have radiators...Time to send a radiator module to dock with \u0027em!\u003C/p\u003E\u003Cp\u003EOn the note of docking with far-flung ships: I had a Fusion-powered ship effectively get trapped around Moho after warping there due to the Deuterium - which is consumed at a fixed rate regardless of throttle settings but come with one-fifth the Lithium - being nearly empty in the engine. So, I config-edited the Rockomax-16 tank to hold a bunch of each, put it in a docking tug, and sent it out. I ran into a weird issue where my unmanned fusion ship cooked everyone in the manned-and-nearly-derelict fusion ship, despite my radiation safety settings being on, but this was before the update. Having updated, I killed relative velocity 2.1km out and sent the tug out on its own to dock up.\u003C/p\u003E\u003Cp\u003EUnfortunately, Deuterium and Lithium, despite having flowMode = ALL_VESSEL, had transfer = NONE in their resource definition. Why is this? I can see why you don\u0027t want it for UF-6 and DUF-6, namely because pulling fissile material out of an active reactor is a Bad Idea, but if \u003Cem\u003Eantimatter\u003C/em\u003E, which is notoriously disagreeable to handle, can be pumped around like no one\u0027s business than some heavy water and a few slivers of metal being a problem confuses me.\u003C/p\u003E\u003Cp\u003EAnother thing I noticed: The Fusion engine used to be possible to use continuously with an upgraded 3.5m nuclear reactor. Currently, it\u0027s the only thing drawing megajoules on my ship, which features an upgraded 3.5m reactor and generator, and an upgraded 2.5m reactor with two generators. The warp drive isn\u0027t charging, the ExoticMatter flow is disabled entirely, and I\u0027ve no science components on the vessel (the A.I. core isn\u0027t upgraded yet). It\u0027s draining at a rate of about 7166.66...MJ/min, which is enough for six minutes of burning. Granted, it recharges in about twenty-five seconds, but where\u0027d that capability go? The 3.5m has the coretemp of 27000K, an- Ah. It\u0027s active, but only to 60% for some reason. One moment...\u003C/p\u003E\u003Cp\u003EAh. My 3.5m reactor was only at 60% power, and the 2.5m was at 30%. I disabled my other reactor\u0027s UF6 and DUF6 flows and shut down the other generators, but that caused my primary reactor to drop to 33.57% (and accordingly losing more MJ/min). I hastily re-enabled everything, but my reactor\u0027s still only at 60%. Could it be because of an unusual UF6/DUF6 balance? This was the aforementioned refueling vessel; I changed the Resources.cfg to allow me to move the various things around. I also have maximum Thermal Power and maximum Waste Heat. I put a screenshot \u003Ca href=\u0022http://i.imgur.com/ACAuzoV.png\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E; I\u0027d put it inline, but I\u0027d break tables. This was originally a 6.2-ish km/s burn, but I had to reset the node a few times.\u003C/p\u003E\u003Cp\u003EPlease note, I\u0027m enjoying the crap out of this mod so far, even though I (rightly) consider my nuclear-engine accomplishments to be a different game than my chemical- and quasi-chemical engine rockets. Thank you for putting in the time to make something like this and deal with annoying fans like me pestering and nagging you about a little detail that can literally be changed in five seconds in Notepad. Big thanks to Zzz, too; these are some gorgeous models! Having only dabbled very briefly in Blender, I\u0027m only the slightest bit familiar with how much work has to go into these, so thank you for doing so.\u003C/p\u003E\u003Cp\u003EVVVVV: You...you could\u0027ve done that SO much faster if you went into a higher orbit...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T04:47:07Z\u0022 title=\u002210/04/2013 04:47  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Hremsfeld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T04:45:43Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022https://scontent-b-ord.xx.fbcdn.net/hphotos-prn1/994624_10151911864353656_1021169387_n.jpg\u0022 alt=\u0022994624_10151911864353656_1021169387_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a Year\u002B of manufacturing Antimatter, My first trip to Moho is in order after a short refueling trip.\u003C/p\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2013-10-04T04:47:19Z","Content":"\n\u003Cp\u003ESo, been working on my first FTL Craft, Introducing the Warp 1 Test Craft!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img546/6376/u1z8.jpg\u0022 alt=\u0022u1z8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMade it to Eve and back, no landing or anything fancy but made it back to kerbin with a fair amount of reserve DV. Unupgraded parts, made it off kerbin on it\u0027s own. Antimatter supplied by the KERN Supercollider(Not really, used FuelBalancer to fill the tanks). Flies pretty good to, if a little wobbly at times!!\u003C/p\u003E\u003Cp\u003EOnly problem I\u0027ve had with waste heat was that even 4 of the HUGE radiators fail to cool off if I leave the 3.75M reactor running, Though not sure if the 4 tiny 0.66M(?) nuke reactors would offset the large panels cooling abilities. The Warp 1 has completed it\u0027s job, now to rescue the brave FTL Crew: Jeb, Bill, \u0026amp; Bob!!!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T04:54:18Z\u0022 title=\u002210/04/2013 04:54  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Railgunner2160\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T04:51:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Railgunner2160\u0022 data-cite=\u0022Railgunner2160\u0022\u003E\u003Cdiv\u003ESo, been working on my first FTL Craft, Introducing the Warp 1 Test Craft!!\u003Cp\u003EMade it to Eve and back, no landing or anything fancy but made it back to kerbin with a fair amount of reserve DV. Unupgraded parts, made it off kerbin on it\u0027s own. Antimatter supplied by the KERN Supercollider(Not really, used FuelBalancer to fill the tanks). Flies pretty good to, if a little wobbly at times!!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou Faired better than me... I blew up a docking port accelerating too fast... Whoops. Time to limit Mechjeb.\u003C/p\u003E\u003Cp\u003ESo, you should totally make docking ports that can stand Thermal Rocket Acceleration :3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T04:55:15Z\u0022 title=\u002210/04/2013 04:55  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Ashtoruin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2013-10-04T04:55:24Z","Content":"\n\u003Cp\u003ETry 50ms, worked great on my launch....\u003C/p\u003E\u003Cp\u003EAlso in case of emergency it uses SDHI\u0027s docking port \u0026amp; Parachute combo part in case of failed launches, ofcourse I\u0027ve never actually tested it, I also failed to incorporate a decoupler for pod... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T05:02:20Z\u0022 title=\u002210/04/2013 05:02  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Railgunner2160\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T05:01:24Z","Content":"\n\u003Cp\u003EHave it at 40, the second Mechjeb said Accelerate, I had two Halves of a Rocket.\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T05:12:59Z","Content":"\n\u003Cp\u003EActually it seems to be that my Thermal Rockets are cutting out due to a Lack of Thermal Power after about 10 seconds of being on even though I have full Thermal Power... The Only Engine that didn\u0027t shut down is the one that is empty and charging...\u003C/p\u003E\u003Cp\u003EEdit, Yeah So I have 6 1.25m Electric Generators with 1.25m Antimatter Reactors below that with 1.25m Thermal Rockets below that. I have 5/6 of the Reactors saying Full Thermal Power (the one that isnt full being the one attached to the working engine) and the last one charging at about 5 Thermal Power per second, All 6 Generators are inactive, and every Antimatter engine says its running at 0% even though Im generating Thermal Power.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T05:22:22Z\u0022 title=\u002210/04/2013 05:22  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Ashtoruin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-10-04T09:56:59Z","Content":"\n\u003Cp\u003EIts a bug, if you cycle the propellent type they should come to life. I was doing that last night with the jet engines.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T11:40:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EDo you have any of the other fuels (Argon, Xenon) available? If you don\u0027t have any, it will just swap you straight back to LiquidFuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAha, makes sense. I was pad testing several engines to gather some data on thrust and ISP. (I know you have a chart up but I like to verify and record my own findings from practical tests)\u003C/p\u003E\u003Cp\u003ETurns out I had included a monopropellant tank rather than an argon tank. Whoops.\u003C/p\u003E\u003Cp\u003EBy the way, any thoughts on my suggestions earlier? In particular the ISRU scanner would be very useful so we could send probes to other worlds to scan for usable resources.\u003C/p\u003E\u003Cp\u003EI\u0027m also running into a strange issue where rockets will sometimes get to ~10k then explode with a message that \u0027such and such part collided with obj_base\u0027. I don\u0027t know that this is related to your mod, but figured I would mention it. Any thoughts?\u003C/p\u003E\u003Cp\u003EI don\u0027t see any part called obj_base, so I\u0027m kind of stumped on this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T11:55:41Z\u0022 title=\u002210/04/2013 11:55  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by forsaken1111\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-04T11:46:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashtoruin\u0022 data-cite=\u0022Ashtoruin\u0022\u003E\u003Cdiv\u003EActually it seems to be that my Thermal Rockets are cutting out due to a Lack of Thermal Power after about 10 seconds of being on even though I have full Thermal Power... The Only Engine that didn\u0027t shut down is the one that is empty and charging...\u003Cp\u003EEdit, Yeah So I have 6 1.25m Electric Generators with 1.25m Antimatter Reactors below that with 1.25m Thermal Rockets below that. I have 5/6 of the Reactors saying Full Thermal Power (the one that isnt full being the one attached to the working engine) and the last one charging at about 5 Thermal Power per second, All 6 Generators are inactive, and every Antimatter engine says its running at 0% even though Im generating Thermal Power.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe antimatter reactors reading 0% isn\u0027t something to worry about it in itself, they match their supply against demand, so if your ship isn\u0027t doing anything to use up power, they won\u0027t produce anyway.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure why the engine wouldn\u0027t be working though, can you post a screenshot or more details of the design of craft that is causing this?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EUnfortunately, Deuterium and Lithium, despite having flowMode = ALL_VESSEL, had transfer = NONE in their resource definition. Why is this? I can see why you don\u0027t want it for UF-6 and DUF-6, namely because pulling fissile material out of an active reactor is a Bad Idea, but if \u003Cem\u003Eantimatter\u003C/em\u003E, which is notoriously disagreeable to handle, can be pumped around like no one\u0027s business than some heavy water and a few slivers of metal being a problem confuses me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst of all, thanks for the big feedback post.\u003C/p\u003E\u003Cp\u003EI have no idea why they both have ended up with transfer = NONE in the resource file. Could be a copy/paste mistake or something, I\u0027ll fix that for the next version.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EAnother thing I noticed: The Fusion engine used to be possible to use continuously with an upgraded 3.5m nuclear reactor. Currently, it\u0027s the only thing drawing megajoules on my ship, which features an upgraded 3.5m reactor and generator, and an upgraded 2.5m reactor with two generators.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EI ran into a weird issue where my unmanned fusion ship cooked everyone in the manned-and-nearly-derelict fusion ship, despite my radiation safety settings being on, but this was before the update. Having updated, I killed relative velocity 2.1km out and sent the tug out on its own to dock up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll look into these issues and get back to you. I haven\u0027t changed anything with the DT Vista engine in this update but sometimes, changing other things that those things rely upon in subtle ways can produce weird effects. I definitely don\u0027t want fusion engines cooking people without warning.\u003C/p\u003E\u003Cp\u003EIt should be possible to run the engine constantly with upgraded 3.75m reactors and generators though, that was the idea.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-04T12:07:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EBy the way, any thoughts on my suggestions earlier? In particular the ISRU scanner would be very useful so we could send probes to other worlds to scan for usable resources.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomething like an ISRU scanner is definitely on the agenda for when I go over the resource system again. I\u0027m afraid I haven\u0027t had much chance to look over anything relating to further development yet, so I\u0027ll probably come back to this in a few days.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EI\u0027m also running into a strange issue where rockets will sometimes get to ~10k then explode with a message that \u0027such and such part collided with obj_base\u0027. I don\u0027t know that this is related to your mod, but figured I would mention it. Any thoughts?\u003Cp\u003EI don\u0027t see any part called obj_base, so I\u0027m kind of stumped on this.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have any other mods running? It\u0027s definitely not anything to do with this, I don\u0027t have any obj_base or add any scenery or anything like that. It could be another mod or it could a rare bug with the stock game - I\u0027ve heard of examples of people having weird collisions with planes around the KSC runway, never heard any instances during rocket launches though.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T12:09:04Z","Content":"\n\u003Cp\u003EI do have a few other mods running but nothing that adds scenery or anything like that. I\u0027ll try it again tonight, didn\u0027t have a lot of time to test it out yesterday.\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T12:26:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashtoruin\u0022 data-cite=\u0022Ashtoruin\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022https://scontent-b-ord.xx.fbcdn.net/hphotos-prn1/994624_10151911864353656_1021169387_n.jpg\u0022 alt=\u0022994624_10151911864353656_1021169387_n.jpg\u0022\u003E\u003Cp\u003EAfter a Year\u002B of manufacturing Antimatter, My first trip to Moho is in order after a short refueling trip.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the ship in question.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-b-ord.xx.fbcdn.net/hphotos-ash3/1379916_10151912398528656_2011576484_n.jpg\u0022 alt=\u00221379916_10151912398528656_2011576484_n.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T12:31:28Z\u0022 title=\u002210/04/2013 12:31  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Ashtoruin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T13:22:24Z","Content":"\n\u003Cp\u003EAshtoruin, What mod is that big toroid from?\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T13:33:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EAshtoruin, What mod is that big toroid from?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust Google spherical tanks ksp, it should be the first thing, I\u0027ll post a link after my physics class when I\u0027m not on my phone\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-04T13:35:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashtoruin\u0022 data-cite=\u0022Ashtoruin\u0022\u003E\u003Cdiv\u003EJust Google spherical tanks ksp, it should be the first thing, I\u0027ll post a link after my physics class when I\u0027m not on my phone\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, didn\u0027t realize the toroid was included in the spherical tanks mod. i recognized the big tank but not the toroid. I\u0027m familiar with the mod so no need to trouble yourself to link, just didn\u0027t realize new parts had been added. Will check it out, thanks!\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T13:40:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EAh, didn\u0027t realize the toroid was included in the spherical tanks mod. i recognized the big tank but not the toroid. I\u0027m familiar with the mod so no need to trouble yourself to link, just didn\u0027t realize new parts had been added. Will check it out, thanks!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I saw the toroidal tanks and immediately had to get it... And they\u0027re perfect for stabilizing collectors as you can see :3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T13:45:38Z\u0022 title=\u002210/04/2013 01:45  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Ashtoruin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-10-04T14:41:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Railgunner2160\u0022 data-cite=\u0022Railgunner2160\u0022\u003E\u003Cdiv\u003EKERN Supercollider\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, but I have to correct you here. CERN is a scince institute, not a supercollider. The LHC (Large Hadron Collider) is a supercollider that is located at CERN.\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T14:49:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasmic\u0022 data-cite=\u0022wasmic\u0022\u003E\u003Cdiv\u003ESorry, but I have to correct you here. CERN is a scince institute, not a supercollider. The LHC (Large Hadron Collider) is a supercollider that is located at CERN.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr maybe he was making a Kerbin/Kerbal joke?\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-10-04T15:13:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashtoruin\u0022 data-cite=\u0022Ashtoruin\u0022\u003E\u003Cdiv\u003EOr maybe he was making a Kerbin/Kerbal joke?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course he was, but I... well, when I see something like that, I just have to correct it. How about LHK? Nah, that sounds like a russin spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-04T16:05:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashtoruin\u0022 data-cite=\u0022Ashtoruin\u0022\u003E\u003Cdiv\u003EActually it seems to be that my Thermal Rockets are cutting out due to a Lack of Thermal Power after about 10 seconds of being on even though I have full Thermal Power... The Only Engine that didn\u0027t shut down is the one that is empty and charging...\u003Cp\u003EEdit, Yeah So I have 6 1.25m Electric Generators with 1.25m Antimatter Reactors below that with 1.25m Thermal Rockets below that. I have 5/6 of the Reactors saying Full Thermal Power (the one that isnt full being the one attached to the working engine) and the last one charging at about 5 Thermal Power per second, All 6 Generators are inactive, and every Antimatter engine says its running at 0% even though Im generating Thermal Power.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat propellant are you using with the engines? I\u0027m having some problems making this happen myself. I\u0027ve just been experimenting with a cluster of 8 1.25m antimatter reactors \u002B generators \u002B thermal rockets to see if it was related to using large numbers of rockets. Everything is working perfectly for me.\u003C/p\u003E\n"},{"CreatedByName":"Ashtoruin","CreatedById":83692,"CreatedDateTime":"2013-10-04T16:27:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EWhat propellant are you using with the engines? I\u0027m having some problems making this happen myself. I\u0027ve just been experimenting with a cluster of 8 1.25m antimatter reactors \u002B generators \u002B thermal rockets to see if it was related to using large numbers of rockets. Everything is working perfectly for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELiquid fuel, maybe try with 6 rockets, also it only started after I docked it to the other half the ship, donziboy said to try cycling the fuel type which I\u0027m going to try when I get out of classes, along with a few other things... also I can send you a copy of my save and mods used if it will help.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-10-04T16:32:15Z","Content":"\n\u003Cp\u003EWonder if it is similiar to the bug i am getting? I made new ship today, with 4 stacks of 1.25 reactors and thermal nozzles connected with fuel lines to AM tank. And again only one reactor produced thermal power. I used TAC fuel balancer to distribute TP evenly, but now i can\u0027t pump it around manually using Alt\u002Bright click. Ship uses liquid fuel only, so i can\u0027t switch the propellant. I\u0027m going to dock it to another ship and try again.\u003C/p\u003E\n"}]}