{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":380,"Articles":[{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-20T19:19:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003EI believe they are pretty useful for low-tech interplanetary tugs due to their (optionally) high core temperatures.\u003Cp\u003EBtw, i have a little problem with the gravity lensing mission, in that i\u0027m not sure what place it has in the mod. I just launched my telescope to the 7500 Gm Apoapsis, only to find that it would take 270 years to arrive. by this time i would have already filled my tech tree, leaving the telescope useless. \u003C/p\u003E\u003Cp\u003Eperhaps this is just me and my unwillingness to let my space program do nothing for a few centuries, idk.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s definitely weird. Kinda like...you need warp drive, to do the mission, but doing the mission has no point if you\u0027ve already got the warp drive (highest tech level).\u003C/p\u003E\n"},{"CreatedByName":"Threadsinger","CreatedById":100886,"CreatedDateTime":"2014-05-20T19:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EIt\u0027s definitely weird. Kinda like...you need warp drive, to do the mission, but doing the mission has no point if you\u0027ve already got the warp drive (highest tech level).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, I thought about that too. I think I launched one in my last save, only to discover that I\u0027d not profit from it from a science POV (although from a game point of view, still pretty cool). \u003C/p\u003E\u003Cp\u003EI still like the idea, but I don\u0027t know how to balance it to make it worth it for science purposes. Unless you make Warp Drive 100,000 science, and make the gravity experiment give some equally ridiculous amount of science?\u003C/p\u003E\u003Cp\u003EAs an aside, one of the ideas I was hoping they\u0027d implement (but never will) would be a NewGame\u002B mode, where you accomplish some difficult objective (land and return a manned mission from all feasible planets, setup a gravity lens experiment or supercollider at the edge of the solar system, etc.), which enables KSPI-type hardware on the second playthrough. That way purists who want to play with real-world hardware and challenges can do so, while anyone else with an eye for the possible (if not practical) could play the enhanced version. Would also give real value to solving really hard logistical problems (such as setting up a gravity lens experiment) using conventional hardware.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-20T20:04:27Z","Content":"\n\u003Cp\u003EThe obvious choice would be to reduce the distance from the Sun required. The real-life mission the idea is based on (the Spitzer Telescope) is in an orbit just trailing behind the Earth. What I would suggest from a gameplay perspective is to scale science rate with altitude from the sun; the farther out you get, the more science per day. That way we\u0027d have a much more interesting and meaningful choice in where we put the telescopes. Put them super-high (like near Jool) and they\u0027ll pump-out science, but resupply would be much more difficult. Put them closer to Kerbin and supply would be easier but science output much lower.\u003C/p\u003E\u003Cp\u003EAs it is it\u0027s just extraneous code that has no practical purpose in-game.\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2014-05-20T20:18:25Z","Content":"\n\u003Cp\u003EIf there was another tech after warp-drive i suppose that would justify the mission as well, of course it\u0027s hard to think of anything more advanced than FTL...\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-05-20T20:37:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EThe obvious choice would be to reduce the distance from the Sun required. The real-life mission the idea is based on (the Spitzer Telescope) is in an orbit just trailing behind the Earth. What I would suggest from a gameplay perspective is to scale science rate with altitude from the sun; the farther out you get, the more science per day. That way we\u0027d have a much more interesting and meaningful choice in where we put the telescopes. Put them super-high (like near Jool) and they\u0027ll pump-out science, but resupply would be much more difficult. Put them closer to Kerbin and supply would be easier but science output much lower.\u003Cp\u003EAs it is it\u0027s just extraneous code that has no practical purpose in-game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0022direct planet observation\u0022 mission is based on the theoretical possibility of using the Sun as a gravity lens if we could get a telescope out to 550 AU or more. If we could reach 550 AU in the real world, the results would be orders of magnitude beyond anything that Spitzer could produce.\u003C/p\u003E\u003Cp\u003EThe in-game distance requirement of 550 times Kerbin\u0027s semimajor axis is already scaled down from what you would calculate based on the mass of Kerbol.\u003C/p\u003E\u003Cp\u003EGetting out to 550 AU within the life span of a helium cryostat without using warp drive isn\u0027t impossible, but it\u0027s one of those \u0022final boss\u0022-type missions. I ran some back-of-the-envelope numbers for a 400-day, 7500-GM brachistochrone (burn prograde for the first half and retrograde for the second half). The required acceleration would be between 2 and 3 cm/s^2, with delta-v of about 900 km/s.\u003C/p\u003E\u003Cp\u003EWith enough acceleration and a coast phase in the middle of the trip, you could probably get that down to about 500 km/s.\u003C/p\u003E\u003Cp\u003ESince you don\u0027t get quantum vacuum plasma thrusters until you get warp drive, the best way to get that kind of delta-v pre-warp drive seems to be a DT Vista.\u003C/p\u003E\n"},{"CreatedByName":"Threadsinger","CreatedById":100886,"CreatedDateTime":"2014-05-20T20:39:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003EIf there was another tech after warp-drive i suppose that would justify the mission as well, of course it\u0027s hard to think of anything more advanced than FTL...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWormholes? Point-to-point jumps? Would that fit into the spirit of the real-world derived technologies and concepts that is KSPI?\u003C/p\u003E\u003Cp\u003ECan it even be programmed?\u003C/p\u003E\u003Cp\u003EEdit: Not seriously suggesting that this be added, just thinking of what comes after warp drive \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-20T20:57:08Z\u0022 title=\u002205/20/2014 08:57  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 20, 2014\u003C/time\u003E by Threadsinger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-20T20:42:38Z","Content":"\n\u003Cp\u003ESure, and it\u0027d be great if getting the telescope out that far meant \u0022ZOMG SO MUCH SCIENCE\u0022, but I don\u0027t think that is mutually exclusive with adding a curve so that you can try a Spitzer-type mission with some success.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-05-20T22:37:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003ESure, and it\u0027d be great if getting the telescope out that far meant \u0022ZOMG SO MUCH SCIENCE\u0022, but I don\u0027t think that is mutually exclusive with adding a curve so that you can try a Spitzer-type mission with some success.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0022deep-field survey\u0022 that the telescope can do anywhere in space (once the bugs in the plugin are fixed) seems to correspond to what Hubble was capable of.\u003C/p\u003E\u003Cp\u003EIf I were doing a version, I\u0027d kick the science of the 550AU experiment even higher to reflect the final-boss nature of doing it without warp drive, and add an intermediate experiment that requires you to be \u003Cem\u003Esomewhere\u003C/em\u003E in Sun SoI.\u003C/p\u003E\u003Cp\u003EAs far as scaling the science yield with where you are in the Sun\u0027s SoI, I\u0027m trying to get my head around why one location in the Sun\u0027s SoI would be better than another.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-20T22:46:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022undercoveryankee\u0022 data-cite=\u0022undercoveryankee\u0022\u003E\u003Cdiv\u003EAs far as scaling the science yield with where you are in the Sun\u0027s SoI, I\u0027m trying to get my head around why one location in the Sun\u0027s SoI would be better than another.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause it would work from a design perspective.\u003C/p\u003E\n"},{"CreatedByName":"blitz2190","CreatedById":102654,"CreatedDateTime":"2014-05-20T23:18:08Z","Content":"\n\u003Cp\u003EThere\u0027s already a hyper jump mod that does point to point\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T07:28:34Z","Content":"\n\u003Cp\u003EInspired by Manley\u0027s satellite... How big can a solar satellite be?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i7.minus.com/iZBBo7v3Q4I8B.png\u0022 alt=\u0022iZBBo7v3Q4I8B.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFoldable, of course.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T07:32:30Z\u0022 title=\u002205/21/2014 07:32  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by cy-one\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-05-21T07:42:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EInspired by Manley\u0027s satellite... How big can a solar satellite be?\u003Cp\u003E\u003Ca href=\u0022http://i7.minus.com/iZBBo7v3Q4I8B.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i7.minus.com/iZBBo7v3Q4I8B.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFoldable, of course.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! Yeah Scott Manley gave a good inspiration for such an sattalite, mine is still under construction but it feels a bit like \u0022challenge accepted\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m so obsessed with symmetry I don\u0027t even know that mine will work out.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T07:44:28Z","Content":"\n\u003Cp\u003EI\u0027m used to folding satellites, did a lot when I played with RemoteTech \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But I like his construction, especially the engine-placement. But that in my picture is currently just a dummy with one 1.25m fuselage, probe-core, transceiver and a ****load of solar panels.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-05-21T07:52:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EI\u0027m used to folding satellites, did a lot when I played with RemoteTech \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But I like his construction, especially the engine-placement. But that in my picture is currently just a dummy with one 1.25m fuselage, probe-core, transceiver and a ****load of solar panels.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like you have already a bigger one in Progress? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-05-21T09:25:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EInspired by Manley\u0027s satellite... How big can a solar satellite be?\u003Cp\u003E\u003Ca href=\u0022http://i7.minus.com/iZBBo7v3Q4I8B.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i7.minus.com/iZBBo7v3Q4I8B.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFoldable, of course.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was just thinking about suggesting some kind of contest with this. How much solar power can you get?\u003C/p\u003E\u003Cp\u003EI was messing around and I managed to get a power station with 8 balkas at \u0026lt;200k km. Their power doesn\u0027t seem to be working at the max, but will be fixable whenever the balka\u0027s are patched. It is foldable of as well; the two main arms fold out and the ship just points into the sun. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CDpYfiO.jpg\u0022 alt=\u0022CDpYfiO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hagAfl3.jpg\u0022 alt=\u0022hagAfl3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI wish inline batteries weren\u0027t so springy. I am going to try to double the number of balka\u0027s on the next one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T09:30:37Z\u0022 title=\u002205/21/2014 09:30  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by Atrius129\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Parokki","CreatedById":39644,"CreatedDateTime":"2014-05-21T11:06:05Z","Content":"\n\u003Cp\u003EHey guys, could someone explain antimatter initiated reactors to me? I\u0027ve got a pretty decent grasp of all the new tech so far and have constructed both a fission-powered beamed power relay network and fusion-powred space station for producing antimatter. I figured this new type was basically a lighter fusion reactor that requires some antimatter to function, but the craft that I built (\u003Ca href=\u0022http://i.imgur.com/28Ut0Bc.jpgcraft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/28Ut0Bc.jpgcraft\u003C/a\u003E) to test them out isn\u0027t working. The bit just above the engine is a 1.25m antimatter storage unit with 13 units in it. It keeps complaining about not having enough power to continue the reaction, but shouldn\u0027t it produce way more than enough power to keep itself going after it\u0027s been started up once like other fusion reactors? Here I had just undocked from the antimatter station, but even while docked it refused to go above a couple of kilowatts. \u003C/p\u003E\u003Cp\u003EIs there something big that I\u0027m missing here? Should I have a small fission plant aboard even though they\u0027re not really required with other fusion plants?\u003C/p\u003E\u003Cp\u003EDoes the antimatter need to be directly next to the reactor or something? \u003C/p\u003E\u003Cp\u003EAm I reading things correctly that they produce way more charged particles than thermal power? Finally a use for direct conversion generators?\u003C/p\u003E\n"},{"CreatedByName":"artforz","CreatedById":108793,"CreatedDateTime":"2014-05-21T11:31:18Z","Content":"\n\u003Cp\u003ENeeds Helium-3 to run (note the 0.00/500).\u003C/p\u003E\u003Cp\u003EDid the math a few pages back, they need *very* little antimatter. 0.008 AM is enough to burn through 500 units of D and He3\u003C/p\u003E\n"},{"CreatedByName":"Toggl3","CreatedById":111477,"CreatedDateTime":"2014-05-21T12:56:22Z","Content":"\n\u003Cp\u003EFirst off, let me apologize if this has been answered before, but with 950 pages, and the search function bringing me to about page 600, I don\u0027t have time to read ~350 pages of thread to find the answer.\u003C/p\u003E\u003Cp\u003EIs there any way to make the data gained from an impact collectable? I\u0027ve tried modifying the science.cfg to simply add the \u0022dataIsCollectable = True\u0022 and other lines from other parts, but to no avail. Like a dumbass I didn\u0027t put an antenna on my ship and have 875 science just sitting there...\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-21T13:37:04Z","Content":"\n\u003Cp\u003EYes actually, the antimatter may need to be next to the reactor to work. I haven\u0027t actually played with AIRs, but the antimatter resource flow IIRC isn\u0027t set to ALL_VESSEL. (You could just do an MM config on it and change that.) Edit: Yes, it\u0027s set to STACK_PRIORITY_SEARCH, which is the same used for liquid fuel. So...yes, it would seem it needs to be attached, and more to the point, has to be in the stack. STAGE_PRIORITY_FLOW might make more sense (so it behaves like monopropellant), though ALL_VESSEL would be easiest.\u003C/p\u003E\u003Cp\u003EFusion reactors have a few weird glitches in behaviour that can cause them to shut-down. Someone else might be able to go into more detail (I think WaveFunction and Fractal have a good grasp of what\u0027s going on). If you\u0027re having problems, you can always just ADD MOAR BATTERIES.\u003C/p\u003E\u003Cp\u003EAnd yes. More charged particles, actually useful for direct conversion. Stick another generator on it to suck-up the remaining thermal if you want, but note that that\u0027ll cause a display error and it\u0027ll look like you should be getting twice the amount of power the reactor can provide. It\u0027s not actually providing that much, but it does render the MJ GUI somewhat useless.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T13:43:14Z\u0022 title=\u002205/21/2014 01:43  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarkyJ279","CreatedById":90044,"CreatedDateTime":"2014-05-21T13:46:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Parokki\u0022 data-cite=\u0022Parokki\u0022\u003E\u003Cdiv\u003EHey guys, could someone explain antimatter initiated reactors to me? I\u0027ve got a pretty decent grasp of all the new tech so far and have constructed both a fission-powered beamed power relay network and fusion-powred space station for producing antimatter. I figured this new type was basically a lighter fusion reactor that requires some antimatter to function, but the craft that I built (\u003Ca href=\u0022http://i.imgur.com/28Ut0Bc.jpgcraft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/28Ut0Bc.jpgcraft\u003C/a\u003E) to test them out isn\u0027t working. The bit just above the engine is a 1.25m antimatter storage unit with 13 units in it. It keeps complaining about not having enough power to continue the reaction, but shouldn\u0027t it produce way more than enough power to keep itself going after it\u0027s been started up once like other fusion reactors? Here I had just undocked from the antimatter station, but even while docked it refused to go above a couple of kilowatts. \u003Cp\u003EIs there something big that I\u0027m missing here? Should I have a small fission plant aboard even though they\u0027re not really required with other fusion plants?\u003C/p\u003E\u003Cp\u003EDoes the antimatter need to be directly next to the reactor or something? \u003C/p\u003E\u003Cp\u003EAm I reading things correctly that they produce way more charged particles than thermal power? Finally a use for direct conversion generators?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShort answer; what artforz said.\u003C/p\u003E\u003Cp\u003ELong answer. There\u0027s a bit of debate about the use of that particular reactor going on right now. Mostly centered around the availability of He3 (and it being a pain in the proverbial to extract). Currently the only place to get He3 is from Jools atmosphere but it is difficult and for the ammount of energy expended, usually not worth it. Pheonix_ca posted a MM config file on page 937 which adds He3 to the Mun and Tristavius described a Jool He3 mining operation on page 925 so if you want to extract He3 I\u0027d try one of those. \u003C/p\u003E\u003Cp\u003EIf you\u0027re already extracting He3 then if I remember correctly the reactor pulls antimatter from anywhere stack mounted and He3 from everywhere on the ship so you don\u0027t need to connect either of them directly to the reactor, although you should make sure you antimatter is in the same stack as the reactor at least. A small fission plant is still useful to power the antimatter storage units however and its an alternative to solar panels for power if you don\u0027t wan\u0027t the AIR to run constantly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T13:49:51Z\u0022 title=\u002205/21/2014 01:49  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by MarkyJ279\u003C/strong\u003E\n\u003Cbr\u003ENinja\u0026#039;d by Pheonix :)\n\u003C/span\u003E\n"},{"CreatedByName":"Darkeners","CreatedById":111508,"CreatedDateTime":"2014-05-21T13:48:43Z","Content":"\n\u003Cp\u003EHi, my first post here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI try google ansfer, but I can\u0027t find anything. \u003C/p\u003E\u003Cp\u003EI play KSP whitout any mods, I have unlocked almost all basic KSP technologies (only 3x technologies for 550 are not unlocked, and that one for Asteroid grabing.) \u003C/p\u003E\u003Cp\u003EI instal KSP interstellar mod, I activated, restarted, I even bought technology Experimental Electric for 1000 TP, but right now I cant use most of my regular items, or new ones. \u003C/p\u003E\u003Cp\u003EThey are on list, but they are like pernamently clicked, grey. I can build Rocomax Tanks, but I can\u0027t use any engines, even those basic engines. I can use only ultra large engine from NASA pack, those which cant be used whit decuplers.\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-21T14:34:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atrius129\u0022 data-cite=\u0022Atrius129\u0022\u003E\u003Cdiv\u003EI was just thinking about suggesting some kind of contest with this. How much solar power can you get?\u003Cp\u003EI was messing around and I managed to get a power station with 8 balkas at \u0026lt;200k km. Their power doesn\u0027t seem to be working at the max, but will be fixable whenever the balka\u0027s are patched. It is foldable of as well; the two main arms fold out and the ship just points into the sun. \u003C/p\u003E\u003Cp\u003E~snip~\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just did almost the same thing, but not quite as large. I have a 6 Balka solar panel equipped microwave relay that in very low Kerbol Orbit. I didn\u0027t know about the bug with the double balka panels. They are not generating waste heat, and my transitter is only putting out like 20 some MW of power.\u003C/p\u003E\u003Cp\u003EIs there any quick fix I can do to get the double Balka panels to work like they should? If not I think I\u0027m gonna just cheat a new sat into the same orbit as my balka sat.\u003C/p\u003E\u003Cp\u003EEDIT: I Figured out a work-around to get the double Balka panels to work!!! The double Balka panels have 2 modules to deploy the panels. What I think is happening (and I could very easily be wrong) is that the first module has this line\u0022 chargeRate = 0 \u0022 that makes the interstellar plugin think that the Balka doesn\u0027t produce any power. I changed the charge rate in the first module to 400 and set the charge rate in the second module to 0. I don\u0027t know why it worked, but it did. Here\u0027s the code for the 2 modules.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleDeployableSolarPanel\u003Cbr\u003E\u003Cbr\u003E\tanimationName = rotary\u003Cbr\u003E\traycastTransformName = sunCatcherRight\u003Cbr\u003E\tpivotName = Main_Rotary_Pivot\u003Cbr\u003E\tresourceName = ElectricCharge\u003Cbr\u003E\u003Cbr\u003E\tchargeRate = 400\u003Cbr\u003E\u003Cbr\u003EtrackingSpeed = 0.1\u003Cbr\u003E\u003Cbr\u003E\tpowerCurve\u003Cbr\u003E \t{\u003Cbr\u003E\t\tkey = 206000000000 0 0 0\u003Cbr\u003E\t\tkey = 13599840256 1 0 0\u003Cbr\u003E\t\tkey = 68773560320 0.5 0 0\u003Cbr\u003E\t\tkey = 0 10 0 0\u003Cbr\u003E \t}\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleDeployableSolarPanel\u003Cbr\u003E\u003Cbr\u003E\tanimationName = open_panel\u003Cbr\u003E\traycastTransformName = sunCatcherLeft\u003Cbr\u003E\tpivotName = ArmLeft01_main\u003Cbr\u003E\tresourceName = ElectricCharge\u003Cbr\u003E\u003Cbr\u003E\tchargeRate = 0\u003Cbr\u003E\ttrackingSpeed = 0.1\u003Cbr\u003E\u003Cbr\u003E\tpowerCurve\u003Cbr\u003E \t{\u003Cbr\u003E\t\tkey = 206000000000 0 0 0\u003Cbr\u003E\t\tkey = 13599840256 1 0 0\u003Cbr\u003E\t\tkey = 68773560320 0.5 0 0\u003Cbr\u003E\t\tkey = 0 10 0 0\u003Cbr\u003E \t}\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T15:10:09Z\u0022 title=\u002205/21/2014 03:10  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by Rabada\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-21T14:56:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkeners\u0022 data-cite=\u0022Darkeners\u0022\u003E\u003Cdiv\u003EHi, my first post here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EI try google ansfer, but I can\u0027t find anything. \u003C/p\u003E\u003Cp\u003EI play KSP whitout any mods, I have unlocked almost all basic KSP technologies (only 3x technologies for 550 are not unlocked, and that one for Asteroid grabing.) \u003C/p\u003E\u003Cp\u003EI instal KSP interstellar mod, I activated, restarted, I even bought technology Experimental Electric for 1000 TP, but right now I cant use most of my regular items, or new ones. \u003C/p\u003E\u003Cp\u003EThey are on list, but they are like pernamently clicked, grey. I can build Rocomax Tanks, but I can\u0027t use any engines, even those basic engines. I can use only ultra large engine from NASA pack, those which cant be used whit decuplers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to \u0022buy\u0022 those items from the science centre again. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78067-0-23-5-Research-Them-All-1-0-%28April-27%29\u0022 rel=\u0022external nofollow\u0022\u003EDownload this\u003C/a\u003E and then it should only be a one-click solution.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-05-21T15:02:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EI just did almost the same thing, but not quite as large. I have a 6 Balka solar panel equipped microwave relay that in very low Kerbol Orbit. I didn\u0027t know about the bug with the double balka panels. They are not generating waste heat, and my transitter is only putting out like 20 some MW of power.\u003Cp\u003EIs there any quick fix I can do to get the double Balka panels to work like they should? If not I think I\u0027m gonna just cheat a new sat into the same orbit as my balka sat.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes there is a way and it\u0027s in the forum. Short answer: open the cfg and swap the two modules that track the sun. It probably won\u0027t fix your existing satellites.\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-21T15:12:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EYes there is a way and it\u0027s in the forum. Short answer: open the cfg and swap the two modules that track the sun. It probably won\u0027t fix your existing satellites.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI edited my origional post with a work-around that I figured out. It was able to fix my sat!\u003C/p\u003E\n"}]}