{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":78,"Articles":[{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-16T15:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Banpower1\u0022 data-cite=\u0022Banpower1\u0022\u003E\u003Cdiv\u003EUhm, this mod is not as \u0022not OP\u0022 as Scott Manley said, i can launch a space station only containing a command pod, solarpanels, SAS modules and parts from this mod (focused on making it warp drive capable) and i can zoom across the solar system and land orbits around any planet, the \u0022aiming straight at planet\u0022 tactic is just not doing it correct. I would love to go over how to correct that with you, Fractal_UK, if you would like.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe warp drive effectively gives you a second transfer window (when target and origin are at their minimum distance) that takes much less time, but more dV due to the braking burn. Often you\u0027ll find that in order to meet the dV requirements of your braking burn you\u0027ll actually need to set up some infrastructure first, like antimatter farms and research facilities. Because of this you need to put a lot of work in to be able to warp to, say, eeloo, where the dV for the braking burn is all kinds of huge. The \u0022aiming straight at planet\u0022 technique is doing it correct if you\u0027re using a mode of transport that teleports you without affecting your momentum, any other method is silly (aside from the little variations that increase efficiency).\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T15:08:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveStrider\u0022 data-cite=\u0022DaveStrider\u0022\u003E\u003Cdiv\u003EThe warp drive effectively gives you a second transfer window (when target and origin are at their minimum distance) that takes much less time, but more dV due to the braking burn. Often you\u0027ll find that in order to meet the dV requirements of your braking burn you\u0027ll actually need to set up some infrastructure first, like antimatter farms and research facilities. Because of this you need to put a lot of work in to be able to warp to, say, eeloo, where the dV for the braking burn is all kinds of huge. The \u0022aiming straight at planet\u0022 technique is doing it correct if you\u0027re using a mode of transport that teleports you without affecting your momentum, any other method is silly (aside from the little variations that increase efficiency).\u003C/div\u003E\u003C/blockquote\u003EI think he may have been referring to setting up some kind of aerocapture maneuver (which is very hard to do) or using the warp drive to do multiple small jumps to alter your velocity until you are captured (also very hard to time well).\n"},{"CreatedByName":"Banpower1","CreatedById":88017,"CreatedDateTime":"2013-10-16T15:32:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EWhat exactly are you using to launch this into orbit? Not many of the engines in this game are launch capable without antimatter. I suppose if you are sitting around at 100,000x timewarp while a science lab generates antimatter for your first launch that is viable but its a really efficient and somewhat silly way to do it later on since all of your nuclear generators in other craft will be running down while you waste that time.\u003Cp\u003EYou can save some DV with creative use of the warp drive, true, though the power costs are pretty high.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m only using this: RTG(stock) (x3), Gigantor XL Solar Array(Stock) (x4) (never unfolded), PPD-12 Cupola Module(stock), Science Laboratory (Idle all the time), 3.75m \u0022Aegletes 2\u0022 Nuclear Reactor, 3.75m Electric Generator, 3.75m Antimatter Reactor, Advanced S.A.S. Module, Large (Stock) (x3), 3.75m Alcubierre Drive, Huge Heat Radiator (x4).\u003C/p\u003E\u003Cp\u003Etotal weight is around 133t which can be lifted in a single rocket, if you know how to design big lifters, another option could be using docking ports and assembly in orbit.\u003C/p\u003E\u003Cp\u003EGive me 2 minutes and I\u0027ll link a video showing how i transfered from LKO to Laythe(Jool)\u003C/p\u003E\u003Cp\u003EEDIT: no i did not use any advanced aero breaking techniques or any other magic, simple use of how orbiting works.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T15:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Banpower1\u0022 data-cite=\u0022Banpower1\u0022\u003E\u003Cdiv\u003EI\u0027m only using this: RTG(stock) (x3), Gigantor XL Solar Array(Stock) (x4) (never unfolded), PPD-12 Cupola Module(stock), Science Laboratory (Idle all the time), 3.75m \u0022Aegletes 2\u0022 Nuclear Reactor, 3.75m Electric Generator, 3.75m Antimatter Reactor, Advanced S.A.S. Module, Large (Stock) (x3), 3.75m Alcubierre Drive, Huge Heat Radiator (x4).\u003Cp\u003Etotal weight is around 133t which can be lifted in a single rocket, if you know how to design big lifters, another option could be using docking ports and assembly in orbit.\u003C/p\u003E\u003Cp\u003EGive me 2 minutes and I\u0027ll link a video showing how i transfered from LKO to Laythe(Jool)\u003C/p\u003E\u003Cp\u003EEDIT: no i did not use any advanced aero breaking techniques or any other magic, simple use of how orbiting works.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was more or less asking where you got the antimatter. With antimatter-fed engines you can zoom all over the place but actually getting the antimatter to fuel them is time intensive and requires some setup, which is the trade-off for having amazing power generation and thrust.\u003C/p\u003E\n"},{"CreatedByName":"Banpower1","CreatedById":88017,"CreatedDateTime":"2013-10-16T15:50:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EI was more or less asking where you got the antimatter. With antimatter-fed engines you can zoom all over the place but actually getting the antimatter to fuel them is time intensive and requires some setup, which is the trade-off for having amazing power generation and thrust.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Euhm what? it took me a single orbit, at 110km height around kerbin to generate enough for the first warp, and after that things escalate quickly with timewarping...\u003C/p\u003E\u003Cp\u003EHere is the link: \u003Ca href=\u0022https://youtu.be/RPt2YyZEutc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/RPt2YyZEutc\u003C/a\u003E (and yes i forgot infinite fuel, but it doesnt run on fuel, and i detached all fuel tanks...)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T17:02:56Z\u0022 title=\u002210/16/2013 05:02  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by Banpower1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-10-16T15:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nobody_1707\u0022 data-cite=\u0022Nobody_1707\u0022\u003E\u003Cdiv\u003ESo, what is the difference between the Alcubierre drive and the Bergenholm from the Lensmen series? They seem to have basically the same effect on velocity; particularly in that they both return your velocity to it\u0027s original state when you shut the drive off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Bergenholm just threw the ship inert in respect to the universe. Thrust was still required to move where you wanted to go. \u003C/p\u003E\u003Cp\u003ELoved that series!\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-16T15:57:55Z","Content":"\n\u003Cp\u003EWarping to a body with an atomsphere is admittedly much easier since you don\u0027t need much (or any at all if you\u0027re clever) dv to set an aerobraking trajectory, However this would realistically be balanced by the re-entry effects, i\u0027ve entered Eve\u0027s atmosphere at over 10Km/s before, which would obviously be pretty deadly IRL. If you think this mod is OP try to make a base at Moho or Eeloo, or install Deadly Reentry.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-10-16T16:12:47Z","Content":"\n\u003Cp\u003EAM is really the endpoint tech, once science is implemented I can see Fractal_UK making it one of the last things you would unlock. The Alcubierre Drive does make getting to other planets a lot faster, the only thing is dV changes, which you can either keep warping to/from the planet and use the SOI or use engines to change it. If your charging with a nuclear reactor it takes a while, even the AM reactors can take time to charge up the drive.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T16:18:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Banpower1\u0022 data-cite=\u0022Banpower1\u0022\u003E\u003Cdiv\u003Euhm what? it took me a single orbit, at 110km height around kerbin to generate enough for the first warp, and after that things escalate quickly with timewarping...\u003Cp\u003EHere is the link: \u003Ca href=\u0022https://youtu.be/RPt2YyZEutc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/RPt2YyZEutc\u003C/a\u003E (right now youtube says 94% done, so link might not be ready this second) ((and yes i forgot infinite fuel, but it doesnt run on fuel, and i detached all fuel tanks...))\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh... 110km is a terrible orbit for collecting Antimatter around kerbin and an orbit at that altitude lasts like... 30 minutes? You collected enough during that short period to fuel a transfer?\u003C/p\u003E\u003Cp\u003EI\u0027ll have to test that when I get home. It may be a bug. At that altitude it should take weeks to get even one unit of AM iirc. (Away from my notes right now so I can\u0027t check)\u003C/p\u003E\n"},{"CreatedByName":"Banpower1","CreatedById":88017,"CreatedDateTime":"2013-10-16T16:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EHuh... 110km is a terrible orbit for collecting Antimatter around kerbin and an orbit at that altitude lasts like... 30 minutes? You collected enough during that short period to fuel a transfer?\u003Cp\u003EI\u0027ll have to test that when I get home. It may be a bug. At that altitude it should take weeks to get even one unit of AM iirc. (Away from my notes right now so I can\u0027t check)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can redo it again live on twitch if you want me to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (for the 3rd time (1st for self proof, 2nd for recording it))\u003C/p\u003E\u003Cp\u003EAlso going to do a fresh install just to make sure i didn\u0027t do something wrong\u003C/p\u003E\u003Cp\u003EEDIT: completely clean install (nothing but this mod) and it takes me half a day standing on the Kerbin Space Center Launchpad, to generate enough Exotic Matter for a single 0.10c jump (using the 3.75m parts all the way through) and didn\u0027t use any fuel hacks, since i didn\u0027t even need to launch...\u003C/p\u003E\u003Cp\u003EEDIT2 - corrected derp, naming exotic matter wrong\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T16:46:22Z\u0022 title=\u002210/16/2013 04:46  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by Banpower1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T16:34:24Z","Content":"\n\u003Cp\u003EI\u0027m not doubting you, just curious if its a bug you\u0027ve run into.\u003C/p\u003E\n"},{"CreatedByName":"Chase","CreatedById":69765,"CreatedDateTime":"2013-10-16T16:40:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003EMany of your suggestions have been suggested already, and the AM container is one of the older models made, if zzz gets the urge he will update it. You will also have to supply power to those reactors with AM stored in them since the containers will be changed to explode if not powered the reactors should do that same if he adds resources to it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood to know, because it looks pretty bad in my humble opinion. The antimatter containment requiring power makes sense. My idea is that I will go and dock my small antimatter ship (which will run on traditional resources until then), fill it up with power, fill up the reactor with antimatter (now it can generate power), and sail off to Eeloo without needing yet another tank. Mind you the stuff in the reactor might only be enough to get you there and back.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EYeah, the most important to think to realise in this mod is that science will generate in the background, just go and do something else, build some more science bases\u003Cp\u003E and put them on different planets while you\u0027re waiting for science to accumulate at the first. The idea is that the more developed your space program becomes, the more science you will be producing and the easier it will become to have more upgraded parts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, okay, well many mods don\u0027t. But still I don\u0027t want to put a dozen bases into orbit around distant planets to get any kind of useful research/antimatter. It makes the game move a bit to slow to play.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EThe numbers are often down to change in scope from where I started, it\u0027s not ideal but change means compatibility problems and that could be the greater of two evils. If there\u0027s a way I can think of to do this without compatibility problems though, I\u0027ll look into it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell there is a new version coming out, you may want to redo the research system to work with the new KSP Science system anyway. In fact I really hope that you do!\u003C/p\u003E\u003Cp\u003EI would prefer people break things to make them better then keep them poor.\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2013-10-16T16:42:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Banpower1\u0022 data-cite=\u0022Banpower1\u0022\u003E\u003Cdiv\u003EI can redo it again live on twitch if you want me to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (for the 3rd time (1st for self proof, 2nd for recording it))\u003Cp\u003EAlso going to do a fresh install just to make sure i didn\u0027t do something wrong\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure you didn\u0027t mean Exotic Matter? Your warp drive doesn\u0027t care how it gets power as long as it does.\u003C/p\u003E\u003Cp\u003EAs for the performance issues: Hohmann transfers are exact sort of thing using an atomic rocket/torchship lets you avoid. They\u0027re the longest-time, lowest-dV option, but when you\u0027re packing tens or hundreds of km/s, a few hundred m/s is pretty negligible; look up brachistochrone trajectories. We still don\u0027t have quite enough oomph to pull those off, even with the mod, but it\u0027s certainly closer. Chemical rockets are actually pretty horrendous in terms of endurance compared to nuclear engines, which themselves are nothing before antimatter engines.\u003C/p\u003E\u003Cp\u003EZzz, great work as always. Hopefully you feel better, soon!\u003C/p\u003E\u003Cp\u003EFractal, I\u0027m probably going to disable the wasteheat function when consequences are added. I\u0027ll throw massive radiators all over the ships made for your mod, but I don\u0027t have them on my other craft. With no heat dispersion capabilities on them, they\u0027ll be derelict. One\u0027s been my main ship for the past eight years of in-game time, it\u0027d be a shame to lose it because of this. Perhaps you could put Waste Heat into its own, seperate mod?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T16:47:08Z\u0022 title=\u002210/16/2013 04:47  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by Hremsfeld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T16:43:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chase\u0022 data-cite=\u0022Chase\u0022\u003E\u003Cdiv\u003ERight, okay, well many mods don\u0027t. But still I don\u0027t want to put a dozen bases into orbit around distant planets to get any kind of useful research/antimatter. It makes the game move a bit to slow to play.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh.. that is kind of what this mod is about though. Building up infrastructure is the downside to using the amazingly high energy density antimatter engines and such. If you don\u0027t want to do that, just use a cheat like hyperedit or use TAC fuel balancer to fill your AM tanks before launch I guess.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-16T17:04:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EHuh... 110km is a terrible orbit for collecting Antimatter around kerbin and an orbit at that altitude lasts like... 30 minutes? You collected enough during that short period to fuel a transfer?\u003Cp\u003EI\u0027ll have to test that when I get home. It may be a bug. At that altitude it should take weeks to get even one unit of AM iirc. (Away from my notes right now so I can\u0027t check)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe is just powering the warp drive with the nuclear reactor. The antimatter reactor is just dead weight, it has no antimatter tank and no collector. When he turns the antimatter reactor on it just says \u0022Antimatter Deprived.\u0022\u003C/p\u003E\u003Cp\u003EAs to the video in general, it isn\u0027t terribly surprising, a lot of people have been doing this kind of thing for a while, the downside to the approach is that it requires a reasonable amount of time spent on actually finetuning your approach. Sure, you can save some delta-v by doing it but considering the mod includes various ISRU technologies, you could hohmann transfer to Jool, aerobrake into Laythe orbit, land in the ocean and electrolyse some fuel. This second approach is probably both quicker and more familiar and thus requires less effort for most KSP players but because the second option could be done totally plausibly with no new technology whatsoever, we tend to see it a bit differently.\u003C/p\u003E\u003Cp\u003EThe mod definitely gives you capabilities that don\u0027t exist in stock, so in that sense, it is \u0022OP.\u0022 On the other hand, if it didn\u0027t add any new features, it\u0027d be pretty pointless mod.\u003C/p\u003E\u003Cp\u003EI do want to clarify something though: I didn\u0027t make the Alcubierre drive for the sole purpose of making a non-OP warp drive. I made it because I wanted to see, intuitively, how a warp drive that functioned by the principles Alcubierre described might function in the game and what you could actually do with it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EPerhaps you could put Waste Heat into its own, seperate mod?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t want to do this, I see the thermal mechanics as something of a key balancing feature for all the power hungry stuff in this mod. Once you have developed antimatter reactors and multi-GW space based power sources, the problem is increasingly less about the spaceship\u0027s actual performance capabilities with its engines and more about how you keep the damn thing cool while doing anything.\u003C/p\u003E\u003Cp\u003EStock ships are not even going to suffer particularly hard as a result of the changes. Just don\u0027t leave solar panels deployed when you don\u0027t need them and you\u0027ll probably be alright, especially from Kerbin and outwards.\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-16T17:41:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EHe is just powering the warp drive with the nuclear reactor. The antimatter reactor is just dead weight, it has no antimatter tank and no collector. When he turns the antimatter reactor on it just says \u0022Antimatter Deprived.\u0022\u003Cp\u003EAs to the video in general, it isn\u0027t terribly surprising, a lot of people have been doing this kind of thing for a while, the downside to the approach is that it requires a reasonable amount of time spent on actually finetuning your approach. Sure, you can save some delta-v by doing it but considering the mod includes various ISRU technologies, you could hohmann transfer to Jool, aerobrake into Laythe orbit, land in the ocean and electrolyse some fuel. This second approach is probably both quicker and more familiar and thus requires less effort for most KSP players but because the second option could be done totally plausibly with no new technology whatsoever, we tend to see it a bit differently.\u003C/p\u003E\u003Cp\u003EThe mod definitely gives you capabilities that don\u0027t exist in stock, so in that sense, it is \u0022OP.\u0022 On the other hand, if it didn\u0027t add any new features, it\u0027d be pretty pointless mod.\u003C/p\u003E\u003Cp\u003EI do want to clarify something though: I didn\u0027t make the Alcubierre drive for the sole purpose of making a non-OP warp drive. I made it because I wanted to see, intuitively, how a warp drive that functioned by the principles Alcubierre described might function in the game and what you could actually do with it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe production of exotic matter should be altered so that nuclear reactors of any size or tech are not sufficient to power the drive? Honestly...considering the energies involved, even if it were possible to charge up a drive with a nuke, it would take years. Maybe tweak the output of both reactors to get a larger spread, so that a nuke might do the job, but only after lots of time-warping, while an antimatter reactor is essentially ideal (though maybe still not enough to go hopping around the system over-and-over) for the drive.\u003C/p\u003E\u003Cp\u003EI think perhaps make it so that you can make a jump with little consumption, but upon deactivation, it dumps the whole supply (maybe this exotic matter is an all-or-nothing deal, and you use it or lose it). That would prevent people from being excessively clever about short-hopping into orbit. Maybe it could inspire an \u0022exotic matter storage\u0022 so that each tank is good for one hop. Takes longer to charge all of them up, but segregates the supply so that it\u0027s not all gone in one go.\u003C/p\u003E\u003Cp\u003EPerhaps both options, that should really discourage those who seek the quick and easy path, as Vader did.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EI don\u0027t want to do this, I see the thermal mechanics as something of a key balancing feature for all the power hungry stuff in this mod. Once you have developed antimatter reactors and multi-GW space based power sources, the problem is increasingly less about the spaceship\u0027s actual performance capabilities with its engines and more about how you keep the damn thing cool while doing anything.\u003Cp\u003EStock ships are not even going to suffer particularly hard as a result of the changes. Just don\u0027t leave solar panels deployed when you don\u0027t need them and you\u0027ll probably be alright, especially from Kerbin and outwards.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could be wrong...but I think he was referring to ships with parts that have been upgraded, while ignoring the idea of waste heat. Basically, he built a bunch of ships without radiators when they didn\u0027t matter, and made really spiffy ships, and now he\u0027ll lose them because heat will matter. I think that\u0027s what he was meaning, anyway. Again, I could be wrong.\u003C/p\u003E\u003Cp\u003EEdit: Grammar...\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-10-16T17:41:51Z","Content":"\n\u003Cp\u003EAnd you did put Alcubierre drive in admirably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E We are learning a whole new branch of astrogation here, and FTL engineering too. Who woulda think an FTL ship able to make interplanetary trip in about half an hour, will need more fuel and stronger engine than conventional ship? Alcubierre drive saves you time, not effort - you still need to work hard to set a foot on another planet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for heat, option for passive heat radiation will go a long way with our older ships, since they don\u0027t really carry heat-intensive parts. There are more options to improve heat dissipation too: The farther from Kerbol you are, the dissipation is more effective. The same goes when your ship is in the planet\u0027s shadow. Add a small, static radiator that can be installed on the ship in EVA using KAS mod. I\u0027m sure we can make it work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-16T17:46:19Z","Content":"\n\u003Cp\u003ESlightly off-topic, but something I think is of interest to us all.\u003C/p\u003E\u003Cp\u003EWho says video games aren\u0027t constructive?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.zmescience.com/research/studies/gamers-solve-decade-old-hiv-puzzle-in-ten-days/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.zmescience.com/research/studies/gamers-solve-decade-old-hiv-puzzle-in-ten-days/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMakes one wonder...if we could make something like KSP just as realistically functional as the game in the article, could we design and build an interstellar ship with current technology in a fraction of the time predicted?\u003C/p\u003E\n"},{"CreatedByName":"Chase","CreatedById":69765,"CreatedDateTime":"2013-10-16T17:46:21Z","Content":"\n\u003Cp\u003EWell if your going to do that, at least add some surface mountable heatsinks, rather then the solar panel-esk ones we have now.\u003C/p\u003E\u003Cp\u003EOh on that note, I wouldn\u0027t mind even slower values for the alcubierre drive.\u003C/p\u003E\u003Cp\u003EAlso, we should be able to turn it on in the atmosphere (and promptly explode), because its Kerbal engineered...\u003C/p\u003E\u003Cp\u003EBut I could see it working at the out reaches of the atmosphere (like 60k-65k on Kerbin) with limited damage to the ship.\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T17:51:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tharios\u0022 data-cite=\u0022Tharios\u0022\u003E\u003Cdiv\u003EI think perhaps make it so that you can make a jump with little consumption, but upon deactivation, it dumps the whole supply (maybe this exotic matter is an all-or-nothing deal, and you use it or lose it). That would prevent people from being excessively clever about short-hopping into orbit. Maybe it could inspire an \u0022exotic matter storage\u0022 so that each tank is good for one hop. Takes longer to charge all of them up, but segregates the supply so that it\u0027s not all gone in one go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like that. When you deactivate the drive it dumps all exotic matter. Combine that with a bit higher energy cost to create it and it will incentivize single jumps and using AM reactors but will still allow nuke-powered jumps if you have the time.\u003C/p\u003E\u003Cp\u003EMy newest ship has 3 nuke/generator combos on docking ports and I drop and recover them when the fuel eventually runs dry. I\u0027d really like the ability to shut down a reactor with a rightclick context menu from EVA, so you need to EVA and interact directly with the reactor to shutdown/startup and it might take a full 10 minutes to cycle down to safe levels. This would let me bring additional reactors for long duration flights and use them up sequentially.\u003C/p\u003E\u003Cp\u003EMight I also suggest an additional research location? Far enough away from the kerbol star to be analogous to the Heliopause. A deep space research outpost there would be an interesting logistical challenge to service and maintain.\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-16T18:18:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EI like that. When you deactivate the drive it dumps all exotic matter. Combine that with a bit higher energy cost to create it and it will incentivize single jumps and using AM reactors but will still allow nuke-powered jumps if you have the time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy, thank you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EMy newest ship has 3 nuke/generator combos on docking ports and I drop and recover them when the fuel eventually runs dry. I\u0027d really like the ability to shut down a reactor with a rightclick context menu from EVA, so you need to EVA and interact directly with the reactor to shutdown/startup and it might take a full 10 minutes to cycle down to safe levels. This would let me bring additional reactors for long duration flights and use them up sequentially.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeat idea, would certainly make multiple reactors more useful, but at the cost of carting a lot of extra dead weight into orbit at first.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EMight I also suggest an additional research location? Far enough away from the kerbol star to be analogous to the Heliopause. A deep space research outpost there would be an interesting logistical challenge to service and maintain.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow...this may be beating a dead horse, but from what I\u0027ve found around the forums, this may be a new angle. The whole Lagrange point issue, seems to be centered around the idea that the game can\u0027t accurately model those gravitationally \u0022balanced\u0022 spots. And all I could ever wonder at looking over all those posts was...why would you try? Of course, the game can\u0027t do that, because that\u0027s not at all how it works. But...you can still have them, and relatively simply.\u003C/p\u003E\u003Cp\u003EThe devs have already implied that they\u0027d certainly like to add more planets and moons, and as such, this next bit is just as feasible. Don\u0027t model the gravity balance. Lagrange points even at their best aren\u0027t entirely stable, so no ship is just going to sit there in empty space, not moving. As I recall, all the probes and satellites we\u0027ve place at those points are kind of orbiting the center of the zone?\u003C/p\u003E\u003Cp\u003ESo the solution is simple...create essentially planetless SoIs and place them on the same rails as each planet/moon, at the correct distances and moving at equal velocity. Fly to one, get into its SoI, orbit the empty spot in the middle. Lagrange point. They don\u0027t have to be modeled like Lagrange points...after all, a lot of KSP isn\u0027t modeled \u0022correctly\u0022...they just have to behave like them for the most part.\u003C/p\u003E\u003Cp\u003EI won\u0027t claim to know how much more or less difficult it would be than adding extra planets, but aside from the lack of an actual planetary body, I have a hard time imagining it being all that much more difficult, if not necessarily easier.\u003C/p\u003E\u003Cp\u003ESorry for the off-topic...but your mentioning of a zone of boosted science collection at the edge of the system just fired up my brain on that whole spiel.\u003C/p\u003E\n"},{"CreatedByName":"Banpower1","CreatedById":88017,"CreatedDateTime":"2013-10-16T18:26:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E(...)Sure, you can save some delta-v by doing it. (...)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei\u0027m sorry if i came off offensive, i really like the mod and it looks very VERY cool, i was just pointing out that the warp drive doesn\u0027t save \u0022some\u0022 delta-v it saves a whole lot, around 3k dV to transfer between two celestial bodies, which can be done over and over at will, without refuel. I was just hoping to start a discussion on how to make the warp drive a thing that you would use \u0022late game\u0022 and not something that makes newcomers like me able to jump around the solar system from the first craft created.\u003C/p\u003E\u003Cp\u003EI was thinking something like having to do an initial science upgrade to upgrade it from not working to working? that way you have to get some science done as minimum?\u003C/p\u003E\u003Cp\u003Eand also i was considering if science shouldn\u0027t diminish when you research the same area/orbit for a long while? (like in real life there is only so much you can \u0022science\u0022 on when visiting a single new planet) that way you have to visit a lot of planets to \u0022unlock\u0022 warp drive, and then you can use it to cut down traveling that you already succeeded?\u003C/p\u003E\u003Cp\u003Ewith the .22 update things should be more sensible though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eanyways, just some ideas about the mod, from some new eyes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (yes my craft contained stuff it shouldn\u0027t i just slapped stuff on a rocket to see how it worked, and then i found that it worked a little too well in my taste, and had a potential to work better, in my opinion)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T18:34:30Z\u0022 title=\u002210/16/2013 06:34  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by Banpower1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-16T18:31:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Banpower1\u0022 data-cite=\u0022Banpower1\u0022\u003E\u003Cdiv\u003EI was just hoping to start a discussion on how to make the warp drive a thing that you would use \u0022late game\u0022 and not something that makes newcomers like me able to jump around the solar system from the first craft created.\u003Cp\u003EI was thinking something like having to do an initial science upgrade to upgrade it from not working to working? that way you have to get some science done as minimum?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh, initial science cost to get it working make some sense but I think it would either be annoying or trivial depending on the cost, and neither is a feeling you want in a game. Easiest solution would be to wait for .22 and put the drive high up in the tech tree. Now your first craft can\u0027t zoom to jool.\u003C/p\u003E\u003Cp\u003EAlso the proposed \u0027one jump and you lose all exotic matter\u0027 change would effectively keep you from \u0027solar surfing\u0027 with microjumps to change trajectory. An upgraded warp drive could instead charge faster rather than be more efficient with exotic matter use.\u003C/p\u003E\n"},{"CreatedByName":"Tharios","CreatedById":84309,"CreatedDateTime":"2013-10-16T18:36:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EEh, initial science cost to get it working make some sense but I think it would either be annoying or trivial depending on the cost, and neither is a feeling you want in a game. Easiest solution would be to wait for .22 and put the drive high up in the tech tree. Now your first craft can\u0027t zoom to jool.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, one would think a warp drive would be at the end of the tech tree, anyway. lol\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EAlso the proposed \u0027one jump and you lose all exotic matter\u0027 change would effectively keep you from \u0027solar surfing\u0027 with microjumps to change trajectory. An upgraded warp drive could instead charge faster rather than be more efficient with exotic matter use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh...faster charge from upgraded drives, coupled with better reactor/generator output ( further speeding charge rates)...that should make a minor degree of \u0022surfing\u0022 possible, but only once all relevant components are upgraded to support that kind of charge rate. Yeah, I think that might be better than adding yet another tank of \u0022fuel\u0022 to the mix.\u003C/p\u003E\u003Cp\u003ECoupled with the drive being the last thing you get your hands on in the tech tree, no one will be jumping all over the place for a good long while.\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-16T18:57:43Z","Content":"\n\u003Cp\u003EInstead of wasting all that exotic matter you could just reduce the storage size.\u003C/p\u003E\n"}]}