{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":101,"Articles":[{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-10-27T17:42:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EIt\u0027s probably because the plasma thruster max thrust isn\u0027t set until you actually start the burn, I think it should work if you throttle up the engines up and down a bit before starting the autopilot but I\u0027m not sure. I will investigate when I get chance.\u003Cp\u003EHow do you mean? Plasma thrusters produce a lot of WasteHeat so that could be a downside.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI built a single stage to laythe plane that bounces itself out of the atmosphere with thermal jets, then switches over to a QVPD.\u003C/p\u003E\u003Cp\u003EI was wondering if there was any downside to leaving the QVPD running while in laythes atmosphere, or on kerbins so that it is easier to bounce out of the atmosphere to get back to space.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-10-27T17:53:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003ENow most used mono-propellant isn\u0027t straight hyrazine, it\u0027s actually a mixture of hydrazine and unsymetrical dimethylhydrazine, usually in a 50/50 mix called Aerozine 50. USDH has a molecular formula of C2H8N2. Still smack-dab in the realm of a FT fuel synthesis, just add CO2 ice to the mix and shake well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHeh? Aerozine 50 is a hypergolic propellant used with an oxidiser - usually Dinitrogen Tetroxide. It has a higher density than pure UDMH so makes a good hypergolic fuel, it\u0027s inferior to pure Hydrazine as a mono-propellant though because it\u0027s more stable. Hydrazine will simply decompose on contact with a catalyst.\u003C/p\u003E\u003Cp\u003EFrom what I\u0027ve read on the subject, Hydrazine generally appears to generally be synthesised from ammonia and hydrogen peroxide or ammonia/sodium hypochlorite. Ammonia might be found in situ on particular celestial bodies (Ike and in Jool\u0027s atmosphere?) but the production of the other components, well, extends beyond my knowledge of chemistry.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003EI built a single stage to laythe plane that bounces itself out of the atmosphere with thermal jets, then switches over to a QVPD.\u003Cp\u003EI was wondering if there was any downside to leaving the QVPD running while in laythes atmosphere, or on kerbins so that it is easier to bounce out of the atmosphere to get back to space.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf its using vacuum plasma, the quantum vacuum thruster doesn\u0027t work in atmosphere, so you could leave it running, it won\u0027t receive much power because your thermal engines will eat it all first but if you do leave it running, it will draw the power even though its producing no thrust and produce a lot of heat that you possibly don\u0027t want in the process.\u003C/p\u003E\u003Cp\u003EYou could switch over to liquid fuel mode but this is probably only useful if you want to tweak your effective specific impulse upward a bit when you already have plenty of thrust.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T17:59:24Z\u0022 title=\u002210/27/2013 05:59  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by Fractal_UK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-10-27T18:35:50Z","Content":"\n\u003Cp\u003EThe jet itself actually has no fuel on board, which is the big reason why I like the design.\u003C/p\u003E\u003Cp\u003EBut it if eats power even while not making thrust, that\u0027s a simple fix, I will just bind it to the action group that shuts down the thermal jets to prevent a death spiral, thanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"localSol","CreatedById":61326,"CreatedDateTime":"2013-10-27T19:13:35Z","Content":"\n\u003Cp\u003EI uploaded a quick TreeEdit tech tree merge/balance of KSPInterstellar\u002BKerbalAttachmentSystem(KAS)\u002BKethane\u002BkOS\u002BFirespitter\u002BB9\u002Bgraphotron\u002BInfernalRobotics\u002BExtraplanetaryLaunchpads\u002BMissionControllerExtended\u002BKerbalEngineerRedux\u002BProceduralWings\u002BProceduralFairings\u003C/p\u003E\u003Cp\u003E (A mod to the interstellar tree uploaded to the TreeEdit online list) .The B9, interstellar and firespitter balances are the author originals as included IIRC. I guess Engineer redux and missiontrollerextended added their parts in some other way, so they may not appear in my TreeEdit Edit itself. Most techs are in the nodes#3-6 areas as relative to interstellar\u0027s tree. No idea if it will load if you don\u0027t have all the parts, but I hope it helps anyone wanting to jump into all these in career mode or at least is a starting point for your own modding.\u003C/p\u003E\u003Cp\u003ELooking again if I were to make another quick shuffle it would be to spread some more of the infernal robotics parts to Advanced Motors. Some are already in Field Science, the parent node. I set it to read only, hopefully it can be copied..I had no way of confirming anyone else can see it there. Anyway, exciting tech stuff lately.\u003C/p\u003E\u003Cp\u003ELooking forward to trying the interstellar parts. Haven\u0027t got enough science for them yet! On to the science I go!\u003C/p\u003E\u003Cp\u003EEdit : To anyone, to make installing and managing so many mods much more comfortable, use KSPModAdmin. It\u0027s greater than great, which is really great.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T19:21:28Z\u0022 title=\u002210/27/2013 07:21  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by localSol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2013-10-27T19:47:11Z","Content":"\n\u003Cp\u003EEeloo\u0027s supposed to be a future gas giant\u0027s moon, not a Pluto analogue. According to the KSP wiki it\u0027s more of an analogue to Europa.\u003C/p\u003E\n"},{"CreatedByName":"Cairan","CreatedById":85361,"CreatedDateTime":"2013-10-27T20:19:56Z","Content":"\n\u003Cp\u003EHere it is, Discovery One. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Took 4 flights to assemble in orbit:\u003C/p\u003E\u003Cp\u003E1) Warp drive and nuclear core/generator unit\u003C/p\u003E\u003Cp\u003E2) Antimatter scoop and storage system\u003C/p\u003E\u003Cp\u003E3) Antimatter core/generator unit\u003C/p\u003E\u003Cp\u003E4) Docking bays/control cupola and quantum plasma drive unit\u003C/p\u003E\u003Cp\u003EAssembly was performed first by a rendez-vous from the Cupola / Plasma thruster vessel with the warp drive and nuclear reactor core. The Cupola split up and stood by while the Plasma drive docked with the nuclear/warp drive assembly. Cupola then docked at the forward end of the warp drive. The whole assembly then met up with the antimatter storage and collection assembly. Cupola undocked out of the way so the drive unit could dock with the antimatter section. Cupola redocked at the forward end of the antimatter storage. Finally, met up with the antimatter drive and generator unit, the troublesome part which was so heavy I had to resort to Novapunch creativity... Cupola and antimatter assembly undocked from the drive section, which went on to dock with the antimatter reactor core. The forward end (cupola, antimatter scoops and pods) docked with the assembled drive section (antimatter reactor, generator, warp drive, nuclear reactor and generator, and quantum vacuum plasma thruster).\u003C/p\u003E\u003Cp\u003EIt weighs in at 177 tons, has a max acceleration of 0.29 meters per second under normal drive operation, but this vessel is meant as my \u0022mothership\u0022 of long range planetary missions, designed to stay right on the edge of SOI except for antimatter collection, which can be accomplished by undocking the drive section. I\u0027m building a fleet of support vessels (landers, orbital pods, small nuclear generator units) so that this vessel can split up as necessary while in orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kuSNBPy.png\u0022 alt=\u0022kuSNBPy.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2013-10-27T21:45:42Z","Content":"\n\u003Cp\u003EFractal, what about this:\u003C/p\u003E\u003Cp\u003ELet\u0027s scrap Anti-Matter for time been. Yes, i know, it\u0027s big deal, but i just think that jump from nuclear power to AM is bit...steep\u0027ish. So, you could convert current AM-reactors to fusion, using deuterium and tritium as fuel. If a little more difficulty is wanted, then how about re-heating the fusion reactors using nuclear reactors? That is, before start, so it would ideal to keep them running, so plenty of fuel.\u003C/p\u003E\u003Cp\u003EThen there is current anti-matter farms...well, we could turn them as Exotic Matter farms and switch warp drive in such way, that it requires EM as \u0027fuel\u0027 and some MJ\u0027s for activation(s).\u003C/p\u003E\u003Cp\u003EThen there would need a bit more efficient method of gaining MJ\u0027s out of fusion reaction, some kind of plasma-driven generator with decent efficiency, say 70%\u002B\u003C/p\u003E\n"},{"CreatedByName":"DragonSlayer666","CreatedById":85239,"CreatedDateTime":"2013-10-27T21:48:07Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003ESo i just updated this mod to the new version(with integrated KSP 0.22 support and tech tree). However, it prevents KSP from starting now. When i have this mod installed, it\u0027ll give a C\u002B\u002B runtime error during the loading of the parts. This happens during the loading of one of the original Squad command pods though, so i really don\u0027t get it.\u003C/p\u003E\u003Cp\u003ECould someone help me with this one? as i really would like to use this mod in the career mode as well...\u003C/p\u003E\u003Cp\u003EKind Regards,\u003C/p\u003E\u003Cp\u003EDragonSlayer666\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2013-10-27T21:49:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EHeh? Aerozine 50 is a hypergolic propellant used with an oxidiser - usually Dinitrogen Tetroxide. It has a higher density than pure UDMH so makes a good hypergolic fuel, it\u0027s inferior to pure Hydrazine as a mono-propellant though because it\u0027s more stable. Hydrazine will simply decompose on contact with a catalyst.\u003Cp\u003E....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*goes back and re-reads his notes* ...and that\u0027s what I get for just going off my memory. Aero-50, more shelf-stable, thus better for long duration missions, but not used as a mono-prop. Doh.\u003C/p\u003E\u003Cp\u003EBut by all means, go read up on FT processes. Seems like they\u0027d be straight up this game\u0027s alley.\u003C/p\u003E\n"},{"CreatedByName":"DragonSlayer666","CreatedById":85239,"CreatedDateTime":"2013-10-27T21:57:41Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003ESo i today i updated to the new version of this mod so i can enjoy it in the career mode as well. However, since updating the mod i cannot start KSP anymore. During the loading of the parts KSP will come up with a C\u002B\u002B runtime error, which i cannot explain. If i deinstall the mod again KSP works like a charm.\u003C/p\u003E\u003Cp\u003ESo here comes the kicker: KSP doesn\u0027t crash during the loading of parts from the interstellar mod, no: it crashes during the loading of one of the command pods made by Squad themselves!\u003C/p\u003E\u003Cp\u003ESo is there anyone that can help me with this one? Or did i somehow managed to wreck a perfectly good mod?\u003C/p\u003E\u003Cp\u003EKind Regards,\u003C/p\u003E\u003Cp\u003EDragonSlayer666\u003C/p\u003E\u003Cp\u003EP.S. Yes, i tried reinstalling the mods, reinstalling kerbal, checking local file integrity etc. I\u0027ve done it about a dozen times.\u003C/p\u003E\n"},{"CreatedByName":"Lalwcat","CreatedById":3041,"CreatedDateTime":"2013-10-27T22:35:48Z","Content":"\n\u003Cp\u003E-Added option to harvest Deuterium from Jool\u0027s atmosphere\u003C/p\u003E\u003Cp\u003EHow? Science lab in the atmosphere has an option to make Deuterium or something?\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-27T23:06:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DragonSlayer666\u0022 data-cite=\u0022DragonSlayer666\u0022\u003E\u003Cdiv\u003EHi there,\u003Cp\u003ESo i today i updated to the new version of this mod so i can enjoy it in the career mode as well. However, since updating the mod i cannot start KSP anymore. During the loading of the parts KSP will come up with a C\u002B\u002B runtime error, which i cannot explain. If i deinstall the mod again KSP works like a charm.\u003C/p\u003E\u003Cp\u003ESo here comes the kicker: KSP doesn\u0027t crash during the loading of parts from the interstellar mod, no: it crashes during the loading of one of the command pods made by Squad themselves!\u003C/p\u003E\u003Cp\u003ESo is there anyone that can help me with this one? Or did i somehow managed to wreck a perfectly good mod?\u003C/p\u003E\u003Cp\u003EKind Regards,\u003C/p\u003E\u003Cp\u003EDragonSlayer666\u003C/p\u003E\u003Cp\u003EP.S. Yes, i tried reinstalling the mods, reinstalling kerbal, checking local file integrity etc. I\u0027ve done it about a dozen times.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow many mods do you have installed? I\u0027m guessing you\u0027ve gone over the memory cap.\u003C/p\u003E\n"},{"CreatedByName":"Malsheck","CreatedById":63397,"CreatedDateTime":"2013-10-27T23:09:07Z","Content":"\n\u003Cp\u003EHello, I just want to confirm something to make sure I don\u0027t have this mod installed wrong or some other issue. As far as I can tell, if you have a science lab in orbit, on the Mun, on Duna or where ever and your doing research for science points, you only get points for the lab your currently controlling. So you can have a dozen labs all over the solar system but if your not controlling one of them then your not getting anything. Does this sound about right? I\u0027m thinking that this has more to do with the game mechanics than anything since my research probes aren\u0027t recharging unless I\u0027m controlling them either. Was kinda hoping this mod added a plugin that would keep track but I guess that\u0027s not possible atm?\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2013-10-27T23:12:00Z","Content":"\n\u003Cp\u003EPeople ask that question every page. If you\u0027d looked back you\u0027d have seen it.\u003C/p\u003E\u003Cp\u003EScience labs make science even when not controlled but to get that science you must switch back to them once so that they can update your science total.\u003C/p\u003E\n"},{"CreatedByName":"DragonSlayer666","CreatedById":85239,"CreatedDateTime":"2013-10-27T23:38:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EHow many mods do you have installed? I\u0027m guessing you\u0027ve gone over the memory cap.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI currently have 6 mods installed (excluding interstellar mod). These are: B9 Aerospace, Firespitter, KAS, LLL, Mechjeb2 and TSAS.\u003C/p\u003E\u003Cp\u003EBut the error occurs not only with all this installed. It occured with only the interstellar mod installed as well.\u003C/p\u003E\u003Cp\u003EKind Regards,\u003C/p\u003E\u003Cp\u003EDragonSlayer666\u003C/p\u003E\n"},{"CreatedByName":"Malsheck","CreatedById":63397,"CreatedDateTime":"2013-10-28T00:06:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EPeople ask that question every page. If you\u0027d looked back you\u0027d have seen it.\u003Cp\u003EScience labs make science even when not controlled but to get that science you must switch back to them once so that they can update your science total.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, sorry about that. Not sure how I missed it but thanks for the reply. I guess I figured information like that would have been in the OP under the labs section.\u003C/p\u003E\u003Cp\u003EEdit: I did the following to test it... I went to one of my probes on duna.... time accelerated for a few days just to see. Then switched to my two labs and then back to the space center and into the R\u0026amp;D.... no points were added. Then I tried a 2nd time only this time going to the lab first, then going elsewhere, time exaggerated, and then going back to the lab, then back to R\u0026amp;D.... still no points. So if it\u0027s suppose to work then it doesn\u0027t for me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-28T00:45:29Z\u0022 title=\u002210/28/2013 12:45  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 28, 2013\u003C/time\u003E by Malsheck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RadHazard","CreatedById":80815,"CreatedDateTime":"2013-10-28T02:01:14Z","Content":"\n\u003Cp\u003EI\u0027ve been playing with KSP Intersteller 0.7.2 in my career game. I\u0027ve just started unlocking the early power generation and transmission tech nodes in preparation for building a plasma-engine based rocket. I was playing around with the plasma stuff and ended up making this:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JHpbR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI call it the PlasmaJet\u003Csup\u003ETM\u003C/sup\u003E (I\u0027m... not very good at naming things). It has a top speed of 30-60 m/s, depending on how your receivers are angled toward the transmitter tower, and it can\u0027t maneuver for nothing, but it flies. I\u0027d probably get much better performance if I swapped fuel types, but I\u0027m enjoying it\u0027s obscene fuel efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-10-28T02:12:30Z","Content":"\n\u003Cp\u003EI like the idea of microwave beamed launches, but there might be a simpler method to be used before that tech becomes available. Short range microwave (or laser) beaming straight up a launching rocket into the exhaust nozzle of an expendable, specialized engine. Someone (I forget who) has build a simple plastic mock up with this as a proof of concept. Fire a laser up, it get\u0027s focused by the shape of the engine into one spot where the engine material vaporizes at just that spot. In atmosphere you\u0027d also get atmospheric plasma. This makes basically a pulsed detonation laser rocket. You can\u0027t make it continuous as the explosion would mask the laser causing it, and the beam must be directly below to focus correctly. Thus no gravity turn on this, it only thrusts straight up (or straight away from the laser at least)\u003C/p\u003E\u003Cp\u003EThe man doing this IRL wasn\u0027t planning on this being the final design. His eventual aim was to beam energy to \u0027Lightcraft\u0027 much as Fractal_UK was talking about. It was a while ago I read about this but I seem to remember he was actually talking about powering lasers via microwaves to use just atmospheric plasma and magnets to thrust this past the craft for thrust. A no fuel engine with no powerplant. Win win situation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xchoo","CreatedById":20034,"CreatedDateTime":"2013-10-28T04:35:53Z","Content":"\n\u003Cp\u003EHi! I am encountering an error when I try to stack multiple electric generator \u0026amp; reactor units on top of each other (or had multiple generator/reactor pairs on one vessel). They end up producing \u0022Nan MW\u0022 output instead of some proper number. \u003C/p\u003E\u003Cp\u003EAlso, I find that if I had the generator on top of the reactor, the unit would not produce any power, but if I had the reactor on top of the generator, the unit would operate properly.\u003C/p\u003E\u003Cp\u003EIs anyone else experiencing this problem?\u003C/p\u003E\u003Cp\u003EThis is with version 0.7.2\u003C/p\u003E\n"},{"CreatedByName":"SorensonPA","CreatedById":59038,"CreatedDateTime":"2013-10-28T05:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EThen there would need a bit more efficient method of gaining MJ\u0027s out of fusion reaction, some kind of plasma-driven generator with decent efficiency, say 70%\u002B\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking about this earlier as well, specifically in how the lost efficiency spills over into multiple problems like waste heat buildup and inability to fully utilize certain engines to their utmost. Being able to claw back that lost 40% would go a hell of a long way. Heck, not just in generators, but all sorts of stuff - plasma thrusters only get 72% efficiency according to the context menu, and taken against the 60% generator efficiency that means you\u0027re only getting 43.2% of theoretical maximum thrust out of the whole deal\u003C/p\u003E\u003Cp\u003ERather than build even more fixed component tiers upgraded to with certain technologies, would it be possible to do a system of scaled improvement that inch towards a theoretical maximum efficiency? Establish a set of point pools tied to specific component types (thermal generators, fusion/antimatter reactors, plasma/thermal/fusion thrusters, heat radiators, etc) that you can sink 1,000 Science into via part context menus and each investment bumps you along an improvement curve towards aforementioned maximum. That\u0027d be a good way to extend R\u0026amp;D pursuits and keep players motivated to do more research and build bigger science complexes.\u003C/p\u003E\u003Cp\u003ETaking the efficiency jump between generator tiers as a barebones example from them being triggered by a 1,000 Science drop, it\u0027d take 6,000 to hit ~99% generator efficiency, 13,000 to hit ~99.99% - not particularly unreasonable given we\u0027re sidestepping the laws of physics at 10,000.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xchoo\u0022 data-cite=\u0022xchoo\u0022\u003E\u003Cdiv\u003EHi! I am encountering an error when I try to stack multiple electric generator \u0026amp; reactor units on top of each other (or had multiple generator/reactor pairs on one vessel). They end up producing \u0022Nan MW\u0022 output instead of some proper number. \u003Cp\u003EAlso, I find that if I had the generator on top of the reactor, the unit would not produce any power, but if I had the reactor on top of the generator, the unit would operate properly.\u003C/p\u003E\u003Cp\u003EIs anyone else experiencing this problem?\u003C/p\u003E\u003Cp\u003EThis is with version 0.7.2\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan confirm the problem with multiple reactors in the gen\u0026lt;reactor\u0026lt;gen\u0026lt;reactor configuration and that a reactor\u0026lt;gen\u0026lt;gen\u0026lt;reactor configuration works.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-28T05:17:27Z\u0022 title=\u002210/28/2013 05:17  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 28, 2013\u003C/time\u003E by SorensonPA\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlchemicalAgent","CreatedById":90478,"CreatedDateTime":"2013-10-28T05:12:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xchoo\u0022 data-cite=\u0022xchoo\u0022\u003E\u003Cdiv\u003EHi! I am encountering an error when I try to stack multiple electric generator \u0026amp; reactor units on top of each other (or had multiple generator/reactor pairs on one vessel). They end up producing \u0022Nan MW\u0022 output instead of some proper number. \u003Cp\u003EAlso, I find that if I had the generator on top of the reactor, the unit would not produce any power, but if I had the reactor on top of the generator, the unit would operate properly.\u003C/p\u003E\u003Cp\u003EIs anyone else experiencing this problem?\u003C/p\u003E\u003Cp\u003EThis is with version 0.7.2\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m seeing the same problem. With the addition that even if the reactor is on top the units won\u0027t work unless connected directly to an Interstellar part (Science lab, etc).\u003C/p\u003E\u003Cp\u003EEdit: For additional information, resources like Waste Heat and Electric Charge seem to be transferred correctly across entire vessels while the reactor thermal load is not transmitted to attached parts.\u003C/p\u003E\u003Cp\u003EDeletion and Reinstall of Interstellar has no effect. All mods with plugin components were also removed with no effect.\u003C/p\u003E\u003Cp\u003E2nd Edit: I just realized xchoo was talking about multiple reactor/gen combos. The problem I described is with only one reactor/genset per ship.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-28T05:38:01Z\u0022 title=\u002210/28/2013 05:38  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 28, 2013\u003C/time\u003E by AlchemicalAgent\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stevron","CreatedById":85773,"CreatedDateTime":"2013-10-28T05:44:56Z","Content":"\n\u003Cp\u003EI\u0027ve also got that problem, having is one way works, but the other it doesn\u0027t. But I only seemed to occur when there there multiple pairs present.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W0YMfYy.jpg\u0022 alt=\u0022W0YMfYy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor this plane I planned to have 2 jenny\u0027s on the AM reactor\u0027s but doing so would give me that NaNMW reading no matter which way I put them on. However what is strange is the process is actually occurring because the AM is being drained, there\u0027s just no output. So I removed those and put a small nuke/jenny combo in the cargo bay, however it failed the first time. I thought maybe it was in issue with how is was mounted, like no fuel crossfeed. I rearranged things and unintentionally reversed the order in which placed each part, jenny first, it then started to work.\u003C/p\u003E\u003Cp\u003ESince getting this thing to work I have noticed something else, unless the antimatter is in the front tanks on the wings the reactors don\u0027t work, and they are for what ever reason reversed, front left tank powers the right wing reactor and vice versa. And one tank alone won\u0027t power both reactors, they only drained from those specific tanks.\u003C/p\u003E\u003Cp\u003ESome seriously buggy stuff has been going on the last 2 days.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2013-10-28T09:50:34Z","Content":"\n\u003Cp\u003EFractal, I\u0027m trying to add the waste heat factor to the solar array wings from the KOSMOS add on (I could just use them as-is, but that would be \u0022cheating\u0022), but I\u0027m apparently missing something.\u003C/p\u003E\u003Cp\u003EI assumed I needed to add .cfg files specific to those parts in the Additions folder, with the appropriate part names, but I\u0027m not sure what else needs to be added.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2013-10-28T10:35:18Z","Content":"\n\u003Cp\u003EIs this current version of this mod backward compatible to 21.1? I don\u0027t upgrade yet because there is a lot of mods and I couldn\u0027t find any nice time to download the new version\u003C/p\u003E\n"},{"CreatedByName":"Sigma52","CreatedById":90369,"CreatedDateTime":"2013-10-28T10:38:19Z","Content":"\n\u003Cp\u003Ecan someone please pm me or link me a reduced texture pack for KSP interstellar, great mod but having a hard time running it.\u003C/p\u003E\n"}]}