{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":280,"Articles":[{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-02-22T06:00:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TomatoSoup\u0022 data-cite=\u0022TomatoSoup\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/3Hjt9Xy.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/3Hjt9Xy.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo let me explain. Both of those engines are active. Deactivating them does not remove the effects. In spite of this, they still behave relatively correctly with two exceptions:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure you\u0027ve got the most recent version of KSPI? I coulda sworn that the plasma engien FX being perminantly on was a bug in the 10.0 release that was fixed in one of the mini patches that came out over the following week. Not sure on your other problem other than possibly a buggy install. Might want to just redownload the mod and reinstall it (after deleating the WarpPlugin folder) Maybe someone else will have a better idea on what could cause that.\u003C/p\u003E\n"},{"CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2014-02-22T07:43:59Z","Content":"\n\u003Cp\u003EDoes the mod have more options for intake precoolers yet besides the giant awkward looking ones?\u003C/p\u003E\n"},{"CreatedByName":"Dealz","CreatedById":104038,"CreatedDateTime":"2014-02-22T09:19:27Z","Content":"\n\u003Cp\u003EI\u0027m just so confused by the parts in this mod. I\u0027ve searched for guides and tutorials but all I\u0027ve really found are this, the wiki, and Scott Manley\u0027s series. I\u0027m not about to page through 700 pages of random posts and the others don\u0027t do much explaining. I\u0027ve unlocked the Thermal rocket nozzles, 2 kinds of reactors, and some generators and radiators. So far the most thrust/weight ratio I could generate was like .6 with a small stock tank, a reactor, and the thermal nozzle (all 1.25 m). Understandable if the parts are meant for upper stages (and maybe they are), but when I switch to a stock engine I get better delta-v and TWR. How did you all figure out how to use this stuff? I\u0027m loving how much there is to learn, I just don\u0027t know how to do it.\u003C/p\u003E\n"},{"CreatedByName":"SorensonPA","CreatedById":59038,"CreatedDateTime":"2014-02-22T12:54:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dealz\u0022 data-cite=\u0022Dealz\u0022\u003E\u003Cdiv\u003EI\u0027m just so confused by the parts in this mod. I\u0027ve searched for guides and tutorials but all I\u0027ve really found are this, the wiki, and Scott Manley\u0027s series. I\u0027m not about to page through 700 pages of random posts and the others don\u0027t do much explaining. I\u0027ve unlocked the Thermal rocket nozzles, 2 kinds of reactors, and some generators and radiators. So far the most thrust/weight ratio I could generate was like .6 with a small stock tank, a reactor, and the thermal nozzle (all 1.25 m). Understandable if the parts are meant for upper stages (and maybe they are), but when I switch to a stock engine I get better delta-v and TWR. How did you all figure out how to use this stuff? I\u0027m loving how much there is to learn, I just don\u0027t know how to do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrial and error, mostly, though it should also be noted that at the point you seem to be at the parts unlocked aren\u0027t going to be useful for flight in and of themselves but rather for long-term utility (a 62.5m fission reactor is absolutly wonderful for super long-term probes where an RTG won\u0027t cut it and solar is dodgy). Upgraded fission reactors are useful for slow-speed atmospheric turbojets, however, and once you upgrade fusion reactors the 1.25 does an even better job at that front and you can reliably use the 2.5 with a vista engine for travel to just about anywhere.\u003C/p\u003E\u003Cp\u003EThermal rocket nozzles are kinda\u0027 weird in recent releases, though: back in the .7 days fissions gave comperable performance to LV-Ns, but Fractal apparently took the nerf bat to them something fierce or added some not-immedietly-apparent condition that gives the appearance of such (someone mentioned something about them doing absolutly horribly in atmospheres, so maybe you need to slingshot the suckers up to 35k or a stable orbit before they become viable). As it is I just used contemporary parts while doing research in Kerbin\u0027s SOI up until I hit upgraded fusion, at which point you can use the vista to go pretty much everywhere with 1.0 gravity or less.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-22T13:34:13Z","Content":"\n\u003Cp\u003EThe \u0022problem\u0022 with thermal rockets is that people test them on the launch pad and assume that they will function exactly the same in space but atmosphere affects a lot of things in Interstellar so testing on the launchpad often produces bad results - heat dissipation is a particularly good example of that. Using mechjeb or engineer or just looking up thrust values on the wiki is a better method of getting accurate readings on what the thermal rockets will actually do.\u003C/p\u003E\n"},{"CreatedByName":"Cassonator","CreatedById":101449,"CreatedDateTime":"2014-02-22T15:37:44Z","Content":"\n\u003Cp\u003EWell I finally completed the tech tree, opening up the alcubiere drive. First mission: slammed jeb into the moon at a squillion mph..... I do love this mod!\u003C/p\u003E\n"},{"CreatedByName":"tmbomber","CreatedById":104086,"CreatedDateTime":"2014-02-22T18:08:15Z","Content":"\n\u003Cp\u003EOk, so I now have three orbital fusion power plants that have their microwave antennas set to relay so the reactors don\u0027t shut down. (I have them breeding tritium while they idle) and I built a fission ground power station to feed the relay network. Here\u0027s a pic:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/uyu3XbK\u0022 alt=\u0022uyu3XbK\u0022\u003E\u003C/p\u003E\u003Cp\u003EI constructed it in the hanger and drove it off the back end of the runway. It\u0027s presently parked a klick or two away from the runway...\u003C/p\u003E\u003Cp\u003EEverything looks alright, except the Mission elapsed timer reads zero and in the tracking station it shows up as Awaiting Launch. I\u0027m not exactly sure how to check, but I don\u0027t think it\u0027s included in my relay network.\u003C/p\u003E\u003Cp\u003EI\u0027m probably missing something obvious here, but does anybody have any idea how to \u0022launch\u0022 what amounts to a rover from the runway???\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"Baleur","CreatedById":9954,"CreatedDateTime":"2014-02-22T19:46:33Z","Content":"\n\u003Cp\u003EIs there a way to disable the Thermal Helper panel that keeps popping up in the VAB every time you enter it or load a spaceship?\u003C/p\u003E\u003Cp\u003EIt\u0027s super annoying when you\u0027re working on stuff that has nothing to do with it, or when you\u0027re just playing the game BEFORE reaching the required techs.\u003C/p\u003E\u003Cp\u003EPlease hide it until the player actually mounts a part that is requiring it, or hide it until we unlock the anti-matter tech or fusion power tech or whatevs.\u003C/p\u003E\u003Cp\u003EOr just add a simple button to the Toolbar plugin and have it hidden by default.\u003C/p\u003E\u003Cp\u003EThanks, great mod otherwise ofc \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-02-22T20:16:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tmbomber\u0022 data-cite=\u0022tmbomber\u0022\u003E\u003Cdiv\u003EOk, so I now have three orbital fusion power plants that have their microwave antennas set to relay so the reactors don\u0027t shut down. (I have them breeding tritium while they idle) and I built a fission ground power station to feed the relay network. Here\u0027s a pic:\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/uyu3XbK\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/uyu3XbK\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI constructed it in the hanger and drove it off the back end of the runway. It\u0027s presently parked a klick or two away from the runway...\u003C/p\u003E\u003Cp\u003EEverything looks alright, except the Mission elapsed timer reads zero and in the tracking station it shows up as Awaiting Launch. I\u0027m not exactly sure how to check, but I don\u0027t think it\u0027s included in my relay network.\u003C/p\u003E\u003Cp\u003EI\u0027m probably missing something obvious here, but does anybody have any idea how to \u0022launch\u0022 what amounts to a rover from the runway???\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EYou seem to have forgotten a vital part in linking the picture... like the link\u003C/span\u003E (edit: not sure why it didnt display in the post, noticed it showing up in the quote) Dont worry about the bit of it saying ready to launch and 0 mission time. Prety much all rover based objects that never leave the ground will say that even if you drive it to the far end of the contenent. Only way to get around that is to actualy stick it on a rocket to fling it down range. Most sure fire way to know if its working though is look at the reactors. if when set to transmit they all crank up to 100% its working asumeing you\u0027ve got a relay in line of site of that spot. Additionaly look to see if the tranciever says its beaming any power. I\u0027ve have had a few issues with sticking the tranciever directly on the generator part in the past. Dispite being turned on it beams no power and the generators sit at their idle speed. Attaching the tranciever to any other part seems to make it work even if you just attach a girder segment to the generator and the tranciever to the girder.\u003C/p\u003E\u003Cp\u003Eedit after seeing the picture. Why do you have a reciever open on that thing? The reciever is open but the deploable transmitter is not deployed. Either way right now you dont actualy need the deployable version on a ground based transmiter, the flat 1 pannle design works just fine for that application. I\u0027m asuming one of those 2 generators is set to direct conversion and the other is thermal? Personaly I\u0027ve always just used the standard fissions for my ground based power plants but I dont see why your method shouldnt work. Try posting a screen shot of that with the right click menu for the transceiver open\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-22T20:24:58Z\u0022 title=\u002202/22/2014 08:24  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 22, 2014\u003C/time\u003E by merendel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dealz","CreatedById":104038,"CreatedDateTime":"2014-02-22T22:58:03Z","Content":"\n\u003Cp\u003EThe impact probe on the first page- I tried building one but it doesn\u0027t have any delta v.\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm Thermal rocket nozzle\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm \u0022safe-1500\u0022 fission reactor\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm electric generator\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm inline radiator\u003C/p\u003E\u003Cp\u003E- (1) Probodyne OKTO\u003C/p\u003E\u003Cp\u003E- plus all the science and comms stuff\u003C/p\u003E\u003Cp\u003EIt won\u0027t ignite, says \u0027flame out- liquid fuel deprived\u0027. I didn\u0027t see any liquid fuel in the picture. What am I missing.\u003C/p\u003E\n"},{"CreatedByName":"acl8610","CreatedById":92631,"CreatedDateTime":"2014-02-22T23:17:48Z","Content":"\n\u003Cp\u003EI really don\u0027t want to be that guy here, but how do you get the the seismic data to work w/re to an impactor.... What do you do? Is it the ship with the seismometer that crashes, or is it a ship that previously landed before the impactor? Also how far, if this is the case, do the ships have to be w/in 2km for the physics or what? It would be nice if the wiki on interstellar explained this. Thanks in advance.\u003C/p\u003E\n"},{"CreatedByName":"Lazermaniac","CreatedById":106,"CreatedDateTime":"2014-02-22T23:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dealz\u0022 data-cite=\u0022Dealz\u0022\u003E\u003Cdiv\u003EThe impact probe on the first page- I tried building one but it doesn\u0027t have any delta v.\u003Cp\u003E- (1) 62.5 cm Thermal rocket nozzle\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm \u0022safe-1500\u0022 fission reactor\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm electric generator\u003C/p\u003E\u003Cp\u003E- (1) 62.5 cm inline radiator\u003C/p\u003E\u003Cp\u003E- (1) Probodyne OKTO\u003C/p\u003E\u003Cp\u003E- plus all the science and comms stuff\u003C/p\u003E\u003Cp\u003EIt won\u0027t ignite, says \u0027flame out- liquid fuel deprived\u0027. I didn\u0027t see any liquid fuel in the picture. What am I missing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPut an actual liquid fuel tank on it - the idea here is the reactor heats up whatever reaction mass you give it, causing it to expand and spray out the nozzle, instead of having to use oxidizer. The lighter the molecules, the higher the exhaust speed, the more ISP you get. Liquid Fuel is assumed to be hydrogen, so it\u0027ll get you the highest possible ISP.\u003C/p\u003E\n"},{"CreatedByName":"db48x","CreatedById":66108,"CreatedDateTime":"2014-02-22T23:44:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022acl8610\u0022 data-cite=\u0022acl8610\u0022\u003E\u003Cdiv\u003EI really don\u0027t want to be that guy here, but how do you get the the seismic data to work w/re to an impactor.... What do you do? Is it the ship with the seismometer that crashes, or is it a ship that previously landed before the impactor? Also how far, if this is the case, do the ships have to be w/in 2km for the physics or what? It would be nice if the wiki on interstellar explained this. Thanks in advance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe seismometer won\u0027t be able to record anything if you destroy it, so obviously it has to be on the lander. Right-click on it and set it to record. Next, fly your impactor craft into the ground anywhere on the same body as the lander at 40m/s or higher. Penultimately, return to your lander to collect the data. Ultimately edit the wiki to include any information that you feel may be appreciated by others.\u003C/p\u003E\n"},{"CreatedByName":"acl8610","CreatedById":92631,"CreatedDateTime":"2014-02-22T23:55:21Z","Content":"\n\u003Cp\u003EI did that, exactly that. Is there another followup step afterwards that I am missing? Or is there a bug that I am not aware of. Thank you for your prompt response, db48x as it is appreciated. \u003C/p\u003E\u003Cp\u003EEdit: Just did exactly this again, nothing happens. Known bugs?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T00:40:02Z\u0022 title=\u002202/23/2014 12:40  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by acl8610\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ricardo.b","CreatedById":76238,"CreatedDateTime":"2014-02-23T00:04:54Z","Content":"\n\u003Cp\u003EREPOST:\u003C/p\u003E\u003Cp\u003Eim having bugs with science experiments. the magnetometer does not show up the science experiment GUI and deep filed survey shows its GUI but when clicked, nothing happens.\u003C/p\u003E\u003Cp\u003Ethis bug from the magnetometer followed me from update 0.22, 0.23 with latest interstellar mod still not showing the experiment action buttom\u003C/p\u003E\u003Cp\u003Ethanks for any help\u003C/p\u003E\n"},{"CreatedByName":"acl8610","CreatedById":92631,"CreatedDateTime":"2014-02-23T00:54:25Z","Content":"\n\u003Cp\u003EI\u0027m doing the same thing that this guy is doing... Start the video at 23:50 and watch until the glitch he has on the tooltip after the impact, about at 24:45 or so...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/1taG41O8lww?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T00:56:52Z\u0022 title=\u002202/23/2014 12:56  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by acl8610\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SV-ESK","CreatedById":103390,"CreatedDateTime":"2014-02-23T01:58:57Z","Content":"\n\u003Cp\u003EImpactor must be active vessel. You have to control it when it crash, rather than watching from the surface or from orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T02:10:24Z\u0022 title=\u002202/23/2014 02:10  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by SV-ESK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tmbomber","CreatedById":104086,"CreatedDateTime":"2014-02-23T02:38:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022merendel\u0022 data-cite=\u0022merendel\u0022\u003E\u003Cdiv\u003Eafter seeing the picture. Why do you have a reciever open on that thing? The reciever is open but the deploable transmitter is not deployed. Either way right now you dont actualy need the deployable version on a ground based transmiter, the flat 1 pannle design works just fine for that application. I\u0027m asuming one of those 2 generators is set to direct conversion and the other is thermal? Personaly I\u0027ve always just used the standard fissions for my ground based power plants but I dont see why your method shouldnt work. Try posting a screen shot of that with the right click menu for the transceiver open\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the information about the mission timer... good to know it\u0027s something I don\u0027t have to worry about.\u003C/p\u003E\u003Cp\u003EThe deployable tranceiver is actually set to transmit. It folds up when I switch to it. There\u0027s nothing out in the network at the moment actually drawing power. \u003C/p\u003E\u003Cp\u003EThe open receiver is a carryover from the fusion power stations... they need a power source for when they shut down and need re-starting. Sticking a receiver on was a quick and easy solution. It was included on this station without thinking about it. \u003C/p\u003E\u003Cp\u003EBoth generators are set to direct conversion... as I was building it I put out the control, then the generator, then the reactor. For an orbital craft the nozzle would come next but I didn\u0027t need one of those... not knowing what to stick on there next I copied the generator, then added the science lab and antimatter containment...\u003C/p\u003E\u003Cp\u003EI\u0027ll be running a truck out to the thing to harvest the antimatter. Then recovering the reactor and re-launching (well.... rolling) this reactor with the single panel microwave transceiver. \u003C/p\u003E\u003Cp\u003EThis has turned into a bit of a side issue... getting impactor data from Eve it turning out to be a pain. (getting a 40m/s impact is rough because the atmosphere is so thick, and the impactors I sent have the wrong antennas, among other issues...\u003C/p\u003E\u003Cp\u003E\u0026lt;sigh\u0026gt;... at least it\u0027s keeping me off the streets at night \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tmbomber","CreatedById":104086,"CreatedDateTime":"2014-02-23T03:44:22Z","Content":"\n\u003Cp\u003EOh, here\u0027s a link to the album showing the updated Nuke Truck: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/L4hG0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/L4hG0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(posted without html tags in the hope that this one works)\u003C/p\u003E\n"},{"CreatedByName":"SVoyager","CreatedById":57670,"CreatedDateTime":"2014-02-23T05:09:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baleur\u0022 data-cite=\u0022Baleur\u0022\u003E\u003Cdiv\u003EIs there a way to disable the Thermal Helper panel that keeps popping up in the VAB every time you enter it or load a spaceship?\u003Cp\u003EIt\u0027s super annoying when you\u0027re working on stuff that has nothing to do with it, or when you\u0027re just playing the game BEFORE reaching the required techs.\u003C/p\u003E\u003Cp\u003EPlease hide it until the player actually mounts a part that is requiring it, or hide it until we unlock the anti-matter tech or fusion power tech or whatevs.\u003C/p\u003E\u003Cp\u003EOr just add a simple button to the Toolbar plugin and have it hidden by default.\u003C/p\u003E\u003Cp\u003EThanks, great mod otherwise ofc \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed I would love to know this too. The panel is great, useful and all but I kinda only need it once my craft is mostly completed to confirm if the design is valid. However since it pops every time I get in the VAB, its kinda in the way.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-02-23T05:40:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tmbomber\u0022 data-cite=\u0022tmbomber\u0022\u003E\u003Cdiv\u003EOh, here\u0027s a link to the album showing the updated Nuke Truck: \u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/L4hG0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/L4hG0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(posted without html tags in the hope that this one works)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Efor future referance if you want to imbed an album you can use the \u0022imgur\u0022 tag around just the last section of the URL. in your case remove the white space from this line just after the brackets of this line\u003C/p\u003E\u003Cp\u003E[ imgur]L4hG0[ /imgur]\u003C/p\u003E\u003Cp\u003Ethe result is this.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/L4hG0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I\u0027m aware 2 direct conversion generators on a single reactor is redundant. They are both eating half of the same pool of charged particals while a single one could do the whole thing. The point of doing 2 generators on a reactor that produces both charged and thermal power is to have one useing the charged and the other useing the thermal. Right now your only useing the charged and wasteing the thermal power. If one of those was a solid state it would be producing an additional 750 or so MW on top of the 5.23GW your direct conversion would produce on its own.\u003C/p\u003E\u003Cp\u003Eby the tooltip on the phased array tranciever it looks like its transmiting the power. Note that if you have that set to transmit it does not mater if theres anything else in the universe asking for power or not, it should kick the generator up to 100% and keep it there as well as consuming everything your system can produce. Also theres a bit of wonkieness with transmiting with more than 1 generator in the current version. The transmiter seems to get confused as to how much power it should be transmiting. I\u0027ve not been able to determin if this is just a display issue or if its actualy transmiting more power than you actualy have.\u003C/p\u003E\u003Cp\u003EBTW I slaped togeather the same setup you have there and one with a solid state for the second gen. I got the same result as you with 2 direct conversions. note that 5gw is going to your science lab not leaving much leftover to transmit. about 440 MW or so. with the 1 direct and 1 solid state the generator kicks up to 100% and leaves almost 2gw leftover to transmit.\u003C/p\u003E\u003Cp\u003EAlso for impactor on eve try to aim for the mountain tops. 40 is a bit rough if your aiming down at sea level but even there it shouldnt be more than a powered decent can handle. Try makeing the impactor out of just a small fuel tank, a probe core, and a rockomax 48-7s. the TWR on that little thing is crazy for a light probe. just use enough DV to start the deorbit then point prograde and burn for the ground the last 1000m or so. if thats still not enough to get sufficent speed I\u0027d probably go with a ring of 24-77s (radial orange) lightweight and they have alot of oomph if you stick enough of them on something.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T06:18:13Z\u0022 title=\u002202/23/2014 06:18  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by merendel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ABZB","CreatedById":98947,"CreatedDateTime":"2014-02-23T06:12:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SVoyager\u0022 data-cite=\u0022SVoyager\u0022\u003E\u003Cdiv\u003EIndeed I would love to know this too. The panel is great, useful and all but I kinda only need it once my craft is mostly completed to confirm if the design is valid. However since it pops every time I get in the VAB, its kinda in the way.\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPress \u0027I\u0027 to toggle\u003C/p\u003E\n"},{"CreatedByName":"SVoyager","CreatedById":57670,"CreatedDateTime":"2014-02-23T08:06:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ABZB\u0022 data-cite=\u0022ABZB\u0022\u003E\u003Cdiv\u003EPress \u0027I\u0027 to toggle\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I tried that already. Does the same as you would close a normal window (X button). As with the \u0022I\u0022 toggle, it will come back on next VAB reload. Just wished that it would start as being closed and stay that way until I need it, rather than being the other way around right now. Not a huge issue tho but would be nice still\u003C/p\u003E\n"},{"CreatedByName":"a__gun","CreatedById":83859,"CreatedDateTime":"2014-02-23T08:09:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SVoyager\u0022 data-cite=\u0022SVoyager\u0022\u003E\u003Cdiv\u003EYeah I tried that already. Does the same as you would close a normal window (X button). As with the \u0022I\u0022 toggle, it will come back on next VAB reload. Just wished that it would start as being closed and stay that way until I need it, rather than being the other way around right now. Not a huge issue tho but would be nice still\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty sure Fractal said somewhere he would implement toolbar support soon - guess that will solve your problem\u003C/p\u003E\n"},{"CreatedByName":"DailyFrankPeter","CreatedById":101850,"CreatedDateTime":"2014-02-23T10:56:50Z","Content":"\n\u003Cp\u003EHi Fractal, \u003C/p\u003E\u003Cp\u003EI figured out what is wrong with my microwave launch system. It seems that if both receiver and transmitter are on Kerbin\u0027s surface the code assumes that the signal has 2x the atmosphere thickness to travel, even if it is not bounced of any relay but the transmitter is literally butted against the receiver - is that correct? Would you consider changing that if it is?\u003C/p\u003E\u003Cp\u003EThanks and it\u0027s a great mod you\u0027ve got there!\u003C/p\u003E\n"}]}