{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":235,"Articles":[{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2014-01-28T20:45:30Z","Content":"\n\u003Cp\u003EIt would seem that i have found another strange issue. On some of my interplanetary ships powered by thermal nozzles and reactors, the thrust per nozzle is stuck at 500KN and Isp at 1000, it doesn\u0027t help whatever i try to switch fuel modes. Also, reactors that power these nozzles never throttle up, nor is any thermal power used. This is very annoying on my latest Jool ship that has 2 3.75m upgraded reactors. I tried to shutdown and restart the reactors, but no help from that. Payload has also one 1.25m reactor/generator for power production and support the landing stages fusion-thermal engines.\u003C/p\u003E\u003Cp\u003EAs a comparison, another ship with just one 3.75m reactor/nozzle had no problem, tho once the ship loads, nozzle shows some base stats, but touch of throttle will restore the correct value (like it \u0027reads\u0027 the reactor at that point).\u003C/p\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2014-01-28T22:02:12Z","Content":"\n\u003Cp\u003EAn idea to include for version .10 Fractal: Allow us to set a cap on the power we want going into our receivers (it means i don\u0027t burn all my fuel at once XD)\u003C/p\u003E\n"},{"CreatedByName":"Lightwarrior","CreatedById":93585,"CreatedDateTime":"2014-01-28T22:37:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022merendel\u0022 data-cite=\u0022merendel\u0022\u003E\u003Cdiv\u003Eya 40m/s was a bit scarry and I did wreck one that way. dont hit any inclination changes going that fast. It may also depend on what you use for wheels, I was useing those extra long heavy landing gear from B9 and those can take a fair bit of punishment. I placed 3 out there although I\u0027m thinking of shuting one or two down unless I need to do exceptionaly heavy launches or long distance transmissions. \u003Cp\u003E...\u003C/p\u003E\u003Cp\u003Eturns out the 80-90GW I\u0027m geting near kerbin is a bit too much. 4 medium radiators that I was useing on my current ship designes cant keep up with that much WH and will fill from empty to full in a few minutes. That and I\u0027m geting far too much thrust. I cant set thrust low enough to hover or slowly decend on the mun for a manual landing and Mechjeb just spazes out if I try to tell it to land it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Seriously geting 6g\u0027s of acceleration at full throttle on a 17t ship useing liquid fuel was just crazy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust stock landing gear. Lots of them. One for every reactor.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EYes, it is a problem, you need to shutdown receivers immediately after burn. And choose right engine size for you craft to limit power. I have deadly reentry installed and killed Jeb many times because of either over G or overheat.\u003C/p\u003E\u003Cp\u003EAlso i got few funny things like negative generator efficiency while playing with this.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2014-01-28T22:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EIt would seem that i have found another strange issue. On some of my interplanetary ships powered by thermal nozzles and reactors, the thrust per nozzle is stuck at 500KN and Isp at 1000, it doesn\u0027t help whatever i try to switch fuel modes. Also, reactors that power these nozzles never throttle up, nor is any thermal power used. This is very annoying on my latest Jool ship that has 2 3.75m upgraded reactors. I tried to shutdown and restart the reactors, but no help from that. Payload has also one 1.25m reactor/generator for power production and support the landing stages fusion-thermal engines.\u003Cp\u003EAs a comparison, another ship with just one 3.75m reactor/nozzle had no problem, tho once the ship loads, nozzle shows some base stats, but touch of throttle will restore the correct value (like it \u0027reads\u0027 the reactor at that point).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPost a picture of the craft please.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-01-28T23:12:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boamere\u0022 data-cite=\u0022Boamere\u0022\u003E\u003Cdiv\u003EAn idea to include for version .10 Fractal: Allow us to set a cap on the power we want going into our receivers (it means i don\u0027t burn all my fuel at once XD)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid there definitely won\u0027t be any new features going into Interstellar 0.10 beyond what has already been announced. It has been over a month since the last update so I\u0027m really trying to get everything finalised for a release. Maybe I\u0027ll do something like that in later versions.\u003C/p\u003E\n"},{"CreatedByName":"not-a-cylon","CreatedById":63398,"CreatedDateTime":"2014-01-29T01:23:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EI\u0027m afraid there definitely won\u0027t be any new features going into Interstellar 0.10 beyond what has already been announced. It has been over a month since the last update so I\u0027m really trying to get everything finalised for a release. Maybe I\u0027ll do something like that in later versions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Esweet!!! I\u0027ve been really following your mod\u0027s page day by day, awaiting announcements on KSPI 0.10. Thanks for your all your hard work! I can\u0027t imagine playing KSP without this mod anymore. I can safely say that I am a rabid KSPI fan now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Eas a side note to those of you frustrated/clueless KSPI beginnners out there- I started playing KSPI about a month ago and was very very frustrated with trying to learn all the different nuances of the mod. Go and read the wiki front to back. It will really help you get enough of a grasp and give you enough confidence to experiment with the multitude of parts in this mod.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-01-29T03:24:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xfrankie\u0022 data-cite=\u0022xfrankie\u0022\u003E\u003Cdiv\u003EThat was kind of the point of my post, it doesn\u0027t have to be overly realistic to be fun to play. (sorry if you didn\u0027t understand me, english isn\u0027t my 1st language)\u003Cp\u003EThere is a sort of cone of about 30 or so degrees to each side where your reciever retains its best efficiency (might be wrong, I tested it only with the largest deploayble things).\u003C/p\u003E\u003Cp\u003EMy idea is to put recievers on the ship\u0027s nose, launch when orbital relay flies overhead and \u0022chase it\u0022 with the pitch as I make the gravity turn. You don\u0027t have to point directly towards it, because as long as it remains in the recievers \u0022cone\u0022, it will give you max power.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did exactly that for a recent launch of a fuel tanker (it relied on microwave power for SAS, as it was a HUGE tanker with very high SAS requirements- and a dish is lighter than most reactors). It works great- except you need to launch quite a bit BEFORE the satellite/relay is directly overhead (but after it\u0027s in-range), as most (efficient TWR) rockets climb too slowly to follow it with the pitch of their gravity turn early on...\u003C/p\u003E\u003Cp\u003EAlso, Fractal, I don\u0027t mean to sound demanding- but I\u0027ve made a hobby of building Duna spaceplanes lately... What are the chances we could eventually see 2.5 meter or even 3.75 or 5 meter version of the RAM intake, as a component of the KSP-I mod? Also, would we need larger-diameter pre-coolers to go along with it? (I liked having the 2.5 meter atmospheric intakes to couple with 1.25 meter Thermal Turbojets before- it really helps with flight in EXTREMELY thin atmospheres like Duna\u0027s... Similarly, a 5 meter intake for a 2.5 meter Thermal Turbojet would be a good combination...)\u003C/p\u003E\u003Cp\u003EAt least answer the pre-cooler question. Since B9 Aerospace still has 2.5 meter SABRE intakes, and I will be coupling the B9 2.5 meter intakes to my Thermal Turbojets when I unlock them... I need to know how I can pre-cool that air...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T03:31:29Z\u0022 title=\u002201/29/2014 03:31  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skiparay","CreatedById":75467,"CreatedDateTime":"2014-01-29T04:37:15Z","Content":"\n\u003Cp\u003EHey there,\u003C/p\u003E\u003Cp\u003ESo I\u0027ve been experimenting around with the thermal turbojets and I have to say that the animation and design of these engines is, to coin a phrase, \u0022Totally Flipping Awesome\u0022. So I was wondering if it would be possible to make a variant that\u0027s just a pure jet engine? Assuming I\u0027m allowed to do so by the EULA, do I need to edit the source code to do this?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-01-29T05:56:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lightwarrior\u0022 data-cite=\u0022Lightwarrior\u0022\u003E\u003Cdiv\u003EYes, it is a problem, you need to shutdown receivers immediately after burn. And choose right engine size for you craft to limit power. I have deadly reentry installed and killed Jeb many times because of either over G or overheat.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eya I had several ships out that I designed prior to deploying the nuke train. They were perfect for the old power levels while cruising around the kerbin SOI but were a bit... intresting to control when I started shunting that much power into them. I made the closest approximation of a Z95 headhunter I could with the parts available (think Xwing without the ability to split the X foils) Looks mostly alright except I had to compromise on looks to put radiators on it as well as a few control surfaces that dont belong on a z95. Pair of 1.25\u0027s for main drive with a pair of the tiny ones nestled underneath the center of mass for Vtol ability. with 4-5GW available I could actualy hover on lithium from the runway on the tinys. Bout 12m/s acceleration at max throttle now. the extra power is totaly throwing off the thrust to weight and I\u0027ll probably have to do a redesign. Incidentaly it is really a pain to not only ballance the center of mass over a secondary engine to allow Vtol but to make sure that center of mass does not shift much as fuel is burnt.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ZSYsA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThrust ends up being slightly off in both flight modes but close enough for SAS to compensate. Vtol is a bit more twitchy if the liquid tanks are low as I could not completely balance things. Still on the launch pad it has 6.5k dv on lithium, 8.6k on liquid and in a pinch about 1k off the mono. Can easily go just about anywhere on that and have a port on the back to attach extra fuel canisters that I can just leave in orbit if I want to land somewhere. Also could hook a couple relay sats onto those spare fuel tanks if I wanted to use this as a delivery vessel for a network around another planet/moon.\u003C/p\u003E\u003Cp\u003EOh and fractal I second the request to add the option to throttle the receiver input when you get around to it. Would be nice to be able to setup a powerful network that wont fry a small probe without makeing 95% of its mass radiators. Alternatively have only the requested amount of power beamed to the ship, not the total available to the network. I\u0027d still prefer a manual limit however to allow more consistent handling characteristics as power grid expands.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T06:09:10Z\u0022 title=\u002201/29/2014 06:09  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by merendel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2014-01-29T06:07:44Z","Content":"\n\u003Cp\u003EGot the first episode of my KSPI Tutorial uploaded.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/fwoU71JvKKs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI\u0027ll be recording some more tonight, and fixing some issues I had with the recording (Such as barely being able to hear me)\u003C/p\u003E\n"},{"CreatedByName":"Lightwarrior","CreatedById":93585,"CreatedDateTime":"2014-01-29T06:29:49Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Emerendel \u003C/strong\u003E,\u003C/p\u003E\u003Cp\u003ENice crafts, and really nice way to integrate those hexcans into design without ruinin it.\u003C/p\u003E\u003Cp\u003EI am using argon because i took tanks fron Near Future Propulsion, corrected volume and resouce (changed to argon from ArgonGas) and they are awesome. Without it argon is almost unusable.\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-01-29T06:43:20Z","Content":"\n\u003Cp\u003Ehmm I havent had any issues with makeing use of agron in the current tanks other than being impossible to mount radialy (short of the radial adaptor and makeing a sideways stack) I just treat them as a 2.5 tank, stack a few on top of eachother and call it good. I\u0027ve got a sub assembly with a stack of 6 tanks, 2 recievers and 2 radiators on top of a 2.5 plasma I\u0027ve been useing as a launch stage, that will push most payloads my network can lift up to orbital velocity.\u003C/p\u003E\n"},{"CreatedByName":"TheTom","CreatedById":99271,"CreatedDateTime":"2014-01-29T07:30:27Z","Content":"\n\u003Cp\u003ENice tutorial, more please. Nice crafts.\u003C/p\u003E\u003Cp\u003EBut PLLLLEEEEAAAASSEEEEE turn off ambient or turn it way down. When the music starts, it is louder than your voice making it extremely hard to just listen. One has to actively try to understand. In tutorials, background sounds - and that includes engine noise - should always be significantly less than the speaking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut more please - also about different aspects \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Lovely thing. I was quite shocked how efficientit was in terms of used fuel.\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2014-01-29T07:34:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheTom\u0022 data-cite=\u0022TheTom\u0022\u003E\u003Cdiv\u003ENice tutorial, more please. Nice crafts.\u003Cp\u003EBut PLLLLEEEEAAAASSEEEEE turn off ambient or turn it way down. When the music starts, it is louder than your voice making it extremely hard to just listen. One has to actively try to understand. In tutorials, background sounds - and that includes engine noise - should always be significantly less than the speaking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut more please - also about different aspects \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Lovely thing. I was quite shocked how efficientit was in terms of used fuel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was one of the first videos I\u0027ve done in a while. I\u0027m getting better, my second video is alot better in terms of sound. Please hit me up with more suggestions, if I get something wrong \u003Cem\u003EPLEASE\u003C/em\u003E correct me. Fractul_UK, I may be hitting you up more in PMs to try and figure things out (Would love to do v10 tutorials)\u003C/p\u003E\n"},{"CreatedByName":"Lightwarrior","CreatedById":93585,"CreatedDateTime":"2014-01-29T07:57:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022merendel\u0022 data-cite=\u0022merendel\u0022\u003E\u003Cdiv\u003Ehmm I havent had any issues with makeing use of agron in the current tanks other than being impossible to mount radialy (short of the radial adaptor and makeing a sideways stack) I just treat them as a 2.5 tank, stack a few on top of eachother and call it good. I\u0027ve got a sub assembly with a stack of 6 tanks, 2 recievers and 2 radiators on top of a 2.5 plasma I\u0027ve been useing as a launch stage, that will push most payloads my network can lift up to orbital velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E2.5m tank is ok. And it is ok for LV-s from kerbin.\u003C/p\u003E\u003Cp\u003EBut without 1.25m, 0.625m and radial tanks it is really hard to build small crafts using argon. Small lander for example.\u003C/p\u003E\u003Cp\u003EAnd other than argon... lithium hexcan is not very convinient too, xenon tanks are way too small, and LFO tanks will always be half empty (with oxidizer removed). Not very good choice... so i just took those awesome tanks, calculated what amount of KSPI argon they should have using similar to those available in KSPI 2.5m tank and edited cfg-s accordingly.\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2014-01-29T08:54:05Z","Content":"\n\u003Cp\u003EPart 2 of my tutorials. I\u0027m getting better at making these. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/QzcUFwZ34sA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"TheTom","CreatedById":99271,"CreatedDateTime":"2014-01-29T09:28:59Z","Content":"\n\u003Cp\u003EOk, in short - much better. But the moment your launcher drops the SRB your voice volume goes close to zero and is again lower than the engine sound nearly. And both on a very low level.\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2014-01-29T09:50:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheTom\u0022 data-cite=\u0022TheTom\u0022\u003E\u003Cdiv\u003EOk, in short - much better. But the moment your launcher drops the SRB your voice volume goes close to zero and is again lower than the engine sound nearly. And both on a very low level.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh. Well, I did cut back over to the original audio after the SRBs dropped off. It seems Fraps isn\u0027t good at getting audio so I\u0027ll just stick to adding audio during post edit. I\u0027m still learning Adobe Premier so it\u0027s a work in progress.\u003C/p\u003E\n"},{"CreatedByName":"effy","CreatedById":77392,"CreatedDateTime":"2014-01-29T10:19:24Z","Content":"\n\u003Cp\u003EWhile experimenting with the Thermal Rocket Nozzle I have run into a small issue. When using the Thrust Limiter, it appears that both the thrust of the Nozzle as well as the power output of the attached reactor get reduced. So if i set the limit to 50, the thrust provided by the engine actually decreases to one-fourth of the maximum. While mostly this isn\u0027t a problem, it means that when using an antimatter reactor it uses more antimatter to get the same deltaV the lower you set the limit. Can anybody else confirm this behaviour, and is it intended?\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-01-29T12:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lightwarrior\u0022 data-cite=\u0022Lightwarrior\u0022\u003E\u003Cdiv\u003E2.5m tank is ok. And it is ok for LV-s from kerbin.\u003Cp\u003EBut without 1.25m, 0.625m and radial tanks it is really hard to build small crafts using argon. Small lander for example.\u003C/p\u003E\u003Cp\u003EAnd other than argon... lithium hexcan is not very convinient too, xenon tanks are way too small, and LFO tanks will always be half empty (with oxidizer removed). Not very good choice... so i just took those awesome tanks, calculated what amount of KSPI argon they should have using similar to those available in KSPI 2.5m tank and edited cfg-s accordingly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess it depends a bit on how much dV your going for and what shape your going for. I\u0027ve made a few lithium based probes by makeing the hex can itself into the rocket body. Engine on one end probe/payload on the other with receivers and radiators on the side of the can and it worked fine. Not sure why you\u0027d want to use a LFO tank unless you were building really big. the stock Mk1 jet fuselage had about 5k delta on a 16 ton craft 8k on a 10 ton and 21 on a 4.3 ton. unless your moving something quite bulky you can get way beyond the dV requirements to get anywhere just strapping a couple of those on. I did a quick test by attaching 6 symmetry of those tanks around a 7th central tank and got 13k dv on a craft with a total weight of 46.9t (6 uranium cans attached to drive weight up for the test)\u003C/p\u003E\u003Cp\u003EThen theres my science probe design. 2 of each experiment a reaction wheel, prob and RTG\u0027s, the radiators and recievers, 4 symetry lithium tanks around the jet tank on top of the 1.5 plasma. 18k dv on lithium 10k on liquid. total mas about 8 tons and you can prety much send it anywhere in the system and have it return if you can beam sufficient power to that location.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tU6122q.png\u0022 alt=\u0022tU6122q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyou could replace the probe core with a lander can and get only slightly less performance. I guess I\u0027m just not sure what your trying to acomplish as a lightweight lander they work very nicely for and heavier things you can build around a 2.5m rocket core and argon works if you need the thrust. Then agian I\u0027m also runing KW rocketry and have access to 2.5 and 3.75 versions of the pure liquid tank if I\u0027m makeing a really heavy liquid fuel rocket.\u003C/p\u003E\n"},{"CreatedByName":"xfrankie","CreatedById":93378,"CreatedDateTime":"2014-01-29T12:39:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EI did exactly that for a recent launch of a fuel tanker (it relied on microwave power for SAS, as it was a HUGE tanker with very high SAS requirements- and a dish is lighter than most reactors). It works great- except you need to launch quite a bit BEFORE the satellite/relay is directly overhead (but after it\u0027s in-range), as most (efficient TWR) rockets climb too slowly to follow it with the pitch of their gravity turn early on...\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends on orbital period of your relay (how high the orbit is, if you want), I have mine on 1 hour orbit (semimajor axis = 1.05055Mm) so I have enough time to launch. If the relays fly too quickly for you to catch up, shift them into higher orbit - or launch more of them so you have better coverage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T12:41:33Z\u0022 title=\u002201/29/2014 12:41  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by xfrankie\u003C/strong\u003E\n\u003Cbr\u003EI can\u0026#039;t spell...\n\u003C/span\u003E\n"},{"CreatedByName":"AeroEngy","CreatedById":92772,"CreatedDateTime":"2014-01-29T13:25:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jivaii\u0022 data-cite=\u0022Jivaii\u0022\u003E\u003Cdiv\u003EPart 2 of my tutorials. I\u0027m getting better at making these. \u003Cp\u003E\u003Ca href=\u0022https://youtu.be/QzcUFwZ34sA\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/QzcUFwZ34sA\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA couple of things about your videos. First thanks for taking the time to make these. A series of video tutorials could be very useful to those new to KSPI. The following is meant to be constructive feedback, I am not trying to offend, and I am thankful you took the time to make these.\u003C/p\u003E\u003Cp\u003EIn general I would recommend trying to keep in mind the people seeking out these videos likely will be the most inexperienced. So try to start from the most basic items and work your way up. For example, in your first video you jump right into launching something using a microwave relay network which was never explained before hand. Then you later give a brief explanation of the network which is a bit backwards. For someone new to KSPI they would be completely lost for the first 1/2 of your video and then still slightly confused because they don\u0027t know the ins \u0026amp; outs of reactors, generators, receivers, transmitters, etc. \u003C/p\u003E\u003Cp\u003EFor that tutorial you probably should have first describe the function of the basic parts, how reactors need generators, etc. Then show \u0026amp; explain your ground based power stations \u0026amp; transmitters. Next talked about how receivers work (they must be pointed at a relay or received power drops off, etc.). Then talk about using orbital relay networks to account for this. Lastly show using said network to actually do something useful like finally launching something via plasma. Covering it more in depth would have taken longer so breaking it down into smaller tutorials might be beneficial. One covering parts \u0026amp; their interactions, one showing power generation and building of a relay network, one using a network to launch crafts, etc.\u003C/p\u003E\u003Cp\u003EMy last point is that I think you have some inaccuracies in your second video. You talk about efficiency is a function of the amount of waste heat in the reactor vs the radiator which isn\u0027t really correct although it sort of is related. The actual efficiency is based on temperature which for a thermal generator is (1-Tc/Th)*percentage of carnot efficiency. Where Tc is your radiator temperature, Th is the reactor temp, and percentage of carnot efficiency varies depending on upgrade generator or not (31% or 60% upgraded). I don\u0027t know the correlation of wasteheat and part temp or how the above changes when you start using direct conversion \u0026amp; charged particles ...\u003C/p\u003E\n"},{"CreatedByName":"Lightwarrior","CreatedById":93585,"CreatedDateTime":"2014-01-29T13:43:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Emerendel \u003C/strong\u003E,\u003C/p\u003E\u003Cp\u003EJust experimenting with tiny landers being able to land on any planet/moon, get some science and return to orbit for docking with bigger ship. As example:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/M6Lngh9\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/M6Lngh9.jpg\u0022 alt=\u0022M6Lngh9.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/BQ05qAg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BQ05qAg.jpg\u0022 alt=\u0022BQ05qAg.jpg\u0022\u003E\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EFirst is monopropellant based, according to test results it has ~10k dV and weight is ~5.7T.\u003C/p\u003E\u003Cp\u003ESecond is using argon, it has similar dV (a bit lower actually) and ~5.1T weight.\u003C/p\u003E\u003Cp\u003EMain problem with monoprop is terrible efficiency, 0.625m thruster uses ~6GW to produce ~220KN, instead ~4GW and ~250KN for argon. So using it is still acceptable, but i just do not like to use something definetely worse because i have no apropriate tank for argon...\u003C/p\u003E\u003Cp\u003EAlso 1.25m LF tank is not available, it is somewhere in aircraft related nodes, which i skipped for now:( (this tank is terrible anyway, similar size LFO tank with removed oxidizer will be more weight-efficient).\u003C/p\u003E\u003Cp\u003EThe plan is to use it with 3.75m fission reactor \u002B DT Vista based \u0022mothership\u0022, which will have enough power to beam it directly to lander, without using any relays or huge power stations on kerbin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T15:04:09Z\u0022 title=\u002201/29/2014 03:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Lightwarrior\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-01-29T16:56:36Z","Content":"\n\u003Cp\u003E@lightwarrior have you considered a design more like this?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8l49fXO.png\u0022 alt=\u00228l49fXO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E26k or so dV off lithium 6t mass. I was only geting 2.25GW on the launch pad from an orbiting mothership with just an upgraded big nuke/generator runing UF and the transmiter. off that I was geting a positively anemic 10.09m/s^2 off the lithium About 14 off the mono prop. by 8k altitude power supply had goten up nearly to 3gw and I was geting about 14 off the lithium. this lander would probably work everywhere but eve thanks to the high gravity and thick atmosphere blocking part of your power potential. laythe would probably be a bit easier than kerbin although still anemic thrusts. Tylo shouldent be a problem thanks to its lack of atmosphere as long as you had your mother ship on an orbit that would linger long enough as will take a while to reach orbital velocity unless you\u0027ve managed to pack more power than my test rig had. \u003C/p\u003E\u003Cp\u003EDispite clameing to transmit 4gw I couldnt manage to recieve more than 3gw once out into space. If runing off thorium to get 6gw, hopefuly geting 4.5 or so in vacume and 3 or so on the ground you could probably do a grand tour with only eve beeing the slightest bit in question although you could use the mono to get partialy out of the thick portion of atmosphere befor going lithium. Idealy though I\u0027d say either bring a few fusions along on the mother ship or just pack a second fission so you can get more power and thrust. 6gw and that could land anywhere.\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2014-01-29T17:11:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AeroEngy\u0022 data-cite=\u0022AeroEngy\u0022\u003E\u003Cdiv\u003EA couple of things about your videos. First thanks for taking the time to make these. A series of video tutorials could be very useful to those new to KSPI. The following is meant to be constructive feedback, I am not trying to offend, and I am thankful you took the time to make these.\u003Cp\u003EIn general I would recommend trying to keep in mind the people seeking out these videos likely will be the most inexperienced. So try to start from the most basic items and work your way up. For example, in your first video you jump right into launching something using a microwave relay network which was never explained before hand. Then you later give a brief explanation of the network which is a bit backwards. For someone new to KSPI they would be completely lost for the first 1/2 of your video and then still slightly confused because they don\u0027t know the ins \u0026amp; outs of reactors, generators, receivers, transmitters, etc. \u003C/p\u003E\u003Cp\u003EFor that tutorial you probably should have first describe the function of the basic parts, how reactors need generators, etc. Then show \u0026amp; explain your ground based power stations \u0026amp; transmitters. Next talked about how receivers work (they must be pointed at a relay or received power drops off, etc.). Then talk about using orbital relay networks to account for this. Lastly show using said network to actually do something useful like finally launching something via plasma. Covering it more in depth would have taken longer so breaking it down into smaller tutorials might be beneficial. One covering parts \u0026amp; their interactions, one showing power generation and building of a relay network, one using a network to launch crafts, etc.\u003C/p\u003E\u003Cp\u003EMy last point is that I think you have some inaccuracies in your second video. You talk about efficiency is a function of the amount of waste heat in the reactor vs the radiator which isn\u0027t really correct although it sort of is related. The actual efficiency is based on temperature which for a thermal generator is (1-Tc/Th)*percentage of carnot efficiency. Where Tc is your radiator temperature, Th is the reactor temp, and percentage of carnot efficiency varies depending on upgrade generator or not (31% or 60% upgraded). I don\u0027t know the correlation of wasteheat and part temp or how the above changes when you start using direct conversion \u0026amp; charged particles ...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually the exact kind of response I\u0027ve been wanting, because how can I improve if someone isn\u0027t willing to correct me?\u003C/p\u003E\u003Cp\u003EAnother thing is, I\u0027m doing these from my views on the mod, and the efficiency of the generator is explained as I have seen it. I\u0027m running the entire series in sandbox, so everything is upgraded right from the start. I\u0027ll be adding another ground power plant partially for giggles, but to further explain the microwave relay system. I should/could probably do a video just showing off the various things you can do with a large relay network. I\u0027ll probably do that as my 4th video after adding a large power plant in video 3.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T17:20:48Z\u0022 title=\u002201/29/2014 05:20  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Jivaii\u003C/strong\u003E\n\u003C/span\u003E\n"}]}