{"TopicId":40486,"ForumId":32,"TopicTitle":"Specs Discussion: MacBook Pro is Slow","CreatedByName":"cmoody","CreatedById":73304,"CreatedDateTime":"2013-08-01T15:03:15Z","PageNum":1,"Articles":[{"CreatedByName":"cmoody","CreatedById":73304,"CreatedDateTime":"2013-08-01T15:03:15Z","Content":"\n\u003Cp\u003EHello, all! I\u0027m Chris and this seems to be my first post ever. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E I recently got into KSP and have been enjoying it \u003Cem\u003Ealmost\u003C/em\u003E too much. However, I have noted a few problems with running it on my laptop. I was wondering if any of you all had similar problems and what you did to correct them.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESymptoms\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESlow opening save file, can freeze\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFreezes then crashes computer opening Vehicle Assembly Building (about 33% of the time)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFrame rate drops extremely low in atmosphere, but does not freeze of crash\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen doing any sort of maneuvers in orbit, frame rate will flicker between green and yellow\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOn Terminal CPU % Used will shoot to up to 110%\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI have a Mid-2012 13\u0022 MacBook Pro (inb4 Mac Attack). It has the \u00222.5 GHz (3210M) Intel Core i5 with 3 MB on-chip L3 cache, 4 GB of RAM, and Intel HD Graphics 4000 with DDR3 SDRAM shared with main memory.\u0022 (sourced from \u003Ca href=\u0022https://en.wikipedia.org/wiki/Macbook_pro#Technical_specifications_2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Macbook_pro#Technical_specifications_2\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EAfter talking to a few of my friends who are Comp. Sci. guys, they said it was with my RAM. I am curious to know if this is the case or they are completely wrong and it is something else I may have overlooked. If it is the lack of RAM, what is the amount that will eliminate the problems? I really love playing the game, and I want to find a solution that will fix this. Thank you for any help in advance!\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-08-01T16:18:49Z","Content":"\n\u003Cp\u003EThe freezing and crashing are definitely not normal. You can check in the support forums to see if anyone else has similar issues, or try submitting a bug report. Reinstalling the game can help, and if you use any mods you can try removing those. OSX could be an issue, but I\u0027ve never had a problem running KSP on a Mac. Even my 2011 Macbook Air can run the game without freezing or crashing, it is really slow though.\u003C/p\u003E\u003Cp\u003EI don\u0027t know why RAM would be an issue. That is generally only a problem when you run out, and that usually happens when you run too many mods. 4GB should be fine for playing stock or with a few parts mods. \u003C/p\u003E\u003Cp\u003EPerformance is very CPU limited. Having crafts with lots of parts will significantly decrease your frame rate. That green/yellow/red flickering on the timer in the top left is telling you that your CPU is having a hard time keeping up with the physics calculations. Set the physics slider all the way to the right in the first page of the settings menu. This can help with frame rate, but it will also slow down the passage of time in the game (one second of in-game time can take five seconds of real-life time).\u003C/p\u003E\u003Cp\u003EIf you want to compare your performance to others you can try my CPU performance rocket in my CPU database thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/42877-CPU-Performance-Database\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/42877-CPU-Performance-Database\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZigZagJoe","CreatedById":68572,"CreatedDateTime":"2013-08-01T16:18:52Z","Content":"\n\u003Cp\u003EI play on a Mid-09 myself. Slow opening save file - how many flights are active?\u003C/p\u003E\u003Cp\u003ELow framerate in atmosphere: Normal, especially if aerodynamic FX are happening. Lower terrain detail may help.\u003C/p\u003E\u003Cp\u003EFramerate drop while maneuvering: Normal.\u003C/p\u003E\u003Cp\u003ECPU Usage: normal. You\u0027ve got a good CPU; it won\u0027t be a bottleneck until you\u0027ve got 300 parts or more.\u003C/p\u003E\u003Cp\u003EYour biggest problem is GPU - you need to be using Simple render quality, Half res textures, No antialiasing, Low terrain detail, Very Low/minimal Aerodynamic FX. You may need to lower these settings further; these are the settings i use for the elderly 9600 GT in my macbook, and intel HD 4000 are about 25% slower than that.\u003C/p\u003E\u003Cp\u003EYou\u0027re okay memory-wise unless you\u0027ve got most of that 4gb eaten up before you launch KSP. Look at Activity monitor, sum the \u0027Free\u0027 and \u0027Inactive\u0027 memory counts and make sure you have 1.5 - 2gb available. That being said, it\u0027s maybe 30$ to upgrade to 8gb, I\u0027d recommend it, but don\u0027t expect it to fix it.\u003C/p\u003E\u003Cp\u003EGameplay wise, optimize for part count. Fewer parts, the better performance you\u0027ll get.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-08-01T17:14:58Z","Content":"\n\u003Cp\u003EIt\u0027s not your ram, to be honest it sounds like a heat issue, do you have any means of monitoring your computers temperature?\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-08-01T17:16:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZigZagJoe\u0022 data-cite=\u0022ZigZagJoe\u0022\u003E\u003Cdiv\u003EI play on a Mid-09 myself. Slow opening save file - how many flights are active?\u003Cp\u003ELow framerate in atmosphere: Normal, especially if aerodynamic FX are happening. Lower terrain detail may help.\u003C/p\u003E\u003Cp\u003EFramerate drop while maneuvering: Normal.\u003C/p\u003E\u003Cp\u003ECPU Usage: normal. You\u0027ve got a good CPU; it won\u0027t be a bottleneck until you\u0027ve got 300 parts or more.\u003C/p\u003E\u003Cp\u003EYour biggest problem is GPU - you need to be using Simple render quality, Half res textures, No antialiasing, Low terrain detail, Very Low/minimal Aerodynamic FX. You may need to lower these settings further; these are the settings i use for the elderly 9600 GT in my macbook, and intel HD 4000 are about 25% slower than that.\u003C/p\u003E\u003Cp\u003EYou\u0027re okay memory-wise unless you\u0027ve got most of that 4gb eaten up before you launch KSP. Look at Activity monitor, sum the \u0027Free\u0027 and \u0027Inactive\u0027 memory counts and make sure you have 1.5 - 2gb available. That being said, it\u0027s maybe 30$ to upgrade to 8gb, I\u0027d recommend it, but don\u0027t expect it to fix it.\u003C/p\u003E\u003Cp\u003EGameplay wise, optimize for part count. Fewer parts, the better performance you\u0027ll get.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI doubt if GPU will make any difference whatsoever. The Geforce GT415M in my laptop should be able to get me past absolute minimal settings but I can\u0027t turn a single thing up. My desktop in comparison runs buttery smooth and whilst it happens to have a considerably better GPU it\u0027s hardly being put to use according to the stats left behind whilst the i7 2600k seems to be whats allowing me to turn the settings up. Plus also I can run Crysis on Medium/Low on my laptop and Portal 2 on max, mostly due to the GPU. Personally I\u0027m pretty convinced that KSP isn\u0027t relying on the GPU for anything more than drawing pixels and everything else is being thrown into a single core on the processor. Physics, textures etc. Of course I\u0027m happy to be proven wrong, but if graphical setting are tied to the GPU it shouldn\u0027t be behaving this way surely.\u003C/p\u003E\n"},{"CreatedByName":"ZigZagJoe","CreatedById":68572,"CreatedDateTime":"2013-08-02T20:26:26Z","Content":"\n\u003Cp\u003ECPU physics calculation tends to be the primary bottleneck in KSP as part counts climb, but the GPU is by no means sitting idle - KSP would run absolutely glacially if it were using purely software rendering. Real life example: If I forget to turn on the 9600 GT and just use the 9400m, well, let\u0027s just say there\u0027s a painfully obvious difference in FPS. So, no, you are flat out wrong. \u003C/p\u003E\u003Cp\u003EAlso, the GT415 was the lowest GPU of its class and is actually inferior to the intel HD 4000 - I\u0027m not surprised you are having to use very low settings. I\u0027m guessing it\u0027s paired with either an i3 or an AMD chip. If it\u0027s the latter, you\u0027re boned. KSP may not look like much but it\u0027s fairly intensive all the same - unlike portal 2, which is technologically a very elderly game. As long as you are staying around 100-150 parts or less, you should be able to do /ok/, but more than that and things will get very slow very quickly (assuming you don\u0027t have an AMD chip).\u003C/p\u003E\u003Cp\u003EIf you /are/ cpu bound, then you will have slow gameplay speed due to time being slowed down with either high FPS (no vsync) or low GPU utilization (vsync on).\u003C/p\u003E\n"}]}