{"TopicId":40500,"ForumId":18,"TopicTitle":"Project Zomboid","CreatedByName":"Capn","CreatedById":48599,"CreatedDateTime":"2013-08-01T16:45:58Z","PageNum":1,"Articles":[{"CreatedByName":"Capn","CreatedById":48599,"CreatedDateTime":"2013-08-01T16:45:58Z","Content":"\n\u003Cp\u003EIm sure some of you are familiar with project zomboid but if you go to there forums its like a ghost town they could\u003C/p\u003E\u003Cp\u003Ereally use some new fans or even some new modders but its a tad bit of a stretch from ksp so check it out now to know \u003C/p\u003E\u003Cp\u003Ewhat I mean.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EA link to The Indie Stone Forums(PZ Forums)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://theindiestone.com/forums/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://theindiestone.com/forums/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-02T01:46:45Z\u0022 title=\u002208/02/2013 01:46  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 2, 2013\u003C/time\u003E by Capn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MalletFace","CreatedById":62341,"CreatedDateTime":"2013-08-02T07:43:00Z","Content":"\n\u003Cp\u003EOn the modding part, I have been wanting to mod PZ since the start, but I knew I would have to wait for a while or my mod would be outdated too fast for me to update it. I think that I might start soon, though, since they are confident enough to release new mapping tools.\u003C/p\u003E\u003Cp\u003EI have had an account on the old forums, and made an account on the new forums in the first hour they were up, but I am really not sure about posting. I really enjoy posting about my Kitten knife zombie kills and the times I have escaped a house through the Kitten, and having the word Kitten changed to kitten would make my posts really boring, sad, and most certainly ruin the greasy goodness of my Kitten stories. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EKitten=kitchen and kitten=kitten, for those of you who have never been on the Zomboid forums since Rathlord decided it would be funny to add a kitten filter.\u003C/span\u003E\u003C/p\u003E\n"}]}