{"TopicId":40688,"ForumId":55,"TopicTitle":"New game engine. If not for KSP V1.0, for KSP 2.","CreatedByName":"ronny","CreatedById":71174,"CreatedDateTime":"2013-08-02T19:15:25Z","PageNum":1,"Articles":[{"CreatedByName":"ronny","CreatedById":71174,"CreatedDateTime":"2013-08-02T19:15:25Z","Content":"\n\u003Cp\u003EI suggest a New game engine. And would like to have some way of letting the KSP people know they have support for it. Then they can do it once they find they have sufficient support. If not for KSP 1 since we\u0027re 20% into it, then for KSP 2. But then again, economists are the first to tell you to ignore sunk cost if it makes sense to scrap the old for the new. So if we have enough support, it will make sense to scrap a 25% finished game for a new one with a better engine, where the work will be done quickly and efficiently due to the design being over 25% finished already. There\u0027s all sorts of good that KSP can get from having a game engine that fits the ambition of KSP. We just have to do it such a way that they don\u0027t go bankrupt by trying to make the game again in another engine. \u003C/p\u003E\u003Cp\u003EI can step up and buy the game for Triple A game price to show my support. But I really want KSP in origin, not steam, I can\u0027t stand steam and loathe having it on any computer under my roof. \u003C/p\u003E\u003Cp\u003EI want suggestions for how we can show our support for a new game engine. And I want the thread to become a threadnought (the Eve people here will get that), and stickied.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-08-02T19:22:42Z","Content":"\n\u003Cp\u003EKSP is still in heavy development, so talking about a sequel is out there, and trying to put a new engine in, isn\u0027t extremely simple, and Squad likes Unity, and will most likely not change engines.\u003C/p\u003E\u003Cp\u003EAlso, what engine would they use? The best engine for KSP would be a custom designed one, and that would be divvying up the dev time a bit too thin.\u003C/p\u003E\n"},{"CreatedByName":"kingpoiuy","CreatedById":75700,"CreatedDateTime":"2013-08-02T19:27:44Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is not an option, sorry.\u003C/p\u003E\n"},{"CreatedByName":"ZRM","CreatedById":64626,"CreatedDateTime":"2013-08-02T19:32:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ronny\u0022 data-cite=\u0022ronny\u0022\u003E\u003Cdiv\u003EI suggest a New game engine. And would like to have some way of letting the KSP people know they have support for it. Then they can do it once they find they have sufficient support. If not for KSP 1 since we\u0027re 20% into it, then for KSP 2. But then again, economists are the first to tell you to ignore sunk cost if it makes sense to scrap the old for the new. So if we have enough support, it will make sense to scrap a 25% finished game for a new one with a better engine, where the work will be done quickly and efficiently due to the design being over 25% finished already. There\u0027s all sorts of good that KSP can get from having a game engine that fits the ambition of KSP. We just have to do it such a way that they don\u0027t go bankrupt by trying to make the game again in another engine. \u003Cp\u003EI can step up and buy the game for Triple A game price to show my support. But I really want KSP in origin, not steam, I can\u0027t stand steam and loathe having it on any computer under my roof. \u003C/p\u003E\u003Cp\u003EI want suggestions for how we can show our support for a new game engine. And I want the thread to become a threadnought (the Eve people here will get that), and stickied.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is on the Do Not Suggest list. It has been suggested far too many times. Everyone knows Unity is possibly the worst choice for this game, but there is not much anyone can do about it for business reasons. There is too much risk involved in pursuing a new engine at this point in development.\u003C/p\u003E\u003Cp\u003EAlso, I would like to know how you managed to figure that the game is 20% done. Hint: version numbers are not decimal - KSP 0.20 is not the same as KSP 0.2, it is just minor version 20 of the game.\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-08-02T19:33:49Z","Content":"\n\u003Cp\u003EHello there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs has been noted, a new game engine is not an option and has been suggested over and over again no less - That\u0027s why it ended up on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003EWhat not to suggest\u003C/a\u003E list.\u003C/p\u003E\u003Cp\u003EI\u0027m closing this thread now, and I\u0027m asking you to read through that list - and perhaps some search results to \u0022new engine\u0022 - first for other such topics and for explanations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\n"}]}