{"TopicId":40815,"ForumId":16,"TopicTitle":"Where is the Neil Armstrong memorial?","CreatedByName":"TYRT","CreatedById":72285,"CreatedDateTime":"2013-08-03T14:01:23Z","PageNum":1,"Articles":[{"CreatedByName":"TYRT","CreatedById":72285,"CreatedDateTime":"2013-08-03T14:01:23Z","Content":"\n\u003Cp\u003EMy rover \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://n1308.hizliresim.com/1d/3/r2rwy.png\u0022 alt=\u0022r2rwy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow can i go there:D I think I\u0027ve traveled half of MÃƒÂ¼n but I couldn\u0027t find memorial:sticktongue:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TYObR.png\u0022 alt=\u0022TYObR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 alt=\u0022:kiss:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-08-03T14:05:28Z","Content":"\n\u003Cp\u003Egoogle Apollo 11 landing coordinate\u003C/p\u003E\u003Cp\u003Esearch returns:\u003C/p\u003E\u003Cp\u003EApollo 11 - Mare Tranquillitatis\u003C/p\u003E\u003Cp\u003ELunar Landing Time 4:17:40 p.m. EDT, July 20, 1969\u003C/p\u003E\u003Cp\u003ELanding Site Coordinates 0.67408Ã‚Â° N latitude, 23.47297Ã‚Â° E longitude\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003Eplug the coordinate into mechjeb landing guidance to make the landing site your target.\u003C/p\u003E\u003Cp\u003Eproceed to land by hand or automation\u003C/p\u003E\u003Cp\u003E(it\u0027s actually not hard to spot it from the sky... it\u0027s pretty visible at ~1000m altitude)\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-03T22:16:15Z","Content":"\n\u003Cp\u003EIt\u0027s actually somewhat to the northwest of the Apollo 11 landing coordinates. If you approach it from the southeast, there\u0027s going to be one hell of a downhill along the way...lost three turd rovers that way just last night.\u003C/p\u003E\u003Cp\u003EI feel your pain...I spent the better part of a week looking for the stupid thing in 0.21. Anomalies ain\u0027t as bright and shiny as they were in 0.20.\u003C/p\u003E\u003Cp\u003EI did write down the coordinates and I can PM them to you, but I\u0027m not at home right now. If no one answers the question directly in the meantime, I\u0027ll send the coordinates your way.\u003C/p\u003E\u003Cp\u003EAlternatively, use kerbalmaps.com. The one you want is on the south side of that crater in the middle of the map.\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2014-01-19T03:12:19Z","Content":"\n\u003Cp\u003ECould you show a map view of where it is?\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-01-19T03:29:21Z","Content":"\n\u003Cp\u003EIt\u0027s on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-19T05:15:54Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalmaps.com\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECall up MÃƒÂ¼n and turn on anomalies\u003C/p\u003E\u003Cp\u003EIt\u0027s the one at 0.7027 : 22.7470, towards the south side of the Northwest Crater.\u003C/p\u003E\u003Cp\u003EIn the five months since my last post, it\u0027s become one of my favored MÃƒÂ¼nar landing sites...\u003C/p\u003E\u003Cp\u003EThe terrain around it is hell, just a heads-up.\u003C/p\u003E\u003Cp\u003EJust so you know, the admins have a tendency to squash thread necromancy; they prefer you start up a new one if you\u0027ve got a gameplay question (even if it\u0027s a question that\u0027s been answered before). Not a problem really, but I figured you should know.\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2014-01-19T05:17:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SDIR\u0022 data-cite=\u0022SDIR\u0022\u003E\u003Cdiv\u003ECould you show a map view of where it is?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Almost exact cords of where \u0022The Eagle\u0022, landed\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2014-01-19T08:31:45Z","Content":"\n\u003Cp\u003ENot in game right now to grab a screenshot, but I can get you mostly there and a bit of help finding it. Hopefully somebody can give a wee bit more detail.\u003C/p\u003E\u003Cp\u003E1. Firstly, it is near the equatorial belt. This doesn\u0027t exactly narrow it down, but next point will\u003C/p\u003E\u003Cp\u003E2. It is on the south side of one of the large craters.\u003C/p\u003E\u003Cp\u003E3. If you wish to find it, and if waiting for somebody to post up a pic, I recommend sending a small probe on a low orbit around the mun at equator. You should see it as a flickering object if your graphics are not turned to minimum\u003C/p\u003E\u003Cp\u003EReally, this is how I found it by accident. I landed in a crater, but up a slope a bit. I could see something beyond the terrain scatter (boulders) that was quite far away. Many KM of rover travel later (I shoulda just flown there.... way to much quicksave) I found the memorial.\u003C/p\u003E\u003Cp\u003EI really hope my memory is correct \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2014-01-20T15:40:46Z","Content":"\n\u003Cp\u003Ekerbalmaps.com will help a lot.\u003C/p\u003E\u003Cp\u003EBut getting the exact coordinates is only half the fun if you don\u0027t use MJ or any landing predictions to land spot on it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe method for target landing I use in my career before getting access to MJ (or while playing stock with a fresh new KSP version) is inspired by what the real guys did to land on the Moon :\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EI usually check kerbalmaps.com to locate the exact coordinates and its surroundings, and I use it to draw a paper map (better for my memory) of the surrounding landscape, with the craters and other features annotated and their approximate positions in relation to my target.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThen, I rotate the map so that I can study it from the same point of view as I will have when approaching it (usually way too fast and from the west \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI try to name and learn all the features relevant to my approach by heart and picture mentally what the ground will look like during my approach, so that I don\u0027t have to get back to my map in the heat of all this landing action.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFor example, my Neil Armstrong Memorial map shows the edge of the big crater, some cliffs to the south of and a bunch of craters (some overlapping, some not) with a cross-hair labelled \u0022Land here damnit!\u0022 between two of them.\u003C/p\u003E\u003Cp\u003EThe landing usually goes \u0022Ok, here\u0027s the big crater. Now, I\u0027ve found \u0027Bullseye\u0027 (two concentric craters) with another crater overlapping it. I have to land just behind the overlapping crater.\u0022\u003C/p\u003E\u003Cp\u003EA few more notes :\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDrawing on paper and naming features helps my memory a lot, I\u0027ve noticed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can also make a VERY low pass over your target before landing to try to familiarize yourself with the actual landscape and compare it to your map before the landing.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOf course, this method works better on heavily cratered bodies. I\u0027ve tried this on Duna and the lack of features of the planet (\u0022damn you erosion!\u0022) left me with no other option than roving to the target coordinates.\u003C/p\u003E\u003Cp\u003EYup, way less immersive this way... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-20T15:41:41Z\u0022 title=\u002201/20/2014 03:41  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 20, 2014\u003C/time\u003E by el_coyoto\u003C/strong\u003E\n\u003Cbr\u003EEnglish : do I speak it?\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-20T18:35:56Z","Content":"\n\u003Cp\u003EI do have pics of the NAM site with the coordinates. Unfortunately, I have this tendency to get there and land at night...\u003C/p\u003E\n"}]}