{"TopicId":40820,"ForumId":16,"TopicTitle":"How to \u0026quot;End Flight\u0026quot; in 0.21","CreatedByName":"Rex3921","CreatedById":69610,"CreatedDateTime":"2013-08-03T14:56:22Z","PageNum":1,"Articles":[{"CreatedByName":"Rex3921","CreatedById":69610,"CreatedDateTime":"2013-08-03T14:56:22Z","Content":"\n\u003Cp\u003EWith the release on 0.21 the end flight button has been replace with a new revert flight button. See I want to get my Kerbals back so I can send the off on missions but I can\u0027t!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E Help!?!?!?!?\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ERex3921\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-03T15:05:15Z\u0022 title=\u002208/03/2013 03:05  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 3, 2013\u003C/time\u003E by Rex3921\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thourion","CreatedById":47430,"CreatedDateTime":"2013-08-03T14:59:51Z","Content":"\n\u003Cp\u003EWell, unless im missing something obvius, the revert flight button does the job. Now if you dont want to revert time, you can leave the craft where it is, and go space center, and tracking station. From there you can use the new function \u0022Recover Flight\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Pursuedtank","CreatedById":50078,"CreatedDateTime":"2013-08-03T15:02:31Z","Content":"\n\u003Cp\u003EThere is no end flight button any more as this is physically impossible in the real world. You can now go into the tracking station and have two options, recover and terminate. Any craft landed on Kerbin can be recovered which will bring the crew back so they can be used again in another mission. Terminate can be used anywhere and will remove a craft, but will kill all Kerbals on board. They can both be located in the bottom right, terminate is an X while recover is a crane. This is for the career mode update.\u003C/p\u003E\n"},{"CreatedByName":"Scorpi15","CreatedById":34189,"CreatedDateTime":"2013-08-03T15:04:13Z","Content":"\n\u003Cp\u003EThe recover button only works on Kerbin, though. The revert button doesn\u0027t work when you leave the atmosphere if I remember correctly.\u003C/p\u003E\n"},{"CreatedByName":"Rex3921","CreatedById":69610,"CreatedDateTime":"2013-08-03T15:05:01Z","Content":"\n\u003Cp\u003EOMG I totally forgot to have a proper look! Thanks you two!\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-08-03T17:09:05Z","Content":"\n\u003Cp\u003EI do miss an end flight button simply because exiting to space center, tracking station, mission recovery/terminate takes time. Being able to recover/terminate from the mission itself would be faster.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-03T17:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scorpi15\u0022 data-cite=\u0022Scorpi15\u0022\u003E\u003Cdiv\u003EThe recover button only works on Kerbin, though. The revert button doesn\u0027t work when you leave the atmosphere if I remember correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo you can leave atmosphere and still revert; I have done so a few times when testing boosters.\u003C/p\u003E\u003Cp\u003EIf you leave the craft at any time, like to fly another craft or go back to the Space Center, you instantly lose the ability to revert. I don\u0027t know if you\u0027d also lose the ability to revert after changing to another Sphere of Influence; I\u0027ve never tested that.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"}]}