{"TopicId":40833,"ForumId":16,"TopicTitle":"Need help docking with two pairs of ports simultaneously","CreatedByName":"Totema","CreatedById":77317,"CreatedDateTime":"2013-08-03T16:25:29Z","PageNum":1,"Articles":[{"CreatedByName":"Totema","CreatedById":77317,"CreatedDateTime":"2013-08-03T16:25:29Z","Content":"\n\u003Cp\u003EHowdy all,\u003C/p\u003E\u003Cp\u003EI\u0027m in the process of assembling a low-orbit space station, and the module I\u0027m currently trying to dock use two pairs of ports at once, to increase stability/reduce annoying floppiness. The trouble is, even though \u003Cstrong\u003EI\u0027ve made sure that the parts are lines up correctly\u003C/strong\u003E and I\u0027ve even \u003Cstrong\u003Edone it before with the exact same setup\u003C/strong\u003E, I\u0027m having a real hard time getting this module to dock properly. I even spent all night redoing the docking maneuver but having no success.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img842.imageshack.us/img842/5662/736l.png\u0022 alt=\u0022736l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, I can get one pair of ports to dock alright, but the other is always just a little bit off. And it\u0027s always the same pair too. You can also see that I have the same module on the other side of the core, and yes, both pairs of ports are docked and stable. Funny thing is, I originally had the same problem with that one too, but after making some orbital corrections and other maneuvers it looked like it just fixed itself somehow. But that\u0027s not happening in this case here.\u003C/p\u003E\u003Cp\u003EIs there anything else I can try to get these to dock?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T01:50:32Z\u0022 title=\u002208/11/2013 01:50  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by Totema\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arbolus","CreatedById":74833,"CreatedDateTime":"2013-08-03T20:58:04Z","Content":"\n\u003Cp\u003EPerhaps the central and side shafts aren\u0027t exactly the same length? If you managed to get the right-hand module to dock then it might have forced the central shaft to bend and pulled the left-hand ports apart.\u003C/p\u003E\u003Cp\u003EJust an idea.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-08-04T02:18:43Z","Content":"\n\u003Cp\u003EIf you undock the first pair, the second should engage almost immediately (leaving the first uncoupled.) If this doesn\u0027t happen then there\u0027s some sort of alignment issue with your vessels, either in their construction or in the docking process. If they do engage then you can undock that pair, quickly switch to the Tracking Station then quickly switch back to either vessel. If you do this fast enough, neither vessel will have moved appreciably with respect to the other, and both ports should immediately couple.\u003C/p\u003E\n"},{"CreatedByName":"Graknils","CreatedById":77446,"CreatedDateTime":"2013-08-04T04:51:56Z","Content":"\n\u003Cp\u003EThis might possibly be related. I found it on YT and it seems very similar to what you are describing. \u003C/p\u003E\u003Cp\u003ETutorial: Tri-coupled docking in Kerbal Space Program \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/KSkrrdM5r08?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EUnfortunately, even after following his instructions, I can\u0027t figure out how to use it. Once he uses gravity to assist in docking the ports, there\u0027s no way to \u0022save\u0022 that configuration for use anywhere else in construction. You can only revert back to the the VAB with the docks their undocked state.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-08-04T05:16:25Z","Content":"\n\u003Cp\u003EOne way to dock at two locations simultaneously is as follows:\u003C/p\u003E\u003Cp\u003E - Have MechJeb on both vessels\u003C/p\u003E\u003Cp\u003E - Set the first vessel to dock with the the second vessel at one location\u003C/p\u003E\u003Cp\u003E - Very quickly switch to the second vessel\u003C/p\u003E\u003Cp\u003E - Set the second vessel to dock with the first vessel at another location\u003C/p\u003E\u003Cp\u003EBoth craft would \u0022wriggle\u0022 their way towards each other trying to keep both sets of docking ports aligned, and will result in 95% probability of success. This is how I docked massive trusses to my space stations at multiple points.\u003C/p\u003E\n"},{"CreatedByName":"Graknils","CreatedById":77446,"CreatedDateTime":"2013-08-07T18:43:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EOne way to dock at two locations simultaneously is as follows:\u003Cp\u003E - Have MechJeb on both vessels\u003C/p\u003E\u003Cp\u003E - Set the first vessel to dock with the the second vessel at one location\u003C/p\u003E\u003Cp\u003E - Very quickly switch to the second vessel\u003C/p\u003E\u003Cp\u003E - Set the second vessel to dock with the first vessel at another location\u003C/p\u003E\u003Cp\u003EBoth craft would \u0022wriggle\u0022 their way towards each other trying to keep both sets of docking ports aligned, and will result in 95% probability of success. This is how I docked massive trusses to my space stations at multiple points.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat suggestion! Can you talk some more about how to \u0022Very quickly switch to the second vessel\u0022? The only way I\u0027ve been able to switch vessels is to go back to KSP and choose the space tracking and then switch vessels there.\u003C/p\u003E\n"},{"CreatedByName":"Cranium","CreatedById":69153,"CreatedDateTime":"2013-08-07T19:32:09Z","Content":"\n\u003Cp\u003EYou can use the square bracket keys [ and ] to quickly switch between vessels.\u003C/p\u003E\n"},{"CreatedByName":"Graknils","CreatedById":77446,"CreatedDateTime":"2013-08-08T17:23:08Z","Content":"\n\u003Cp\u003EThank you!!\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-08T18:56:44Z","Content":"\n\u003Cp\u003Egetting the second set of ports perfectly aligned is all but impossible. The instant the first set of ports docks, the second pair will lose their magnetic attraction capability. If they happen to hit each other, they\u0027ll lock on in that position, in the same manner as if a strut had been added connecting them. It actually is multi-docked, but the alignment might not be absolutely perfect.\u003C/p\u003E\n"},{"CreatedByName":"esinohio","CreatedById":57681,"CreatedDateTime":"2013-08-08T23:33:36Z","Content":"\n\u003Cp\u003EIsn\u0027t there some sort of award for pulling off multi-dockings like this? I mean holy crap man!\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2013-08-09T03:58:52Z","Content":"\n\u003Cp\u003EIt is possible. I did this quite a bit for my refueling station in 0.20, it uses the big orange tanks with two docking ports per side. Each started as an identical craft in the VAB which meant the ports were aligned exactly the same.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://bobandeileen.com/ksp/FuelDepot.png\u0022 alt=\u0022FuelDepot.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI launched the same vehicle multiple times (one tank per launch) then docked them together. Each tank had a set of RCS thrusters at each end, to aid steering it into position (I made those removable so they don\u0027t show up in the final pic). I learned that orientation matters e.g. always dock in the same orientation (I put some antennas at one end to help with getting orientation the same each time). I needed to get the ports aligned nearly perfectly to get both to connect.\u003C/p\u003E\u003Cp\u003EI found full tanks easier to dock due to the mass not oscillating as much from RCS thrusts. I did have a few issues where one port would connect but the other wouldn\u0027t. Sometimes I could use RCS to \u0022bend\u0022 the connected port and bring the two tanks together. But most of the time, if both ports didn\u0027t dock the first time, I had to undock, separate, and try again.\u003C/p\u003E\u003Cp\u003EYes it took a lot of time to get all seven tanks with both ports each docked. But I was able to confirm that every port was connected when I was finished.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-09T12:48:52Z","Content":"\n\u003Cp\u003EHeh. I did one back in like 0.18 and 0.19 that had two customized station cores with two fuel arms inbetween them. The fuel arms had trusses down the centerline and four orange tanks mounted radially, with large RCS or Xenon tanks mounted on both ends of the tanks. \u003C/p\u003E\u003Cp\u003EThere were also two of what I called \u0027Trucks\u0027 docked beneath the station cores, with a 3 man pod, a CoT on the noze, a large RCS tank, an X200-16, and three LV-Ns mounted to a tricoupler. Later versions also had a \u002B shaped structure made out of small cubic trusses (about five per arm) with the RCS thrusters mounted on the end of them placed at the center of mass, to increase the torque the RCS could generate.\u003C/p\u003E\u003Cp\u003EThe Station Cores had a hubmax with docking ports on either end. Two fuel arms were docked in parallel on one side, and connected to the station core on the other side. The two \u0027trucks\u0027 were mounted in line with the station cores on the bottom ports. The top ports had an adapter with a CoT Jr on it, for probe docking.\u003C/p\u003E\u003Cp\u003EIt mostly worked pretty well (although my refueling tankers did NOT). I did spent a lot of time fighting with the multidock on the fuel arms. You don\u0027t want to know how many times I disconnected a port on one of the fuel arms, wobbled it back and forth a bit to reset it, then reconnected it, trying to get it to align properly (which it never did). The general idea was that the entire thing would be capable of moving, using the engines on the two \u0027Trucks\u0027 to move the entire station at once. I never actually tried it because I was afraid the not-quite-perfect alignment on the multidock would throw it off enough that it wouldn\u0027t work.\u003C/p\u003E\u003Cp\u003EIt had also occurred to me that if needed it was possible to make an even bigger station by using four more fuel arms to connect two stations like that together, but I never tried that either.\u003C/p\u003E\u003Cp\u003EI eventually abandoned the design because after two partial redesigns, it would STILL drop in and out of yellow physics delta time while just ORBITING.\u003C/p\u003E\n"},{"CreatedByName":"Totema","CreatedById":77317,"CreatedDateTime":"2013-08-11T00:13:54Z","Content":"\n\u003Cp\u003EI don\u0027t mean to turn this into a necrothread, but I thought I\u0027d give an update. Using MechJeb on both modules doesn\u0027t seem to help; they spend more than an hour trying to align, and when they do align and dock, one of the pairs of ports is, again, not docked. I concur with Arbolus and Jason, for when I decoupled the first, properly docked module and then tried to dock the second one, that one docks fine and the first one has problems. So the problem is mirrored and doesn\u0027t seem to have to do with the modules themselves.\u003C/p\u003E\u003Cp\u003EIn my next station, the central pillar will probably use the exact same parts as the outer pillars, to completely bypass this alignment issue. But it still bothers me that in the VAB I was able to make them all snap together just fine, and yet they won\u0027t dock out in orbit. It would be a great feature to be able to measure out the distance between docks to see if they\u0027ll dock correctly. Or to be able to force two nearby ports to snap together, regardless of miniscule alignment problems. Maybe there are addons that can do either of these? \u003C/p\u003E\u003Cp\u003EI\u0027ve resolved to discontinue the current project, recover my crew, and deorbit the station. Enjoy the pictures, and thanks to everyone that answered.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img580/7892/gdwv.jpg\u0022 alt=\u0022gdwv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img834/7976/79pm.jpg\u0022 alt=\u002279pm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img689/610/3i22.jpg\u0022 alt=\u00223i22.jpg\u0022\u003E\u003C/p\u003E\n"}]}