{"TopicId":40857,"ForumId":32,"TopicTitle":"Menu screen \u0026quot;Mun or Bust\u0026quot; rocket?","CreatedByName":"Wook","CreatedById":77388,"CreatedDateTime":"2013-08-03T18:41:27Z","PageNum":1,"Articles":[{"CreatedByName":"Wook","CreatedById":77388,"CreatedDateTime":"2013-08-03T18:41:27Z","Content":"\n\u003Cp\u003EI was wondering if the \u0022Mun or Bust\u0022 rocket you see on the \u0022start game\u0022 page is in fact actually there... Just out of curiosity? If so, new mission! Thanks, and have a merry day.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-08-04T08:45:17Z","Content":"\n\u003Cp\u003ENah it\u0027s just a menu screen, it\u0027s not in the actual game.\u003C/p\u003E\n"},{"CreatedByName":"CactusLynx","CreatedById":62578,"CreatedDateTime":"2013-08-04T08:57:08Z","Content":"\n\u003Cp\u003EJust a menu screen jab at Jeb\u0027s piloting skills, although that does not mean there aren\u0027t interesting bits on celestial bodies in game; theres little easter eggs and some funky geological formations about! For example, the mun has some really steep cliffs which are fun to jump over with a rover:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/594755693861758942/E97C2F6B7A177B70C6622FFFBFF6E021252DF91E/\u0022 alt=\u0022E97C2F6B7A177B70C6622FFFBFF6E021252DF91E\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-04T11:55:33Z","Content":"\n\u003Cp\u003EThat\u0027s a rover nightmare right there\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-04T11:58:54Z","Content":"\n\u003Cp\u003EI remember driving over a cliff like that testing a Dres lander. Bad times.\u003C/p\u003E\u003Cp\u003EActually, that looks like the cliff near the Neil Armstrong Memorial on the Old Mun.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-04T12:02:36Z","Content":"\n\u003Cp\u003EProbably is although, it looks a bit shallow\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2013-08-04T12:15:38Z","Content":"\n\u003Cp\u003EYou could always put \u0022Mun or Bust\u0022 on the Mun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E It wouldn\u0027t be partially in the ground or have the writing on it, but it\u0027s close enough.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2013-08-04T12:22:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EI remember driving over a cliff like that testing a Dres lander. Bad times.\u003Cp\u003EActually, that looks like the cliff near the Neil Armstrong Memorial on the Old Mun.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure it is near there, I remember my rover going for a little tumble down there and damaging a wheel the first time I even got to the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Chiboko","CreatedById":77125,"CreatedDateTime":"2013-08-04T13:19:29Z","Content":"\n\u003Cp\u003EThe \u0027Mun or bust\u0027 rocket is a reference to Kurtjmac\u0027s series \u0027Farlands or bust\u0027 as he was one of the first big youtubers to give the game publicity. Of course Scott Manley is the big KSP guy now and they both have Kerbals named after them.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-08-04T13:20:30Z","Content":"\n\u003Cp\u003EAs to the main screen, you\u0027ll also notice if has the old graphics too\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-08-04T22:37:13Z","Content":"\n\u003Cp\u003EI soooo love the new Mun. It really has good Armstrong P66 needs at times. I almost landed on a slope that was steeper than CactusLynx\u0027 one and was only because I used the translatron that I managed to save it. Was quite scary as I leveled out about 6ft above the ground but a foot one way and I would have impacted for sure while a foot the other way and it was like a 12ft drop instead.\u003C/p\u003E\u003Cp\u003EActually I found the Apollo LEM\u0027s contact light wasn\u0027t actually a contact light. It was actually set off when the ship was within a few feet of the surface to allow for the reaction time of the pilot. When the light comes on and the pilot reaches over to turn off the engines if the contact was right on the pad then the LEM would have bounced up into the air again (well into space again). How many times have you guys done that in KSP? I know I\u0027ve done it a few times. Going to simulate it in software at some point I think.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-04T22:53:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EI soooo love the new Mun. It really has good Armstrong P66 needs at times. I almost landed on a slope that was steeper than CactusLynx\u0027 one and was only because I used the translatron that I managed to save it. Was quite scary as I leveled out about 6ft above the ground but a foot one way and I would have impacted for sure while a foot the other way and it was like a 12ft drop instead.\u003Cp\u003EActually I found the Apollo LEM\u0027s contact light wasn\u0027t actually a contact light. It was actually set off when the ship was within a few feet of the surface to allow for the reaction time of the pilot. When the light comes on and the pilot reaches over to turn off the engines if the contact was right on the pad then the LEM would have bounced up into the air again (well into space again). How many times have you guys done that in KSP? I know I\u0027ve done it a few times. Going to simulate it in software at some point I think.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, the \u0022contact light\u0022 was a signal connected to a probe that extended 6 feet (I think) below the legs of the LEM. Once that light came on, the probe had touched the surface. But in any case, yes, a contact light or something similar would be great. I have been playing KSP again this weekend after a couple month break so my intincts and reflexes are rusty. I rebounded off the surface and screwed up more than one practice landing today - broke the lander real good too, but fortunately I had quicksaved before PDI and also, it was a remote controlled ship. When it was on the ground, it looked a lot like the \u0022Mun or Bust!\u0022 ship though!\u003C/p\u003E\u003Cp\u003EAfter I got it down, I went to go land on the far side today, thinking I was hot stuff and ready to land in the dark. Of course, I had the wrong low power lights on the bottom of my lander but tried it anyway. Ended up on a slope and began sliding down hill, fast. I hit the throttle and took off again really fast and managed to come down on a much more gentle slope, but all that used up so much fuel that I don\u0027t have enough gas to get home. I planted a flag and made a plaque, then limped up into a low Munar orbit. My rescue ship is heading their way as we speak.\u003C/p\u003E\n"}]}