{"TopicId":40919,"ForumId":55,"TopicTitle":"How to got more than one Star System to work....","CreatedByName":"Robbwiththehair","CreatedById":77436,"CreatedDateTime":"2013-08-04T03:02:53Z","PageNum":2,"Articles":[{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-08-04T09:51:47Z","Content":"\n\u003Cp\u003EHide a wormhole somewhere inside/outside the Kerbol system - fixed position relative to the star (aim well) - pop out in new solar system.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-04T10:10:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003E1. No one will build Orion. Detonating nuclear devices in space is a big No-No, and public gets hysteric at mere mention of nuclear powered satellites. There would be riots if someone proposed to send up spacecraft carrying hundreds of nuclear bombs.\u003Cp\u003E2. VASIMR, while undeniably cool is not up to interstellar levels of power. Best we have is 200kW engine with huge power consumption.\u003C/p\u003E\u003Cp\u003E3.Accelerating the probe to noticeable fraction of lightspeed with ion engines would be a herculean task. Abysmal thrust combined with high power demands would mean decades of acceleration.\u003C/p\u003E\u003Cp\u003E4. Solar sails...No one came with idea how to build a sail big enough, and still controllable as of yet.\u003C/p\u003E\u003Cp\u003ENo, we need better engines to reach other stars in reasonable time. Warp drive would be best option, but it is still theoretical. Other promising options are: Fission Fragment engine, Fusion Driven Rocket (aka. Fusion Pulse Drive), Nuclear Lightbulb engine, Nuclear Saltwater engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1 Orion is for huge loads, think 1000 ton ships however its very marginal for interstellar travel, you would need one gigantic one for that. \u003C/p\u003E\u003Cp\u003E2,3 vasmir is an improved ion engine higher trust and better isp, worse than orion as an interstelar drive. \u003C/p\u003E\u003Cp\u003E4 laser boosted solar sails might be an nice way to do interstellar probes, realistic but don\u0027t fit in the game. \u003C/p\u003E\u003Cp\u003EFusion engines sounds pretty much perfect, some work is actually done on an Fusion Pulse Drive. Not up to interstellar qualities but an good one would. \u003C/p\u003E\u003Cp\u003ENuclear salt water sounds insane to me compared to the orion, you would have control problems controlling the continuous detonation.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-08-04T10:42:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarecrow88\u0022 data-cite=\u0022Scarecrow88\u0022\u003E\u003Cdiv\u003EScott Manley has indeed posted a video about the time it takes to travel interstellar distances. For KSP, it would be possible to make another system closer than in real life, but it would still take an age to get there. I like the idea of easter eggs in the game that, once all found, provide you with the resources to build a Stargate type structure that opens up the possibility of travelling to other solar sustems\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI also agree with this idea. Maybe have some incredibly rare resource(s) that you needed to mine and transport to Kerbin (along with the high cost of researching and building) and then have to activate close to Kerbol (within Moho orbit) for some pseudo science reason. \u003C/p\u003E\u003Cp\u003EI think this would allow for the difficulty and time needed to be fair, but without the x1000000 timewarps and massive delta-v needed to just fly out.\u003C/p\u003E\n"},{"CreatedByName":"Robbwiththehair","CreatedById":77436,"CreatedDateTime":"2013-08-04T11:18:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003EI also agree with this idea. Maybe have some incredibly rare resource(s) that you needed to mine and transport to Kerbin (along with the high cost of researching and building) and then have to activate close to Kerbol (within Moho orbit) for some pseudo science reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason why I said I thought a faster time acceleration \u0022warp drive\u0022 would be a much better idea was it wouldn\u0027t actually take away from the semi-realistic look of KSP. I have always preferred when the game isn\u0027t based around objectives that are simply non-existent in the real world (Kethane Mining etc.) so having a big red button on the cabin\u0027s dashboard that sends them to 10,000,000,000x time acceleration until they reach the SOI of another star system wouldn\u0027t actually break the rules of physics (or time) any more than KSP does already.\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2013-08-04T11:49:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Enigma179\u0022 data-cite=\u0022Enigma179\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe Homo genus, the one which includes us, Homo Sapiens (but back in the past they would have looked pretty different, obviously) is 2.5 million years old. Modern humans are 500 thousand years old. The subspecies (that is, humans that look pretty much exactly like us without the differing structures and all), Homo Sapiens Sapiens is 200 thousand years old.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a pet peeve, it\u0027s just \u0027Homo Sapiens\u0027 and half a million years of being modern humans, since it turns out Neanderthal was really a distinct species Homo Neanderthalensis and not a subspecies of Sapiens.\u003C/p\u003E\u003Cp\u003EIncidentally Scott M. made the maths\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pJLcXh7vFZg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E, apparently it takes several days leaving the computer running KSP at max time compression just to cross a couple light years of distance, with cheats enabled in full.\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-08-04T12:04:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robbwiththehair\u0022 data-cite=\u0022Robbwiththehair\u0022\u003E\u003Cdiv\u003EThe reason why I said I thought a faster time acceleration \u0022warp drive\u0022 would be a much better idea was it wouldn\u0027t actually take away from the semi-realistic look of KSP. I have always preferred when the game isn\u0027t based around objectives that are simply non-existent in the real world (Kethane Mining etc.) so having a big red button on the cabin\u0027s dashboard that sends them to 10,000,000,000x time acceleration until they reach the SOI of another star system wouldn\u0027t actually break the rules of physics (or time) any more than KSP does already.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMeh, spending years of ingame time for a single transfer isn\u0027t that realistic either. Besides, the burn times would probably be hours long if you wanted to use any sort of realism in your engine design. \u003C/p\u003E\u003Cp\u003EAt heart, KSP is a game first, not a physics simlator. Having a goal that requires different methods would make it more fun, rather than just have intersteller flight being more of the same only longer.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-08-04T12:05:22Z","Content":"\n\u003Cp\u003EHow about a wormhole gate? The wormhole could be an easter egg that has to be found, and entering it would be the equivalent of 10,000,000,000x time warp that others are advocating. The travel time could be used to load up the new system, so it wouldn\u0027t need to interact with the Kerbol system, and as wormholes are known to exist, it would be semi-realistic.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-08-04T12:40:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarecrow88\u0022 data-cite=\u0022Scarecrow88\u0022\u003E\u003Cdiv\u003E and as wormholes are known to exist, it would be semi-realistic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmm what? That isn\u0027t true.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-04T12:40:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003E1 Orion is for huge loads, think 1000 ton ships however its very marginal for interstellar travel, you would need one gigantic one for that. \u003Cp\u003E2,3 vasmir is an improved ion engine higher trust and better isp, worse than orion as an interstelar drive. \u003C/p\u003E\u003Cp\u003E4 laser boosted solar sails might be an nice way to do interstellar probes, realistic but don\u0027t fit in the game. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EORION is marginal but it has a theoretical maximum velocity of 10%c (30 000km/s) for a flyby. A touch more than half that for a rendezvous. We\u0027re still looking at a 50-100yr mission to get to the nearest star, though, and Time Warping through that would basically end the game in the Kerbol system.\u003C/p\u003E\u003Cp\u003EAs for it being for gigantic ships, well, any interstellar craft getting anywhere in human-relevant time is going to be gigantic just to hold the necessary fuel. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Project_Daedalus\u0022 rel=\u0022external nofollow\u0022\u003EProject Daedalus\u003C/a\u003E was predicated on sending a two-stage fusion-powered fly-by probe to Barnard\u0027s Star (~6ly away) that\u0027d take 50 years to get there, and \u003Ca href=\u0022http://wordlesstech.com/2012/09/10/100-year-starship-project/\u0022 rel=\u0022external nofollow\u0022\u003Eit was as big as a city block\u003C/a\u003E complete with skyscrapers. Even the solar sail interstellar mission requires sails with diameters measured in kilometers and massing hundreds of tons to send anything bigger than a Stayputnik.\u003C/p\u003E\u003Cp\u003EI agree. Space is big. Really big. So big that I think KSP just can\u0027t reflect interstellar travel in anything like the way it explores interplanetary travel. (Maybe an end-game mission in career mode, like in the \u003Cem\u003ECivilization\u003C/em\u003E games, would be to construct one in orbit and send it off... but piloting it to another system would make the rest of the game moot because after a century of Time Warp you\u0027re looking at working with Jeb\u0027s grandchildren when you go back to Kerbin.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFusion engines sounds pretty much perfect, some work is actually done on an Fusion Pulse Drive. Not up to interstellar qualities but an good one would. \u003Cp\u003ENuclear salt water sounds insane to me compared to the orion, you would have control problems controlling the continuous detonation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed on both counts.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T13:00:52Z\u0022 title=\u002208/04/2013 01:00  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by Anton P. Nym\u003C/strong\u003E\n\u003Cbr\u003Eadding missing stuff, and taking out extra stuff.\n\u003C/span\u003E\n"},{"CreatedByName":"MRab2","CreatedById":22875,"CreatedDateTime":"2013-08-04T12:42:06Z","Content":"\n\u003Cp\u003EIf we\u0027re talking about travelling to other star systems, even ones a mere 0.1 light years away you\u0027re going to need an FTL system of some description. To those who say \u0022myeh we don\u0027t want not so sci-fi doo-hickies in our rear world physics game\u0022 I say \u0022sit down, be quiet and read the rest of the post before you begin typing\u0022.\u003C/p\u003E\u003Cp\u003EFirst, it\u0027s important to realise the game is a about building a space PROGRAM. This will mean, once your program is mature, that you\u0027ll have multiple missions running simultaneously. by the time you get to the point where you\u0027ve built your first intersteller ship there probably won\u0027t be a convenient point where you can effectively stop everything and let the game warp through the decades until a sub-light ship reaches its destination. You\u0027re likely going to have a lot of assets to keep an eye on, colonies to build up, resources to harvest etc etc.\u003C/p\u003E\u003Cp\u003EWhatever version of kerbal alarm clock eventually makes its in-game, it\u0027ll effectively make warping more than a few days or weeks (at most) largely impractical unless you shut down your entire program for the sake of one mission, and that may not actually be possible unless you bring every Kerbal back home. Remember, at some point in the future there\u0027s going to be an economy, you may have to deal with the issue of PAYING your Kerbal. There may be overhead costs that require you to keep everything simmering.\u003C/p\u003E\u003Cp\u003ETherefor a ship that can\u0027t get from point A to point B within a timeframe that suits the game becomes impractical. Remember folks, it\u0027s a game, so gameplay trumps physics.\u003C/p\u003E\u003Cp\u003EWith gameplay in mind, if Squad decide to go down the multiple star systems route I would suggest a ship that utilizes the Alcubierre drive (as that may actually be possible) - has to be assembled in orbit and require large amounts of difficult to obtain/expensive resources, and for the sake of gameplay can only be engaged once the ship has cleared the local star\u0027s SOI. Therefor, when it\u0027s not travelling FTL it acts as a normal spacecraft.\u003C/p\u003E\u003Cp\u003EGoing back to the sci-fi issue I would point out that the POINT of a space program is to get better at flying about in space and with that in mind it would seem perfectly acceptable for Squad to include more theoretical (and efficient) propulsion systems. For those that would object claiming this would make the chemical rocket obsolete I would point out the jet engine hasn\u0027t wiped out the turbo prop engine, just at diesel powered ships didn\u0027t wipe out the sail. Yes they pushed their predecessors into the fringe, but didn\u0027t wipe them out. Really it comes down to economics.\u003C/p\u003E\u003Cp\u003EFor example, even if you have an anti-matter powered ship that can run from Kerbal to Jool in a 1/20th the time of Chemically powered version they might still be used to lift stuff into orbit, or maybe running from Laythe to Jool to skim the atmosphere for resources (who knows). The point being part of the game SHOULD be about it getting easier and easier getting from A to B and that ships should get better and bigger (and cooler) as you progress through the game.\u003C/p\u003E\n"},{"CreatedByName":"MRab2","CreatedById":22875,"CreatedDateTime":"2013-08-04T12:48:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eurybaric\u0022 data-cite=\u0022eurybaric\u0022\u003E\u003Cdiv\u003EThe Alcubierre Drive (Warp Drive) theoretically can reach 10 times the speed of light\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid you\u0027ve made that up. iirc there is no theoretical upper limit. I read the paper a few months ago and speeds of 1000\u0027s of times C were mentioned, although (again iirc) 10\u0027s were also mentioned with more reasonable power requirements. Also, you\u0027re sublight velocity is a factor.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2013-08-04T13:53:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003E1. No one will build Orion. Detonating nuclear devices in space is a big No-No, and public gets hysteric at mere mention of nuclear powered satellites. There would be riots if someone proposed to send up spacecraft carrying hundreds of nuclear bombs..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, this is true.\u003C/p\u003E\u003Cp\u003EBut for interstellar travel we\u0027re talkig centuries in the future... it probably would have gone over in the 50s, so we can\u0027t say that that sort of attitudes aren\u0027t possible. And before we do anything interstellar, we\u0027ll likely have the solar system industrialized ... moving asteroids and stuff... which implies kinetic energies bigger than a nuclear explosion. Once such energies are \u0022normal\u0022 (and, airplanes for example have an insane amount of energy compared to what anybody could control in say 1600, and they\u0027re used by normal people, not just governments) the only different thing about nuclear is the radiation, and that won\u0027t matter in open space millions of km from any biosphere. \u003C/p\u003E\u003Cp\u003EAnd you wouldn\u0027t launch the Orion spacecraft from Earth, you\u0027d build it in the asteroid belt with asteroid-mined uranium. This is a project for a solar system when Earth is no longer the industrial and economic center...\u003C/p\u003E\n"},{"CreatedByName":"quietsamurai98","CreatedById":69270,"CreatedDateTime":"2013-08-04T14:53:30Z","Content":"\n\u003Cp\u003EOne way is that there could be Colony-inKerbal Packs*, which carry parts for a new Space Center, and the player would need to launch enough to an exoplanet to build the VAB, Launchpad, etc. so there is a quick way to get to another system, but you need to put some serious effort to set it up.\u003C/p\u003E\u003Cp\u003E*That\u0027s a reference to the game Spore. In Spore, there are colonies that you can just plop down on a planet called Colony-Incredi Packs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T15:01:53Z\u0022 title=\u002208/04/2013 03:01  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by quietsamurai98\u003C/strong\u003E\n\u003Cbr\u003ESpore reference. That game was awesome...\n\u003C/span\u003E\n"},{"CreatedByName":"MRab2","CreatedById":22875,"CreatedDateTime":"2013-08-04T15:03:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EAnd you wouldn\u0027t launch the Orion spacecraft from Earth, you\u0027d build it in the asteroid belt with asteroid-mined uranium. This is a project for a solar system when Earth is no longer the industrial and economic center...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m going to nitpick.\u003C/p\u003E\u003Cp\u003EEarth will always be the industrial and economic centre of the solar system simply because this will always be where most people live. A lot may be moved in LOE (but this will be specialist stuff that requires microgravity), but ultimately the end destination for the majority of the stuff mined in space will be the surface of the earth.\u003C/p\u003E\u003Cp\u003EHowever, I do agree the Orion spacecraft would never be built on Earth.\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-04T15:23:48Z","Content":"\n\u003Cp\u003EI would like a jump drive rather than a \u0022massive delta-v pointed in direction of distant object\u0022.\u003C/p\u003E\u003Cp\u003EMine enough kethane, anti-matter (after mining Jool\u0027s atmosphere) and other exotics. Put them all together somewhere and you\u0027ve got a nice jump drive that can get you roughly where you point it with only a chance of becoming a smear of annoyed exotic matter in the process.\u003C/p\u003E\u003Cp\u003EThe big caveat however is that each star has a velocity relative to Kerbol. So when you pop out of your event horizon (yikes!) jump you still have Kerbol\u0027s delta-v compared to the target star. So you have to really hope you brought enough boosters and struts to get captured by the new star.\u003C/p\u003E\u003Cp\u003EA large benefit of this is that, for the programmers, it\u0027s a universe reload rather than a slow distance changing number crunching conventional drive system.\u003C/p\u003E\u003Cp\u003EYes, it\u0027s scifi. Maybe you could call it a Kerkubierre drive and say that you can\u0027t see out of the warp field when it\u0027s on. That way it\u0027s essentially a jump; you switch it on, wait, it switches off and you\u0027re in another place.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-08-04T23:30:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003EUmm what? That isn\u0027t true.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf Einstein believed they were theoretically possible, that\u0027s good enough for me to believe they exist.\u003C/p\u003E\n"},{"CreatedByName":"Vonar","CreatedById":55997,"CreatedDateTime":"2013-08-05T00:24:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003E1. No one will build Orion. Detonating nuclear devices in space is a big No-No, and public gets hysteric at mere mention of nuclear powered satellites. There would be riots if someone proposed to send up spacecraft carrying hundreds of nuclear bombs.\u003Cp\u003E2. VASIMR, while undeniably cool is not up to interstellar levels of power. Best we have is 200kW engine with huge power consumption.\u003C/p\u003E\u003Cp\u003E3.Accelerating the probe to noticeable fraction of lightspeed with ion engines would be a herculean task. Abysmal thrust combined with high power demands would mean decades of acceleration.\u003C/p\u003E\u003Cp\u003E4. Solar sails...No one came with idea how to build a sail big enough, and still controllable as of yet.\u003C/p\u003E\u003Cp\u003ENo, we need better engines to reach other stars in reasonable time. Warp drive would be best option, but it is still theoretical. Other promising options are: Fission Fragment engine, Fusion Driven Rocket (aka. Fusion Pulse Drive), Nuclear Lightbulb engine, Nuclear Saltwater engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOrion is completely viable as a interstellar propulsion system, Orion was tested in real life on a smaller 1-meter scale mockup back in 1958, and wouldn\u0027t be any more costly to mankind then the 2000 plus nuclear tests that were conducted back during the Cold War. The only thing preventing us from building a Orion-type starship and launching it into orbit as is the Partial Nuclear Test Ban Treaty. Everything else you proposed requires years if not decades of research and development before it even get\u0027s off the ground. Orion is something that can be done with today\u0027s technologies, and would be a great way to facilitate denuclearization.\u003C/p\u003E\n"},{"CreatedByName":"Rufus Callahan","CreatedById":58248,"CreatedDateTime":"2013-08-05T01:19:23Z","Content":"\n\u003Cp\u003EI\u0027m not sure if it has been suggested or not, but maybe kerbal scientists will discover that the Kerbol system is actually part of a binary (or trinary?) system, with planets around each individual star? This would make the distances much more manageable without \u0022magical\u0022 star trek like technology. \u003C/p\u003E\u003Cp\u003EFor example, the closest star system to Earth is Alpha Centauri. It is a multiple star system with two similar sized stars (Alpha Centauri A and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E which are similar in size to the Sun. The two stars are roughly the distance that Neptune is from our sun. There is a third \u0022companion star\u0022 (Proxima Centauri, or Alpha Centauri C) that is much smaller (red dwarf) and is much farther away (about .2 light years, or 400 times the distance from the sun to neptune). To me, if the Kerbol system turned out to be similar, it would make interstellar travel much more manageable and feasible.\u003C/p\u003E\n"},{"CreatedByName":"MrJPenguin1","CreatedById":75426,"CreatedDateTime":"2013-08-05T02:10:23Z","Content":"\n\u003Cp\u003EI think, that on each planet and moon, there would be a piece of a warp drive that would eventually build something that would be incredibly powerful and efficient and you would unlock a new solar system. Using the warp drive, you could get to the new system. Or maybe in place of the warp drive pieces, you\u0027d have to find all of the easter eggs and then the new solar system would be unlocked. If that were the case, then there would be a real reason to travel to the planets and moons in KSP. Sure, it would be very challenging, but that\u0027s the fun part about it!\u003C/p\u003E\n"},{"CreatedByName":"lucas1121111","CreatedById":77597,"CreatedDateTime":"2013-08-05T05:41:31Z","Content":"\n\u003Cp\u003EHow about in order to travel to another star system, you would have to leave the Kerbal system at a certain speed and angle to get there (speed made possible upon new parts) and the new system renders when such an action is performed\u003C/p\u003E\n"},{"CreatedByName":"TheCosmicOwl","CreatedById":77620,"CreatedDateTime":"2013-08-05T09:39:27Z","Content":"\n\u003Cp\u003EPerhaps the sun (known as kerbol) could be orbiting a much larger star. Escaping the orbit of the sun kerbol leaves you in orbit of a larger star, which can have many star systems orbiting it.\u003C/p\u003E\n"},{"CreatedByName":"Kelvin","CreatedById":77622,"CreatedDateTime":"2013-08-05T10:16:19Z","Content":"\n\u003Cp\u003EWell, since the planets and sun in the Kerbol system are already reduced in scale compared to our own system, perhaps reduce the scale of distance in light years to other systems? I think both cryogenics and million X warping would have to be implemented if you want to consider space travel by a more realistic approach, perhaps only allowable once in interstellar space. \u003C/p\u003E\u003Cp\u003EI don\u0027t think that a slow progression to more powerful, more efficient rockets in KSP would make the game stale either... its the future for any space faring race. It\u0027s just a matter of scaling realistically, especially if career mode becomes a thing. If certain technologies were only made available by collecting resources from other planets, it would set up that challenge for the player before allowing him to make those little steps towards interstellar travel. Perhaps implement a tier system to technology?\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-08-05T11:42:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eurybaric\u0022 data-cite=\u0022eurybaric\u0022\u003E\u003Cdiv\u003EWell, not necessarily. For example Alpha Centauri, the closest star to our Sun, is about 4.3 LY away. Lets make that 5 for the sake of simplicity. The Alcubierre Drive (Warp Drive) theoretically can reach 10 times the speed of light, so that means it\u0027ll take us 0.5 years, or 182.5 days to get there. and at 100 000x warp speed, that\u0027d take us around 2.8 minutes of ingame time to reach if my calculations are correct (not *too* confident bout those since its 6:40 in the morning, I havent slept, and im halfway drunk \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003Cp\u003EFeasible.\u003C/p\u003E\u003Cp\u003ECheers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou forget an important thing here: acceleration time. To reach that speed takes time, and depending on the SciFi book you use as a source you may have to travel out of a star\u0027s SOI in order to engage it.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-05T14:01:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eyou forget an important thing here: acceleration time. To reach that speed takes time, and depending on the SciFi book you use as a source you may have to travel out of a star\u0027s SOI in order to engage it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, and, if we don\u0027t, we have one other problem; balance - the warp drive would trivialise moving about the Kerbol system as soon as it was obtained, much like the orion engine currently does in the mod.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-08-05T14:14:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Necandi Brasil\u0022 data-cite=\u0022Necandi Brasil\u0022\u003E\u003Cdiv\u003EI don\u0027t like the idea of adding sci fi tech in ksp... Leave this to EVE online , Mass Effect , etc...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d prefer there to be futuristic parts higher up the tech tree in career so there would be quite a lot of research. But only if these parts made sense according to physics and are theoretically possible.\u003C/p\u003E\u003Cp\u003EI don\u0027t like calling all these things strictly sci-fi as that suggest that it is impossible to advance beyond where we are. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}