{"TopicId":41005,"ForumId":24,"TopicTitle":"Brand New To KSP","CreatedByName":"Doddley","CreatedById":77504,"CreatedDateTime":"2013-08-04T16:20:04Z","PageNum":1,"Articles":[{"CreatedByName":"Doddley","CreatedById":77504,"CreatedDateTime":"2013-08-04T16:20:04Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI just started playing KSP and am trying to get familiar with the game play.\u003C/p\u003E\u003Cp\u003ESo far I have been able to build a rocket to send a few Kerbals to orbit.\u003C/p\u003E\u003Cp\u003EI have a few quick questions.\u003C/p\u003E\u003Cp\u003EAre there achievements/missions?\u003C/p\u003E\u003Cp\u003ERight now I have two Kerbals in orbit in ships with no fuel. Is there a way to rescue them or should I just revert the flight?\u003C/p\u003E\u003Cp\u003EI have been able to land two others back on Kerbin. How to I end the flights without reverting back?\u003C/p\u003E\u003Cp\u003EThanks a lot.\u003C/p\u003E\n"},{"CreatedByName":"Robbii6","CreatedById":69855,"CreatedDateTime":"2013-08-04T17:28:13Z","Content":"\n\u003Cp\u003ERight now there are no achievements or missions, however the devs are starting to implement career features and in a few updates down the line we could see missions. If by achievement you mean like steam achievements then no. The devs have said there will not be achievements.\u003C/p\u003E\u003Cp\u003EYou could very easily revert the flight but...where\u0027s the fun in that. Rescue them man. You can rendezvous ships in orbit and give them fuel or change ship. NOTE: to give them fuel you will need to dock. if you dont have a docking port you cannot dock. if this is the case send an empty ship up and get the kerbal into the rescue ship.\u003C/p\u003E\u003Cp\u003EHope this helps have fun with a rendezvous misson!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ERob\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T17:30:17Z\u0022 title=\u002208/04/2013 05:30  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by Robbii6\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-08-04T17:54:06Z","Content":"\n\u003Cp\u003EWelcome to the forums! If you want to just end the flight, then you can go to the Tracking Station and click the \u0022Terminate Flight\u0022 button. However, this will kill everyone on board. If you want to save them, then send a rescue ship and bring them back.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-08-04T21:23:19Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Doddley","CreatedById":77504,"CreatedDateTime":"2013-08-08T17:02:27Z","Content":"\n\u003Cp\u003EOK...so I got my recovery craft about 25k away from my stranded Kerbal in the dead craft. The orbits are close to the same, at least from what I can tell by looking at the map. Does anyone have any guidance as to the best way to narrow the gap the last 25k? \u003C/p\u003E\u003Cp\u003EThe rescue craft is unmanned. The plan was to do EVA the stranded Kerbal to the recovery craft.\u003C/p\u003E\u003Cp\u003EHere are a few pics to show what I am talking about.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s17.postimg.org/sbb9suk63/Craft.jpg\u0022 alt=\u0022Craft.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s17.postimg.org/e65gr1b4r/Orbit.jpg\u0022 alt=\u0022Orbit.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Doddley","CreatedById":77504,"CreatedDateTime":"2013-08-08T17:24:36Z","Content":"\n\u003Cp\u003EBigger Pics\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/zlxjk8.jpg\u0022 alt=\u0022zlxjk8.jpg\u0022\u003E\u003Cimg src=\u0022http://i40.tinypic.com/14kh44p.jpg\u0022 alt=\u002214kh44p.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-08-08T22:07:20Z","Content":"\n\u003Cp\u003EYou need to set the stranded ship as a target. This will give you a new target marker on the nav ball. Burn towards this without going mad on the speed. Once you get closer or if the distance between the two starts to get bigger rather than smaller, turn to burn retrograde to kill your relative velocity, and then burn towards your target marker again. It\u0027s usually best to do this in lots of small, relatively slow steps, rather than in one big one, until you really know what you are doing. This should allow you to close the gap down sufficiently to get your craft close enough to allow your stranded Kerbal to EVA across to the rescue ship.\u003C/p\u003E\n"}]}