{"TopicId":41094,"ForumId":24,"TopicTitle":"Newbies and Learning Curves","CreatedByName":"Longsok","CreatedById":75454,"CreatedDateTime":"2013-08-05T05:12:32Z","PageNum":1,"Articles":[{"CreatedByName":"Longsok","CreatedById":75454,"CreatedDateTime":"2013-08-05T05:12:32Z","Content":"\n\u003Cp\u003ESince I didn\u0027t see any topics discussing the substantial learning curve in KSP, I decided to start this. Just getting to the Mun takes a long time to figure out, because you need to learn how to build a stable rocket, achieve Orbit, control your orbit, and land. I\u0027m still trying to figure out landing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E It seems practice makes perfect, and that some of the maneuvers you just learn over time, but I am not looking forward to guessing windows to interplanetary flights. Any problems you have had with the learning curve?\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-08-05T05:31:46Z","Content":"\n\u003Cp\u003EI started playing back in 0.13, when we didn\u0027t have patched conics. You had to eyeball your intercept course. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou might want to try a Minmus landing first, since it\u0027s gravity is lower and it gives you a bigger margin of error. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-08-05T12:29:41Z","Content":"\n\u003Cp\u003EJust take it one step at the time. I remember my own first mun landings, they were really difficult, lots of crashes. The thing i like about ksp is that you can learn everything as you go along. An exception might be rendezvousing and docking which is hard to figure out by yourself, but most of the other stuff you can figure it out as you go. \u003C/p\u003E\u003Cp\u003EFor example windows for going to another planet: you don\u0027t need really to now. If you launch right now, escape Kerbin gravity altogether and then on your new orbit around the sun just figure out where to burn to get to Duna, just like looking you did when going to the Mun from Kerbin is good enough. Maybe your kerbals spend two years in a space ship instead of six months, they don\u0027t mind at all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut maybe the essential point in this discussion is whether or not you enjoy playing the game while you\u0027re not yet able to do everything yet. I can imagine some might want to reach a specific goal and don\u0027t like figuring out everything it takes to do, so the game is not fun for that person. For others part of what makes it challenging is what makes it rewarding, i.e. not have everything set out. So the learning curve in ksp might be large in that there is allot to learn but it\u0027s don\u0027t think its necessarily steep.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-08-05T12:39:44Z","Content":"\n\u003Cp\u003ELearning how to do stuff is the biggest enjoyment for me. When the rover you designed and stuck onto the rocket you designed and then you fly it to the Mun and charge around with your shiny new ion drive powered Mun buggy...you feel epic.\u003C/p\u003E\u003Cp\u003EIf it was easy then it wouldn\u0027t be fun, you\u0027d do everything you can do within a few hours and everyone would go home feeling cheated. Working all the bits out for a successful Mun landing is completely normal and takes a bit of time. There\u0027s plenty of help out there, on youtube and wikipedia, if you get too stuck with anything and these forums are full of friendly and helpful people as well.\u003C/p\u003E\u003Cp\u003EJust take your time, learn from your mistakes and you\u0027ll get there, and when you do you\u0027ll have a huge sense of achievement and a warm feeling of smug superiority as well.\u003C/p\u003E\u003Cp\u003EHave fun.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-08-05T18:04:16Z","Content":"\n\u003Cp\u003EJust an example of what i said in my previous post. Had a ship in orbit which was probably large enough to get to Duna or Eve and land on their moons.\u003C/p\u003E\u003Cp\u003EDecided to go to Eve since I haven\u0027t been there yet, but after I left Kerbin I found out there was no fast window to Eve. (This would be easy to find out beforehand, place one maneuver node to take you out of kerbin, then place a second one on the projected orbit and try to get a rendevous.) But had already \u0022used\u0022 the first node before I found out, so i decided to go to Moho instead. Moho had a different inclination, but the right moment to match its inclination was a few days away. After doing the inclination matching burn and looking at how much the transfer burn would need I feared there was no way I had enough fuel to make it back. To prevent my kerbals being stranded there for years I hammered out a much bigger ship to send after it. After the second ship left kerbin it seemed to be a little ahead and it looks like it might get there before the original ship does, but to physicist inside of me that sounds unlikely. I guess I\u0027ll learn that when they get there. I will also find out if my little moon lander can land on Moho.\u003C/p\u003E\u003Cp\u003EPS: I know this is a really bad way to do missions. A little reading tutorials and looking around on the forums would have prevented this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-05T18:12:02Z\u0022 title=\u002208/05/2013 06:12  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 5, 2013\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fett2oo5","CreatedById":77444,"CreatedDateTime":"2013-08-05T19:07:19Z","Content":"\n\u003Cp\u003EI have been wanting to play KSP for a long time and finally got a computer that will run it, then DL\u0027d it last weekend. I played the default in-game tutorials and had an absolute great time. It is fun, challenging, and uses real math which I love. Awesome options for building your own craft which is amazing in and of itself.\u003C/p\u003E\u003Cp\u003EHowever, the learning curve on ship design and mission planning is tremendously high, excessively frustratingly high.\u003C/p\u003E\u003Cp\u003EI wish there were more tutorials just for craft and mission planning.\u003C/p\u003E\u003Cp\u003EImportant parts (how and why they are important)\u003C/p\u003E\u003Cp\u003ELearn what parts to use, when, and why.\u003C/p\u003E\u003Cp\u003ETutorial for making task specific craft: Rocket to put a SAT in orbit; Rocket to get to the Mun; Craft to get to Mun then stage a landing. Not build it for you, but point you in the right direction.\u003C/p\u003E\u003Cp\u003ETutorial on how to make a stable space plane; How to calculate Bingo-Fuel range.\u003C/p\u003E\u003Cp\u003EI wish there were so many more tutorials that introduce you to the different aspects of the game, even if these are created by the community. I believe some (in-game) \u0022introductory\u0022 tutorials to the different aspects of the game would aid in appealing to a broader audience, but much more importantly would be kinder on a newbie.\u003C/p\u003E\n"},{"CreatedByName":"Herbin","CreatedById":75968,"CreatedDateTime":"2013-08-05T19:38:00Z","Content":"\n\u003Cp\u003EThe learning curve isn\u0027t too bad from what I\u0027ve encountered. Only put a bit shy of 40 hours into the game and I\u0027m doing mun landings ( have a base there too ) , satellites, a space station for off-planet fueling , various orbits, and a successful Minmus landing / intercept. Not the worst learning curve by far, but a bit intimidating for those not wanting to try new things.\u003C/p\u003E\n"},{"CreatedByName":"Longsok","CreatedById":75454,"CreatedDateTime":"2013-08-06T03:08:26Z","Content":"\n\u003Cp\u003EYeah, the learning curve is not as bad as some(looking at Dwarf Fortress:D), but I think that the closest thing to levels is the learning curve. In-game, I can build a rocket that will go to Eeloo, but the reason I can\u0027t get there is I don\u0027t know how yet. It is a hugely different experience from any other game I played. It is really interesting how this is really a game based on learning.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-08-06T04:00:17Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Space Ace","CreatedById":77819,"CreatedDateTime":"2013-08-06T13:57:00Z","Content":"\n\u003Cp\u003EI think the learning courve ... however steep or shallow it might be is the bread and butter of KSP. You take one step at a time.\u003C/p\u003E\u003Cp\u003EFirst build something that doesn\u0027t explode on the launchpad\u003C/p\u003E\u003Cp\u003E2nd build something that actually gets into space!\u003C/p\u003E\u003Cp\u003E3rd achieve a (somewhat) stable orbit\u003C/p\u003E\u003Cp\u003EAfter that it gets really interesting - I tried to go for the Mun first obviously. Months later I still love it - something that clearly can\u0027t be said about every game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}