{"TopicId":41116,"ForumId":55,"TopicTitle":"Store ship as part","CreatedByName":"SeveQ","CreatedById":77608,"CreatedDateTime":"2013-08-05T09:10:17Z","PageNum":1,"Articles":[{"CreatedByName":"SeveQ","CreatedById":77608,"CreatedDateTime":"2013-08-05T09:10:17Z","Content":"\n\u003Cp\u003EHi folks,\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing KSP for a while now and like it very much. A bit laggy here and there but that\u0027s okay as it\u0027s still alpha.\u003C/p\u003E\u003Cp\u003EWell, one suggestion I\u0027d like to make is to implement the ability to save a \u0022ship\u0022 (a group of parts that is) as a part in order to make it reusable in other ships. Like, let\u0027s say, for example I\u0027ve got a space station part consisting of some docking ports, some fuselage parts, some controlling parts and stuff like that. Everything that\u0027s needed for it to dock to an already existing space station once it has rendezvoused with the space station itself. And on the other hand I\u0027ve got a transport vessel without any other parts than thrusters, fuel tanks, some other controlling parts and aerodynamic parts for stability, like, everything that\u0027s needed to get a payload of some kind up into orbit and make some rendezvous maneuvers. Two totally independed \u0022ships\u0022 that could be combined. \u003C/p\u003E\u003Cp\u003EIn 0.21 I understand I can only load one of these two ready made \u0022ships\u0022 and have to build up the other part from scratch. I cannot combine two complete ships into one. \u003C/p\u003E\u003Cp\u003EHence I\u0027d like to save these two ships as, say, templates that I can load into the ship I\u0027m currently building. \u003C/p\u003E\u003Cp\u003EDon\u0027t know if this has been suggested before. If it has, I apologize for reposting... \u003C/p\u003E\u003Cp\u003EWhat do you think? \u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EHendrik\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-08-05T09:52:19Z","Content":"\n\u003Cp\u003EHey SeveQ,\u003C/p\u003E\u003Cp\u003EIt is on the planned feature list: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Planned_features\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Planned_features\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor now you have the choice to use the mod SubAssembly Manager: \u003Ca href=\u0022http://kerbalspaceprogram.com/subassembly-manager/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/subassembly-manager/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2013-08-05T10:23:29Z","Content":"\n\u003Cp\u003EYup subassembly manager is an ACE mod (or was last time i used it- yet to get it for the latest version)\u003C/p\u003E\u003Cp\u003Eby moving the save file of an appropriate ship (the \u0022parent\u0022 part must have a free node) to the correct folder you can make it replicate 100%, fuel lines and struts perfect.\u003C/p\u003E\u003Cp\u003EI use subassembly for managing my Launch vehicles with great success.\u003C/p\u003E\n"},{"CreatedByName":"SeveQ","CreatedById":77608,"CreatedDateTime":"2013-08-05T11:46:29Z","Content":"\n\u003Cp\u003EI knew I missed something... That\u0027s exactly what I\u0027ve been looking for. It\u0027s way too obvious for not being on the planned feature list. \u003C/p\u003E\u003Cp\u003EWell, thanks a lot! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}