{"TopicId":41192,"ForumId":44,"TopicTitle":"how would I work out the damage caused from a shockwave?","CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-05T19:34:20Z","PageNum":1,"Articles":[{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-05T19:34:20Z","Content":"\n\u003Cp\u003EI have a rough short story in my head where a captain of an unarmed spaceship attacks a city by flying past it very, very fast.\u003C/p\u003E\u003Cp\u003EAssuming I had a ship with a 100 meter diameter spherical shield that reflected all thermal and kinetic energy (I know!), how fast would I need to go for a shockwave to destroy a city like an atomic bomb? Is that even possible? How would I work the damage or at least the kinetic/thermal energy that such a flyby would generate?\u003C/p\u003E\n"},{"CreatedByName":"Ben 9072","CreatedById":72430,"CreatedDateTime":"2013-08-05T20:33:28Z","Content":"\n\u003Cp\u003EThe easiest way I could think to do it would be to take the energy released by an atomic bomb (around 90 TJ, according to \u003Ca href=\u0022https://en.wikipedia.org/wiki/Nuclear_weapon_yield\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Nuclear_weapon_yield\u003C/a\u003E) and set it equal to the energy dissipation by flying at a constant velocity above the city at a very low altitude for the distance equaling the diameter of the city. This could be found by integrating the force of air resistance over the distance traveled: \u003Cstrong\u003E90TJ=integral(1/2*rho*v^2*Cd*A)*dS\u003C/strong\u003E, where rho is fluid density, v is velocity, Cd is your drag coefficient (which would be for a sphere), A is your area (10000pi m^2), and dS is your path differential that you fly along.\u003C/p\u003E\u003Cp\u003E(I really wish KSP forums had LATEX support.)\u003C/p\u003E\u003Cp\u003EHowever, this would be virtually impossible to achieve, as the drag coefficient sharply decreases at supersonic speeds, as shown:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://history.nasa.gov/SP-4219/4219-082.jpg\u0022 alt=\u00224219-082.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETheortically, you could reach a high enough velocity where the v^2 would exceed the decreasing Cd, but I would wager that it would be at relativistic speeds.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure KSP doesn\u0027t include the decreasing drag coefficient (not sure though), so it could be obtained in KSP, but realistically, you could never obtain this, as engines that powerful aren\u0027t in the game.\u003C/p\u003E\n"},{"CreatedByName":"Lanfranc","CreatedById":67288,"CreatedDateTime":"2013-08-05T20:56:34Z","Content":"\n\u003Cp\u003EMythbusters did an episode about damage caused by shockwaves from supersonic fighter jets. As I recall, they could only get a measureable effect with a flyby at a couple hundred feet, and even then it was only a cracked window. There\u0027s just not that much pressure involved.\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2013-08-05T22:12:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lanfranc\u0022 data-cite=\u0022Lanfranc\u0022\u003E\u003Cdiv\u003EMythbusters did an episode about damage caused by shockwaves from supersonic fighter jets. As I recall, they could only get a measureable effect with a flyby at a couple hundred feet, and even then it was only a cracked window. There\u0027s just not that much pressure involved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut that was with an FA-18 Hornet fighter jet, going not much faster than Mach 1. This is a 100 meter in diameter sphere going at MUCH faster speeds.\u003C/p\u003E\n"},{"CreatedByName":"Lanfranc","CreatedById":67288,"CreatedDateTime":"2013-08-05T22:32:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fox62\u0022 data-cite=\u0022Fox62\u0022\u003E\u003Cdiv\u003EBut that was with an FA-18 Hornet fighter jet, going not much faster than Mach 1. This is a 100 meter in diameter sphere going at MUCH faster speeds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI honestly don\u0027t think it\u0027d make much of a difference at least for the sonic boom, since at least at reasonable speeds, we\u0027re still talking in terms of pressures of pounds/foot. NASA has a \u003Ca href=\u0022http://www.nasa.gov/centers/dryden/news/FactSheets/FS-016-DFRC.html\u0022 rel=\u0022external nofollow\u0022\u003Esmall page\u003C/a\u003E about it.\u003C/p\u003E\u003Cp\u003EOf course, if we\u0027re talking about \u003Cem\u003Eunreasonable\u003C/em\u003E (i.e. relativistic) speeds, things get much more interesting, since the movement of the vehicle through the air would actually cause a fusion reaction. XKCD\u0027s What If? \u003Ca href=\u0022http://what-if.xkcd.com/1/\u0022 rel=\u0022external nofollow\u0022\u003Elooked into that\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-06T11:24:04Z","Content":"\n\u003Cp\u003EThanks guys, some interesting things to look into!\u003C/p\u003E\n"}]}