{"TopicId":41317,"ForumId":39,"TopicTitle":"The KSP Naval Academy","CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-06T16:24:42Z","PageNum":5,"Articles":[{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-19T16:23:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sliinty\u0022 data-cite=\u0022Sliinty\u0022\u003E\u003Cdiv\u003EWhere did you get 65-80T from? KIDA and the rest of the nav-com thread agree on 50-150T, looking more to the top end of the spectrum. A 65T ship is gonna have a hard time with dV or acceleration lugging around armour and any weaponry worthy of the title \u0022destroyer\u0022 imo (you would hopefully expect a destroyer to have decent weapons...), \u0022Huge\u0022 ships dont really exist, the only dreadnought thats seroiously been designed is zekes\u0027 1kT monstrosity, so calling something less than 1/10 that size a destroyer is pretty weak...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E150 tons? cool, i can post my super heavy destroyer...\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-20T00:41:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003EWell, mass is weird. Most people measure it as\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EFighter= 0-20\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ELight Cruiser= 20-65\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EDestroyer= 65-80\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u0022Frigate\u0022 (although i personally think this is an outdated term)= 80-140\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EBattlecruiser= 140-200\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EDreadnought= 200\u002B\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHowever this scale is slightly inaccurate as \u0022Light Cruiser\u0022 is actually bigger than destroyers. Destroyers are designed to work in fleets to attack enemy capital ships.\u003C/p\u003E\u003Cp\u003EPersonally i would put them at 30-60 tons. Here\u0027s Zokesia\u0027s scale:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EFighter= 0-30\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EDestroyer= 30-65\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ELight Cruiser= 65-120\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EArmored Cruiser= 120-250\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EBattlecruiser= 250-400\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EDreadnought= 400\u002B \u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can understand where people want to make space destroyers larger than cruisers. Many scifi shows have done this, Babylon 5 and Star Wars are the most notable. Since destroyers are supposed to be fast and heavily armored, and cruisers are just large interceptors. In most cases the idea of ship classification by size with names like battleship, cruiser, destroyer, dreadnaught, and the like are all a bit hard to define. Frigates in the US modern navy are ding replaced by the destroyer classification, as are smaller light cruisers; battleships are almost entierly being phased out in favor of smaller more maneuverable ships with lots and lots of missiles. The dreadnaught was a term used in WWI to describe huge warships that would in WWII fall under the battleship category. It may be safe to say that to classify ship roles by sizes is unreliable and depending on your definition of the class its self misleading. I may now move in favor of a different approach all together.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ELight= 0-30\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EMedium= 30-65\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EHeavy= 65-120\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ELight Capitol Ship= 120-250\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ECapitol Ship= 250-400\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EHeavy Capitol Ship= 400\u002B\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWith the carrier having its own size types as well for carrier rules. Carriers are not battleships they are support ships that carry warships and should be treated differently than other warship classes. Sticking a heavy weapon on a carrier makes it a warship however, like a battleship with its own fighter escort and will be classified in its weight class weapons included but not fighters. Also carriers have at a minimum of 2 fighter craft or 4 drone craft to be considered a carrier, but should also have a separate manned control pod to distinguish it from just a launch stage. External docking ports are also not counted when defigning a ship as a carrier. An external docking port is facing outward and not shielded on more than 2 sides.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EUltra Light Carrier= 30-70\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ELight Carrier= 70-100\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ECarrier= 100-200\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003ESuper Carrier= 200-400\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EFleet Carrier= 400\u002B\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHow does this sound? This way people can call whatever ship size they want a destroyer, battleship, light cruiser, war cruiser, bird of pray, battle-star, etc...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T00:52:57Z\u0022 title=\u002208/20/2013 12:52  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by camulus777\u003C/strong\u003E\n\u003Cbr\u003Ecolor change\n\u003C/span\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-20T02:00:34Z","Content":"\n\u003Cp\u003EI like that idea. Very easy to use.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-20T05:40:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sliinty\u0022 data-cite=\u0022Sliinty\u0022\u003E\u003Cdiv\u003EWhere did you get 65-80T from? KIDA and the rest of the nav-com thread agree on 50-150T, looking more to the top end of the spectrum. A 65T ship is gonna have a hard time with dV or acceleration lugging around armour and any weaponry worthy of the title \u0022destroyer\u0022 imo (you would hopefully expect a destroyer to have decent weapons...), \u0022Huge\u0022 ships dont really exist, the only dreadnought thats seroiously been designed is zekes\u0027 1kT monstrosity, so calling something less than 1/10 that size a destroyer is pretty weak...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eya i read the thread and changed my request as well as my definition of ship classifications to include all of the various threads and the different rules they have. Thanks for the heads up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sliinty","CreatedById":66232,"CreatedDateTime":"2013-08-20T14:02:32Z","Content":"\n\u003Cp\u003ENot that any \u0022ship\u0022 classifications make sense in space lol\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-20T21:36:44Z","Content":"\n\u003Cp\u003EThat is true ship classifications vary so much between nation and time period that most don\u0027t even exist anymore. A scoon was a small sail ship that had a single gun deck and a crew of 10-15, and it originated from the slightly larger fast multy-masted ship known as a scooner that its self varied in size from two to four masts. The old frigate of the seas in the 1700\u0027s was at one point one of the largest ships afloat and now is considered one of the smallest. Not to mention the poor Man \u0022O\u0022 War that has not existed for hundreds of years.\u003C/p\u003E\n"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2013-08-22T02:20:36Z","Content":"\n\u003Cp\u003ENext video? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-22T09:26:38Z","Content":"\n\u003Cp\u003EIn the morning i hope. I\u0027m sick, and the kids are sick to so its kinda hard but it should be done in the morning. I\u0027ve got to find a way to get more people to watch it. Any suggestions? I thought about doing some commonly searched tutorials like VTOL and SSTO or getting to the Mun or getting to Duna. Think that will help?\u003C/p\u003E\n"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2013-08-22T14:47:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022camulus777\u0022 data-cite=\u0022camulus777\u0022\u003E\u003Cdiv\u003EIn the morning i hope. I\u0027m sick, and the kids are sick to so its kinda hard but it should be done in the morning. I\u0027ve got to find a way to get more people to watch it. Any suggestions? I thought about doing some commonly searched tutorials like VTOL and SSTO or getting to the Mun or getting to Duna. Think that will help?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould post them in the video section. I sometimes do that. Lots of people watch it here - but I don\u0027t think they count as views on You Tube.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T02:02:52Z","Content":"\n\u003Cp\u003EI\u0027ll try puting a trailer of some sort and then a link to the main video, but for some reason this video is taking like 900 min to upload. I started a controversial debate on another youtube video that has taken on a life of its own and that was very much not my intention. So maybe they are punishing me for posting such a non popular topic. LOL probably not, but I\u0027ve uploaded it 4 times and if I shut off my computer it does not pick back up where it stopped it just stops and i have to start over. Only a 10 word comment to. It was not, distastful or, raciest or, hateful in any way either.\u003C/p\u003E\u003Cp\u003EAlso it doesn\u0027t play my music and i recorded some of that stuff my self. This is probably an operator error with the video making software lol\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-23T02:07:47Z","Content":"\n\u003Cp\u003Eok well we\u0027re all looking forward to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T04:06:08Z","Content":"\n\u003Cp\u003Estarted 3 hours ago with the upload and its at 17% yay... WTF its a smaller video than the other two by 5 min. I don\u0027t think youtube likes me any more.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T04:53:11Z","Content":"\n\u003Cp\u003E24% man ive got to find out whats wrong this is ridiculous.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-08-23T05:06:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022camulus777\u0022 data-cite=\u0022camulus777\u0022\u003E\u003Cdiv\u003E24% man ive got to find out whats wrong this is ridiculous.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA combination of fraps and youtube.I get 1k min upload times for a 10 minute video.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-08-23T05:28:06Z","Content":"\n\u003Cp\u003EOkay, I\u0027m kinda confused to how this thread has been sitting in the Gameplay Questions forum for this long when it really just isn\u0027t supposed to be here. After a bit of reading, I\u0027ll be moving this to the KSP Fanworks section. camulus, if you think this thread should be in another forum, feel free to PM me with where you think it should be, I\u0027ll see if it\u0027s worth moving it again. This being said, moving this to the fanworks section.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T05:33:47Z","Content":"\n\u003Cp\u003EThat sucks i used fraps for the last video too and it took 20 min tops.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T07:00:17Z","Content":"\n\u003Cp\u003Ethe upload stopped its self. I\u0027m starting to not like youtube.\u003C/p\u003E\n"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2013-08-23T15:49:09Z","Content":"\n\u003Cp\u003EFunny. My 14 minute Minecraft videos take FOREVER but normally my 14 minute KSP videos take about 20 minutes or so. I figured it was just less data or something. And I have a wireless modem too. All kinds of problems with that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t like YouTube mostly because the adds are starting to cover the whole screen and because of their flagging certain videos with copyright issues and stuff. One of my videos was banned world-wide! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I feel so proud....\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-23T16:27:33Z","Content":"\n\u003Cp\u003EWell its up finaly and ive got some music, not mine but i found out where enter ilisium found all his songs lol i almost used them but then realized why they were so familiar. He uses the same sigh for music lol.\u003C/p\u003E\n"},{"CreatedByName":"Commander Wilmot","CreatedById":79717,"CreatedDateTime":"2013-08-24T19:49:42Z","Content":"\n\u003Cp\u003EI have a destroyer I am working on finishing and then I will need help testing. I intend to upload it to my spaceport account and the KIDA thread, but I was wondering if anyone here would be interested in testing. This ship might be a bit different as it carries four of these cruise missiles. (See Image Below) The provisional name for the class of ship\u0027s is the Flail Guided Missile Destroyer. My idea is that these missiles would be launched and manually guided to the target, targeting would be similar to docking, match orbits and try to catch up with the ship and then colliding.\u003C/p\u003E\u003Cp\u003EWould this ship\u0027s weaponry be against the rules concerning ramming (I don\u0027t think so, but if it is I can rearm it)? And would it be too difficult to use the weapons? I haven\u0027t heard of anyone with this system, but maybe that\u0027s because the missiles don\u0027t work that well within the rules of the game?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/UvoMLmp\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UvoMLmp.jpg\u0022 alt=\u0022UvoMLmp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-24T20:58:16Z","Content":"\n\u003Cp\u003Eloved the vid! Next you should do capital ships \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2013-08-25T05:09:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Wilmot\u0022 data-cite=\u0022Commander Wilmot\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWould this ship\u0027s weaponry be against the rules concerning ramming (I don\u0027t think so, but if it is I can rearm it)? And would it be too difficult to use the weapons? I haven\u0027t heard of anyone with this system, but maybe that\u0027s because the missiles don\u0027t work that well within the rules of the game?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/UvoMLmp\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UvoMLmp.jpg\u0022 alt=\u0022UvoMLmp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnmanned guided missiles seem to be the normal for some of the bigger capital ships. I guess whoever you did battle with would have to agree to it just like the ramming rule.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2013-08-26T12:35:25Z","Content":"\n\u003Cp\u003Elike i said i will do cruise missiles in my next vid and i think i will cover that concern. I don\u0027t use manned missiles to take out ships i use them to hit ground targets, and i\u0027ve gotten very good at it. I can hit a white cone 9/10 with 3 of my cruise missile designs and the newest one can do both atmospheric flight and moons. As for hitting ships with them they are no more effective than a rocket because its hard to hit with them and they tend to hit at slower speeds. My rule for cruise missiles would be this. They have a launch phase and fire in the phase that the ship carrying them can fire but they only detach and have to wait till the end of the opponents round to continue to target (you may also only launch one cruise missile at a time from each ship equip). This gives them a chance to be shot down by other missiles. Also you can design smaller anti missile cruise missiles that are under 2 tons that can be launched in pairs put have the same rules. The idea is to use these smaller ones as a type of defense grid to take out any smart missiles launched after them. What\u0027s your opinion on this rule?\u003C/p\u003E\n"},{"CreatedByName":"Commander Wilmot","CreatedById":79717,"CreatedDateTime":"2013-08-29T00:07:39Z","Content":"\n\u003Cp\u003EI haven\u0027t played any of the wargames yet, I wanted to try some so I made a design. So I can\u0027t comment on the rules. I am still trying to get it ready for a prototype stage so I can figure out if it works. It had too many parts, originally the count was 403 which would make it too laggy. Hopefully the fuel tank I put on as a warhead helps with damage, I saw another person\u0027s ship later that had similarly designed missiles but without the extra fuel tank.\u003C/p\u003E\u003Cp\u003EI realize orbits are complicated, but is hitting a nosecone really easier than hitting a frigate/destroyer sized ship on up?\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-29T00:29:40Z","Content":"\n\u003Cp\u003E@camulus: Good thing my Dreks can fire smart missiles manually....\u003C/p\u003E\n"}]}