{"TopicId":41408,"ForumId":21,"TopicTitle":"Skylab, as close as I can get it..","CreatedByName":"Anodizer","CreatedById":16555,"CreatedDateTime":"2013-08-07T04:18:06Z","PageNum":1,"Articles":[{"CreatedByName":"Anodizer","CreatedById":16555,"CreatedDateTime":"2013-08-07T04:18:06Z","Content":"\n\u003Cp\u003ENot to toot my own wiener, but I think my Skylab is the best one I\u0027ve seen so far.. Unfortunately, I can\u0027t figure out how the Solar Observatory was deployed since it was not sticking partially out of the shroud in real life.. I\u0027m sure it unfolded in some way.. Would like to see a description of that if anyone can find one (I\u0027ve looked all over).. Anyhow, the docking adapter should be the same size as the CSM.. Most of the others I\u0027ve seen have the docking adapter too small and then the habitation module is 3.75m which isn\u0027t really doesn\u0027t look right if you look at pictures of the space station.. Anyhow, enjoy! I had fun building and launching it! I\u0027m so into Apollo and Apollo Applications Projects!! If you\u0027ve got some creations from that era, post \u0027em here! Can\u0027t wait for a GOOD Saturn V to come out!! Hope someone makes one soon!! Cheers!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GOXrooY.jpg\u0022 alt=\u0022GOXrooY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5ecOP29.jpg\u0022 alt=\u00225ecOP29.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2fXh1rN.jpg\u0022 alt=\u00222fXh1rN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3aqAmx8.png\u0022 alt=\u00223aqAmx8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7QrtwXK.jpg\u0022 alt=\u00227QrtwXK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7c67TmV.jpg\u0022 alt=\u00227c67TmV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ughpd0i.png\u0022 alt=\u0022Ughpd0i.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OPHZA0w.jpg\u0022 alt=\u0022OPHZA0w.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4oUeFWA.jpg\u0022 alt=\u00224oUeFWA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IDTyXk3.jpg\u0022 alt=\u0022IDTyXk3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gv1lKTW.jpg\u0022 alt=\u0022gv1lKTW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUsed the latest versions of NovaPunch, KW Rocketry, and AIES.. As well as a few stock parts.. \u003C/p\u003E\u003Cp\u003ELooking for some solar panels that are a bit longer but are fixed(don\u0027t track the sun) if anyone\u0027s got a lead.. \u003C/p\u003E\u003Cp\u003ETried to make this all fit in the shroud but unfortunately, the comms dish which is actually my Solar Observatory instrument arrangement sticks out a bit.. Sorry..\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-08-07T04:24:12Z","Content":"\n\u003Cp\u003ESo Skylab was kind of a wet workshop? I had no idea!\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-08-07T04:59:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003ESo Skylab was kind of a wet workshop? I had no idea!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I can tell, no.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2013-08-07T07:22:14Z","Content":"\n\u003Cp\u003ESkylab was a dry workshop - they emptied and modified the saturn V S-IVB stage to transform it into the skylab (engine removed and replaced by a radiator, scientific stuff installed in it, etc)\u003C/p\u003E\u003Cp\u003EFor the telescope mount, on lift-off it was inline with the rest of the skylab, mounted on an articulated system. once in orbit, the telescope mount rotated 90 degrees sideways, freeing the docking port. (I once made a stock one, were i replaced the articulated system with simply RCS inside the telescope mount, to move it to the deployed position)\u003C/p\u003E\n"}]}