{"TopicId":41430,"ForumId":51,"TopicTitle":"Official Detailed KIS Mission Report","CreatedByName":"digtron","CreatedById":71565,"CreatedDateTime":"2013-08-07T08:41:02Z","PageNum":1,"Articles":[{"CreatedByName":"digtron","CreatedById":71565,"CreatedDateTime":"2013-08-07T08:41:02Z","Content":"\n\u003Cp\u003EAfter ending an account i\u0027ve used since I first started playing KSP, i decided to start a new game in which I would try to recreate a real space organization. As such, I\u0027ve decided to extensively document each of my missions, giving reason for each mission and writing up reports for them as well to document it. These are going to be quite long, they are in a big font so it\u0027s not as much reading as you may expect and there will be quite a few pictures which will decrease the amount of reading even more if you\u0027re daunted by the number of pages it is. (I\u0027ve created it as a word document to make it easier to create, format, and attach images so to share it i\u0027ve uploaded it as a google document so you won\u0027t have to download anything to view it. The picture quality was dramatically reduced so if you\u0027d like to see any of the pictures in full quality let me know and I can upload that to photobucket.)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0ByfqpnuD6xgJV2hkbFoxTWlUZk0/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EKIS Mission Report\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote: I\u0027ve decided to make up a few words for fun, so if you see a word you\u0027ve never heard of, either I typed it under hypnosis or it\u0027s a word I made up and I\u0027ve listed what it means in the Appendix at the end of the document.\u003C/p\u003E\u003Cp\u003EThe first section explains the background and other information about KIS, the name i decided to give to my space organization which is an acronym for \u0022Kerbals in Space\u0022.\u003C/p\u003E\u003Cp\u003EThe second section of the document is an extensive report of the first mission with the rocket which I named Firehawk I.\u003C/p\u003E\u003Cp\u003EIf you enjoy this or have any questions, comments, or suggestions, please let me know. I really enjoyed making this but I\u0027m really hoping to make these so that other people can enjoy them as well. Thank you if you take your time to look at it!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-07T18:56:42Z\u0022 title=\u002208/07/2013 06:56  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 7, 2013\u003C/time\u003E by digtron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}