{"TopicId":41485,"ForumId":32,"TopicTitle":"NVidia, PhysX and KSP","CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-07T19:08:57Z","PageNum":1,"Articles":[{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-07T19:08:57Z","Content":"\n\u003Cp\u003EI saw something is a post some time back that I would like some clarification on.\u003C/p\u003E\u003Cp\u003ETrue or not?: NVidia cards run PhysX on the GPU everything else has it running on the CPU.\u003C/p\u003E\u003Cp\u003EIf true, what are the implications for the performance of KSP for us NVidia owners vs everyone else? Does that mean that the CPU has less load on a machine with an NVidia graphics card since KSP is single threaded? That would seem to be the implication.\u003C/p\u003E\n"},{"CreatedByName":"NeMeSiS","CreatedById":5379,"CreatedDateTime":"2013-08-07T19:19:35Z","Content":"\n\u003Cp\u003EGPU accelerated PhysX are not implemented in KSP. So an nVidia card will not give you an advantage over an Ati/AMD card.\u003C/p\u003E\u003Cp\u003EAlso, generally the only things that can be accelerated this way are visuals, like clothing physics and particles, but not the general rigid body physics that are used on KSP parts. (Though this may be changed by now?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-07T19:22:44Z\u0022 title=\u002208/07/2013 07:22  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 7, 2013\u003C/time\u003E by NeMeSiS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-08-07T19:20:38Z","Content":"\n\u003Cp\u003ENo, all physics calculations are done through the CPU for KSP. It matters not the type of graphics card you have. So, no difference.\u003C/p\u003E\u003Cp\u003EPhysics in Unity, as I understand it, can either be done through PhysX running on the GPU or PhysX running single threaded on the CPU. KSP takes the later tack. IIRC there are a number of issues coding a game that runs physics calculations for actual physical interactions on the GPU. I don\u0027t think that is doable, only \u0022non interacting\u0022 objects, IE visual physics.\u003C/p\u003E\u003Cp\u003EI only peripherially understand the issue though.\u003C/p\u003E\n"},{"CreatedByName":"jackercrack","CreatedById":78016,"CreatedDateTime":"2013-08-07T19:22:28Z","Content":"\n\u003Cp\u003EKSP doesn\u0027t use gpu physics although open cl would rock this game\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2013-08-07T19:26:56Z","Content":"\n\u003Cp\u003EUnity uses PhysX 2.8, which supports GPU acceleration only for cloth, fluids and soft bodies. KSP won\u0027t be able to make use of GPU accelerated physics. PhysX does support multithreading, but apparently Unity3D has disabled it. You\u0027ll have to ask someone more familiar with Unity3D why that is\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2013-08-07T19:27:34Z","Content":"\n\u003Cp\u003EFrom what I understand, game engines that use the PhysX engine are limited to what Nvidia provides, so if you are using an AMD card, then you will not get those effects. It makes for nice eye candy in the likes of Borderlands 2, but it would be detrimental to KSP since I would imagine Squad would want to make more use of it than floaty tattered cloths.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-07T20:31:51Z","Content":"\n\u003Cp\u003EMakes sense. Thanks.\u003C/p\u003E\n"}]}