{"TopicId":41587,"ForumId":55,"TopicTitle":"Swivel Point","CreatedByName":"Vegesus44","CreatedById":76406,"CreatedDateTime":"2013-08-08T08:56:02Z","PageNum":1,"Articles":[{"CreatedByName":"Vegesus44","CreatedById":76406,"CreatedDateTime":"2013-08-08T08:56:02Z","Content":"\n\u003Cp\u003EAll the game needs is 1 swivel point piece.\u003C/p\u003E\u003Cp\u003EThen the game is almost (granted polish work to finish) perfect.\u003C/p\u003E\u003Cp\u003ELess is more.\u003C/p\u003E\u003Cp\u003EPlease, try and keep this game simple, it is way over most peoples heads as it is.\u003C/p\u003E\u003Cp\u003EThough, I am looking at regen(*) tech, to a point of interest as a serious future career choice in terraforming mars.\u003C/p\u003E\u003Cp\u003E\u002B)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2013-08-08T16:02:25Z","Content":"\n\u003Cp\u003EAre you looking for something like Damned robotics?\u003C/p\u003E\n"},{"CreatedByName":"Vegesus44","CreatedById":76406,"CreatedDateTime":"2013-08-09T07:45:28Z","Content":"\n\u003Cp\u003EMore like kerbaliesation of physical black hole Quantum Dynamics......\u003C/p\u003E\n"},{"CreatedByName":"Vegesus44","CreatedById":76406,"CreatedDateTime":"2013-08-09T07:46:53Z","Content":"\n\u003Cp\u003EI just got gesme stuck in a hole Mun south pole.\u003C/p\u003E\u003Cp\u003E=|\u003C/p\u003E\n"},{"CreatedByName":"Vegesus44","CreatedById":76406,"CreatedDateTime":"2013-08-09T08:48:38Z","Content":"\n\u003Cp\u003EWhat I mean is, one swivel point could move all the structural pieces, therefore making the game complete in a 360 D physical sense.\u003C/p\u003E\u003Cp\u003E=)\u003C/p\u003E\n"},{"CreatedByName":"jcraft","CreatedById":42471,"CreatedDateTime":"2013-08-09T11:01:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vegesus44\u0022 data-cite=\u0022Vegesus44\u0022\u003E\u003Cdiv\u003EPlease, try and keep this game simple, \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eit is way over most peoples heads as it is.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd that\u0027s one of the reasons Squad is focusing on adding career mode right now - when new player is going start the game in career mode he is going to start small with limited possibilities and as he move forward game will open more and more for him offering more complex things - this way they can keep it simple at entry level but without sacrificing complexity of whole game. In current state KSP can be quite confusing for newcomer as it basically greets new player with \u0022here\u0027s loads of parts and whole solar system to explore and almost no explanations what to do and how to do it... so go and have fun!\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"hotcrazyfruit","CreatedById":7492,"CreatedDateTime":"2013-08-09T11:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jcraft\u0022 data-cite=\u0022jcraft\u0022\u003E\u003Cdiv\u003EIn current state KSP can be quite confusing for newcomer as it basically greets new player with \u0022here\u0027s loads of parts and whole solar system to explore and almost no explanations what to do and how to do it... so go and have fun!\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn that exact token, the reason it was easier for me and other players since the early days were because the only objective, was to get into orbit! Given no symmetry and limited parts it was a difficult task, however once we did that, and got the improvements that came with later versions it turned out to be an excellent progression into the game that it is today. IE, once we got the mun, we all went for it. That was the objective for that update, and so on. \u003C/p\u003E\u003Cp\u003EOP, I agree 1 swivel joint is needed, however I can\u0027t think of a viable way to make use of it. Maybe some sort of programming interface such as Garry\u0027s Mod Wire mod, or Expression interface. Using the number pad might be a good way of doing this, sorry for those who don\u0027t have a number pad T__T\u003C/p\u003E\u003Cp\u003EWhich, by the way would completely revolutionize KSP. The only reason I don\u0027t play Gmod anymore is because I wanted to fly, which doesn\u0027t work on a 1 sq mile map. I long for wire mod and the building mechanics however.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-10T07:01:01Z","Content":"\n\u003Cp\u003EI\u0027d be happy with some sort of a \u0022hinge\u0022 piece, even if it only has two preset positions and the ability to toggle between them. That would STILL help out a lot. Basically, it would be like the way landing gear work - with two positions you can toggle between and watch it animate the movement (but you can\u0027t stop it halfway between endpoints, as that would be too complex in the controls), but unlike landing gear you would have attachment points at both ends of it so that moving the hinge causes the angle between the parts attached to it to change. With that you could do things like the Space Shuttle\u0027s cargo bay doors, or protective plates around a lander that open up after it comes to rest (like some of the mars missions had).\u003C/p\u003E\n"}]}