{"TopicId":41612,"ForumId":36,"TopicTitle":"SciTek Industries Parts development","CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T14:15:09Z","PageNum":1,"Articles":[{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T14:15:09Z","Content":"\n\u003Cp\u003EEDIT: I want to revive this idea, but I need help. An artist with strong texture skills/modelling and someone who could perhaps mentor me some with the more complicated Unity stuff. Any takers please feel free to inbox me.\u003C/p\u003E\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EUPDATE: Sept 10 2013 \u003C/p\u003E\u003Cp\u003Ethrough extensive testing and trying to come up with a way to improve stability I\u0027ve found that the ships have a really difficult time maintaining stable attachment node inside my meshes. Especially tanks, anything with substantial mass. I love the whole concept, but at this point I\u0027m stuck at how to get tankage and modules with masses greater than the superstructure to be stable. They tend to want to break away from their attachment nodes, strutting helps but it takes so many it defeats the purpose. If someone would like to take a try at it, PM me and I\u0027d be happy to supply what work I\u0027ve done so far.\u003C/p\u003E\u003Cp\u003EI\u0027m developing some parts for large scale space based ships, I\u0027m going for a sci-fi looking theme. I know that is not what a lot of hardcore players want, my parts are somewhat unrealistic but I want to include them into the game in such a way as to add to it instead of ruin it or unbalance things.\u003C/p\u003E\u003Cp\u003ESo Far I have modeled and built an engine, added Deuterium as a fuel.\u003C/p\u003E\u003Cp\u003EI\u0027ve got an engine that uses ElectricCharge as a fuel along with the Deuterium and it works.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1351.photobucket.com/user/gl0ryh0und73/media/2013-08-07_00002_zps9765c8a1.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1351.photobucket.com/albums/p794/gl0ryh0und73/2013-08-07_00002_zps9765c8a1.jpg\u0022 alt=\u00222013-08-07_00002_zps9765c8a1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe engine is designed to work only in space, any attempt to use in atmosphere simply dumps your fuel, although I\u0027d like a way for it to shutoff automatically. If a coder would like to write a small plugin to accomplish that it would be great.\u003C/p\u003E\u003Cp\u003EI\u0027m also working on a Superstructure parts pack of large ship structural parts that allow attachments not just outside, but inside as well.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1351.photobucket.com/user/gl0ryh0und73/media/2013-08-08_00001_zps653c7ad1.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1351.photobucket.com/albums/p794/gl0ryh0und73/2013-08-08_00001_zps653c7ad1.jpg\u0022 alt=\u00222013-08-08_00001_zps653c7ad1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUltimately the goal is provide parts for very large ships upwards to 1000\u002Btonnes and engines to drive them.\u003C/p\u003E\u003Cp\u003EObviously they would have to be assembled in space.\u003C/p\u003E\u003Cp\u003EI would be interested in feedback, anyone interested in such a parts pack?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ECurrent Parts List\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E2x12m Capital Core Super Structure Kit\u003C/p\u003E\u003Cp\u003E6x12m Capital Core Super Structure Kit\u003C/p\u003E\u003Cp\u003E2x12m Capital Core Super Structure Kit (Open sides) or Bays\u003C/p\u003E\u003Cp\u003E2x12m Capital Core Bulkhead\u003C/p\u003E\u003Cp\u003E2x12m Capital Core Engine mount assembly x2 large mounts for the 4M Fusion engine\u003C/p\u003E\u003Cp\u003E4M C-01 Fusion Drive for Capital class ships\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EPlanned Parts List\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E6x12m Capital Core Super Structure kit (Open top/bottom) or Large drop bays\u003C/p\u003E\u003Cp\u003E2x12m Capital Core Super Structure Crew Quarters\u003C/p\u003E\u003Cp\u003EAdaptable Tanks for LFO, Kethane, Deuterium, Antimatter\u003C/p\u003E\u003Cp\u003E4x12m Capital Core Fusion Reactor - Burns Deuterium\u003C/p\u003E\u003Cp\u003ELarge Plasma thruster system\u003C/p\u003E\u003Cp\u003EMore to come.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T02:51:36Z\u0022 title=\u002212/16/2013 02:51  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by gl0ryh0und\u003C/strong\u003E\n\u003Cbr\u003EParts list added\n\u003C/span\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-08-08T14:21:47Z","Content":"\n\u003Cp\u003ECan I suggest that you make those larger trusses align with LLL / THSS? There\u0027s a certain commonality of shape there.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T14:26:12Z","Content":"\n\u003Cp\u003EYes they are common, and I could build adapters to match but I would leave those to last. Initially I just want to get my parts fitting right and mature the textures.\u003C/p\u003E\u003Cp\u003EThat Superstructure is just a place holder for experimenting at the moment. My plans are going to be for 3.75meter scale parts and up.\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-08T14:33:03Z","Content":"\n\u003Cp\u003EYeah, seconding the LLL / THSS compatibility.\u003C/p\u003E\u003Cp\u003EIf\u0027n y\u0027all are interested, here\u0027s what I\u0027ve done with LLL / THSS (no pictures yet, sorry)\u003C/p\u003E\u003Cp\u003E1) Copied the LLL nuclear engine and created a LH-only burning gas-core nuclear engine. Increased the specific impulse to 3000 in line with the wiki article on nuclear thermal engines. (much, much lower ISP in atmosphere, these engines aren\u0027t intended for atmo use)\u003C/p\u003E\u003Cp\u003E2) Copied the large THSS fuel tank and edited it to create one that holds only LH.\u003C/p\u003E\u003Cp\u003EHooking those two together gives you a very high delta-v craft for use in interplanetary missions. I\u0027m not going to \u0022release\u0022 these mods since they\u0027re just part copies/edits.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T14:55:49Z","Content":"\n\u003Cp\u003EI use THSS regularly, but the LLL I\u0027m not familiar with I\u0027ll have to check it out.\u003C/p\u003E\u003Cp\u003EThe Fusion engine I made has similar specifications.. 4500 ISP but also eats your power reserves.. adding to design requirements. At full thrust of 2000 it can eat up the largest battery charge in seconds. So there will be reactor parts in my future as well, generating power at the cost of Deuterium and generating Neutrons.. not sure how to accomplish that yet I\u0027d like a \u0027kill zone\u0027 around the reactor or to do shielding but alas again I am no coder of plugins and if I went down that road this game might get done before me.\u003C/p\u003E\u003Cp\u003EOh and just an FYI, I\u0027ve done a lot of testing with OP edits and the ship size, fuels and requirements most useful ships come in at around 8 - 14 K DeltaV It was possible to build ships with 60\u002BK Dv but it was basically a flying tank with a probe body and some solar.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T14:58:54Z\u0022 title=\u002208/08/2013 02:58  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by gl0ryh0und\u003C/strong\u003E\n\u003Cbr\u003Eclarification\n\u003C/span\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-08-08T14:59:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gl0ryh0und\u0022 data-cite=\u0022gl0ryh0und\u0022\u003E\u003Cdiv\u003EYes they are common, and I could build adapters to match but I would leave those to last. Initially I just want to get my parts fitting right and mature the textures.\u003Cp\u003EThat Superstructure is just a place holder for experimenting at the moment. My plans are going to be for 3.75meter scale parts and up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhat I mean is, why bother having to make more adapters? If that\u0027s the basic shape you want, simply aligning them with LLL or THSS from the start would save you the effort.\u003Cp\u003E@dizzysaurus, This isn\u0027t the place to discuss that. Go to the LLL / THSS threads.\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-08T15:08:15Z","Content":"\n\u003Cp\u003ETake a look at the Deep Space Mission pack, it has a reactor part that drives its ion engine part.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T15:11:28Z","Content":"\n\u003Cp\u003EBecause of the scale... observe\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1351.photobucket.com/user/gl0ryh0und73/media/2013-08-08_00002_zpsc99a4892.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1351.photobucket.com/albums/p794/gl0ryh0und73/2013-08-08_00002_zpsc99a4892.jpg\u0022 alt=\u00222013-08-08_00002_zpsc99a4892.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-08-08T15:13:26Z","Content":"\n\u003Cp\u003EWow, okay. The scale was certainly a lot bigger than I expected. This going to be like... 15m wide? Maybe even 20m judging by that? That\u0027s a whole other ballpark.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T15:14:45Z","Content":"\n\u003Cp\u003Eindeed and I have, i\u0027ve looked at a number of other setups too. but mainly I wanted to add a component to the reactor that could make it deadly to kerbals, I may just end of simulating shielding by adding tonnes of weight to the reactor.\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-08T15:15:49Z","Content":"\n\u003Cp\u003Every cool stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dizzysaurus","CreatedById":73061,"CreatedDateTime":"2013-08-08T15:18:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeBuSBrian\u0022 data-cite=\u0022JeBuSBrian\u0022\u003E\u003Cdiv\u003E@dizzysaurus, This isn\u0027t the place to discuss that. Go to the LLL / THSS threads.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApologies, I let my enthusiasm get the better of me all too often.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-08T15:20:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeBuSBrian\u0022 data-cite=\u0022JeBuSBrian\u0022\u003E\u003Cdiv\u003EWow, okay. The scale was certainly a lot bigger than I expected. This going to be like... 15m wide? Maybe even 20m judging by that? That\u0027s a whole other ballpark.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, and the fact that the superstructure has an actually working hollow collision mesh. you will be able to build internal docking areas, cavernous sections.. add in stock parts inside the superstructure, tanks, crew quarters, command capsules.. This section is 2M long, and I\u0027m going to make a 6M section. I\u0027ll build some tanks to go in them, but the point will be to allow you to add stock tanks or your own inside the structure. Obviously something of this scale would need to be labor instensive and require assembly in space. I think the whole thing is about 12M wide.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-09T03:15:20Z","Content":"\n\u003Cp\u003ESo I\u0027ve been doing some testing of my concept with my first couple parts and I\u0027ve noticed the following:\u003C/p\u003E\u003Cp\u003EOkay so one major problem I\u0027m running into is it can be tricky to place some items into the superstructure, also I thought I would share how I got the \u0027hollow\u0027 collision mesh.. well it turns out that if you build a bunch of primitives in the your modelling application but export them as a single object, Unity and KSP won\u0027t object to having a collision mesh that isn\u0027t forced convex. The only limiting factor I\u0027ve notice so far is that each primitive in the collision mesh can\u0027t clip into each other and each object must be convex itself, not following those two simple rules will result in game breaking lag/crashing. Weird things happen when the parts break, the object as a whole has no problem working with the individual collision object, but if you say run your ship into the ground at 400m/s the pieces come apart and get tangled and clip into one another, KSP doesn\u0027t seem to care, I didn\u0027t notice any lag and I added 60 structural parts that I built into one ship and didn\u0027t notice any real performance hit, despite the fact that each structural member had 10 collision meshes, I had suspected that the additional collision meshes might put quite a hit on the physics, but to my surprise it didn\u0027t seem to affect it at all.\u003C/p\u003E\u003Cp\u003EAnother surprising side effect is that because of the size and the wide foot print of the engine, I\u0027ve been able to build asymmetrical ships, with off center configurations. Not a ridiculous amount, but say a few tonnes one way or the other on a ship weighing in at 300 tonnes. Makes for some interesting design possibilities.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-09T03:16:49Z\u0022 title=\u002208/09/2013 03:16  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 9, 2013\u003C/time\u003E by gl0ryh0und\u003C/strong\u003E\n\u003Cbr\u003Eclarification\n\u003C/span\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-09T19:52:29Z","Content":"\n\u003Cp\u003EI\u0027ve added an open sided structural member and tried some practical application to see how it worked and stability with parts.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1351.photobucket.com/user/gl0ryh0und73/media/2013-08-09_00003_zps1a7d10db.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1351.photobucket.com/albums/p794/gl0ryh0und73/2013-08-09_00003_zps1a7d10db.jpg\u0022 alt=\u00222013-08-09_00003_zps1a7d10db.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E80Tonnes, 171 parts, quite heavy on the parts but I was just throwing stuff at it.\u003C/p\u003E\u003Cp\u003EThe collision mesh needs some work, as you can see I have connections hanging in thin air, this was because I was using large rectangular slabs for the collision mesh. On the next revision it will more resemble the actual visual model.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-08-10T21:42:25Z","Content":"\n\u003Cp\u003ENew Parts\u003C/p\u003E\u003Cp\u003EEngine mount assembly\u003C/p\u003E\u003Cp\u003EReworked SS parts. - Vastly improved collision models\u003C/p\u003E\u003Cp\u003ESS bulkhead\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1351.photobucket.com/user/gl0ryh0und73/media/2013-08-10_00001_zps1115e49c.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1351.photobucket.com/albums/p794/gl0ryh0und73/2013-08-10_00001_zps1115e49c.jpg\u0022 alt=\u00222013-08-10_00001_zps1115e49c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-10T22:18:13Z\u0022 title=\u002208/10/2013 10:18  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 10, 2013\u003C/time\u003E by gl0ryh0und\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-12-16T02:53:32Z","Content":"\n\u003Cp\u003EI want to bring this mod out of moth balls. I\u0027m thinking there might be life in it if I can leverage the KerbalJointReinforcement to make it work. Which means that mod might be needed to make this work.\u003C/p\u003E\n"}]}