{"TopicId":41615,"ForumId":16,"TopicTitle":"Noob Questions","CreatedByName":"legion1202","CreatedById":78116,"CreatedDateTime":"2013-08-08T14:46:56Z","PageNum":1,"Articles":[{"CreatedByName":"legion1202","CreatedById":78116,"CreatedDateTime":"2013-08-08T14:46:56Z","Content":"\n\u003Cp\u003ESorry if these have been answer before but I have a few questions.\u003C/p\u003E\u003Cp\u003EI am using mech jeb and a few other mods including Mission Control. On some of the missions I need to put light weight satellites into space but I cant find the right balance of Delta V. I am either over budget, cant orbit or right on the nose. Part of the problem is being such a Noob. I have to make a lot of adjustments to get into a required orbit with out cheating. Another is understanding the math. \u003C/p\u003E\u003Cp\u003EI understand delta v is what you need to get off kerb 4900.. So if I have a ship that has 6,000 dv I should be good.\u003C/p\u003E\u003Cp\u003EI better optimized my stages how do you find what altitude each stage will get you too? For an example I want my first stage ending around 10000 meters Or maybe stage two... But I\u0060m not sure how to figure that out..\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EDirector of the NGSP\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-08-08T15:07:11Z","Content":"\n\u003Cp\u003EMoved this to gameplay questions \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gniuz","CreatedById":57846,"CreatedDateTime":"2013-08-08T15:19:13Z","Content":"\n\u003Cp\u003EMech jeb tells you the amount of delta V you get at each stage doesn\u0027t it? \u003C/p\u003E\u003Cp\u003EIf not have a look for Kerbal Engineer on spaceport because that does: \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you use asparagus staging as well you\u0027ll get more use out of your fuel, if you don\u0027t know about this then look it up on youtube, its helpful when getting you out the atmosphere.\u003C/p\u003E\u003Cp\u003EGood luck.\u003C/p\u003E\u003Cp\u003EG.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-08-08T15:21:07Z","Content":"\n\u003Cp\u003EYou need ~4500 dV to orbit Kerbin, so 6000 is a total overkill. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-08T15:29:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022legion1202\u0022 data-cite=\u0022legion1202\u0022\u003E\u003Cdiv\u003ESorry if these have been answer before but I have a few questions.\u003Cp\u003EI am using mech jeb and a few other mods including Mission Control. On some of the missions I need to put light weight satellites into space but I cant find the right balance of Delta V. I am either over budget, cant orbit or right on the nose. Part of the problem is being such a Noob. I have to make a lot of adjustments to get into a required orbit with out cheating. Another is understanding the math. \u003C/p\u003E\u003Cp\u003EI understand delta v is what you need to get off kerb 4900.. So if I have a ship that has 6,000 dv I should be good.\u003C/p\u003E\u003Cp\u003EI better optimized my stages how do you find what altitude each stage will get you too? For an example I want my first stage ending around 10000 meters Or maybe stage two... But I\u0060m not sure how to figure that out..\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EDirector of the NGSP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was under the impression that 4500 Delta-V is what is required to attain orbit around Kerbin. One point that Nathankell clarified to me is that: it is not simply the Atmo-Dv listed in Mechjeb, as the Atmo part of the ascent is only a portion of the ascent to orbit. Apparently some fraction of the \u0022Vacuum Dv\u0022 also counts. In any event, I have been successfully getting the ship \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43645-(0-21)-Mission-Controller-Extended-(Version-15)-(FORK)-(ALPHA)?p=577406\u0026amp;viewfull=1#post577406\u0022 rel=\u0022external nofollow\u0022\u003Elisted in this post\u003C/a\u003E into orbit a lot, even into relatively high orbit with little problem.\u003C/p\u003E\u003Cp\u003EMC 0.16 says that ship is costing ~16,000 K and it has Mechjeb 2.09 says it has total Dv (Atmo Vac) = 5305, 5777.\u003C/p\u003E\u003Cp\u003EAlso check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43645-(0-21)-Mission-Controller-Extended-(Version-15)-(FORK)-(ALPHA)?p=576417\u0026amp;viewfull=1#post576417\u0022 rel=\u0022external nofollow\u0022\u003Ethis post \u003C/a\u003E, and some of the other ones in response to my query about building the cheapest probe rocket in MC.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-08T15:37:36Z","Content":"\n\u003Cp\u003ETemstar actually has a pretty good discussion about how to do \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28248-Is-asparagus-the-best-staging-system-%28might-contain-science%29?p=346702\u0026amp;viewfull=1#post346702\u0022 rel=\u0022external nofollow\u0022\u003Eproper asparagus staging\u003C/a\u003E that I find works reasonably well for onion-style staging, which is probably what most noobs use in one form or another. Asparagus is the way to go and I highly recommend reading through the initial post, but if you\u0027re not comfortable using asparagus you can still apply most of the same principles.\u003C/p\u003E\u003Cp\u003EIt\u0027s ~4500 m/s to get into orbit, BTW. Mechjeb does have a launch autopilot feature if I\u0027m not mistaken (I don\u0027t use it my own self; it\u0027s what I plan to reward myself with if I ever complete a round trip to Eve).\u003C/p\u003E\n"},{"CreatedByName":"legion1202","CreatedById":78116,"CreatedDateTime":"2013-08-08T16:04:03Z","Content":"\n\u003Cp\u003EThanks for the reply.. I am getting better at redesigning lol. I\u0060m up to the G.C.S Mk 11 lol. Cost is 33k. 4stages.\u003C/p\u003E\u003Cp\u003EStage0= is the Satellite with one FL-t800 and a lv-909\u003C/p\u003E\u003Cp\u003Estage 1=decoupler \u003C/p\u003E\u003Cp\u003Estage 2=2x fl-t800 with a lv-t30\u003C/p\u003E\u003Cp\u003Estage 3= decoupler\u003C/p\u003E\u003Cp\u003Estage 4= 2x 1fl-t800 with lc t30 mounted to stage 2.\u003C/p\u003E\u003Cp\u003ETotal V 7,315\u003C/p\u003E\u003Cp\u003EStage 4 has 1206 /ms of DV with a twr of 1.56\u003C/p\u003E\u003Cp\u003Estage 2 has 2365 m/s twr 1.31\u003C/p\u003E\u003Cp\u003Estage 0 has 3744 ms of dv with a twr of .80\u003C/p\u003E\u003Cp\u003Ethis might be to much but it might be a good design to get to mun as a sat carrier.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-08-08T21:46:40Z","Content":"\n\u003Cp\u003EYou are over thinking it. Using Mech Jeb and other performance enhancing mods won\u0027t make you better. I just get a feel that a rocket would have enough Delta V or T/W. I got better thorough experience and trial and error, so I would recommend you trash Mech Jeb and use some of those brains I know you have.\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-08-08T22:23:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tank Buddy\u0022 data-cite=\u0022Tank Buddy\u0022\u003E\u003Cdiv\u003EYou are over thinking it. Using Mech Jeb and other performance enhancing mods won\u0027t make you better. I just get a feel that a rocket would have enough Delta V or T/W. I got better thorough experience and trial and error, so I would recommend you trash Mech Jeb and use some of those brains I know you have.\u003C/div\u003E\u003C/blockquote\u003E Actually, using Mechjeb and Engineer for the d/v and twr numbers will make you a lot better at building rockets faster than trial and error will. That\u0027s where using your brain is really at.\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-08-09T00:03:11Z","Content":"\n\u003Cp\u003EOn what stage decouple at what altitude id say that it does not matter OP. If the ship has 5k Dv then it CAN make it into a circular 80km Kerbin orbit. The only thing I try to avoid is having stages decouple right at my gravity turn. I try to make it happen before or after once the ship turns over and stabilizes.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-08-09T00:22:55Z","Content":"\n\u003Cp\u003EThis can even land your probe on Mun or Minmus, or get you to Duna if you plan a slingshot maneuver.\u003C/p\u003E\u003Cp\u003ECost is pretty low for such missions.\u003C/p\u003E\u003Cp\u003EProbe Module\u003C/p\u003E\u003Cp\u003E1. Stayputnik\u003C/p\u003E\u003Cp\u003E2. Communication antennas.\u003C/p\u003E\u003Cp\u003E3. SAS stabilizer, the stock one\u003C/p\u003E\u003Cp\u003E4. Set of instruments and four small battery packs placed on top of the SAS ring.\u003C/p\u003E\u003Cp\u003E5. FL-R25 thruster fuel tank\u003C/p\u003E\u003Cp\u003E6. Eight OX-Stat solar panels mounted on the thruster fuel tank. They are light, cheap, and will provide all the power your satellite will ever need.\u003C/p\u003E\u003Cp\u003E7. Set of four quad thrusters mounted on the upper part of the SAS ring.\u003C/p\u003E\u003Cp\u003E8. Lightweight landing legs are optional, set of 4.\u003C/p\u003E\u003Cp\u003ESecond Stage\u003C/p\u003E\u003Cp\u003E1. Stack coupler TA-18A\u003C/p\u003E\u003Cp\u003E2. T-800 fuel tank\u003C/p\u003E\u003Cp\u003E3. LV-909 engine. \u003C/p\u003E\u003Cp\u003EFirst Stage;\u003C/p\u003E\u003Cp\u003E1. Stack coupler TA-18A\u003C/p\u003E\u003Cp\u003E2. Two stacked T-800 fuel tanks\u003C/p\u003E\u003Cp\u003E3. LV-T45 engine\u003C/p\u003E\u003Cp\u003EBooster Stage;\u003C/p\u003E\u003Cp\u003E1. Four TT-38K radical couplers mounted on the upper T-800 fuel tank\u003C/p\u003E\u003Cp\u003E2. Four Rocomax BACC Solid Fuel Boosters\u003C/p\u003E\u003Cp\u003E3. A set of four struts to connect each booster together near their base, for stability.\u003C/p\u003E\u003Cp\u003E4. Four launch stabilizers\u003C/p\u003E\u003Cp\u003ELaunch on the solid boosters. At burnout, stage, power the LV-45, and start the gravity turn. You should reach 100K orbit with maybe a short burn on the LV-909. From there, the LV-909 will get you into Mun or Minmus orbit with sufficient fuel for a landing. Do the final landing using thrusters. Disable the SAS ring before staging to the probe, it is too sensitive at that point and may cause shaking problems. If you have added lander legs, they are best deployed for launching since they appear to behave better as stability.\u003C/p\u003E\u003Cp\u003ENote, lander legs are optional. I have landed this probe on Mun, Eve, Duna, and Laythe without them.\u003C/p\u003E\u003Cp\u003EYou can eliminate the boosters and use a T-400 fuel tank on the second stage for satellites that you place into Kerbal orbit. You can even eliminate the stack coupler on the probe and keep the second stage as part of its orbital package.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-09T00:29:13Z\u0022 title=\u002208/09/2013 12:29  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 9, 2013\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"legion1202","CreatedById":78116,"CreatedDateTime":"2013-08-09T00:54:41Z","Content":"\n\u003Cp\u003EWow thanks... Thanks everyone...!! What do you guys do to usually figure out a plane for your rocket? I want to be able to stay... Make a playload.. And then figure out some math and know exactly what I\u0060ll need. Can you do that or is it all trial and error... The reason I ask because I could just follow someone elses design but I sorta want something orginal.. (at least something I didn\u0027t copy and paste.)\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-08-09T03:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022legion1202\u0022 data-cite=\u0022legion1202\u0022\u003E\u003Cdiv\u003EWow thanks... Thanks everyone...!! What do you guys do to usually figure out a plane for your rocket? I want to be able to stay... Make a playload.. And then figure out some math and know exactly what I\u0060ll need. Can you do that or is it all trial and error... The reason I ask because I could just follow someone elses design but I sorta want something orginal.. (at least something I didn\u0027t copy and paste.)\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeing a sandbox, you are basically playing with designs like building something with Legos. Everything is pretty much experimental to see what works, what work efficiently, and what doesn\u0027t. Just tested what I posted earlier and they performed better then expected. Left the lander legs up and it flew stable all the way to Mun. When in orbit either around Kerban or Mun, point the satellite broadside to the sun and there will always be direct sunlight on half the panels so long as the sun is not being blocked. The batteries will keep everything powered during the dark period.\u003C/p\u003E\u003Cp\u003EYou always have the tutorials to rely on if you get stuck or things don\u0027t work as planned.\u003C/p\u003E\u003Cp\u003EAs far as experiments go, this is how some individuals are finding and exploiting various bugs in the game to conduct non powered flight and other impossible events.\u003C/p\u003E\n"}]}