{"TopicId":42048,"ForumId":55,"TopicTitle":"Righting rovers in EVA","CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-11T16:45:55Z","PageNum":1,"Articles":[{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-11T16:45:55Z","Content":"\n\u003Cp\u003EAs has been made clear by many, many forum comments rovers are very tippy in KSP. This can be frustrating, to say the least.\u003C/p\u003E\u003Cp\u003ENow that Kerbals can repair objects during EVA, would it be possible to give them the ability to right an overturned rover the same way? Perhaps make it a right-click option on the control pod, like right-clicking a \u0027chute to repack it or right-clicking a wheel to repair it.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure if it\u0027ll work in KSP\u0027s physics package, and I guess it could be unrealistic in some cases (ie: multi-ton rovers), but it would spare players a lot of fuss.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\u003Cp\u003EPS: Not my idea; I\u0027m cribbing severely from the \u0022Halo\u0022 handbook here where \u0022press \u0027X\u0027 to right {vehicle}\u0022 was an all-too-necessary feature given its physics engines.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003Eedited to add:\u003C/em\u003E A thought on how it could be done; give the Kerbal a certain amount of lift force applied vertically to the CoM of the object, plus some torque about the long axis. That would impose a limit on how heavy a rover a Kerbal could flip while still working on the light-weight ones. I guess the torque\u0027d have to be scaled according to the mass of the object to avoid cartwheeling it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T17:08:41Z\u0022 title=\u002208/11/2013 05:08  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by Anton P. Nym\u003C/strong\u003E\n\u003Cbr\u003Elate thought on implementation\n\u003C/span\u003E\n"},{"CreatedByName":"Kermunist","CreatedById":63745,"CreatedDateTime":"2013-08-11T22:38:14Z","Content":"\n\u003Cp\u003EA good idea I think, but a better implementation might be to just apply a force in the upward direction to a single part the kerbal is closest to. Say 200N until the part reaches head height. That\u0027s a decent model of someone lifting something, and deals with the problem of turning over too-heavy rovers. It might need to be scaled down a bit for light rovers and low g worlds though.\u003C/p\u003E\u003Cp\u003EEven better would be a way of telling the kerbal to lift/push/pull an object in a selectable direction with a selectable force. Then they could right rovers, throw debris around, drag probes about etc. Not sure how to make a nice interface for that though.\u003C/p\u003E\n"},{"CreatedByName":"Ernest3.14","CreatedById":75412,"CreatedDateTime":"2013-08-12T04:15:19Z","Content":"\n\u003Cp\u003EWell, on low G worlds, you really would be able to lift more. So there\u0027s nothing wrong with that.\u003C/p\u003E\n"},{"CreatedByName":"VerdammteSeele","CreatedById":77390,"CreatedDateTime":"2013-08-12T05:42:26Z","Content":"\n\u003Cp\u003EAgreed, I\u0027ve flipped a few rovers already and would love to fix them up with Kerbals (Kerbils?). I agree on using a fixed amount of upward force on the closest side. Let the already set gravity of the world be a factor in the math rather than making new variables.\u003C/p\u003E\n"},{"CreatedByName":"That guy who builds stuff","CreatedById":58456,"CreatedDateTime":"2013-08-12T06:25:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ernest3.14\u0022 data-cite=\u0022Ernest3.14\u0022\u003E\u003Cdiv\u003EWell, on low G worlds, you really would be able to lift more. So there\u0027s nothing wrong with that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah but we don\u0027t want kerbals going to ike and punting stuff into orbit...\u003C/p\u003E\u003Cp\u003ENever mind; Do it!\u003C/p\u003E\n"},{"CreatedByName":"VerdammteSeele","CreatedById":77390,"CreatedDateTime":"2013-08-12T06:45:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022That guy who builds stuff\u0022 data-cite=\u0022That guy who builds stuff\u0022\u003E\u003Cdiv\u003EYeah but we don\u0027t want kerbals going to ike and punting stuff into orbit...\u003Cp\u003ENever mind; Do it!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI set a Kerbal to his death by jumping from the surface of minimus into orbit with the jetpack. After this gets implemented I should send a team to literally throw a rover into orbit from the surface. lol\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-12T12:15:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022That guy who builds stuff\u0022 data-cite=\u0022That guy who builds stuff\u0022\u003E\u003Cdiv\u003EYeah but we don\u0027t want kerbals going to ike and punting stuff into orbit...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst annual KSP Ike caber toss? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-12T13:05:44Z","Content":"\n\u003Cp\u003EI would also support this assuming there is some method of determining which way the rover should be turned. \u003C/p\u003E\u003Cp\u003EI also like the idea if an Ike or Gilly caber toss...\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-12T13:20:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anton P. Nym\u0022 data-cite=\u0022Anton P. Nym\u0022\u003E\u003Cdiv\u003EFirst annual KSP Ike caber toss? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever mind punting it into orbit, punt it with escape velocity! Because Ike is geostationary, if you take position at the spot on Ike where Duna is at its Zenith, you can draw a bull\u0027s eye on Duna and try to score points!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-12T14:22:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003ENever mind punting it into orbit, punt it with escape velocity! Because Ike is geostationary, if you take position at the spot on Ike where Duna is at its Zenith, you can draw a bull\u0027s eye on Duna and try to score points!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow this smells like a challenge! \u003C/p\u003E\u003Cp\u003EExcept I haven\u0027t been to Ike yet..\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-12T15:48:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003ENow this smells like a challenge! \u003Cp\u003EExcept I haven\u0027t been to Ike yet..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAccording to the wiki, escape velocity for Ike is 534.48 m/s. If you accelerate an object to this speed in an instant, its apoapsis should lie just outside the sphere of influence of Ike. The object will slow down as it gets closer to Duna, barely moving at all near apoapsis...until it exits Ike\u0027s sphere of influence, and accelerates as it falls towards Duna.\u003C/p\u003E\u003Cp\u003EAfter running the numbers, though, I\u0027ve found two issues. The first problem is that objects in KSP tend to be quite heavy. Say we have something that weights 0.5 tons--pretty light. If we say you can apply a force for one second, that means you\u0027ll need to apply 267 kN worth of force to accelerate the object to escape velocity. Even getting a 5 kg battery to Duna requires 2672 N, as it turns out, though that\u0027s something human weight lifters can easily achieve.\u003C/p\u003E\u003Cp\u003EThe second issue is that Ike\u0027s orbit is actually a bit eccentric and inclined, so Duna\u0027s position in the sky at a given spot changes by a few degrees as it orbits. This doesn\u0027t sound like a lot, but can make hundreds of kilometers\u0027 difference. So there would be an exact launch window for precision punting!\u003C/p\u003E\n"},{"CreatedByName":"chaos_forge","CreatedById":64960,"CreatedDateTime":"2013-08-12T16:12:41Z","Content":"\n\u003Cp\u003EObrital punting aside, this sounds like a great idea and I\u0027d love to see it in KSP.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-08-12T17:33:06Z","Content":"\n\u003Cp\u003EWhat about cables attached to kerbals back like In KAS mod ? It would use short rope attached to side of the rover and pull the cable by walking or using jet-pack.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-12T18:36:22Z","Content":"\n\u003Cp\u003EI have often wanted the rope idea. The big problem with trying to flip rovers in EVA as it is now is twofold:\u003C/p\u003E\u003Cp\u003E1 - You can\u0027t tell the game that you\u0027re trying to hold on to a part. You \u0022slip off\u0022 them.\u003C/p\u003E\u003Cp\u003E2 - When using the backpack thrusters, any collision terminates your jetpack thrust until your kerbal falls to the ground and rights himself. This means you can\u0027t put your head under the rover and thrust up to push it over. As soon as you hit the rover your thrust stops and you fall.\u003C/p\u003E\u003Cp\u003EI have had limited success with righting a rover by using my kerbalnaut as a projectile, flying it toward a bit of the rover from the right direction so that the collision will impart just enough rotation onto it to tip it (useful for rovers on their side but not all the way upside down). But it would be a lot better to just hook a cable and pull on it.\u003C/p\u003E\n"}]}