{"TopicId":42113,"ForumId":32,"TopicTitle":"Why I find Ascents Boring","CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-08-12T01:57:07Z","PageNum":5,"Articles":[{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2013-08-13T05:24:25Z","Content":"\n\u003Cp\u003EAscent is a great time to take screenshots.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-08-13T08:51:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinTMC\u0022 data-cite=\u0022KevinTMC\u0022\u003E\u003Cdiv\u003EEither I fly it manually and have the launch recorded, or map out a series of target altitudes and speeds and attitudes by hand, ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps when there is Kerbonaut Training, you can teach them to do just that. Then they can attempt to fly the ascent profile for you - if you trust them. Not sure I would would trust the stupid ones!\u003C/p\u003E\u003Cp\u003EPersonally I would be happy with fixing the need to switch to map view to see your predicted Ap.\u003C/p\u003E\u003Cp\u003EThat, and some audio and/or visual cues so you don\u0027t have to spend the whole ascent looking at the navball. Perhaps the volume and tone of the wind rushing by can tell you if you are pushing past terminal velocity and should slow down. Or if the wind roar dies down in the thin air higher up you know you can turn more. Visual cues like contrails could be used as well perhaps.\u003C/p\u003E\n"},{"CreatedByName":"loknar","CreatedById":77750,"CreatedDateTime":"2013-08-13T09:03:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlamedSteak\u0022 data-cite=\u0022FlamedSteak\u0022\u003E\u003Cdiv\u003EBuilding rockets by the seat of your pants without the use of mechjeb keeps it exciting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery nice!\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-13T13:39:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022loknar\u0022 data-cite=\u0022loknar\u0022\u003E\u003Cdiv\u003EVery nice!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly, it\u0027s sometimes more Exciting WITH Mechjeb. Designs that really push the boundaries of controlability it doesn\u0027t do well with. Especially spaceplanes. It has a distinct tendency towards \u0027(Auto)pilot Induced Oscillations\u0027, right up to the point of actually losing control of the craft as a result. So you either end up flying those manually until you get to the point where it can control it itself, or you redesign it so that Mechjeb can fly it without losing control.\u003C/p\u003E\u003Cp\u003EHonestly, Mechjeb\u0027s spaceplane functions really are Terrible. The only one that\u0027s any good is the ILS, withOUT the landing autopilot...\u003C/p\u003E\n"}]}