{"TopicId":42162,"ForumId":16,"TopicTitle":"Inconsistent physics or controls glitch?","CreatedByName":"twilite20K","CreatedById":77814,"CreatedDateTime":"2013-08-12T11:04:04Z","PageNum":1,"Articles":[{"CreatedByName":"twilite20K","CreatedById":77814,"CreatedDateTime":"2013-08-12T11:04:04Z","Content":"\n\u003Cp\u003EI was just working on this hateful SSTO spaceplane... And a few flights ago I was able to successfully get it up to a 30,000m orbit. Great. \u003C/p\u003E\u003Cp\u003ESo then I try a radical redesign, without saving, moving some fuel tanks around, radial connecting, semi-clipping but no console clipping or anything non-stock. move the ram engines above the wing instead of below the wing a few other things. Try to fly...it lifts, and then promptly nosedives like a steel pigeon. Ok, that didn\u0027t work.\u003C/p\u003E\u003Cp\u003ESo I reload my spaceplane design, and in an effort to save weight, remove the Rockomax Radial engines from the bottom of the leading forward delta wings. \u003C/p\u003E\u003Cp\u003Eoriginal plane here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fL9L7g5.jpg?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/fL9L7g5.jpg?1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOk so it should fly like it did before, after such a minor change, right? No. Won\u0027t stay in the air unless I jam on the pitch button. Like the thing has no lift of it\u0027s own anymore. So has anyone else seen anything like this before?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-30T18:52:18Z\u0022 title=\u002208/30/2013 06:52  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 30, 2013\u003C/time\u003E by twilite20K\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-08-12T17:19:28Z","Content":"\n\u003Cp\u003EI\u0027ve had this problem.\u003C/p\u003E\u003Cp\u003EI had a plane that flew like a dream, cruised around in it and what not.. then I decided to switch the direction of the landing gear.. and she wouldn\u0027t even take off. Weird...but whatever.. I\u0027ll just switch em back. all it is, is a simple rotation. SO I switch em back..and she still flies like crap. I messed around for a good hour trying to get that thing to fly again.. no go. and all I did was rotate landing gear 180, and then back. no other changes.\u003C/p\u003E\n"},{"CreatedByName":"Thomas Cook","CreatedById":77805,"CreatedDateTime":"2013-08-12T17:30:14Z","Content":"\n\u003Cp\u003ECould you, maybe upload the image of the plane with the center of mass and center of thrust enabled?\u003C/p\u003E\u003Cp\u003EMy planes always seems to fail at that point. I\u0027ve also had lots of trouble when fuel got consumed. It seems that if you consume fuel, the center of mass could change, tipping planes in directions you don\u0027t want.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-12T18:24:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022twilite20K\u0022 data-cite=\u0022twilite20K\u0022\u003E\u003Cdiv\u003ESo I reload my spaceplane design, and in an effort to save weight, remove the Rockomax Radial engines from the bottom of the leading forward delta wings. \u003Cp\u003EOk so it should fly like it did before, after such a minor change, right? No. Won\u0027t stay in the air unless I jam on the pitch button. Like the thing has no lift of it\u0027s own anymore. So has anyone else seen anything like this before?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell first of all, those radial engines are 0.9 tons each. Removing them likely changed your center of mass enough that the plane became unstable. Did you put the engines back and do another flight to confirm that it was the change that did it, rather than a bug being introduced?\u003C/p\u003E\u003Cp\u003ERemoving nearly 2 tons from the middle of a spaceplane is rarely a \u0022minor change\u0022. Even the slightest of changes can upset the balance, this is why a lot of people (myself included) have trouble once they get up to lighting their rocket engines, because mass has shifted from the jet fuel being burned that the CoM no longer is where you\u0027d need it to be.\u003C/p\u003E\u003Cp\u003ESSTOs are hard, I think you\u0027re underestimating the change you did. Try putting the engines back and see if it flies like it did before.\u003C/p\u003E\n"},{"CreatedByName":"krenshala","CreatedById":76062,"CreatedDateTime":"2013-08-12T21:50:55Z","Content":"\n\u003Cp\u003EIt would be nice if we had a toggle to switch fuel tanks from full to empty and back in the hangar/VAB. That would make some of the design process easier for these kinds of things.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-08-12T22:01:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022krenshala\u0022 data-cite=\u0022krenshala\u0022\u003E\u003Cdiv\u003EIt would be nice if we had a toggle to switch fuel tanks from full to empty and back in the hangar/VAB. That would make some of the design process easier for these kinds of things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI bet this would be trivial to code up.\u003C/p\u003E\u003Cp\u003EHowever, in my experience, I\u0027m headed for disaster if I break the rule that fuel tanks must be centered on the center of mass. Sometimes I can build something that can handle a moving center of mass, but it\u0027s going to require a few more test \u0022flights\u0022.\u003C/p\u003E\n"},{"CreatedByName":"twilite20K","CreatedById":77814,"CreatedDateTime":"2013-08-30T18:51:43Z","Content":"\n\u003Cp\u003EActually once I removed the joystick and restarted the game, the controls went back to normal. Strange thing is I disconnected the stick during flight to see if that was the culprit and my plane still flew like a lead duck. Not that the controls were unresponsive, but the plane would just gradually lose lift. I\u0027m strictly keyboard now, and this aluminum goose is now stuck in orbit!!\u003C/p\u003E\n"}]}