{"TopicId":42244,"ForumId":16,"TopicTitle":"Setting up a comm sat network on Duna.","CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-08-12T22:54:35Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-08-12T22:54:35Z","Content":"\n\u003Cp\u003EI\u0027m thinking of setting up a comms network(stock communotrons not remote tech) from my (yet to be designed/launched unmanned Duna mission) Duna rovers orbiter part from an equatorial orbit on Duna. Could someone provide me with general instructions for setting up a 5 sat network (im thinking of attaching the sats to the 6-way hub part using docking ports) on Duna? Amounts of fuel required for each satellites boost stage, earliest Duna launch window, etc....\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-12T23:17:10Z","Content":"\n\u003Cp\u003EThe principle is pretty much the same as setting up a network around Kerbin. Because Ike is in a geosynchronous orbit, however, you can land one satellite on Ike that will always remain pointed at Duna, and cover most of its orbit plus about half the surface. One more satellite on the other side of Duna, at the same altitude, should pretty much cover the surface except for the poles. Use three polar satellites to cover those and also keep the two satellites opposite Duna in touch with each other. That\u0027s a pretty solid network with just five satellites.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T17:17:28Z\u0022 title=\u002208/13/2013 05:17  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by Kimberly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-12T23:22:35Z","Content":"\n\u003Cp\u003EFor a twist on the standard comm network...\u003C/p\u003E\u003Cp\u003EDuna and Ike are mutually tidal-locked, so a relay probe landed on the Duna-facing side of Ike has LOS to nearly half of Duna\u0027s surface. Land another relay probe on Duna, directly \u0022below\u0022 Ike, and one of them will nearly always be in LOS of Kerbin. \u003C/p\u003E\u003Cp\u003ESo long as your surface explorers keep Ike above the horizon (it\u0027s stationary in Duna\u0027s sky), they have a link to home.\u003C/p\u003E\u003Cp\u003EAugment with satellites if you want global coverage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T23:25:46Z\u0022 title=\u002208/12/2013 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-08-13T00:48:26Z","Content":"\n\u003Cp\u003EThis may be a dumb question.. is the \u0022comm network\u0022 just for fun, or does it actually serve a purpose in game?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"krenshala","CreatedById":76062,"CreatedDateTime":"2013-08-13T01:14:11Z","Content":"\n\u003Cp\u003EWith the Remote Tech mod, its a required feature to control things away from Kerbin and possibly in Kerbin orbit as well; I haven\u0027t tried it yet so I\u0027m not clear on the range for \u0022basic\u0022 communication with it installed.\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-08-13T08:19:06Z","Content":"\n\u003Cp\u003EI think the easiest way to set up a communication network with satellites is to launch a spacecraft with all six satellites onboard (one for spare). Scott Manley made a video about\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Z3FHOQFVV0k?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E.\u003Cp\u003ETo determine what periapsis the orbit should have, there\u0027s no way to avoid \u003Ca href=\u0022https://en.wikipedia.org/wiki/Kepler%27s_laws\u0022 rel=\u0022external nofollow\u0022\u003EKepler\u0027s laws of planetary motion\u003C/a\u003E and the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Vis-viva_equation\u0022 rel=\u0022external nofollow\u0022\u003EVis-viva equation\u003C/a\u003E, which both include some maths and geometry.\u003C/p\u003E\u003Cp\u003EFor the satellite itself, a \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Oscar-B_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003EOscar-B\u003C/a\u003E and \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/LV-1_Liquid_Fuel_Engine\u0022 rel=\u0022external nofollow\u0022\u003ELV-1\u003C/a\u003E should be enough. But with the invention of tiny RCS tanks, a \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/FL-R10_RCS_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003EFL-R10\u003C/a\u003E with some thrusters might be useful.\u003C/p\u003E\u003Cp\u003EIn Duna orbit a \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Clamp-O-Tron_Jr.\u0022 rel=\u0022external nofollow\u0022\u003EClamp-O-Tron Jr.\u003C/a\u003E could be useful to refuel the satellite.\u003C/p\u003E\u003Cp\u003EThe launch time can be found out by guestimating the angle between the two planets. And with the use of \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E, which provides very good data.\u003C/p\u003E\n"}]}