{"TopicId":42278,"ForumId":25,"TopicTitle":"to the stars- and back-and maybe to the stars again-and back...","CreatedByName":"Fastfishy2","CreatedById":58118,"CreatedDateTime":"2013-08-13T04:11:49Z","PageNum":1,"Articles":[{"CreatedByName":"Fastfishy2","CreatedById":58118,"CreatedDateTime":"2013-08-13T04:11:49Z","Content":"\n\u003Cp\u003Ethis challenge has no points but it does have rules.\u003C/p\u003E\u003Cp\u003Eyou are aiming to make a ship that can leave kerbin\u0027s orbit, get into orbit around another planet (not mun or minmus) and get back to kerbin orbit, and then do the whole thing again,\u003C/p\u003E\u003Cp\u003Eyou are encouraged to use hyper edit to: get the parts and refuel modules into orbit around kerbin (and rendezvous), but no fuel infinity, otherwise all mods welcome.\u003C/p\u003E\u003Cp\u003Ei am already underway with CCCP GHERMAN TITOV \u003C/p\u003E\u003Cp\u003Efeel free to post screenshots.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003Ealso please post about your ship if you are building one for the challenge, and it would be cool if you could update your progress.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T07:19:06Z\u0022 title=\u002208/13/2013 07:19  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by Fastfishy2\u003C/strong\u003E\n\u003Cbr\u003Ebetter description\n\u003C/span\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-08-13T04:16:10Z","Content":"\n\u003Cp\u003EHuh this sounds pretty easy.\u003C/p\u003E\n"},{"CreatedByName":"Belgurath","CreatedById":54217,"CreatedDateTime":"2013-08-13T04:56:13Z","Content":"\n\u003Cp\u003EToday I built a deep space transfer shuttle for my crew - has about 13k dV BEFORE refueling when sitting in a 250 km parking orbit. If we say I suck at piloting, which I don\u0027t, then we can assume ~ 4,300 dV per round trip to and from Duna means that I should be able to get three round trips out of it BEFORE I refuel, which I could easily do by just leaving another one in Kerbin parking orbit and docking after each trip to top off. Designed it so I could do \u0022regular\u0022 and \u0022emergency\u0022 crew transfers to and from Moho or Eeloo with a single vehicle without refueling - refueling is nice from a long-term-mission/multiple-mission standpoint and/or if you want to be doing a lot of moving around an SOI, but you have to add in all the support missions to build the refueling infrastructure and that gets tedious for fairly simple go-land-return missions, which is all I have planned for Moho and Eeloo - need some Easter Eggs or interesting geology there to make it really worth my while to visit for more than just a cursory mission.\u003C/p\u003E\n"},{"CreatedByName":"Fastfishy2","CreatedById":58118,"CreatedDateTime":"2013-08-13T07:13:45Z","Content":"\n\u003Cp\u003Ecool-did you build it becuase of the challenge or was it already built?\u003C/p\u003E\n"},{"CreatedByName":"Fastfishy2","CreatedById":58118,"CreatedDateTime":"2013-08-13T07:33:02Z","Content":"\n\u003Cp\u003Eis it a plane-type shuttle or a shuttling vehicle?\u003C/p\u003E\u003Cp\u003Eif its a plane then i am so jealous.\u003C/p\u003E\u003Cp\u003Emy ship bears more resemblance to USSC Discovery.\u003C/p\u003E\n"},{"CreatedByName":"Fastfishy2","CreatedById":58118,"CreatedDateTime":"2013-08-14T01:22:34Z","Content":"\n\u003Cp\u003EUMMM... IT KINDA BROKE\u003C/p\u003E\u003Cp\u003Eim constructing a new one\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2013-08-14T02:27:26Z","Content":"\n\u003Cp\u003EWell I\u0027m already building it using the Orion propulsion mod and it is a supply and refit ship so currently its unmanned but a shuttle could dock into it\u003C/p\u003E\u003Cp\u003EI don\u0027t need to care about dV anymore, I could just point my ship to a planet and thrust continuously\u003C/p\u003E\n"}]}