{"TopicId":42326,"ForumId":16,"TopicTitle":"Crew Transfer Between Docked Craft","CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-13T14:23:15Z","PageNum":1,"Articles":[{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-13T14:23:15Z","Content":"\n\u003Cp\u003EIs it possible (via mod or some command I\u0027m unaware of) to move a crew member from one orbiting vehicle docked to another, WITHOUT EVA? I have come to the conclusion that I SUCK at EVA. The camera and movement controls are completely non-intuitive to me, the jetpack seems wildly overpowered for small inputs and I nearly tear my hair out every time I have to move crew members in space. It seems to me that docking clamps (especially the Clamp-O-Tron Senior) should be plenty large enough to have interior tunnels for connecting vehicles. And pretty much every real-world crewed spacecraft since the late 60\u0027s has had a connecting tunnel through the docking ports. So ... am I just missing something in the game about this, or are we really stuck climbing out of ships (without a tether no less) and jetting around hoping to make it to the other ship/station/whatever?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T18:26:15Z\u0022 title=\u002208/13/2013 06:26  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by LameLefty\u003C/strong\u003E\n\u003Cbr\u003EGrammar, typo\n\u003C/span\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-13T14:27:25Z","Content":"\n\u003Cp\u003EThe crew manifest mod allows you to do this.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/18-1-kerbal-crew-manifest/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/18-1-kerbal-crew-manifest/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit- While I haven\u0027t tested this yet (because it just now dawned on me) combined with KAS you don\u0027t even need to be docked to transfer crew.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-13T14:27:44Z","Content":"\n\u003Cp\u003EThere might be other mods but only one I\u0027ve heard of giving you that ability is Crew Manifest. In a stock game you have to EVA. Any realworld analogy is moot at this point since it simply isn\u0027t in the game yet.\u003C/p\u003E\n"},{"CreatedByName":"ZenithRising","CreatedById":77506,"CreatedDateTime":"2013-08-13T17:13:40Z","Content":"\n\u003Cp\u003EAdd ladders. They should make your EVA a lot easier.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-13T18:25:31Z","Content":"\n\u003Cp\u003EThanks folks, that\u0027s what I was afraid of. I need to include EVA handholds around my ships and stations now, I guess. \u003C/p\u003E\u003Cp\u003E(Have I mentioned, I REALLY hate EVAs?)\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-13T19:06:14Z","Content":"\n\u003Cp\u003EI try to minimize the mods I have, but crew manifest has become one of my must haves just because of that. Hopefully it will fully integrate into the game (they did take part of it in this last update).\u003C/p\u003E\n"}]}