{"TopicId":42447,"ForumId":32,"TopicTitle":"Space... it\u0026#039;s not far, but it is fast!","CreatedByName":"Sudragon","CreatedById":53192,"CreatedDateTime":"2013-08-14T07:44:33Z","PageNum":1,"Articles":[{"CreatedByName":"Sudragon","CreatedById":53192,"CreatedDateTime":"2013-08-14T07:44:33Z","Content":"\n\u003Cp\u003EFrom the latest XKCD \u003Cem\u003EWhat If?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://what-if.xkcd.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://what-if.xkcd.com/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-14T09:07:30Z","Content":"\n\u003Cp\u003EI believe the answerer failed to actually answer the question.\u003C/p\u003E\u003Cp\u003EAs KSP has shown, getting enough fuel into orbit is not an issue with enough determination.\u003C/p\u003E\u003Cp\u003EBut WHAT IF a rocket slowed its orbital speed to non-existence before reentering? Drop the plausibility, and focus on the answer. Would it still need a heat shield?\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-08-14T09:16:01Z","Content":"\n\u003Cp\u003EIf you reduce your velocity to zero just before you hit the atmosphere then no, you won\u0027t need a heat shield since you will be falling at or near terminal velocity at all times. The result would probably be very similar to what happens with those baloons people let fly up to \u0027space\u0027 where they burst and let their cargo fall back down to earth, or to what Felix Baumgartner did last year.\u003C/p\u003E\u003Cp\u003EHowever, as the author of XKCD said, you would need a huge amount of fuel to reduce your velocity to zero, and that would be extremely unpractical... \u003C/p\u003E\u003Cp\u003EThink of it like this: It takes most of the fuel of a huge rocket to get the relatively tiny payload up to orbital speed. That means that, in order to slow that payload back down to zero, you would need another rocket almost as big as the one that launched it. Imagine the size of the rocket that would be needed to bring that whole rocket with it\u0027s fuel intact up to orbit. It would need to be enormous.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T09:30:39Z\u0022 title=\u002208/14/2013 09:30  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by Awaras\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-14T09:37:13Z","Content":"\n\u003Cp\u003EI am not quite sure if I understand deorbit mechanics or aerodynamic impact correctly... but as I see it there is a kerbal answer and a earth answer\u003C/p\u003E\u003Cp\u003EIn Kerbal Space, I often use the kill all orbit speed and then burn my way into atmosphere almost straight down. Doing this at Kerbal I still end up hitting the 1/2 atmo barrier at over 500 m/s, sometimes without drogue chutes the regular chute die or rip off if I am going too fast. This means I still need a heat shield for re-entry at Kerbal, but I can usually get down to around 200 m/s at Duna - no heat effects but chutes fairlure is still a concern\u003C/p\u003E\u003Cp\u003EIn Earth space it translates to almost 4500 mph hitting the 1/2 atmo point... I am pretty sure hitting that air density face first would crush you craft like a beer can hence the angled approach. Stone dropping on Mars would have similar effects. thundering down through the atmo so fast would damage or destroy any craft we\u0027ve sent, and the chutes would prolly fail once deployed.\u003C/p\u003E\u003Cp\u003EI have not the math to figure out what vertical acceleration would act on the craft if you burned off all the lateral movement and hung the ship in space then let it drop. I do know that acceleration toward the ground would be a constant until atmo started to act as a break and even then acceleration would still be positive until terminal velocity was achieved. Also the fuel needed to stop even a small craft .... say a 4.5 tonne lander would be big, and leave little for the decel towards the surface. Maybe with very high altitude drogue\u0027s.... 1/4 km diameter canopies that release before the thicker atmo hits... might make it work tho.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-08-14T09:38:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003Ein order to slow that payload back down to zero, you would need another rocket almost as big as the one that launched it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight. A skycrane definitely does not have enough fuel to do that.\u003C/p\u003E\n"},{"CreatedByName":"luckyhendrix","CreatedById":78280,"CreatedDateTime":"2013-08-14T09:46:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003ERight. A skycrane definitely does not have enough fuel to do that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you refer to curiosity mission? look at the mission profile , the skycrane is just there for the final stage of the ascent , after most of the speed as been bleeded of during the reentry (where the heat shield was more than needed ...).\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-08-14T10:17:33Z","Content":"\n\u003Cp\u003EWell sure, let\u0027s make our rocket 7.4 times as heavy to have twice the dV so we don\u0027t need to drag up a heatshield that weighs maybe 1ton. Kerbal logic there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-08-14T10:17:49Z","Content":"\n\u003Cp\u003EThereÃ‚Â´s probably a height limit at which youÃ‚Â´d need a heat shield even when dropping in with 0 horizontal speed. \u003C/p\u003E\u003Cp\u003EYou need a heat shield, because heat builds up as you slow down. If you go too fast - no matter which direction (except upwards, obviously) - , youÃ‚Â´ll slow down a lot, resulting in a lot of heat. If you cancel all horicontal velocity too high up, youÃ‚Â´ll gonna fall down much longer before you hit the atmosphere (or a significant density, relative to your vesselÃ‚Â´s current speed and other properties), thus be too fast, slow down too much in the atmo, have a lot of heat because of that, and thusly need a heatshield. \u003C/p\u003E\u003Cp\u003EOn the other hand, a vessel doesnt need to go down all the way to the ground in order to free fall straight downwards without getting toasted, obviously. Thus, their must be an upper limit at which a zero horizontal velocity nufflifies the need for a heatshield. This limit should be pretty much constant for any specific body, but probably varies for different bodies, due to their aerodynamic properties and the heat tolerance of their materials, mostly.\u003C/p\u003E\u003Cp\u003EThe quesion is then, if any manmade body able to reach a stable orbit (implying a certain altitude) has aerodynamic and other properties that would allow it not to heat up too much by dispending the velocity with which it would enter the part of the atmosphere with sufficient density. I think we are looking for a certain velocity/atmospheric density-threshold here, which when surpassed will cause too much decelaration and heat.\u003C/p\u003E\n"},{"CreatedByName":"Fuzzy Dunlop","CreatedById":27329,"CreatedDateTime":"2013-08-14T10:31:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr. Scruffy\u0022 data-cite=\u0022Mr. Scruffy\u0022\u003E\u003Cdiv\u003EThereÃ‚Â´s probably a height limit at which youÃ‚Â´d need a heat shield even when dropping in with 0 horizontal speed. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell obviously if you drop in from an orbit on the edge of Earth SOI you\u0027re going to hit the atmosphere at near escape velocity. But from LEO you should be mostly OK, according to \u003Ca href=\u0022http://what-if.xkcd.com/28/\u0022 rel=\u0022external nofollow\u0022\u003Ea previous XKCD what if\u003C/a\u003E that\u0027s barely enough to sear a steak.\u003C/p\u003E\u003Cp\u003EThere\u0027s another factor here in that dropping straight down is, for the same speed, much worse than entering at a shallow angle. If you just graze the atmosphere you can kill a lot of your velocity in the very thin upper layers and hence the peak tempuratures aren\u0027t nearly as high.\u003C/p\u003E\n"},{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2013-08-14T11:17:23Z","Content":"\n\u003Cp\u003EWhy not try it? Seems quite easy in KSP.\u003C/p\u003E\u003Cp\u003EStick a thermometer on a pod.\u003C/p\u003E\u003Cp\u003ELaunch to 70x70 orbit. \u003C/p\u003E\u003Cp\u003EReduce ground speed to 0\u003C/p\u003E\u003Cp\u003EPlummet down\u003C/p\u003E\u003Cp\u003ERecord temperature\u003C/p\u003E\u003Cp\u003EInteresting to see if you can avoid triggering the reentry effects \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-14T13:54:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EImagine the size of the rocket that would be needed to bring that whole rocket with it\u0027s fuel intact up to orbit. It would need to be enormous.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you get about one frame per second when doing it. Huge rocket, yes, but the amount of bracing struts for that kind of weight? Absurd amounts.\u003C/p\u003E\n"},{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2013-08-14T14:49:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EAnd you get about one frame per second when doing it. Huge rocket, yes, but the amount of bracing struts for that kind of weight? Absurd amounts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELaunch your return craft separate and rendezvous and dock before reentry.\u003C/p\u003E\n"},{"CreatedByName":"ManaaniWanderer","CreatedById":28850,"CreatedDateTime":"2013-08-14T15:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sethnizzle\u0022 data-cite=\u0022Sethnizzle\u0022\u003E\u003Cdiv\u003ELaunch your return craft separate and rendezvous and dock before reentry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem is most of the mass and therefore part count of the return craft is the fuel and engines to kill the velocity, only a tiny fraction is the pod/probe core and chutes.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-14T15:45:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003E If you reduce your velocity to zero just before you hit the atmosphere then no, you won\u0027t need a heat shield since you will be falling at or near terminal velocity at all times. \u003Cp\u003EIt takes most of the fuel of a huge rocket to get the relatively tiny payload up to orbital speed. That means that, in order to slow that payload back down to zero, you would need another rocket almost as big as the one that launched it. Imagine the size of the rocket that would be needed to bring that whole rocket with it\u0027s fuel intact up to orbit. It would need to be enormous.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is \u003Cem\u003Eprecisely\u003C/em\u003E the issue - and everyone that ignores the practicality to focus on the \u0022theory\u0022 is thinking too hard and wasting their time.\u003C/p\u003E\u003Cp\u003EThe answer to the \u0022theoretical\u0022 question is: DUH! Why would you need a heat shield if you were only travelling at terminal velocity? The whole reason heat accumulates in re-entry is because a ship is going \u003Cem\u003Efaster\u003C/em\u003E than terminal velocity and atmosphere is accumulating under the craft. It\u0027s friction and oxidation. Anyone who needs a \u0022theoretical\u0022 answer doesn\u0027t understand terminal velocity in the first place.\u003C/p\u003E\u003Cp\u003ESo, then, it\u0027s clear that the only problem worth considering \u003Cem\u003Eis\u003C/em\u003E the \u003Cem\u003Epractical application\u003C/em\u003E. And it\u0027s equally clear that the rocket needed would have to be \u003Cem\u003Emore than twice\u003C/em\u003E the size of the rocket that launched just the initial payload (in fact, considerably more so).\u003C/p\u003E\u003Cp\u003EGiven that a majority of efficient lifters only have a 10-16% payload capacity to LKO, a 10-ton payload would need about a 65-ton lifter. So if you were planning to deliver that 75-ton assembly to another atmosphere, it would need a lifter of about\u003Cem\u003E 470 tons\u003C/em\u003E. (Even launching just the return de-lifter in Sethnizzle\u0027s theory would take 406 tons, not much of a savings eh?)\u003C/p\u003E\u003Cp\u003EYou might think \u0022but I need less fuel coming down, because I\u0027m assisted by gravity, rather than fighting it!\u0022 Well, that\u0027s what causes re-entry heating, as I\u0027ve already explained. If you want to come down no faster than terminal velocity, \u003Cem\u003Eyou will be fighting gravity\u003C/em\u003E all the way. It matters not whether it\u0027s offsetting 1G on the way up, or the way down, it takes the same amount of energy.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EWell sure, let\u0027s make our rocket 7.4 times as heavy to have twice the dV so we don\u0027t need to drag up a heatshield that weighs maybe 1ton. Kerbal logic there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBINGO. Ralathon gets it. That\u0027s why it\u0027s done the way it is, since the days of Mercury.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T15:48:13Z\u0022 title=\u002208/14/2013 03:48  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by HeadHunter67\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-08-14T15:45:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ManaaniWanderer\u0022 data-cite=\u0022ManaaniWanderer\u0022\u003E\u003Cdiv\u003EProblem is most of the mass and therefore part count of the return craft is the fuel and engines to kill the velocity, only a tiny fraction is the pod/probe core and chutes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd thus slowing down to 0 m/s to land back on the planet from orbit is completely impractical; just use heatshields and aerobrake.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E also the above post. That\u0027s also an important point.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-14T16:10:07Z","Content":"\n\u003Cp\u003EIn KSP, at least, there is a factor that isn\u0027t really present in real life: vastly different I(sp) in space than in the atmosphere. It\u0027s not really that difficult in KSP to launch a very small craft that has an excess of 2,500m/s dV due to more efficient engines being used in space. It can even have quite a healthy TWR. A minimalistic craft that can get into orbit and re-enter with zero horizontal velocity won\u0027t actually be that much bigger than one that just re-enters via a heatshield.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-14T16:10:37Z","Content":"\n\u003Cp\u003EIt\u0027s not a question of \u0022practical\u0022. There may be a situation where you \u003Cem\u003Eneed\u003C/em\u003E to reduce or remove the reentry heat.\u003C/p\u003E\u003Cp\u003EFor instance, imagine that for some reason you suddenly need to deorbit and return home a space object not intended to be equipped with a heatshield. For whichever reason, coming up with a modular heat shield container large enough for it is impossible, or can\u0027t be done quickly enough.\u003C/p\u003E\u003Cp\u003EI mean, let\u0027s take an extreme example. A small alien spacecraft had FTL-traveled into our solar system, and entered a decaying orbit around Earth, where it seems to have gotten stuck, and sent out what seems to be a distress signal. It is imperative that this craft be brought planetside, as carefully and softly as possible. A heatshield might be too risky, as it\u0027s impossible to tell if the craft will be able to handle the stress of reentry even with one. Dismantling it in orbit is not a good option either. The craziest way, tremendously impractical normally, is to slow it down as much as possible and gently ease it into the atmosphere.\u003C/p\u003E\u003Cp\u003EThe question thus is: would it really be the least stressful way to do such an operation, and what would it actually \u003Cem\u003Etake\u003C/em\u003E?\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-08-14T16:19:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe question thus is: would it really be the least stressful way to do such an operation, and what would it actually \u003Cem\u003Etake\u003C/em\u003E?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince you\u0027re playing devil\u0027s advocate here I\u0027m assuming your scenario rules out the option of simply boosting it to a stable orbit?\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-14T16:36:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EThe question thus is: would it really be the least stressful way to do such an operation, and what would it actually \u003Cem\u003Etake\u003C/em\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMagic.\u003C/p\u003E\u003Cp\u003ESeriously, assembling a booster to rendezvous with an object of unknown composition in a decaying orbit is nightmarish enough without a \u0022ticking timebomb\u0022 deadline of the decaying orbit. Adding in rendezvousing with the object with enough fuel to kill its relative velocity and somehow lower the craft to the surface would leave your engineers gibering in ancient, forgotten tongues and scribbling icons on the walls portraying non-Euclidean geometry. At that point it\u0027d be either sending up a Progress or Soyuz and hoping our visitors could EVA over to it somehow or radioing our condolences.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-14T17:28:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ESince you\u0027re playing devil\u0027s advocate here I\u0027m assuming your scenario rules out the option of simply boosting it to a stable orbit?\u003C/div\u003E\u003C/blockquote\u003EWell, not exactly. I was actually writing it somewhat differently, and it did occur to me that you could boost it (therefore I left out the inevitability of it burning up) But all you give yourself is time. Presumably you still have to bring it back in somehow, even from a stable orbit.\u003Cp\u003EMore importantly, you \u003Cem\u003Ewant\u003C/em\u003E to bring it back in. Y\u0027know, alien tech and such. Which is why I mentioned dismantling. You \u003Cem\u003Ecould\u003C/em\u003E just try to save whoever\u0027s in there, too, but, again, same issue. You don\u0027t know if the thing would just explode if you took a cutter to it in the wrong place, and you don\u0027t want to accidentally damage anything.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-08-14T17:39:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EIt\u0027s not a question of \u0022practical\u0022. There may be a situation where you \u003Cem\u003Eneed\u003C/em\u003E to reduce or remove the reentry heat.\u003Cp\u003EFor instance, imagine that for some reason you suddenly need to deorbit and return home a space object not intended to be equipped with a heatshield. For whichever reason, coming up with a modular heat shield container large enough for it is impossible, or can\u0027t be done quickly enough.\u003C/p\u003E\u003Cp\u003EI mean, let\u0027s take an extreme example. A small alien spacecraft had FTL-traveled into our solar system, and entered a decaying orbit around Earth, where it seems to have gotten stuck, and sent out what seems to be a distress signal. It is imperative that this craft be brought planetside, as carefully and softly as possible. A heatshield might be too risky, as it\u0027s impossible to tell if the craft will be able to handle the stress of reentry even with one. Dismantling it in orbit is not a good option either. The craziest way, tremendously impractical normally, is to slow it down as much as possible and gently ease it into the atmosphere.\u003C/p\u003E\u003Cp\u003EThe question thus is: would it really be the least stressful way to do such an operation, and what would it actually \u003Cem\u003Etake\u003C/em\u003E?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust give it a minor boost to stabilize and pick up the crew with a small dedicated capsule. Takes much less dV and is much safer.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-08-14T17:48:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EThis is \u003Cem\u003Eprecisely\u003C/em\u003E the issue - and everyone that ignores the practicality to focus on the \u0022theory\u0022 is thinking too hard and wasting their time.\u003Cp\u003EThe answer to the \u0022theoretical\u0022 question is: DUH! Why would you need a heat shield if you were only travelling at terminal velocity? The whole reason heat accumulates in re-entry is because a ship is going \u003Cem\u003Efaster\u003C/em\u003E than terminal velocity and atmosphere is accumulating under the craft. It\u0027s friction and oxidation. Anyone who needs a \u0022theoretical\u0022 answer doesn\u0027t understand terminal velocity in the first place.\u003C/p\u003E\u003Cp\u003ESo, then, it\u0027s clear that the only problem worth considering \u003Cem\u003Eis\u003C/em\u003E the \u003Cem\u003Epractical application\u003C/em\u003E. And it\u0027s equally clear that the rocket needed would have to be \u003Cem\u003Emore than twice\u003C/em\u003E the size of the rocket that launched just the initial payload (in fact, considerably more so).\u003C/p\u003E\u003Cp\u003EGiven that a majority of efficient lifters only have a 10-16% payload capacity to LKO, a 10-ton payload would need about a 65-ton lifter. So if you were planning to deliver that 75-ton assembly to another atmosphere, it would need a lifter of about\u003Cem\u003E 470 tons\u003C/em\u003E. (Even launching just the return de-lifter in Sethnizzle\u0027s theory would take 406 tons, not much of a savings eh?)\u003C/p\u003E\u003Cp\u003EYou might think \u0022but I need less fuel coming down, because I\u0027m assisted by gravity, rather than fighting it!\u0022 Well, that\u0027s what causes re-entry heating, as I\u0027ve already explained. If you want to come down no faster than terminal velocity, \u003Cem\u003Eyou will be fighting gravity\u003C/em\u003E all the way. It matters not whether it\u0027s offsetting 1G on the way up, or the way down, it takes the same amount of energy.\u003C/p\u003E\u003Cp\u003EBINGO. Ralathon gets it. That\u0027s why it\u0027s done the way it is, since the days of Mercury.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, it not that you\u0027re hitting the atmo at more than terminal velocity, it\u0027s that you\u0027re hitting it at way, way, way more than terminal velocity. Also it\u0027s not friction and oxidation. What happens is the air in front is getting crushed. It\u0027s heating up into a plasma which is, in turn, heating up the craft.\u003C/p\u003E\u003Cp\u003EWith the discovery that electrical fields can be used to manipulate flame, there are projects looking into using electrical fields to push back the plasma so as to reduce heating to the craft. I wish i could remember the article. But, I digress.\u003C/p\u003E\u003Cp\u003EYou wouldn\u0027t need to slow up to 0 before atmo to keep that from happening. Just slow down a good bit and you\u0027re good. I use FAR and DRE and i\u0027ve found that all I need to do to minimize heating is slow up to under 2000m\u0027s as I hit about 35km. No heat shield required.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-14T18:10:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rosenkranz\u0022 data-cite=\u0022rosenkranz\u0022\u003E\u003Cdiv\u003EAlso it\u0027s not friction and oxidation. What happens is the air in front is getting crushed. It\u0027s heating up into a plasma which is, in turn, heating up the craft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not getting \u0022crushed\u0022, it\u0027s accumulating. Boyle\u0027s Law should tell you what happens when you compress a gas.\u003C/p\u003E\u003Cp\u003ENo, what\u0027s happening is it\u0027s pressing up against more atmosphere, rather than sliding out of the way. What do you think causes the heat? Friction. And guess what all that heat does to the oxygen that\u0027s in the air? You guessed it, it burns. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou wouldn\u0027t need to slow up to 0 before atmo to keep that from happening. Just slow down a good bit and you\u0027re good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIdeally, you\u0027d want to slow to below terminal velocity, because otherwise you\u0027re gaining speed faster than the atmosphere is braking you, and you will heat up.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-14T18:15:13Z","Content":"\n\u003Cp\u003EI did the calculations in my head as I was driving home last night (inspired by the XKCD article.) If you, for instance, were able to de-orbit a Progress spacecraft from the ISS by killing all its orbital velocity, and it dropped straight down from that ~350 km height, by the time it hit any significant atmosphere (at ~100 km), it would be going something like 7500 m/s straight down. I suspect (though I don\u0027t know) that the atmosphere could not successfully decelerate an object moving that fast straight down before it hit the ground (which would take about 14 seconds without atmosphere), though it would surely vaporize it before that could happen.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-14T18:43:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EIn KSP, at least, there is a factor that isn\u0027t really present in real life: vastly different I(sp) in space than in the atmosphere. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, that\u0027s true to life. The differences in vacuum and sea level ISP are quite real. Air pressure prevents the exhaust flow from expanding fully and causes significant impacts to engine efficiency. Compare the sea level ISP of the kerosene/LOX F-1 engine of the Saturn V (263 seconds) to the vacuum ISP (~306 s.). The Space Shuttle Main Engines (LOX/LH2) has an even bigger difference: 363 s. at sea level versus 453 s. in vacuum.\u003C/p\u003E\n"}]}