{"TopicId":42505,"ForumId":55,"TopicTitle":"Realistic Mode and Arcade mode.","CreatedByName":"Warsoul","CreatedById":58082,"CreatedDateTime":"2013-08-14T20:21:42Z","PageNum":1,"Articles":[{"CreatedByName":"Warsoul","CreatedById":58082,"CreatedDateTime":"2013-08-14T20:21:42Z","Content":"\n\u003Cp\u003EI suggest multiple game mode to fit with every kind of players.\u003C/p\u003E\u003Cp\u003EThe Realistic Mode; the simulator mode in wich all realism and difficulties are present to satisfy the hardcore gamerz, nerdz, serious gamerz, etc. In short; the normal KSP\u003C/p\u003E\u003Cp\u003EAn Arcade Mode; the empire builder mode in wich you can start or unlock cool stuff like a fully operational Space Station where you can deploy unbelievable capital ship and others amazing stuffs. More suited for casual gamerz, kidz, action oriented gamerz (majority of the market). I saw so many grade A concept hidded in the shadow of grade A success game like Starcraft 2 and Call of Duty because they wont put a little time on a casual gaming mode. Like Face of War with too much micro-managing for the normal and casual gamers. I know; it\u0027s sad to say, success goes with accessibilty. Most of consummers wont take 2 weeks to learn basics of a new game. They work or study too much and they want to play something fun rapidly and easily. Some of them need to see things evolve rapidly and experience actions more often. Thats why i suggested an starting Space Station in arcade mode, to give them the opportunnity to get into space without the need to learn the basics of rocket science. A kind of hook to help them to get more involved at start, giving them a chance to enjoy the game before they abandon.\u003C/p\u003E\u003Cp\u003EI suggest too to hide an Sci-fi Space Station like this has secret bonus somewhere hidded in the KSP universe in the normal mode has relic or something like that.\u003C/p\u003E\u003Cp\u003E\u003Ciframe width=\u0022640\u0022 height=\u0022480\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022\u0022\u003E\u003C/iframe\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T20:27:43Z\u0022 title=\u002208/14/2013 08:27  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by Warsoul\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-14T20:27:09Z","Content":"\n\u003Cp\u003EUsually, I\u0027m against people mistaking KSP for a simulator, but this is a bit far. KSP just isn\u0027t this kind of game.\u003C/p\u003E\n"},{"CreatedByName":"Bob\u0026#039;s Guardian Angel","CreatedById":45023,"CreatedDateTime":"2013-08-14T20:28:19Z","Content":"\n\u003Cp\u003EWarsoul ,I hate to say it, but you are just spamming the Suggestions forum trying to turn KSP into StarCraft. It\u0027s a rocket simulator, not a science-fiction game.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-14T20:37:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bob\u0022 data-cite=\u0022Bob\u0022\u003E\u003Cdiv\u003EWarsoul \u0027 date=\u0027I hate to say it, but you are just spamming the Suggestions forum trying to turn KSP into StarCraft. It\u0027s a rocket simulator, not a science-fiction game.[/quote\u0027]\u003Cp\u003EI wouldn\u0027t go that far, he does have a coherent, logical argument.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"pyro42","CreatedById":78945,"CreatedDateTime":"2013-08-14T20:38:45Z","Content":"\n\u003Cp\u003EWell, KSP is fun because it\u0027s hard. You crash every time and then you have to retry until it works.\u003C/p\u003E\u003Cp\u003EBut there is one thing true : Some times, you just want to build a big thing and to put it in space without to have to build it part by part, launch by launch.\u003C/p\u003E\u003Cp\u003EA \u0022space station launcher\u0022 could be really usefull and funny.\u003C/p\u003E\n"},{"CreatedByName":"Morrigi","CreatedById":25077,"CreatedDateTime":"2013-08-14T20:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bob\u0022 data-cite=\u0022Bob\u0022\u003E\u003Cdiv\u003EWarsoul \u0027 date=\u0027I hate to say it, but you are just spamming the Suggestions forum trying to turn KSP into StarCraft. It\u0027s a rocket simulator, not a science-fiction game.[/quote\u0027]\u003Cp\u003EI wouldn\u0027t go that far, he does have a coherent, logical argument.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would.\u003C/p\u003E\u003Cp\u003E0/10.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-08-14T20:45:07Z","Content":"\n\u003Cp\u003EI disagree of this for the following reasons\u003C/p\u003E\u003Cp\u003E* I do not feel KSP as a starcraft type game, It is more or less about orbital physics and that\u003C/p\u003E\u003Cp\u003E* Even if it would be fun for some, again it\u0027s not what KSP is shooting for I feel\u003C/p\u003E\u003Cp\u003ESorry for not many more reasons, I am not good at that part in my mind\u003C/p\u003E\n"},{"CreatedByName":"bgraves","CreatedById":58780,"CreatedDateTime":"2013-08-14T20:58:40Z","Content":"\n\u003Cp\u003EWarsoul, I recall that this is the exact same suggestion you posted yesterday, albeit with a bit more detail. You\u0027ll remember that that thread was locked.\u003C/p\u003E\n"},{"CreatedByName":"Morrigi","CreatedById":25077,"CreatedDateTime":"2013-08-14T21:01:58Z","Content":"\n\u003Cp\u003EWarsoul, how many times have you posted stuff like this, and how often have you gotten a positive response?\u003C/p\u003E\u003Cp\u003EAll I see in the history of your started threads are some variation of \u0022I need...\u0022 and trying to get people to do work for you in the mod forums. And now you\u0027re posting it in the official suggestions forum? Really?\u003C/p\u003E\u003Cp\u003ENo one is interested. Accept defeat and move on.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-14T21:16:03Z","Content":"\n\u003Cp\u003EMarket\u0027s already saturated with versions of the \u0022Arcade\u0022 method proposed; there\u0027s little reason to change KSP (which fits nicely into a largely vacant market niche, part of its great appeal) to compete with games both better-established and purpose-built to fill that role.\u003C/p\u003E\u003Cp\u003EIf this is a democratic vote, I vote \u0022no\u0022.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"chaos_forge","CreatedById":64960,"CreatedDateTime":"2013-08-14T21:48:22Z","Content":"\n\u003Cp\u003EThe devs have said that they\u0027re never ever adding weapons to KSP, and I for one wholeheartedly agree with that choice. With that said, since most of this suggestion seems to revolve around adding weapons (i.e. making the game more amenable to \u0022action gamerz\u0022) and those are on the do-not-suggest list, can we get this thread locked?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T21:52:57Z\u0022 title=\u002208/14/2013 09:52  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by chaos_forge\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-14T22:27:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chaos_forge\u0022 data-cite=\u0022chaos_forge\u0022\u003E\u003Cdiv\u003EThe devs have said that they\u0027re never ever adding weapons to KSP, and I for one wholeheartedly agree with that choice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. And I add another resounding vote of \u003Cstrong\u003ENO\u003C/strong\u003E.\u003C/p\u003E\n"},{"CreatedByName":"VerdammteSeele","CreatedById":77390,"CreatedDateTime":"2013-08-14T22:36:39Z","Content":"\n\u003Cp\u003EYeah, it\u0027d be fun,. but that just ins\u0027t a realistic suggestion. Maybe it\u0027d work for DLC, but i\u0027d never expect to see it happen. At least Warsoul made a slightly different suggestion than usual this time.\u003C/p\u003E\n"},{"CreatedByName":"Warsoul","CreatedById":58082,"CreatedDateTime":"2013-08-15T00:02:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bgraves\u0022 data-cite=\u0022bgraves\u0022\u003E\u003Cdiv\u003EWarsoul, I recall that this is the exact same suggestion you posted yesterday, albeit with a bit more detail. You\u0027ll remember that that thread was locked.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0027\u0027Hello there\u003C/p\u003E\u003Cp\u003EWarsoul: Please put your suggestion in a clear and concise format. Right now, hardly anyone can tell what you\u0027re even suggesting and why on Earth you\u0027re posting your model here.\u003C/p\u003E\u003Cp\u003EEveryone: There is no need to turn to personal attacks. Of course it gets annoying really fast when someone pushes the same point over and over again, but that just means that they need direction, not a Stop sign.\u003C/p\u003E\u003Cp\u003EI\u0027m closing this now. You can repost the suggestion in a better format, if you wish.\u003C/p\u003E\u003Cp\u003EFEichinger\u0027\u0027\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2013-08-15T00:05:28Z","Content":"\n\u003Cp\u003EAlright, I believe I explained this earlier in the other thread.\u003C/p\u003E\u003Cp\u003ETo have your own parts added to KSP, all you need to do is convert them into the format KSP uses and write up a configuration file to describe their behavior. Guides for how to do this exist, or you could ask somebody familiar with making mods and custom parts how. \u003C/p\u003E\u003Cp\u003EImplementing weaponry of any kind has already been listed as will not happen, at least not as part of the stock game. It is on the what not to suggest list visible at the top of the suggestions board, please take the time to read it. \u003C/p\u003E\u003Cp\u003EAnd as for what you describe, it\u0027s already done.\u003C/p\u003E\u003Cp\u003EFor \u0027arcade\u0027 mode fly around without worrying about the details, use the debug menu (alt\u002BF12 on windows) to enable infinite fuel and infinite RCS. Then you can fly around as you wish without worrying about the details, add Mechjeb if you want it even easier.\u003C/p\u003E\u003Cp\u003EFor \u0027realistic\u0027 mode, there are mods as well that you\u0027ll want. Mostly FAR, Deadlyreentry, Kethane, and Remotetech. \u003C/p\u003E\u003Cp\u003ERight now the stock game is a very adaptable hybrid of arcade and realistic modes, and as such appeals to a very wide audience. All it takes is a little customization to make KSP playable however you want to enjoy it, or you can play it as-is and have tons of fun too.\u003C/p\u003E\u003Cp\u003EBut what I am seeing here is a situation where Warsoul has made the same suggestion too many times in too short of a period. It already was borderline what not to suggest, and what you are showing would probably be better suited to a mod than anything needed in the stock game. \u003C/p\u003E\u003Cp\u003EAs such this isn\u0027t the right place for this suggestion. Thread closed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T00:07:36Z\u0022 title=\u002208/15/2013 12:07  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by OdinYggd\u003C/strong\u003E\n\u003C/span\u003E\n"}]}