{"TopicId":42582,"ForumId":36,"TopicTitle":"Simple Railway mod in development. Kerbtown based.","CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-15T12:46:11Z","PageNum":6,"Articles":[{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-11-22T12:21:25Z","Content":"\n\u003Cp\u003EJust to show that this project isn\u0027t dead, (\u0027tis merely unconscious) :\u003C/p\u003E\u003Cp\u003EI did an experiment on the collision issue. As earlier experiments with TT aircraft wheels didn\u0027t show the passing through problems I\u0027ve been getting, I built a thing with them that would fit on the track. It showed an interesting bouncy behaviour:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/NmLIQAd\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/NmLIQAd.gif\u0022 alt=\u0022NmLIQAd.gif\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt was stable at higher speeds than the bogie, and handled the curve much better. Yet as it accelerates further:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/zvAgOvZ\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/zvAgOvZ.png\u0022 alt=\u0022zvAgOvZ.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis suggests the issues come from the track design, rather just the fact that my bogie was a single part. I think T shape track may be dodgy.\u003C/p\u003E\u003Cp\u003EPerhaps it\u0027s time to just go with a simple old box, and accept the fact that trains will fly of the track if you\u0027re a poor driver.\u003C/p\u003E\u003Cp\u003EThis are my ideas for the way forward:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESimpler, box cross section shape track.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELess wheels per part. Possibly, one bogie will consist of anywhere from 3 -5 components. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELearn how to make suspension things like on TT\u0027s aircraft wheels.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe current model has a couple of modeling issues, for example, there are holes where wheels make contact with the body, causing a lot of unnecessary polygons. I\u0027ll be able to do better next time.\u003C/p\u003E\u003Cp\u003EHowever, if Kerbtown is truly dead in the water, there will never be the level of positioning precision necessary to make this system work. We may have a case of counting your kerbals before they crash.\u003C/p\u003E\u003Cp\u003EThough if I manage to get a plugin for animation-based train movement, or manage to pull together one for procedurally linking track segments, it should be ok with kerbtown\u0027s current state.\u003C/p\u003E\u003Cp\u003EI probably won\u0027t get on with it for a while yet, maybe not until the new year. (\u003Cspan style=\u0022font-size:8px;\u0022\u003EThough I reserve the right not to stick to these plans, and pop up with stuff anytime.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, if someone wants to muck around with what I made before, it\u0027s here: \u003Ca href=\u0022https://www.dropbox.com/s/igrzfcfip9wpi1j/TWRail.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/igrzfcfip9wpi1j/TWRail.zip\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-23T05:51:50Z\u0022 title=\u002211/23/2013 05:51  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 23, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2014-01-02T15:40:07Z","Content":"\n\u003Cp\u003EWhat about bf2142 type monorails? They are shaped like a trapezoid turned upside down, with no underlying pad.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://screenshot.xfire.com/s/82590321-3.jpg\u0022 alt=\u002282590321-3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIMO would be fairlt easy to keep on such shape. And side pads for walking just make it more difficult to design vehicles.\u003C/p\u003E\u003Cp\u003EBtw, I can\u0027t find KerbTOwn version that works on .23, anyone?\u003C/p\u003E\n"},{"CreatedByName":"lacedemonian","CreatedById":79686,"CreatedDateTime":"2014-02-12T00:31:40Z","Content":"\n\u003Cp\u003EPut a KAS winch on rails, and you can make a cargo loading crane.\u003C/p\u003E\n"},{"CreatedByName":"Navy4422","CreatedById":27157,"CreatedDateTime":"2014-02-12T02:15:04Z","Content":"\n\u003Cp\u003EPlease don\u0027t necro post \u003C/p\u003E\u003Cp\u003EThread closed\u003C/p\u003E\n"}]}