{"TopicId":42722,"ForumId":55,"TopicTitle":"An Idea on how to create a working multiplayer","CreatedByName":"avpx","CreatedById":22158,"CreatedDateTime":"2013-08-16T10:51:07Z","PageNum":1,"Articles":[{"CreatedByName":"avpx","CreatedById":22158,"CreatedDateTime":"2013-08-16T10:51:07Z","Content":"\n\u003Cp\u003EI was looking at the passive mp mod and it striked me.\u003C/p\u003E\u003Cp\u003EThis is some type of an \u0022overlay\u0022 mod that shows you the ships and objects of the other players right?\u003C/p\u003E\u003Cp\u003EBut then there are projects like the community space station and alike that share the savegame, right?\u003C/p\u003E\u003Cp\u003EWhat if you could create a hybrid version of some sort?\u003C/p\u003E\u003Cp\u003EYou will be able to see other player\u0027s ships and stations and bases as an overlay on the map, screenshots etc.\u003C/p\u003E\u003Cp\u003EYou will have the ability to choose an object and click \u0022share with player\u0022 on it, making it spawn in his game or \u0022take control\u0022 and it will appear on your game.\u003C/p\u003E\u003Cp\u003ENormally, taking control of the vessel will check if your crafts are compatible, mods and all other relevent stuff: If it is, it will appear in your game too.\u003C/p\u003E\u003Cp\u003EIf the player and you are in some sort of \u0022privet group\u0022 you will be able to transfer crafts and not just copy. Which means when you click share, it will be deleted from your game and moved to the player\u0027s game and visa versa. \u003C/p\u003E\u003Cp\u003EThis will allow players actually taking missions togather.\u003C/p\u003E\u003Cp\u003EThis is just the basic idea.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-16T10:54:36Z","Content":"\n\u003Cp\u003EI believe something similar has been suggested before, but multiplayer is on the What Not to Suggest list, and will not be implemented initially into the game, if at all.\u003C/p\u003E\u003Cp\u003EA link here, for your convenience \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003EWhat-not-to-suggest\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-08-16T10:56:59Z","Content":"\n\u003Cp\u003Eallmappedout has said the magic words: multiplayer is on the what-not-to-suggest list. Thread closed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}