{"TopicId":42725,"ForumId":55,"TopicTitle":"Nuclear pulse rockets","CreatedByName":"Pugspaceprogram","CreatedById":57139,"CreatedDateTime":"2013-08-16T11:12:01Z","PageNum":1,"Articles":[{"CreatedByName":"Pugspaceprogram","CreatedById":57139,"CreatedDateTime":"2013-08-16T11:12:01Z","Content":"\n\u003Cp\u003EWhat is the most kerbal way of travelling around the kerbolar system? When I was asked this, all I could think of was \u0027Orion\u0027. Nuclear pulse rockets.\u003C/p\u003E\u003Cp\u003EThey fire nuclear bombs behind the craft propelling it into the air. Strangely enough, this is a craft that is within our grasp of technology, and it should obviously be within the kerbals grasp too!\u003C/p\u003E\u003Cp\u003EI understand that there is a mod that added this part, and Scott Manley also did a video on it (link below). I want to hear your thoughts on this kerbal propulsion idea.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E PugSpaceProgram\u003C/p\u003E\n"},{"CreatedByName":"Pugspaceprogram","CreatedById":57139,"CreatedDateTime":"2013-08-16T11:14:00Z","Content":"\n\u003Cp\u003EScott Manleys video\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/vwrLR2kv5KA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Outlander4","CreatedById":20008,"CreatedDateTime":"2013-08-16T11:16:51Z","Content":"\n\u003Cp\u003EWhat\u0027s the suggestion, exactly? If you want to suggest nuclear pulse drive as a stock part, it was done countless times already, and it was surely noticed by developers. Also, devs themselves are space exploration enthusiasts just like ourselves so they probably knew about it and considered it from the very beginning.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-16T11:17:08Z","Content":"\n\u003Cp\u003EThis technology would only be used if we had an extinction event on the horizon. It\u0027s currently banned by many nuclear treaties, and the difficulties surrounding the initial launch make it unwise to use it from any typical take-off area.\u003C/p\u003E\u003Cp\u003EIt is unique in that it provides both High Thrust and High Isp, and is certainly a better use of our nuclear arsenal than the other options, but it will not be utilised in our lifetimes, except as an emergency \u0027evacuation\u0027 ship which would be built should a super asteroid be heading our way.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-08-16T13:18:16Z","Content":"\n\u003Cp\u003EIn real life we\u0027re unlikely to ever see an ORION constructed; the fallout, both radioactive and political, is just so dangerous to bystanders that anyone not on the project would HAVE to oppose it.\u003C/p\u003E\u003Cp\u003EIn KS we\u0027re unlikely to see ORION become a stock part because it makes all other engines moot. It breaks the \u0022high thrust or high efficiency; choose one\u0022 balance system and would rapidly become the only drive players would ever need to use. It\u0027s a great mod and terrifically fun, but I think I\u0027d actually oppose its inclusion as a stock part because it breaks the game.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-16T13:40:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anton P. Nym\u0022 data-cite=\u0022Anton P. Nym\u0022\u003E\u003Cdiv\u003EIn real life we\u0027re unlikely to ever see an ORION constructed; the fallout, both radioactive and political, is just so dangerous to bystanders that anyone not on the project would HAVE to oppose it.\u003Cp\u003EIn KS we\u0027re unlikely to see ORION become a stock part because it makes all other engines moot. It breaks the \u0022high thrust or high efficiency; choose one\u0022 balance system and would rapidly become the only drive players would ever need to use. It\u0027s a great mod and terrifically fun, but I think I\u0027d actually oppose its inclusion as a stock part because it breaks the game.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t write it off that soon. If you make it difficult to research and be quite expensive compared to other engines, it could be a nice end-game option for space programs that have managed to become loaded with cash.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-16T14:02:19Z","Content":"\n\u003Cp\u003EIf Russia and the U.S. agreed to work together to develop one of these, committed to only constructing it far from Earth (say for example a construction yard orbiting the moon) and promised to allow people of all nations to share in the technology, I don\u0027t see how some treaty is gonna stop it from happening. Treaties define current operating agreements between nations but they do not close off possible avenues in the future.\u003C/p\u003E\u003Cp\u003EADDIT: not to mention the fact that the treaty is rather silly in that it reverses the boundary! If there is one place that nuclear weapons should NOT be allowed (and where all nations should agree they shouldn\u0027t be allowed) it is EARTH! The only known place in the Universe with humans and where humans can sustainably live!\u003C/p\u003E\u003Cp\u003EOn the other hand, if there is one place where the use of nuclear weapons is not such a big deal it is SPACE! A vast, virtually infinite vacuum where a nuclear explosion would (as far as I understand) be essentially irrelevant because all it would do is irradiate the tiny dilution of particles in the interplanetary medium, leaving behind a faint trail of radioactive particles that would likely become so dispersed as to be undetectable (I\u0027m speculating). Not to mention the fact that: who cares if there is a little bit more radioactivity added to outer space!?!\u003C/p\u003E\u003Cp\u003EObviously launching one from Earth or even initiating its main engines anywhere near Earth is unlikely to ever happen for the reasons outlined. This means that, it is unlikely to happen in our lifetimes as obviously right now we do not even have the capacity to put more than a half dozen or so humans into orbit at the same time, much less operate an in-space shipyard.\u003C/p\u003E\u003Cp\u003EBut in 50 or 150 years? Maybe. Given it is one of the most obvious and least speculative options for high speed it seems to me it will be seriously considered if not actually explored when the time comes.\u003C/p\u003E\u003Cp\u003EAs to KSP: agree it could be game balance breaking but there could be ways around that. Main thing though is Kerbol system just seems too small for the thing to be really much \u0027use\u0027 or fun. As Manley\u0027s video shows, it makes getting to the most distant bodies all too easy, which is not good for challenge or fun game play.\u003C/p\u003E\u003Cp\u003EHowever, once KSP includes some neighboring systems, I could see a long-term \u0027campaign\u0027 to develop this (as one out of a small number of alternative starship propulsion systems) as a very interesting prospect.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-16T14:08:03Z\u0022 title=\u002208/16/2013 02:08  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 16, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"}]}