{"TopicId":42817,"ForumId":55,"TopicTitle":"Am I the only one who dislikes the auto-switching to Target mode on the navball?","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-17T04:05:30Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-17T04:05:30Z","Content":"\n\u003Cp\u003EI\u0027ve been screwed up by the auto-switch to target mode on the navball enough times that I\u0027m really starting to hate that feature. (i.e. I try to de-orbit, I waste fuel and can\u0027t figure out what\u0027s wrong, and then notice the game has changed the navball to target mode without me noticing, so the retrograde marker isn\u0027t my *REAL* retrograde marker.)\u003C/p\u003E\u003Cp\u003EFirst off, it confused me back when I was a newbie first learning to dock because people would tell you to \u0022burn retrograde until your velocity stops\u0022 without mentioning that this isn\u0027t the same retrograde as before, and the navball markers have changed their meaning automatically without me doing anything. It confused me because it made no sense how burning retrograde would do that, when I thought it was orbital retrograde and not target retrograde.\u003C/p\u003E\u003Cp\u003EI strongly feel that the change of modes should happen only with the manual click by the player on the navball, and NOT happen automatically without player input. When the meaning of a thing changes without any player input telling it to change it causes confusion. I\u0027ve also had the game swap modes on me when I wasn\u0027t actually trying to dock yet but I just happened to have gotten near enough to my selected target ship that it changed modes \u0022for me\u0022 without warning.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-08-17T04:14:03Z","Content":"\n\u003Cp\u003EKinda on-topic: The auto-camera switch when entering orbit. God I HATE IT!\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-17T04:43:23Z","Content":"\n\u003Cp\u003EI agree it can be jarring. Worse is when you are trying to fine tune an approach to say the Mun and you get the SOI camera swap - which can be worse if everything decides it wants to take a frames per second holiday for a moment :S - I think, and this just me, if you had 2 distinct Prograde and Retrograde markers that differed in color, one color showing your Prograde and Retro with regards to the actual orbit you are on and one that is a diff color that showed Pro/Retro with regards to your target, that may help - or may make it even more confusing - just an idea lol.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-17T09:01:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003EKinda on-topic: The auto-camera switch when entering orbit. God I HATE IT!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMeh. It\u0027s slightly annoying but it doesn\u0027t cause an entire scrapped mission like burning the wrong direction because the game secretly changed the navball mode without you noticing.\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2013-08-17T09:23:21Z","Content":"\n\u003Cp\u003EOr you could just learn the system. No offence intended, it\u0027s just that if it\u0027s changed 90% of the community who are already familiar with the current system will suddenly find themselves burning the wrong retrograde because they\u0027re used to it auto changing. It didn\u0027t auto change for me once and I ended up posting a help topic about it and thought that the fact that I was burning retrograde and my orbit was increasing was a bug until the navball mode was pointed out to me.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-08-17T10:15:15Z","Content":"\n\u003Cp\u003EIt would be nice, if auto-cam-mode told you which mode it is switching to, when it does switch. You know, standard message saying, for example: Ã‚Â´Switching to orbital camera-modeÃ‚Â´. Likewise for the navball: Ã‚Â´Switching to nav-ball target-modeÃ‚Â´, or something like that.\u003C/p\u003E\u003Cp\u003EEDIT: Thinking about it, i guess, there wont be these messages, but, in the final game, rather audio-snippets telling you this (or at least that something has switched, if your kerbalish is not that good yet).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-17T10:17:22Z\u0022 title=\u002208/17/2013 10:17  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 17, 2013\u003C/time\u003E by Mr. Scruffy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Teodzero","CreatedById":76759,"CreatedDateTime":"2013-08-17T11:53:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Person012345\u0022 data-cite=\u0022Person012345\u0022\u003E\u003Cdiv\u003EOr you could just learn the system. No offence intended, it\u0027s just that if it\u0027s changed 90% of the community who are already familiar with the current system will suddenly find themselves burning the wrong retrograde because they\u0027re used to it auto changing. It didn\u0027t auto change for me once and I ended up posting a help topic about it and thought that the fact that I was burning retrograde and my orbit was increasing was a bug until the navball mode was pointed out to me.\u003C/div\u003E\u003C/blockquote\u003EYou are okay with it, but that doesn\u0027t mean everyone should be.\u003Cp\u003EIt may switch by default, but there definitely should be an option to disable it. Everything the game does without your permission should have those options.\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2013-08-17T13:01:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Teodzero\u0022 data-cite=\u0022Teodzero\u0022\u003E\u003Cdiv\u003EYou are okay with it, but that doesn\u0027t mean everyone should be.\u003Cp\u003EIt may switch by default, but there definitely should be an option to disable it. Everything the game does without your permission should have those options.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would not care if there was an option. Just don\u0027t make it default.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-08-17T14:20:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003EKinda on-topic: The auto-camera switch when entering orbit. God I HATE IT!\u003C/div\u003E\u003C/blockquote\u003E Even worse is when the camera switches when your landing. Actually the camera switching by itself anywhere is annoying.\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-17T14:33:04Z","Content":"\n\u003Cp\u003EIt\u0027s far worse when you undock a control node, and the resulting craft ends up oriented hell knows where, without much indication. My eyes are usually glued enough to the navball during docking approach that I always spot the switch - especially considering that the current velocity changes drastically.\u003C/p\u003E\u003Cp\u003EI\u0027ve had more missions failed due to odd choices for the current control point than due to navball mode switching to \u0022target\u0022 or back. I don\u0027t even remember how many of the former I had, but any number is greater than zero. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tobjv","CreatedById":50269,"CreatedDateTime":"2013-08-17T14:35:42Z","Content":"\n\u003Cp\u003EWell at least you can press the navballs target/orbit/surface marker to switch it to one of those 3. I\u0027d rather have a notification of it about to happen then to remove it.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-08-17T15:23:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI\u0027ve been screwed up by the auto-switch to target mode on the navball enough times that I\u0027m really starting to hate that feature. (i.e. I try to de-orbit, I waste fuel and can\u0027t figure out what\u0027s wrong, and then notice the game has changed the navball to target mode without me noticing, so the retrograde marker isn\u0027t my *REAL* retrograde marker.)\u003Cp\u003EFirst off, it confused me back when I was a newbie first learning to dock because people would tell you to \u0022burn retrograde until your velocity stops\u0022 without mentioning that this isn\u0027t the same retrograde as before, and the navball markers have changed their meaning automatically without me doing anything. It confused me because it made no sense how burning retrograde would do that, when I thought it was orbital retrograde and not target retrograde.\u003C/p\u003E\u003Cp\u003EI strongly feel that the change of modes should happen only with the manual click by the player on the navball, and NOT happen automatically without player input. When the meaning of a thing changes without any player input telling it to change it causes confusion. I\u0027ve also had the game swap modes on me when I wasn\u0027t actually trying to dock yet but I just happened to have gotten near enough to my selected target ship that it changed modes \u0022for me\u0022 without warning.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eso you are trying to deorbit but you have a target locked...of course it must be the game\u0027s fault\u003C/p\u003E\u003Cp\u003E\u0022game swap modes\u0022 what do you mean.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-17T20:22:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Person012345\u0022 data-cite=\u0022Person012345\u0022\u003E\u003Cdiv\u003EOr you could just learn the system. No offence intended, it\u0027s just that if it\u0027s changed 90% of the community who are already familiar with the current system will suddenly find themselves burning the wrong retrograde because they\u0027re used to it auto changing. It didn\u0027t auto change for me once and I ended up posting a help topic about it and thought that the fact that I was burning retrograde and my orbit was increasing was a bug until the navball mode was pointed out to me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe point is that it\u0027s a manually controlled thing - you change it by clicking on the title of the navball. And when the computer jumps in and wrests that control from you and takes over and overrides what you\u0027ve done, it\u0027s the computer\u0027s fault that your flight screwed up, not yours.\u003C/p\u003E\u003Cp\u003EWhere\u0027s the button for me to click on to say \u0022stop changing what I set this too dammit! I said orbital mode and I meant it!\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-08-17T20:24:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022leax256\u0022 data-cite=\u0022leax256\u0022\u003E\u003Cdiv\u003Eso you are trying to deorbit but you have a target locked...of course it must be the game\u0027s fault\u003Cp\u003E\u0022game swap modes\u0022 what do you mean.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven if I have set the mode to \u0022orbital\u0022 the game will OVERRIDE that without warning and change it back to target mode. Would you think it\u0027s acceptable for the game to suddenly throttle up when you didn\u0027t tell it to? To suddenly engage SAS when you didn\u0027t tell it to? Why is it acceptable for it to change navball modes when you didn\u0027t tell it to?\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2013-08-17T20:32:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Person012345\u0022 data-cite=\u0022Person012345\u0022\u003E\u003Cdiv\u003EOr you could just learn the system. No offence intended, it\u0027s just that if it\u0027s changed 90% of the community who are already familiar with the current system will suddenly find themselves burning the wrong retrograde because they\u0027re used to it auto changing. It didn\u0027t auto change for me once and I ended up posting a help topic about it and thought that the fact that I was burning retrograde and my orbit was increasing was a bug until the navball mode was pointed out to me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Better signposting\u0022 would be a more polite answer than \u0022learn to read\u0022. Ball, throw, so others can catch. Else no one will wish to play a game with you. Or in this instance, converse on a board where we can post our experiences, strengths and troubles we find in the game.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-08-17T20:34:58Z","Content":"\n\u003Cp\u003EJust want to mention the auto changing camera here, makes me ill when it switches to and from orbital mode.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-17T20:48:46Z","Content":"\n\u003Cp\u003EI actually like now the navball switches between like orbital, target and surface modes. I seem to always be in the map view when it happens so I haven\u0027t noticed it doing weird things with the camera.\u003C/p\u003E\u003Cp\u003EEither way, I can definitely agree that this system could be better handled and perhaps they\u0027ll rework it someday. I kinda doubt it\u0027d be anything they bother with soon, though. On the plus side, they\u0027re always looking at ways to improve the user experience, so if enough people want to see a change with this stuff, they\u0027ll undoubtedly work on it at some point \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-18T03:31:01Z","Content":"\n\u003Cp\u003Ei do agree that it should be an option to disable the auto swap or to have options to fine tune the auto swapping. barring that, some sort of audio cue that the change has happened.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-08-18T17:46:21Z","Content":"\n\u003Cp\u003EThe \u0022funniest\u0022 thing of this is that your controls are swapped when the camera changes, which screws whatever maneuver you\u0027re trying to do. It\u0027s not even possible to pilot only using the navball.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-18T21:30:08Z","Content":"\n\u003Cp\u003EControls are always relative to the navball, so it\u0027s perfectly feasible. I never saw controls change due to camera mode switching. Worst case, you\u0027re switching camera \u003Cstrong\u003Eand\u003C/strong\u003E navball modes at the same time, but you can still tell which mode you\u0027re in when looking at the navball.\u003C/p\u003E\u003Cp\u003EIt\u0027s a lot worse when your control point changes after docking maneuvers. A \u003Cstrong\u003Elot\u003C/strong\u003E worse. It\u0027s something you can never spot on the navball itself until you correlate with what you\u0027re seeing your rocket do.\u003C/p\u003E\u003Cp\u003EAlso no, I wouldn\u0027t turn off automatic navball mode switching if such an option were presented. As-is, I am more annoyed by when it \u003Cem\u003Efails\u003C/em\u003E to automatically switch. Target mode only appears when you have a target selected, and clearing it is as easy as double-clicking on empty space in the viewport. Surface mode automatically switches to orbit mode when you\u0027re high enough for orbit to be possible, and switches back when you\u0027re more likely to be interested in surface-relative velocity.\u003C/p\u003E\u003Cp\u003EIf you would rather have to manually switch modes every time you begin and end a target approach, why do you not manually check that you\u0027re in the right mode when you do the same now?\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-08-18T21:36:03Z","Content":"\n\u003Cp\u003EIn my case, the controls change in relation to which angle you\u0027re looking at the ship.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-18T21:53:05Z","Content":"\n\u003Cp\u003EIf you mean relative to the camera, then of course they do. Look at the ship from the side, and what was pitch will look like roll. All that changes between Free and Orbital camera modes is that Free is oriented to the surface plane, while Orbital is oriented to the orbital plane.\u003C/p\u003E\u003Cp\u003EAnd by the way, you can always prevent that by manually changing to Free mode. By default, the camera is on Auto.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-08-18T22:05:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EIf you mean relative to the camera, then of course they do. Look at the ship from the side, and what was pitch will look like roll. All that changes between Free and Orbital camera modes is that Free is oriented to the surface plane, while Orbital is oriented to the orbital plane.\u003Cp\u003EAnd by the way, you can always prevent that by manually changing to Free mode. By default, the camera is on Auto.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd that makes it harder to pilot using the navball. The navball shows the target on the same place, regardless of where you\u0027re looking the target from. The navball doesn\u0027t change, so why the controllers have to?\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-18T22:16:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EAnd that makes it harder to pilot using the navball. The navball shows the target on the same place, regardless of where you\u0027re looking the target from. The navball doesn\u0027t change, so why the controllers have to?\u003C/div\u003E\u003C/blockquote\u003EThey don\u0027t. Like I said, I never noticed the behavior you\u0027re describing. All controls are relative to the navball. Even if you change SOI, the navball will change to reflect the new frame of reference, but the center mark will still point forward, and all controls will function the same. Even if you change the control point to a docking port perpendicular to your actual heading, the controls will work relative to the navball.\u003Cp\u003ECan you provide an example? Because I\u0027m honestly not seeing it. I\u0027ve flown many different ships into orbit, using nothing but the map screen and the navball after the last booster stage is detached. Closest thing to a \u0022change\u0022 is how your prograde marker jumps sideways to reflect your actual orbital velocity, when the navball switches to orbital mode.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-18T22:20:04Z\u0022 title=\u002208/18/2013 10:20  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 18, 2013\u003C/time\u003E by Sean Mirrsen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-08-18T22:28:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EThey don\u0027t. Like I said, I never noticed the behavior you\u0027re describing. All controls are relative to the navball. Even if you change SOI, the navball will change to reflect the new frame of reference, but the center mark will still point forward, and all controls will function the same. Even if you change the control point to a docking port perpendicular to your actual heading, the controls will work relative to the navball.\u003Cp\u003ECan you provide an example? Because I\u0027m honestly not seeing it. I\u0027ve flown many different ships into orbit, using nothing but the map screen and the navball after the last booster stage is detached. Closest thing to a \u0022change\u0022 is how your prograde marker jumps sideways to reflect your actual orbital velocity, when the navball switches to orbital mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA video will be uploaded shortly.\u003C/p\u003E\n"}]}