{"TopicId":42818,"ForumId":16,"TopicTitle":"Docking port...Dangerous to dock.","CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-08-17T04:23:54Z","PageNum":1,"Articles":[{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-08-17T04:23:54Z","Content":"\n\u003Cp\u003EVersion 21.1.\u003C/p\u003E\u003Cp\u003EThe docking somehow causing non-stop irregular vibration among the crafts and my cause serious explosion or something very bad.\u003C/p\u003E\u003Cp\u003EThis happened to me so many times and from various docking port (Jr. to normal to Sr. size).\u003C/p\u003E\u003Cp\u003EI will have to quick save and load many times before a success docking.\u003C/p\u003E\u003Cp\u003EIt is repeatable by just connecting the docking as U shape. or many to many docking (such as 2 to 2 docking at the same time)\u003C/p\u003E\u003Cp\u003EEven 1 to 1 Sr. docking port with only Jumbo Fuel tank from each other might cause the non-stop vibration.\u003C/p\u003E\u003Cp\u003ESo, is this a bug? I have try to deactivate the ASAS from both side, but they produce the same result.\u003C/p\u003E\u003Cp\u003ESorry. Please redirect me, if I\u0027m posting to wrong channel.\u003C/p\u003E\u003Cp\u003EAny solution for this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-17T07:35:11Z\u0022 title=\u002208/17/2013 07:35  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 17, 2013\u003C/time\u003E by Sirine\u003C/strong\u003E\n\u003Cbr\u003ESolution found.\n\u003C/span\u003E\n"},{"CreatedByName":"Tripzter","CreatedById":75335,"CreatedDateTime":"2013-08-17T10:43:46Z","Content":"\n\u003Cp\u003EWhat is your solution that you\u0027ve found?\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-08-17T11:23:12Z","Content":"\n\u003Cp\u003EOh man, it\u0027s so tantalizing when they don\u0027t post the solution.\u003C/p\u003E\n"},{"CreatedByName":"Amoun","CreatedById":74485,"CreatedDateTime":"2013-08-17T13:45:12Z","Content":"\n\u003Cp\u003ECould the torque have been on? O___o\u003C/p\u003E\u003Cp\u003EFirst thing that came to mind.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-08-19T01:53:43Z","Content":"\n\u003Cp\u003EPut (EAS-4 strut connector) x4 at the docking port to your main mass body.\u003C/p\u003E\u003Cp\u003EReduce the docking to 0.05m/s....super slow. It shows 0m/s but still moving, and \u0022straight forward\u0022 only. \u003C/p\u003E\u003Cp\u003EAlways quick save, and pray and hope for the best. (Sorry, but that is my solution.)\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T07:14:50Z","Content":"\n\u003Cp\u003EI think I\u0027ve seen something similar to this a couple of times. Successful dock is immediately followed by a resonating wobble which amplifies until pretty explosions are seen high in the night sky.\u003C/p\u003E\u003Cp\u003EHunch would be something to do with high part counts, something like the physics calculations not being able to parse through every part in the window provided by a single update resulting in an accumulation effect.\u003C/p\u003E\u003Cp\u003EPartial solution I found was to - immediately upon dock completing - exit to the space centre, from there head back into the tracking station and fly your newly docked contraption once more from there. Quitting direct control of the ship I guess nullifies all physics calculations allowing you to a return to a completely reset and stable ship.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2013-08-19T15:11:35Z","Content":"\n\u003Cp\u003EAny chance SAS is involved here?\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-08-19T19:18:47Z","Content":"\n\u003Cp\u003EThe problem is the massive magical magnetism associated with docking so players don\u0027t have to be so precise. No matter how slowly you approach, you will impact with some minimum violence due to this \u0022helper\u0022 system. Things get really destructive if the resulting wobble clips some parts together which will react with the force of a thousand suns.\u003C/p\u003E\u003Cp\u003EI suggest sas off rcs off and time accel just after to freeze physics.\u003C/p\u003E\n"},{"CreatedByName":"Tripzter","CreatedById":75335,"CreatedDateTime":"2013-08-19T22:49:38Z","Content":"\n\u003Cp\u003EYeah time warp makes it worse when you have bigger stations. You gotta turn off SAS and let stuff calm down a tiny bit before you can time warp.\u003C/p\u003E\n"}]}