{"TopicId":42959,"ForumId":55,"TopicTitle":"Screenshot Subdirectories By Craft Name","CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-18T07:13:38Z","PageNum":1,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-18T07:13:38Z","Content":"\n\u003Cp\u003EI don\u0027t know about the rest of you, but my screenshots directory is a jumbled mess. I can be running a dozen or more missions at the same time and while I\u0027m playing, I just take screenshots when I feel like it and figure I\u0027ll go back and organize them later. When later comes, I look at 3 dozen pictures and suddenly lose all desire to organize.\u003C/p\u003E\u003Cp\u003EWhat if, instead, whenever you take a screenshot, the picture gets put into a subfolder named after the craft? That way, you\u0027d have, off of your ksp/screenshots folder, a folder named \u0022Kerpollo 11\u0022 and another named \u0022Minmus Station Alpha\u0022 and another named \u0022ThisWillNeverWork\u0022 or whatever. As you jump between those ships in game and take screenshots, they\u0027ll just go into those folders, creating new ones as you take screens for new ships.\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2013-08-18T07:29:16Z","Content":"\n\u003Cp\u003EI\u0027d prefer that screenshots get saved under the individual save directories or at least organize the screenshots under the current directory by save game.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-18T09:10:48Z","Content":"\n\u003Cp\u003EGood point. ksp/screenshots/\u0026lt;save name\u0026gt;/\u0026lt;craft name\u0026gt;/screenshot1.png\u003C/p\u003E\n"},{"CreatedByName":"Bessy","CreatedById":30538,"CreatedDateTime":"2013-08-18T09:34:47Z","Content":"\n\u003Cp\u003Ena I think no screenshots at all maybe must have camera on ship probe etc and they can take much higher res shots and must be downloaded to mission control from the memory in the probe or anywhere like to a sat in orbit to be transferred later\u003C/p\u003E\u003Cp\u003E when downloaded to mission control they should then be saved to a mission to be viewed in game and zoomable etc there could be missions tied to it like take a picture of jools cloud tops from within its atmosphere a probe drops thru u take a pic and transfer it to the probe in orbits memory bank other data too like atmosphere comp density etc etc for hdd space keeping later u can delete the file but the game keeps a thumbnail of it as proof of it \u003C/p\u003E\u003Cp\u003Emust be downloaded to mission control before u can view it tho gives u a bit of work but I\u0027d like to call it fun \u003C/p\u003E\u003Cp\u003Emaybe they can be tagged Eg jool cloud etc and then when searching the encyclopedia for jool it gives u all known info on jool and ur pictures \u003C/p\u003E\u003Cp\u003Edon\u0027t want any light speed delays tho just a dish line of sight will make me happy and will add some fun tp getting pictures and ur data back\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-18T13:25:27Z\u0022 title=\u002208/18/2013 01:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 18, 2013\u003C/time\u003E by Bessy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}