{"TopicId":43,"ForumId":16,"TopicTitle":"Exploding!","CreatedByName":"Baro","CreatedById":58,"CreatedDateTime":"2011-07-07T15:31:55Z","PageNum":1,"Articles":[{"CreatedByName":"Baro","CreatedById":58,"CreatedDateTime":"2011-07-07T15:31:55Z","Content":"\n\u003Cp\u003ESo I haven\u0027t had much time to play around with this yet but I made a simple rocket after going through the tutorial. It was just a solid booster, the 3-way separator, and then 3 boosters. The problem is that on launch the 3 solid boosters just decided to explode as all 4 engines seemed to go off at once. The 3 solid boosters seemed to be on a different stage than the booster under the capsule so I\u0027m not sure what went wrong.\u003C/p\u003E\u003Cp\u003EThis is an awesome little freeware game. I\u0027d love to see it continue to develop, maybe even into a commercial game. I\u0027d gladly pay for such a game with more features, maybe a moon to get to. Or a spacestation you could build part by part, launch by launch. Perhaps some \u0027career mode\u0027 where your government sets you a budget and increases/decreases it based on reaching targets.\u003C/p\u003E\n"},{"CreatedByName":"cd7890","CreatedById":13,"CreatedDateTime":"2011-07-07T16:53:09Z","Content":"\n\u003Cp\u003Ei dont think you are supposed to stack the solid boosters on top of eachother without decouplers placed in between\u003C/p\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2011-07-07T17:34:44Z","Content":"\n\u003Cp\u003EThe Tri-coupler isn\u0027t a separator. That\u0027s what went wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe tricoupler is merely an adaptor. And the game analyses the ship you\u0027ve built, and based on the decouplers it finds, it builds a staging sequence (which can also be edited manually if you happen to disagree with it).\u003C/p\u003E\u003Cp\u003ESo by not adding a decoupler in between the top boosters and the lower ones, they all fired at once, destroying the whole stack \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAbout the future of the project, you\u0027ve pretty much hit the nail on the head there. That\u0027s exactly what will happen to the game in the near future, even the features you mentioned. :thumbup:\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Drone","CreatedById":56,"CreatedDateTime":"2011-07-07T19:14:56Z","Content":"\n\u003Cp\u003EYeah I made this mistake before. Essentially after every rocket exhaust you need a coupler unless it\u0027s the last rocket of the stack.\u003C/p\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2011-07-07T19:50:08Z","Content":"\n\u003Cp\u003EI\u0027ve added a reminder about this in the tricoupler\u0027s description \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEasy mistake to make\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Baro","CreatedById":58,"CreatedDateTime":"2011-07-07T21:30:19Z","Content":"\n\u003Cp\u003EAh ha, I thought it was a decoupler too!\u003C/p\u003E\u003Cp\u003EI\u0027m so pumped to read that most of my suggestions on content to add down the road (space stations, missions, budgets, career mode) are all planned. This is going to be awesome.\u003C/p\u003E\u003Cp\u003EIt would be cool though to have a button one could hold down when placing items that would place a duplicate item symetrical to the one placed. Maybe eye-balling is supposed to be part of the challenge though? Would love to be able to actually exactly line up all my fins and struts and such though...\u003C/p\u003E\n"},{"CreatedByName":"aLeXmOrA","CreatedById":3,"CreatedDateTime":"2011-07-07T21:36:25Z","Content":"\n\u003Cp\u003EHi, there!\u003C/p\u003E\u003Cp\u003EYes, the Symmetrical Construction is a feature that is planned too... so, wait for it very soon! \u003C/p\u003E\u003Cp\u003ERight now we are releasing the version 0.8, it is available for download with bug fixes and other features\u003C/p\u003E\u003Cp\u003E=)\u003C/p\u003E\n"},{"CreatedByName":"flying_chair","CreatedById":10362,"CreatedDateTime":"2012-03-11T19:07:26Z","Content":"\n\u003Cp\u003EI thought that a Tri-coupler was a De-coupler too.\u003C/p\u003E\n"},{"CreatedByName":"Polecat Industries","CreatedById":11224,"CreatedDateTime":"2012-03-11T19:09:21Z","Content":"\n\u003Cp\u003EI thought this was new, and was surprised Alex didn\\\u0027t know about symmetry. Then I saw the post date.\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Grove","CreatedById":5188,"CreatedDateTime":"2012-03-11T19:17:29Z","Content":"\n\u003Cp\u003ELolnewb, stop necro-bumping stuff.\u003C/p\u003E\n"}]}