{"TopicId":43145,"ForumId":20,"TopicTitle":"If I attempt to resurrect a dead mod- am I allowed?","CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-08-19T20:01:31Z","PageNum":1,"Articles":[{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-08-19T20:01:31Z","Content":"\n\u003Cp\u003EThe title. I used to LOVE the truss pack, but it seems the guy has abandoned it. If I say, simply downloaded it and worked at converting it for 0.21, would I be allowed? I don\u0027t even know if I CAN do this (I know textures changed somehow) but I\u0027d like to give it a shot...\u003C/p\u003E\n"},{"CreatedByName":"brians200","CreatedById":26572,"CreatedDateTime":"2013-08-19T20:03:37Z","Content":"\n\u003Cp\u003EYou will have to look at the license he has with the pack.\u003C/p\u003E\u003Cp\u003EIf it doesn\u0027t allow for it, there is nothing stopping you from creating the same exact thing from scratch\u003C/p\u003E\u003Cp\u003EEDIT: if it is this pack \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25281-NFJ-Inc-presents-The-NFJ-Truss-Pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25281-NFJ-Inc-presents-The-NFJ-Truss-Pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI do not see a license involved, and that means you cannot use his work.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-19T20:06:31Z\u0022 title=\u002208/19/2013 08:06  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 19, 2013\u003C/time\u003E by brians200\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-08-19T20:15:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brians200\u0022 data-cite=\u0022brians200\u0022\u003E\u003Cdiv\u003EYou will have to look at the license he has with the pack.\u003Cp\u003EIf it doesn\u0027t allow for it, there is nothing stopping you from creating the same exact thing from scratch\u003C/p\u003E\u003Cp\u003EEDIT: if it is this pack \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25281-NFJ-Inc-presents-The-NFJ-Truss-Pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25281-NFJ-Inc-presents-The-NFJ-Truss-Pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI do not see a license involved, and that means you cannot use his work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I can\u0027t create it from scratch due to time/skill; I have no idea how to use the modeling stuff.\u003C/p\u003E\u003Cp\u003EAnd I meant this one\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/8402-0-16-ish-The-Truss-Pack-Rugged-parts-for-any-eventuality!-*2-0-NEARING-RELEASE!*\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/8402-0-16-ish-The-Truss-Pack-Rugged-parts-for-any-eventuality!-*2-0-NEARING-RELEASE!*\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ebut I don\u0027t see a license anywhere. you\u0027d think that wouldn\u0027t apply to abandonware, somehow...\u003C/p\u003E\n"},{"CreatedByName":"trbinsc","CreatedById":10144,"CreatedDateTime":"2013-08-19T20:22:11Z","Content":"\n\u003Cp\u003EAs long as you only use it for personal use and don\u0027t share it, I think you can modify it without permission, but I\u0027m not sure. If you intend on sharing it, you should probably find a way to contact Sherbetlemons to ask for permission. The last time he was on was August 6th, so it seems that he drops by every once in a while.\u003C/p\u003E\n"},{"CreatedByName":"brians200","CreatedById":26572,"CreatedDateTime":"2013-08-19T22:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003EWell, I can\u0027t create it from scratch due to time/skill; I have no idea how to use the modeling stuff.\u003Cp\u003EAnd I meant this one\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/8402-0-16-ish-The-Truss-Pack-Rugged-parts-for-any-eventuality!-*2-0-NEARING-RELEASE!*\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/8402-0-16-ish-The-Truss-Pack-Rugged-parts-for-any-eventuality!-*2-0-NEARING-RELEASE!*\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ebut I don\u0027t see a license anywhere. you\u0027d think that wouldn\u0027t apply to abandonware, somehow...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was a post about what to do with the increasing amount of abandonware before the great forum derp. They were starting an initiative to contact the original authors and try to get permission. The mods made it clear that if there is no license or the author says no, you cannot use their work.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-19T22:32:13Z","Content":"\n\u003Cp\u003EYes, without specific permission, every created, copyable work is considered copyrighted. It\u0027s the way the law works. If you just use it yourself you\u0027re not violating that copyright (and nobody can catch you anyway as you\u0027re not distributing it) but in order to distribute a modified version of someone else\u0027s work, you need explicit permission, either in the form of a written note from the author to you specifically or the more general permission such as the Creative Commons licenses.\u003C/p\u003E\n"},{"CreatedByName":"PolecatEZ","CreatedById":58008,"CreatedDateTime":"2013-08-20T03:41:36Z","Content":"\n\u003Cp\u003EThere is a way around this though also.\u003C/p\u003E\u003Cp\u003EYou can make a patch for others to download which modifies the work. The catch is that the typical user must download the original files to his computer and then he must actively run your patch on his computer, clearly stating that this modifies the original content. This, however, also breaks the warranty and the original creator is in no way responsible for the result.\u003C/p\u003E\u003Cp\u003EBasically, re-write the config file for it from scratch (you\u0027re on your honor!), and then give a link to the original work to have people download it.\u003C/p\u003E\u003Cp\u003EThe common metaphor is that while a man can sell his book named \u0022Fire and Stuff\u0022, there\u0027s nothing stopping another man from sitting next next to him and selling matches labled \u0022For Burning Fire and Stuff\u0022. The original content creator can tell you from where to get/buy his stuff (licensed/authorized download pages, for example), but he can\u0027t say what the user does with it once they take it home. He can put cutesy stuff on it like \u0022only for reading in the bedroom\u0022, but it legally means nothing.\u003C/p\u003E\u003Cp\u003EI\u0027m not even sure where this whole copyright thing came from, as anything uploaded to Spaceport is Squad\u0027s property as per their ToS.\u003C/p\u003E\u003Cp\u003EPersonally, I would love to have personally copyrighted every design document I made as a game designer, as I still see my very specific ideas come out even 5 years after leaving a particular studio - but it just doesn\u0027t work that way. Everything I made at work is theirs and not mine, the exact same as any derivative work made for Squad and uploaded to their Spaceport belongs to them. The community may agree to abide by some \u0022hands off my shiznit\u0022 rules, but it has no actual force of law, just Squad\u0027s community management.\u003C/p\u003E\u003Cp\u003EThat being said, the community custom of protection of an author\u0027s original work is a cool thing, but there should be customary exceptions for abandoned mods and simple updates to make them usable.\u003C/p\u003E\u003Cp\u003E-------------\u003C/p\u003E\u003Cp\u003EFound the \u0022licensing thing\u0022 in the forum rules.\u003C/p\u003E\u003Cp\u003E-------------\u003C/p\u003E\u003Cp\u003EUpdate 2 - You could petition Squad and see how far you get, they do legally own everything uploaded to the Spaceport and may grant an EtP (Exception to Policy).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T04:04:38Z\u0022 title=\u002208/20/2013 04:04  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by PolecatEZ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-08-20T06:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PolecatEZ\u0022 data-cite=\u0022PolecatEZ\u0022\u003E\u003Cdiv\u003EYou can make a patch for others to download which modifies the work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepending on the nature of the patch, this can be considered a derivative work. A tool that upgrades part configs for 0.20\u002B by wrapping configs in a PART{} node isn\u0027t a derivative work, but other patches can be.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PolecatEZ\u0022 data-cite=\u0022PolecatEZ\u0022\u003E\u003Cdiv\u003EI\u0027m not even sure where this whole copyright thing came from, as anything uploaded to Spaceport is Squad\u0027s property as per their ToS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is incorrect. The Spaceport TOS grants Squad a lot of rights, but notably the intellectual property still belongs to the uploader. Squad does NOT have any legal ownership over mods. I\u0027m not sure where this myth keeps coming from.\u003C/p\u003E\n"}]}