{"TopicId":43212,"ForumId":44,"TopicTitle":"Ascending nodes and LKO","CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-08-20T12:15:27Z","PageNum":1,"Articles":[{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-08-20T12:15:27Z","Content":"\n\u003Cp\u003EI\u0027m not sure wether to put this here or in gameplay questions. Correct me if i\u0027m wrong.\u003C/p\u003E\u003Cp\u003EI had a few questions though, mostly general space questions:\u003C/p\u003E\u003Cp\u003EAfter a conversation about space debris in KSP, i looked into the Kessler syndrome, which led me to the 2009 sattelite colision (Iridium 33 and Kosmos-2251).\u003C/p\u003E\u003Cp\u003EI came up with a few questions about space mechanics along the way:\u003C/p\u003E\u003Cp\u003EDirect measurements of negative gravoli particles indicate Kerbin has the same gravity as Earth, 9.81 m/s. Yet, Kerbin is much, much smaller than Earth actually is, Earths equatorial radius being about 6.300 kilometers, 10.5 times Kerbins equatorial radius, which is 600 kilometers.\u003C/p\u003E\u003Cp\u003ELooking up about LEO, i came up with \u0022normal LEO orbital velocity of around 7.8 km/s\u0022. Low earth orbits go between 150 km up and 2000 km up. I\u0027ll take a reasonable 700 kilometres up, quite a bit more than 150km, which gives me a radius of a circular orbit of 7.000 kilometres. \u003C/p\u003E\u003Cp\u003EWhy do we, around Kerbin, which has the same gravity as Earth, go only about 2.3 km/s for a height of 100 km, so we\u0027ll have a radius of 700km in orbit? Usually you tend to go faster on smaller orbits, right?\u003C/p\u003E\u003Cp\u003EAlso, question 2: looking up Iridium 33, the article says \u0027an ascending node of 230.9Ã‚Â°\u0027. Between what exactly is this angle measured? I don\u0027t really see how the angle of your ascending node can go over 180 degrees without becoming the descending node.\u003C/p\u003E\u003Cp\u003EThanks in advance :-)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T12:18:36Z\u0022 title=\u002208/20/2013 12:18  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by Spyritdragon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fuzzy Dunlop","CreatedById":27329,"CreatedDateTime":"2013-08-20T12:40:27Z","Content":"\n\u003Cp\u003E1) Basically because Kerbin is much smaller than earth LKO is a much smaller, tighter circle than LEO. Because the orbit is tighter you get higher centifugal forces at the same speed. So around Kerbin you don\u0027t need to go as fast for the centrifugal force to cancel out gravity as you would around earth.\u003C/p\u003E\u003Cp\u003E2) I think that figure might be the longditude of the ascending node.\u003C/p\u003E\u003Cp\u003Eedit: just realised thats probably not a very helpful answer - the longditude of the ascending node is basically the angle between the node and an arbitrary line pointing away from earth, through the equator towards a fixed reference direction. \u003C/p\u003E\u003Cp\u003EBasically Iridium has 6 orbital planes, which each cross the equator at 30 degrees to each other. The longditude of the ascending node defines which plane is which. All the planes have the same angle to the equator i.e. inclination\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T12:50:45Z\u0022 title=\u002208/20/2013 12:50  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by Fuzzy Dunlop\u003C/strong\u003E\n\u003C/span\u003E\n"}]}