{"TopicId":43246,"ForumId":16,"TopicTitle":"Docking - Tips for the middle part, getting orbits close enough?","CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-08-20T18:12:54Z","PageNum":1,"Articles":[{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-08-20T18:12:54Z","Content":"\n\u003Cp\u003EMy space program continues as docking procedures are tested and retested for safety. My Kerbals now understand how to get ships into stable circular orbits and how to raise or lower them, and completed a milestone of seperately launching and then docking two drone ships. Further docking practice with the cooperation of the Krussians and their space station \u0027Scenario\u0027 have helped refine our knowledge of RCS maneuvers by moving pieces of the station to different docking ports.\u003C/p\u003E\u003Cp\u003EHowever one piece of knowledge that still eludes my Kerbals is getting the orbits of two ships close enough (\u0026lt;4km) for docking maneuvers. Despite several additional attempts the first docking success seems to have owed a lot to a lucky launch window.\u003C/p\u003E\u003Cp\u003ECurrently my KSP has been developing and testing a crew launch and return vehicle - designed to be a safe, easy to fly and reliable way to launch 0-3 Kerbals into orbit, dock with a station or craft for EVA transfer, then return 0-3 Kerbals safely to an ocean splashdown while also ensuring no debris is left in orbit. Initial tests have gone well, including one test that flew straight up until at the limit of its fuel it broke free of Kerbin\u0027s gravity and entered orbit around the Sun. The administration called this a waste, but the long orbital period helped identify a critical flaw in the solar panel arrangement. Just recently the first crewed launch flew, orbited once and then returned safely with no new issues identified.\u003C/p\u003E\u003Cp\u003EThat brings us to my current mission. A remotely controlled launch has already been made to put an empty crew vehicle into a flat, stable 125km orbit. Ludfield Kerman then launched in a second crew vehicle and moved into a similar 123km orbit, with the intent of docking with vehicle #1, performing an EVA, and returning in vehicle #1 while #2 is returned seperately under remote control.\u003C/p\u003E\u003Cp\u003EWhile an attempt was made to time the launch for an intercept the estimates where off, and Ludfield\u0027s ships is considerably ahead of the target.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s11.postimg.org/yo8pag9oz/screenshot143.jpg\u0022 alt=\u0022screenshot143.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point Kerbal scientists on the ground are suggesting Ludfield make some random orbital changes and see what happens. While Ludfield has fuel reserves for several maneuvers (283 liquid fuel, about 30 needed for each 100m/s of change and about 25 needed in reserve to ensure a safe return) he has doubts about the plan (which is odd since his stupidity rating is almost 100%, though his courage is very low).\u003C/p\u003E\u003Cp\u003ESo, any tips or orbital mechanics for getting craft lined up without massive fuel use or spending weeks in orbit waiting for an alignment? (Ludfield only brought a sandwich and a package of K\u0026amp;Ks from the space center\u0027s candy vending machine)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T20:47:05Z\u0022 title=\u002208/20/2013 08:47  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by Dave Kerbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-20T18:26:57Z","Content":"\n\u003Cp\u003ESince you\u0027re ahead of the target, you\u0027ll need to go higher. That\u0027s the general tip. Just putting this down here before I get ninja\u0027d.\u003C/p\u003E\u003Cp\u003EAlright - so rendezvousing. First thing\u0027s first - target the craft you want to rendezvous with. You\u0027re going to want to make sure the two craft are in the same orbital plane first, and that means reducing the ascending and descending node to zero. You do this by making a normal/anti-normal burn (depending on the node) at the node. What do I mean? Assuming you\u0027re in an eastward-travelling orbit, you want to burn southward at the ascending node or northward at the descending node until you\u0027re zeroed out. That\u0027s the first step. Go slow - the first tick mark on the throttle is usually \u003Cem\u003Eplenty\u003C/em\u003E; you don\u0027t want to overshoot and have to correct.\u003C/p\u003E\u003Cp\u003ENext is to get higher. If you can get your craft\u0027s periapsis to be about the same altitude as the craft you\u0027re wanting to intercept, raise the apoapsis above that of that craft. Usually 5000 meters or so will do the trick. A better way to handle this: your orbit should have two hash marks that indicate the distance the two craft will be apart from one another at an \u0022intercept point\u0022 (when the other craft crosses the plane of the first craft). Set up a maneuver at the periapsis - just do either a prograde or retrograde burn and see what it does to the intercept distance. Decreases = good, increases = bad (do the opposite). Do the same at apopasis once that maneuver is complete, but expect reduced results. Circle around Kerbin until the indicated intercept gets fairly low...fifty kilometers or so is usually about where you want to start trying to adjust things. At that point, you might try maneuver planning in between the apses. \u003C/p\u003E\u003Cp\u003EAbove all, take things slow; the only real limitation you probably have on making a rendezvous is fuel, and if you\u0027ve got RCS you can still maneuver to intercept once your main tanks are dry. Of course, in your case your RCS reserve is low; I\u0027d recommend deorbiting your ship on RCS if you run out of the main tank (anything below a 70k periapsis will eventually result in a de-orbit; below 30,000 for a definite decay).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T18:39:43Z\u0022 title=\u002208/20/2013 06:39  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-20T18:47:36Z","Content":"\n\u003Cp\u003EWhen I launch to rendezvous with a craft that\u0027s already in orbit, I time my launch so that I arrive at apoapsis after the other craft has already gone by. I do not circularize my orbit at that point, either, but raise my periapsis to about 60km so that there\u0027s going to be no significant air drag if I do dip back down into the atmosphere as part of the rendezvous. Remember that a lower orbit is a quicker orbit, so I\u0027ll be overtaking the target as long as my Ap is near his circular orbit and my Pe is lower than it.\u003C/p\u003E\u003Cp\u003ENext, while still near Ap and with the target craft Targeted, I start a slow prograde burn to ease my Pe upwards while watching the target\u0027s Closest Point of Approach markers on the Map. This allows me to stop the circularization burn whenever my Pe is at the right height so that my quicker, lower orbit will bring me close to the target next time around (within 1km is ideal). I then allow my craft to fall back down toward Pe.\u003C/p\u003E\u003Cp\u003EIf an inclination change is required for plane-matching, it can be made while passing the Ascending or Descending Nodes during this elliptical orbit.\u003C/p\u003E\u003Cp\u003EOne orbit later, as I rise back to Ap, I will encounter the other craft and my NavBall will switch to Target mode. At the closest point of approach, a short burn along the retrograde axis (which is relative to the target\u0027s velocity now, in Target mode) will match our orbits and complete the rendezvous.\u003C/p\u003E\u003Cp\u003EDeliberately launching \u0022late\u0022 so that you know the target is going to be ahead of you, instead of trying to nail it perfectly and possibly finding yourself ahead of the target, can result in some fuel savings since you never have to raise your Ap above the target\u0027s orbit. All it costs you is the time to make one additional orbit en route to the target.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T20:08:47Z\u0022 title=\u002208/20/2013 08:08  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-20T19:17:17Z","Content":"\n\u003Cp\u003EI\u0027ve made an in-game rendezvous tutorial plugin, you might want to check that out. (see signature)\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-08-20T20:46:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003ESince you\u0027re ahead of the target, you\u0027ll need to go higher. That\u0027s the general tip. Just putting this down here before I get ninja\u0027d.\u003Cp\u003EAlright - so rendezvousing. First thing\u0027s first - target the craft you want to rendezvous with. You\u0027re going to want to make sure the two craft are in the same orbital plane first, and that means reducing the ascending and descending node to zero. You do this by making a normal/anti-normal burn (depending on the node) at the node. What do I mean? Assuming you\u0027re in an eastward-travelling orbit, you want to burn southward at the ascending node or northward at the descending node until you\u0027re zeroed out. That\u0027s the first step. Go slow - the first tick mark on the throttle is usually \u003Cem\u003Eplenty\u003C/em\u003E; you don\u0027t want to overshoot and have to correct.\u003C/p\u003E\u003Cp\u003ENext is to get higher. If you can get your craft\u0027s periapsis to be about the same altitude as the craft you\u0027re wanting to intercept, raise the apoapsis above that of that craft. Usually 5000 meters or so will do the trick. A better way to handle this: your orbit should have two hash marks that indicate the distance the two craft will be apart from one another at an \u0022intercept point\u0022 (when the other craft crosses the plane of the first craft). Set up a maneuver at the periapsis - just do either a prograde or retrograde burn and see what it does to the intercept distance. Decreases = good, increases = bad (do the opposite). Do the same at apopasis once that maneuver is complete, but expect reduced results. Circle around Kerbin until the indicated intercept gets fairly low...fifty kilometers or so is usually about where you want to start trying to adjust things. At that point, you might try maneuver planning in between the apses. \u003C/p\u003E\u003Cp\u003EAbove all, take things slow; the only real limitation you probably have on making a rendezvous is fuel, and if you\u0027ve got RCS you can still maneuver to intercept once your main tanks are dry. Of course, in your case your RCS reserve is low; I\u0027d recommend deorbiting your ship on RCS if you run out of the main tank (anything below a 70k periapsis will eventually result in a de-orbit; below 30,000 for a definite decay).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI passed along your advice to Ludfield. He made a micro burn to level out the orbital plane then pushed up to around 128km where he waited for just under 10 hours as his orbit got closer and closer until his next pass showed a distance of just 31km. He planned a new maneuver to bring the distance down to 3.9km and then performed a pair of retrograde corrections until the expected approach was just 1.1km. From there he switched to his RCS system - he claimed to be having trouble getting small enough burns out of the poodle liquid fuel engine and didn\u0027t want to risk overshooting. A series of RCS burns zero\u0027d out the velocity between Ludfield\u0027s ship and the target and another burn sent him slowly towards it at a gentle 10 m/s.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s11.postimg.org/e8e9t89oz/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe remotely operated ship had already been left oriented up/down so it was a matter of getting into position above it and orienting down. Ludfield didn\u0027t have much difficulty here, having read the reports from the Krussian training mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s8.postimg.org/jm6uxg405/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s12.postimg.org/o9lbgqngt/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELudfield is very happy, he is about to be the first Kerbal to manually dock with another craft. The magnetic clamps engage and the two ships are docks with minimal wobble. The ships are docked and perfectly aligned (each ship has 3 solar wings with a missing 4th wing providing a point of reference for the \u0027top\u0027 of the ship when using RCS docking controls). It has taken about 11 minutes to go from 1km to docked.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/gzuk7wahd/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/xaz9hyccx/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA short EVA takes Ludfield over to the other ship and he undocks. His new ship has less fuel but a full tank of mono propellent. Overall the docking used around 18 units of liquid fuel about about 80 units of mono propellent from Ludfield\u0027s original ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s12.postimg.org/hje0ysf2l/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s10.postimg.org/gwli4u8rt/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELudfield uses RCS to push away before turning around and preparing to deorbit. As the atmosphere starts to drag on his ship he releases the orbital service module and watchs as it drifts away.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s21.postimg.org/8z6u6ekuv/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA safe splashdown brings the mission to a close.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s24.postimg.org/8ag4blwet/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-20T21:06:41Z","Content":"\n\u003Cp\u003EGlad to have been of assistance.\u003C/p\u003E\n"},{"CreatedByName":"CorruptDB","CreatedById":75308,"CreatedDateTime":"2013-08-20T21:40:07Z","Content":"\n\u003Cp\u003EIt sounds like you have the gist of it, but unless you are way off from the other ship you shouldn\u0027t have to wait more than an orbit. Here is my normal docking procedure:\u003C/p\u003E\u003Cp\u003E1. Launch when target is 15-30 degrees behind KSC (depending on target altitude)\u003C/p\u003E\u003Cp\u003E2. Burn until periapsis is at target altitude\u003C/p\u003E\u003Cp\u003E3. Approach periapsis and do normal orbital insertion burn\u003C/p\u003E\u003Cp\u003E4. Match inclinations to target (instructions higher in this thread)\u003C/p\u003E\u003Cp\u003E5. Get next intersect as close as possible. To do this, burn prograde (to raise your orbit) if target is behind you or retrograde if target is ahead of you. Keep the mouse over the intersect point and watch the seperation distance decrease until it starts going up again. Then use RCS (\u0027n\u0027 if you passed the closest spot) to adjust the intersect to the closest possible spot. If your inclination is good or the node is on the intersect it should be possible to get the intersect to 0.0 KM. \u003C/p\u003E\u003Cp\u003E6. When you reach the closest intersect make sure the navball is in target mode and burn retrograde relative to the target until the relative speed between you is less than 1 m/s\u003C/p\u003E\u003Cp\u003E7. Point the ship at the target marker on the navball and use RCS to approach it. It should be less than 1 KM away.\u003C/p\u003E\u003Cp\u003EUsing this method I can generally get within a few hundred meters of my target. If you are more than 1 KM from the target do steps 5-7 again. Be careful with 0.0 KM intersects, this method is accurate enough that I have crashed into my station a few times from the map screen.\u003C/p\u003E\n"},{"CreatedByName":"CorruptDB","CreatedById":75308,"CreatedDateTime":"2013-08-20T21:43:06Z","Content":"\n\u003Cp\u003EOh, I almost forgot, when approaching the station use the RCS translation keys (IJKL in staging mode) to align the yellow target prograde marker with the target marker when approaching. This will ensure that your orbit matches the orbit of the target and you don\u0027t miss to the side/top/bottom.\u003C/p\u003E\n"}]}