{"TopicId":43319,"ForumId":55,"TopicTitle":"Cargo module: More awesome than it sounds.","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-21T02:49:23Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-21T02:49:23Z","Content":"\n\u003Cp\u003EHello there! You might\u0027ve seen my post on the Apollo Applications Program. No? Then here it is! \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45928-Beyond-Apollo-AAP-challenge\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/45928-Beyond-Apollo-AAP-challenge\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWelcome back! Back to the idea thing I had!\u003C/p\u003E\u003Cp\u003EDo you remember this picture? It was a sketch of a \u0022Block III\u0022 CSM, that unfortunately, never \u0022took off\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://nassp.sourceforge.net/w/images/b/bc/Apollo_Logistics_Module.png\u0022 alt=\u0022Apollo_Logistics_Module.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENever will I find, someone like you...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThis \u0022cargo\u0022 CSM had space for stuff to be put into.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.friends-partners.org/partners/mwade/graphics/a/apopallt.gif\u0022 alt=\u0022apopallt.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIt\u0027s basically a cardboard box glued to a spaceship. You don\u0027t really need a visual aid.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENow, wouldn\u0027t it be the shizzle if this happened in KSP? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://galaxywire.net/wp-content/uploads/2009/05/lunar_rover_deploy.jpg\u0022 alt=\u0022lunar_rover_deploy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ELiterally as he was typing about the obscure piece of space history above, he remembered something that actually happened, and explained the point much better.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERemember the \u0022toolbox\u0022 that was shown ages ago?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/66ZqTr9.png\u0022 alt=\u002266ZqTr9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EYou do remember me, right? Guys?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe idea is that you have a container full of tools. When something breaks, a kerbal gets out a tool, fixes it, and puts the tool back in.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.casalatina.com/wp2012/wp-content/uploads/2012/11/url.jpg\u0022 alt=\u0022url.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EYou pretty much have the description of a toolbox down to a T, Drunk.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENow, imagine something like the toolbox, but it can hold more than just tools.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.designthenewbusiness.com/wp-content/uploads/2011/09/moving_box1.jpg\u0022 alt=\u0022moving_box1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI call it a \u0022box\u0022.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIn the VAB, you have a range of different \u0022cargo modules\u0022, with different sizes, shapes and capacities. You put them onto your ships like any other part. Then you click on the \u0022cargo\u0022 tab. You select a module to open it\u0027s inventory. Then you decide what goes in. You could put in experiments, equipment like antennae and floodlights, micro-satellites, even small crafts, like that manned rover you can\u0027t balance on your tiny-ass lander for the life of you. Their are limits on what you can put in. Every item has a set volume and mass. Once you reach the limit on either, that\u0027s it.\u003C/p\u003E\u003Cp\u003EYou get your craft to where you want to go, like the Mun, for example. You\u0027ve landed quite a distance from that cosy habitat you landed ahead of your manned mission. Luckily, you packed a rover. Select a kerbal on EVA, and click on the cargo module. Select the rover, and press \u0022unpack\u0022. The rover then materialises next to the lander. Worried you may lose sight of your lander on the trip back? No worries, unpack one of the lights, and the kerbal you have selected grabs the light, to deploy like a flag.\u003C/p\u003E\u003Cp\u003EWhy should this be a thing in the game? Well, if your like me, someone with a lower-end machine, part count is a thing you have to constantly worry about. That rover could be tens of parts that makes your mission more laggy and less fun. This turns it all into one part, only something for your computer to simulate when you\u0027re actually using it. Also, no more issues with balancing stuff. The way I see it, kerbals really like having holidays, so they\u0027re very good at packing their suitcases. This translates into the cargo module having a COM right in the middle. Yay for not getting killed in out-of-control landers!\u003C/p\u003E\u003Cp\u003EFeedback and constructive criticism is much appreciated as always. Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-21T15:33:06Z\u0022 title=\u002208/21/2013 03:33  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 21, 2013\u003C/time\u003E by Drunkrobot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2013-08-21T04:36:21Z","Content":"\n\u003Cp\u003EI like this. Do want. And it would allow you to carry spare solar panels up to a space station for the occasional MechJeb assisted solar panel collision. There is a reason I don\u0027t use the Balka solar wings from the KOSMOS mod.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-08-21T11:56:57Z","Content":"\n\u003Cp\u003Eright now becides all the oldness making planes useless, the lack of cargo bays make them worse off. this would give me reason to make ssto craft.\u003C/p\u003E\n"},{"CreatedByName":"blurrr 2","CreatedById":11016,"CreatedDateTime":"2013-08-21T13:17:07Z","Content":"\n\u003Cp\u003EThis should totally be a thing. It would add a new interesting dynamic to the game, add some incentive for manned missions (i.e. your kerbal can weld the engine back on when you land too hard), and add the EVA functionality the devs have been talking about forever.\u003C/p\u003E\n"},{"CreatedByName":"TADBTD","CreatedById":73888,"CreatedDateTime":"2013-08-21T13:39:33Z","Content":"\n\u003Cp\u003EThis would make KSP a lot better. I am totally up for the idea! Maybe if you add a opening cargo bay, that would be great.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-21T14:02:12Z","Content":"\n\u003Cp\u003EI\u0027m all for cargo bays, and all the gubbins that subsequently go with it - docking arms/robotics/mechanical bits, etc.\u003C/p\u003E\u003Cp\u003EOff topic...why is it that when you move something by land it\u0027s called shipping, but when it\u0027s on sea it\u0027s cargo? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LeadMagnet","CreatedById":43256,"CreatedDateTime":"2013-08-21T15:16:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmappedout\u0022 data-cite=\u0022allmappedout\u0022\u003E\u003Cdiv\u003EOff topic...why is it that when you move something by land it\u0027s called shipping, but when it\u0027s on sea it\u0027s cargo? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022shipping\u0022 is a verb and applies to all modes of transport, \u0022cargo\u0022 is a noun and also applies to all modes of transport! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI agree, space shuttle-esk cargo bays for shipping stuff to and fro would be great! I have to use the B9 mod pack for these. gimmee...gimmee...gimmee...gimmee! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2013-08-21T15:31:44Z","Content":"\n\u003Cp\u003ELove the idea and as always love your posts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMake this now? pretty please? somebody?\u003C/p\u003E\u003Cp\u003EPS: in the meantime procedural fairings always either single use or permanent storage of sorts, but nothing as awesome as this!\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-21T18:45:42Z","Content":"\n\u003Cp\u003EThis...or something like it will probably be implemented at some point since the shuttle project was HUGE for the two largest competing space programs on Earth. However, we\u0027ll probably have to wait \u0027till aerodynamics are reworked for better shuttle parts. On the plus side, the dude who made B9 Aerospace was hired on by SQUAD so perhaps we\u0027ll see some of his parts implemented to the stock game. Or maybe we\u0027ll see something new but just as interesting.\u003C/p\u003E\u003Cp\u003EEither way, I wouldn\u0027t be surprised if we had little cargo bays and/or shelves or something where you could attach experiments and things. Would be really nice to be able to pull out then drop various experiments on other celestial bodies. Since Apollo-esque missions where you actually send and return kerbonauts will be the best way to increase your science data or tech level or whatever, I\u0027m sure a lot of people would like to see those ploppable experiments like we left on the moon in real life and this type of shelving/storage system would suit it perfectly.\u003C/p\u003E\u003Cp\u003EYay science \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-21T19:27:22Z","Content":"\n\u003Cp\u003ETo clarify, I\u0027m not talking about a \u0022payload bay\u0022 like on the Space Shuttle (though that would be equally cool):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://science.ksc.nasa.gov/mirrors/images/images/pao/STS41C/10061365.jpg\u0022 alt=\u002210061365.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe modules I\u0027m ranting about would be more like the compartments in the Lunar Module descent stage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.lpi.usra.edu/lunar/missions/apollo/apollo_16/images/lm_lg.gif\u0022 alt=\u0022lm_lg.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EInstead of being an empty space you can put normal parts into, and then deploy by opening doors, the cargo module is something that looks a bit like a fuel tank, but has an inventory that can be accessed by a kerbanaut on EVA, like an Apollo astronaut taking out an ALSEP experiment or a Lunar rover.\u003C/p\u003E\n"}]}