{"TopicId":43372,"ForumId":44,"TopicTitle":"[space] Is Mars-one a scam?","CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2013-08-21T15:45:31Z","PageNum":13,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-28T18:14:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moon Goddess\u0022 data-cite=\u0022Moon Goddess\u0022\u003E\u003Cdiv\u003EAnd even if you can get the Dragon to Mars.. doesn\u0027t mean anyone can sit in there that whole trip.\u003Cp\u003EWould you like to spend 6 months in your car?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would ....\u003C/p\u003E\n"},{"CreatedByName":"theattackcorgi","CreatedById":82184,"CreatedDateTime":"2013-10-28T18:17:29Z","Content":"\n\u003Cp\u003EI say its a scam. It seems like their all talk and no do.\u003C/p\u003E\n"},{"CreatedByName":"theattackcorgi","CreatedById":82184,"CreatedDateTime":"2013-10-28T18:18:52Z","Content":"\n\u003Cp\u003EI think its a partial scam, Their just all talk and no trying to get it done.\u003C/p\u003E\u003Cp\u003EAnd YouTube vids as a selection program? WTF these people are dumb. No one who posts a video will have the training. I bet whoever they pic will die cause they dont have the proper education and stuff.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-10-28T18:24:27Z","Content":"\n\u003Cp\u003EIt\u0027s actually do a youtube vid \u003Cem\u003Eand pay them\u003C/em\u003E to apply. When the real purpose of the program is to get money out of rubes, putting the bar for entry particularly high just defeats the point.\u003C/p\u003E\n"},{"CreatedByName":"Goldham","CreatedById":73478,"CreatedDateTime":"2013-10-28T18:24:59Z","Content":"\n\u003Cp\u003EWell they\u0027re timeframe is way way too small, unless you invent some kind of Radioactive EM shielding.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-28T18:45:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Goldham\u0022 data-cite=\u0022Goldham\u0022\u003E\u003Cdiv\u003EWell they\u0027re timeframe is way way too small, unless you invent some kind of Radioactive EM shielding.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe issue is not radiation, nor technological limits, but the willpower. \u003C/p\u003E\u003Cp\u003EWe have the technology to colonize Mars. Don\u0027t listen to those who say we \u0022don\u0027t\u0022. We do, and we\u0027ve had such capability since the late 1990\u0027s. All we need is the infrastructure (Such as the SLS), and the political support.\u003C/p\u003E\u003Cp\u003ESaying that we \u0022don\u0027t\u0022....it\u0027s just NASA\u0027s way of delaying something, because it\u0027s much better then coming out and saying \u0022No Mars mission because Obama cut our spending, and so, we cannot afford it\u0022.\u003C/p\u003E\n"},{"CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2013-10-28T21:55:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EThe issue is not radiation, nor technological limits, but the willpower. \u003Cp\u003EWe have the technology to colonize Mars. Don\u0027t listen to those who say we \u0022don\u0027t\u0022. We do, and we\u0027ve had such capability since the late 1990\u0027s. All we need is the infrastructure (Such as the SLS), and the political support.\u003C/p\u003E\u003Cp\u003ESaying that we \u0022don\u0027t\u0022....it\u0027s just NASA\u0027s way of delaying something, because it\u0027s much better then coming out and saying \u0022No Mars mission because Obama cut our spending, and so, we cannot afford it\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErrr wrong.\u003C/p\u003E\u003Cp\u003EWe (probably) have the knowledge to send humans to Mars. We know the problems and know how to tackle them. What we don\u0027t have is the technology. Currently the only human rated spacecraft is the Soyuz TMA.\u003C/p\u003E\u003Cp\u003EWhat also lacks is the financial support. Mars-one has quite a bit of money from the applicants and donations. But still nowhere near the amount needed for missions to Mars (and the management and support for such missions).\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-28T22:04:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe have the technology to colonize Mars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a big difference between \u0022visit\u0022 and \u0022colonise\u0022.\u003C/p\u003E\u003Cp\u003EWe potentially could visit Mars, although the technology to do so is either untested or simply hasn\u0027t been developed yet. Remember that we\u0027ve \u003Cem\u003Enever\u003C/em\u003E done long-duration manned spaceflight outside LEO. Learning how to do so safely would take a lot of small iterative steps, similar to how we learned to do manned flight in orbit.\u003C/p\u003E\u003Cp\u003EWe certainly don\u0027t have the technology to colonise Mars, if by that you mean a permanent presence. Not even close. We haven\u0027t managed to establish a permanent presence in space anywhere yet. Doing so at that kind of distance would be very difficult. We\u0027d have to have established a permanent outpost closer to home (LEO, the moon, etc) before we could be confident sending one to Mars.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-29T14:24:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThere\u0027s a big difference between \u0022visit\u0022 and \u0022colonise\u0022.\u003Cp\u003EWe potentially could visit Mars, although the technology to do so is either untested or simply hasn\u0027t been developed yet. Remember that we\u0027ve \u003Cem\u003Enever\u003C/em\u003E done long-duration manned spaceflight outside LEO. Learning how to do so safely would take a lot of small iterative steps, similar to how we learned to do manned flight in orbit.\u003C/p\u003E\u003Cp\u003EWe certainly don\u0027t have the technology to colonise Mars, if by that you mean a permanent presence. Not even close. We haven\u0027t managed to establish a permanent presence in space anywhere yet. Doing so at that kind of distance would be very difficult. We\u0027d have to have established a permanent outpost closer to home (LEO, the moon, etc) before we could be confident sending one to Mars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guarantee you, we have the technology. We have the infrastructure.\u003C/p\u003E\u003Cp\u003EBut what do we need?\u003C/p\u003E\u003Cp\u003ETo colonize Mars would cost money. Lots of money.\u003C/p\u003E\u003Cp\u003EDoes Congress want that? No, they\u0027d rather pay corporate welfare and send marines to random oil rich Arab countries. The reason we haven\u0027t done long-term LEO spaceflight is because we don\u0027t have the political willpower.\u003C/p\u003E\u003Cp\u003EVehicles are not technology. They are transportation. We cannot get to Mars with the vehicles of today, but we have the technology to build vehicles that can get us to Mars.\u003C/p\u003E\u003Cp\u003EIf we want, the United States could land on Mars in five years...but we don\u0027t have the funds. We need the money. Without money, there will be no Mars landing.\u003C/p\u003E\u003Cp\u003EBlame Congress, as usual.\u003C/p\u003E\u003Cp\u003EThat\u0027s why we can\u0027t have nice things\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-29T15:06:06Z","Content":"\n\u003Cp\u003EWe have the technology to go to Proxima Centauri. The fact it would take an absurdly large ship effectivelly replacing Earth is just... lack of money.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-29T15:12:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWe have the technology to go to Proxima Centauri. The fact it would take an absurdly large ship effectivelly replacing Earth is just... lack of money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder why no one even THINKS of a Valkeryie Starship.\u003C/p\u003E\u003Cp\u003EIf we are going interstellar affordably (Below 500 Billion), that\u0027s the answer.\u003C/p\u003E\u003Cp\u003EIf America abolished the military for a year and gave it to NASA stockpile we would have enough funds to send a probe to Alpha Centuari....maybe even a manned ship.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-10-29T15:12:46Z","Content":"\n\u003Cp\u003EListen, we\u0027ve already gone through this discussion dozens of times, including in this thread. There really is no point in repeating the same arguments over and over again. Just read the 30 pages again.\u003C/p\u003E\u003Cp\u003EWe have never experimented closed-loop life support on Earth, let alone in space.\u003C/p\u003E\u003Cp\u003EWe have never experimented in-situ resource utilization.\u003C/p\u003E\u003Cp\u003EWe have never experimented long-term biological effects of cosmic radiation or partial gravity.\u003C/p\u003E\u003Cp\u003EWe have never experimented long-term psychological effects of deep-space missions.\u003C/p\u003E\u003Cp\u003EWe have never experimented landing large payloads on another planet.\u003C/p\u003E\u003Cp\u003EWe have (partial) knowledge of those fields, as well as theories and hypothetical designs, but we are far from having answers to all of the engineering and biological problems. To get those answers will takes decades of iterative experiments on Earth and in Space as well as a lot of money. The day will come when we will have the technology, but it is still too early.\u003C/p\u003E\u003Cp\u003EHaving the technology means having operational implementations of that technology. It also means having the money to build those implementations. If you have neither the experience, the design, or the money, then you simply don\u0027t have the technology. All you have are theoretical ideas.\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2013-10-29T15:14:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EI guarantee you, we have the technology. We have the infrastructure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat technology are you talking about? Is that the same technology which requires regular cargo launches to ISS? Do you understand that Mars is far away? Like, 6 to 9 months away? We don\u0027t have self-sustained environment on LEO. AFAIK, we don\u0027t even have it here, on Earth. What \u0022colonization\u0022 are you even talking about?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe have never experimented long-term psychological effects of deep-space missions.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn this one (and only on this one) I have to disagree. Both US and Russia have conducted and, to my knowledge, are still conducting long-term isolation experiments. Unless you mean that being alone in deep space is somehow different from simply being alone in space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T15:18:48Z\u0022 title=\u002210/29/2013 03:18  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by J.Random\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-29T15:50:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EI guarantee you, we have the technology. We have the infrastructure.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee, now this is what\u0027s called an assertion. To make it qualify as a little more plausible you\u0027d need to provide some evidence to back it up with. Can you do that? Convince us that the technology is tested, available, and rated for manned flight.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-29T16:01:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ESee, now this is what\u0027s called an assertion. To make it qualify as a little more plausible you\u0027d need to provide some evidence to back it up with. Can you do that? Convince us that the technology is tested, available, and rated for manned flight.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you, my dear sir, show me that the technology is not ready for use.\u003C/p\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2013-10-29T16:32:30Z","Content":"\n\u003Cp\u003EHmmm, NASAFanboy, fraid the burden of proof is on you, as you are the one making the assertation.\u003C/p\u003E\u003Cp\u003EI do kinda agree though, we have the technology, but we dont have the experience. without the experience we wont be able to fully utilize the technology and as a result it is not feasible.\u003C/p\u003E\u003Cp\u003ESeret: having the technology and having it tested, available and rated for manned flight are two completely different things.\u003C/p\u003E\u003Cp\u003EFor example mankind has the technology to have an unmanned car drive safely on the road. the technology is partially (well, very really, but still not enough) tested, avalible but not rated for automated unsupervised action on public roads.\u003C/p\u003E\u003Cp\u003EEqually we have the technology to make cars. however i havent tested it, dont have the parts to hand, and it wouldnt be rated for use on public roads because a moron (me) would\u0027ve made it.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-10-29T16:47:35Z","Content":"\n\u003Cp\u003EThey didn\u0027t have the experience either when they landed on the Moon. A fly-by and descent-abort like Apollo 8 and 10 is not an option for a Mars mission though. We\u0027ll have to build a lander with multiply-redundant systems, that works on the first attempt. We might be able to test the ascent-descent vehicle on Earth though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T16:57:06Z\u0022 title=\u002210/29/2013 04:57  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by SargeRho\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-10-29T17:21:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EAnd you, my dear sir, show me that the technology is not ready for use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ISS needs constant shipments of supplies-including oxygen (in the form of water that\u0027s split through electrolysis). If we had the technology to recycle oxygen with the efficiency necessary for a Mars voyage, we\u0027d use it on the ISS and not need to send up the extra mass of water, or deal with the rather unreliable electrolysis equipment. Same reasoning applies to food and drinking water.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-29T17:43:05Z","Content":"\n\u003Cp\u003EI\u0027ll state my point.\u003C/p\u003E\u003Cp\u003EWhat I said was we have the technology, but not the experience. Sure , we could probably even go to Mars with 1995 technology, but it would be a rather more expensive type of journey.\u003C/p\u003E\u003Cp\u003EAlso, regardless of what you say, the ISS is nowhere near cutting-edge of mankind\u0027s technology today. It was designed in the 1990\u0027s, and is a spacestation in the 1990\u0027s, and possibly early 2000\u0027s.\u003C/p\u003E\u003Cp\u003EWhat I support is the development of a heavy-lift vehicle, such as the SLS to launch habs and supplies to Mars BEFORE the astronauts even come. I believe a typical Mars mission, if done, will most likely look like the crew riding the hab to a predetermined site on Mars. After landing, they rendezvous with their return vehicle and their supplies, and stay on Mars for up to a year before boarding the return vehicle, lifting off to a orbiting habitat, which brings them home.\u003C/p\u003E\u003Cp\u003EThe hab could generate artificial gravity by spinning from a cable attached to a spent stage of the rocket. The cable is cut once it reach Mars orbit, where it could ride down to the surface.\u003C/p\u003E\u003Cp\u003ENow, what information did I base my conclusion on?\u003C/p\u003E\u003Cp\u003EThe Case for Mars\u003C/p\u003E\u003Cp\u003EThe Plan to Settle the Red Planet, and Why we Must\u003C/p\u003E\u003Cp\u003EWikipedia\u003C/p\u003E\u003Cp\u003EVarious news site/articles\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-10-29T17:47:52Z","Content":"\n\u003Cp\u003EIf you can give any evidence of a real demonstration of oxygen regeneration at an efficiency which wouldn\u0027t kill all of the astronauts over that period of time, I\u0027d love to see it.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-10-29T17:49:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EI wonder why no one even THINKS of a Valkeryie Starship.\u003Cp\u003EIf we are going interstellar affordably (Below 500 Billion), that\u0027s the answer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is your example of feasibility? A ship that requires hundreds of tons of antimatter? Current cost of producing antimatter in, say particle accelerators like the LHC, puts the cost at something like $100 trillion per gram. It might be possible to re-purpose these facilities specifically for antimatter production (instead of as a byproduct) and get production down to $10 billion per gram. So for your $500 billion, you could, using technologies we haven\u0027t developed, hypothetically produce half a kilogram. And storing it -- well we\u0027ve been very successful at storing antimatter so far: a few hundred atoms of anti-hydrogen stored for 17 minutes. That\u0027s basically the same as storing tons of antimatter for years, right? Keep in mind that a single ton of antimatter has the explosive capability of 21 \u003Cem\u003Egigatons\u003C/em\u003E of TNT, roughly 500 times more explosive than the biggest atom bomb ever built. Get a couple hundred tons of the stuff together and you\u0027re within an order of magnitude or so of the dinosaur killer impact.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2013-10-29T17:53:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EThe Falcon 9 has yet to have a loss of vehicle. The one time an engine failed, its multi-engine-out capability was demonstrated, and with it its inherently higher safety than other rockets. Also no highly explosive LH2, and no SRBs.\u003Cp\u003EThere is something known about the launcher and transfer vehicle. IIRC the transfer vehicle will be on a free return trajectory, and end up back at Earth, or just orbit the Sun forever, while the people will land with the RedDragon capsule docked to each transfer vehicle. Also it will be launched using the Falcon Heavy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour comment shows a fairly decent amount of ignorance. First off, one engine failing does not prove its multi-engine-out capability, it proves its single-engine-out capabilities. The Falcon 9 has not had any losses because there have only been 6 launches, the Shuttle went 24 flights without incident before Challenger. Also, everyone is treating the Falcon Heavy like its the F9, which it isn\u0027t. I will admit they are very similar, however they are not the same, and until the Falcon Heavy has been proven, it is not to be treated as a proven launch platform. Hell, the FH was an idea created before they likely even finished design of the F9 seeing as they are still testing new engines to see if they will work better. As much as I love and even borderline worship SpaceX, but there is no such thing as a perfect rocket and until a concept is tested itself, it isn\u0027t proven\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2013-10-29T17:55:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://www.mars-one.com/en/mars-one-news/press-releases/11-news/380-mars-one-contracts-paragon-for-mars-life-support-systems\u0022 rel=\u0022external nofollow\u0022\u003EThey have a contract with Paragon for life support and space suits.\u003C/a\u003E\u003Cp\u003EThats right, they don\u0027t have a launcher or have any contract with SpaceX. \u003Ca href=\u0022http://www.mars-one.com/en/mars-one-news/announcements/11-news/359-mars-one-visits-suppliers\u0022 rel=\u0022external nofollow\u0022\u003EThey did have talks with SpaceX about purchasing a rocket.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECalling it a scam doesn\u0027t make it a scam. Seriously, where is your proof that it\u0027s a scam?\u003C/p\u003E\u003Cp\u003EEven better; why would it be a scam? What would they gain? Really, I\u0027d like to hear why it\u0027s a scam.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot saying it is a scam but... \u0022what would they gain?\u0022... that part seems fairly obvious if it was a scam seeing as the entire purpose of any scam is to make money.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-29T19:00:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThis is your example of feasibility? A ship that requires hundreds of tons of antimatter? Current cost of producing antimatter in, say particle accelerators like the LHC, puts the cost at something like $100 trillion per gram. It might be possible to re-purpose these facilities specifically for antimatter production (instead of as a byproduct) and get production down to $10 billion per gram. So for your $500 billion, you could, using technologies we haven\u0027t developed, hypothetically produce half a kilogram. And storing it -- well we\u0027ve been very successful at storing antimatter so far: a few hundred atoms of anti-hydrogen stored for 17 minutes. That\u0027s basically the same as storing tons of antimatter for years, right? Keep in mind that a single ton of antimatter has the explosive capability of 21 \u003Cem\u003Egigatons\u003C/em\u003E of TNT, roughly 500 times more explosive than the biggest atom bomb ever built. Get a couple hundred tons of the stuff together and you\u0027re within an order of magnitude or so of the dinosaur killer impact.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot antimatter.\u003C/p\u003E\u003Cp\u003EI was hoping for a starship to have a photon sail, and to be assisted by fusion/VASMIR.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-29T19:26:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThis is your example of feasibility? A ship that requires hundreds of tons of antimatter? Current cost of producing antimatter in, say particle accelerators like the LHC, puts the cost at something like $100 trillion per gram. It might be possible to re-purpose these facilities specifically for antimatter production (instead of as a byproduct) and get production down to $10 billion per gram. So for your $500 billion, you could, using technologies we haven\u0027t developed, hypothetically produce half a kilogram. And storing it -- well we\u0027ve been very successful at storing antimatter so far: a few hundred atoms of anti-hydrogen stored for 17 minutes. That\u0027s basically the same as storing tons of antimatter for years, right? Keep in mind that a single ton of antimatter has the explosive capability of 21 \u003Cem\u003Egigatons\u003C/em\u003E of TNT, roughly 500 times more explosive than the biggest atom bomb ever built. Get a couple hundred tons of the stuff together and you\u0027re within an order of magnitude or so of the dinosaur killer impact.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://i1142.photobucket.com/albums/n602/k5h3r10ck/The%20GIF%20Closet/tumblr_inline_mg9jpdND081qa4idi_zps1b1dc142.gif\u0022 rel=\u0022external nofollow\u0022\u003EThat\u0027s why special tanks and dilitium crystals would be used.\u003C/a\u003E\u003C/p\u003E\n"}]}