{"TopicId":43372,"ForumId":44,"TopicTitle":"[space] Is Mars-one a scam?","CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2013-08-21T15:45:31Z","PageNum":16,"Articles":[{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-16T22:15:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWe are only lacking one thing: will and money!\u003Cp\u003EEr... We are only lacking two things: will and money... and technology!\u003C/p\u003E\u003Cp\u003E...and ruthless efficiency...\u003C/p\u003E\u003Cp\u003EUm... Among the things we are lacking are will, money, technology, ruthless efficiency, and a near fanatical devotion to the Pope!\u003C/p\u003E\u003Cp\u003EAlright, I\u0027ll come in again...\u003C/p\u003E\u003Cp\u003ENOBODY EXPECTS THE SPANISH INQUISITION!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut seriously... Establishing a permanent martian settlement does not require \u0022impossible technologies\u0022 and we have enough people to build a rocket and all the materials needed to fuel one or 10.000 rockets full of supplies and building materials. With that it\u0027s possible. I just don\u0027t know how many i-pads and designer kitchens we\u0027re prepared to give up to do that and I\u0027m not certain I want to give up too many myself. \u003C/p\u003E\u003Cp\u003EAllmost anything is possible with enough money and lives thrown at it.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-04-16T22:18:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EAllmost anything is possible with enough money and lives thrown at it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr, if you\u0027re the SCP foundation, D-class \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"makinyashikino","CreatedById":96244,"CreatedDateTime":"2014-04-17T04:30:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EUntil the Sun craps out something, as it does sometimes.\u003Cp\u003EMars has no dynamo effect of its core and its atmosphere is pathetic. There\u0027s a difference between staying on ISS for a few months and living your whole life on Mars.\u003C/p\u003E\u003Cp\u003EWhat about psychological effects? Does anyone here realize those people would kill each other like animals? It\u0027s just a matter of time.\u003C/p\u003E\u003Cp\u003EImagine you\u0027re sentenced to a life in few capsules, with rare EVAs. No more trees. No more blue sky. No more rain, no more animals, grass, clouds, birds.\u003C/p\u003E\u003Cp\u003EMost of your food is boring, mushy stuff you get from grown algae. Every year, perhaps, you get to eat cookies sent from Earth. You can\u0027t even live chat with people on Earth, because the signal travels a significant amount of time.\u003C/p\u003E\u003Cp\u003EAnd there\u0027s no one to force you to stop doing anything you want (like in prison). No more ***? Why not ****? Who would punish you?\u003C/p\u003E\u003Cp\u003EWith no hope of ever returning back, we\u0027d witness a horrific decline of human minds. Reality TV? How about ****ing illegal live snuff, because that\u0027s what it is.\u003C/p\u003E\u003Cp\u003EThe whole concept of a permanent settlement requires law enforcement, at least.\u003C/p\u003E\u003Cp\u003ELegal issues aside, with all these problems, I don\u0027t see how anyone would invest in such a stupid idea.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs much as I agree that Mars One is a pipe dream, you are exaggerating the effects. Humanity is much stronger willed than you think. If people have the will to endure the horrors of **** death camps and North Korean prisons, I believe people have the endurance to survive in poor, cramped conditions. People live in submarines for months at a time, I DO realise that they will eventually reach the surface eventually, but it\u0027s for quite a while. Also keep in mind that before we had trains and planes, people had relatively plain diets; for example, during WWII, people had restricted diets, especially in occupied countries. They could occasionally smuggle something with more flavour, but it was rare. If we were going to mars, we would bring more than one food source. We would have different crops as well as some occasional sweets or delicacies. Obviously there ARE weaker willed people who would not be able to survive the harshness of space. But people have had worse, and if we can make it through that, we can sure as hell make it to mars.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-17T05:19:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EBut seriously... Establishing a permanent martian settlement does not require \u0022impossible technologies\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does require untested technologies, and with or current tech level it would require constant resupply missions. It\u0027s a significant engineering and logistic challenge, and a permanent settlement would be very risky.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-04-17T07:00:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EBut seriously... Establishing a permanent martian settlement does not require \u0022impossible technologies\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a huge difference between theoretical design and operational hardware. It involves this pesky thing called \u0022engineering\u0022. Things that may seem trivial take years or decades to actually implement. Each latch, hinge, hose, interface, takes years to design in the real world. Components have to be sourced, materials have to be tested, suppliers have to be selected, fabrication procedures have to be written, personnel has to be trained...\u003C/p\u003E\u003Cp\u003EThere is this measure that NASA uses that is called \u003Ca href=\u0022https://en.wikipedia.org/wiki/Technology_readiness_level\u0022 rel=\u0022external nofollow\u0022\u003ETechnology Readiness Levels\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EMany of the technologies that are needed for a manned Mars expedition (let\u0027s not even talk about colonies or bases) are around TRL 3 or 4. You need to reach TRL 8 or 9 to start building vital mission hardware out of it, and it takes years, and sometimes decades, to move from one level to the next.\u003C/p\u003E\u003Cp\u003EThings like closed-loop life support (or even a reliable 3-year ECLSS), ISRU, shielding, simply do not exist... The infrastructure for launching and constructing a Mars vehicle simply do not exist and there is no budget to develop them.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-17T07:47:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThere is a huge difference between theoretical design and operational hardware. It involves this pesky thing called \u0022engineering\u0022. Things that may seem trivial take years or decades to actually implement. Each latch, hinge, hose, interface, takes years to design in the real world. Components have to be sourced, materials have to be tested, suppliers have to be selected, fabrication procedures have to be written, personnel has to be trained...\u003Cp\u003EThere is this measure that NASA uses that is called \u003Ca href=\u0022https://en.wikipedia.org/wiki/Technology_readiness_level\u0022 rel=\u0022external nofollow\u0022\u003ETechnology Readiness Levels\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EMany of the technologies that are needed for a manned Mars expedition (let\u0027s not even talk about colonies or bases) are around TRL 3 or 4. You need to reach TRL 8 or 9 to start building vital mission hardware out of it, and it takes years, and sometimes decades, to move from one level to the next.\u003C/p\u003E\u003Cp\u003EThings like closed-loop life support (or even a reliable 3-year ECLSS), ISRU, shielding, simply do not exist... The infrastructure for launching and constructing a Mars vehicle simply do not exist and there is no budget to develop them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich would be relevant, if I had said we should ship people out when just a rocket is ready. I didn\u0027t. \u003C/p\u003E\u003Cp\u003EI meant that with adequate allocation of ressources, we could research, develop and implement the necessary technologies to go to mars and stay there. How long it would take is hard to guess and again very dependent on how much money and personel thrown at the problem. The apollo program and manhattan project are examples of what you can do with \u0022crash programmes\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-04-17T07:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EAnd there\u0027s no one to force you to stop doing anything you want (like in prison). No more ***? Why not ****? Who would punish you?\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003EThe whole concept of a permanent settlement requires law enforcement, at least.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOther people would. If you do something like that regularly on a Mars colony where everyone knows everyone else, I wager that you\u0027d soon end up sleeping outside. Suitless.\u003C/p\u003E\u003Cp\u003EAnyway, law enforcement isn\u0027t some magical nonhuman force that you can store in a tank. Law enforcement is, in fact, composed of other humans. Guess what\u0027s coming along on the colony?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-17T07:55:50Z\u0022 title=\u002204/17/2014 07:55  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 17, 2014\u003C/time\u003E by Holo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-04-17T08:12:13Z","Content":"\n\u003Cp\u003EI don\u0027t think Mars1 is a scam... but I do think their expectations don\u0027t line up with reality.\u003C/p\u003E\u003Cp\u003EIt\u0027s true that media events are lucrative, but I don\u0027t think they\u0027re \u0022fund a martian colony\u0022 lucrative.\u003C/p\u003E\u003Cp\u003EI would have applied to Mars1 myself if I wasn\u0027t totally unconvinced they had a viable plan.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-17T09:50:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EHow long it would take is hard to guess and again very dependent on how much money and personel thrown at the problem. The apollo program and manhattan project are examples of what you can do with \u0022crash programmes\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure but there\u0027s a limit to what you can achieve by throwing money and resources at a project. You get diminishing returns for every extra person you add, and past a certain point it has no benefit. Granted something like a Mars mission is so big that you\u0027re able to atomise it down into lots of little projects, but there\u0027s a limit to how much you can do that too, or the interfaces will come back to bite you.\u003C/p\u003E\u003Cp\u003EApollo accepted a fairly large amount of risk as the trade off for speed, they were lucky things went as well as they did. Ditto the Manhattan Project, but in that case it was wartime so elevated tolerance of risk was more the norm.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-17T09:57:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sillychris\u0022 data-cite=\u0022Sillychris\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s true that media events are lucrative, but I don\u0027t think they\u0027re \u0022fund a martian colony\u0022 lucrative.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ex1000\u003C/p\u003E\u003Cp\u003EAIUI their projections are based on viewer numbers equivalent to an Olympic event. The trouble is that the Olympics is two weeks, there\u0027s no way you\u0027d sustain that level of interest permanently, when all the folks would be doing is sitting around cooped up in a Dragon and occasionally going for a walk in a big red carpark.\u003C/p\u003E\u003Cp\u003EThe sceptical part of me thinks they\u0027re not really intending seriously to send anyone to Mars. They just want to drum up buzz and sell a reality TV programme about the trainee astronauts. Hopefully not anything like \u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Cadets_(TV_series)\u0022 rel=\u0022external nofollow\u0022\u003ESpace Cadets\u003C/a\u003E...\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-17T10:56:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ESure but there\u0027s a limit to what you can achieve by throwing money and resources at a project. You get diminishing returns for every extra person you add, and past a certain point it has no benefit. Granted something like a Mars mission is so big that you\u0027re able to atomise it down into lots of little projects, but there\u0027s a limit to how much you can do that too, or the interfaces will come back to bite you.\u003Cp\u003EApollo accepted a fairly large amount of risk as the trade off for speed, they were lucky things went as well as they did. Ditto the Manhattan Project, but in that case it was wartime so elevated tolerance of risk was more the norm.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, but I think we could do alot more to get there, if we wanted to. And I think that most of us want to get to mars, we\u0027re just disagreeing on how much should be spent on it. \u003C/p\u003E\u003Cp\u003EMaybe it would be prudent to do some planning as to see what the minimum cost would be to get there in a reasonable timeframe and then to think hard about whether we can\u0027t... internationally... sacrifice to make it happen in that reasonable timeframe. \u003C/p\u003E\u003Cp\u003EA no rush project of sorts, but still a firm commitment to slowly start laying the ground work to get the required technologies done. \u003C/p\u003E\u003Cp\u003EAs a european I wouldn\u0027t want the entire economical responsibility to lie on ie. nasa and the US taxpayer, if it could be a partnership where ESA takes part. With options for participation from other nations.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-17T13:25:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EI agree, but I think we could do alot more to get there, if we wanted to. And I think that most of us want to get to mars, we\u0027re just disagreeing on how much should be spent on it. \u003Cp\u003EMaybe it would be prudent to do some planning as to see what the minimum cost would be to get there in a reasonable timeframe \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow would one determine the cost of development of technologies that we don\u0027t yet have? And what would be a reasonable amount of time for that? \u003C/p\u003E\u003Cp\u003EI\u0027s like asking Jules Verne to do a cost estimate of developing an actual manned Moon program in a reasonable amount of time.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-17T14:03:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EI agree, but I think we could do alot more to get there, if we wanted to.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, because right now we\u0027re doing almost nothing. That\u0027s because there aren\u0027t a lot of really compelling reasons to go there beyond flag planting. Robotic exploration has proved to be highly effective, relatively cheap, low risk and very much within our capabilities.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EHow would one determine the cost of development of technologies that we don\u0027t yet have? And what would be a reasonable amount of time for that? \u003Cp\u003EI\u0027s like asking Jules Verne to do a cost estimate of developing an actual manned Moon program in a reasonable amount of time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are techniques that can be used to estimate that kind of thing that have proven surprisingly accurate. An example is \u003Ca href=\u0022https://en.wikipedia.org/wiki/Delphi_method\u0022 rel=\u0022external nofollow\u0022\u003EDelphi\u003C/a\u003E, which I believe was used for the Apollo Program.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-17T14:09:07Z\u0022 title=\u002204/17/2014 02:09  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 17, 2014\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-17T18:20:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere are techniques that can be used to estimate that kind of thing that have proven surprisingly accurate. An example is Delphi, which I believe was used for the Apollo Program. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was at a time when the technology needed was within reach. I don\u0027t think Delphi would have helped the Apollo program if it would have been started at the time of \u003Ca href=\u0022https://en.wikipedia.org/wiki/From_the_Earth_to_the_Moon\u0022 rel=\u0022external nofollow\u0022\u003EJules Verne\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThere is not much of a point in planning and cost analysis when so much about the program is uncertain because it involves problems for which we don\u0027t yet have solutions. \u003C/p\u003E\u003Cp\u003EFirst research - which is being done, though not specifically for a manned Mars mission, just as generally much research has been done without a specific application in mind.\u003C/p\u003E\n"},{"CreatedByName":"Syphus","CreatedById":108765,"CreatedDateTime":"2014-04-17T19:18:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EOf course, because right now we\u0027re doing almost nothing. That\u0027s because there aren\u0027t a lot of really compelling reasons to go there beyond flag planting. Robotic exploration has proved to be highly effective, relatively cheap, low risk and very much within our capabilities.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is one of the main things that bugs me about Mars One. Unless you really want to learn about how quickly humans will die or go blind on Mars, there isn\u0027t much of a compelling reason to go there. If you want ease, something that is within our grasp, and a lot cheaper, a Lunar program would make far more sense. If you want something that would give a larger benefit to having humans on the surface, there are numerous other candidates. Hell, I could totally get beyond a Titan colony. I don\u0027t even care about dying Horrible if I could look up and see Saturn hanging in the sky just once.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-17T19:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EOf course, because right now we\u0027re doing almost nothing. That\u0027s because there aren\u0027t a lot of really compelling reasons to go there beyond flag planting. Robotic exploration has proved to be highly effective, relatively cheap, low risk and very much within our capabilities.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed in that we are doing very little. Though I\u0027d also point the finger at shifting priorities from different administrations... A lack of focus so to speak. \u003C/p\u003E\u003Cp\u003EAs a little side-note... I\u0027ve allways found the \u0022low risk\u0022 argument somewhat overrated. As far as I know most astronauts and potential volunteers are prepared to take risks.\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2014-04-17T20:44:15Z","Content":"\n\u003Cp\u003EHas anyone read \u0022\u003Cstrong\u003EThe Moon is a Harsh Mistress\u003C/strong\u003E\u0022 by \u003Cstrong\u003ERobert Heinlein\u003C/strong\u003E? You should. First off, its a good book. But secondly, it exactly illstrates what a colony like this could look like. It is written in sort of a communication slang, but once you get into it, it tells a wonderful story. About a colony on the Moon (Luna) and the people who now live there (Loonies). A theme central to the plot is law enforcement amongst the people, as well as between the colony on Luna (who consider themselves fairly independent) and Earth (which considers the Moon as a colony to be governed). It also talks about relationships, and how those relationships develop in a nearly-cut-off place like the Moon.\u003C/p\u003E\u003Cp\u003EGo to the library and check it out. Its from 1966, but very little of anything is outdated, the darn thing is so well written. Mannie, Wyoh, Prof, and Mike all have discussions very similar to those happening in this thread.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-04-17T21:07:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EAgreed in that we are doing very little. Though I\u0027d also point the finger at shifting priorities from different administrations... A lack of focus so to speak. \u003Cp\u003EAs a little side-note... I\u0027ve allways found the \u0022low risk\u0022 argument somewhat overrated. As far as I know most astronauts and potential volunteers are prepared to take risks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can be prepared to take all the risks you want. Sadly, that does not launch rockets though. That\u0027s even before you reach a destination. It\u0027s a reality, there needs to be something we can \u0022guarantee\u0022 will work for there to be any progress. We cannot just scatter shot and hope for a result.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-17T21:59:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EYou can be prepared to take all the risks you want. Sadly, that does not launch rockets though. That\u0027s even before you reach a destination. It\u0027s a reality, there needs to be something we can \u0022guarantee\u0022 will work for there to be any progress. We cannot just scatter shot and hope for a result.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm... just where did that post say that it launched rockets? Or that it guaranteed anything to work? Or that we should \u0022scattershot\u0022? \u003C/p\u003E\u003Cp\u003EIn any case none of it had anything to do with the point the post was making. Which was that \u0022low risk\u0022 seems a bit of overvalued argument, in the overall debate, since humans can be quite prepared to accept somewhat high risks for things they believe in. Heck, look far enough and you\u0027ll find humans accepting a 100 percent risk of death for something. Apollo astronauts sometimes guestimated their own chance as 1/3 or 50/50 and still went.\u003C/p\u003E\n"},{"CreatedByName":"Syphus","CreatedById":108765,"CreatedDateTime":"2014-04-18T00:31:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EHmmm... just where did that post say that it launched rockets? Or that it guaranteed anything to work? Or that we should \u0022scattershot\u0022? \u003Cp\u003EIn any case none of it had anything to do with the point the post was making. Which was that \u0022low risk\u0022 seems a bit of overvalued argument, in the overall debate, since humans can be quite prepared to accept somewhat high risks for things they believe in. Heck, look far enough and you\u0027ll find humans accepting a 100 percent risk of death for something. Apollo astronauts sometimes guestimated their own chance as 1/3 or 50/50 and still went.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHowever, this is risk in what is relatively to be accomplished. First, I\u0027d like to see a citation for the Apollo astronauts, with that said, even 33% is astronomically high compared to the sub-1% chance we\u0027re talking about here.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-18T07:36:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Syphus\u0022 data-cite=\u0022Syphus\u0022\u003E\u003Cdiv\u003EHowever, this is risk in what is relatively to be accomplished. First, I\u0027d like to see a citation for the Apollo astronauts, with that said, even 33% is astronomically high compared to the sub-1% chance we\u0027re talking about here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s mentioned in a nasa series \u0022when we left the earth\u0022. One of the astronauts mention that he believed there was a 1/3 chance the mission would go completely successfull. In another scene one of the wives of the astronauts mention how gene crantz (spelling?) assures her by saying he thinks there\u0027s a good 50/50 chance of them coming home. Not objective evaluations offcourse, but perceived risk...\u003C/p\u003E\u003Cp\u003EIn any case... I still think talking about risk to human lives is irrelevant this early in a debate about a manned trip to mars. We have no idea how the mission would work out yet, other than plans. Little to no technology demonstration hardware have been built and so on. Might as well be talking auto safety \u0022stars\u0022 on a concept car that only exists as drawings and a claymodel.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T07:41:17Z\u0022 title=\u002204/18/2014 07:41  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by 78stonewobble\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-18T09:23:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs a little side-note... I\u0027ve allways found the \u0022low risk\u0022 argument somewhat overrated. As far as I know most astronauts and potential volunteers are prepared to take risks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI meant risk in a general sense. Death of an astronaut is only one of many risks. Others include loss of science output, financial losses, impact on other projects, etc.\u003C/p\u003E\u003Cp\u003EIn general risks are assessed in terms of their likelihood and their impact. Unmanned missions are both less likely to fail and have a lower impact when they do. This makes them far cheaper and quicker, as failure can actually be tolerated. And that\u0027s why we don\u0027t send humans on exploration missions.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-18T09:31:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn any case... I still think talking about risk to human lives is irrelevant this early in a debate about a manned trip to mars. We have no idea how the mission would work out yet, other than plans. Little to no technology demonstration hardware have been built and so on. Might as well be talking auto safety \u0022stars\u0022 on a concept car that only exists as drawings and a claymodel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the perfect time to identify risks, since they define how to proceed (or if it indeed it is possible to proceed). Taking about risk is a routine engineering activity.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-18T11:47:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EI meant risk in a general sense. Death of an astronaut is only one of many risks. Others include loss of science output, financial losses, impact on other projects, etc.\u003Cp\u003EIn general risks are assessed in terms of their likelihood and their impact. Unmanned missions are both less likely to fail and have a lower impact when they do. This makes them far cheaper and quicker, as failure can actually be tolerated. And that\u0027s why we don\u0027t send humans on exploration missions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre they really that less likely to fail? I think about 2/3rds of the unmanned missions to mars have failed. Compaired this the execution of the apolloprogram which had a, in it\u0027s objective of landing on the moon, 1/7 failure rate.\u003C/p\u003E\u003Cp\u003EWhich would seem to suggest that the effort to human rate the hardware combined with human flexibility during a mission increases the likelyhood of success quite a bit. Even if it\u0027s more expensive and adds a risk to human lives, which is semi irrelevant, if the people going are prepared to to take risks of a certain size.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-18T11:57:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThat\u0027s the perfect time to identify risks, since they define how to proceed (or if it indeed it is possible to proceed). Taking about risk is a routine engineering activity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou cannot identify all risks or with any degree of accuracy calculate the risks from powerpoint presentations of paperprojects. \u003C/p\u003E\u003Cp\u003EIe. what is the risk of cancers for an astronaut flying to mars? Well that depends on how much radiation he\u0027s exposed to. Which is dependent on how much time is spent to fly there. Which is dependent on the type of propulsion. Also dependent on the makeup of the vehicle thats going to take him there. \u003C/p\u003E\u003Cp\u003EWe don\u0027t know what vehicle we want to use (because we haven\u0027t decided yet), or the type of propulsion (because we haven\u0027t decided yet) and thus we don\u0027t know how long it\u0027s gonna take to get there and thus we cannot, with any reasonably degree, calculate the risk. \u003C/p\u003E\u003Cp\u003EAgain... I say it\u0027s like trying to calculate the safety of a car thats nothing more than a concept drawing and a 100 things might be changed before it\u0027s going into production. And car safety is judged on production models (or their equivalent) afaik.\u003C/p\u003E\n"}]}