{"TopicId":43405,"ForumId":44,"TopicTitle":"Do gamma rays travel faster than visible light?","CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2013-08-21T20:46:18Z","PageNum":1,"Articles":[{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2013-08-21T20:46:18Z","Content":"\n\u003Cp\u003EI think that, since gamma rays have shorter wavelengths than visible light, that they would go faster than visible light.\u003C/p\u003E\u003Cp\u003ETell me what you think.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-21T20:48:13Z","Content":"\n\u003Cp\u003ENo. Light at any frequency propagates at exactly the same speed. The speed of light. In fact, any massless wave will propagate at that speed.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-08-21T21:03:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ENo. Light at any frequency propagates at exactly the same speed. The speed of light. In fact, any massless wave will propagate at that speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile we\u0027ve got your attention, K^2, I\u0027ve always been curious about neutrinos? They are known to precede super novas becoming visible in our sky by a day or so. Do they get emitted a day or so before the star explodes, or do they get here faster than photons because they are slightly faster than photons?\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-08-21T21:11:37Z","Content":"\n\u003Cp\u003ENeutrinos move slightly slower than Photons, not sure why the Neutrinos arrive sooner, haven\u0027t looked into that a lot.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-21T21:28:37Z","Content":"\n\u003Cp\u003EIn media, different light wavelengths do travel at different speeds, but I don\u0027t know how that applies to gamma rays. For visible wavelengths, though, shorter wavelengths in normal materials (like glass or water) mean \u003Cem\u003Eslower \u003C/em\u003Espeeds (i.e. blue light travels slower than red light.)\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-21T21:30:33Z","Content":"\n\u003Cp\u003EThe neutrino make less interaction than the light,wich is why is arriver sooner.\u003C/p\u003E\u003Cp\u003EIt\u0027s like having a race car that stop at each fuel station and an average car that goes to the same destination without stopping,the average car will arrive at destination sooner because it don\u0027t stop even if the race car can goes faster.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-20T15:09:51Z\u0022 title=\u002202/20/2015 03:09  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 20, 2015\u003C/time\u003E by goldenpeach\u003C/strong\u003E\n\u003Cbr\u003Evisiting my old posts, feeling the urge to fix some because I\u0026#039;m a maniac :P\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-21T21:31:18Z","Content":"\n\u003Cp\u003ENeutrinos definitely don\u0027t travel faster than light. We have experimental confirmation of that. Unfortunately, we don\u0027t have any experiment that definitely shows that they are slower. If we did, it would prove without any doubt that neutrinos are massive. We do not have such proof, but there is plethora of indirect evidence suggesting that they are not entirely massless. And that would, indeed, require them to move slightly slower.\u003C/p\u003E\u003Cp\u003EAs for why they arrive sooner, I always thought that was pretty clear. The spike in fusion certainly starts in the core of the star. Neutrinos escape the core without any hindrance, but all other radiation is re-absorbed into the star. Energy takes quite a while to propagate outwards, even as it builds up to the supernova scale. By the time the outer shells can be blown off by the supernova explosion, fusion has been going on for quite a while at an extreme rate producing the neutrinos that can be detected.\u003C/p\u003E\u003Cp\u003EIsn\u0027t it nice that we have means of detecting something like that a bit in advance, though? Not that a day buys you a lot of time to prepare for something like this if it happens in your immediate neighborhood.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EFor visible wavelengths, though, shorter wavelengths in normal materials (like glass or water) mean slower speeds (i.e. blue light travels slower than red light.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou got that backwards. In water and glass, red light travels slower. That\u0027s why it refracts more at the interface. But this has to do with both materials absorbing in IR. The closer you are to absorption, the slower the waves propagate. So this is far from general rule. There are materials and ranges where shorter wavelengths propagate slower.\u003C/p\u003E\u003Cp\u003EAs for gamma radiation, nothing really absorbs it all that much, so the speed of propagation in medium is going to be very close to speed of light. If there was anything that could slow it down significantly, we\u0027d have gamma ray optics and gamma ray lasers by now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-21T21:36:06Z\u0022 title=\u002208/21/2013 09:36  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 21, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bunsen","CreatedById":10598,"CreatedDateTime":"2013-08-21T21:42:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EWhile we\u0027ve got your attention, K^2, I\u0027ve always been curious about neutrinos? They are known to precede super novas becoming visible in our sky by a day or so. Do they get emitted a day or so before the star explodes, or do they get here faster than photons because they are slightly faster than photons?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey get emitted sooner. The big neutrino pulse is produced during the core\u0027s collapse, and those neutrinos zip right through the overlying layers of the star at light speed minus epsilon. Those layers are quite opaque to electromagnetic radiation, so we don\u0027t see a visual signature until a shock wave reaches the surface and heats it up a few hours later.\u003C/p\u003E\u003Cp\u003EFollow-up question, since K^2 showed up while I was checking that I had things right: is there a practically observable neutrino signal from type-1a supernovae? I\u0027m sure all that fusion precipitates tons of beta decay, but the only observation I\u0027ve heard of was SN1987A, which was a core collapse type where the temperatures get high enough for the weak force to poke its nose into thermal interactions.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-21T21:44:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EYou got that backwards. In water and glass, red light travels slower. That\u0027s why it refracts more at the interface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI beg to differ; blue light refracts more:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dispersive_Prism_Illustration_by_Spigget.jpg/1280px-Dispersive_Prism_Illustration_by_Spigget.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dispersive_Prism_Illustration_by_Spigget.jpg/1280px-Dispersive_Prism_Illustration_by_Spigget.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s a graph of refractive index vs. wavelengths near visible for several types of glass. (Higher refractive index = slower speed.)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Dispersion-curve.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Dispersion-curve.png\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-21T22:50:45Z","Content":"\n\u003Cp\u003EYeah, I got the actual refraction in visible band backwards. Sorry about that. It does reverse further into IR, though for reasons I\u0027ve specified. Looks like there is another absorption band in UV, however, which is what throws things off.\u003Ca href=\u0022https://t2.gstatic.com/images?q=tbn:ANd9GcT5iWi1_VRM-Uikf3t4Mc8YBXlHuCgl_S_7WLl5d5rgCYSE8Q-tNg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is pretty typical.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bunsen\u0022 data-cite=\u0022Bunsen\u0022\u003E\u003Cdiv\u003EFollow-up question, since K^2 showed up while I was checking that I had things right: is there a practically observable neutrino signal from type-1a supernovae? I\u0027m sure all that fusion precipitates tons of beta decay, but the only observation I\u0027ve heard of was SN1987A, which was a core collapse type where the temperatures get high enough for the weak force to poke its nose into thermal interactions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAstrophysics isn\u0027t my field. But basically, if you have stray neutrons flying about, you\u0027ll have plenty of captures resulting in beta decays. So I would imagine any sufficiently energetic event to produce neutrino bursts. I just have no idea where the boundary of \u0022sufficiently energetic\u0022 lie.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-21T22:57:16Z","Content":"\n\u003Cp\u003ESomewhat unrelated thing I ran across the other day. Supposedly the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Sun#Core\u0022 rel=\u0022external nofollow\u0022\u003Ecore of the sun\u003C/a\u003E is not so much energetic like a \u0027nuclear bomb\u0027 but rather a compost heap!? Does this sound right to you guys?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe power production by fusion in the core varies with distance from the solar center. At the center of the Sun, theoretical models estimate it to be approximately 276.5 watts/m3,[53] a power production density that more nearly approximates reptile metabolism than a thermonuclear bomb.[d] Peak power production in the Sun has been compared to the volumetric heats generated in an active compost heap. The tremendous power output of the Sun is not due to its high power per volume, but instead due to its large size.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-08-21T23:16:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EWhile we\u0027ve got your attention, K^2, I\u0027ve always been curious about neutrinos? They are known to precede super novas becoming visible in our sky by a day or so. Do they get emitted a day or so before the star explodes, or do they get here faster than photons because they are slightly faster than photons?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA quick arXiv search turned up \u003Ca href=\u0022http://arxiv.org/abs/1212.6131\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, which is a good overview of the state of core collapse supernova modelling. Basically, the visible explosion is the very \u003Cem\u003Elast\u003C/em\u003E thing to happen during a core collapse supernova (the explosion is candidate for being the loudest known sound in the Universe), and carries only about 1% of the total energy of the event. We see the neutrinos first because the neutrinos are created in the core and propogate away mostly unimpeded by the matter in the star. The visible portion of the explosion occurs after the shockwave has blown the star apart, and comes from the thermal spectrum of the shock-heated gases as they expand post-explosion. Basically, the neutrino pulse is the actual signal from the explosion, and the visible supernova is the thermal afterglow from the expanding fireball (which reaches maximum brightness well after the explosion due to the relationship between brightness as a functions of temperature and surface area).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-21T23:20:12Z\u0022 title=\u002208/21/2013 11:20  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 21, 2013\u003C/time\u003E by Stochasty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-08-22T06:24:55Z","Content":"\n\u003Cp\u003EThanks guys for the answers. I had read about how an increased neutrino flux can precede visible supernovae, but I just never gave it very much thought until this thread inspired me to ask the question.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-08-22T09:14:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003ENeutrinos move slightly slower than Photons, not sure why the Neutrinos arrive sooner, haven\u0027t looked into that a lot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethey get ejected in the final precursor stages to the nova event, not during it. \u003C/p\u003E\u003Cp\u003ESo if the neutrinos get sent out at 99.9% of light speed but say a thousand years (in stellar lifetimes that\u0027s nothing) earlier, it\u0027d take the radiation from the nova still long enough to catch up that it arrives after the nova depending on distance.\u003C/p\u003E\u003Cp\u003EIOW you can\u0027t conclude that just because they arrive sooner than light they were traveling faster than light. They may just have left before rush hour, beating the crowd \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2013-08-22T17:27:18Z","Content":"\n\u003Cp\u003EI read that there are some theoretically predicted quantum mechanic interactions between very high energy gamma ray photons and vacuum. High energy gammas should be slower. However, there is no experimental evidence of that kind of interaction and for every practical purpose we can assume that all electromagnetic radiation has constant speed in vacuum.\u003C/p\u003E\u003Cp\u003EAt least type Ia and core collapse supernovas are actually huge neutrino bursts. Most of the energy is released with neutrinos and electromagnetic effects are just faint shadow of explosions mighty but invisible power. That energy may be on the order of solar mass by using E=mc^2 relation in large core collapse supernova. Supernova even in nearby galaxies causes clear peak in neutrino detectors everywhere in the world.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2013-08-22T17:42:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Ethey get ejected in the final precursor stages to the nova event, not during it. \u003Cp\u003ESo if the neutrinos get sent out at 99.9% of light speed but say a thousand years (in stellar lifetimes that\u0027s nothing) earlier, it\u0027d take the radiation from the nova still long enough to catch up that it arrives after the nova depending on distance.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeutrinos\u0027 speed has much more nines after decimal point. Difference between them and lightspeed has not been measured. Couple of months ago researchers measured that they travel few thousands of kilometers some tens of nanoseconds faster than light. They found a fault in their equipment that explained strange result, but I think that they could not show smaller speed. \u003C/p\u003E\u003Cp\u003EThere are several types of supernovas. What of them you mean? At least types 1a, in which white dwarf gathers material from nearby giant binary star and collapses to neutron star and core collapse supernovas (in which massive star\u0027s core loses it ability to produce radiation pressure after they run out of fusionable elements) are very short transitions from normal (degenerate) material to neutron star. Collapsing takes seconds and that is main neutron burst\u0027s length too. Then it takes hours before shock waves go through large layers of star\u0027s mass, heat surface and give the first visible signal.\u003C/p\u003E\n"},{"CreatedByName":"Stratoroc","CreatedById":73987,"CreatedDateTime":"2013-08-22T17:47:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003ESomewhat unrelated thing I ran across the other day. Supposedly the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Sun#Core\u0022 rel=\u0022external nofollow\u0022\u003Ecore of the sun\u003C/a\u003E is not so much energetic like a \u0027nuclear bomb\u0027 but rather a compost heap!? Does this sound right to you guys?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has to do with the core being so hot that nearly all of the H to He fusion is reversible. For almost each fusion there is a fission reaction as well, so the net energy release is fairly small. Don\u0027t ask me what happens in the near-surface layers of the sun where the temperatures are greatest.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2013-08-22T18:15:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003ESomewhat unrelated thing I ran across the other day. Supposedly the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Sun#Core\u0022 rel=\u0022external nofollow\u0022\u003Ecore of the sun\u003C/a\u003E is not so much energetic like a \u0027nuclear bomb\u0027 but rather a compost heap!? Does this sound right to you guys?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is right, if you talk about density of energy production. Sun produces energy mainly through proton-proton nuclear reaction cycle. It has part reaction H \u002B H -\u0026gt; D \u002B positron \u002B neutrino which is extremely improbable even in sun\u0027s core. Therefore energy production per kg or m^3 is less than in human body. Surface area is proportional to size\u0027s square but volume is proportional in size\u0027s cube. Therefore the huge sun has very small surface area per volume ratio compared to human and it must be extremely hot to first transport all energy from huge volume to \u0022small\u0022 surface and then radiate it to space.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2013-08-22T18:25:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stratoroc\u0022 data-cite=\u0022Stratoroc\u0022\u003E\u003Cdiv\u003EThis has to do with the core being so hot that nearly all of the H to He fusion is reversible. For almost each fusion there is a fission reaction as well, so the net energy release is fairly small. Don\u0027t ask me what happens in the near-surface layers of the sun where the temperatures are greatest.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe4 is very stable nucleus and it\u0027s fission is not important reaction in sun. Light hydrogen\u0027s fusion is just extremely improbable and slow process. That reaction has never detected in laboratories. However, reverse fusions happen in core collapse supernova and may have some effect in that process. Energy for fissions comes from gravitational potential energy on star core. It breaks in seconds everything than star has fusioned in millions of years and finally smashes protons, neutrons, electrons, nuclei etc. to superdense neutron mass and releases extreme burst of neutrinos.\u003C/p\u003E\n"},{"CreatedByName":"RIDGExRUNNER","CreatedById":169467,"CreatedDateTime":"2016-09-27T19:02:45Z","Content":"\n\u003Cp\u003E\nDon\u0027t terrestrial bursts prove that gamma rays travel faster than light? \n\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2016-09-27T19:06:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222776772\u0022 data-ipsquote-contentid=\u002243405\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475002965\u0022 data-ipsquote-userid=\u0022169467\u0022 data-ipsquote-username=\u0022RIDGExRUNNER\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, RIDGExRUNNER said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDon\u0027t terrestrial bursts prove that gamma rays travel faster than light? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo.\n\u003C/p\u003E\n"}]}