{"TopicId":43594,"ForumId":29,"TopicTitle":"What happens when you change to map view / planetarium","CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-23T09:54:18Z","PageNum":1,"Articles":[{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-23T09:54:18Z","Content":"\n\u003Cp\u003EI am struggling a bit to understand what is going on when the game flips to map view while in flight, in terms of the rendering etc. Are there two scenes set up, and different cameras areturned on and off? Do all the gameobjects that make up the craft still exist while we are looking at the map? Do the cameras all still exist? What does the game do to the cameras and objects when you move between the two?\u003C/p\u003E\u003Cp\u003EMy problem is that I have added an extra camera while in flight, which works as I want it to, but when I change to map view and back again it is not rendering the things I want it to. I have tried to check to see if my new camera has been somehow disabled, bu I am not having much luck. Does anyone have a full understanding of what all the different cameras are in stock, and what they are used for and how they are turned on and off?\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2013-08-25T11:54:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022codepoet\u0022 data-cite=\u0022codepoet\u0022\u003E\u003Cdiv\u003EDoes anyone have a full understanding of what all the different cameras are in stock, and what they are used for and how they are turned on and off?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid I don\u0027t have a complete understanding, but somethings I do know. objects in mapView are positioned in ScaledSpace and there are in fact different cameras used. For the flight GUI, there\u0027s also a third camera as far as I\u0027ve been able to discern.\u003C/p\u003E\u003Cp\u003EThe three cameras you\u0027re looking for are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFlightCamera.fetch.mainCamera;\u003Cbr\u003EScaledCamera.Instance.camera;\u003Cbr\u003EScreenSafeUI.referenceCam;\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhether ScaledSpace is actually a whole other scene, I don\u0027t know. Others might be of more use to you there.\u003C/p\u003E\u003Cp\u003EMaybe you\u0027ll be able to gleam the rest of your answers from the source of the hullcam mod.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-25T12:25:03Z","Content":"\n\u003Cp\u003EThanks, that is really helpful. I was using Camera.main as a reference the location of my new camera, which works to start with, but once you have moved to mapview and back, it seems to have changed to be a different camera (hence my new camera ends up in the wrong place pointing in the wrong direction!) Using FlightCamera.fetch.mainCamera (well I have not tested that yet, but it sounds promising, I have tested with FlightCamera.fetch.cameras[0]) seems to have solved my problem.\u003C/p\u003E\n"}]}