{"TopicId":43629,"ForumId":34,"TopicTitle":"MechJeb 2 - Patch test bed release (October 10)","CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-08-23T18:12:29Z","PageNum":3,"Articles":[{"CreatedByName":"Ratzap","CreatedById":75982,"CreatedDateTime":"2013-08-25T21:33:40Z","Content":"\n\u003Cp\u003EFAR complicates things for the ascent too since the gravity turn too low causes a ton of drag on one side of the payload and over she goes.\u003C/p\u003E\u003Cp\u003EI can also confirm the hovering bug with the landing autopilot. I\u0027m trying to land on Pol, it has the 2nd lowest gravity in KSP and even with very small engines the TWR is 12 or so. The latest MJ build just hovers at the final descent stage trying to get to 0m. At one point it was down to 16mm but it just kept on hovering and trying to get closer - only succeeding in pushing itself further away. I ended up repeating the landing then switching MJ off at the final descent and putting it down myself.\u003C/p\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2013-08-25T21:40:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hesh\u0022 data-cite=\u0022Hesh\u0022\u003E\u003Cdiv\u003EAs it says in the quote, if I close KSP, delete the .cfg file, and start it up again it seems to \u0022fix it\u0022 but anyone with more than a few mods and more than a couple flights in the air at a time knows this is a tedious process.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis fixed by problem as well. Trying to dock 2 station components together since the update, it wanted to bring them together at a 90 deg angle. Deleting the files solved that problem.\u003C/p\u003E\n"},{"CreatedByName":"viperwolf","CreatedById":66190,"CreatedDateTime":"2013-08-26T00:18:24Z","Content":"\n\u003Cp\u003ESarbian \u003C/p\u003E\u003Cp\u003EI had to re install the old MJ unit craft file and just use your plugin. So the rover guidiance would work properly. because for some reason the MJ will not do this correctly unless it has control. without MJ being in control of the craft, the speed will not work , it just keeps increasing in speed. I needed the rover guidance for speed control and direction\u003C/p\u003E\n"},{"CreatedByName":"Revencher","CreatedById":8959,"CreatedDateTime":"2013-08-26T05:23:12Z","Content":"\n\u003Cp\u003Enot sure what i am suppose to do with this \u003Ca href=\u0022https://raw.github.com/sarbian/MechJ...AR202/part.cfg?\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://raw.github.com/sarbian/MechJ...AR202/part.cfg?\u003C/a\u003E im i suppose to copy and paste to the old cfg file? or do i make a new one? if so how do i make a cfg? file?\u003C/p\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2013-08-26T05:57:02Z","Content":"\n\u003Cp\u003EAscent rendezvous doesn\u0027t seem to work properly any longer. Not sure when it stopped working right - I think it was working with sarbian\u0027s last patch before he started this thread. Basically it times the launch to when the target craft is directly overhead - it doesn\u0027t factor in the time to achieve orbit.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-08-26T06:17:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Revencher\u0022 data-cite=\u0022Revencher\u0022\u003E\u003Cdiv\u003Enot sure what i am suppose to do with this \u003Ca href=\u0022https://raw.github.com/sarbian/MechJ...AR202/part.cfg?\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://raw.github.com/sarbian/MechJ...AR202/part.cfg?\u003C/a\u003E im i suppose to copy and paste to the old cfg file? or do i make a new one? if so how do i make a cfg? file?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EReally don\u0027t know how to make a new file on your computer? Huh...\u003C/p\u003E\u003Cp\u003EJust copy the new one into the KSP_win\\GameData\\MechJeb2\\Parts\\MechJeb2_AR202 folder, if it asks if you want to overwrite, you DO.\u003C/p\u003E\u003Cp\u003EFreddy\u0027s your uncle, Fannie\u0027s your aunt.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-08-26T06:22:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnsonwax\u0022 data-cite=\u0022johnsonwax\u0022\u003E\u003Cdiv\u003EAscent rendezvous doesn\u0027t seem to work properly any longer. Not sure when it stopped working right - I think it was working with sarbian\u0027s last patch before he started this thread. Basically it times the launch to when the target craft is directly overhead - it doesn\u0027t factor in the time to achieve orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly I\u0027ve never had that work properly for me. It puts my launch in the proper ballpark but I\u0027ve always had to play with my ascent parameters to actually get close to it and I\u0027ve never really done a proper rendezvous with just a launch...\u003C/p\u003E\u003Cp\u003EEdit: And I\u0027ve been using MJ2 since pre-Aprilish...?\u003C/p\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2013-08-26T06:27:37Z","Content":"\n\u003Cp\u003EIt worked pretty well before. It\u0027d rendezvous between a few hundred meters and maybe 5km - which is fine as a range. I\u0027d say 1/3-1/2 the time it\u0027d rendezvous within physics range. Once it came in at 200m - and that was with a 150t payload. Now it\u0027s off by 80-100km which requires quite a bit of rendezvous work.\u003C/p\u003E\u003Cp\u003EAnother request is to change the KSP landing location from the launch pad to the middle of the runway. Deorbited one of my engines on the roof of the VAB, which was actually quite cool, but unlikely to be what the engineers would have preferred.\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2013-08-26T06:35:29Z","Content":"\n\u003Cp\u003EWoo Hoo docking fixed and landings 15m from target instead of 200 - 500m thank you very much\u003C/p\u003E\n"},{"CreatedByName":"Radam","CreatedById":79910,"CreatedDateTime":"2013-08-26T08:08:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Virtualgenius\u0022 data-cite=\u0022Virtualgenius\u0022\u003E\u003Cdiv\u003EWoo Hoo docking fixed and landings 15m from target instead of 200 - 500m thank you very much\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it is absolutely wonderfull that it avtomatically lands precisely on the pad. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut in my oppinion that precise landing should be toggable. As it tends to start burning at a few kilometers, hover, go sideways to the correct position and then just get stuck. If one disables it and enables \u0022land anywhere\u0022 it lands as usuall. \u003C/p\u003E\u003Cp\u003EAlso when under autopilot it doesnt want to go more than warp 1 for the whole descent (kerbin) and if one does toggle higher warp, it imediately turns it down and starts adjusting descent.\u003C/p\u003E\u003Cp\u003EUnrelated to recent release, Mechjeb doesnt read thrust of the turbojets right. It just takes max power and goes with it. That would probably require it reading current thrust from the part itself... And subsequently it also shows current acceleration and max acceleration of the craft incorrectly when using jets or turbojets.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-08-26T08:26:27Z","Content":"\n\u003Cp\u003E...and here\u0027s another problem. Apparently MJ had it for months, but only today I finally discovered the specific bug trigger I can report.\u003C/p\u003E\u003Cp\u003EIf a custom window has an item \u0022Time to impact\u0022, flying very close to the ground, bouncing on the ground, driving over the ground can cause the window contents to suddenly disappear entirely and only reappear when you are no longer landed. The blanked-out-window results in significant extra framerate losses while it is blanked out.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-08-26T11:23:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EIn the current version, the \u0022Use SAS when available\u0022 option is gone, but node autopilot will still lock up attempting to turn when SAS is enabled -- i.e. it won\u0027t disable SAS by itself, and it still won\u0027t kick SmartASS into auto mode either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI went overboard when removing the ASAS control. MJ need to disable it when it take control, but I am not sure it should enable it back after.\u003C/p\u003E\u003Cp\u003EFor the ASAS not switching in AUTO mode I can\u0027t duplicate this each time, but I saw it append. Do you have a way to trigger it each time ?\u003C/p\u003E\u003Cp\u003EThe \u0022Time to impact\u0022 problem is most likely some NaN. Is there anything in the log ?\u003C/p\u003E\u003Cp\u003EFor those who fly with FAR MJ2 won\u0027t be as precise while in the atmo. I looked into adding some specific code, but FAR current code does not allow to get some value easily. It\u0027s on my list since I like flying with FAR, but I\u0027d rather fix bugs before.\u003C/p\u003E\u003Cp\u003EFor the \u0022MJ can\u0027t handle a launch without spinning out of control sideways within meters in spite of the control part being correctly aligned\u0022 I\u0027ll need a ship file of save file to look into it. \u003C/p\u003E\u003Cp\u003E@Payload : About the ascent autopilot. Do you have info on \u0022optimal\u0022 ascent profile ? What would you change (keeping it simple) ?\u003C/p\u003E\u003Cp\u003Ejohnsonwax \u0026amp; sojourner : So after it has enough velocity to get to the periapsis it should stay prograde until the circularisation burn ?\u003C/p\u003E\u003Cp\u003Ejohnsonwax if you have a ship I can test ...\u003C/p\u003E\u003Cp\u003EAbout the landing AP : I ll look into it more this week.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2013-08-26T11:55:49Z","Content":"\n\u003Cp\u003EIs there a known issue with MJ mis-reporting DV with asparagus staging? After upgrading the .dll on Saturday, my standard multi-mission launcher gives me 0 DV for the stage after the asparagus stage drops off, even though there\u0027s a full tank of fuel. I\u0027ve also noticed that SRBs cause this issue as well. I haven\u0027t tried Engineer so I don\u0027t know if it\u0027s a .craft issue...just wanted to check to see before I ripped apart my launcher to see if there\u0027s a staging bug coming out of the VAB (although it flies just fine.)\u003C/p\u003E\u003Cp\u003EI\u0027d post my craft file but I have a number of custom parts that I\u0027d have to dump .cfgs out for so it would be messy.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-08-26T11:58:57Z","Content":"\n\u003Cp\u003EThere is an issue with docking port. Someone made a patch and I need to include it. Check with Engineer anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hesh","CreatedById":80240,"CreatedDateTime":"2013-08-26T12:23:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFor the \u0022MJ can\u0027t handle a launch without spinning out of control sideways within meters in spite of the control part being correctly aligned\u0022 I\u0027ll need a ship file of save file to look into it. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDeleting the mechjeb global cfg seems to have fixed it more permanently, if the problem returns I\u0027ll post a save file.\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2013-08-26T12:28:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003Ejohnsonwax \u0026amp; sojourner : So after it has enough velocity to get to the periapsis it should stay prograde until the circularisation burn ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe current behavior (I do not have the latest update, just your previous patch) is preferable - stay prograde until the ship clears atmo, and then plot the circularization burn and rotate towards the node, and *then* warp. The previous version of MechJeb (1.x?) stayed prograde until apoapsis, and then it failed to circularize because the craft takes too long to rotate to the correct direction. I don\u0027t want to have to spam monopropellant and RCS on launch stages just to handle that one maneuver. That\u0027s my opinion.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2013-08-26T12:30:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EThere is an issue with docking port. Someone made a patch and I need to include it. Check with Engineer anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill do, thank you sir.\u003C/p\u003E\n"},{"CreatedByName":"synik4l","CreatedById":76492,"CreatedDateTime":"2013-08-26T13:40:07Z","Content":"\n\u003Cp\u003EIm having one issue with the ascent autopilot. At times on the launch pad.When I hit enable autopilot. Usually you would expect it to goto 100%. Instead it bounces like crazy around 40% throttle. Usually I just reset the launch a couple times and finally it wont do it....Or I launch it myself. Then enable it once in the air at full throttle. It works fine like that. Just makes it alot harder for me to get a timed launch to work. This may be a combination of my mods but im not sure. If needed I can get you a save file later.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2013-08-26T14:36:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003EThe current behavior (I do not have the latest update, just your previous patch) is preferable - stay prograde until the ship clears atmo, and then plot the circularization burn and rotate towards the node, and *then* warp. The previous version of MechJeb (1.x?) stayed prograde until apoapsis, and then it failed to circularize because the craft takes too long to rotate to the correct direction. I don\u0027t want to have to spam monopropellant and RCS on launch stages just to handle that one maneuver. That\u0027s my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with this assessment. This is the correct action as I see it. If your ship is fast/agile enough, then the old way is fine. If it isn\u0027t, then you are SOL.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@Payload : About the ascent autopilot. Do you have info on \u0022optimal\u0022 ascent profile ? What would you change (keeping it simple) ?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurrently getting the very best out of the auto pilot requires supervision. It is also very difficult/impossible to do hands off space plane orbiting. The problem is the constant best fit angle and single acceleration target.\u003C/p\u003E\u003Cp\u003EConsider the following as a crude example.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WPIpSGf.jpg\u0022 alt=\u0022WPIpSGf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf we could click on the picture and add POIs at determined altitudes, we could then set a target angle and target acceleration and an action group or groups to be executed when we reach that target altitude.\u003C/p\u003E\u003Cp\u003EDifferent systems have different flight parameters as can be seen through the differences in High TWR Rockets and low ones or Rockets VS Spaceplanes.\u003C/p\u003E\u003Cp\u003EWith a system similar to this we could literally fly anything, hands off, into space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T14:50:28Z\u0022 title=\u002208/26/2013 02:50  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by Payload\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Radam","CreatedById":79910,"CreatedDateTime":"2013-08-26T14:54:35Z","Content":"\n\u003Cp\u003EHow is the path calculated anyway? Rough estimate at least, and I think it is altitude/downrange type right?\u003C/p\u003E\u003Cp\u003EI used logomatic to dump data into excel and tried a few shallow acsents with mechjeb and tubojets. And in altitude/surface velocity graph looks like this: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MDf0bgZ.jpg\u0022 alt=\u0022MDf0bgZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll turns started at 8km ending at 70 and different turn grades. \u003C/p\u003E\u003Cp\u003EVery qurious.\u003C/p\u003E\u003Cp\u003EIs a gravity turn such a straight line in this type of representation? Or does mechjeb calculate how fast it should be going at ceirtain altitude?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T15:03:05Z\u0022 title=\u002208/26/2013 03:03  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by Radam\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2013-08-26T15:05:35Z","Content":"\n\u003Cp\u003ERadam, did you have corrective steering enabled?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-08-26T15:44:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Radam\u0022 data-cite=\u0022Radam\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIs a gravity turn such a straight line in this type of representation? Or does mechjeb calculate how fast it should be going at ceirtain altitude?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know that it checks speed but it does check altitude. If you\u0027re at a certain point in your flight path (if you have corrective flight enabled) and you\u0027re too low then it will pull up more steeply to compensate. Last night I realized I had not staged some empty boosters and the dead weight was holding me back. MJ2 tried to compensate by pulling into a steeper climb. As soon as I shed the dead tanks it pulled up until it had the ship back on track.\u003C/p\u003E\u003Cp\u003EBasically if there\u0027s any deviation from the flight path it will try to fix the problem. If the option is enabled.\u003C/p\u003E\n"},{"CreatedByName":"Radam","CreatedById":79910,"CreatedDateTime":"2013-08-26T15:47:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Payload\u0022 data-cite=\u0022Payload\u0022\u003E\u003Cdiv\u003ERadam, did you have corrective steering enabled?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did, but it does go lower without it.\u003C/p\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2013-08-26T15:56:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003EThe current behavior (I do not have the latest update, just your previous patch) is preferable - stay prograde until the ship clears atmo, and then plot the circularization burn and rotate towards the node, and *then* warp. The previous version of MechJeb (1.x?) stayed prograde until apoapsis, and then it failed to circularize because the craft takes too long to rotate to the correct direction. I don\u0027t want to have to spam monopropellant and RCS on launch stages just to handle that one maneuver. That\u0027s my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. Though out of atmos it turns prograde relative to the maneuver node, while in atmos it should just point prograde relative to its current position - as if you hit the prograde button in SmartASS. In fact I would have it do precisely that.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-08-26T16:16:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnsonwax\u0022 data-cite=\u0022johnsonwax\u0022\u003E\u003Cdiv\u003EI agree. Though out of atmos it turns prograde relative to the maneuver node, while in atmos it should just point prograde relative to its current position - as if you hit the prograde button in SmartASS. In fact I would have it do precisely that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what it WOULD do unless there\u0027s a maneuver node. At which point it\u0027s already cut engines so it\u0027s time to start turning to face the node. The proposed behavior is just to keep it steady until the circularization has been plotted.\u003C/p\u003E\n"}]}