{"TopicId":4362,"ForumId":15,"TopicTitle":"Doing things... The hard way.","CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2011-12-06T17:21:47Z","PageNum":1,"Articles":[{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2011-12-06T17:21:47Z","Content":"\n\u003Cp\u003EWell, I decided I needed to learn how to model properly in Blender. I have been using it for years for video editing. I have never used it for this purpose so a few of the controls are new to me.\u003C/p\u003E\u003Cp\u003EI have made 3 models (that work) in the last 2 days.\u003C/p\u003E\u003Cp\u003EI have been unable to smooth an object properly without its size being changed by around 10%. I suspect this is normal but I was wondering if there was a more elegant solution other than just making the part slightly larger and hoping it will turn out properly.\u003C/p\u003E\u003Cp\u003EBelieve it or not, I have actually had no trouble with texturing, yet.\u003C/p\u003E\u003Cp\u003EMy major problems are node placement. I have yet to find a definitive way to tell what the extents of the model are in blender. So making collider meshes is not really a precision affair and requires some trial and error for me currently. Of course, just doing a tank is easy because your collider comes out in the right place every time defacto. When I start with a more complex part, it gets tricky. For some stupid reason I am unable to translate a part on one axis in Blender. Even If I just use the keyboard. It always turns out requiring manual centering afterwards and picking the size is somewhat of a \u003Cem\u003Eguess at it until it looks\u003C/em\u003E right deal.\u003C/p\u003E\u003Cp\u003EYou guys have any tricks for me that can make this easier? The biggest problem currently is not knowing the extents of the model for my node placement in the CFG. I just use values that get me close and adjust manually which takes a lot of time. As a result, the nodes are not exactly perfectly placed.\u003C/p\u003E\u003Cp\u003ESo far, I have only actually vertex smoothed one part in a test trial and I used the modifier with the Z axis unselected.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2011-12-06T18:11:51Z","Content":"\n\u003Cp\u003EAre you trying to just smooth the faces, or take a cube and deform it into a rounded mesh?\u003C/p\u003E\u003Cp\u003EFor smoothing something already modeled, the best bet is using a Modifier -\u0026gt; Edge Split - that sections in the model into parts with any angle over 30 degrees (by default) as boundary lines - you can also manually mark any edges that are rims or \u0027outlining\u0027 a face you want shaded separately with \u0027mark sharp\u0027 to help.\u003C/p\u003E\u003Cp\u003ETo do precision translation (G), Rotation ® and Scaling (S) on a single axis, hit the hotkey, then X, Y, or Z to select the axis you want. At this point you can use the mouse, or you can type in a precise unit to move it - to move half a meter on the negative X axis, hit G -\u0026gt; X -\u0026gt; -0.5\u003C/p\u003E\u003Cp\u003EI havent figured out if you can lock in 2 axes yet and only scale on those - it would be helpful.\u003C/p\u003E\u003Cp\u003ENode placement is sadly just trial and error for blender, if you aren\\\u0027t working with a simple object like a cube or cylinder - the getvector tool is only for 3DS Max sadly.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2011-12-06T18:34:56Z","Content":"\n\u003Cp\u003EI scale on two axises by using face select mode and then hitting S. That only scales the face on the flat axis. Edge mode allows you to place and scale subdivisions on one section and not the whole part. That is helpful. \u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-12-06T18:53:11Z","Content":"\n\u003Cp\u003EJust be careful. We are talking about 3D here. There is like 7 different types of \u0027smoothing\u0027 you can do. ;P\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2011-12-08T05:18:55Z","Content":"\n\u003Cp\u003EBooya! \u003Ca href=\u0022http://www.macouno.com/2010/03/17/caliper/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.macouno.com/2010/03/17/caliper/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is a blender caliper script. This Converts Blender units into real units. How much that will help I don\\\u0027t know. Can make Face-Face measurements. At least that is what it says. It\\\u0027s also free so the price is right.\u003C/p\u003E\u003Cp\u003ENow to figure out how to use it. 8)\u003C/p\u003E\u003Cp\u003ENow does the KSP use real units is the question. Hate to have to do a double conversion. That is almost as bad as winging it.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2011-12-08T05:37:24Z","Content":"\n\u003Cp\u003Eit does - there is a config setting for scale - 1.0 means you work in meters in blender; 0.1 is what the default parts are set to, which can be tricky to do in blender.\u003C/p\u003E\n"}]}