{"TopicId":43665,"ForumId":25,"TopicTitle":"We do it because it is hard... the Eeloo Challenge","CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-24T01:07:12Z","PageNum":1,"Articles":[{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-24T01:07:12Z","Content":"\n\u003Cp\u003EMy first challenge and I figured I would make it a big one.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEeloo or Bust\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe actual challenge is easy while requiring a lot of work to complete. Get to Eeloo. That\u0027s it. Take a Kerbal to Eeloo. This is a chance to max out your challenge meter with all the mods you love to play, or the complete lack of them. Launching a mission with the best plan you can get together on your favorite save. This is a chance to show off all the prep work you have put in. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/e/e0/TinyEeloo.png/270px-TinyEeloo.png\u0022 alt=\u0022270px-TinyEeloo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Eeloo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Eeloo\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EThe Rules\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEven simpler.\u003C/p\u003E\u003Cp\u003E1. Can\u0027t use Hyperedit, ORDA, debug... anything that auto alters cfg\u0027s, changes the physics and the like.\u003C/p\u003E\u003Cp\u003E2. Use everything else. This is a challenge to do with your favorite save with all your favorite add on\u0027s. All your orbital stations, prebuilt rocket designs, barely flyable spaceplanes, MechJeb, Kams, Kat, and maneuver nodes.\u003C/p\u003E\u003Cp\u003E3. You can take as many vehikles as you like in any configuration, but their can be only one manned flight for landing on Eeloo. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003ESIGN UPs\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe few, the proud, the modless - The list for those souls who love the Stock Game.\u003C/p\u003E\u003Cp\u003E1. Mesklin - 1480\u003C/p\u003E\u003Cp\u003E2. Death Engineering - 880\u003C/p\u003E\u003Cp\u003E3.bothersome - 655 \u002B 50 (100 per doing it - 50 for needing it) Rescue Mission bonus = 705\u003C/p\u003E\u003Cp\u003E4.Blue -612\u003C/p\u003E\u003Cp\u003E5.Stochasty - 425\u003C/p\u003E\u003Cp\u003E6.YarTheBug - 375\u003C/p\u003E\u003Cp\u003EThe Technocracy - The not modless\u003C/p\u003E\u003Cp\u003E1.Hejnfelt - 12745 (that is Alot of kerbals)\u003C/p\u003E\u003Cp\u003E2.YarTheBug - 2160 (First to do Fries with that achievment) \u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003EPoints.\u003C/p\u003E\u003Cp\u003EParty in the house - 50 pts per Kerbal landed alive on Eeloo\u003C/p\u003E\u003Cp\u003EMission control - 50 pts as part of the mission you deploy a space station in the Eeloo system from your primary vehikle. Mission control must have communication gear, some refueling ability and docking facilities. (This can include KAS systems)\u003C/p\u003E\u003Cp\u003EThere and back again - 50 pts per kerbal returned alive to Kerbin\u003C/p\u003E\u003Cp\u003EJust visiting - 25 pts per station docked (or KAS\u0027ed) to on the way out and back for refueling and such\u003C/p\u003E\u003Cp\u003ESeeing the sites - 25 pts take a rover with you and land it on Eeloo.\u003C/p\u003E\u003Cp\u003ELast years model - 100 pts. All Stock mission. \u003C/p\u003E\u003Cp\u003EWe\u0027re here... now what - 20 pts per mission expansion. For every things you bring with you to do while on Eeloo. This can be Kethane, Extraplanetary, solar farming, mining, fuel recycling, probe deployment, whatever. Point on the part on the ship prelaunch and a pic of the deployment in the Eeloo system. \u003C/p\u003E\u003Cp\u003ETab \u0027A\u0027 into slot \u0027B\u0027 - 25 pts per segment lifted from Kerbin for orbital construction. Complexity in mission craft should be rewarded.\u003C/p\u003E\u003Cp\u003EWant fries with that - 50 pts per fed Kerbal. Using the Duna Permanent settlement mission platform, take along representations of consumables like food and extra air. Each kerbal in the mission needs 3.1 kilos of consumables per day per kerbal or to make it easier 1 tonne equals 3 Kerbals for 100 days. \u003C/p\u003E\u003Cp\u003EConvoy - 25 pts per vehikle in the full mission profile. You don\u0027t have to have all the goods on your primary ship, only the kerbals need to travel together. Mission convoy ships all need to arrive before the kerbals prime ship.\u003C/p\u003E\u003Cp\u003ECan you hear me now? - 20 pts per satellite. Launch commsats in orbit around Eeloo. Each inclination must differ by at least 10 degrees. Full coverage bonus for getting 4 satellites up of 25 pts.\u003C/p\u003E\u003Cp\u003ECorrelian YT-1300 - 50 pts. For each vehikle constructed and launched from any celestial other than Kerbin. These can be Extraplanetary Launch vehikles or ships put together on another world with docking ports and careful piloting. \u003C/p\u003E\u003Cp\u003EAny other rules, suggestions and awards are welcome.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-13T23:55:26Z\u0022 title=\u002209/13/2013 11:55  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 13, 2013\u003C/time\u003E by alacrity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-08-25T17:02:17Z","Content":"\n\u003Cp\u003EOK, I\u0027m done with this mission... I put it in a seperate document because it\u0027s picture heavy and it tells more story than just completing the mission. Someone might learn something from it if they are interested in such things.\u003C/p\u003E\u003Cp\u003E\u0026gt;\u0026gt;\u0026gt; \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/54171727/KSP/Mission%20to%20Eeloo.html\u0022 rel=\u0022external nofollow\u0022\u003EEeloo Mission Log\u003C/a\u003E \u0026lt;\u0026lt;\u0026lt;\u003C/p\u003E\u003Cp\u003ELet\u0027s see,...\u003C/p\u003E\u003Cp\u003EParty in the house - 50 pts per Kerbal landed alive on Eeloo - 2 Kerbals, 100 pts.\u003C/p\u003E\u003Cp\u003EThere and back again - 50 pts per kerbal returned alive to Kerbin - 4 Kerbals (I know, 4 didn\u0027t actually set foot on Eeloo, but they did go there and return, it didn\u0027t say had to land) - 200 pts.\u003C/p\u003E\u003Cp\u003ESeeing the sites - 25 pts take a rover with you and land it on Eeloo. - Rovered around 25 pts.\u003C/p\u003E\u003Cp\u003ELast years model - 100 pts. All Stock mission. - Yep 100% stock on all craft used. - 100 pts.\u003C/p\u003E\u003Cp\u003ETab \u0027A\u0027 into slot \u0027B\u0027 - 25 pts per segment lifted from Kerbin for orbital construction. - Let\u0027s see, 4 satellites and one rover (I guess the main ship is not counted) - 125 pts.\u003C/p\u003E\u003Cp\u003ECan you hear me now? - 20 pts per satellite. Launch commsats in orbit around Eeloo. Each inclination must differ by at least 10 degrees. Full coverage bonus for getting 4 satellites up of 25 pts. - Yep 4 sats with more than 10 degree offsets - 80 \u002B 25 = 105 pts.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EMy Total = 655 points.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EComments welcome.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T23:15:25Z\u0022 title=\u002208/25/2013 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by Bothersome\u003C/strong\u003E\n\u003Cbr\u003Eupdated score\n\u003C/span\u003E\n"},{"CreatedByName":"Orbiter","CreatedById":53645,"CreatedDateTime":"2013-08-25T17:44:55Z","Content":"\n\u003Cp\u003EThis seems like an interesting challenge. I will probably try this once I get my new exploration save started.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-08-25T20:35:45Z","Content":"\n\u003Cp\u003ESounds awesome.\u003C/p\u003E\u003Cp\u003EI\u0027ll be there and back in a jiffy!\u003C/p\u003E\u003Cp\u003EI\u0027m not going to run it off my favourite save, since I\u0027m actually doing some prep work for a manned Moho mission, as well as a concurrent unmanned Eeloo landing and sample-return mission. It would be a similar level of challenge to be making all the necessary resources (refueling system and so on) from scratch anyways.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T20:41:47Z\u0022 title=\u002208/25/2013 08:41  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rosarium","CreatedById":51628,"CreatedDateTime":"2013-08-25T20:51:06Z","Content":"\n\u003Cp\u003EFull Stock\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/78696568/HELOO01.jpg\u0022 alt=\u0022HELOO01.jpg\u0022\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/78696568/HELOO02.jpg\u0022 alt=\u0022HELOO02.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"YarTheBug","CreatedById":72310,"CreatedDateTime":"2013-08-25T20:55:50Z","Content":"\n\u003Cp\u003EYes! Thank you, sir, for an excellent challenge. \u003C/p\u003E\u003Cp\u003EI went through my 20.2 screenshots, and I think if they\u0027re up to snuff. I\u0027m quite pleased with the initial scouting sortie, but I\u0027ve been wanting to go back.\u003C/p\u003E\u003Cp\u003EI\u0027ll add another entry in a few days when I\u0027ve had time to re-visit my favorite planet.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/93w4o\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EParty - 2 Kerbals landed (twice): 100 points (200 if you\u0027re feeling generous)\u003C/p\u003E\u003Cp\u003EHobbit - 2 Kerbals returned from Eeloo surface (3 from Eeloo SoI): 100 points (150 if generous)\u003C/p\u003E\u003Cp\u003ELast Year\u0027s - 0 (I used FAR and Deadly Re-entry so I\u0027m technically disqualified. Still these undoubtedly made it a little harder. Again, if you\u0027re feeling generous 100)\u003C/p\u003E\u003Cp\u003EA and B - 3 launches: 75 points\u003C/p\u003E\u003Cp\u003EI calculate 275 points for the scouting mission (or up to 525 if the judge is exceptionally kind)\u003C/p\u003E\u003Cp\u003ECheers! \u003C/p\u003E\u003Cp\u003E- Yar\u003C/p\u003E\u003Cp\u003ENew Start on this Challenge:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/C-GFgKoS8lU\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 1\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\n\u003C/strong\u003E\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/qncpAJz8oSw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T21:25:54Z\u0022 title=\u002208/29/2013 09:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by YarTheBug\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-26T00:48:59Z","Content":"\n\u003Cp\u003EOP Update.\u003C/p\u003E\u003Cp\u003EBothersome - Great job on the mission and way to be on the ball for the last minute rescue flight.\u003C/p\u003E\u003Cp\u003ERosarium - I need a mission file to award points... But those rovers are the awsome.\u003C/p\u003E\u003Cp\u003EYarTheBug - Great mission. You get the points for the landed kerbins at Eeloo, and pts for all the Kerbals returned to Kerbin surface You get a technocracy score for Deadly rentry (\u002B20 points - we\u0027re here...now what ... Deadly Re-entry counts as a thing to do as \u0022ohmy god we\u0027re all gonna die\u0022)\u003C/p\u003E\u003Cp\u003EThanx for the entries... keep them coming and I would love to see some Mod heavy space programs put up something.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\u003Cp\u003EYarTheBug - Great mission. You get the points for the landed kerbins at Eeloo, and pts for all the Kerbals returned to Kerbin surface\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T06:38:25Z\u0022 title=\u002208/26/2013 06:38  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by alacrity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-08-26T18:46:48Z","Content":"\n\u003Cp\u003EI am really struggling to land this on Eeloo (trying a horizontal landing). I\u0027ll get back to you.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i44.tinypic.com/xomvk3.png\u0022 alt=\u0022xomvk3.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-26T19:05:00Z","Content":"\n\u003Cp\u003ECan we put 21 kerbals on eeloo? Since I have a large ship in orbit around kerbin and it has 21 people in there. I hope to make a space station. But I think I like the idea of a eeloo space station with landers.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-08-26T19:19:49Z","Content":"\n\u003Cp\u003EBack when Eeelo was first released, I made a station there. It was meant for a lander, but I forgot landing gear on my HOME lander \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-26T20:39:08Z","Content":"\n\u003Cp\u003EI\u0027ve landed there more than a week ago. Just that. Went there and landed with a simple lander equipped with scientific instruments. Had lots of fuel left and had to get rid of it to actually free the lander. Too bad I didn\u0027t plan any additional stuff like a satellite in orbit around Eeloo.\u003C/p\u003E\u003Cp\u003EThing is, I\u0027ve made a huge rocket and used the same design for several planets. It was a spree. I don\u0027t even think I\u0027ve got that rocket anymore.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/2v3q7h0.png\u0022 alt=\u00222v3q7h0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i39.tinypic.com/2chl05g.png\u0022 alt=\u00222chl05g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i42.tinypic.com/8wxkeg.png\u0022 alt=\u00228wxkeg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i39.tinypic.com/s3d0zp.png\u0022 alt=\u0022s3d0zp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe guy is still there. I did this at the end of my grand Kerbol system tour designed to determine as much scientific data as possible.\u003C/p\u003E\u003Cp\u003EAll parts are stock. The landing was planned to end up at the border of white and brown regions, but I\u0027ve landed a bit more into the brown one. The terrain was really boring. I hoped it would be more interesting.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-08-27T02:07:56Z","Content":"\n\u003Cp\u003EIsn\u0027t a high score on this challenge rather easy to get by simply sending \u003Cem\u003EASTRONOMICAL\u003C/em\u003E amounts of kerbals over to Eeloo?\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2013-08-27T02:15:24Z","Content":"\n\u003Cp\u003EThis should be simple enough for me, I have added some small scale parts (small Skipper, Mainsail, LV-909, fuel tanks, nuclear engine based on the LARS system, one man lander can (glorified external seat that can have stuff glued to it), SRBs), so I should be able to do this with a reasonably light launcher.\u003C/p\u003E\u003Cp\u003EEdit: The small parts are appropriately scaled. They are half the size, and so have 1/8th the capacity and mass (some have 1/4 the mass if they are hollow, like fuel tanks - dry mass, and the lander can), 1/4 the thrust (ie 1/4 the cross sectional area)), and 10 - 20 seconds less Isp. I\u0027d feel sorry for the poor Kerbal inside, but since they are immortal...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-27T02:23:46Z\u0022 title=\u002208/27/2013 02:23  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 27, 2013\u003C/time\u003E by SunJumper\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-08-27T15:29:57Z","Content":"\n\u003Cp\u003EI\u0027ve constructed my Launcher and Payload. Hopefully it should succeed today.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RhVfGOU.jpg\u0022 alt=\u0022RhVfGOU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.youtube.com/watch?v=O-AKdYHxx48\u0026amp;t=45m58s\u0022 rel=\u0022external nofollow\u0022\u003EBeethoven 9\u003C/a\u003E carries a Space Station base, and the Symphony Lander, which itself carries 2 cubesats, a 2-kerbal Rover, and a stationary probe which can launch an Ion satellite. Though I forget if Ion probes are strong enough to lift off of surface gravity similar to the Mun.... Oh well, it\u0027s already in orbit. --About which, may I ask-- can I enable cheats just to launch that ion probe once it\u0027s already on the surface of Eeloo?\u003C/p\u003E\u003Cp\u003ELast departure launch will carry an x32 of fuel and three Kerbals.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-27T15:36:59Z\u0022 title=\u002208/27/2013 03:36  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 27, 2013\u003C/time\u003E by Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-27T17:14:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psycix\u0022 data-cite=\u0022Psycix\u0022\u003E\u003Cdiv\u003EIsn\u0027t a high score on this challenge rather easy to get by simply sending \u003Cem\u003EASTRONOMICAL\u003C/em\u003E amounts of kerbals over to Eeloo?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem is, you need to get astronomical amounts of kerbals to Eeloo.\u003C/p\u003E\u003Cp\u003EI always did want to give Eeloo a visit, so I\u0027ll think about this challenge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2013-08-27T18:08:48Z","Content":"\n\u003Cp\u003EI haven\u0027t even made it to Jool or Moho yet, clearly I need to aim for Eeloo first!\u003C/p\u003E\u003Cp\u003EMy main save \u003Cem\u003Edoes\u003C/em\u003E have Eeloo headed inward right now, so the timing is probably decent.\u003C/p\u003E\n"},{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-08-27T18:26:33Z","Content":"\n\u003Cp\u003E1. Can\u0027t use Hyperedit, ORDA, debug... anything that auto alters cfg\u0027s, changes the physics and the like.\u003C/p\u003E\u003Cp\u003E2. Use everything else\u003C/p\u003E\u003Cp\u003EInfinite fuel anybody?\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2013-08-27T21:32:14Z","Content":"\n\u003Cp\u003EI\u0027m slowly building up a supply of orange tanks with nukes attached in orbit, designed a core vehicle to attach to three of them and carry kerbals, plus another docking port on the nose for a multi-satellite science package to be tacked on.\u003C/p\u003E\u003Cp\u003EKind of forgot to put landing gear on the thing though, so it\u0027ll have to come back down for that addition. Oops.\u003C/p\u003E\n"},{"CreatedByName":"YarTheBug","CreatedById":72310,"CreatedDateTime":"2013-08-28T00:23:41Z","Content":"\n\u003Cp\u003EI\u0027m starting a new save file for this challenge:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/C-GFgKoS8lU\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 1\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll also edit my first post with all the videos.\u003C/p\u003E\u003Cp\u003E - Yar\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-08-28T05:23:10Z","Content":"\n\u003Cp\u003EMission success! I\u0027ll post pictures tomorrow.\u003C/p\u003E\u003Cp\u003EUpon proving it with pictures, you\u0027ll see that I\u0027ve gained the following score, as I see it:\u003C/p\u003E\u003Cp\u003E150 - Party in the House (x3)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E50 - Mission Control\u003C/span\u003E Did not notice the criteria for \u0027must have refueling ability\u0027-- station has no spare fuel tanks. Is this award fully discredited?\u003C/p\u003E\u003Cp\u003E25 - Seeing the Sites (x1 Rover)\u003C/p\u003E\u003Cp\u003E100 - Last Year\u0027s Model (100% Stock)\u003C/p\u003E\u003Cp\u003E80 - We\u0027re Here... Now What? (x4 probes; 2 orbital, 1 stationary, 1 launches from stationary)\u003C/p\u003E\u003Cp\u003E225 - Tab \u0027A\u0027 into slot \u0027B\u0027 (Transport Vehicle, 5 Refuelings, 1 Crew Launch, 1 Science/Lander Launch, 1 Kerbin Logistics Satellite)\u003C/p\u003E\u003Cp\u003E580 - Total Score, not including Mission Control.\u003C/p\u003E\u003Cp\u003EIf I had paid better attention to the rules, I could\u0027ve gotten more because I prepared but never sent a logistics module which carried even more probes and a lander.\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-08-28T14:59:08Z","Content":"\n\u003Cp\u003EWell, I was testing one of my ChemRock designs and thought...well, why not try if I can get to Eloo. Yes, I can \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ELike all ChemRock designs: No Ion stuff, no NERVAs - you can get beyond Duna with chemicals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, it was unmanned, so I don\u0027t claim any points. Just thought I\u0027d share it with you guys, since it fits the challenge.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/6yDEE\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-08-28T15:02:55Z","Content":"\n\u003Cp\u003Enevermind.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-28T16:43:47Z","Content":"\n\u003Cp\u003EQuestion for the sake of clarification - if I launch a space station to Eeloo, does it need to go on the same rocket as the Kerbals? Or can I launch a bunch of payloads, assemble them over Eeloo and call it good (provided it meets the criteria of a space station as laid out in the rules)?\u003C/p\u003E\u003Cp\u003EI can only land one manned flight on Eeloo, is that right? Is there a limit on the number of \u003Cem\u003Eunmanned\u003C/em\u003E flights I can put on Eeloo?\u003C/p\u003E\u003Cp\u003ESeriously thinking about doing this challenge....it sounds hard yet fun. Plus Eeloo\u0027s one of those places I have yet to visit.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-08-28T20:04:46Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/VRN8W\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s my allegedly 580 point entry:\u003C/p\u003E\u003Cp\u003E1. Launch of the \u003Cem\u003EBeethoven\u003C/em\u003E Interplanetary Spacecraft (Replica of my main-career save \u003Cem\u003ETarsus II\u003C/em\u003E, which was designed for a return mission to Moho.\u003C/p\u003E\u003Cp\u003E2. Launch of Symphony Tanker 1\u003C/p\u003E\u003Cp\u003E3. Rendezvous of ST1\u003C/p\u003E\u003Cp\u003E4. Landing of ST1\u003C/p\u003E\u003Cp\u003E5. [Allegedly bad] landing of ST2\u003C/p\u003E\u003Cp\u003E6. Undocking of ST3\u003C/p\u003E\u003Cp\u003E7. Rendezvous of the Science/Landing Payload\u003C/p\u003E\u003Cp\u003E8. Launch of Crew and Fuel Tanker 4\u003C/p\u003E\u003Cp\u003E9. Assembled and Fueled Beethoven Mission. Minor fuel tanker 5 is shown docked. (Not shown, launch of Logistics Satellite to high orbit farther than Minmus, for time-warping forwards to Year 1 Day 61 for the ideal launch window.)\u003C/p\u003E\u003Cp\u003E10. Departure from Kerbin\u003C/p\u003E\u003Cp\u003E11. Course Correction at Departure\u002B25 days, arrival time will be T\u002B1y170d\u003C/p\u003E\u003Cp\u003E12. Arrival and descent to Eeloo\u003C/p\u003E\u003Cp\u003E13. Deployment of the Ode to Joy Station, with 2 Large and 2 Normal Docking ports.\u003C/p\u003E\u003Cp\u003E14. Deployment of the Fate Lander\u003C/p\u003E\u003Cp\u003E15. Jettisoning the Structural Faring\u003C/p\u003E\u003Cp\u003E16. CubeSat A, deployed from Fate\u003C/p\u003E\u003Cp\u003E17. CubeSat B, deployed from Fate\u003C/p\u003E\u003Cp\u003E18. Fate Lander showing undeployed Scherzo Rover and Permanence Probe w/ Mapper Probe\u003C/p\u003E\u003Cp\u003E19. Fate, moments from touchdown\u003C/p\u003E\u003Cp\u003E20. Fate, with 3 Kerbals, Rover and Permanence/Mapper\u003C/p\u003E\u003Cp\u003E21. Second flag planted 2km away\u003C/p\u003E\u003Cp\u003E22. Driving back at night\u003C/p\u003E\u003Cp\u003E23. Fate with Rover and Permanence/Mapper. Here the Permanence is shown lying on the ground, with the Mapper Probe ready to be Launched.\u003C/p\u003E\u003Cp\u003E24. Fate departing Eeloo-- 640 days to get there, spent only 2 days on the surface.\u003C/p\u003E\u003Cp\u003E25. Fate rendezvous with Beethoven\u003C/p\u003E\u003Cp\u003E26. Beethoven heads home\u003C/p\u003E\u003Cp\u003E27. \u0022\u003C/p\u003E\u003Cp\u003E28. Unmanned Fate Lander lands on North Pole\u003C/p\u003E\u003Cp\u003E29. \u0022\u003C/p\u003E\u003Cp\u003E30. Kerbin-bound transfer\u003C/p\u003E\u003Cp\u003E31. Kerbin arrival\u003C/p\u003E\u003Cp\u003E32. Reentry\u003C/p\u003E\u003Cp\u003E33. Splashdown and back home safe.\u003C/p\u003E\u003Cp\u003E34. \u0022\u003C/p\u003E\u003Cp\u003EThus I will copy the score I accounted for myself, copied from the previous page.\u003C/p\u003E\u003Cp\u003E150 - Party in the House (x3)\u003C/p\u003E\u003Cp\u003E50 - Mission Control Did not notice the criteria for \u0027must have refueling ability\u0027-- station has no spare fuel tanks. Is this award fully discredited?\u003C/p\u003E\u003Cp\u003E25 - Seeing the Sites (x1 Rover)\u003C/p\u003E\u003Cp\u003E100 - Last Year\u0027s Model (100% Stock)\u003C/p\u003E\u003Cp\u003E80 - We\u0027re Here... Now What? (x4 probes; 2 orbital, 1 stationary, 1 launches from stationary)\u003C/p\u003E\u003Cp\u003E225 - Tab \u0027A\u0027 into slot \u0027B\u0027 (Transport Vehicle, 5 Refuelings, 1 Crew Launch, 1 Science/Lander Launch, 1 Kerbin Logistics Satellite)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E580 - Total Score, not including Mission Control.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E630 if my space station qualifies. 530 if it does not, and the two launches which I explained but do not have pictures of, are discounted.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-28T20:09:16Z\u0022 title=\u002208/28/2013 08:09  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 28, 2013\u003C/time\u003E by Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ThreeMartiniLaunch","CreatedById":62595,"CreatedDateTime":"2013-08-29T03:24:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alacrity\u0022 data-cite=\u0022alacrity\u0022\u003E\u003Cdiv\u003EWant fries with that - 50 pts per fed Kerbal. Using the Duna Permanent settlement mission platform, take along representations of consumables like food and extra air. Each kerbal in the mission needs 3.1 kilos of consumables per day per kerbal or to make it easier 1 tonne equals 3 Kerbals for 100 days.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a question about this bonus.\u003C/p\u003E\u003Cp\u003EThe \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/FL-R1_RCS_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003EFL-R1_RCS_Fuel_Tank\u003C/a\u003E weighs 3.4 tons and holds 3 tons of monopropellent. Would it count for 900 kerbal days of supplies or 1020?\u003C/p\u003E\n"}]}