{"TopicId":43691,"ForumId":32,"TopicTitle":"What are my chances?","CreatedByName":"ramses","CreatedById":26418,"CreatedDateTime":"2013-08-24T05:59:53Z","PageNum":1,"Articles":[{"CreatedByName":"ramses","CreatedById":26418,"CreatedDateTime":"2013-08-24T05:59:53Z","Content":"\n\u003Cp\u003EJust a quick question. I\u0027ve done a return trip to Laythe before and that aerobraking around Jool is quite killer. This time I\u0027m off to Vall, but am thinking of doing it in one trip as opposed to multiple trips with all my landers and rovers.\u003C/p\u003E\u003Cp\u003EI have this to worry about...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7376/9581724968_cb27ee81b7_b.jpg\u0022 alt=\u00229581724968_cb27ee81b7_b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5338/9578937325_8f4f8668aa_b.jpg\u0022 alt=\u00229578937325_8f4f8668aa_b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat are my chances of it surviving Jool. (I personally don\u0027t think their good)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-24T06:34:29Z\u0022 title=\u002208/24/2013 06:34  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 24, 2013\u003C/time\u003E by ramses\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-24T06:04:07Z","Content":"\n\u003Cp\u003EDepends on your technique, but I would say you\u0027d be lucky to even reach Jool with that craft. Mainsails are good for getting into orbit, but as an interplanetary drive stage engine, they\u0027re one of the worst choices available. If you can, I suggest you replace it with an orange tank plus LV-N. It\u0027ll be slow as all-get-out, but you\u0027ll actually get to Jool with it... eventually.\u003C/p\u003E\n"},{"CreatedByName":"ramses","CreatedById":26418,"CreatedDateTime":"2013-08-24T06:26:01Z","Content":"\n\u003Cp\u003EThat mainsail was just for getting me to orbit. It\u0027s got two nuke engines to get me there and back.\u003C/p\u003E\u003Cp\u003EJust realised I\u0027ve screwed up my pics. Can\u0027t see squat.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-24T06:29:45Z\u0022 title=\u002208/24/2013 06:29  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 24, 2013\u003C/time\u003E by ramses\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-24T11:39:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ramses\u0022 data-cite=\u0022ramses\u0022\u003E\u003Cdiv\u003EWhat are my chances of it surviving Jool. (I personally don\u0027t think their good)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat exactly do you mean by \u0022surviving Jool\u0022 ? Unless you\u0027re using a mod like deadly reentry then aerobraking can\u0027t damage your ship. For that very reason aerobraking is a godsend in KSP saving a craft heaps and heaps of fuel when done properly.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-24T11:55:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnno\u0022 data-cite=\u0022Johnno\u0022\u003E\u003Cdiv\u003EWhat exactly do you mean by \u0022surviving Jool\u0022 ? Unless you\u0027re using a mod like deadly reentry then aerobraking can\u0027t damage your ship. For that very reason aerobraking is a godsend in KSP saving a craft heaps and heaps of fuel when done properly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, aerobraking put some stress on the ship but far less than the trust from an mainsail. \u003C/p\u003E\u003Cp\u003EI only wonder if you have enough fuel, the transfer stage tank look a bit small to me. Remember you has to brake into Vall orbit to.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-08-24T12:38:25Z","Content":"\n\u003Cp\u003EYeah - this ship does look a bit underfueled for a serious mission in Jool\u0027s system. I\u0027m afraid you will have to tap into fuel tanks of landers and rovers. Consider switching one of smaller crafts for kethane mining lander.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-24T13:06:00Z","Content":"\n\u003Cp\u003EJust to be on the safe side I would launch another orange tank (or one of the grey tanks that are half its size) with it to Vall just incase you do have to tap into the lander tanks. Otherwise it should be fine from the looks of things.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-08-24T15:06:18Z","Content":"\n\u003Cp\u003EWhy don\u0027t you just use a Tylo or Laythe grav assist to slow down instead? Skips the whole problem.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-08-24T17:06:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EWhy don\u0027t you just use a Tylo or Laythe grav assist to slow down instead? Skips the whole problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose aren\u0027t really all that safe to use, or at least they won\u0027t be until reentry heat gets properly implemented. Slowing down with gravity can fling you onto a different trajectory, possibly throwing you right into Jool, or throwing you out of the moon system entirely. For now, it\u0027s just safer to use atmosphere\u0027s to slow down.\u003C/p\u003E\u003Cp\u003EIn regards to OP, I recommend getting a periapsis of around 112,000 meters for your aerobrake. That will get you a nice stable orbit that you can safely make adjustments to.\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2013-08-24T17:40:05Z","Content":"\n\u003Cp\u003EPersonally I wouldn\u0027t set Jool\u0027s periapsis no deeper that 122~125km. The atmospheric drag will take you in a bit deeper than what periapsis you\u0027ve set. Besides you could always make another pass and do another aerobrake. \u003C/p\u003E\u003Cp\u003EHere\u0027s what happened to my Laythe Jet Transport Ship (J-Bird aircraft and Bird\u0027s Nest Refueling Station/Lander). My periapsis was set to 118km I think, but was dragged down to around 115~116km. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qnzrSf9l.png\u0022 alt=\u0022qnzrSf9l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe RCS tank broke loose from the port nacelle (yes I had struts attached).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YASpEMGl.png\u0022 alt=\u0022YASpEMGl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand collided with the fuel tank causing it to explode.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LUVCewAl.png\u0022 alt=\u0022LUVCewAl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/if4bHAHl.png\u0022 alt=\u0022if4bHAHl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe RCS tank on the starboard nacelle also came loose but thankfully didn\u0027t do any additional damage. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ip3Dmnul.png\u0022 alt=\u0022ip3Dmnul.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELuckily no damage was done to the lander or aircraft. I was able to board each aircraft, separate from the transport ship, and land on Laythe. All a part of this \u003Ca href=\u0022http://imgur.com/a/QIPU2#0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Emission\u003C/strong\u003E\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"ramses","CreatedById":26418,"CreatedDateTime":"2013-08-25T01:37:22Z","Content":"\n\u003Cp\u003EExactly what I mean Landge.With my last mission to Laythe I arrived with 5 orange tanks, but one was ripped off during aerobraking at Jool. \u003C/p\u003E\u003Cp\u003EAs far as fuel is concerned, I\u0027ll simply send some more if necessary. Landers and rovers won\u0027t be making the trip home so it\u0027ll be a lot lighter on return trip.\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2013-08-25T04:39:15Z","Content":"\n\u003Cp\u003EYes it was one of those WTF? moments. I had reloaded several times but all with similar results. So I just took some pics, played it out, to see if I could make it work. I also lost a couple LV-N\u0027s on the booster stage, making my center of Thrust all out of whack on top of the whole ship\u0027s CoM getting screwed up. Every other ship made it through OK. Even though it was an exact duplicate of the first jet transport, all other ships were at a higher altitude, even my massive expedition mothership made it without a scratch. Problem was getting each ship far enough apart to bring them into Laythe one at a time.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-25T11:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ramses\u0022 data-cite=\u0022ramses\u0022\u003E\u003Cdiv\u003EExactly what I mean Landge.With my last mission to Laythe I arrived with 5 orange tanks, but one was ripped off during aerobraking at Jool. \u003Cp\u003EAs far as fuel is concerned, I\u0027ll simply send some more if necessary. Landers and rovers won\u0027t be making the trip home so it\u0027ll be a lot lighter on return trip.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy don\u0027t simply dock some tanks to it for the initial burn out to Jool. \u003C/p\u003E\u003Cp\u003EIt gives mission flexibility, if you have spare fuel you could visit Pol or something. If you have fuel left in the stage with the mainsail you could drain it to the nuclear engines during the first part of takeoff. Downside is poor trust however the fuel is free.\u003C/p\u003E\n"}]}