{"TopicId":43707,"ForumId":34,"TopicTitle":"kOS Scriptable Autopilot System 0.9","CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-08-24T14:28:17Z","PageNum":69,"Articles":[{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-11-06T23:20:50Z","Content":"\n\u003Cp\u003EThis is it. This is what autopilot in KSP should be. I have finally found the mod that implements the fairest and funnest method possible of performing an automated mission! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for creating what is, in my opinion, the greatest mod in KSP. Good day. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-06T23:58:07Z","Content":"\n\u003Cp\u003E@Sma: Ah, ok. I haven\u0027t seen it save new volumes., So I guess it\u0027s not so much to load the programs from Archive at launch.\u003C/p\u003E\u003Cp\u003EOn another point: WHat function/variable should I call to get the current pitch and heading values? For example, if I have set my steering to an R(0,70,180) degrees, how can I check whether the rocket is now pointing in that direction? I want to halt the execution of my programme until that is met. I\u0027m using FAR and Real Size Kerbin so I have to do a very gradual gravity turn or I will flip out.\u003C/p\u003E\u003Cp\u003Ein addition, i\u0027m writing a launch programme that has the inputs of what inclination and orbital altitude you want to launch to. It limits your acceleration to a value you want and starts the gravity turn at a specified altitude. I\u0027m busy writing the method to also check that the TWR is high enough to sustain the current pitch, and adjust the thrust and/or pitch to compensate for it. I will let you know how that goes.\u003C/p\u003E\u003Cp\u003E@ThrFoot: I absolutely agree! It\u0027s amazing!\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T04:24:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ANWRocketMan\u0022 data-cite=\u0022ANWRocketMan\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOn another point: WHat function/variable should I call to get the current pitch and heading values? For example, if I have set my steering to an R(0,70,180) degrees, how can I check whether the rocket is now pointing in that direction?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESTEERING is an R() tuple that defines the direction you are telling the ship to point, and\u003C/p\u003E\u003Cp\u003EFACING is an R() tuple that shows the direction the ship is currently pointing.\u003C/p\u003E\u003Cp\u003ESo, after setting STEERING to R(a,b,c), then you can test for how much FACING:yaw differs from a, and FACING:pitch from b, and FACING:roll from c to see if they\u0027re getting close to lined up yet or not.\u003C/p\u003E\u003Cp\u003EOne warning, the rotations are not reliably always mapped down to numbers between 0 and 360. In other words, sometimes a rotation that\u0027s really 15 degrees will be reported as 375 instead, which is the same compass point, but if you just compare the raw numbers it looks like it\u0027s really far off. So remember to take the values MOD 360. Also, remember that values that are, say, different by 350 are really different by only 10 (i.e. 355 degrees versus 5 degrees).\u003C/p\u003E\u003Cp\u003EWhat I\u0027ve resorted to now to cover all those cases is to just take the sin and cosine of the angles and compare that instead of the angles themselves. That way, for example, if sin(theta) and sin(gamma) are close to each other, and cos(theta) and cos(gamma) are close to each other, then that tells you that angles theta and gamma are close to each other, no mater how they\u0027re expressed. That way you get the same result if an angle is expressed as -5, or 355, or 715, and so on, all of which are really the same thing.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-07T08:14:18Z","Content":"\n\u003Cp\u003EHmm, yes. Should work. Thank you.\u003C/p\u003E\u003Cp\u003EDoes MaxThrust return a value in kN or N? Or is there another method to retrieve the current thrust besides (MAXTHRUST * THROTTLE)?\u003C/p\u003E\u003Cp\u003EI\u0027m using this check to see if my effective vertical thrust exceeds the gravitational pull on the rocket:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EIF MAXTHRUST*THROTTLE*SIN(FACING:PITCH) \u0026gt; (MASS*gravitational acceleration)/1000 AND\u003Cbr\u003E{\u003Cbr\u003E//Decrease pitch(must not exceed 4 degree change as this will cause the rocket to flip out)/thrust(if thrust exceeds MaxG) so that you have a ratio of horizontal to vertical thrust of at least 1.5.\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis is run within an additional loop that checks every 0.1 seconds and does certain things to prevent the exceeding of MaxG and checks whether apoapsis is reached. It also stages the rocket(problem: I\u0027m using MFT and Realistic Fuels). I want to add code to check for launch irregularities(too large facing change since last tick or loss of thrust[unless while staging]) and activate the abort sequence. NOTE: I haven\u0027t tested it yet!\u003C/p\u003E\u003Cp\u003EBTW, how do get the return value for the current gravitational acceleration? Can I get this from an Accelerometer?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T08:19:03Z\u0022 title=\u002211/07/2013 08:19  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by ANWRocketMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sacred Aardvark","CreatedById":85856,"CreatedDateTime":"2013-11-07T12:14:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EWhen KOS tells you there\u0027s an error on a line number, the line number it reports to you is often utterly wrong, especially if it\u0027s saying line number 0. Just because it says line 0 doesn\u0027t mean it really is line 0. It could be anywhere in the program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBased on my experience, not anywhere. If it says error on line 1 for example, the error can be on the second line of the program OR the second line of Any Loop in the program.\u003C/p\u003E\u003Cp\u003EIn the case in question it\u0027s probably referring to the line 0 of this loop which is missing a THEN on the initialization of the loop:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ewhen altitude \u0026gt; 500 { // \u0026lt;-line 0, lack of then\u003Cbr\u003E  lock pVal to -1*(1.25*(altitude/1000)\u002B(45*(apoapsis/Final)^2)).  // \u0026lt;- line 1, etc\u003Cbr\u003E  lock steering to up \u002B R(0,0,180) \u002B R(0,pVal,0). \u003Cbr\u003E}.\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn 0.7 I believe an error inside a loop gave the line number of the closing brace of the lowest(highest?) level loop in which the error occurred, which was nice, unless you had the entire program in an until loop and it said the error was on the last line of the program, when it really could be -anywhere-, at least these days we have somewhat clearer picture, instead of \u0022it\u0027s somewhere in -this- loop\u0022 we get \u0022it\u0027s on -this line- in *some* loop\u0022. Hardly specific, but it does point you in a vaguely right way, usually. /shrug\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T12:18:16Z\u0022 title=\u002211/07/2013 12:18  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by Sacred Aardvark\u003C/strong\u003E\n\u003Cbr\u003Eformatting, typos and grammar and bleep\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T12:23:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sacred Aardvark\u0022 data-cite=\u0022Sacred Aardvark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn 0.7 I believe an error inside a loop gave the line number of the closing brace of the lowest(highest?) level loop in which the error occurred, which was nice, unless you had the entire program in an until loop and it said the error was on the last line of the program, when it really could be -anywhere-, at least these days we have somewhat clearer picture, instead of \u0022it\u0027s somewhere in -this- loop\u0022 we get \u0022it\u0027s on -this line- in *some* loop\u0022. Hardly specific, but it does point you in a vaguely right way, usually. /shrug\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have yet to see the line number reported as anything other than zero. Ever.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-07T12:37:49Z","Content":"\n\u003Cp\u003EI\u0027ve noticed several non-zero line numbers so far. But only when using a loop. It seems to reset the line counter with every execution of the loop, so as @SacredAarvark said, it gives the line of the error WITHIN a loop, not within the program. It seems that if the error is not in a loop: Line 0. Every time.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-11-07T13:44:55Z","Content":"\n\u003Cp\u003EWhen I had that missing \u0027then\u0027 problem, because it said Error on line 0 y wrote a comment on line 0 and the first code moved to line 2, and the Error started saying on line 2.\u003C/p\u003E\n"},{"CreatedByName":"Sacred Aardvark","CreatedById":85856,"CreatedDateTime":"2013-11-07T15:38:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI have yet to see the line number reported as anything other than zero. Ever.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMine tend to be on line 2, occasionally 0, have had couple others at times, but mostly 2 or 0.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AbeS\u0022 data-cite=\u0022AbeS\u0022\u003E\u003Cdiv\u003EWhen I had that missing \u0027then\u0027 problem, because it said Error on line 0 y wrote a comment on line 0 and the first code moved to line 2, and the Error started saying on line 2.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, it does that, not a damn clue why though(okay it\u0027s bugged but still), but that result doesn\u0027t make any sense under my current theory (well, hypothesis, it\u0027s hardly verified), even though I can replicate it (sometimes) :|\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T15:48:29Z","Content":"\n\u003Cp\u003EWhat I would find really helpful, and it really seems quite realistic to me to enable it, would be a variant of ALT:RADAR that tells you the distance from your craft to the ground \u003Cstrong\u003Ein the direction your craft is pointed\u003C/strong\u003E rather than straight down. In other words, if you are aimed 45 degrees off from \u0022up\u0022, then don\u0027t report the altitude below the craft, but rather report the distance to the ground in that 45 degree angle. The diagram below shows what I\u0027m talking about. Getting the radar distance along that blue line in my picture is what I\u0027m talking about.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nk0sNQW.png\u0022 alt=\u0022Nk0sNQW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt makes sense that the radar distance measuring equipment would actually rotate with the craft and give the blue result rather than the green one. And that data is crucial to making a working landing script that can react to unknown landing sites at unknown locations.\u003C/p\u003E\u003Cp\u003EBecause of the inability to read the terrain, I can\u0027t really do a \u0022suicide burn\u0022 efficient landing because of the case illustrated in that picture. I end up having to guess what the highest ground MIGHT be based on the wiki entry for the body (all the bodies tell you the max elevation of the highest mountain on that body), and design the suicide burn to \u0022land\u0022 at that height first, and then descend from there down to the ground. On rocky bumpy bodies like The Mun, that\u0027s an enormous amount of error I have to account for.\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-07T15:50:06Z","Content":"\n\u003Cp\u003Ehow well does kOS play with MechJeb? I\u0027m not looking to actively use both at the same time, obviously. Just wanted to know if anyone has had any problems with both of them installed at the same time. I\u0027d like to be able to play around with kOS in my current save. The mod looks awesome!\u003C/p\u003E\n"},{"CreatedByName":"FellipeC","CreatedById":77983,"CreatedDateTime":"2013-11-07T15:51:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eadrom\u0022 data-cite=\u0022Eadrom\u0022\u003E\u003Cdiv\u003Ehow well does kOS play with MechJeb? I\u0027m not looking to actively use both at the same time, obviously. Just wanted to know if anyone has had any problems with both of them installed at the same time. I\u0027d like to be able to play around with kOS in my current save. The mod looks awesome!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had no problems\u003C/p\u003E\n"},{"CreatedByName":"aNewHope","CreatedById":76088,"CreatedDateTime":"2013-11-07T19:22:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EWhat I would find really helpful, and it really seems quite realistic to me to enable it, would be a variant of ALT:RADAR that tells you the distance from your craft to the ground \u003Cstrong\u003Ein the direction your craft is pointed\u003C/strong\u003E rather than straight down. In other words, if you are aimed 45 degrees off from \u0022up\u0022, then don\u0027t report the altitude below the craft, but rather report the distance to the ground in that 45 degree angle. The diagram below shows what I\u0027m talking about. Getting the radar distance along that blue line in my picture is what I\u0027m talking about.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nk0sNQW.png\u0022 alt=\u0022Nk0sNQW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s an awesome picture and your idea is very good as well. If that would get implemented (maybe along with ordinary alt:radar) it would solve most of my automated landing problems.\u003C/p\u003E\u003Cp\u003EBut I guess that the issue with this feature is, that the current alt:radar is simply putting out the radar altitude that is provided by KSP itself (you can see it in IVA). Probably it\u0027s way harder to get the radar distance you are talking about.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-07T19:33:14Z","Content":"\n\u003Cp\u003EIt might be possible to do a raycast straight out the back and use that to determine the distance.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-07T19:39:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aNewHope\u0022 data-cite=\u0022aNewHope\u0022\u003E\u003Cdiv\u003EThat\u0027s an awesome picture and your idea is very good as well. If that would get implemented (maybe along with ordinary alt:radar) it would solve most of my automated landing problems.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWithout the ordinart alt:radar you would still have a lot of trouble. Landing properly on the purple line where the mountain starts is not going to end well - for obvious reasons. Unless we develop some gecko like landing feet of course.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T20:21:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EWithout the ordinart alt:radar you would still have a lot of trouble. Landing properly on the purple line where the mountain starts is not going to end well - for obvious reasons. Unless we develop some gecko like landing feet of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToo many people have already written scripts expecting alt:radar to work like it does now, so I don\u0027t think changing it is a good idea at this stage. But I do advocate making a second type of radar altimeter for this purpose. \u003C/p\u003E\u003Cp\u003EI\u0027ve been thinking more and more about this and what would provide a good solution without just having the mod hand us all the terrain information on a silver platter (after all KOS is NOT meant to be mechjeb - we\u0027re supposed to do a portion of the autopilot logic ourselves and that means only being able to \u0022know\u0022 what the vessel knows). I first described the idea of the craft having a radar altimeter that\u0027s fixed in place on the craft itself and thus it rotates with the craft\u0027s facing. If we want to aim it in a different direction we have to rotate the craft to do it. I\u0027m not so sure now that this is the right answer because of spaceplanes.\u003C/p\u003E\u003Cp\u003EWith a retro-rocket lander, the engineers would have installed the radar altimeter hardcoded to aim 180 degrees off from the facing (When landing, the craft\u0027s facing points at the sky). But for a space plane, they would have installed the radar altimeter hardcoded to aim 90 degrees off from the facing (when landing the craft\u0027s facing is horizontal, not toward the sky). That one problem means it would be unfair for the KOS mod to pick one hardcoded direction relative to the facing and call that the direction of this altimeter\u0027s aim. That hardcoded direction would either favor spaceplanes and not work for landers, or favor landers and not work for spaceplanes. It can\u0027t be made to be correct for both if it\u0027s hardcoded.\u003C/p\u003E\u003Cp\u003EIf the altimeter were a new kind of vessel part, then the player could pick its direction when attaching it to the craft and the mod could read the part\u0027s orientation to decide which way its radar is aiming. But I have no idea how to make a part and add it to the game.\u003C/p\u003E\u003Cp\u003ESo maybe the only real workable solution would be to let the player pick the direction of this radar in the script.\u003C/p\u003E\u003Cp\u003EI propose something like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Elock radardirect to (whatever).\u003Cbr\u003Eprint \u0022directional radar altitude is \u0022 \u002B alt:direct.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ewhere \u0022(whatever)\u0022 is any of the of usual ways to aim things in KOS script, an R(), a Q(), a vector, etc.\u003C/p\u003E\u003Cp\u003Ei.e. To make it behave like the blue line in my diagram:\u003C/p\u003E\u003Cp\u003Elock mybottom to facing \u002B R(0,180,0).\u003C/p\u003E\u003Cp\u003Elock radardirect to mybottom.\u003C/p\u003E\u003Cp\u003Eor, to make it behave like the a clone of the normal old-school alt:radar:\u003C/p\u003E\u003Cp\u003Elock down to up \u002B R(0,180,0).\u003C/p\u003E\u003Cp\u003Elock radardirect to down.\u003C/p\u003E\u003Cp\u003EA clever script writer could actually implement a radar \u0022sweep\u0022 this way by successively moving the radar direction, and get an idea of the terrain in a patch of the ground.\u003C/p\u003E\u003Cp\u003EAs far as implementing it, I believe ANWRocketMan is right - Presumably the KSP API knows where the ground terrain is and provides a way for a mod writer to find it, and getting the intersect of a ray and the ground should be doable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T20:25:36Z\u0022 title=\u002211/07/2013 08:25  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"balu0","CreatedById":74978,"CreatedDateTime":"2013-11-07T21:56:14Z","Content":"\n\u003Cp\u003EI might have found a nasty bug or I\u0027m just missing something :\u003C/p\u003E\u003Cp\u003Eher is a code:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eblah blah...\u003Cbr\u003E\u003Cbr\u003Euntil x = 0 {\u003Cbr\u003E\u003Cbr\u003E\tclearscreen.\u003Cbr\u003E\u003Cbr\u003E\t//real time controls\u003Cbr\u003E\ton ag1 set Setpoint to 100.\u003Cbr\u003E\ton ag2 set Setpoint to 200.\u003Cbr\u003E\ton ag3 set kp to kp \u002B 1.\u003Cbr\u003E\ton ag4 set kp to kp - 1.\u003Cbr\u003E\ton ag5 set ki to ki \u002B 1.\u003Cbr\u003E\ton ag6 set ki to ki - 1.\u003Cbr\u003E\ton ag7 set kd to kd \u002B 1.\u003Cbr\u003E\ton ag8 set kd to kd - 1.\u003Cbr\u003E\u003Cbr\u003E\tprint \u0022Setpoint:\u0022 \u002B Setpoint \u002B \u0022   \u0022 at (10,4).\u003Cbr\u003E\tprint \u0022kp:\u0022 \u002B kp \u002B \u0022   \u0022 at (10,5).\u003Cbr\u003E\tprint \u0022ki:\u0022 \u002B ki \u002B \u0022   \u0022 at (20,5).\u003Cbr\u003E\tprint \u0022kd:\u0022 \u002B kd \u002B \u0022   \u0022 at (30,5).\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003Eblah balh..\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Enow what happens is strange. ag1 and ag2 works just fine, but ag3 and 4 for example gives back stupid numbers, like -11 then 64 and other random numbers.\u003C/p\u003E\u003Cp\u003Ewhat I want to do here is simple increment a variable with pushing a action group button.\u003C/p\u003E\u003Cp\u003EBug or Im missing something ?\u003C/p\u003E\u003Cp\u003EEdit: what I think is happening is that the action group command gets sent several times with only 1 key press.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T21:59:07Z\u0022 title=\u002211/07/2013 09:59  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by balu0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T22:25:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022balu0\u0022 data-cite=\u0022balu0\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEdit: what I think is happening is that the action group command gets sent several times with only 1 key press.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrect.\u003C/p\u003E\u003Cp\u003ELet me describe it for just the case of ag3 - the same thing happens with all the other action groups ones too:\u003C/p\u003E\u003Cp\u003EEach time the statement \u0022on ag3 set kp to kp \u002B 1.\u0022 runs, it inserts a NEW event hook into the list of things the KOS computer watches for and it doesn\u0027t clear out the old one. So the first time the UNTIL loops runs, there\u0027s one instance of looking for ag3 to happen and if it happens to run \u0027set kp to kp \u002B 1.\u0022 The second time, there\u0027s now two of them, then three, then four, and so on.\u003C/p\u003E\u003Cp\u003EiF the loop has run 30 times before you press ag3, then all 30 of those hooks get fired off at once, and then kp has been incremented 30 times.\u003C/p\u003E\u003Cp\u003EIf you want to use \u0022on\u0022 like this, you have to protect it with a check to see if it\u0027s really necessary to insert yet another hook. Basically, only run the \u0022on\u0027 command if it got triggered last time. If it hasn\u0027t been triggered yet, then just rely on the previous one that\u0027s still there.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EneedAg3Hook on.\u003Cbr\u003Euntil ... etc ... {\u003Cbr\u003E  if needAg3Hook {\u003Cbr\u003E    needAg3Hook off.\u003Cbr\u003E    on ag3 {\u003Cbr\u003E      ... do your normal thing here (i.e. \u0022set kp to kp \u002B 1.\u0022) ...\u003Cbr\u003E      needAg3Hook on.\u003Cbr\u003E  }.\u003Cbr\u003E}.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEach time it runs through the loop, if only inserts a new \u0022on ag3\u0022 command if needAg3Hook is true, which it only will be if the previous \u0022on ag3\u0022 has been executed after it was set up.\u003C/p\u003E\u003Cp\u003EYou basically need to do that thing for all the \u0022on\u0022 commands you\u0027re using (not just ag3) , if you\u0027re going to do it this way.\u003C/p\u003E\u003Cp\u003EKOS script could really use some other form of input besides this. The need to protect the hook insertions like this makes it impractical, and using action groups for this gets in the way of using them for what they\u0027re meant for.\u003C/p\u003E\u003Cp\u003EJust a simple \u0022readline\u0022 would be a handy addition, even if it\u0027s blocking and line-at-a-time.\u003C/p\u003E\n"},{"CreatedByName":"balu0","CreatedById":74978,"CreatedDateTime":"2013-11-07T22:59:44Z","Content":"\n\u003Cp\u003EThank you for confirming it. I come up with this workaround:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Euntil x = 0 {\u003Cbr\u003E\u003Cbr\u003E\t//real time controls\u003Cbr\u003E\ton ag1 set agHook to 1.\u003Cbr\u003E\ton ag2 set agHook to 2.\u003Cbr\u003E\ton ag3 set agHook to 3.\u003Cbr\u003E\ton ag4 set agHook to 4.\u003Cbr\u003E\ton ag5 set agHook to 5.\u003Cbr\u003E\ton ag6 set agHook to 6.\u003Cbr\u003E\ton ag7 set agHook to 7.\u003Cbr\u003E\ton ag8 set agHook to 8.\u003Cbr\u003E\u003Cbr\u003E\tif agHook = 1 {set Setpoint to 100. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 2 {set Setpoint to 200. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 3 {set kp to kp \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 4 {set kp to kp - 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 5 {set ki to ki \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 6 {set ki to ki - 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 7 {set kd to kd \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 8 {set kd to kd - 0.1. set agHook to 0.}.\u003Cbr\u003E\u003Cbr\u003E\tprint \u0022Setpoint:\u0022 \u002B Setpoint \u002B \u0022   \u0022 at (10,4).\u003Cbr\u003E\tprint \u0022kp:\u0022 \u002B kp \u002B \u0022   \u0022 at (10,5).\u003Cbr\u003E\tprint \u0022ki:\u0022 \u002B ki \u002B \u0022   \u0022 at (20,5).\u003Cbr\u003E\tprint \u0022kd:\u0022 \u002B kd \u002B \u0022   \u0022 at (30,5).\u003Cbr\u003E}.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWorks perfectly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ety\u003C/p\u003E\u003Cp\u003EEdit : not that perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E its killing my fps, but it is only for testing some formulas, it will do ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T23:04:37Z\u0022 title=\u002211/07/2013 11:04  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by balu0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T23:08:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022balu0\u0022 data-cite=\u0022balu0\u0022\u003E\u003Cdiv\u003EThank you for confirming it. I come up with this workaround:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Euntil x = 0 {\u003Cbr\u003E\u003Cbr\u003E\t//real time controls\u003Cbr\u003E\ton ag1 set agHook to 1.\u003Cbr\u003E\ton ag2 set agHook to 2.\u003Cbr\u003E\ton ag3 set agHook to 3.\u003Cbr\u003E\ton ag4 set agHook to 4.\u003Cbr\u003E\ton ag5 set agHook to 5.\u003Cbr\u003E\ton ag6 set agHook to 6.\u003Cbr\u003E\ton ag7 set agHook to 7.\u003Cbr\u003E\ton ag8 set agHook to 8.\u003Cbr\u003E\u003Cbr\u003E\tif agHook = 1 {set Setpoint to 100. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 2 {set Setpoint to 200. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 3 {set kp to kp \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 4 {set kp to kp - 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 5 {set ki to ki \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 6 {set ki to ki - 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 7 {set kd to kd \u002B 0.1. set agHook to 0.}.\u003Cbr\u003E\tif agHook = 8 {set kd to kd - 0.1. set agHook to 0.}.\u003Cbr\u003E\u003Cbr\u003E\tprint \u0022Setpoint:\u0022 \u002B Setpoint \u002B \u0022   \u0022 at (10,4).\u003Cbr\u003E\tprint \u0022kp:\u0022 \u002B kp \u002B \u0022   \u0022 at (10,5).\u003Cbr\u003E\tprint \u0022ki:\u0022 \u002B ki \u002B \u0022   \u0022 at (20,5).\u003Cbr\u003E\tprint \u0022kd:\u0022 \u002B kd \u002B \u0022   \u0022 at (30,5).\u003Cbr\u003E}.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWorks perfectly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ety\u003C/p\u003E\u003Cp\u003EEdit : not that perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E its killing my fps, but it is only for testing some formulas, it will do ...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re still inserting the hooks, even though they all do the same thing. Now instead of saying \u0022set kp to kp \u002B 1\u0022 30 times, for example, you\u0027re now saying \u0022set agHook to 3.\u0022 30 times.\u003C/p\u003E\u003Cp\u003EThat fixes the logic problem of doing the thing many times, but not the performance problem of doing it many times.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-08T02:20:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI\u0027ve been thinking more and more about this and what would provide a good solution without just having the mod hand us all the terrain information on a silver platter (after all KOS is NOT meant to be mechjeb - we\u0027re supposed to do a portion of the autopilot logic ourselves and that means only being able to \u0022know\u0022 what the vessel knows). I first described the idea of the craft having a radar altimeter that\u0027s fixed in place on the craft itself and thus it rotates with the craft\u0027s facing. If we want to aim it in a different direction we have to rotate the craft to do it. I\u0027m not so sure now that this is the right answer because of spaceplanes.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would love separate sensors, that can be added and removed in the VAB. As parts. This would feel a lot like proper engineering (determining data required and equipping the spacecraft accordingly) and would open up the game to a whole series of new sensors. RADAR, LIDAR, SONAR, weight detection et cetera.\u003C/p\u003E\n"},{"CreatedByName":"Kethevin","CreatedById":64466,"CreatedDateTime":"2013-11-08T04:55:59Z","Content":"\n\u003Cp\u003EHi. I have a couple questions I hope I can get help with.\u003C/p\u003E\u003Cp\u003E1) Around the time of the new update, I\u0027ve noticed keystrokes aren\u0027t confined to kOS. For instance, when I type inside the terminal, if I hit space a stage happens, if I use the letter \u0022b\u0022 breaks come on/off. I\u0027m not sure if I need to adjust a setting or of there is a command that corrects that.\u003C/p\u003E\u003Cp\u003E2) I asked this earlier, but didn\u0027t see an answer. I\u0027m sincerely curious what the difference is between \u0022lock steering to up \u002B R(0,0,180) \u002B R(0,-60,0)\u0022 and \u0022lock steering to up \u002B R(0,-60,180)\u0022\u003C/p\u003E\u003Cp\u003EThank you in advance for your answers. :-)\u003C/p\u003E\n"},{"CreatedByName":"a1270","CreatedById":92031,"CreatedDateTime":"2013-11-08T05:13:04Z","Content":"\n\u003Cp\u003E@Kethevin Are you using RemoteTech2 or Kerbal multiplayer? Both of those are known to mess with input locks kOS sets.\u003C/p\u003E\n"},{"CreatedByName":"Kethevin","CreatedById":64466,"CreatedDateTime":"2013-11-08T05:43:36Z","Content":"\n\u003Cp\u003ERemoteTech2, yep. I didn\u0027t notice it before but I did have kOS longer than RemoteTech2, so that must be it! :-(\u003C/p\u003E\u003Cp\u003ESorry about that, I didn\u0027t think of a mod conflict, I figured I accidently changed a setting or something. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kethevin","CreatedById":64466,"CreatedDateTime":"2013-11-08T06:10:20Z","Content":"\n\u003Cp\u003EAnother quick question along with the unanswered one above if I might.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to set up a rover program. I\u0027ve watched the videos, but I cannot get steering commands to work. The probe is facing up, the video said up or forward work. I\u0027ve tried \u0022lock steering to heading 100 by 90.\u0022, \u0022lock steering to heading 100 by 0.\u0022, I repeated those with \u0022lock wheelsteering\u0022 and just \u0022lock heading\u0022 type commands. \u003C/p\u003E\u003Cp\u003EIt DOES work if I face the probe forward so the navball shows a horizon rather than all blue sky, so I\u0027m wondering if it requires a different format in the command line.\u003C/p\u003E\n"}]}