{"TopicId":43707,"ForumId":34,"TopicTitle":"kOS Scriptable Autopilot System 0.9","CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-08-24T14:28:17Z","PageNum":18,"Articles":[{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-09-04T22:53:04Z","Content":"\n\u003Cp\u003EDoes anyone know how many decimals are stored in kOS variables? I\u0027m currently building a UI that allows the user to input large numbers by adjusting them 1 power of ten at a time. That\u0027s a lot more accurate and faster than steps of 10km or whatever. I have the basic script running for integers but as soon as I try to make numbers larger than 10 billion it switches to scientific representation (X.YZ E\u002B(7\u002BN)). Does kOS still store the digits past that point, or do I need to kludge together a way to make double integers? If I want a craft in a synchronous orbit those digits become rather important.\u003C/p\u003E\u003Cp\u003EHere\u0027s the script so far. Note that it is horribly inefficient (4 AG\u0027s and infinite variables... I know how to bring it down but it\u0027s a proof of concept).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eclearscreen.\u003Cbr\u003E\u003Cbr\u003Eset X to 0.\u003Cbr\u003Eset T to 0.\u003Cbr\u003Eset I to 0.\u003Cbr\u003Eset D to 0.\u003Cbr\u003Eset P to 0.\u003Cbr\u003Eset Flag to 0.\u003Cbr\u003Eon AG10 set Flag to 1.\u003Cbr\u003E\u003Cbr\u003Eprint \u0022Current value = \u0022 \u002B X.\u003Cbr\u003E\u003Cbr\u003Euntil Flag = 1 {\u003Cbr\u003E\u003Cbr\u003Eset T to (T*10) \u002B X.\u003Cbr\u003Eset X to 0.\u003Cbr\u003Eon AG7 set P to 1.\u003Cbr\u003Ewait 0.05.\u003Cbr\u003Eset P to 0.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Euntil P = 1{\u003Cbr\u003E\u003Cbr\u003Eon AG8 set D to 1.\u003Cbr\u003Eif D = 1{\u003Cbr\u003Eset X to X - 1.\u003Cbr\u003Eclearscreen.\u003Cbr\u003Eprint \u0022Current value = \u0022 \u002B ((T*10) \u002B X).\u003Cbr\u003Ewait 0.05.\u003Cbr\u003Eset D to 0.\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003Eon AG9 set I to 1.\u003Cbr\u003Eif I = 1{\u003Cbr\u003Eset X to X \u002B 1.\u003Cbr\u003Eclearscreen.\u003Cbr\u003Eprint \u0022Current value = \u0022 \u002B ((T*10) \u002B X).\u003Cbr\u003Ewait 0.05.\u003Cbr\u003Eset I to 0.\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}.\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003Eclearscreen.\u003Cbr\u003Eprint \u0022Your final value was: \u0022\u002BT.\u003Cbr\u003Eprint \u0022Good choice!\u0022.\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Desrtfox","CreatedById":80185,"CreatedDateTime":"2013-09-04T23:08:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Desrtfox\u0022 data-cite=\u0022Desrtfox\u0022\u003E\u003Cdiv\u003EI agree. I don\u0027t have time to actually build the regex at the moment, but the logic is pretty simple: Period followed by not a number, switch to semicolon. Period followed by EOL replaced with a semicolon. I think that\u0027d do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, I did find the time. Here\u0027s the find and replace expression for use with Textpad (my script editor of choice):\u003C/p\u003E\u003Cp\u003EFind: \\.\\([^0-9]\\)\\|\\.\\($\\)\u003C/p\u003E\u003Cp\u003EReplace: ;\\1\u003C/p\u003E\u003Cp\u003EOther editors should have similar syntax.\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-04T23:45:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SolarLiner\u0022 data-cite=\u0022SolarLiner\u0022\u003E\u003Cdiv\u003EEven after so much scripts written (most of them for tests purposes), I\u0027m still not used to the fullstop for a command. And from my POV, a period marks the end. Peroiod. While I think a semi colon marks the end of an action, but leaves place for more.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, in English a semicolon doesn\u0027t come with the option of another sentence, it comes with that as a requirement. And the second sentence MUST be related to the first.\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T00:27:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022melak47\u0022 data-cite=\u0022melak47\u0022\u003E\u003Cdiv\u003EWhile you\u0027re fixing bugs, the \u0022unlock all.\u0022 command does not appear to be working for me, it unlocks neither steering nor throttle. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, a fix for this is done and will be rolled out in the next release.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2013-09-05T03:20:04Z","Content":"\n\u003Cp\u003EIf I run a program from inside another program, the steering and throttle commands don\u0027t seem to respond.\u003C/p\u003E\u003Cp\u003EFor example:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//Program1\u003Cbr\u003E...\u003Cbr\u003EIF [i]condition[/i] { RUN [i]program2[/i]. }.\u003Cbr\u003E...\u003Cbr\u003E//End Program1\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E//Program2\u003Cbr\u003E...\u003Cbr\u003EPRINT \u0022Prograde\u0022.\u003Cbr\u003ELOCK STEERING TO PROGRADE.\u003Cbr\u003ELOCK THROTTLE TO 1.\u003Cbr\u003EPRINT \u0022Burning.\u0022.\u003Cbr\u003E...\u003Cbr\u003E//End Program2\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhen \u003Cem\u003Econdition\u003C/em\u003E is met, \u003Cem\u003Eprogram2\u003C/em\u003E runs. It will print \u0022Prograde\u0022, but the ship never turns. Likewise, the \u0022Burning\u0022 message is printed, but the throttle never activates. SAS is off. I\u0027m trying to set up a menu system, and I\u0027d rather not stick all my code into one program. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-09-05T06:31:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003EWell, in English a semicolon doesn\u0027t come with the option of another sentence, it comes with that as a requirement. And the second sentence MUST be related to the first.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWithout wishing to sound trite, this isn\u0027t English, it\u0027s a scripting/programming language, we aren\u0027t writing Shakespeare or Keats here . It doesn\u0027t conform to English grammar rules.\u003C/p\u003E\u003Cp\u003EMost of your other structures comply to common C-like programming structures. It makes sense from my POV (as a coder who\u0027s worked on C-like languages for 10 years) to stick to common conventions to allow easy adoption of your coding standard. As others have pointed out it\u0027s not too hard to substitute using regular expressions. It\u0027d be better to change conventions at this early stage and offer some sort of simple upgrade routine (UPGRADE prog1 TO prog1new command, for example) than find you want to do it later and can\u0027t due to inertia (i.e. breaking people\u0027s code).\u003C/p\u003E\u003Cp\u003EWhile you are at it, you should also consider dropping the need for a line ending after closing \u0027}\u0027 braces. Most languages assume \u0027}\u0027 as a line ending anyway. Also, being able to roll up the code window to a 1-line display would be handy too.\u003C/p\u003E\u003Cp\u003EAre you planning to implement user-defined functions, maybe then additionally importing one file to the other to allow modular coding? That\u0027d be amazing, as people would be able to extend your basic language by building custom libraries \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one is probably unrealistic, but what are the practicalities of adding external interfaces to it by, say, telnet or serial? It#s something I\u0027d like to see as a long term goal, it\u0027s not something it needs right now but it would be cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI absolutely love the idea of what you are doing, it\u0027s awesome and at a much more accessible and intelligible level than things like ProgCom (I never really got my head a round assembler) and I\u0027m going to have a good old go at using it in my week off later in the month, but I think if you want to implement what is rapidly becoming a comprehensive, feature-rich and complex scripting language, it\u0027s worth taking a step back and looking at common scripting language conventions to make your codeing system more accessible to people like muggins here who\u0027s brain works in C and PHP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKeep up the good work!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T06:33:49Z\u0022 title=\u002209/05/2013 06:33  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by MDBenson\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-09-05T07:22:50Z","Content":"\n\u003Cp\u003EOn the issue of structures and conventions, I don\u0027t think it really matters what form it takes... does it?\u003C/p\u003E\u003Cp\u003EAs someone who only dabbles with PHP and C, I feel I can adapt to these requirements quite easily. Also, I quite like the concept of a language that is fairly unique to this game for a number of reasons: one, keeping it verbose makes accessibility easier for non-programmers; two, trying to conform to existing standards will only please people with more detailed familiarity with those standards (can\u0027t please everyone); three, a unique language fits with the kerbal trope of aliens - not bogged down with prior experience - creating it to meet their needs; and four... I like the idea of a language reflecting the author - I think it\u0027s kinda neat to see it take shape.\u003C/p\u003E\u003Cp\u003EI do, however, feel that the terminators should not be made changeable. My hope is that this scripting language will give enough options to make scripts that can be applied universally to any ship and that libraries of scripts become a possibility. As such, editing out peoples obscure choice of terminators seems like an obstacle.\u003C/p\u003E\u003Cp\u003EJust a quick feature request? Would like to see node burn time implemented (BURNTIME:NODE).\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2013-09-05T08:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003EJust a quick feature request? Would like to see node burn time implemented (BURNTIME:NODE).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENoooooo! Bad idea. Node burn times seem really buggy in KSP, not to mention that you can (probably) do a lot better by writing your own timing script. I\u0027m actually doing one for Space Computer.\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T13:51:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EWithout wishing to sound trite, this isn\u0027t English, it\u0027s a scripting/programming language, we aren\u0027t writing Shakespeare or Keats here . It doesn\u0027t conform to English grammar rules.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe not, but the post I was responding to WAS about English and whether the English meaning of a semicolon fits into a programming language.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EMost of your other structures comply to common C-like programming structures. It makes sense from my POV (as a coder who\u0027s worked on C-like languages for 10 years) to stick to common conventions to allow easy adoption of your coding standard. As others have pointed out it\u0027s not too hard to substitute using regular expressions. It\u0027d be better to change conventions at this early stage and offer some sort of simple upgrade routine (UPGRADE prog1 TO prog1new command, for example) than find you want to do it later and can\u0027t due to inertia (i.e. breaking people\u0027s code).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey comply to C-like structures when I have absolutely no choice. If you read my blog, you know that implementing braces was a last resort for me. \u003C/p\u003E\u003Cp\u003EAs a programmer who works regularly with 5 different languages and has worked in the past with at least 10 others, I feel that it only helps you grow as a programmer to be confronted with new syntaxes and push yourself out of your comfort zone. If nothing else, it encourages you to do more thinking and less knee-jerk reacting. \u003C/p\u003E\u003Cp\u003EIf I were to switch the terminator to be more C-like, well there would always be \u0022just one more\u0022 C-like thing people would want it switched to as well. Eventually my mod would be pointless, because KSP already has a 100% C-like way to program it: writing your own mod. \u003C/p\u003E\u003Cp\u003EPart of the fun of developing kOS is being able to throw out convention and try new unexpected things.\u003C/p\u003E\u003Cp\u003EWhat I absolutely do not want is to create rage wars of people trying to share code and yelling at each other for not using the \u0022one true terminator.\u0022 And frankly, from my point of view, we\u0027ve already passed the point where I would even consider doing a hard-change to semicolon for everyone. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EWhile you are at it, you should also consider dropping the need for a line ending after closing \u0027}\u0027 braces. Most languages assume \u0027}\u0027 as a line ending anyway. Also, being able to roll up the code window to a 1-line display would be handy too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis one I definitely agree with. It\u0027s just one of those things I haven\u0027t gotten to. What I\u0027m going to do is have optional periods after braces to avoid breaking old code. While I love bucking convention, there\u0027s no upside to }.}.}.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EAre you planning to implement user-defined functions, maybe then additionally importing one file to the other to allow modular coding? That\u0027d be amazing, as people would be able to extend your basic language by building custom libraries \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI definitely want to give mod developers a way to join in, in ways that each mod doesn\u0027t require the other, but that they can optionally work together. I\u0027ve been in some talks with the creator of infernal robotics about this. I did notice in one of my DLL fishing expeditions something about messaging for parts. This might hold the key.\u003C/p\u003E\u003Cp\u003EWhat I\u0027d like is for mod developers to be able to register their own bindings and maybe even commands with kOS. And/or let kOS send strings to a part that have commands in them. Like TELL kethaneDrill TO \u0022Deploy Drill\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EThis one is probably unrealistic, but what are the practicalities of adding external interfaces to it by, say, telnet or serial? It#s something I\u0027d like to see as a long term goal, it\u0027s not something it needs right now but it would be cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did bring this idea up before, I think it\u0027s a cool idea and the kOS terminal already functions in a way that (I think) should be pretty compatible with telnet. But I don\u0027t have the time to work on this at the moment.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EI absolutely love the idea of what you are doing, it\u0027s awesome and at a much more accessible and intelligible level than things like ProgCom (I never really got my head a round assembler) and I\u0027m going to have a good old go at using it in my week off later in the month, but I think if you want to implement what is rapidly becoming a comprehensive, feature-rich and complex scripting language, it\u0027s worth taking a step back and looking at common scripting language conventions to make your codeing system more accessible to people like muggins here who\u0027s brain works in C and PHP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EKeep up the good work!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, and I hope you and others find the unique quirks of KerboScript more endearing than annoying!\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-09-05T15:00:52Z","Content":"\n\u003Cp\u003EI\u0027m not sure what I\u0027m doing wrong, but I can\u0027t persuade kOS to control my heading. I\u0027ve tried simple tests, like \u0022LOCK STEERING TO PROGRADE.\u0022 both in direct commands and executed scripts. The craft can be rotated manually, but kOS just won\u0027t do anything. Am I missing something silly?\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2013-09-05T15:04:13Z","Content":"\n\u003Cp\u003ELocking steering with direct commands will only nudge your ship slightly in the right direction.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure you have to lock steering and keep that script from ending, so put it in a loop or tell the script to wait until whatever.\u003C/p\u003E\u003Cp\u003EAlso turn SAS off.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-09-05T15:07:23Z","Content":"\n\u003Cp\u003EHmm, that makes sense.\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T15:12:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003ELocking steering with direct commands will only nudge your ship slightly in the right direction.\u003Cp\u003EI\u0027m pretty sure you have to lock steering and keep that script from ending, so put it in a loop or tell the script to wait until whatever.\u003C/p\u003E\u003Cp\u003EAlso turn SAS off.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESAS is probably the most common thing because under the new system, you expect the craft to rotate at will when it\u0027s on.\u003C/p\u003E\u003Cp\u003EI may implement a fix that automatically shuts off SAS whenever the steering is locked.\u003C/p\u003E\u003Cp\u003EEDIT: And the script ending only applies of course if you\u0027re in a program, the original post seemed to indicate that he had also tried doing it as an immediate mode command.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-09-05T15:21:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003Ethe original post seemed to indicate that he had also tried doing it as an immediate mode command.\u003C/div\u003E\u003C/blockquote\u003E That is accurate. Also, SAS was off. My exact steps: \u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBe in space. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERight click on kOS part to activate and bring up the command prompt. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Type \u0022LOCK STEERING TO PROGRADE.\u0022 \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Press Enter. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E At the end of all this, nothing has happened.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T15:25:50Z\u0022 title=\u002209/05/2013 03:25  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by dahud\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2013-09-05T15:45:18Z","Content":"\n\u003Cp\u003EI don\u0027t know if this has been mentioned already but I\u0027ve found a conflict with Improved Maneuver Nodes. Pressing o while typing will open the node dialogue in map view, and briefly flash it in ship view.\u003C/p\u003E\n"},{"CreatedByName":"curiousepic","CreatedById":60039,"CreatedDateTime":"2013-09-05T15:58:24Z","Content":"\n\u003Cp\u003EWhat I would LOVE to see, after we have the ability to refer to specific parts, is the option to restrict what flight statistics a script can access by those parts, and/or from telemetry with other vessels or KSC. (And perhaps a supplementary mod that adds additional sensor parts).\u003C/p\u003E\u003Cp\u003EI like how KSP is the only game where I say \u0022I want to HAVE to do X\u0022!\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T16:44:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EThat is accurate. Also, SAS was off. My exact steps: \u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBe in space. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERight click on kOS part to activate and bring up the command prompt. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Type \u0022LOCK STEERING TO PROGRADE.\u0022 \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Press Enter. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E At the end of all this, nothing has happened.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you look at the bottom left, do you see the controls moving as though it\u0027s trying to turn?\u003C/p\u003E\u003Cp\u003EDo you lose your flashing cursor at any point? That would indicate that an uncaught exception\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2013-09-05T16:49:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003EIf you look at the bottom left, do you see the controls moving as though it\u0027s trying to turn? Do you lose your flashing cursor at any point? That would indicate that an uncaught exception\u003C/div\u003E\u003C/blockquote\u003E I almost sprayed coffee on my monitor when I read that last . . . fragment.\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T16:54:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022curiousepic\u0022 data-cite=\u0022curiousepic\u0022\u003E\u003Cdiv\u003EWhat I would LOVE to see, after we have the ability to refer to specific parts, is the option to restrict what flight statistics a script can access by those parts, and/or from telemetry with other vessels or KSC. (And perhaps a supplementary mod that adds additional sensor parts).\u003Cp\u003EI like how KSP is the only game where I say \u0022I want to HAVE to do X\u0022!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, some of this will come true. I already have a plan to take the scientific instruments and expose their outputs and make sure that you can\u0027t get those values without those instruments on board.\u003C/p\u003E\u003Cp\u003EOn that note, you will soon need at least one antenna if you want to access your Archive drive from space and more if you\u0027re more than 150 km from the surface of Kerbin. It\u0027ll use the same rules as targetting, you get 75km for free, each additional antenna gives you another 75km, and then that number is multiplied by 10 for every comm dish.\u003C/p\u003E\u003Cp\u003EIt\u0027s so true about KSP. All of the fun of a sandbox game comes from finding your own solution to problems that are hard to solve.\u003C/p\u003E\n"},{"CreatedByName":"Kalista","CreatedById":67544,"CreatedDateTime":"2013-09-05T16:57:46Z","Content":"\n\u003Cp\u003EBy antenna and dish you mean just the stock ones right? or will the mod be able to tell if a mod antenna is a real antenna and run off it as well.\u003C/p\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T17:23:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kalista\u0022 data-cite=\u0022Kalista\u0022\u003E\u003Cdiv\u003EBy antenna and dish you mean just the stock ones right? or will the mod be able to tell if a mod antenna is a real antenna and run off it as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes the stock ones. And if a mod has an antenna that people want to use I would have to add that in manually.\u003C/p\u003E\u003Cp\u003EThere doesn\u0027t appear to be an antenna partmodule that I can detect, so I have to go by the part names \u0022commDish\u0022 and \u0022longAntenna\u0022.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-09-05T17:25:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003EIf you look at the bottom left, do you see the controls moving as though it\u0027s trying to turn? Do you lose your flashing cursor at any point? That would indicate that an uncaught exception\u003C/div\u003E\u003C/blockquote\u003E The rotation axis dials don\u0027t move, it\u0027s not even trying to turn. I don\u0027t remember whether the cursor was blinking or not at that particular time, but I do remember the console falling into a bad state a few times. For example, sometimes the console would stop displaying text in realtime, and would only display the command after I press Enter. Do unhandled exceptions bubble up to the ALT-F2 window? If not, do you dump them anywhere? EDIT: BBCode really doesn\u0027t like line breaks today.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T17:30:00Z\u0022 title=\u002209/05/2013 05:30  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by dahud\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KevinLaity","CreatedById":68050,"CreatedDateTime":"2013-09-05T17:37:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003Esometimes the console would stop displaying text in realtime, and would only display the command after I press Enter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s definitely an exception when that happens. And it also happens if you try to type into a terminal that was opened from a ship that is now destroyed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EDo unhandled exceptions bubble up to the ALT-F2 window? If not, do you dump them anywhere? EDIT: BBCode really doesn\u0027t like line breaks today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really use alt-f2 much, but they do get dumped in an output file in your KSP folder. (I can\u0027t remember exactly where it is right now)\u003C/p\u003E\u003Cp\u003EThis is definitely worth exploring further. What happens if you try to lock the steering of a craft that\u0027s still on the pad?\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-09-05T18:17:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003E This is definitely worth exploring further. What happens if you try to lock the steering of a craft that\u0027s still on the pad?\u003C/div\u003E\u003C/blockquote\u003E I haven\u0027t tried that. All my experimentation has been in orbit. Idea: is there any architectural reason you can\u0027t pipe unhandled exceptions onto the console? It makes sense in-universe, it is a computer after all. For bug tracking purposes: I\u0027m using the latest Steam version of KSP, on Windows 8 64-bit. The only mod running alongside this was Kerbal Engineer Redux, dunno what version. Also, you know what would be really nice? Functions. Or at least the ability for programs to return values to the program that called it.\n"},{"CreatedByName":"jsalexan","CreatedById":78290,"CreatedDateTime":"2013-09-05T18:37:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KevinLaity\u0022 data-cite=\u0022KevinLaity\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI definitely want to give mod developers a way to join in, in ways that each mod doesn\u0027t require the other, but that they can optionally work together. I\u0027ve been in some talks with the creator of infernal robotics about this. I did notice in one of my DLL fishing expeditions something about messaging for parts. This might hold the key.\u003C/p\u003E\u003Cp\u003EWhat I\u0027d like is for mod developers to be able to register their own bindings and maybe even commands with kOS. And/or let kOS send strings to a part that have commands in them. Like TELL kethaneDrill TO \u0022Deploy Drill\u0022.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKevin, I\u0027ve been looking into this pretty deep because I REALLY REALLY want it to work with infernal robotics.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETLDR; Version:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECreate two things in your code:\u003C/p\u003E\u003Cp\u003EKOS-Vars(key,value)\u003C/p\u003E\u003Cp\u003Eadds or updates the key value pair in your variables collection\u003C/p\u003E\u003Cp\u003Ealias the script processor \u0022tell\u0022 command to unityengine.sendmessage(methodname,message,value)\u003C/p\u003E\u003Cp\u003EYou\u0027re done.\u003C/p\u003E\u003Cp\u003EThe rest is up to the other plugin authors to implement.\u003C/p\u003E\u003Cp\u003EThey\u0027d need to implement the public method your code would call with 2 parameters per the sendmessage documentation.\u003C/p\u003E\u003Cp\u003EThey could set values via calling unityengine.sendmessage (\u0022KOS-Vars\u0022,key,value)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELonger wordy version:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhat could be done would be to send a message to the root node (these propagate downwards to all other elements on the vessel).\u003C/p\u003E\u003Cp\u003Ethe message could consist of a string containing a group address, a command and a value.\u003C/p\u003E\u003Cp\u003EYou would simply implement two routines: a method to do the sendmessage broadcast to the entire vessel and a callback routines that would take variable name/value pairs and turn them into internal variables.\u003C/p\u003E\u003Cp\u003EThis command: Tell \u0022IR-Interface\u0022 \u0022Group1/MOVE\u0022 -5.\u003C/p\u003E\u003Cp\u003ECalls: UnityEngine.SendMessage(\u0022IR-Interface\u0022, \u0022Group1/Move\u0022, -5) behind the scenes\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://docs.unity3d.com/Documentation/ScriptReference/GameObject.SendMessage.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.unity3d.com/Documentation/ScriptReference/GameObject.SendMessage.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen it\u0027s up to the mod creator to implement an \u0022IR-Interface\u0022 method that parses the command string and moves group \u0022Group1\u0022 to current position -5.\u003C/p\u003E\u003Cp\u003EIf a plugin doesn\u0027t support your event, it\u0027s ignored.\u003C/p\u003E\u003Cp\u003EAny mod developer that implemented an IR-Interface using the same format of commands would be controllable via this method.\u003C/p\u003E\u003Cp\u003EThe IR-Interface would do a sendmessage to \u0022KOS-Vars\u0022 telling it \u0022\u0026lt;IR\u0026gt;Group1Value\u0022 = 14\u003C/p\u003E\u003Cp\u003EThis method would be useable, expandable and would not require much coding on your part at all and by creative use of enumerator strings you could Tell \u0022IR-Interface\u0022 \u0022ListGroups\u0022 \u0022IRGroups\u0022 and get a message back of \u0022IRGroups\u0022 \u0022Group1/Group2/Group3\u0022 on your KOS-Vars Interface\u003C/p\u003E\u003Cp\u003EThe downside of doing this is that there would be nothing stopping you from calling any public method on any part so you may want to lock out the built in part commands.\u003C/p\u003E\u003Cp\u003ETell \u0022explode\u0022. ENTIRE ship blows up\u003C/p\u003E\u003Cp\u003ETell \u0022Activated\u0022 1\u0022. Everything on the ship activates\u003C/p\u003E\u003Cp\u003EOne good thing is that you wouldn\u0027t have to worry about getting addresses for specific parts, the downside is that unless the part plugins themselves kept a list of their own and provided that in the interface (Infernal Robotics does), you wouldn\u0027t have any way to direct commands to only specific parts.\u003C/p\u003E\u003Cp\u003EThis is actually the method I\u0027m going to try to hack together this weekend on my own just to see if I can. \u003C/p\u003E\u003Cp\u003EIf you\u0027re interested in anything that comes out of it, I will PM you the code for rewriting to get the spaghetti out and include it in the core codebase. If I can get it to flash the lights on the ship on a timer in a loop via this method, it\u0027ll count as a working proof of concept and I\u0027ll then try to somehow bribe sirkut into implementing a command handler on his side (or take a stab at it myself for my own use) at that point.\u003C/p\u003E\u003Cp\u003EIt should be fairly trivial to make this work from the KOS side.\u003C/p\u003E\u003Cp\u003EJeff\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T18:56:35Z\u0022 title=\u002209/05/2013 06:56  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by jsalexan\u003C/strong\u003E\n\u003Cbr\u003EBrain fart\n\u003C/span\u003E\n"}]}