{"TopicId":43725,"ForumId":20,"TopicTitle":"Adding Sounds","CreatedByName":"kev061","CreatedById":79171,"CreatedDateTime":"2013-08-24T17:18:26Z","PageNum":1,"Articles":[{"CreatedByName":"kev061","CreatedById":79171,"CreatedDateTime":"2013-08-24T17:18:26Z","Content":"\n\u003Cp\u003EI have started this thread for information about adding WORKING sounds.\u003C/p\u003E\u003Cp\u003EThere are a few tutorials out there, but they no longer work with the current format of KSP. Simply adding sound files and changing the config files within the parts (like Squad has done) does not work either.\u003C/p\u003E\u003Cp\u003EI am wondering if there is a source somewhere that I might have missed or for information for us that want to add/edit sounds within the game or within personal mods. Any info (that currently works with 0.21) would be greatly appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-08-24T17:26:11Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45691-Ripping-my-hair-out-Sounds\u0022 rel=\u0022external nofollow\u0022\u003EHere\u003C/a\u003E we have a similar thread. It among others contains how i changed my mainsail sound, what might be exactly what you are interested in. Doing it like squad does work, but you have to place (\u0026amp; name) your sounds very... \u0022strictly\u0022.\n"},{"CreatedByName":"kev061","CreatedById":79171,"CreatedDateTime":"2013-08-24T18:47:10Z","Content":"\n\u003Cp\u003EThis did not work for me either. I am trying to add a sound to a docking port when it is docked and one for undocking. It might be my command line in my config file... but adding = activate (or) = engage (or) = disengage after sound_file_name do not work. Is there a resource that tells us what other commands we can use in config files to activate a sound on a certain item?\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-08-25T11:27:31Z","Content":"\n\u003Cp\u003EHm thats odd, \u003Ca href=\u0022http://db.tt/Qcp4QPhz\u0022 rel=\u0022external nofollow\u0022\u003Ethat music mainsail\u003C/a\u003E is working fine for me.\u003C/p\u003E\u003Cp\u003ESo you do not want to replace stock music but add sth? All the cfg part can do is create an FXGroup for your sound and a name if you are successful, you can even see that in your ksp.log:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E[LOG 13:09:27.510] PartLoader: Compiling Part \u0027Faark/Part/musicMainsail/part/musicMainsail\u0027\u003Cbr\u003E[LOG 13:09:27.545] Added sound_editorLoop01 to FXGroup running\u003Cbr\u003E[LOG 13:09:27.549] Added sound_explosion_low to FXGroup flameout\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnyway, if the game does not tries to use your FXGroup, it obviously wont work. I\u0027m not sure how the game actually handles FXGroups, but you might have to create a part module that detects when sth is docking/undocking and fires you fxgroup with sth like that:\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Epart.findFxGroup(\u0022uncouple\u0022).Burst();\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"kev061","CreatedById":79171,"CreatedDateTime":"2013-08-25T16:02:53Z","Content":"\n\u003Cp\u003EFirst off, thanks for your time and effort Faark. I am afraid that it was all for nothing. To be honest, I am a beginner when it comes to modding. After spending many hours trying to get one simple sound to work, I have realized that this is not for me. Once I do figure it out, squad will change the game format again and I will be at square one. It has left such a bad taste in my mouth that I am no longer even interested in playing KSP so I uninstalled it.\u003C/p\u003E\n"}]}