{"TopicId":43730,"ForumId":16,"TopicTitle":"Understanding Maneuver nodes for non orbit maneuvers","CreatedByName":"helgeras","CreatedById":30209,"CreatedDateTime":"2013-08-24T18:40:39Z","PageNum":1,"Articles":[{"CreatedByName":"helgeras","CreatedById":30209,"CreatedDateTime":"2013-08-24T18:40:39Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI understand how to use manoeuvre nodes to alter an orbit. But have no idea what is going on when I try to use one to fly to another body such as Minmus.\u003C/p\u003E\u003Cp\u003EFor instance, when I pull the prograde hotspot, I see a yellow ellipsis expand. That one I understand, as this is the orbit I will get into.\u003C/p\u003E\u003Cp\u003EHowever, if I keep adding more prograde, suddenly the yellow ellipsis is cut off, a white piece of curve is added and then a new green ellipsis. \u003C/p\u003E\u003Cp\u003EThere is a circle marked Mun encounter, and further out another circle marked Mun escape. \u003C/p\u003E\u003Cp\u003EIf I move the node so that Mun does not interfere with the node, then yellow ellipsis will expand past the Minmus orbit but then suddenly just be cut off with a circle marked Kerbin escape, and another line, this time violet, shows up.\u003C/p\u003E\u003Cp\u003EWhat does all these lines mean? It certainly cannot be my projected path.\u003C/p\u003E\u003Cp\u003EI have tried to search the wiki and see several Youtube tutorials, but they explain the orbit change stuff in detail, then lightly skip over this more complex part.\u003C/p\u003E\u003Cp\u003ECan you point me to a tutorial explaining this part of the maneuver node system?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-24T18:49:31Z","Content":"\n\u003Cp\u003EEvery time you get a new line color, you are in the sphere of influence of a new celestial body. The encounter and escape markers mark SoI changes for arrival and departure respectively. Minmus is inclined so how you get to it is you drag out prograde to minmus orbit distance. Unlike the Mun, you have to lead minmus with about a 120* phase angle while the Mun only needs 45* lead angle. Minmus is inclined so set it as target and you will get closest approach markers. You want to get these as on top of each other as you can. Then change the view so you can see if you are above or below and adjust using the normal and antinormal (purple node icons) to change inclination up and down respectively. SOmetimes this inclination change is best done mid-transfer.\u003C/p\u003E\u003Cp\u003EOnce you do that, you should get a blue line (current orbit) and a yellow line indicating your trajectory relative to Kerbin while in the Minmus SoI. You will also see a third color (green or violet) that indicates either an altered Kerbin orbit or a Kerbin escape into solar orbit. Once you reach the yellow, it will change to a blue line indicating your trajectory relative to Minmus. Burn at periapsis to circularize and complete the orbit around Minmus.\u003C/p\u003E\u003Cp\u003ECongratulations, if you follow this correctly, you will have just completed your first Minmus transfer.\u003C/p\u003E\u003Cp\u003EIf this doesn\u0027t help you, go to youtube and find Scott Manley. He has a bunch of tutorials that are great for KSP beginners and non-beginners alike who need help with something.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-08-24T18:56:39Z","Content":"\n\u003Cp\u003EFirst off, welcome to the forums!\u003C/p\u003E\u003Cp\u003EHere\u0027s what\u0027s happening: Your orbit as projected by the maneuver nodes is leaving the Sphere of Influence of Kerbin (basically the zone where Kerbin\u0027s gravity has an influence on your ship) and is entering the Sphere of Influence of the Mun. The point at which that happens is the spot marked \u0022Mun encounter.\u0022\u003C/p\u003E\u003Cp\u003EOnce you\u0027re within the Mun\u0027s SoI, instead of Kerbin, the Mun becomes the body exerting gravity on your spacecraft,* bending the shape of your orbit slightly. If you were to burn retrograde to cancel out some of your orbital velocity at this point, you would eventually end up with an orbit around the Mun. However, because your spacecraft would be moving so quickly, if you didn\u0027t perform any maneuvers and just let the craft coast, you\u0027d eventually leave the Mun\u0027s SoI again at the point marked \u0022Kerbin escape\u0022 (unless you\u0027re on a crash course aimed straight at the Mun -- if there\u0027s no \u0022Mun periapsis\u0022 marker, that\u0027s probably what\u0027s going to happen instead). The path after that point is your craft\u0027s new orbit around Kerbin, because your craft\u0027s original orbit was bent slightly by passing close to the Mun.\u003C/p\u003E\u003Cp\u003EIn short, you\u0027ve just plotted either a Munar flyby and return to Kerbin, or a Munar impact.\u003C/p\u003E\u003Cp\u003ELikewise, if you accelerate even faster, you\u0027ll eventually exceed Kerbin\u0027s escape velocity and end up in an orbit around the Sun. If you zoom out on the map further, you should see that that violet curve you mentioned forms an ellipse around the Sun itself.\u003C/p\u003E\u003Cp\u003EFor a slightly more in-depth explanation of what\u0027s going on, and how you can apply it practically, I\u0027d highly recommend reading \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25029-A-moon-rocket-for-newbies\u0022 rel=\u0022external nofollow\u0022\u003EVanamonde\u0027s \u0022Trip to the Moon\u0022 tutorial\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* In the real world, of course, every body is acting on every other body at the same time. KSP uses a simplified model called \u0022patched conic approximation,\u0022 in which only one body (the Sun, Kerbin, the Mun, or another planet or body) acts on your spacecraft at any given time, basically to allow you to play the game on something other than a Cray supercomputer. The planets and moons themselves are \u0022on rails,\u0022 following predetermined orbits coded into the system, for the same reason.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-24T19:02:19Z\u0022 title=\u002208/24/2013 07:02  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 24, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003Cbr\u003EAdding a link to Vanamonde\u0026#039;s tutorial.\n\u003C/span\u003E\n"}]}