{"TopicId":43769,"ForumId":16,"TopicTitle":"Seeking advice for my first space station.","CreatedByName":"Moencino","CreatedById":79498,"CreatedDateTime":"2013-08-25T00:42:31Z","PageNum":1,"Articles":[{"CreatedByName":"Moencino","CreatedById":79498,"CreatedDateTime":"2013-08-25T00:42:31Z","Content":"\n\u003Cp\u003ESo I\u0027d like to build a station in Munar orbit. I\u0027ve seen some beautiful designs out there, but the part addons seem to be for previous versions of the game. Any suggestions as to which station parts are worth downloading? Any other advice or useful links for someone new to building a station would be much appreciated. Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T05:43:06Z\u0022 title=\u002208/26/2013 05:43  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by Moencino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2013-08-25T01:31:20Z","Content":"\n\u003Cp\u003EYou can actually build some pretty neat station parts yourself just using stock bits and pieces! The very first station in a well-known 0.19 re entry compilation looks like it\u0027s been made entirely with stock parts, some rotated using the shift key to go in 5 degree increments rather than 90 degree.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Lv6C4vhnIfU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EParts aside, I would recommend building a station in Kerbin orbit, and then using nuke engines to push it slowly out to Munar orbit. Try to make all of your parts link up linearly, front-to-back rather than having stuff sticking out the side, at least for your first station. Accelerating with stuff docked to the side can result in a highly wobbly space station that tears itself to bits. Nuke engines are weak enough to not destroy your construction, while at the same time being highly efficient.\u003C/p\u003E\u003Cp\u003EAlso the new, Senior docking port does seem a little more solid, and handy for docking Rockomax-size bits together.\u003C/p\u003E\n"},{"CreatedByName":"Keome","CreatedById":72332,"CreatedDateTime":"2013-08-25T01:41:47Z","Content":"\n\u003Cp\u003EThese two have some wonderfully designed station parts (or Mun base parts, rocket parts, whatever, use your imagination!).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/fustys-station-nodes-new-karmony-node-2-5m-crewtank/\u0022 rel=\u0022external nofollow\u0022\u003EFustek Station Parts\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/fustek-station-parts-expansion/\u0022 rel=\u0022external nofollow\u0022\u003EFustek Station Parts Expansion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESome tips:\u003C/p\u003E\u003Cp\u003EIt\u0027s easier to make the base in separate modules that dock together, much like how real-life stations have been constructed. Go research the ISS and see how it was built piece by piece.\u003C/p\u003E\u003Cp\u003EWatch your parts count. More parts = more lag. If a part serves no purpose, do not add it. Do not add too many lights. Do not attach battery packs everywhere when the 1k and 4k batteries provide the same capacity with fewer parts. Do not add lots of solar panels.\u003C/p\u003E\u003Cp\u003EDo not add to many lights. Yes, I repeated that. Lights add to the CPU overhead and create lag. You only need enough lights to illuminate your docking ports. Fustek\u0027s parts include lights on some modules that you can use as markers for where your docking ports are. Use those instead off adding more lights ... more lights = more parts. For example, the habitat module has three round lights. The docking module I place on my stations next to it, closer to the command cupola. I only need the three lights on the habitat module to tell me exactly where the docking ports are. My stations have no extra lights beyond what the parts come with.\u003C/p\u003E\u003Cp\u003EIt is not necessary to add lots of docking ports for ships. Trust me. Parts count = lag, you\u0027re not going to want to try docking to something with a horrific parts count because you want to fill every docking port. NASA and the ESA have plans for a Moon base capable of supporting six spacecraft at once. The ISS I believe supports a total of four? (I should go look that up) spacecraft. Add what you need, not what you wish you had.\u003C/p\u003E\n"},{"CreatedByName":"Moencino","CreatedById":79498,"CreatedDateTime":"2013-08-25T03:49:01Z","Content":"\n\u003Cp\u003EThanks very much to you both for taking the time to share your feedback. Tech, in that awesome video you linked are rotating rings like in 2001. Do you know which addon that is? Looks amazing, but Google isn\u0027t helping me track it down.\u003C/p\u003E\u003Cp\u003EI\u0027ve been given the distinct impression that part count is really important! I haven\u0027t had any lag issues yet, and know that would seriously detract from the game for me. I\u0027ll endeavour to keep part count to a minimum as suggested. And I agree that myriad docking ports seems unimportant: if I had 4, I\u0027m sure that would be more than sufficient. While I could certainly put a station together with stock parts, some folk have put together such beautiful addon parts, that it would be a shame not to use those as well. Any other suggestions of handy addons for this project would be appreciated. Thanks again!\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2013-08-25T04:49:17Z","Content":"\n\u003Cp\u003EI\u0027m not sure, but I think the rotating rings are Bobcat\u0027s inflatable habitat rings from the HOME modules.\u003C/p\u003E\u003Cp\u003ESee also here: \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-h-o-m-e-start-kit/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-h-o-m-e-start-kit/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-08-25T05:40:54Z","Content":"\n\u003Cp\u003EIn my personal opinion, the best looking space station parts pack ever created will always be \u003Ca href=\u0022http://kerbalspaceprogram.com/kosmos-tks-spacecraft/\u0022 rel=\u0022external nofollow\u0022\u003EKosmos Space Station Parts Pack\u003C/a\u003E, but be wary, the pack doesn\u0027t lend itself well to a game with many other mods. The pack is so well-done that it uses pretty high-res textures and is fairly large. (I think the textures are the issue, maybe the models too, but it takes up a bit of space). Obviously, if you have too many mods, it will crash the game, so be careful of that.\u003C/p\u003E\u003Cp\u003EHere are some packs that are a bit more conservative, though not nearly as complete as the Kosmos SSPP:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/32179-WIP-Large-Structural-Components-for-KSP-20-Image-Heavy\u0022 rel=\u0022external nofollow\u0022\u003EUdk_Lethal_Dose\u0027s Large Structural Components\u003C/a\u003E. I really like this pack, as they all fit pretty well in a stock game, style-wise. They\u0027re really cool. It doesn\u0027t look like it\u0027s been updated since .20.2, but not to worry, I\u0027m running them right now and they work just fine! No IVAs, but the windows all light up, and some parts consume electricity, like they should, as it takes electricity for life support. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs some other users have mentioned, \u003Ca href=\u0022http://kerbalspaceprogram.com/fustys-station-nodes-new-karmony-node-2-5m-crewtank/\u0022 rel=\u0022external nofollow\u0022\u003EFustek Station Parts\u003C/a\u003E is a great place to start if you just want to add a bit of functionality to your station. The parts don\u0027t look perfectly stock, but they do fit in well with stock parts, and they\u0027re very well modeled, with a complete IVA. I personally love these parts. It also comes with a large static solar panel, which I find particularly useful for squeezing power generation out of those big empty walls of modules. \u003C/p\u003E\u003Cp\u003EThere\u0027s also the \u003Ca href=\u0022http://kerbalspaceprogram.com/fustek-station-parts-expansion/\u0022 rel=\u0022external nofollow\u0022\u003EFustek Parts Expansion\u003C/a\u003E which basically proves how good Fustek is. It actually.. Wait whoa, I haven\u0027t looked at the dev thread for this mod in a while and it looks like they added quite a bit more to it! I\u0027ll have to re-download! As you can see, everything is excellently modeled, however I dislike that the modules, last I checked, tend to use the IVA off of the Karmony (Fustek) 6-man module with the window, as they look different externally. Hrm. That\u0027s alright, it\u0027s still a great mod. Try it out!\u003C/p\u003E\u003Cp\u003ELastly, if you\u0027re doing any kind of large construction in space, check out another invention by Fustek, the \u003Ca href=\u0022http://kerbalspaceprogram.com/common-berthing-mechanisms-2-5m-docking-ports-2/\u0022 rel=\u0022external nofollow\u0022\u003ECommon Berthing Mechanism\u003C/a\u003E. This mod adds a number of \u0022Berthing Ports\u0022 to the game. Don\u0027t worry, there\u0027s a size that\u0027s compatible with the stock docking ports! The mod comes with four sizes, and two styles of berthing mechanisms. You get, a passive and active version of the .625, 1.25, 2.5, and even 3.75m ports! So, they\u0027re pretty big if you need \u0027em big. Passive and active is JUST the style, it doesn\u0027t affect how they dock. But here\u0027s the best part of these parts: They\u0027re VERY rigid in space. They\u0027re much stronger than any stock docking ports, so they\u0027re ideal for station construction. I find these to be indispensable to any serious station building project. \u003C/p\u003E\u003Cp\u003ESo, with those suggestions in mind, why not try making a station? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, if you need a bit of help getting your modules into orbit, why not try my lifter, the \u003Ca href=\u0022http://kerbalspaceprogram.com/nexus-aerospace-betegeuse-1-heavy-lifter/\u0022 rel=\u0022external nofollow\u0022\u003EBetelgeuse-1 Heavy Lifter\u003C/a\u003E. It\u0027s a monster of a rocket that can reliably loft up to 65 tons to LKO. I\u0027ve been working on this rocket since before the big April maneuver, so it\u0027s been pretty well refined. It should lift just about any station module you can throw at it, with fuel to spare in the orbital insertion stage, that also contains a small supply of RCS fuel, so you can use that stage to rendezvous and dock your modules, and likely it will still have enough fuel to de-orbit after you dock, as the insertion stage also contains a probe core, so you don\u0027t even need to add a probe core to your modules! It really should be that easy, unless you\u0027re building a much higher orbit station. You will need KW rocketry to use it, but it should work pretty well, as it\u0027s the backbone of my space program. Let me know if you decide to try it, I\u0027ve never heard any stories from anyone who uses it for station building in LKO other than myself. \u003C/p\u003E\u003Cp\u003E-M5K \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-25T05:48:27Z","Content":"\n\u003Cp\u003EAll good advice - I use stuff from most of these mods, but honestly, I have fun building stations completely out of stock parts too! The wiki has articles for building Mir or the beginnings of the ISS completely from stock:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Salyut_programme\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:Salyut_programme\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:_ISS\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:_ISS\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-08-25T15:01:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EParts aside, I would recommend building a station in Kerbin orbit, and then using nuke engines to \u003Cstrong\u003Epush\u003C/strong\u003E it slowly out to Munar orbit. Try to make all of your parts link up linearly, front-to-back rather than having stuff sticking out the side, at least for your first station. Accelerating with stuff docked to the side can result in a highly wobbly space station that tears itself to bits. Nuke engines are weak enough to not destroy your construction, while at the same time being highly efficient.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t see this before but I might add one thing, when you have very large structures, or things that are especially long, it may be advantageous to actually \u003Cem\u003Epull\u003C/em\u003E the module, not push. If you push, you are introducing the possibility for something to start bending, and you begin to be severely limited on the size you can move. If you, instead, pull the station, the mere fact that you are accelerating will keep the station nice and straight.\u003C/p\u003E\u003Cp\u003ESo, with that, maybe try to design your station to accept an orbital tug that will pull instead of push, as it\u0027s a generally accepted, but of course not mandatory \u0022building code\u0022 for large ship building. \u003C/p\u003E\u003Cp\u003EAlso, technicalfool is correct in saying that it would be easier to build the station in LKO then transfer to LMO, rather than build it in LMO. I\u0027ve built several stations before, and I have to say that it is FAR easier to build in LKO in terms of your rocket. I built a station in LMO one time, and it took me several days to get something about the size of Skylab. In contrast, I can construct a station as large as the ISS in one day when in LKO, with the modifier that I don\u0027t get bored from how tedious it can be.\u003C/p\u003E\u003Cp\u003EAlso also, he\u0027s pretty right in saying that it would be easier to keep the station in straight parts, as it tends to be less wobbly. Maybe build your station in several large sections that are all straight by themselves, transport those individually to LMO via some orbital tug, then dock them together there.\u003C/p\u003E\u003Cp\u003ESo yes, very sound advice, but I\u0027d put your tug on the \u0022front\u0022 and make it a puller, not a pusher.\u003C/p\u003E\u003Cp\u003E-M5K\u003C/p\u003E\n"},{"CreatedByName":"DeathSpank","CreatedById":78947,"CreatedDateTime":"2013-08-26T08:40:12Z","Content":"\n\u003Cp\u003EHi! I\u0027ll hijack this thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E,which gave me lots of new info in building my first station thanx, for two questions...\u003C/p\u003E\u003Cp\u003EI\u0027m looking for a mod that adds those greeny modules i saw on a pic, dont know if it exists but heres and image of them:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/4aBLc\u0022 alt=\u00224aBLc\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyone knows if it exists? Or what the name of the mod is?\u003C/p\u003E\u003Cp\u003EMy second question is about a module rocket launcher... Im having big problems building a rocket with suficiant fuel (or TWR ratio) to get my modules into Kerbin orbit. My first payload//module is about 26t so any tips regarding a payload//module delivering rocket would be nice \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-09-17T22:33:47Z","Content":"\n\u003Cp\u003EBio-Fuels mod \u003Ca href=\u0022http://kerbalspaceprogram.com/renewable-bio-fuel-modules/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/renewable-bio-fuel-modules/\u003C/a\u003E\u003C/p\u003E\n"}]}