{"TopicId":43867,"ForumId":16,"TopicTitle":"Teaching myself to dock, what\u0026#039;s wrong with my orbit?","CreatedByName":"Commander Wilmot","CreatedById":79717,"CreatedDateTime":"2013-08-25T21:17:26Z","PageNum":1,"Articles":[{"CreatedByName":"Commander Wilmot","CreatedById":79717,"CreatedDateTime":"2013-08-25T21:17:26Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JW9FE\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI am in this orbit, but I can\u0027t arrange an intercept closer than 2.5-3.1 kms. Can anyone figure out if I am doing something wrong?\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-08-25T21:19:02Z","Content":"\n\u003Cp\u003E2.5 km should be more than enough for a visual approach. Did you try watching Scott Manley\u0027s video?\u003C/p\u003E\u003Cp\u003EIf you simply can\u0027t do it, be sure to PM me and I\u0027ll send you a written docking guide. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-08-25T21:22:57Z","Content":"\n\u003Cp\u003EIf you\u0027re out of plane and have different orbital dimensions there is a minimum separation in most cases. If you reduce your inclinatation relative you\u0027ll find you can get much closer approaches. That said 2-3km is plenty close for a quick scoot to co-location.\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-25T21:24:59Z","Content":"\n\u003Cp\u003EThis will help as well\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/dock-align-indicator/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/dock-align-indicator/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-08-25T21:30:54Z","Content":"\n\u003Cp\u003EIt takes time to learn how to get closer intercepts, I manages to get a coliding encounter from over 2/3 an orbit away\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-25T21:36:56Z","Content":"\n\u003Cp\u003EFWIW, I\u0027ve made an in-game rendezvous tutorial mod, perhaps it\u0027s a bit of help. (see signature)\u003C/p\u003E\u003Cp\u003EAlso, what Frederf said: If you can\u0027t get the intercept any closer, it\u0027s most definitely the relative inclination that is off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T21:45:42Z\u0022 title=\u002208/25/2013 09:45  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-25T21:47:41Z","Content":"\n\u003Cp\u003EDistance depend a bit of both resolution of the node manager. Can you plot an closer approach? but also of how well you can fine tune an burn. A upper stage with an mainsail and a almost empty tank is very hard to do an 0.1 m/s accuracy burn with. \u003C/p\u003E\u003Cp\u003EOverall the orbits look nice, now you make an new node at the bottom intercept who zero out the speed pretty well, do that burn and leave map mode view and burn to reduce speed relative to target down to 0-0.2 m/s (green marker with cross in center), then towards the target (pink marker with dot in center) at some speed say 15 m/s, you might want to use warp here after you turn your ship to burn to cancel speed again. Do this burn then the pink and green marker get to wide apart (60-90 degree), reduce speed to 0-0.1 again, this time you should be perhaps 3-500 meter from target so repeat the process again, I restrict speed to 1% of distance so 5 m/s at 500 meter. Do this again and if you are lucky you get inside of 50 meter, if not just repeat.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-08-25T23:15:59Z","Content":"\n\u003Cp\u003EYour orbits seem to be on wildly different planes. You first have to align your planes (by burning normal or antinormal at the ascending or descending nodes). Once your planes are lined up, it\u0027s just a matter of timing your Hohmann Transfer.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-26T00:45:04Z","Content":"\n\u003Cp\u003EYour orbit is fine. To rendezvous, you don\u0027t need matched orbits... you just need a close encounter. And you\u0027re getting plenty close enough.\u003C/p\u003E\u003Cp\u003E Once you have an intercept within a few kilometers, close the map and quit even thinking about your orbits, because any differences there are now irrelevant.\u003C/p\u003E\u003Cp\u003E When you get to the minimum distance, make sure your NavBall is in Target mode and match velocities by aiming at the yellow retrograde marker then burning until your relative velocity reaches zero. From there, you can simply point directly at your target and thrust toward it to begin the docking approach.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T00:47:23Z\u0022 title=\u002208/26/2013 12:47  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commander Wilmot","CreatedById":79717,"CreatedDateTime":"2013-08-26T01:05:53Z","Content":"\n\u003Cp\u003EThanks for the replies. I am using the LV-909 I believe. I will try to do the plugin tutorial and re-watch and reread the Scot Manley and wiki materials on orbital docking maneuvers. I think this pretty good for a first attempt at setting up a docking. I would like to keep this thread open in case I have any more issues before I resolve this.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-26T14:45:04Z","Content":"\n\u003Cp\u003EIndeed, 2.5km is plenty close for a rendezvous. Unless your relative speed is huge, you have plenty of time to match velocities and the target will be \u0022visible\u0022 at that distance. I\u0027ve actually gotten into the habit of starting at an even larger intercept distance.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-08-26T15:43:30Z","Content":"\n\u003Cp\u003EGood luck! Docking is the toughest bit of the game. I broke down and got MechJeb as there have been some times I was frustrated as anything trying to get some docks. Yeah, it\u0027s a cheat, but keep it handy to save your sanity, IMHO.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-26T16:03:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ArmchairGravy\u0022 data-cite=\u0022ArmchairGravy\u0022\u003E\u003Cdiv\u003EGood luck! Docking is the toughest bit of the game. I broke down and got MechJeb as there have been some times I was frustrated as anything trying to get some docks. Yeah, it\u0027s a cheat, but keep it handy to save your sanity, IMHO.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDocking before 0.21 was tough because you couldn\u0027t lock your orientation with ASAS; it would just use up your RCS fuel. Now that you can lock orientation and just use RCS for translation, the only difficult part of docking is camera management, i.e. rotating the camera scene around the two vessels in order to determine when your approach is lined up correctly. However, the Docking Port Alignment Indicator mod takes care of this for you without requiring any camera gyrations. Docking in 0.21 with the DPAI is pretty easy once you get the hang of it.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-26T16:08:24Z","Content":"\n\u003Cp\u003EManley\u0027s video was never clear to me, even during the time I was beggining to understand how docking is done.\u003C/p\u003E\u003Cp\u003EI don\u0027t like rushing things. Kerbin is too small and if the orbits don\u0027t match a lot, you\u0027ve got few minutes until you see the target moving away from you.\u003C/p\u003E\u003Cp\u003EIt\u0027s very hard to finish docking in few minutes. I\u0027ve never done it.\u003C/p\u003E\u003Cp\u003EWhen you burn towards the target, you\u0027re making a bulge on one side of your orbit and that\u0027s where the problem is created. The user spends much fuel just to see the target all of the sudden going away.\u003C/p\u003E\u003Cp\u003ETherefore after you use the map for initial adjustment (5 km separation at most, try to get closer than 1 km; I adjust to 0.1-0.2), go into the live mode and turn on the camera chase mode. Burn towards the target until the speed is positive. Watch the target\u0027s numbers. 5 m/s approach is fine.\u003C/p\u003E\u003Cp\u003EThen switch to map and correct your bulged orbit by burning retrograde (yellow marker).\u003C/p\u003E\u003Cp\u003EWhen you reach 100m separation, go pink retrograde (navball, of course) and reduce the relative speed to 1 m/s. Again, fix your orbit in the map view.\u003C/p\u003E\u003Cp\u003EWhen you approach the target, use pink retrograde and reduce the speed as much as possible. 0.0m/s if you can.\u003C/p\u003E\u003Cp\u003ETurn on the docking mode and use RCS for positioning, rotating, translating.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-26T16:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003ETherefore after you use the map for initial adjustment (5 km separation at most, try to get closer than 1 km; I adjust to 0.1-0.2), go into the live mode and turn on the camera chase mode. Burn towards the target until the speed is positive. Watch the target\u0027s numbers. 5 m/s approach is fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s important to realize that the target relative speed on the NavBall does not indicate whether you are approaching the target, moving away from it, moving at right angles to it, etc. It\u0027s not a closing speed; it\u0027s just relative velocity. You have to adjust the relative velocity so that it is going toward the target, i.e. so that your prograde marker is on top of the target marker on the Navball.\u003Cem\u003E Usually\u003C/em\u003E, this means that you shouldn\u0027t be burning directly toward the target. (The two exceptions are: when your relative velocity is 0.0 m/s and when you are already moving directly toward or away from the target.) I have created a very crude drawing that shows how this works:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OLt1cbC.png\u0022 alt=\u0022OLt1cbC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote that in the left image, burning directly toward the target gives you a final velocity vector that will get you closer to the target than the original trajectory, but will still miss it by a bit. In the right image, you can see that by burning to the right of the target, you can pull your velocity vector so that it points directly at the target. Hope this helps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T17:12:10Z\u0022 title=\u002208/26/2013 05:12  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by Mr Shifty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-26T17:05:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003ENote that in the left image, burning directly toward the target gives you a final velocity vector that will get you closer to the target than the original heading, but will still miss it by a bit. In the right image, you can see that by burning to the right of the target, you can pull your velocity vector so that it points directly at the target. Hope this helps.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re essentially trying to hit a moving target, only in space.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-26T17:07:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EYou\u0027re essentially trying to hit a moving target, only in space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, and the problem is actually complicated by the fact that both your ship\u0027s path and the target\u0027s path are curved in 3-space. But, if you\u0027re within a 10-20 km, the relative trajectories are sufficiently flat that this method works.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-26T18:05:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EIt\u0027s important to realize that the target relative speed on the NavBall does not indicate whether you are approaching the target, moving away from it, moving at right angles to it, etc. It\u0027s not a closing speed; it\u0027s just relative velocity. You have to adjust the relative velocity so that it is going toward the target, i.e. so that your prograde marker is on top of the target marker on the Navball.\u003Cem\u003E Usually\u003C/em\u003E, this means that you shouldn\u0027t be burning directly toward the target. (The two exceptions are: when your relative velocity is 0.0 m/s and when you are already moving directly toward or away from the target.) I have created a very crude drawing that shows how this works:\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OLt1cbC.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/OLt1cbC.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that in the left image, burning directly toward the target gives you a final velocity vector that will get you closer to the target than the original trajectory, but will still miss it by a bit. In the right image, you can see that by burning to the right of the target, you can pull your velocity vector so that it points directly at the target. Hope this helps.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, it\u0027s the relative speed. It would be great if the navball traget speed would show \u0022-\u0022 sign when the distance is increasing.\u003C/p\u003E\u003Cp\u003EBut if you:\u003C/p\u003E\u003Cp\u003E1) arrange a close encounter\u003C/p\u003E\u003Cp\u003E2) correct orbits to match\u003C/p\u003E\u003Cp\u003E3) do series of target prograde burns and yellow retrograde corrections\u003C/p\u003E\u003Cp\u003Eyou essentially have no problems. The third step actually increases the precision of the second step. It\u0027s fine tuning. The yellow and the pink marker line up.\u003C/p\u003E\u003Cp\u003EEver since I\u0027ve learned how to rendezvous and dock, I keep making encounters at less than 1 km, even less than 100 m.\u003C/p\u003E\u003Cp\u003EI understand the graphic you\u0027ve made, but I rarely do such maneuvres of forcing the markers together.\u003C/p\u003E\u003Cp\u003EWhen you plan a rendezvous, your orbit should be shorter and then just time warp and see what happens. After you get a nice future encounter, you correct your orbit to match the target\u0027s orbit as much as you can, so you don\u0027t drift away fast. Why bothering with drifting and trying to hurry up if it can be corrected and avoided?\u003C/p\u003E\u003Cp\u003EI must admit, I always do docking with targets that have pretty circular orbits with almost 0 inclination. I\u0027ve never tried to dock something in a molniya orbit, just to name one weird example.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T18:07:40Z\u0022 title=\u002208/26/2013 06:07  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-26T18:13:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003E Kerbin is too small and if the orbits don\u0027t match a lot, you\u0027ve got few minutes until you see the target moving away from you.\u003Cp\u003EIt\u0027s very hard to finish docking in few minutes. I\u0027ve never done it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t need to \u0022finish docking in a few minutes\u0022 and it certainly doesn\u0027t matter that you\u0027re only close to the target for a few minutes if your orbits aren\u0027t similar. \u0022A few minutes\u0022 is more than enough time to match velocities as you get close to target. Once you match velocities, you\u0027ve also matched orbits and have all the time in the world for docking.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhen you burn towards the target, you\u0027re making a bulge on one side of your orbit and that\u0027s where the problem is created. The user spends much fuel just to see the target all of the sudden going away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf two people are on opposite sides of a room and want to shake hands, one of them has to start walking. \u003C/p\u003E\u003Cp\u003E\u0022Making a bulge on one side of your orbit\u0022 is just part of the approach. It\u0027s not a problem to avoid... it\u0027s an essential part of the rendezvous. From what I\u0027ve seen, the people who struggle the most with rendezvous and docking are the ones who stare at the map and try to maintain perfectly matched orbits. It\u0027s completely impossible to approach the target if you have nearly identical orbits. Your goal is to put your closest point of approach as near to the target as you can get it. The shape of your orbit is absolutely irrelevant. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThen switch to map and correct your bulged orbit by burning retrograde (yellow marker).\u003Cp\u003EWhen you reach 100m separation, go pink retrograde (navball, of course) and reduce the relative speed to 1 m/s. Again, fix your orbit in the map view.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnce you have an approach within a few kilometers, \u003Cstrong\u003Eclose\u003C/strong\u003E the Map and do not open it again. Every bit of effort you expend trying to make perfect orbits on the Map is completely wasted, because you have to turn right back around and undo that perfect orbit to start moving toward the target again.\u003C/p\u003E\u003Cp\u003EOnce you\u0027re within a few kilometers, bring your relative velocity to a comfortable value (depending on your distance, but slow enough that there\u0027s no danger of a collision) and keep your yellow prograde marker on the pink target marker. You can steer with lateral RCS or by turning the ship to the side and thrusting with the engines. \u003C/p\u003E\u003Cp\u003EThe NavBall shows the direction of the target, your direction of motion and the relative speed, while the on-screen target marker shows the distance. That\u0027s all you need. The Map has nothing useful to you at this point and trying to make perfect orbits on it is not only a distraction from what you actually need to do, it\u0027s counterproductive because it\u0027s often driving you to do the opposite of what you really need (close the distance).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EI rarely do such maneuvres of forcing the markers together.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWhy bothering with drifting and trying to hurry up if it can be corrected and avoided?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn approach where you steer while drifting in rather than coming to a stop numerous times during the approach to correct is not \u0022hurrying up.\u0022 It can be just as slow and patient as the stop-and-go method, and it\u0027s a good bit more fuel efficient. The closure rate can be as low as you want it to be, and steering by correcting your velocity vector rather than zeroing it and and then building it right back up again can add up to a significant amount of propellant.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T18:22:59Z\u0022 title=\u002208/26/2013 06:22  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-26T18:26:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003E2) correct orbits to match\u003Cp\u003E3) do series of target prograde burns and yellow retrograde corrections\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf this method works and you\u0027re comfortable with it, then that\u0027s great. But here\u0027s the analogy:\u003C/p\u003E\u003Cp\u003EImagine two cars travelling down the freeway in the same direction, both going 100 kph, with one car 1 km in front of the other. You\u0027re in the back car trying to catch up to the front car.\u003C/p\u003E\u003Cp\u003E- In your method, you speed up to 110 kph, gain 50 meters on the other car, then slow down to 100 kph, re-evaluate and repeat until you catch up, 50 meters at a time.\u003C/p\u003E\u003Cp\u003E- In my method, I speed up 110 kph and stay at that speed until I\u0027m close to the other car, then slow down gradually to match speeds at the meeting point. \u003C/p\u003E\u003Cp\u003EYour method has the advantage of being more careful and more deliberate. My method has the advantage of being much faster and more efficient. (Once I have an intercept that is less than about 20km from the target, it rarely takes me more than 5 minutes to get within 100 meters of the target.)\u003C/p\u003E\n"},{"CreatedByName":"Cartz","CreatedById":73435,"CreatedDateTime":"2013-08-26T18:40:35Z","Content":"\n\u003Cp\u003EI find the hardest part of learning to intercept/dock is sifting through the reams of misinformation out there, from \u0027experts\u0027 that have docked once.\u003C/p\u003E\u003Cp\u003ESome folks in this thread have it right, others not so much. Heres an easy recipe for an intercept.\u003C/p\u003E\u003Cp\u003E1. Launch target vehicle to 150km orbit, make it as circular as possible.\u003C/p\u003E\u003Cp\u003E2. Launch docking vehicle to 75km orbit, again, circularizing makes it easy.\u003C/p\u003E\u003Cp\u003E3. Make target vehicle your target, plot a maneouver at an ascending or descending node, burn anti-normal or normal (purple indicators) until ascending and descending nodes are 0.0\u003C/p\u003E\u003Cp\u003E4. Plot transfers up to 150km, note the distance between vessels at closest approach. Your ship in the lower orbit will \u0027catch up\u0027 with the ship in higher orbit over time. so use time acceleration until that burn up to 150km has a \u0026lt; 500m approach. When the time comes, burn on up to 150km.\u003C/p\u003E\u003Cp\u003E5. Switch your velocity indicator to \u0027target mode\u0027 and burn retrograde when you\u0027re at closest approach until relative velocity is 0.\u003C/p\u003E\u003Cp\u003E6. You should now have a nearly identical orbit to your target, although you may need to fine tune a little bit, you should be set to dock.\u003C/p\u003E\u003Cp\u003EEvery intercept, no matter the orbit, is a two step process imo.\u003C/p\u003E\u003Cp\u003E1. Match target orbital plane\u003C/p\u003E\u003Cp\u003E2. Match target orbital altitude and velocity\u003C/p\u003E\u003Cp\u003EAs a few others have said, once you\u0027re within a few km of your target, through the map views and the shape of your orbit out the window. If you simply ensure that you\u0027re heading towards your target, when you get there and null your relative veolcity your orbits will nearly match.\u003C/p\u003E\u003Cp\u003ETo the OP, in your images, it looks like you have a craft that has a periapsis lower and an apoapsis higher than your target\u0027s orbit. That makes plotting an intercept a lot more difficult because your vehicles velocity changes as you orbit. Circularizing helps because it ensures constant velocity and a more predictable intercept timing.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-26T19:00:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EManley\u0027s video was never clear to me, even during the time I was beggining to understand how docking is done.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll be honest, that video was confusing to me. But then I watched Pebblegarden\u0027s Phoenix Project videos and she made the whole process crystal-clear. Once you learn to nudge the yellow orbital vector markers into synch with the pink (or purple if you wish) target vector markers, you\u0027re set. It\u0027s honestly not as complicated as it sounds there.\u003C/p\u003E\u003Cp\u003EBlizzy78\u0027s in-game tutorial missions for docking and rendezvous make it simple enough for anyone to grasp.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-26T19:54:59Z","Content":"\n\u003Cp\u003EGranted, what I do takes some time, but I dock at pretty low LEO so sometimes and if I don\u0027t match orbits after arranging a future encounter, I drift away too much and that can turn into a constant push-me-pull-you struggle, especially for people who are new to this.\u003C/p\u003E\u003Cp\u003EIf you do these things at 300, 400, 500 km orbits, can be pretty bold with your orbital maneuvers, but if you\u0027re right above the atmosphere, the curvature is too big and that creates the neccessity to correct stuff all the time and go small steps, or simply be very skilled and fast, something I\u0027m not.\u003C/p\u003E\u003Cp\u003EI prefer to go low because I\u0027ve figured out I save much more fuel by using baby steps and more time than to climb high and doing it quickly.\u003C/p\u003E\u003Cp\u003EI\u0027m not saying it\u0027s perfect, but it works.\u003C/p\u003E\u003Cp\u003EI\u0027d like to see someone docking in molniya, that would be interesting. As a matter of fact, I might try it myself.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-26T20:21:58Z","Content":"\n\u003Cp\u003EThat raises a great point... if your orbit is so low you\u0027re skimming along right at the top of the atmosphere, you might find yourself dipping down into the goo during the approach if you deviate too far from a circular orbit. The drag won\u0027t be enough to pull you down, but it can be enough to throw off your intercept.\u003C/p\u003E\u003Cp\u003EBut that\u0027s just a complication that comes with extremely low orbits. The delta v requirements for a higher orbit are pretty miniscule, and the shallower gravitational gradient at higher altitudes makes docking marginally easier (the craft drift more slowly relative to each other) as well as eliminating the low-altitude issues.\u003C/p\u003E\u003Cp\u003EThe stop-and-go approach isn\u0027t \u003Cem\u003Ewrong\u003C/em\u003E... there just aren\u0027t many situations where it\u0027s the best choice. But extremely low-altitude operations certainly can be one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-26T20:25:09Z\u0022 title=\u002208/26/2013 08:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 26, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"}]}