{"TopicId":43899,"ForumId":24,"TopicTitle":"Hello, fellow space travelers!","CreatedByName":"Megapead","CreatedById":62056,"CreatedDateTime":"2013-08-26T02:16:57Z","PageNum":1,"Articles":[{"CreatedByName":"Megapead","CreatedById":62056,"CreatedDateTime":"2013-08-26T02:16:57Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EHello and welcome to my introduction!\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d like to introduce myself, I go under the alias \u003Cspan style=\u0022color:#FF0000;\u0022\u003EMegapead\u003C/span\u003E on most social networks. I discovered Kerbal Space Program about a year and a half ago from a video posted by Kurtjmac and I\u0027ve been enjoying the game since. I have had this forum account for about 5-7 months now but, only recently have found out what an awesome place it is. I do run a YouTube channel which has had a mild success in the past few months but, I feel as if I have been neglecting the channel and would like to get back into YouTube in the following days. On this Channel I do Kerbal Space Program but, I would like to not get into talking about my channel as most forums have a separate section for such things (so I\u0027m assuming this forum follows the same format but I can be mistaken). I\u0027m 17 and I am currently studying to be a computer programmer. I have an interest in Physics and Computer Programming so I am planning on working with Physics engines in games (coding them, testing them ect). I am also interested in design rather it be on a computer or picking up a pen and paper and drawing something up. Usually these designs are logos are Graphics if a friend is launching a company and needs something I would usually do it for them. That\u0027s essentially my back-story and I can\u0027t wait to dive right into your forums and be an active member. Hope to see some of you around and have a pleasant evening (or day where ever you maybe reading this from).\u003C/p\u003E\n"},{"CreatedByName":"TheHockeyPlayer","CreatedById":73665,"CreatedDateTime":"2013-08-27T03:07:20Z","Content":"\n\u003Cp\u003EWelcome to the forums, Megapead! It\u0027s a pleasure to meet you. I hope you find this place enjoyable. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-08-31T22:06:44Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}