{"TopicId":43965,"ForumId":20,"TopicTitle":"KSP: Hard Mode","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-26T19:29:15Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-26T19:29:15Z","Content":"\n\u003Cp\u003EHow many of you use \u0027hard mode\u0027 mods? Things like RemoteTech, FAR, Ioncross, Deadly Re-entry . . .\u003C/p\u003E\u003Cp\u003EI ask this just as a community poll. I\u0027m curious who plays like this. I just started a new KSP instance with all of these. Clearly I suck and safe re-entry. My \u0027heat shield*\u0027 blew up in like 2 seconds after shock heating hit.\u003C/p\u003E\u003Cp\u003EAnyways, if your hard mode mod of choice is not in the poll. let us know below.\u003C/p\u003E\u003Cp\u003E*this is quoted because it was a heat shield part but didn\u0027t do sh*t to save me.\u003C/p\u003E\u003Cp\u003ENote: this is in general for the traffic on the poll.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-26T19:38:56Z","Content":"\n\u003Cp\u003EI\u0027ve used Deadly Reentry. I\u0027ve been meaning to install FAR. Ioncross looks cool, but since it\u0027s not really persistent, I\u0027m not all that interested. If you\u0027re not currently flying that particular ship, then it doesn\u0027t deplete its resources. I haven\u0027t even looked into Remote Tech.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-26T19:42:09Z","Content":"\n\u003Cp\u003ENo option for \u0022None\u0022.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-26T19:42:38Z","Content":"\n\u003Cp\u003Ein 0.20 I used FAR, Deadly Reentry, the Thrust Corrector, and Ioncross. Never really got into playing with RemoteTech, but from that list I\u0027d say that\u0027s the only \u0022hard mode\u0022 mod. If you are at all smart about building your rockets, FAR makes it incredibly easy to get to orbit. Ioncross has so many ways around resource shortages that you really don\u0027t need to worry about it; it just adds more parts. Deadly Reentry is another one you just have to be smart about.\u003C/p\u003E\u003Cp\u003EIn short, they\u0027re not \u0022hard mode\u0022, they just change the way you do things.\u003C/p\u003E\n"},{"CreatedByName":"acealeam","CreatedById":61964,"CreatedDateTime":"2013-08-26T19:54:45Z","Content":"\n\u003Cp\u003EIn 0.20 I used to have FAR, but I really saw no change. All that happened was it patched infinigliding, really. Sure every hundred missions or so, you may stall, but it\u0027s never been an issue for me, so I don\u0027t use it.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-26T19:55:43Z","Content":"\n\u003Cp\u003EHard mode: Starting off with the Kerbal Space Port on the surface of a quark star.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022What do you mean I need six point three million meters-per-second of delta-V?\u0022\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-08-26T20:03:32Z","Content":"\n\u003Cp\u003EAll of the above with the exception of TAC (Although I\u0027m considering switching to that, since Ioncross is rather buggy). I also play with Figaro Satellite constellation and force myself to have a decent GPS constellation around every planet/moon with a base on it.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-26T20:06:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EHard mode: Starting off with the Kerbal Space Port on the surface of a quark star.\u003Cp\u003E\u003Cem\u003E\u0022What do you mean I need six point three million meters-per-second of delta-V?\u0022\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s only hard mode for those of us with computers that can\u0027t support your creations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2013-08-26T20:24:05Z","Content":"\n\u003Cp\u003EI run DRE, and honestly wish it were less forgiving. I really want to also run FAR, but it doesn\u0027t play nice with MechJeb\u0027s aerobrake predictions, and I kind of rely on those.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-08-26T20:50:59Z","Content":"\n\u003Cp\u003EI run FAR, RT (when it gets updated), but no deadly reentry. The thermal limit of the parts seems to be too low, and doe not function fairly IMO. Then again, that was several months ago, so maybe the mod has changed..\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-26T21:37:26Z","Content":"\n\u003Cp\u003EI \u003Cem\u003Ewant\u003C/em\u003E to use a lot of those mods and I\u0027ve certainly tried a couple of them. I feel, however, that they need a bit of work. I\u0027d prefer TAC life support over IonCross because it seems to have bigger ambitions and wouldn\u0027t require me fiddling about with config files or anything(more or less) to add the life support resources that I\u0027d more or less like to see in the game. \u003C/p\u003E\u003Cp\u003EOn top of that, Deadly Reentry I tried for one flight and I didn\u0027t enjoy it as much as I\u0027d hoped. I sent a rocket into orbit and deorbited the three-man pod with the fitted heat-shield and the shield burned up before my pod could get half way through the atmosphere. Considering I was dropping from about a hundred kilometer orbit, it just seemed odd to me. Of course, I don\u0027t know a whole lot about real-world reentry heat so I didn\u0027t really know what to expect other than my apollo-lookin\u0027 pod surviving reentry from low kerbal orbit without additional heat shielding.\u003C/p\u003E\u003Cp\u003EThat said, when .22 hits...maybe after .23, I\u0027ll pick up a lot of these mods and give the game a hardcore go.\u003C/p\u003E\u003Cp\u003EI really wish the vanilla game would incorporate some of these things, though, even as toggleable or scaleable options via a difficulty menu so people wouldn\u0027t necessarily have to futz about with mods to get the game playing just as they want with simple challenging aspects turned on or off or scaled up or down.\u003C/p\u003E\n"},{"CreatedByName":"Mercy","CreatedById":69034,"CreatedDateTime":"2013-08-26T21:40:39Z","Content":"\n\u003Cp\u003E*Slightly Bothersome Reentry\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-08-26T22:11:00Z","Content":"\n\u003Cp\u003ECurrently running Deadly Reentry, and while it doesn\u0027t exactly live up to its name as much as I\u0027d like, it has added an extra bit of challenge. I like \u0022stress testing\u0022 my designs to see how much I can get away with without using a heat shield.\u003C/p\u003E\u003Cp\u003EI\u0027ll probably check out TAC Life Support once it gets a little more fleshed out. Ioncross is good in concept, but the fact that there\u0027s no persistence is what ultimately turned it off for me.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-26T22:24:00Z","Content":"\n\u003Cp\u003EI run TAC... and that\u0027s about it for the mods listed. FAR wouldn\u0027t do a thing to my game, and I pretty much don\u0027t care for re-entry heat effects. Plus, I don\u0027t really need RemoteTech to convince me to set up satellite arrays.\u003C/p\u003E\n"},{"CreatedByName":"spudcosmic","CreatedById":64598,"CreatedDateTime":"2013-08-26T23:07:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003ENo option for \u0022None\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen don\u0027t vote.\u003C/p\u003E\u003Cp\u003Eon topic:\u003C/p\u003E\u003Cp\u003EI use FAR and ioncross. I\u0027ve been thinking about getting deadly reentry and Remotetech but I already have too many mods as is. I have been also watching TAC life support very closely because unlike ioncross, TAC calculates resource usage even on inactive vessels. However, TAC doesn\u0027t have recyclers or ways of generating resources so it\u0027s not very usable.\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-08-26T23:17:56Z","Content":"\n\u003Cp\u003EI use TAC and Ampyear Power management.\u003C/p\u003E\u003Cp\u003ETAC life support is great, it has persistent O2 use as well as O2 supplies in your space suit for EVA which is what I need for Mun missions... hopefully Ioncross will add the features, or TAC will add the features of Ioncross.\u003C/p\u003E\n"},{"CreatedByName":"CheftonUTD","CreatedById":76666,"CreatedDateTime":"2013-08-27T01:31:05Z","Content":"\n\u003Cp\u003EStarted playing with RemoteTech for the last week, also always try to keep my manned missions in communication range as much as possible.\u003C/p\u003E\u003Cp\u003EAlso very keen to try TAC but might wait until it\u0027s a bit more \u0027finished\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-27T02:23:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EIn short, they\u0027re not \u0022hard mode\u0022, they just change the way you do things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with this. KSP (regardless of what the MJ-haters apparently think) isn\u0027t a twitch game, it\u0027s a thinking game. I suppose the closest analog to it\u0027s gameplay is something like the Total War series, where you do all your planning in like a turn-based strategic part (the VAB/SPH and some test runs), broken up with actually carrying out what you\u0027ve been planning. If you do your planning well, then the actual execution is uneventful. So, all these mods (and anything like them that eventually become features) simply affect the planning phase of gameplay. They make you take a few more things into account, or just reinforce things you were doing anyway because they\u0027re good engineering practice.\u003C/p\u003E\u003Cp\u003EThus, the only people who\u0027d really be affected by any of these mods are those who don\u0027t spend much time on R\u0026amp;D but instead just slap things together and hope for the best. Or those who consciously exploit the lack of proper aerodynamics or whatnot currently in the game. But for folks who put in serious R\u0026amp;D effort, such mods affect neither how they play nor how they approach the game.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-27T02:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mercy\u0022 data-cite=\u0022Mercy\u0022\u003E\u003Cdiv\u003E*Slightly Bothersome Reentry\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t think it was particularly deadly, either. You just can\u0027t bomb into the atmosphere at a steep angle on a Munar return, but I wasn\u0027t doing that anyway. All DR did was add to my part count. The decoupler is cool and the heat shields are nice, though.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-08-27T03:49:03Z","Content":"\n\u003Cp\u003EYeah, the problem with DR is that we\u0027re doing reentry at a third the speed that NASA does, so they either have to fudge reentry issues towards being worse than reality, or just not be that hard.\u003C/p\u003E\u003Cp\u003EI\u0027ve played with FAR, DR, and RT. Each of them added interesting challenges, but once I got used to them, were just different playing styles. Heck, my first RT launch was a three satellite constellation, launched with an unmanned ship. Did it two different ways. One with a ship with enough delta-v to manhandle the orbits, and one with just enough delta-v to pull it off. Both of those were different challenges. The first never lost contact with ground control, and the second passed in and out of contact, doing maneuvers only when it was in contact.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-08-27T03:49:36Z","Content":"\n\u003Cp\u003EI USED to use FAR...\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-08-27T04:23:27Z","Content":"\n\u003Cp\u003E\u0022Other.\u0022 Everything but TAC. For some reason, it kills my frame rate.\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-08-27T07:05:55Z","Content":"\n\u003Cp\u003EI had IonCross on .20. Haven\u0027t installed it back on .21.\u003C/p\u003E\u003Cp\u003EI tend to switch between savefiles, one hosting RemoteTech and IonCross, one just letting me free.\u003C/p\u003E\u003Cp\u003EIonCross kindof lacks a bit for me because i can just switch to my High-Farr probe and timeaccelerate if i want to save almost-suffocating Kerbals. None of my ships use oxygen while im not around, which kindof bugs me. Thats why i\u0027ve left it out recently.\u003C/p\u003E\u003Cp\u003ERemoteTech is fun because it has seperate probe cores - i can have fun like i normally do flying probes to Eve and stuff, but i can add the challenge by working on my RemoteTech network when i want to, on the same savefile. The fact i can still use the old ones which don\u0027t need remote control effectively allow me to turn the mod on or off for specific craft.\u003C/p\u003E\u003Cp\u003EGoing to look into TAC life support soon :-).\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-27T07:49:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rpayne88\u0022 data-cite=\u0022rpayne88\u0022\u003E\u003Cdiv\u003E\u0022Other.\u0022 Everything but TAC. For some reason, it kills my frame rate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re checkboxes, you can hit more than one.\u003C/p\u003E\u003Cp\u003EAs for me, none of the above... I\u0027ve played with an early version of Deadly Reentry, though.\u003C/p\u003E\u003Cp\u003EFAR screws up Mechjeb, DR just really doesn\u0027t do that much, and Life Support I haven\u0027t really looked at. Remotetech I\u0027ve thought about but never seriously looked at, because it seems like it\u0027d mostly just make things more annoying... with the saves getting screwed up every few months, anyway.\u003C/p\u003E\u003Cp\u003EMy big problems with the above are mostly in two categories: Adds more tedium than real challenge, increases part counts.\u003C/p\u003E\u003Cp\u003ERemotetech I might do anyway if I didn\u0027t just KNOW that I\u0027d end up setting up a network, and then having to relaunch the entire (@%( thing because my save got broken again. Remapping everything is bad enough by itself!\u003C/p\u003E\n"},{"CreatedByName":"Yuming","CreatedById":57851,"CreatedDateTime":"2013-08-27T11:15:19Z","Content":"\n\u003Cp\u003EI would use remote-tech if it did not have delays in signals. I know it is more realistic, but the fun for me is setting up a stable communications satellite network, not having to pilot probes differently.\u003C/p\u003E\n"}]}