{"TopicId":43999,"ForumId":16,"TopicTitle":"Question on advanced wing design STOCK parts only","CreatedByName":"carazvan","CreatedById":73074,"CreatedDateTime":"2013-08-27T01:52:03Z","PageNum":1,"Articles":[{"CreatedByName":"carazvan","CreatedById":73074,"CreatedDateTime":"2013-08-27T01:52:03Z","Content":"\n\u003Cp\u003EHello fellow kerbengineers I\u0027ve been looking over the past days at creating larger SSTOs and I always seem to hit the following limitation that I\u0027ve not seen for others:\u003C/p\u003E\u003Cp\u003ELarge wings that seem to always drop at the tips. I\u0027ve tried structural beams down the middle of the wing, stacking multiple wings pieces, V shape (side-on look) with struts at tips but all seem to have the same tendency to drop. I can fix this with lots of Struts from the fuselage but I\u0027m just wondering how has everyone who\u0027s built large SSTOs managed to avoid doing this since I never see struts on most large SSTOs.\u003C/p\u003E\n"},{"CreatedByName":"pa1983","CreatedById":58328,"CreatedDateTime":"2013-08-27T04:16:21Z","Content":"\n\u003Cp\u003EYou can download my series of stable SSTO spaceplanes to get an Idea of how I do it and see if thats somthing you like to try for your crafts.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/27196441/SSTOs.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/27196441/SSTOs.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELatest is the Falcon XIIIB Galaxy STOL and it uses my latest low profile high lift wing.\u003C/p\u003E\u003Cp\u003EThe key to a structurally sound craft is mass distribution.\u003C/p\u003E\u003Cp\u003EReal aircraft have its engines and fuel in or on the wings. That waths needed in KSP to make it work. \u003C/p\u003E\u003Cp\u003EI have over 40 ton of just fuel in etch engine naccell and another 11\u002B ton of engines and other stuff. So its easy 55-60 tons on etch wing still it hardly flexes.\u003C/p\u003E\u003Cp\u003ESecond trick is to mount the wing High or Low so it can be ONE part protruding the fuselage. Mounting the wing dead center tends to stress the fuselage a lot and thats unwanted. Especially if you have any openings in the fuselage. The fact that CoL is lower or higher then CoM is not a real problem. Engines can be mounted to Trust trough Center of Mass any way.\u003C/p\u003E\u003Cp\u003EThis is 204\u002B tons taking off.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img5.imageshack.us/img5/8095/10jq.png\u0022 alt=\u002210jq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat craft can do Loops and sharp 180 turns even. During its development the only thing falling of from high G-turns was the stabilizer but the new one have worked well. But where still talking about flying it acrobatic style fully loaded and one wont realy do that.\u003C/p\u003E\u003Cp\u003EIt has 1 jumbo tank in etch nacelle, 7x 150L jet fuel tanks plus 1x in etch wing, two SAS units and some intakes and RCS tanks.\u003C/p\u003E\u003Cp\u003EIt has a Undercarriage that offers added strength between the wings but also raises the hight of the craft allowing for a proper rotation but it also has rear wheels to reduce the risk of damaging the craft.\u003C/p\u003E\u003Cp\u003EThe belly of the craft extends to the engine nacelles that way wheels can support both fuselage and its payload but also the heavy engine nacelles removing the wing flex on the Runway. Once airborne the wings are loaded by the engine nacelles mass pretty much in etch wings dead center offering minimal flex and since the Fuselage contains few parts other then wings and I-beams and a payload its lighter then the two wings combined minimizing the flex between fuselage and wings. This is what I call the \u0022Mass Distribution Method\u0022 because thats what it is. This wings are actually weaker then my older spaceplanes thick flying body\u0027s BUT the fact that so little torque is applied to them they can use there strength for maneuvering instead of fighting a heavy fuselage.\u003C/p\u003E\u003Cp\u003EYou have to think of the wing as a dinner plate. If you want to balance it on your finger where do you put your finger? Usually in the Center. Fuel and engines are best placed at the center of lift of the wings. Its an imaginary point in KSP since you can only see total Center of Lift. Since wings tend to be bigger closest to the Fuselage I settle for 1/3 from the fuselage. Thats where my fuel and engines are in there nacelles. Landing gears must also be placed where the crafts is the most heavy so in my case under the engine nacelles and fuselage.\u003C/p\u003E\u003Cp\u003EAs you can see this wings wont need any external struts to keep it together like my older SSTO spaceplanes in that save file like my Falcon X Jumbo did. The Jumbo do incorporate mass distribution but not to that extent since the jumbo tanks still are the heavier once located in the fuselage. Still the Jumbo has the strongest wing but still the one that flexes the most of the two crafts and the one that breaks easiest if you abuse it.\u003C/p\u003E\u003Cp\u003EI have a construction video in my youtube channel. Link is in my signature. Its a Guide line video not a how to make the perfect craft but rather show some concepts and laying a foundation one can build on. It mixes a few of my concepts. Most of my crafts are posted in the K-prize thread if your interested in future progress. \u003C/p\u003E\u003Cp\u003EYou can also find a video of the Falcon XIII Galaxy STOL (not the new B version) in my youtub channel if you want to see how it flies. Its not nearly as refined as the B version but I find it easier to make a craft with potential then perfect it as one gets familiar with it.\u003C/p\u003E\u003Cp\u003EVideo of the B version is planed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-27T04:33:48Z\u0022 title=\u002208/27/2013 04:33  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 27, 2013\u003C/time\u003E by pa1983\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-08-27T06:06:30Z","Content":"\n\u003Cp\u003EI have three tips, one of which you already seem to be doing.\u003C/p\u003E\u003Cp\u003ETip 1: Send out biplane style wings that meet at the tips, and strut the tips together. I think this is what you mean by the \u0022V\u0022 shape wings. This certainly does help. Adding a couple of vertical struts between the two wing surfaces about half way between the fuselage and the wingtip also helps, so try this if you haven\u0027t yet.\u003C/p\u003E\u003Cp\u003ETip 2: The wings are going to be generating lift once you are moving, so if they are a little bit droopy on the runway, that\u0027s probably OK. If they are so droopy that they cause you problems on takeoff, add landing gear out along the lower wing surface somewhere.\u003C/p\u003E\u003Cp\u003ETip 3: In fact, what might be more of an issue is that once you get up some speed the wings will be generating a lot of lift but if you have a heavy fuselage then the middle of your aircraft will start to sag, kinda the opposite of what was happening on the runway. A good solution to this is to spread out the payload over the wing area if possible. Doing this can also give you some obvious strutting ponits (fuselage to mid-wing-mass, for example). You should also add landing gear underneath the heavy bits, which works out nicely since these bits will be horizontal and you won\u0027t have the problem of the gear not being oriented perfectly straight.\u003C/p\u003E\u003Cp\u003EHere\u0027s an example of quite a large SSTO with the payload spread across the lift area. Landing gear is under the central fuselage as well as under each orange tank. Struts go from the fuselage to the orange tanks. The orange tanks are attached to the fuselage via \u0022structural wing\u0022 pieces (the rectangular \u0022wings\u0022) rather than girders or I-beams, since structural wings are pretty strong and actually give you a bit of extra lift, whereas ibeams are relatively heavy and give you no lift!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KlCqAHa.jpg?1\u0022 alt=\u0022KlCqAHa.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a more straightforward combination of anhedral dihedral wings strutted together where they meet as well as in a couple of places further in. There is a third, horizontal wing surface between the two so that there is a nice place to add air intakes, which also serves as another strutting surface to provide extra rigidity. As the picture shows this has a pretty wide wingspan and I had no problem with wing droop on this plane:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nVZqZJ3.jpg\u0022 alt=\u0022nVZqZJ3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-08-27T06:17:00Z","Content":"\n\u003Cp\u003EOh, and for the record, this is also a SSTO craft, so believe me when I say it is indeed possible to build very large SSTO\u0027s that hold together, although it certainly can take a lot of trial and error to get it right...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MBwCoqd.jpg?1\u0022 alt=\u0022MBwCoqd.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Joel Dryden","CreatedById":76304,"CreatedDateTime":"2013-08-27T08:34:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EOh, and for the record, this is also a SSTO craft, so believe me when I say it is indeed possible to build very large SSTO\u0027s that hold together, although it certainly can take a lot of trial and error to get it right...\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MBwCoqd.jpg?1\u0022 alt=\u0022MBwCoqd.jpg?1\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s beautiful, I haven\u0027t done much in the way of SSTO space planes, mostly bases on Duna/EVE, the Mun and Minus, space stations for docking/fueling and what not, this almost seems like the prometheus from Stargate Sg1, going to try make something like that.\u003C/p\u003E\n"},{"CreatedByName":"GeckoOBac","CreatedById":79269,"CreatedDateTime":"2013-08-27T10:30:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joel Dryden\u0022 data-cite=\u0022Joel Dryden\u0022\u003E\u003Cdiv\u003EThat\u0027s beautiful, I haven\u0027t done much in the way of SSTO space planes, mostly bases on Duna/EVE, the Mun and Minus, space stations for docking/fueling and what not, this almost seems like the prometheus from Stargate Sg1, going to try make something like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s actually a Battlecruiser from Starcraft 1/2 :\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.giantbomb.com/uploads/original/1/14440/1455994-battlecruiser_sc2_game1.jpg\u0022 alt=\u00221455994-battlecruiser_sc2_game1.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"carazvan","CreatedById":73074,"CreatedDateTime":"2013-08-27T18:23:08Z","Content":"\n\u003Cp\u003EI\u0027ll take a look and see if there\u0027s anything I missed from the suggestions you had pa1983 but from your build videos is where I initially tried the V shaped wing. \u003C/p\u003E\u003Cp\u003EI guess I should also clarify, The flexing of the wings is most severe on takeoff so when moving at some speed \u0026gt; 100kph. The wings don\u0027t flex much till then but on application of input they flex like crazy and usually hit the runway. \u003C/p\u003E\u003Cp\u003ELooking at your designs I think it might have something to do with control surfaces as a ratio of total wing lift generating ability. Well time to try all suggestions, watch more videos and I\u0027ll let you know how it pans out.\u003C/p\u003E\u003Cp\u003EThanks for the input pa1983 and allmhuran\u003C/p\u003E\n"}]}