{"TopicId":44042,"ForumId":16,"TopicTitle":"Decouplers can\u0026#039;t take compression","CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-08-27T14:11:14Z","PageNum":1,"Articles":[{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-08-27T14:11:14Z","Content":"\n\u003Cp\u003EI\u0027ve been having a lot of problems building really heavy rockets with serial staging because decouplers can\u0027t cope with the weight on top of them. This mainly happens with large 3.5 and 5 metre tanks (NovaPunch / KW Rocketry) - whenever I try building anything with those, the thing just collapses on itself even if there are 8 Quantum Struts between the stages holding it together. When the physics are loaded, despite the struts the whole rocket sort of compresses a bit at the decouplers and then bounces back up to its original length and rips itself apart. How do I prevent this from happening?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-27T15:16:45Z\u0022 title=\u002208/27/2013 03:16  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 27, 2013\u003C/time\u003E by CaptainKorhonen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-27T14:20:11Z","Content":"\n\u003Cp\u003EI\u0027d say you need more struts. Yesterday I was building myself a lifter to transfer a payload of 80 t into orbit, but at least one of the 4 asparagus-style boosters kept falling off before the vehicle cleared the launch clamps. Believe it or not, simply adding more struts to tape the boosters to the main stack helped. I also added struts in an X fashion between every two boosters, just for good measure. The whole thing now flies like it should.\u003C/p\u003E\u003Cp\u003EBottom line: Stock struts are not the most powerful. Also, I\u0027ve seen Quantum struts fail.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-27T15:01:25Z","Content":"\n\u003Cp\u003ETry something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wPO2LxY.jpg\u0022 alt=\u0022wPO2LxY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou don\u0027t have to copy the ship, just look at how the i-beams and struts are used. It helps a ton with what you\u0027re talking about. Think bridge or one of those tall cranes they use on buildings.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-08-27T15:14:25Z","Content":"\n\u003Cp\u003EThanks guys. I found the problem - apparently Quantum Struts\u0027 compression strength isn\u0027t that high and that\u0027s what caused it to collapse on itself. I tried the NovaPunch \u0022Even Heavier Strut Connectors\u0022 and it solved the problem - even the largest of rockets are now rock solid, apart from some SAS-induced wobble. But that can easily be dealt with by hand flying until stage 1 separation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6i21rCs.jpg\u0022 alt=\u00226i21rCs.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-27T16:09:41Z","Content":"\n\u003Cp\u003EDo note that those struts are much heavier.\u003C/p\u003E\n"}]}