{"TopicId":44129,"ForumId":34,"TopicTitle":"[1.2.0] Precise Node 1.2.4 - Precisely edit your maneuver nodes","CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-07-24T20:56:02Z","PageNum":16,"Articles":[{"CreatedByName":"Kolago","CreatedById":103729,"CreatedDateTime":"2014-04-20T00:43:17Z","Content":"\n\u003Cp\u003ESo why is it included anyhow? Can I delete the part folder and it still works ok?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-04-20T00:45:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kolago\u0022 data-cite=\u0022Kolago\u0022\u003E\u003Cdiv\u003ESo why is it included anyhow?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo not break compatibility for players that have been using the part. I\u0027ve mentioned that in the change log as well.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kolago\u0022 data-cite=\u0022Kolago\u0022\u003E\u003Cdiv\u003ECan I delete the part folder and it still works ok?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you did not ever use it, yes you can.\u003C/p\u003E\n"},{"CreatedByName":"OxalysResourceConsortium","CreatedById":106988,"CreatedDateTime":"2014-04-21T01:47:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003Eplease don\u0027t quote entire posts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWilco. Sorry about that.\u003C/p\u003E\u003Cp\u003EEDIT: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/47863-0-23-5-PreciseNode-0-12-Precisely-edit-your-maneuver-nodes?p=1074614\u0026amp;viewfull=1#post1074614\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E the post your referring to. However, wouldn\u0027t it be more convenient for everyone involved if links to previous versions were made readily apparent on the OP?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-21T01:51:13Z\u0022 title=\u002204/21/2014 01:51  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 21, 2014\u003C/time\u003E by OxalysResourceConsortium\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-04-21T02:59:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OxalysResourceConsortium\u0022 data-cite=\u0022OxalysResourceConsortium\u0022\u003E\u003Cdiv\u003Ewouldn\u0027t it be more convenient for everyone involved if links to previous versions were made readily apparent on the OP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps so, but to be honest, I don\u0027t want to maintain older versions.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-23T06:09:14Z","Content":"\n\u003Cp\u003EI\u0027ve noticed that if you click AN/DN/Peri/Apo buttons, they snap to that marker on the current orbit. With KSP\u0027s (and Precienode\u0027s) ability to jump orbits, could we get those to snap to the marker on the correct orbit?\u003C/p\u003E\u003Cp\u003EIt may be difficult to determine which is in the current orbit, but as most people click those buttons to just snap the marker when they\u0027re already really close, just \u0022closest\u0022 would be fine, I think.\u003C/p\u003E\u003Cp\u003EAlso, and this is probably really hard but someone once told me to ask anything, and they can determine if it\u0027s hard or not (It may have even been you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) but, if I\u0027m for example orbiting Sun, but setting up a maneuver during an eventual Eve encounter, I\u0027d love to be able to snap to that periapsis. Currently, I click the Peri button and my node jumps to my Sun periapsis. Seems reasonable to, if possible, snap to the periapsis that is in the same SOI as the node you\u0027re editing.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-04-23T09:49:47Z","Content":"\n\u003Cp\u003EOne small issue that could deserve some effort to correct: on occasions, PreciseNode window goes blank (I remember to have seen this happening with past versions, at least since 0.9 but possibly before). For blank, I mean the windowrect still displays, and the two buttons marked O and K on the border, but nothing inside it. O and K buttons do work, but nothing else (like e.g. the P key). \u003C/p\u003E\u003Cp\u003ENow, have observed this happening when, already very close to a SoI change, tried to move the node time so it would happen on the other conic patch. Therefore it appears PreciseNode can\u0027t manage a change of conic for the node it is dealing with.\u003C/p\u003E\u003Cp\u003EFrom the above, would like to ask:\u003C/p\u003E\u003Cp\u003E- at minimum, a check to be implemented so to make a node stick with the conic it was generated for (with possibly a warning for users trying to move it out of those bounds);\u003C/p\u003E\u003Cp\u003E- at best, a way to move the existing node across a SoI change (e.g., could a new node be generated on the other conic, retaining all DV settings of the original that could be deleted at the same time?)\u003C/p\u003E\u003Cp\u003EP.S.: PreciseNode returns to work correctly after deleting the culprit node and some fiddling with the settings.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-04-23T11:19:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022diomedea\u0022 data-cite=\u0022diomedea\u0022\u003E\u003Cdiv\u003EPreciseNode window goes blank (I remember to have seen this happening with past versions, at least since 0.9 but possibly before). For blank, I mean the windowrect still displays, and the two buttons marked O and K on the border, but nothing inside it. O and K buttons do work, but nothing else (like e.g. the P key).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounds like there is an exception occurring. Please see your output_log.txt when that happens.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-04-23T15:50:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EThis sounds like there is an exception occurring. Please see your output_log.txt when that happens.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course you\u0027re right, unfortunately I couldn\u0027t take the output_log when it happened, and it shows some specific condition must exist for this to occur (just trying to recreate casually doesn\u0027t do). Since this happened a number of times to me, I am confident it will do again, and will have that log available next time.\u003C/p\u003E\u003Cp\u003EThanks for your attention.\u003C/p\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2014-04-27T00:06:26Z","Content":"\n\u003Cp\u003EIs there a way to see your planned orbit\u0027s inclination? (Analogous to how we can see our planned orbit\u0027s apsis).\u003C/p\u003E\u003Cp\u003ESometimes I want a REALLY precise inclination.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-04-27T00:09:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Entropius\u0022 data-cite=\u0022Entropius\u0022\u003E\u003Cdiv\u003EIs there a way to see your planned orbit\u0027s inclination?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the options window, there is a setting that enables display of ejection inclination. But that\u0027s probably not what you\u0027re asking for - it will show the relative inclination between your planned orbital plane and the current body\u0027s orbital plane around its parent body.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-27T01:24:09Z","Content":"\n\u003Cp\u003EAren\u0027t they by definition equal in current KSP, since all bodies have zero axial tilt? Or am I misinterpreting what you\u0027re saying?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-04-27T01:27:47Z","Content":"\n\u003Cp\u003EI think you are. Like I\u0027ve said, it displays the relative inclination between your planned orbit and the body\u0027s orbit around its parent. For example, Moho\u0027s orbit around the Sun is inclined, so it would display the relative inclination between your planned orbit and that inclined orbit. This has nothing to do with axial tilt. (Again, this all does not seem to be what you were asking for - the relative inclination between your current orbit and your planned orbit.)\u003C/p\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2014-04-27T02:12:11Z","Content":"\n\u003Cp\u003Eblizzy79 understood what I was asking. I was indeed referring to axial tilt. \u003C/p\u003E\u003Cp\u003EI was trying to get a satellite in a perfect 90Ã‚Âº inclination, and KER lets me see my current inclination, but not planned inclination. So my current inclination would end up at a value like 90.12Ã‚Âº, and then it would be difficult for me to figure out whether to boost the normal or anti-normal vector at the ascending/descending node, since visually I can\u0027t tell the difference between 90Ã‚Âº and 90.12Ã‚Âº in the map view.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-07T19:32:46Z","Content":"\n\u003Cp\u003EI have PreciseNode .12 installed, but I don\u0027t see the option to configure it as one of the visible buttons on the toolbar. Do I need to have the CBA installed to do this?\u003C/p\u003E\u003Cp\u003EIf so, how can I even install that module on the ship, given that it has a category of \u0022none\u0022 and therefore does not appear in my Part Catalog?\u003C/p\u003E\u003Cp\u003EThe only thing I could imagine is that I have installed it incorrectly - but the PreciseNode folder is within my Game Data folder alongside all of my other mods. No nested Game Data folders or anything silly like that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-07T19:35:59Z\u0022 title=\u002205/07/2014 07:35  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 7, 2014\u003C/time\u003E by HeadHunter67\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-07T20:29:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EI have PreciseNode .12 installed, but I don\u0027t see the option to configure it as one of the visible buttons on the toolbar.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPreciseNode does not provide any toolbar buttons.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EDo I need to have the CBA installed to do this?\u003Cp\u003EIf so, how can I even install that module on the ship, given that it has a category of \u0022none\u0022 and therefore does not appear in my Part Catalog?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis part is obsolete since KSP \u0026gt;= 0.23.5 can persist maneuver nodes in the save file now.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-07T21:01:33Z","Content":"\n\u003Cp\u003EOK, thanks. I guess I was confused - I see now that the main post has Toolbar support as an eventual goal.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried to use the window yet, but I did get it to pop up when creating a new node or clicking on an existing one. At no other time can I get it to come up, but I suppose this is intentional.\u003C/p\u003E\u003Cp\u003ENow I just need to figure out how to use all this wonderful functionality. I\u0027m planning my first manual interplanetary trip (I did some probe flybys in .21 using MJ, but I haven\u0027t felt a need to use that since) and having the ejection angle is very helpful. Between this and Kerbal Alarm Clock, I think I have everything I need to get the mission done!\u003C/p\u003E\u003Cp\u003EThanks again, Blizzy. I owe so much of my success and enjoyment in KSP to the things you have provided. Your plugins and tutorials are essential to me!\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2014-05-08T00:16:52Z","Content":"\n\u003Cp\u003EYes, the window will pop up only when you select a node or create one and it gets selected automatically and it will disappear as soon as you exit map view or delete the node. Neat feature if you ask me.\u003C/p\u003E\u003Cp\u003EGood luck on your mission!\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-05-12T16:18:03Z","Content":"\n\u003Cp\u003EDoes anyone else have problems placing a node far into the future? Or have I dropped a few IQ points?\u003C/p\u003E\u003Cp\u003EI\u0027m currently trying to get a stable node set up for my return journey from Eeloo. Based on phase angle projections, the next available window is in 182 days.\u003C/p\u003E\u003Cp\u003EI\u0027m punching in numbers to get to the approximately correct date-time, using finer grain numbers to attune my exit angle and velocity. Trouble is, the greater precision results in all sorts of wobble and paradoxical behaviour.\u003C/p\u003E\u003Cp\u003EFor example, I add \u00221\u0022 to each additional decimal place on the date-time, which should result in an increasingly smaller (but unidirectional) increment on the ejection angle:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D2HuyY9.png\u0022 alt=\u0022D2HuyY9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUhhh... as I\u0027m writing this, I just noticed the ejection angle readout going absolutely crazy, spitting out hundreds of numbers per second. I expect the problem is something to do with stock KSP (increasing error further in time), but felt the need to log it.\u003C/p\u003E\u003Cp\u003EWhat happened to the \u0022we\u0027ve fixed nodes\u0022 statements of .23.5??? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pharylon","CreatedById":109423,"CreatedDateTime":"2014-05-25T21:34:55Z","Content":"\n\u003Cp\u003EJust want to mention I LOVE you and couldn\u0027t imagine playing KSP without Precise Node now. Also, I have a suggestion: you know when KSP bugs out and won\u0027t let you place a node on your current (blue) trajectory, only the purple (future) one? A nice option might be the ability to just have Precise NOde place a node X minutes in the future. And, again, thanks for the awesome mod!\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-26T09:36:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pharylon\u0022 data-cite=\u0022Pharylon\u0022\u003E\u003Cdiv\u003EJust want to mention I LOVE you and couldn\u0027t imagine playing KSP without Precise Node now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou really need to thank regex for that. He created the plugin, and I\u0027m maintaining it now since April.\u003C/p\u003E\n"},{"CreatedByName":"flashcactus","CreatedById":103335,"CreatedDateTime":"2014-05-29T18:17:47Z","Content":"\n\u003Cp\u003EWhere can I get prevoius versions of the mod? 0.23 says the 0.12 version is incompatible, and 0.23.5 crashes on my machine.\u003C/p\u003E\n"},{"CreatedByName":"Desrtfox","CreatedById":80185,"CreatedDateTime":"2014-05-29T23:20:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003EDoes anyone else have problems placing a node far into the future? Or have I dropped a few IQ points?\u003Cp\u003EI\u0027m currently trying to get a stable node set up for my return journey from Eeloo. Based on phase angle projections, the next available window is in 182 days.\u003C/p\u003E\u003Cp\u003EI\u0027m punching in numbers to get to the approximately correct date-time, using finer grain numbers to attune my exit angle and velocity. Trouble is, the greater precision results in all sorts of wobble and paradoxical behaviour.\u003C/p\u003E\u003Cp\u003EFor example, I add \u00221\u0022 to each additional decimal place on the date-time, which should result in an increasingly smaller (but unidirectional) increment on the ejection angle:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/D2HuyY9.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/D2HuyY9.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUhhh... as I\u0027m writing this, I just noticed the ejection angle readout going absolutely crazy, spitting out hundreds of numbers per second. I expect the problem is something to do with stock KSP (increasing error further in time), but felt the need to log it.\u003C/p\u003E\u003Cp\u003EWhat happened to the \u0022we\u0027ve fixed nodes\u0022 statements of .23.5??? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m having a different, but similar issue. I\u0027m not sure what Mod is at fault, but there seems to be a major timing issue going on with the placement of the nodes:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/3314960402913477845/1396BB15A0B244E3B6E718B312284A63116D860C/\u0022 alt=\u00221396BB15A0B244E3B6E718B312284A63116D860C\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote that PreciseNode shows Year 2, But everything else shows Year 5. Also, the node is placed in the future, but PreciseNode and Alarm Clock show it as 38 days in the future, whereas RT2 shows it as 9. Needless to say, I\u0027m having trouble sending my Duna probe.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-30T01:12:57Z","Content":"\n\u003Cp\u003EIs your game set to display Kerbin days, or Earth days? Sounds like PreciseNode and Alarm Clock are talking about 38 Kerbin days, where RT2 is talking 9 Earth days. Go into settings and check to see - the 23.5 update runs on Kerbin days by default. Changing it to Earth days should fix your issue.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-30T08:10:07Z","Content":"\n\u003Cp\u003EJust to note, PreciseNode should display Earth/Kerbin days and durations correctly.\u003C/p\u003E\n"},{"CreatedByName":"Desrtfox","CreatedById":80185,"CreatedDateTime":"2014-05-31T00:19:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EIs your game set to display Kerbin days, or Earth days? Sounds like PreciseNode and Alarm Clock are talking about 38 Kerbin days, where RT2 is talking 9 Earth days. Go into settings and check to see - the 23.5 update runs on Kerbin days by default. Changing it to Earth days should fix your issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EJust to note, PreciseNode should display Earth/Kerbin days and durations correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, by switching to \u0022Earth days\u0022 all the stats sync up. Of course, I don\u0027t really want to run in Earth days.\u003C/p\u003E\u003Cp\u003EAlso, if you note from the previous screenshot, even though \u0022Kerbin Days\u0022 was selected in settings, the time that PreciseNode was showing was still in Earth days. Could this be because this save game originated from .22?\u003C/p\u003E\n"}]}