{"TopicId":44170,"ForumId":32,"TopicTitle":"Recreating the apollo rover","CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-28T14:46:27Z","PageNum":1,"Articles":[{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-28T14:46:27Z","Content":"\n\u003Cp\u003ESo I\u0060ve been checking out how Apollo did their rover to see if I could reproduce it in KSP. My goal was to change from 4 engines and a rover in the middle to a single engine and a rover somehow around it and so be closer to how they did it in RL. What I found was this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.moonlandinghoax.org/resources/ap15-KSC-71P-206%245B1%245D.jpg\u0022 alt=\u0022ap15-KSC-71P-206$5B1$5D.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.moonlandinghoax.org/resources/_wsb_433x279_lrv-deployment%245B1%245D.jpg\u0022 alt=\u0022_wsb_433x279_lrv-deployment$5B1$5D.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhich does not seem easy to reproduce and impossible in stock. Anyone got any thoughts?\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-28T15:16:06Z","Content":"\n\u003Cp\u003EA folding rover is going to be difficult. I just settled for a design that snugs up against the side of the LM and has a small robotic arm to deploy it.\u003C/p\u003E\u003Cp\u003ELanding:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IKHtM3t.png\u0022 alt=\u0022IKHtM3t.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERover deployed:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nFCN21k.png\u0022 alt=\u0022nFCN21k.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe descent-stage, with another look at the deployment system:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HU5NT0x.png\u0022 alt=\u0022HU5NT0x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe arm was three rotary motors that swung the rover out to the side of the LM then pivoted it down to the horizontal position before dropping it onto the ground. The extendable instrument platform on the other side was mainly to balance out the mass of the rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ERscgCw.png\u0022 alt=\u0022ERscgCw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd, just for completeness, the LM ascent stage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lxLK7JZ.png\u0022 alt=\u0022lxLK7JZ.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-28T15:22:47Z\u0022 title=\u002208/28/2013 03:22  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 28, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-08-28T15:17:33Z","Content":"\n\u003Cp\u003EUntil Squad implements articulated parts, this would be impossible to reproduce as the documents show it. However, you could make a smallish rover and tack it onto a docking port to the side.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-28T15:21:21Z","Content":"\n\u003Cp\u003EApollo LRVs had an electric motor in each wheel and front \u002B rear steering, as such pretty much exactly what you\u0027d get with a stock rover in KSP. You could even disable one of the steering motors to only steer with front or rear wheels. So really, looks and functionwise you can replicate the Apollo LRV pretty well in KSP, here\u0027s my version:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qWTejsb.jpg\u0022 alt=\u0022qWTejsb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ppvo7Xa.jpg\u0022 alt=\u0022ppvo7Xa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only thing you can\u0027t really recreate is the folding of the rover, even then the scale would be off so any lander you have would have to be larger designwise. Also as the Apollo LRV was designed a lot of equipment was mounted onto it after deployment, which also isn\u0027t feasible in KSP. I\u0027ve seen rovers using docking ports so that you have two halves, both driven by a independent probecore to be able to connect. But sizewise that also isn\u0027t entirely feasible. I may try to make one that\u0027s similar in size to my personal version.\u003C/p\u003E\u003Cp\u003EI just attach my rover to the side of my lander, where the LRV would normally have been folded up, but really the difference in scale makes it hard to do better.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WVtR1mO.jpg\u0022 alt=\u0022WVtR1mO.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"spectrhz","CreatedById":69106,"CreatedDateTime":"2013-08-28T16:00:33Z","Content":"\n\u003Cp\u003EI saw someone make a rover that was separated in the middle by two docking ports and the halves were stored on either side of the lander. It would then dock together and go about being a rover. Not Apollo, and not folding but it\u0027s just about the best your going to able to do in KSP as far as I can tell.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-08-28T18:04:37Z","Content":"\n\u003Cp\u003EI made a folding rover for my Apollo mission. I used the Damned Robotics hinges so it could fold. \u003C/p\u003E\u003Cp\u003EHere\u0027s an album showing the unfolding sequence - \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/V2xXc\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E(or check out my apollo vid - \u003Ca href=\u0022https://youtu.be/LZs63oFmNa0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/LZs63oFmNa0\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EThe way the DR hinges work means that as it folded parts where clipping into each other and so it kinda defies physics. I also, in an \u0022I don\u0027t care about realism, I want speed\u0022 moment, bolted twin RCS thrusters to the back of it, making it my fastest, yet most stable rover yet.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-28T18:17:51Z\u0022 title=\u002208/28/2013 06:17  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 28, 2013\u003C/time\u003E by katateochi\u003C/strong\u003E\n\u003Cbr\u003Eput album in imgur tags - thanks Johnno\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-28T18:11:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EHere\u0027s an album showing the unfolding sequence - \u003Ca href=\u0022http://imgur.com/a/V2xXc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/V2xXc\u003C/a\u003E (could someone please tell me how to embed an album here!) \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou use imgur tags and put in the album name, in the above case V2xXc. So it would be [ imgur]V2xXc[ /imgur].\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-08-28T18:18:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnno\u0022 data-cite=\u0022Johnno\u0022\u003E\u003Cdiv\u003EYou use imgur tags and put in the album name, in the above case V2xXc. So it would be [ imgur]V2xXc[ /imgur].\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks!! updated post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2013-08-28T18:35:46Z","Content":"\n\u003Cp\u003EThe \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43374-0-21-UPDATED-Munshine-V-Apollo-style-Mun-craft-including-buggy-under-200-parts%21\u0022 rel=\u0022external nofollow\u0022\u003EMunshine V\u003C/a\u003E comes with a rover that is slung under the left-hand side of the Munar Module. I tried all kinds of crazy little payloads to counterbalance it, ended up using a couple of RCS tanks. Tee-hee! At 12 parts and less than half a ton in mass, I\u0027ve been bringing these little beauties\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/47333-STOCK-MOdular-Mission-System-%28MOMS%29-Shakedown-Cruise-Establishing-a-Base-on-Duna\u0022 rel=\u0022external nofollow\u0022\u003E to Duna as well\u003C/a\u003E and will probably continue to bring them wherever I go. Because it\u0027s easy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESadly, no folding rovers in stock of course...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dUh7JA8.png\u0022 alt=\u0022dUh7JA8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oCvUbb7.png\u0022 alt=\u0022oCvUbb7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hpI2S03.png\u0022 alt=\u0022hpI2S03.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ShHH4u7.png\u0022 alt=\u0022ShHH4u7.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-29T20:34:50Z","Content":"\n\u003Cp\u003EI think what I am picking up here is either use damned robotics or leave it unpacked, sling it to the side of the engine and then balance the weight of the rover with \u0060stuff\u0060.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-08-29T20:54:53Z","Content":"\n\u003Cp\u003EI think the best counterweight is... another rover! With their propensity for flipping or otherwise breaking, it\u0027s helpful to have a spare.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-08-29T21:42:22Z","Content":"\n\u003Cp\u003EI simply made a two-kerbal rover small and light enough to stick on the side of my Apollo lunar module. Because the lower two wheels are under compression against the descent stage of the LM, when the rover is ejected it rotates out and lands on its wheels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MgIGzRq.gif\u0022 alt=\u0022MgIGzRq.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E(This one was a ladder-rider version, back before we had control seats.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T21:46:57Z\u0022 title=\u002208/29/2013 09:46  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-30T01:03:03Z","Content":"\n\u003Cp\u003EI think I will have to go with a micro rover instead of a full apollo replica which is a shame but needs must etc. Looks like they packed it in too well unless I go with Dr again.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-08-30T02:08:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EI think what I am picking up here is either use damned robotics or leave it unpacked, sling it to the side of the engine and then balance the weight of the rover with \u0060stuff\u0060.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr all of the above. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=NsCI5T7z4pY\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=NsCI5T7z4pY\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve since improved the design with a less energetic decoupler.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-30T02:16:02Z\u0022 title=\u002208/30/2013 02:16  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 30, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-08-30T12:47:39Z","Content":"\n\u003Cp\u003ELess than folding rovers, I want actual payload bays at some point where you can load craft in to, so long as they are smaller than the bay size.\u003C/p\u003E\u003Cp\u003EOf course that also pushes for 3.5m parts.\u003C/p\u003E\u003Cp\u003EBut anyway, 1.5 and 2.5m payload bays of roughly lander can and twice and thrice that height options would be cool. So you could store a probe or micro rover inside of a 1.5m bay or a small rover or very small ship inside of a 2.5m bay.\u003C/p\u003E\u003Cp\u003EI generally go with side mount rovers. In my experience, so long as I don\u0027t land with the rover up slope (if on any kind of slope), then when they fall to the ground they pivot forward slightly. Then I just usually need to back up and it\u0027ll fall flat. I just have to remember to load a kerbal in to the seat first (otherwise if it is on even a gentle slope it starts rolling away and I can\u0027t catch it! Done that once where it rolled 5km along a gentle slope and then down in to a crater pinwheeling end over end before finally blowing in to bits. Legend...wait for it...dary!)\u003C/p\u003E\u003Cp\u003EMy Apollo mission is finally coming together again. After the rover incident that I mentioned, the rest of the mission was just full on fail. I landed on too steep a slope. I had forgotten to equip my ship with a reaction control system, so it wouldn\u0027t use the RCS to stabalize at all and tipped. I managed to get it flipped upright after collapsing the lander legs and then extending them again. Then I popped the rover and lost it. Then I jetted a kerbal up to the top of a nearby mountain to plant my flag (I had landed on the slope 1,200m from the peak) and on returning came in too fast and crunched my kerbal. It auto switched to my ship since I ploped my kerbal right next to the ladder, I accidently hit the shift button and throttled up and pinwheeled the ship down the slope (mental note, from now on after landing MANUALLY DISABLE THE ENGINE!). I decided, screw it. Kixon will do his speech about the poor stranded kerbal (we are now minus one) and the kerbal in orbit will return in the CSM. I get back to Kerbin, hit the atmosphere and then look at the capsule...I forgot to put parachutes on it. Scratch one more Kerbal.\u003C/p\u003E\u003Cp\u003EIt was the most epically fail laced mission EVER for me. Most just simply fail for some good reason, like not enough dV, or too little thrust for landing, or the launcher breaks apart, or whatever. This one, just about every step after leaving Kerbin orbit was fail.\u003C/p\u003E\u003Cp\u003EHopefully better luck this time. Rover is redesigned to be a bit better and more durable. LM is vastly redesigned to look a little more Apollo-y, as well as slightly higher dV on the landing stage, better control and slightly wider stance on the landing legs for more stability. The CSM was pretty much fine before, but I do need to remember parachutes this time. I may also assemble the thing so it goes up in one launch. Before I did Kerbin orbit assembly for the CSM and the LM because I didn\u0027t want to make a huge launcher for the whole thing, but I may just do that this time. I just have to make sure that the launcher has enough fuel in the 3rd stage to both get LKO and also manage TMI as the CSM design I have probably won\u0027t have the dV to do TMI, circularization and TKI later.\u003C/p\u003E\u003Cp\u003EGoing to be one BIG launcher.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-31T01:24:35Z","Content":"\n\u003Cp\u003EInteresting thread to see when I\u0027ve just finished deploying my rover on Mun. I\u0027ve never designed a rover before.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/116hs10.png\u0022 alt=\u0022116hs10.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe screenshot was from one of the several landings (search for anomalies) and I\u0027ve got only this screenshot where the lander tipped on a slope.\u003C/p\u003E\u003Cp\u003ERover was hooked on the side of the lander. I\u0027ve included a small RCS tank and two nozzle units so I could separate the rover and then place it correctly on the ground. The separation looked a bit like the one in Brotoro\u0027s GIF. Just a small monopropellant push, that\u0027s it.\u003C/p\u003E\u003Cp\u003EIt was not until the Kerbals boarded the seats that I realized the seats are looking straight up, so they were lying on the rover while driving.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-31T04:20:28Z","Content":"\n\u003Cp\u003EI\u0060ve decided to go for it and made a reasonable rover fit inside a reasonable lander. This is what I ended up with so far. Still lots of work needed on the lifter. \u003Cimg src=\u0022http://imageshack.us/a/img16/6006/k8oh.png\u0022 alt=\u0022k8oh.png\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img196/5177/kee9.png\u0022 alt=\u0022kee9.png\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img541/9708/uh4o.png\u0022 alt=\u0022uh4o.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-31T10:45:10Z","Content":"\n\u003Cp\u003EMy take on Apollo also went with a side mounted rover, but with a special frame that would direct its deployment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fVtMNmTh.png\u0022 alt=\u0022fVtMNmTh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Science experiment packs\u0022 balanced it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-31T10:47:29Z\u0022 title=\u002208/31/2013 10:47  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 31, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-31T12:49:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lazarus1024\u0022 data-cite=\u0022lazarus1024\u0022\u003E\u003Cdiv\u003ELess than folding rovers, I want actual payload bays at some point where you can load craft in to, so long as they are smaller than the bay size. Of course that also pushes for 3.5m parts. But anyway, 1.5 and 2.5m payload bays of roughly lander can and twice and thrice that height options would be cool. So you could store a probe or micro rover inside of a 1.5m bay or a small rover or very small ship inside of a 2.5m bay. I generally go with side mount rovers. In my experience, so long as I don\u0027t land with the rover up slope (if on any kind of slope), then when they fall to the ground they pivot forward slightly. Then I just usually need to back up and it\u0027ll fall flat. I just have to remember to load a kerbal in to the seat first (otherwise if it is on even a gentle slope it starts rolling away and I can\u0027t catch it! Done that once where it rolled 5km along a gentle slope and then down in to a crater pinwheeling end over end before finally blowing in to bits. Legend...wait for it...dary!) My Apollo mission is finally coming together again. After the rover incident that I mentioned, the rest of the mission was just full on fail. I landed on too steep a slope. I had forgotten to equip my ship with a reaction control system, so it wouldn\u0027t use the RCS to stabalize at all and tipped. I managed to get it flipped upright after collapsing the lander legs and then extending them again. Then I popped the rover and lost it. Then I jetted a kerbal up to the top of a nearby mountain to plant my flag (I had landed on the slope 1,200m from the peak) and on returning came in too fast and crunched my kerbal. It auto switched to my ship since I ploped my kerbal right next to the ladder, I accidently hit the shift button and throttled up and pinwheeled the ship down the slope (mental note, from now on after landing MANUALLY DISABLE THE ENGINE!). I decided, screw it. Kixon will do his speech about the poor stranded kerbal (we are now minus one) and the kerbal in orbit will return in the CSM. I get back to Kerbin, hit the atmosphere and then look at the capsule...I forgot to put parachutes on it. Scratch one more Kerbal. It was the most epically fail laced mission EVER for me. Most just simply fail for some good reason, like not enough dV, or too little thrust for landing, or the launcher breaks apart, or whatever. This one, just about every step after leaving Kerbin orbit was fail. Hopefully better luck this time. Rover is redesigned to be a bit better and more durable. LM is vastly redesigned to look a little more Apollo-y, as well as slightly higher dV on the landing stage, better control and slightly wider stance on the landing legs for more stability. The CSM was pretty much fine before, but I do need to remember parachutes this time. I may also assemble the thing so it goes up in one launch. Before I did Kerbin orbit assembly for the CSM and the LM because I didn\u0027t want to make a huge launcher for the whole thing, but I may just do that this time. I just have to make sure that the launcher has enough fuel in the 3rd stage to both get LKO and also manage TMI as the CSM design I have probably won\u0027t have the dV to do TMI, circularization and TKI later. Going to be one BIG launcher.\u003C/div\u003E\u003C/blockquote\u003E I would like that also. I would also accept the concept that things like wheels, antenna, solar panels etc would be folded away in a payload bay so you could have a craft 25% larger than the payload bay and say that parts unfolded etc. I would say a mass limit rather than a size limit would make more sense because those space guys pack it all in very well! They could get jobs as van drivers!\n"}]}