{"TopicId":44237,"ForumId":55,"TopicTitle":"Clouds!!!","CreatedByName":"SuperNova2015","CreatedById":79702,"CreatedDateTime":"2013-08-29T02:24:14Z","PageNum":1,"Articles":[{"CreatedByName":"SuperNova2015","CreatedById":79702,"CreatedDateTime":"2013-08-29T02:24:14Z","Content":"\n\u003Cp\u003EYes I know that someone has probably posted on this before and that there is already a cloud mod, but I want MORE!!!\u003C/p\u003E\u003Cp\u003EThat cant be asking too much especially for Kerbin and Eve, which are just incomplete without clouds. Adding an additional\u003C/p\u003E\u003Cp\u003E low-poly sphere around the planet with an alpha map and adding that to the planets ray-trace calculations would make\u003C/p\u003E\u003Cp\u003E things look a thousand times better when in space and near the ground (this is extremely easy and even I\u0027ve done it\u003C/p\u003E\u003Cp\u003Ein my own little experiments). And it shouldn\u0027t affect the fps much ether.To make things even better when in between\u003C/p\u003E\u003Cp\u003E space and the ground hide the cloud sphere and add clusters of 2D sprites like in Flight Simulator, ace combat,\u003C/p\u003E\u003Cp\u003E Just Cause and hundreds of other tittles.\u003C/p\u003E\u003Cp\u003ETo me Kerbin and Eve are eyesores without clouds. Jool and possibly Laythe should have clouds as well though Jool probably wouldn\u0027t look much different considering Jupiter\u0027s Clouds.\u003C/p\u003E\u003Cp\u003EAnd on a different topic entirely sandstorms on Duna would be sooooooooooo Epic!!!\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-29T09:41:46Z","Content":"\n\u003Cp\u003EAlthough often suggested, Weather is on the what-not-to-suggest list. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pugspaceprogram","CreatedById":57139,"CreatedDateTime":"2013-08-29T09:47:37Z","Content":"\n\u003Cp\u003EAllmappedout has it all mapped out. Clouds is on the not to suggest list.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-08-29T10:01:09Z","Content":"\n\u003Cp\u003EWhat alimappedout and Pugspacerprogram said, \u003C/p\u003E\u003Cp\u003EClouds is part of the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003ENot to suggest list\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAll items or that list are either planned, already suggested lot of time, or planned to not be in the game.\u003C/p\u003E\n"}]}