{"TopicId":44276,"ForumId":44,"TopicTitle":"Why does the universe exist?","CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-08-29T13:32:09Z","PageNum":5,"Articles":[{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-14T18:10:23Z","Content":"\n\u003Cp\u003ESo- using what you said, that it \u0022exists to make black holes\u0022, your saying that nothing randomly decided to make a universe that contains black holes?\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2013-12-14T20:30:56Z","Content":"\n\u003Cp\u003EIt exists because It has to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond answer: my theory is that the Big bang was done by God to create an experiment, like a Sandbox, to see how different things behave in the universe. We are not very appealing to him right now I think \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-12-14T22:49:54Z","Content":"\n\u003Cp\u003EThis is a question regarding the Meta-physical. The WHY implies an outside intent and as such a deity of sorts. The thoughts of said deity can\u0027t and won\u0027t be understood by humans.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-12-14T23:23:26Z","Content":"\n\u003Cp\u003EThe universe exists because it feels like it.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-14T23:41:59Z","Content":"\n\u003Cp\u003EWell, if the universe didn\u0027t exist, where would we put everything?\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-12-14T23:49:20Z","Content":"\n\u003Cp\u003ERead also: The Big Bounce\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-14T23:56:14Z","Content":"\n\u003Cp\u003EWhy is everyone here so sure that the universe exists?\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-12-15T08:52:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iDan122\u0022 data-cite=\u0022iDan122\u0022\u003E\u003Cdiv\u003Emy theory is that the Big bang was done by God to create an experiment\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich raises the question: why does God exist?\u003C/p\u003E\u003Cp\u003EIn case you think the existence of god requires no explanation, then why would the existence of the universe require explanation?\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-12-15T08:59:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EThis is a question regarding the Meta-physical. The WHY implies an outside intent and as such a deity of sorts. The thoughts of said deity can\u0027t and won\u0027t be understood by humans.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it doesn\u0027t. For example, take the question \u0022Why do humans exist?\u0022. It can easily be answered through mentioning natural selection, without having to mention any sort of motive or external being.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-12-15T09:11:23Z","Content":"\n\u003Cp\u003E\u0022Why do humans exist?\u0022 answered by a religious person very likely will involve intent from god.\u003C/p\u003E\u003Cp\u003EThe problem is, \u0022why\u0022 -can- imply intent, or it can be meant as synonymous to \u0022how\u0022 or \u0022how come\u0022. Why questions asked of scientific issues are ambiguous.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-12-15T12:22:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003ENo it doesn\u0027t. For example, take the question \u0022Why do humans exist?\u0022. It can easily be answered through mentioning natural selection, without having to mention any sort of motive or external being.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. You\u0027re explaining the HOW not the WHY. Natural selection is a physical process that explains \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003Ehow\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E modern humans developed. This isn\u0027t a question regarding science, it is a question regarding why. The evolution of the universe is science. The why of this universe is madness.\u003C/p\u003E\n"},{"CreatedByName":"agentKmurph","CreatedById":80512,"CreatedDateTime":"2013-12-15T19:21:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monkeh\u0022 data-cite=\u0022Monkeh\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIs it a random happening? A coming together of physics and probability?\u003C/p\u003E\u003Cp\u003EHas the universe been created as some sort of energy producing device? \u003C/p\u003E\u003Cp\u003EA \u0027Godlike\u0027 being\u0027s personal plaything?\u003C/p\u003E\u003Cp\u003EA science experiment gone out of control?\u003C/p\u003E\u003Cp\u003EWas it created specially for sentience to exist?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. The only thing we know for sure is that the universe exists. If we spend all of energy trying to figure out why, then we will never do anything worthwhile. Of course that also raises the question. If we can\u0027t figure out the purpose then why do anything at all? All of our actions would be meaningless and inconsequential, right? Hardly.\u003C/p\u003E\u003Cp\u003EHere\u0027s the thing. At any given moment, we are presented with a literally infinite swath of choices. Some of these choices are admittedly inconsequential but more often than not our choices could result in damages to the property of ourselves in others, death of ourselves and others, or swing to the other side and our choices could solve a major world problem or keep someone else from taking the short way out with the latter options I mentioned. A lot of our choices are intertwined, even sometimes codependent with the lives of other people and indeed the very nature of the universe. By making each choice, we are condensing the theoretically infinite realities of our world down to one. We do this thousands of times a second...\u003C/p\u003E\u003Cp\u003EWhat is this BS about humans not having the power? I change the entirety of our reality with just one choice and I make thousands of choices per second. With that kind of power alone, I would say life\u0027s pretty worth living for. Who cares where it all came from?\u003C/p\u003E\u003Cp\u003E2. The thing about the laws of nature is that the only reason they appear to exist is because things appear to follow them. There is a codependency / tautology here. The laws of nature exist must exist because most everything we observe adhere to them closely and things adhere to the laws of nature because they apparently exist. When you start thinking about the circular logic, you begin to realize that there is not really any reason for the relationship between the behavior of objects and the physical precepts supposedly guiding their behavior. Therefore it is entirely reasonable in my mind that we get things that seemingly disobey the laws of nature like black holes, white holes, singularities, dark matter, dark energy, and the idea of changing constants. Whose to say that the laws of physics are laws at all? Why can\u0027t they change over time? The answers to these questions are simple; no one, no reason.\u003C/p\u003E\u003Cp\u003E3. A simple analysis of the universe\u0027s composition (which ultimately turns out to be fundamentally unobservable particles called quarks) would point to a Hindu or Taoist perspective of a god (sorry to bring religion in but I am at a lost for how else to describe this). That is there is an eternal essence that composes the universe but that is only made to look different. Therefore, a god wouldn\u0027t be removed from the universe - a god is the universe which would make us humans part of that god. So the end, yes the universe is a goddlike being\u0027s personal plaything. We just make the mistake that something else is holding the brush.\u003C/p\u003E\u003Cp\u003E4. People call me crazy for this but I think its hardly far fetched that the universe is actually just the product of an alien civilization\u0027s computer simulation of the universe they live in or that the universe was created by a Type 4 or 5 Kardashev civilization (transcendent race; complete mastery of energy and spacetime). Actually some of the things in our universe such as the Planck Length or the varying constants conundrum already point to the computer simulation theory. Quantization is characteristic of computers which cannot render continuously varying systems and must instead iterate them in infinitesimally small ticks. Floating point losses could also account for thousandth-of-a-percent errors required in the fine structure constant to make light arriving at Earth from the first stars obey the laws of relativity.\u003C/p\u003E\u003Cp\u003E5. Consciousness is a funny thing. The brain is an organ trying to understand itself. It is indeed too complex and paradoxical in issue to really determine for sure whether or not there is some special purpose for it. I guess that from an evolutionary standpoint, intelligence is one of the more useful traits to an organism. This is why the average mammalian brain has been getting larger over the years. Self-awareness is a logical progression of intelligence that allows for deeper analysis of a situation, weighting of selfish vs selfless impulses, a sense of personal space, etc and therefore an enhanced ability to survive. Consciousness runs into a problem though because once its clever enough meet its needs in less time than is actually alotted, it starts to wonder it existed in the first place.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-12-15T23:58:46Z","Content":"\n\u003Cp\u003EIn order to know why the universe exists, we would have to know what is outside and what outside process created it.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-12-16T22:40:28Z","Content":"\n\u003Cp\u003EThis is quite a good question. I believe only a time machine could hope to figure it out.\u003C/p\u003E\u003Cp\u003EThat said, if it didn\u0027t exist we couldn\u0027t be asking. So it\u0027s possible the Universe is actually in it\u0027s infancy compared to.... erm... whatever you\u0027d call the vast nothingness before it. Perhaps this is a universe created from a white hole (the hypothetical opposite of a black hole, spewing out time and space and matter) that came from another universe\u0027s black hole. Because of this, it\u0027s very much possible that there is evidence of something far different than a big bang in the other universe, whether it be a god entity, we do not know.\u003C/p\u003E\u003Cp\u003EIt\u0027s also possible that the same idea of the evidence not being in our universe could apply to the fact that we could be a computer simulation to begin with, and that the real evidence lies in \u003Cem\u003Eour creator\u0027s\u003C/em\u003E, that is to say, the beings that host us, universe.\u003C/p\u003E\u003Cp\u003EAmazingly mind-boggling.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-12-16T23:22:25Z","Content":"\n\u003Cp\u003EIf the universe naturally emerged, and there is no God, then the answer to \u0022Why does the universe exist?\u0022 must eventually come down to a \u0022just because\u0022 statement.\u003C/p\u003E\u003Cp\u003EIf God created the universe, then the first answer to the question of \u0022Why?\u0022 is \u0022because God wanted it\u0022. Of course, in this case, the next logical question to ask is \u0022Why does God exist?\u0022. A religious person has to say at this point, \u0022just because\u0022, or at best, can delay the \u0022just because\u0022 by only one more answer. Eventually, the religious person has to say it. So the ultimate \u0022why?\u0022 even in a theistic universe, is still \u0022just because\u0022.\u003C/p\u003E\u003Cp\u003ESo ultimately, neither a theistic or atheistic origin of the universe gives an \u0022satisfactory\u0022 answer to the ultimate origin of reality, unless you are willing to accept \u0022just because\u0022.\u003C/p\u003E\u003Cp\u003ESo, in answer to \u0022Ultimately, why does the universe exist?\u0022, regardless of the existence or nonexistence of God, I feel I am fairly certain to be correct by simply saying, \u0022just because\u0022.\u003C/p\u003E\u003Cp\u003EBut why shouldn\u0027t \u0022just because\u0022 be a satisfactory answer? I think we find \u0022just because\u0022 unsatisfactory because we want there to be a reason or purpose behind everything. But the fact of the matter is, there doesn\u0027t have to be a reason or purpose behind something. 1 \u002B 1 = 2 just because it does. In fact, the very meaning of \u0022purpose\u0022 only makes sense in context to the actions of an intelligent being.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T23:33:18Z\u0022 title=\u002212/16/2013 11:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-16T23:58:05Z","Content":"\n\u003Cp\u003EI\u0027m sure it\u0027s been said before, but there doesn\u0027t have to be a \u0022why\u0022. (Unless by \u0022why\u0022 you actually mean \u0022how\u0022. There\u0027s definitely a \u0022how\u0022 out there waiting to be found)\u003C/p\u003E\n"},{"CreatedByName":"makinyashikino","CreatedById":96244,"CreatedDateTime":"2013-12-17T02:09:44Z","Content":"\n\u003Cp\u003EWhat if the universe is just a computer simulation, and we are just little strings of code. Maybe one day when we advance computers enough, we could make another universe-simulating computer. And all of existence is a never-ending computer simulation, relative time getting slower and slower, as you go down through the universal simulational scale, eventually leading into the universal singularity.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-12-17T16:30:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cavenyanson\u0022 data-cite=\u0022Cavenyanson\u0022\u003E\u003Cdiv\u003EWhat if the universe is just a computer simulation, and we are just little strings of code. Maybe one day when we advance computers enough, we could make another universe-simulating computer. And all of existence is a never-ending computer simulation, relative time getting slower and slower, as you go down through the universal simulational scale, eventually leading into the universal singularity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s simply not possible. The universe can only be fully simulated on a computer at least as complex as the universe itself. We can\u0027t even get close to that level of complexity, and we never could- the speed of light limit, for example, would make really large computers run extremely slowly, and we simply can\u0027t utilize enough particles to make a computer that complex (we would basically have to utilize the entire universe). So, at best, we can make a computer maybe something like 1/10^15 as complex as the universe itself, MAYBE after a billion years of advancement.\u003C/p\u003E\u003Cp\u003EThat does not mean that we are not capable of creating a computer simulation that could include intelligent beings, but their universe will be, by necessity, much more simple than ours. As you go down the chain, eventually you get a universe that is too simple for intelligences smart enough create computers to exist. Clearly, reality cannot be an infinite series of nested computer simulations, unless we are VERY near the bottom, and it is \u0022simulations all the way up\u0022- which is impossible. There must be a \u0022real\u0022 universe \u0022up there\u0022 somewhere to get the ball rolling. And even if you somehow discount this, and claim that it can be \u0022simulations all the way up\u0022 we find ourselves very near the \u0022bottom\u0022, which is just about infinitely unlikely.\u003C/p\u003E\u003Cp\u003EAnd you claim that the simulations just run more slowly in each nested universe. Again, impossible. Regardless of the simulation speed, you still need memory to store all the particle positions, velocities, states, etc. Your computer is still at least as complex as the universe it is simulating (in reality, your computer must of course be at least many times more complex). For example, consider that if you install a video game on a dual core, 2 GHz computer, it is the same installed size as on a eight core, 4 GHz beast. \u003C/p\u003E\u003Cp\u003EAnother reason it is impossible, besides the fact that running the simulation more slowly doesn\u0027t really save you in computer complexity, is that as you go up the chain, the simulations must run for a longer and longer and longer and longer time period. At some point, you get to the point where you have to run the computer for longer than the age of the simulated universe, just so your lowest universe can live long enough to evolve to the point where they can create a simulated universe. But the simulated the universe they create cannot even live long enough to create a simulated universe of its own, so the chain has to end.\u003C/p\u003E\u003Cp\u003ESo in the end, the idea that reality is some kind of huge or infinite chain of simulated universes just does not stand to reason. At best, there could be a couple nested simulated universes. The most simple explanation is that we are not a simulation and the universe is, in fact, \u0022real\u0022- that there is no \u0022higher\u0022 law of physics.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-12-17T21:37:27Z","Content":"\n\u003Cp\u003Ea few simple words: Weak Anthropic Principal.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-21T20:43:44Z","Content":"\n\u003Cp\u003EJust want to say thank you to everyone that has taken the time to throw a few words down in this thread, I wanted to get some interesting things to read about this and you\u0027ve all certainly delivered.\u003C/p\u003E\u003Cp\u003EYou guys have some amazing and fascinating brains, this little delve inside was very interesting and informative, so cheers.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-22T07:06:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EThat\u0027s simply not possible. The universe can only be fully simulated on a computer at least as complex as the universe itself. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually something I have been wondering about for a while now. If you want a real time 1:1 model of the universe, you need a universe. But what if you half the speed? Would that not mean you would only need half of a universe to simulate a full universe? Inside the simulation it would not make a difference.\u003C/p\u003E\u003Cp\u003EWith similar reasoning I found that creating a model for our universe is never achieveable, not a full model at least. You would simply end up with a second universe. So yeah, maybe we are someone\u0027s model. Who knows.\u003C/p\u003E\u003Cp\u003EMost likely it is just a matter of \u003Cem\u003Ebecause\u003C/em\u003E. It is very human to want to find a reason (not necessarily cause) for everything - even if that is not appropiate. People just can not bare the idea that something just is. You see this in every day life, where people try to attach meaning to random - sometimes horrible, sometimes beautiful - events. There is some mechanism that led to the event, but that is not the same as a reason. Sometimes things just happen en we will just have to deal with it.\u003C/p\u003E\u003Cp\u003EPersonally, I love it. Whenever I am troubled I look at the stars and smile at the idea of loosely coherent structures of molecules calling themselves smart monkeys, born out of stellar dust through a giant chain of chance events. It is so whimsical that it is beautiful and so beautiful that it needs no further explanation \u003Cem\u003Ewhy\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"MatixCubix","CreatedById":61304,"CreatedDateTime":"2013-12-22T09:00:50Z","Content":"\n\u003Cp\u003EWhy the universe exists? Why things fall down? Why did something happend instead of the other? This \u0022Why\u0022 is quite interesting, and is also a creation of us.\u003C/p\u003E\u003Cp\u003EIs important to add that I belive that something exists \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Efor us\u003C/span\u003E when we have consciousness of it ( we know things), The \u0022why\u0022 is the first part of the process which would define our existance, why was created for giving a reason of some occurrence in our existence, On saying \u0022Why this happend and not the other?\u0022.\u003C/p\u003E\u003Cp\u003EThe reason of something is defined by the person, if someone belivies in religion god might be the reason.\u003C/p\u003E\u003Cp\u003EI honestly belive that the why, the reason, the existance for us, Dosent Exists for the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehole everything\u003C/span\u003E... We percive one reality... What if there were multiple realities?(Like a Tree branching defined by space and time(in other realities might be others)) this \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehole everything\u003C/span\u003E would be all of the posible realities that would be infinite... we form in a single reality when we are conciousness of it (Alive), We define the reality in a way our brain responses, and by a method I honestly dont know we define our pathway on the different paths in the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehole everything\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003ENow to the Question, why the universe exists is because we are conscious in a reality were the universe as we know it exists for us.\u003C/p\u003E\u003Cp\u003EI really think that this is a really hard question to answer, because we humans beings arent capable of analyzing it, This Philosophical, Physical, Quantum Mechanical question is quite odd and strange even our language isnt capable of defining it.\u003C/p\u003E\u003Cp\u003EThis might not be the best answer and this is not the absolute one, but one thing is sure for me: I congratulate you for asking that question I hope one day we get close to answer it. \u003C/p\u003E\u003Cp\u003ENow what I dont know is that the laws of physics would be variable in the different realities, if it so, I think it would be infinte the number of probabilities... If not, I wouldnÃ‚Â´t think so. this whole thing is just an idea... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T09:25:06Z\u0022 title=\u002212/22/2013 09:25  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by MatixCubix\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"comicbstudeo","CreatedById":29256,"CreatedDateTime":"2013-12-22T18:09:23Z","Content":"\n\u003Cp\u003Emy answer to this is, that in an infinite amount of time the probability of the universe existing is 100%. what i find more interesting is the prospect of in 100 trillion years when there will not be enough gas in the universe for stars to form and even later at the heat death of the universe\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2013-12-22T19:51:00Z","Content":"\n\u003Cp\u003EIn response to a question raised upon my assertion of self sustaining infinite causality it i would like to point out that why as a question in and of itself is as equally paradoxical as the existence of any one thing that CAUSED existence. Tell any small child to do some task that they do not want to do and it is not unlikely that they will respond with a surprisingly deep cycle of paradoxical why\u0027s. Why is unanswerable, but how is not. Why is a personal question implying motive. It is unapplicable to situations in which motive is undefined, and especially not in a universe like ours where such a motive is indeterminate. (Perhaps a limit can be taken? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ) my answer used a postulate based on taking the limit of 0/0 as a standard. The limit on one side is infinity, and on the other, negative infinity, but the limit as approached from either side can be derived to be 0 and thus infinity is only one side of nothing, and so is its opposite. Nothing is not truly absence, only the difference between boundless entities to either side of it in a sense, though that interpretation does not reveal the extent of the implications of such a system\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T19:55:26Z\u0022 title=\u002212/22/2013 07:55  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by TheGatesofLogic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-12-22T22:52:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022comicbstudeo\u0022 data-cite=\u0022comicbstudeo\u0022\u003E\u003Cdiv\u003Ein an infinite amount of time the probability of the universe existing is 100%.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like your thinking.\u003C/p\u003E\n"}]}