{"TopicId":44417,"ForumId":25,"TopicTitle":"The Real Space Race!","CreatedByName":"cantorobriar","CreatedById":79433,"CreatedDateTime":"2013-08-30T21:49:18Z","PageNum":1,"Articles":[{"CreatedByName":"cantorobriar","CreatedById":79433,"CreatedDateTime":"2013-08-30T21:49:18Z","Content":"\n\u003Cp\u003ENow I know this idea may have come up before, but it probably wasn\u0027t this hard, and it probably didn\u0027t require two people. (Also, I\u0027m not new to KSP. My friend and I did this and decided to post the idea on the forums.)\u003C/p\u003E\u003Cp\u003EAnyways, the point of the Space Race is to re-do the actual space race. One person is the U.S., and the other is the U.S.S.R. Then do a bit of research (yeah, you actually have to go to that thing called Google and use something called a keyboard) on the NASA and Russian Space Program Missions. The U.S. player attempts to recreate --\u0026gt;ALL\u0026lt;-- of the U.S. space missions, all the way back to Explorer 1. The U.S.S.R. does the same, but starts with Sputnik and does the Russian missions. I\u0027m not going to make it that confusing by adding a point system and stuff, just do it. You may download any part packs that you\u0027d like to make it more realistic and try to make them look similar to the original. Of course, I can\u0027t restrict you from using MechJeb or anything, so go ahead. Whoever recreates the International Space Station first wins! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E Post your sucess stories here. \u003C/p\u003E\u003Cp\u003E(You can do it alone if you wish, but then it\u0027s not much of a \u0022race\u0022) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-08-30T21:54:04Z","Content":"\n\u003Cp\u003EI did a two player space race about a year and a half ago with my friend, to see who could get to the mun. He couldn\u0027t get to the Mun and i couldn\u0027t land on it, so he lost \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bellino","CreatedById":67962,"CreatedDateTime":"2013-08-30T22:09:41Z","Content":"\n\u003Cp\u003EHm... some of the flights would be... interesting to re-create... also, if we were going to COMPLETELY recreate the space race, many failures would have t happen, and wouldn\u0027t the US always win? They landed on the Moon first...\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-08-30T22:17:28Z","Content":"\n\u003Cp\u003EA mission pack that both players had to go through each objective and the last one being the moon would be fun.\u003C/p\u003E\n"},{"CreatedByName":"Eussorus","CreatedById":66606,"CreatedDateTime":"2013-08-30T23:18:46Z","Content":"\n\u003Cp\u003EIf you guys want, I\u0027ll gladly give you a copy of a space race that me and a friend are doing as part of a competition to see who is the better between us. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2013-08-31T01:33:24Z","Content":"\n\u003Cp\u003EWell, insinuating that I\u0027m too stupid to use Google or a keyboard is more than enough reason for me not to do it.\u003C/p\u003E\n"},{"CreatedByName":"cantorobriar","CreatedById":79433,"CreatedDateTime":"2013-09-02T14:07:55Z","Content":"\n\u003Cp\u003EWhen I said re-create the space race, I didn\u0027t mean do EXACTLY in order. Just do the missions as fast as you can. If your fast enought, the U.S.S.R./Russian player may make it to the moon first.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-09-02T14:34:21Z","Content":"\n\u003Cp\u003EI don\u0027t see this as a valid challenge submission. You haven\u0027t followed enough of the guidelines while creating your initial post, you leave too much unclear / up to the participants, there\u0027s no points system etc etc, you\u0027re really just saying \u0022go do this\u0022. You CAN restrict people from using specific mods, you CAN post guidelines, you CAN make a list of missions instead of telling people to google. You really haven\u0027t put enough work into this to even warrant starting a thread.\u003C/p\u003E\u003Cp\u003EWith proper guidelines, rules, accomplishments / goals and perhaps even a points system this could be a really fun thing to try.\u003C/p\u003E\n"}]}