{"TopicId":44619,"ForumId":16,"TopicTitle":"Gravibreaking?","CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2013-09-01T17:51:04Z","PageNum":1,"Articles":[{"CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2013-09-01T17:51:04Z","Content":"\n\u003Cp\u003EIs it possible to get captured around Jool from a Kerbin-Jool interplanetary trajectory using Tylo or laythe? I just wanted try something other than aerocapture.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-01T18:30:34Z\u0022 title=\u002209/01/2013 06:30  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 1, 2013\u003C/time\u003E by Itchono\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-09-01T17:56:50Z","Content":"\n\u003Cp\u003ESomeone correct me if I\u0027m wrong, but I\u0027d say no. If you don\u0027t hit atmosphere or make a burn your speeds only going to increase from the slingshots\u003C/p\u003E\n"},{"CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2013-09-01T17:58:52Z","Content":"\n\u003Cp\u003EI thought you could use a reverse slingshot to decrease your velocity but I don\u0027t know if it\u0027s enough.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-09-01T18:10:22Z","Content":"\n\u003Cp\u003ENo I\u0027m pretty sure if you enter an SoI and don\u0027t make any maneuvers you will exit at a greater velocity. A different trajectory, but a faster speed. Why not just hit Laythe or Jool for an Areobrake? Saves a load of DV.\u003C/p\u003E\n"},{"CreatedByName":"iornfence","CreatedById":74870,"CreatedDateTime":"2013-09-01T18:15:09Z","Content":"\n\u003Cp\u003EIt is absolutely possible to \u0022Gravity brake\u0022. You aren\u0027t losing your momentum exactly, but ejecting retrograde to your target, in this case Jool. If you pass in front of the moon then leave it\u0027s gravity pointing retrograde to Jool, you should enter a stable orbit.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-09-01T18:17:17Z","Content":"\n\u003Cp\u003EIt\u0027s doable, at least in theory. Just make sure you enter the moon\u0027s SOI on the leading side and exit on the trailing side.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-01T18:22:16Z","Content":"\n\u003Cp\u003EYes, you can use a reverse slingshot around one of the moons to get captured into jool orbit. It all depends on the speed you enter Jool SOI, though. If you set up your hohmann transfer right you don\u0027t need to shed a lot of velocity to get captured. If you enter Jool SOI going at greater speed, you might have trouble getting a capture this way...\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-09-01T18:26:57Z","Content":"\n\u003Cp\u003EI am actually surprised this subject comes up \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eagain\u003C/span\u003E. It does get asked at least once every few weeks.\u003C/p\u003E\u003Cp\u003EYes, you can brake using gravity assists and aerobraking. But it will NOT result in a stable orbit. You might slow down enough to stay within Jool\u0027s SoI but you will eventually re-encounter the body you last visited. It might happen in just a few orbits, it might take several years but you will encounter that body again. And anything can happen at that time. You might get slowed down, get a boost or become a permanent resident. Unless of course you stabilize your orbit with your engines before that time.\u003C/p\u003E\n"},{"CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2013-09-01T18:30:25Z","Content":"\n\u003Cp\u003EOk, thanks for the help! I\u0027ll adjust my orbit once in jool SOI\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-04T09:04:48Z","Content":"\n\u003Cp\u003EAfter burning (literally) through Duna\u0027s atmosphere with a probe, not having enough fuel to make an orbit and flying to high in the atmosphere to slow down enough by aerobreaking, I had an encounter with its moon. The slingshot surprised me with a nice, high orbit around Duna afterwards.\u003C/p\u003E\u003Cp\u003EDid I actually loose momentum? Was the probe only thrown into an altitude in Duna\u0027s SOI at a velocity that corresponded with a valid orbit? Is it calculated correctly? Or is it just a quirk of KSP\u0027s two body engine that looks like a realistic result?\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-09-04T11:02:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EAfter burning (literally) through Duna\u0027s atmosphere with a probe, not having enough fuel to make an orbit and flying to high in the atmosphere to slow down enough by aerobreaking, I had an encounter with its moon. The slingshot surprised me with a nice, high orbit around Duna afterwards.\u003Cp\u003EDid I actually loose momentum? Was the probe only thrown into an altitude in Duna\u0027s SOI at a velocity that corresponded with a valid orbit? Is it calculated correctly? Or is it just a quirk of KSP\u0027s two body engine that looks like a realistic result?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a realistic result, absolutely. You can speed up as well as slow down using a slingshot.\u003C/p\u003E\u003Cp\u003EIf you pass a planet on its trailing side, you speed yourself up (the planet drags you with it for a while) and slow the planet down a tiny bit (you draw the planet to you, thus slowing it down). Similarly, if you pass a planet on its leading side, you slow yourself down and speed the planet up a bit.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-04T12:54:49Z","Content":"\n\u003Cp\u003ESo: sling around a moon (if present), aerobrake (if atmosphere is present) and only burn if needed to get captured - cannot establish an orbit cheaper (before circulization) then?\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-04T13:36:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003ESo: sling around a moon (if present), aerobrake (if atmosphere is present) and only burn if needed to get captured - cannot establish an orbit cheaper (before circulization) then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can combine the slingshot and capture burn - due to the oberth effect, you get more \u0027bang per buck\u0027 (dV per unit of fuel expended) the faster you move and the closer you are to a gravity well. So, generally, IF you have to burn to get captured, the most efficient time to burn would be at or near your periapsis.\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-09-04T13:36:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003ESo: sling around a moon (if present), aerobrake (if atmosphere is present) and only burn if needed to get captured - cannot establish an orbit cheaper (before circulization) then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can get captured without burning - by a moon slingshot or aerobraking. You can also almost completely circularize your orbit by aerobraking - that\u0027s what the Mars orbiters did. \u003C/p\u003E\u003Cp\u003EYou can always use lithobraking, although it\u0027s hard to circularize ...\u003C/p\u003E\u003Cp\u003EEDIT: Oh, I think I understood what you were asking. To answer: it\u0027s impossible to establish an orbit around a body with no atmosphere and no moon without burning. However if you use a standard Hohmann transfer the burns to get captured are usually very small. More info here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/41515-Is-it-possible-to-have-Mun-capture-you-in-orbit-around-it\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/41515-Is-it-possible-to-have-Mun-capture-you-in-orbit-around-it\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-04T13:42:38Z\u0022 title=\u002209/04/2013 01:42  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 4, 2013\u003C/time\u003E by Jackissimus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-04T14:03:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jackissimus\u0022 data-cite=\u0022Jackissimus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: Oh, I think I understood what you were asking. To answer: it\u0027s impossible to establish an orbit around a body with no atmosphere and no moon without burning.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHence the brackets ... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was simply listing the options to slow down (in an ideal situation).\u003C/p\u003E\u003Cp\u003EBut on another matter - from the thread you linked:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frederf\u0022 data-cite=\u0022Frederf\u0022\u003E\u003Cdiv\u003EYou never leave the SOI with a greater/less speed than you entered it when the speed is measured relative to the body of interest which is the measurement that matters when considering capture.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo the moon used to sling shot around adds to a vessels velocity during approach an equivalent dV (it has to, because it gets faster until it reaches the Pe of the encounter) as he takes away again when departing - only that the vessel adds the vector of the moon to its own and thereby gains speed relative to any other body in the system?\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-09-08T14:54:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo the moon used to sling shot around adds to a vessels velocity during approach an equivalent dV (it has to, because it gets faster until it reaches the Pe of the encounter) as he takes away again when departing - only that the vessel adds the vector of the moon to its own and thereby gains speed relative to any other body in the system?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, basically yeah. Although I am not sure about the exact speed you gain, you certainly gain some speed in the direction of the vector.\u003C/p\u003E\u003Cp\u003EOT: I really wish there was a better way to monitor replies to your posts on this forum. I only found out you replied to me now.\u003C/p\u003E\n"}]}