{"TopicId":44633,"ForumId":29,"TopicTitle":"Drawing \u0026quot;Ghosted\u0026quot; parts - Cloning Part Mesh Only (No Physics/Logic)","CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2013-09-01T20:40:45Z","PageNum":1,"Articles":[{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2013-09-01T20:40:45Z","Content":"\n\u003Cp\u003EI\u0027m trying to draw a \u0027ghosted\u0027 part in-flight - I don\u0027t want the drawn part to interact with physics in any way, nor be selectable etc as a normal part would be.\u003C/p\u003E\u003Cp\u003EMy first attempt was to simply clone the desired part\u0027s GameObject, and disable physics on it as seen below:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E            clone = (GameObject)GameObject.Instantiate(highlightedPart.gameObject);\u003Cbr\u003E            clone.rigidbody.isKinematic = false;\u003Cbr\u003E            clone.rigidbody.detectCollisions = false;\u003Cbr\u003E            clone.GetComponent\u0026lt;Part\u0026gt;().physicalSignificance = Part.PhysicalSignificance.NONE;\u003Cbr\u003E            clone.GetComponent\u0026lt;Part\u0026gt;().PhysicsSignificance = 0\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe part draws correctly (I\u0027m rescaling it and translating it slightly in a later chunk of code), but unfortunately it still interacts with physics. On top of that, you can select it, right-click it, etc. \u003C/p\u003E\u003Cp\u003ESo, what I really want to do is to just grab the Mesh component of the part and work with that, throwing out all the logic and physical simulation. But I can\u0027t seem to find it! GameObject isn\u0027t listing MeshRenderer as one of its components. If anyone has experience with this situation or more familiarity with Unity, I\u0027d greatly appreciate any help.\u003C/p\u003E\u003Cp\u003E-NavyFish\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2013-09-03T04:20:00Z","Content":"\n\u003Cp\u003EYou can get the MeshFilter thusly:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMeshFilter meshFilter = (MeshFilter)clone.GetComponent\u0026lt;MeshFilter\u0026gt;();\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAFAIK that is only the mesh, you may also need the MeshRenderer (accessible through gameobject.renderer I think).\u003C/p\u003E\u003Cp\u003EAlso note that there are typically many transforms with MeshFilters contained within the part hierarchy. You\u0027ll probably have to do a bit of iteration.\u003C/p\u003E\u003Cp\u003EOf course you could just destroy all the unwanted components from your instance (e.g.: GameObject.Destroy(clone.rigidbody)\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E it\u0027s a bit of a workaround. but at least you wont be keeping unneeded instances around.\u003C/p\u003E\n"}]}