{"TopicId":44677,"ForumId":51,"TopicTitle":"Why I love Kerbal Space Program.","CreatedByName":"ChrisWill","CreatedById":77045,"CreatedDateTime":"2013-09-02T05:37:55Z","PageNum":1,"Articles":[{"CreatedByName":"ChrisWill","CreatedById":77045,"CreatedDateTime":"2013-09-02T05:37:55Z","Content":"\n\u003Cp\u003ESomething that just happened that made me realize why I love this game. So I usually use mechjeb for rendezvous and usually docking sometimes when it gets in close I\u0027ll finish it up. However recently I started doing things manually just acsents and landings stuff like that but mechjeb was there when I needed to rendezvous and dock. But tonight that all changed... I\u0027ve been testing a new lifter to do crew transfers in LKO one with a much smaller profile than before. So I\u0027ve launched some into orbit and landed them to come up with the safest and most efficient thing I could come up with. So tonight I redesigned the first stage engines and sent her on her way I get into an orbit and called it pretty good about to time warp to the other side so I could come down over KSC I look over and see a marker 100Km out so I go into the map view and realize I launched for a perfect rendezvous with my station. So now I decide I\u0027m going to dock but not my normal docking, no I\u0027m going manual I start my attempt (I did an almost ChickenKeeper24 rendezvous) Closest approach 2.5km, alright that\u0027s great I think as I hit the timewarp. As I came to that 2.5Km mark I did what I had seen mechjeb do so many times before started burning towards it. 2Km I rotate my ship around and prepare to match velocities, at 1.8Km I realize inclination is off by 0.5 so I match velocities pitch up and burn to match inclination and perfect I start my approach again. 1km at this point it\u0027s setting in I\u0027m 1Km out and dropping my arm muscles start to tense up almost to the point where I thought I might need to abort but realizing I had come this close I wasn\u0027t willing to give up. 500 meters it\u0027s then that I think that I have made an error as this ship is not technically ready for services which meant no RCS except what was on the ship (Dragon Rider) so it wasn\u0027t well balanced at all but I wasn\u0027t about to quit. 250 meters I start a small burn to match velocities it starts to get hard to control the ship as I\u0027m nearly shaking with anticipation and fear. 50 meters I stop my burn and turn on the RCS pick a target and start heading towards it and to no surprise my first attempt fails but I slow down and come back in from the other side. 10 meters the light RCS taps are getting harder to control they aren\u0027t balanced and I can\u0027t feel my hand at this point I\u0027m not thinking I\u0027m just doing. As I come in I avoid a near collision with a solar panel 5 meters or less the ports are right there I\u0027m now effortlessly gliding at the port despite my hand cramping and then... The magnet takes over however I don\u0027t think the dragon rider has a strong magnet so it starts swaying around and I try to control with RCS burst in opposite directions it continues so I decide to let it run its course. The game freezes just for a second, just enough time for me to realize before seeing that I had docked and for the first time since deciding to do this a total of 20 minutes I felt my heart beat and my lungs filled with air, I felt like the guys at NASA when curiosity landed except I just sat there motionless at what I had just accomplished when it was all over I was almost in tears it felt like. Never before has a video game made me feel this when I succeed and I doubt any game will again. Perhaps a boring and mundane thing for others but a first and very exciting thing for me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-02T05:50:00Z\u0022 title=\u002209/02/2013 05:50  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 2, 2013\u003C/time\u003E by ChrisWill\u003C/strong\u003E\n\u003C/span\u003E\n"}]}