{"TopicId":44850,"ForumId":55,"TopicTitle":"A difficult translation of all my ideas until now","CreatedByName":"Raptus86","CreatedById":81284,"CreatedDateTime":"2013-09-03T19:08:40Z","PageNum":1,"Articles":[{"CreatedByName":"Raptus86","CreatedById":81284,"CreatedDateTime":"2013-09-03T19:08:40Z","Content":"\n\u003Cp\u003ESo hello everyone.. I wanted to post some ideas from me.. because I translate the text first into English I hope you will excuse some typing errors and hopefully understand what I write her.\u003C/p\u003E\u003Cp\u003ESo.. I have ideas for a lot of things... for example ideas for the tech tree or mining and resources which fit the Kerbal style I think... so I try to arrange them in categories.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EThe Kerbals and Aliens\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- the more your Kerbal come near the sun the more the helmet disc will get darker...\u003C/p\u003E\u003Cp\u003E =\u0026gt;for example... one the nearest planet to the sun in the system which is the hottest and ____brightes for the Kerbals, the disc will be black and so on.\u003C/p\u003E\u003Cp\u003E- when the Kerbals are alone for a while they will go to another Kerbal and start to talk or play football one mun, or jump around as they want. Or they lay down an look to the stars or the sun. O r they shoot at each other with the wapons I discribe below. Or he use a rover and explore environment. or.. or.. or..\u003C/p\u003E\u003Cp\u003E- I think it is a good idea to control the kerbals from above with the mouse and a point and click system addition to the usual EVE control system. So you can do more things with more Kerbals and you had a better overview... its well suited for planets I think.\u003C/p\u003E\u003Cp\u003E- The Kerbals can freeze or sweat... or even burn after a while on the hottest planet in the system.. or freeze to death on the coldest\u003C/p\u003E\u003Cp\u003E- individual design for the space suites\u003C/p\u003E\u003Cp\u003E- as more Kerbals you send in the space or let them work for you as more families went near the KSP base and build a little village.\u003C/p\u003E\u003Cp\u003E- we can listen to some small talk sometime from our Kerbals in space... something stupid I think. Only with several Kerbs in the near.\u003C/p\u003E\u003Cp\u003E- Kerbals need food... so that they can not stay as long as the player wants in space without some precautions. For example:\u003C/p\u003E\u003Cp\u003E__=\u0026gt; without food they will work a few days. after this they will not die but ignore your ____commands or sabotage your ship until thy get food ( Why they will sabotage your ship in ____the middle of the universe? because they are stupid... some more some less^^)\u003C/p\u003E\u003Cp\u003E____so can the stupidity gain in importance in the selection\u003C/p\u003E\u003Cp\u003E__=\u0026gt; with rations they can stay calm in the space for one year (storage module)\u003C/p\u003E\u003Cp\u003E__=\u0026gt; and all your expeditions over a year in space and on planets needs an food module or something like that\u003C/p\u003E\u003Cp\u003E- I would like some extraterrestrial life like flying space sheeps or space whales or a mun mole...\u003C/p\u003E\u003Cp\u003E- when kerbals feel sick they become brownish in their faces.. for example in the centrifuges training or rapidly rotate rockets... and they throw themselves up^^ after a short visit in an module the disc is clean again.\u003C/p\u003E\u003Cp\u003E- physical stress for Kerbals in space at a start or landing and some other things. And they will become unconscious. While this you can not turn to a Kerbal control mode like IVA.\u003C/p\u003E\u003Cp\u003E- psychological stress if they are alone in space... because stupidity is more fun with a gathering of some silly one\u003C/p\u003E\u003Cp\u003E__=\u0026gt; one Kerbal alone canÃ‚Â´t stay in space for long as suggestion a few days or weeks\u003C/p\u003E\u003Cp\u003E__=\u0026gt; for longer journey you have to take more Kerbals with you as example four for a year up ____to eight for 5 years somehow something like that.\u003C/p\u003E\u003Cp\u003E-As more Kerbals die in your expeditions the less Kerbals want to fly whit you or to join your team of idiots^^\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EKerbal system\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- solar storms.. you have to protect your ships, bases and Kerbals against the storms in the inner Kerbal system (Tech tree required) So that storms and the heat could make it difficult to get the rare resources on the inner planets.\u003C/p\u003E\u003Cp\u003E- planet-specific difficulties like the solar storms or magnetic storm or the cold or the heat... so you have to prepare your mission, your ships and your Kerbals ( better spacesuits) for the planets... here it could be useful to have a research lab and improved technologies.\u003C/p\u003E\u003Cp\u003E-micro asteroids that are dangerous for your spaceship they will damage the hull and you need a repair drone or something like that to fix this (Tech Tree) if not... BAM!! (perhaps)\u003C/p\u003E\u003Cp\u003E- a gas cloud on the edge of this system with a planet inside... the most difficult planet of Kerbal system because you can not see the planet until you reach him... so you have to search... some really rare materials on its surface, perhaps THE rarest recourse in Kerbal system(excluding other star system)\u003C/p\u003E\u003Cp\u003E- a planet where on side of this planet is every time night ( the planet rotate only one time on his way around the sun)\u003C/p\u003E\u003Cp\u003E- some Planets far far away with extraterrestrial life...(the aliens from above) Trading with them perhaps fighting with them but not to death... something like a mud battle in space.\u003C/p\u003E\u003Cp\u003E- You need an satellite system for a greater reach in in which you can control you remote guided spaceships. Planets and Moon will slow down your actions so you need a complex system of satellites to send your signal around the planet or moon. behind the moon without deflection satellites your remote guided spaceship is useless for a short time. Really long journeys need Kerbals or perhaps the highest upgrade for your communication center. (and deflector satellites^^) So the satellite could have a sense. They could also scan the planet and its temperature for future missions so you can plan how to make this work...\u003C/p\u003E\u003Cp\u003E- you only will know the properties of an planet or moon if you reach them with Kerbals or satellites ( so would have all the science devices an interesting meaning)\u003C/p\u003E\u003Cp\u003E- and a resource system with 2 or 3 standard raw materials and some more rare you need for tech research and build better spaceships and so on. So this needs also some mining devices like.....\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EMining technologies\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EFirst:\u003C/span\u003E\u003C/span\u003E The rare raw materials are distributed throughout the Kerbal system in random principle... so you never know where the Materials are they you need, if you start a new game. The different materials sometimes need different mining opportunities and advanced technologies... here some of my ideas.\u003C/p\u003E\u003Cp\u003E=\u0026gt; \u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003EBlasting...\u003C/strong\u003E\u003C/span\u003E with plasma bombs, TnT or something other\u003C/p\u003E\u003Cp\u003E(The different disintegrant will affect the proceeds of your mining. Some have a greater yield whit one blow but a greater percentage destroyed purely material and the other are slower at the end but have more pure materials in the yield)\u003C/p\u003E\u003Cp\u003E-- I thought here of an blast and gather in system with Kerbals or rover drones...after the blast the Kerbals drive around an pick up the materials... something like this.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ethe advantageous:\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Estart technologie; mobile than the others; you only set an area and the Kerbals start to work, easy execution of such a mission; landing, mining, change the place and so on...;\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Edisadvantages:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eneed fuel or a solar energy systems; a percentage of the material will be ruined; complicated collecting of the material; and it is a lot slower than drilling or the other stuff. needs drones or Kerbals,\u003C/p\u003E\u003Cp\u003E=\u0026gt; \u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Espace drilling system...\u003C/span\u003E\u003C/strong\u003E drill the Materials out of the crust from the planet or moon. The non standart rescources needs some alloys on the drill to get through the stuff. Some different alloys for different rescources... You need to think about what you want.\u003C/p\u003E\u003Cp\u003Elifetime: 1-2 years\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Ethe advantageous:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eno destruction of materials, greater delivery rate as blasting tech; self constructible\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Edisadvantages:\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eresearch needed; non mobile or difficult to set to an other point on the surface; needs fuel constantly but do not consume much of it; the drill can broke and you need an kerbal technician to repair it; and it needs the most time of all mining types. weak against cold, because... ... ... for the balance -.-\u003C/p\u003E\u003Cp\u003E=\u0026gt; \u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003Elaser mining system...\u003C/strong\u003E\u003C/span\u003E you put your laser on the surface and melt the stone below your device. With an second device you suck the material from the earth and separate the raw material from the dirt, stone and so on.\u003C/p\u003E\u003Cp\u003Elifetime: as long the sun shines and the crystal will not be broken from a hungry kerbal.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Ethe advantageous:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ethis method is a lot faster than the other two, did no support with fuel because the sun exist. self constructible; can mining all materials\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Edisadvantages:\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eyou need a lot of energy and quite a lot solar panels for run it; some percentage of material will be destroyed ( more than with blasting) so it could be possible that you look for other resource fields one the planet or moon; it doesn\u0027t work without sunlight; some materials need a greater energy support mining them; weak against heat, because the cooling system had enough to do with the laser heat.\u003C/p\u003E\u003Cp\u003E=\u0026gt; \u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003Eexperimental mining device...\u003C/strong\u003E\u003C/span\u003E with this device you can melt the material you want with some complex waves after a short adjustment on the device and let it flow out of the ground without destroy the surface. This technology is so scientifically formulated that a normal Kerbal will never understand it... for them are only to buttons on this device... ON and OFF^^\u003C/p\u003E\u003Cp\u003ELifetime: ... O.O no clue. How long will the universe exist. 1 day or 1 billion years? Who knows.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003Ethe advantageous:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ebiggest mining income a kerbal had ever seen; you will get 100% of the resources in this area and it the fastest method ever. can be run whit fuel an sunlight mixed together; can mining all materials\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Edisadvantages:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ebiggest energy sucker a Kerbal had ever seen; The most expensive device a Kerbal had ever seen; need a lot rare materials and you can it only use on one planet... after activating it can not back in the space, because god decided it; weak against Kerbals; random lifetime(could also be positive)\u003C/p\u003E\u003Cp\u003Esome materials can you only get with the right device... just try (I think this should be different after every new game start)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ETechnology for research\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- teleporter to connect some bases on the same planet ( only on one planet ) so that the kerbal visit each other or to support the mining system with kerbal. Requires a social life for Kerbals...\u003C/p\u003E\u003Cp\u003E- possibility to put the weapons on a turret ... bigger ones of course.\u003C/p\u003E\u003Cp\u003E- more variation how the Kerbals can life in the space.... some cool Station parts I think. Of course some for bases.\u003C/p\u003E\u003Cp\u003E- advanced Satellite connecting system... to connect your satellites and get a bigger area you can control remote guided spaceships and so on\u003C/p\u003E\u003Cp\u003E- the advanced technology to paint some stuff on the surface of your rocket... Because Kerbals need to discover creativity\u003C/p\u003E\u003Cp\u003E- a football with it can the Kerbals play football on the mun.\u003C/p\u003E\u003Cp\u003E- the mining technologies (except this blasting thing)\u003C/p\u003E\u003Cp\u003E- special space suits \u003C/p\u003E\u003Cp\u003E- cooling system for the ships and bases or other sort protection against heat, cold and deep space radiation (not in the near of an planet but between them)\u003C/p\u003E\u003Cp\u003E- ground investigation device to find some resources\u003C/p\u003E\u003Cp\u003E- satellite scanning systems for planets, moons and the properties of the universe\u003C/p\u003E\u003Cp\u003E- stronger and bigger ion drive (5Kn perhaps) ... this thing that runs with Xenon gas\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EGame technically\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- damage indicator for ships and so on\u003C/p\u003E\u003Cp\u003E- weight display throughout the creating of ship. If you know how heavy your ship is you can better \u003C/p\u003E\u003Cp\u003Eadjust your fuel tanks and engines\u003C/p\u003E\u003Cp\u003E- smoke during the launch process from Kerbal if the rocket start the engines I miss the smoke down on the sides from launch pad\u003C/p\u003E\u003Cp\u003E- The possibility to form a circuit during the construction process.. If I want to build a circle with beams, struts and girder stuff that the last part connect the first and the last. perhaps in a different color so we can see where the end is\u003C/p\u003E\u003Cp\u003E- the possibility to create a bigger surface with the structural panel only with a mouse click and a pull of the mouse. like the mouse in \u0022windows\u0022 if you want to connect several things together\u003C/p\u003E\u003Cp\u003E- an easier way to change the high of fuel-tanks on a radial decoupler ( perhaps mouse-click... the mouse is fixed and now you can change the high of the tanks with move the mouse up and down) sorry I can not explain right in your language (Google translator is my best friend today^^)\u003C/p\u003E\u003Cp\u003E- a 90Ã‚Â° beam, strut and girder connection piece would be helpful sometimes( or a cross with four and six connection surfaces) (hmm I know what I mean and I hope you to)\u003C/p\u003E\u003Cp\u003E- I would really like a little tiny Kerbal statue for putting it on the top of my rocket^^ with his one hand pointing to the stars\u003C/p\u003E\u003Cp\u003E- pieces of metal from a broken rocket should not swim on the surface of water, but its Kerbal world... all is possible^^\u003C/p\u003E\u003Cp\u003E- some of the exploding things in the game should not explode in a later version so that you can collect them and get the recourses back and for an realistic debris-system\u003C/p\u003E\u003Cp\u003E- I do not like the possibility of the destruction button in the communication center to let you ship destroy even if the Remote guiding system is down because of low energy. So I thougt create a self destruction mode for the control unit of the ships with an 10 second countdown.\u003C/p\u003E\u003Cp\u003E- the maneuver point should stop counting forward after you miss him and start to count again after a short time.\u003C/p\u003E\u003Cp\u003E- possibility to connect moon base pieces easier.. ( I only play vanilla)\u003C/p\u003E\u003Cp\u003E- some coloring possibility in the construction menu\u003C/p\u003E\u003Cp\u003E- some buffer that protect your fuel tanks from getting damage and explode\u003C/p\u003E\u003Cp\u003E- a file system in which you have a better overview over your created spaceships. like create folder under the standard stock folder and then save your ship in them\u003C/p\u003E\u003Cp\u003E- and bigger and smaller wings, also more variation of peaks but I will thrust you with the variety of parts in future version of this great game... a whole solar-system to explore and play in it. \u0022Great idea\u0022\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThank you so much for creating this game\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESo I hope I could translate all my idea correct and have not written something really stupid and you could understand all what I mean. Thanks for reading.\u003C/p\u003E\u003Cp\u003ETranslation time: 5 hours 46 minutes and 12 seconds^^\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T15:06:31Z\u0022 title=\u002209/16/2013 03:06  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by Raptus86\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"42undead2","CreatedById":47664,"CreatedDateTime":"2013-09-06T14:46:55Z","Content":"\n\u003Cp\u003EOne thing I can say: Enemies, aliens and weapons will never be in KSP. Ever.\u003C/p\u003E\n"},{"CreatedByName":"Nachtwind","CreatedById":41015,"CreatedDateTime":"2013-09-06T16:30:25Z","Content":"\n\u003Cp\u003EThe Kerbals and Aliens\u003C/p\u003E\u003Cp\u003E- the more your Kerbal come near the sun the more the helmet disc will get darker...\u003C/p\u003E\u003Cp\u003EThat is some polish.. good idea but more for version 0.9x\u003C/p\u003E\u003Cp\u003E- when the Kerbals are alone for a while they will go to another Kerbal and start to talk or play football one mun, or jump around as they want. Or they lay down an look to the stars or the sun. O r they shoot at each other with the wapons I discribe below. Or he use a rover and explore environment. or.. or.. or..\u003C/p\u003E\u003Cp\u003EAlso a good idea.. yet again: polish.\u003C/p\u003E\u003Cp\u003E- I think it is a good idea to control the kerbals from above with the mouse and a point and click system addition to the usual EVE control system. So you can do more things with more Kerbals and you had a better overview... its well suited for planets I think.\u003C/p\u003E\u003Cp\u003ESounds pretty good to me.\u003C/p\u003E\u003Cp\u003E- The Kerbals can freeze or sweat... or even burn after a while on the hottest planet in the system.. or freeze to death on the coldest\u003C/p\u003E\u003Cp\u003EThat doesnt sound like a good idea to me... space suits have climate automatic in them. \u003C/p\u003E\u003Cp\u003E- individual design for the space suites\u003C/p\u003E\u003Cp\u003EPolish.\u003C/p\u003E\u003Cp\u003E- as more Kerbals you send in the space or let them work for you as more families went near the KSP base and build a little village.\u003C/p\u003E\u003Cp\u003EIf at all: Polish. Furthermore its again a \u0022Sims meets KSP\u0022-Suggestion.. \u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E- the Kerbals can fall ill with the intelligence disease... so they need help in a certain time. 15 minutes perhaps. Otherwise they will turn in to an alien. (alien ar immune) They will get help in a living part or a hospital part of the base where ever it is. The same for the aliens.\u003C/p\u003E\u003Cp\u003E-the other way around the Aliens can fell sick with the stupidity decease and will turn into a Kerbal with a other color than green. (Kerbals are immune)\u003C/p\u003E\u003Cp\u003E- The aliens are the totally contrary to the Kerbals they are intellectually\u003C/p\u003E\u003Cp\u003E- I would like some extraterrestrial life like flying space sheeps or space whales or a mun mole...\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003ETotally against it. Furthermore i am pretty sure aliens and such is on the \u0022do not suggest list\u0022\u003C/p\u003E\u003Cp\u003E- we can listen to some small talk sometime from our Kerbals in space... something stupid I think. Only with several Kerbs in the near.\u003C/p\u003E\u003Cp\u003EPolish\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E- Kerbals need food... so that they can not stay as long as the player wants in space without some precautions. For example:\u003C/p\u003E\u003Cp\u003E__=\u0026gt; without food they will work a few days. after this they will not die but ignore your ____commands or sabotage your ship until thy get food ( Why they will sabotage your ship in ____the middle of the universe? because they are stupid... some more some less^^)\u003C/p\u003E\u003Cp\u003E____so can the stupidity gain in importance in the selection\u003C/p\u003E\u003Cp\u003E__=\u0026gt; with rations they can stay calm in the space for one year (storage module)\u003C/p\u003E\u003Cp\u003E__=\u0026gt; and all your expeditions over a year in space and on planets needs an food module or something like that\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EWell... Life support is a good thing.. but only to some extend: Life support? Yes: Ok, No: Kerbals Dead.\u003C/p\u003E\u003Cp\u003E- when kerbals feel sick they become brownish in their faces.. for example in the centrifuges training or rapidly rotate rockets... and they throw themselves up^^ after a short visit in an module the disc is clean again.\u003C/p\u003E\u003Cp\u003EPolish... if at all..\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E- physical stress for Kerbals in space at a start or landing and some other things. And they will become unconscious. While this you can not turn to a Kerbal control mode like IVA.\u003C/p\u003E\u003Cp\u003E- psychological stress if they are alone in space... because stupidity is more fun with a gathering of some silly one\u003C/p\u003E\u003Cp\u003E__=\u0026gt; one Kerbal alone canÃ‚Â´t stay in space for long as suggestion a few days or weeks\u003C/p\u003E\u003Cp\u003E__=\u0026gt; for longer journey you have to take more Kerbals with you as example four for a year up ____to eight for 5 years somehow something like that.\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EPolish... if at all.. Maybe Kerbals can easily sustain 30g? Life 100 years and so on and so on..\u003C/p\u003E\u003Cp\u003EKerbal system\u003C/p\u003E\u003Cp\u003E- solar storms.. you have to protect your ships, bases and Kerbals against the storms in the inner Kerbal system (Tech tree required) So that storms and the heat could make it difficult to get the rare resources on the inner planets.\u003C/p\u003E\u003Cp\u003EWell... interestering though.. but i dont think this is going to happen. I smell too much \u0022random\u0022 there.\u003C/p\u003E\u003Cp\u003E- planet-specific difficulties like the solar storms or magnetic storm or the cold or the heat... so you have to prepare your mission, your ships and your Kerbals ( better spacesuits) for the planets... here it could be useful to have a research lab and improved technologies.\u003C/p\u003E\u003Cp\u003EWell.. this is a nice idea actually.. better aircondition for eva on moho... and cold insulation for Eeloo... \u003C/p\u003E\u003Cp\u003E-micro asteroids that are dangerous for your spaceship they will damage the hull and you need a repair drone or something like that to fix this (Tech Tree) if not... BAM!! (perhaps)\u003C/p\u003E\u003Cp\u003EAgain: I smell too much random annoyance...\u003C/p\u003E\u003Cp\u003E- a gas cloud on the edge of this system with a planet inside... the most difficult planet of Kerbal system because you can not see the planet until you reach him... so you have to search... some really rare materials on its surface, perhaps THE rarest recourse in Kerbal system(excluding other star system) \u003C/p\u003E\u003Cp\u003EAfaik such a gas cloud would be impossible in real life as it had to be dense enough to form yet a planet by itself (take jupiter, saturn and uranus as example... do you \u0022see\u0022 them or just a cloud surrounding the core (if there is one))\u003C/p\u003E\u003Cp\u003E- a planet where on side of this planet is every time night ( the planet rotate only one time on his way around the sun)\u003C/p\u003E\u003Cp\u003EA tidally locked planet would be interestering.. at the most. You would have daylight all \u0022day\u0022 one side, night on the opposite.. If i remember correctly Mun was once tidally locked but is now rotating...\u003C/p\u003E\u003Cp\u003E- some Planets far far away with extraterrestrial life...(the aliens from above) Trading with them perhaps fighting with them but not to death... something like a mud battle in space.\u003C/p\u003E\u003Cp\u003ENope. There wont be any aliens ever.\u003C/p\u003E\u003Cp\u003E- You need an satellite system for a greater reach ....\u003C/p\u003E\u003Cp\u003ESounds interestering. Built in RemoteTech\u003C/p\u003E\u003Cp\u003E- you only will know the properties of an planet or moon if you reach them with Kerbals or satellites ( so would have all the science devices an interesting meaning)\u003C/p\u003E\u003Cp\u003EYes. I totally think this is a good idea. Just like BARIS worked (And therefore i would think this is going to happen). \u003C/p\u003E\u003Cp\u003E- and a resource system with 2 or 3 standard raw materials and some more rare you need for tech research and build better spaceships and so on. So this needs also some mining devices like.....\u003C/p\u003E\u003Cp\u003EThat is already planned.\u003C/p\u003E\u003Cp\u003EMining technologies\u003C/p\u003E\u003Cp\u003E... already planned ... But explosives wont happen.\u003C/p\u003E\u003Cp\u003EWeapons\u003C/p\u003E\u003Cp\u003EThis wont ever happen.\u003C/p\u003E\u003Cp\u003ETechnology for research\u003C/p\u003E\u003Cp\u003E- teleporter to connect some bases on the same planet ( only on one planet ) so that the kerbal visit each other or to support the mining system with kerbal. Requires a social life for Kerbals...\u003C/p\u003E\u003Cp\u003EI hope not.. that would totally be against the main idea of building rockets... also - if you want social life play sims or go out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- stronger and bigger ion drive (5Kn perhaps) ... this thing that runs with Xenon gas\u003C/p\u003E\u003Cp\u003EWell.. as the drives are modelled somewhat realistic i wouldnt expect this to ever come...\u003C/p\u003E\u003Cp\u003EGame technically\u003C/p\u003E\u003Cp\u003E- damage indicator for ships and so on\u003C/p\u003E\u003Cp\u003EYou already have a damage indicator: if its broken its gone.\u003C/p\u003E\u003Cp\u003E- weight display throughout the creating of ship. If you know how heavy your ship is you can better \u003C/p\u003E\u003Cp\u003Eadjust your fuel tanks and engines\u003C/p\u003E\u003Cp\u003EGood idea... and already planned afaik.\u003C/p\u003E\u003Cp\u003E- smoke during the launch process from Kerbal if the rocket start the engines I miss the smoke down on the sides from launch pad\u003C/p\u003E\u003Cp\u003EPolish\u003C/p\u003E\u003Cp\u003E- the possibility to create a bigger surface with the structural panel only with a mouse click and a pull of the mouse. like the mouse in \u0022windows\u0022 if you want to connect several things together\u003C/p\u003E\u003Cp\u003EProcedural surfaces would be good..\u003C/p\u003E\u003Cp\u003E- pieces of metal from a broken rocket should not swim on the surface of water, but its Kerbal world... all is possible^^\u003C/p\u003E\u003Cp\u003EWhy not? This is not exactly impossible...\u003C/p\u003E\u003Cp\u003E- the maneuver point should stop counting forward after you miss him and start to count again after a short time.\u003C/p\u003E\u003Cp\u003ENo... because maneuvers dont work like that. \u003C/p\u003E\u003Cp\u003E- a file system in which you have a better overview over your created spaceships. like create folder under the standard stock folder and then save your ship in them\u003C/p\u003E\u003Cp\u003EI think this will come with subassambles.. but not sure here...\u003C/p\u003E\u003Cp\u003E- and bigger and smaller wings, also more variation of peaks but I will thrust you with the variety of parts in future version of this great game... a whole solar-system to explore and play in it. \u0022Great idea\u0022\u003C/p\u003E\u003Cp\u003EMore parts is on the \u0022Do not suggest list\u0022\u003C/p\u003E\u003Cp\u003E\u0026amp;tl;dr\u003C/p\u003E\u003Cp\u003EI have removed some suggestiosn which are not really discussion worthy (sounds a bit rude, but it is as simple as that). \u003C/p\u003E\u003Cp\u003EPLease, i see that you have pretty much no idea of whats going on in KSP development or addon development, have a look at the mods and the discussions on further versions. The KSP Weeklies are a great source for that. Half of what you wrote is either been planned for or already being on a list of thigns that will never happen.\u003C/p\u003E\n"},{"CreatedByName":"Raptus86","CreatedById":81284,"CreatedDateTime":"2013-09-07T17:44:59Z","Content":"\n\u003Cp\u003EThank you for your statement... You are right, I had no idea^^ in the last days I discovered so many cool ideas and suggestions,so that I could save the half of my words here. Thanks again.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-09-07T19:57:28Z","Content":"\n\u003Cp\u003EEverything\u0027s good, but you might want to check the what not to suggest list. Weapons are never going to be in the game, and neither are non-Kerbal sentients, so it would be good if you removed them from the post. Excellent suggestions though!\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EI love your suggestion about needing multiple kerbals for long missions so they don\u0027t go insane from loneliness. I think it should be based on the square numbers, so a 1 month mission only needs one Kerbal, an four month mission needs two, a nine month mission needs three, and so on.\u003C/p\u003E\u003Cp\u003EEDIT2:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nachtwind\u0022 data-cite=\u0022Nachtwind\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E... already planned ... But explosives wont happen.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you even \u003Cem\u003Eplay\u003C/em\u003E Kerbal Space Program? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-07T20:08:36Z\u0022 title=\u002209/07/2013 08:08  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 7, 2013\u003C/time\u003E by Holo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-09-07T22:43:15Z","Content":"\n\u003Cp\u003ENo Alien, No weapons. Solar storms? No but Solar flares would be a better idea. I would hate to see aliens and weapons in this game.\u003C/p\u003E\n"}]}