{"TopicId":44941,"ForumId":55,"TopicTitle":"New Constuction mechanic","CreatedByName":"Ruinsage","CreatedById":81262,"CreatedDateTime":"2013-09-04T19:58:04Z","PageNum":1,"Articles":[{"CreatedByName":"Ruinsage","CreatedById":81262,"CreatedDateTime":"2013-09-04T19:58:04Z","Content":"\n\u003Cp\u003ESeeing as my thread was closed down because a mod/consultant misunderstood my suggestion (Let me clarify, I do not want parts combined, I want to change the mechanics behind construction / the part of the physics engine that causes wobble), and he didn\u0027t respond to my message, I\u0027m reposting my thread:\u003C/p\u003E\u003Cp\u003EI, as many others I assume, have had problems with wobbling rockets that should be more rigid. I usually fix this with struts, but those makes the parts count skyrocket, and isn\u0027t always efficient enough, which leads to a huge workload for the pc.\u003C/p\u003E\u003Cp\u003ESo what I suggest is this: Certain parts should fuse during construction, if they are put together the right way.\u003C/p\u003E\u003Cp\u003EFor example, if two fuel tanks are stacked on top of each other (not if the fuel tanks are attached to the sides, that should be an unstable build), they could fuse together into a single hexgrid, which would make standard rockets much more robust. If it is also made so that engines are fused with fuel tanks and stack separators, multistaged rockets would be much more stable (right now they are wobbly as all hell, and building them can make your rockets break very fast, unless you use struts).\u003C/p\u003E\u003Cp\u003EOnly parts that are the same diameter should be able to fuse to each other.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-09-04T22:45:17Z","Content":"\n\u003Cp\u003EFusing parts during construction to prevent wobble is on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863\u0022 rel=\u0022external nofollow\u0022\u003Ewhat not to suggest list\u003C/a\u003E, under \u0022Combining parts\u0022. If you want to do similar things, check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/34013\u0022 rel=\u0022external nofollow\u0022\u003Emodel nodes.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThread Locked. Have a nice day.\u003C/p\u003E\n"}]}