{"TopicId":44965,"ForumId":16,"TopicTitle":"How do I view the Weight during construction?","CreatedByName":"Apophis775","CreatedById":81516,"CreatedDateTime":"2013-09-04T22:36:22Z","PageNum":1,"Articles":[{"CreatedByName":"Apophis775","CreatedById":81516,"CreatedDateTime":"2013-09-04T22:36:22Z","Content":"\n\u003Cp\u003ESo far, I\u0027ve been using a calculator and dry-erase board to do my TWR, but I was wondering if it was possible to view the Weight while building, other than on the launch-pad. Even a mod would help.\u003C/p\u003E\u003Cp\u003EAlso, how the bloody hell do I setup a forum signature here? I\u0027ve gone through all the possible options I can find, and this forum definitely wins the \u0022Most difficult signature setup\u0022 award.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-04T22:57:58Z","Content":"\n\u003Cp\u003ESince you mentioned you\u0027re open to mods, I\u0027d highly recommend \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Engineer Redux\u003C/a\u003E, which is my personal choice. It shows TWR, delta-v, mass, and thrust by stage in the VAB / SPH, and it also has other data readouts for in-flight use. Others might also recommend MechJeb, which also comes with an autopilot during flight which you can use or not at your discretion.\u003C/p\u003E\u003Cp\u003EForum \u0022gingerbread\u0022 (signatures, avatars, etc.) is disabled for new members until they get at least five posts and have been vetted by a moderator. It\u0027s a security / anti-spammer measure, from what I remember.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-09-05T00:15:05Z","Content":"\n\u003Cp\u003EKER\u0027s one way, Mechjeb\u0027s another; those are the two big ones for non-launch pad weight measurement. I use KER myself. Couldn\u0027t say about Mechjeb but a lot of folks like it for its autopilots and such.\u003C/p\u003E\n"},{"CreatedByName":"Tw!sted","CreatedById":80602,"CreatedDateTime":"2013-09-05T13:21:18Z","Content":"\n\u003Cp\u003EYou could use Mechjeb and click \u0022Vessel Info\u0022 or it Might be \u0022Ship info\u0022 I don\u0027t know which one it is, but it shows all the weight, and stuff to do with thrust. Make sure you have Mechjeb on ur ship or it will not show you the Vessel Info.\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2013-09-05T17:52:31Z","Content":"\n\u003Cp\u003EKER has more detailed info, MechJeb shows just a few parameters. KER has much more functionality for figuring out required delta-v, and will even break it down stage by stage....If you\u0027re already using a white board and calculator, then I think you definately want KER... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"esinohio","CreatedById":57681,"CreatedDateTime":"2013-09-05T18:39:31Z","Content":"\n\u003Cp\u003EI think another bump for KER is that you can also view details of how your craft will behave on other celestial bodies. That becomes very handy when planning missions.\u003C/p\u003E\n"},{"CreatedByName":"Apophis775","CreatedById":81516,"CreatedDateTime":"2013-09-27T05:25:25Z","Content":"\n\u003Cp\u003EThanks, downlaoded KER and it\u0027s really helping.\u003C/p\u003E\u003Cp\u003EAlso, sorry to \u0022gravedig\u0022, but I wanted to thank you guys for your help, and I work in an Industry where I am sometimes so busy for a few weeks at a time I barely get sleep.\u003C/p\u003E\n"}]}