{"TopicId":44960,"ForumId":51,"TopicTitle":"My Almost-Failed Mission to Gilly... Success!","CreatedByName":"digitalsingularity","CreatedById":79683,"CreatedDateTime":"2013-09-04T22:13:52Z","PageNum":1,"Articles":[{"CreatedByName":"digitalsingularity","CreatedById":79683,"CreatedDateTime":"2013-09-04T22:13:52Z","Content":"\n\u003Cp\u003EI thought I\u0027d share a harrowing journey with you guys. I recently attempted my first mission to Gilly. Up until this point, I had only launched a small probe to the system. The new mission, mine Gilly for Kethane so other brave Kerbals could refill their ships, then attempt some missions on Eve. Well, I got my Kethane-Converting space station up in orbit around Gilly with only a few seconds of burn to spare. Yup, I should have packed more fuel to lug that giant station to this moon. \u003C/p\u003E\u003Cp\u003ENext, I sent a Kethane Miner from Kerbal to Eve. I didn\u0027t learn from the first trip about the whole having enough fuel thing. My miner / tug ship arrived in Eve orbit with almost no fuel to spare... certainly not enough to get to Gilly from there. I was about to launch a rescue fuel ship from Kerbal until I remembered that I left my original probe launcher in orbit! This ship had a decent amount of fuel remaining. Thankfully, most of my ships have some sort of docking port on them. Here\u0027s a shot of my two ships about to dock: This was especially delicate because of how I place the nuclear engines:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t5CxWI6h.jpg\u0022 alt=\u0022t5CxWI6h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s a shot of the ships actually docked and transferring fuel. I call this the \u0022Requiem For A Dream\u0022 maneuver: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0BcwIQKh.jpg\u0022 alt=\u00220BcwIQKh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter the fuel transfer is completed, my Kerbal crew is off to rendezvous with Gilly. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t5CxWI6h.jpg\u0022 alt=\u0022t5CxWI6h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELeaving Eve orbit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jmh7kAWh.jpg\u0022 alt=\u0022jmh7kAWh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn orbit around Gilly: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sdOLdl7h.jpg\u0022 alt=\u0022sdOLdl7h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting rid of the tug before landing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ri62aTch.jpg\u0022 alt=\u0022Ri62aTch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDescending:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dDtNtoKh.jpg\u0022 alt=\u0022dDtNtoKh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAbout to land:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9S5PhX6h.jpg\u0022 alt=\u00229S5PhX6h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Kethane mining has begun! Planting a flag for all Kerbals:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gvb3OhFh.jpg\u0022 alt=\u0022Gvb3OhFh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAh... back up to Gilly station for some Kethane refueling / conversion:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rBruBFyh.jpg\u0022 alt=\u0022rBruBFyh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYeah, I probably went a little overboard with the pictures, but this was certainly a fun ride. I salvaged some fuel from a ship I thought I\u0027d never use again, but didn\u0027t have the heart to de-orbit. I had to learn how to land on Gilly. The first attempt was difficult. Why? Well, apparently those aerospikes are overkill for the low-gravity environment on Gilly. Yeah, I\u0027m lazy and use Mechjeb... and honestly, Mechjeb couldn\u0027t figure out how to land. During the descent, it\u0027d just burn up fuel and hover (the engines were at the lowest thrust and they were still too powerful). Landing on Gilly is fun since you have to learn how to kill your lateral velocity too. I hope some of you found this post acceptable / somewhat entertaining.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-09-04T22:20:09Z","Content":"\n\u003Cp\u003EThis will probably sound absurd, but the best way to land on Gilly... is with RCS. I\u0027m serious! You don\u0027t even need to kill 50m/s to land most of the time, and RCS is just weak enough to be able to land you gently. Heck, you might even need to turn on fine controls. Gilly\u0027s gravity is \u003Cem\u003Ethat light!\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"digitalsingularity","CreatedById":79683,"CreatedDateTime":"2013-09-04T22:21:59Z","Content":"\n\u003Cp\u003EIt doesn\u0027t sound absurd at all. I didn\u0027t try just RCS, but I learned to pulse the engines, which is not difficult to do either. It\u0027s a fun landing, and hey, I hardly burn up any fuel landing / returning to the station. More Kethane for all, right?\u003C/p\u003E\n"},{"CreatedByName":"fascka","CreatedById":61972,"CreatedDateTime":"2013-09-04T22:29:18Z","Content":"\n\u003Cp\u003EI putted thrusters that would push my ship into the ground beacause I always overshoted\u003C/p\u003E\n"},{"CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2013-09-04T22:46:05Z","Content":"\n\u003Cp\u003EVery nice mission recovery!\u003C/p\u003E\n"},{"CreatedByName":"greg12","CreatedById":56261,"CreatedDateTime":"2013-09-04T23:01:49Z","Content":"\n\u003Cp\u003ENext mission: land with main sale engine (the big one). Hyper jump system in stock KSP. But use only near Gilly. XD\u003C/p\u003E\u003Cp\u003Eone of the impossible challenges. Of course put a lot reaction wheels on it. It will help. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYeh Gilly is a great moon in the Kerbol System. you can leave its orbital influence with just jumping. (maybe some little amount RCS).\u003C/p\u003E\n"}]}