{"TopicId":45158,"ForumId":16,"TopicTitle":"A problem with multiple Atomic Boosters","CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-09-06T23:49:20Z","PageNum":1,"Articles":[{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-09-06T23:49:20Z","Content":"\n\u003Cp\u003EOk, I have a problem. I have 5 Atomic Engines. One has a decoupler in this middle. Whenver I decouple this, the fairings on the atomic motor eject and blow up the rocket engines. Its most annoying. I even put the \u0027Even Heavier\u0027 Novapunch struts on the engines and it didn\u0027t work. I am unable to post a picture.\u003C/p\u003E\u003Cp\u003EAny help on this would be great.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-09-07T00:01:00Z","Content":"\n\u003Cp\u003EThere isn\u0027t really a solution other than to design your rocket differently to stop it happening. Either mount them radially so they don\u0027t even start with fairings, or put them all in a row so the fairings don\u0027t hit stuff when they\u0027re ejected.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-09-07T03:15:30Z","Content":"\n\u003Cp\u003EYou cam try putting pairs of docking ports instead of decouplers, since they do not create fairings. Another things that might help is to change the rocket so nothing else is attached under the LV-Ns.\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2013-09-07T07:23:01Z","Content":"\n\u003Cp\u003EAnother option is to have the staging for that stage set to action groups, and set them so that the fairings (which don\u0027t way much of anything) do not come off. I had this problem on a spaceplane of mine, and that was the only solution I found without redesigning the whole thing.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-09-07T12:20:44Z","Content":"\n\u003Cp\u003EThe only solution is to mount the 4 outboard engines higher then the one with the decoupler so that it doesn\u0027t hit anything. You can also try to rotate the LV-N decoupler 45* so that it will clear the other four when it fires.\u003C/p\u003E\n"},{"CreatedByName":"Evrion","CreatedById":70825,"CreatedDateTime":"2013-09-07T13:35:30Z","Content":"\n\u003Cp\u003EThe atomic motor fairings are rather odd in how they work and that must be taken into account when designing rockets.\u003C/p\u003E\u003Cp\u003EI usually use what I call interplanetary tugs. My design for those is to have one central orange tank with the atomic motors mounted radially around it. Then the lifting rocket is mounted under the orange tank so that no fairings are needed at all as nothing is placed directly underneath the atomic rockets.\u003C/p\u003E\u003Cp\u003ERotating the atomic motors is also an option. The Orange \u0022tab?\u0022 in the motor gives an indication of which direction the fairings will fire. Use \u0022Q\u0022 and \u0022E\u0022 to rotate the motor while you have it selected with your mouse.\u003C/p\u003E\u003Cp\u003Enote: I think explosions are impact dependent, not structure dependent, so strutting won\u0027t actually help.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-09-07T14:59:16Z","Content":"\n\u003Cp\u003EThe farings eject with a decent amount of force and the impact is what causes them to damage other engines. If farings are mounted, be aware that another engine must be at least 1.5m away (a little more than the width of a \u0027regular\u0027 diameter-sized part in order to not be destroyed by the ejection force of the farings. That said, the impact may still cause damage. Although damage does not decrease the performance of the engine, it will lower the tolerance the engine has for future incidences before it fails or breaks off.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2013-09-08T03:16:36Z","Content":"\n\u003Cp\u003ERotate the central engine by 45 degrees.\u003C/p\u003E\n"}]}