{"TopicId":45334,"ForumId":44,"TopicTitle":"space travel in your lifetime?","CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-09-08T18:09:47Z","PageNum":1,"Articles":[{"CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-09-08T18:09:47Z","Content":"\n\u003Cp\u003Eokay do you believe in your lifetime you will be able to buy a reasonably priced ticket into space. meaning not one you have to save up years for but one thats basically the price of an airline ticket? i think in my life time i will be able to buy a ticket to either the ISS or possibly the moon:) if neither then just a ticket into space for maybe an orbit or two of the earth. im planning on it maybe in 30 or 40 years. would love to go sooner but i dont think id have the money to afford a ticket before then.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-09-08T18:21:03Z","Content":"\n\u003Cp\u003ENot unless there\u0027s a major breakthrough in propulsion technology, no. Chemical rockets don\u0027t seem likely to ever bring cost reductions of that magnitude.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-09-08T19:04:56Z","Content":"\n\u003Cp\u003EWho knows, maybe spaceplanes will be the main intercontinental travel method.\u003C/p\u003E\u003Cp\u003ESSTO planes or a space elevator would of course bring the costs down, but I\u0027m not sure if we\u0027ll be getting that far before 2100.\u003C/p\u003E\u003Cp\u003EI\u0027m fairly sure I\u0027ll be able to get to a suborbital flight in my lifetime. Virgin Galactic starts next year, and although the tickets are still quite costy, in a few decades it might actually be affordable.\u003C/p\u003E\n"},{"CreatedByName":"Rich","CreatedById":17874,"CreatedDateTime":"2013-09-08T19:08:26Z","Content":"\n\u003Cp\u003EWell. The ISS is only going to be around for another couple of years, so I doubt you will be able to buy tickets there.\u003C/p\u003E\n"},{"CreatedByName":"nettcod","CreatedById":59103,"CreatedDateTime":"2013-09-08T19:10:44Z","Content":"\n\u003Cp\u003EI hope so but I doubt it.\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-09-08T19:37:19Z","Content":"\n\u003Cp\u003EI\u0027m still quite young so I\u0027m holding out hope, but I am seriously considering becoming an astronaut just to have that experience. Only one flight would be enough, and I know adults are not locked in one job forever, so maybe?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-09-08T19:49:01Z","Content":"\n\u003Cp\u003ESub-orbital intercontinental travel is something that might be realized within the next 50 years. A logical extrapolation of this would be orbital resorts.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t expect any \u0027reasonably prized\u0027 trips to the ISS. Even though it is still under construction the ISS is already getting rather old. By the time prizes have dropped enough it will have become obsolete, a relic from a bygone era.\u003C/p\u003E\u003Cp\u003EPlease forget space elevators. The theory is nice but it is completely impractical. The amount of materials to build one is astronomical and the technology required is pure sci-fi.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T20:07:57Z\u0022 title=\u002209/08/2013 08:07  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-08T20:00:23Z","Content":"\n\u003Cp\u003ENo.\u003C/p\u003E\u003Cp\u003EI expect suborbital flights for the price of the most expensive first class airplane ticket. I\u0027d save money for that before I die.\u003C/p\u003E\n"},{"CreatedByName":"Britpoint","CreatedById":59550,"CreatedDateTime":"2013-09-08T20:09:41Z","Content":"\n\u003Cp\u003ESub-orbital quite possibly, if the market sustains a company like Virgin Galactic long enough for those costs to come down, but orbital no way. Elon Musk hopes that SpaceX can get the cost of an orbital flight down to around $500 per pound. Well, I weigh 180lbs, so that\u0027s $90,000 for a trip in pretty much the best case scenario. While that\u0027s a hell of a lot better than it is at the moment it\u0027s still the price of a sports car rather than an airline ticket. Bear in mind that cost would be with a fully and rapidly reusable spacecraft, so I don\u0027t see prices getting much lower than that without something out of science-fiction stepping into the mix.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-08T20:26:42Z","Content":"\n\u003Cp\u003EI will be happy if i\u0027ll live long enough to see human landing on Mars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I will be even more happy if he\u0027ll travel there in nuclear or fusion spaceship. And if along the way NASA or someone else proves that Alcubierre Drive is solid and can indeed be built, i\u0027ll die ridiculously extatic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2013-09-08T20:45:52Z","Content":"\n\u003Cp\u003EI\u0027m surprised nobody has mentioned the in-development SABRE engines. Provided that they go into successful operation, which it looks like they will, then the prices for travelling into orbit will be slashed tremendously. Because of their hybrid nature, they act like jet engines in the atmosphere and can switch over to rocket-mode once at mach 5 (I think it\u0027s mach 5 anyway). The concept Skylon spaceplane on which they are to be used takes off and lands like a normal aircraft at a normal runway, although it will be completely SSTO. It will only need more fuel after landing, meaning it\u0027s ready to go again a matter of hours after touchdown, hence the huge price cut.\u003C/p\u003E\u003Cp\u003ETherefore, it\u0027s probable that a relatively cheap trip into orbit is going to be possible by around 2025 or 2030.\u003C/p\u003E\u003Cp\u003ESABRE is estimated to enter operation around 2020, I think, maybe a little earlier, and I must say, I\u0027m rather excited by the prospect of Skylon, even if the vehicle is piloted by a computer and not people \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-08T21:34:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RogueMason\u0022 data-cite=\u0022RogueMason\u0022\u003E\u003Cdiv\u003EI\u0027m surprised nobody has mentioned the in-development SABRE engines. Provided that they go into successful operation, which it looks like they will, then the prices for travelling into orbit will be slashed tremendously. Because of their hybrid nature, they act like jet engines in the atmosphere and can switch over to rocket-mode once at mach 5 (I think it\u0027s mach 5 anyway). The concept Skylon spaceplane on which they are to be used takes off and lands like a normal aircraft at a normal runway, although it will be completely SSTO. It will only need more fuel after landing, meaning it\u0027s ready to go again a matter of hours after touchdown, hence the huge price cut.\u003Cp\u003ETherefore, it\u0027s probable that a relatively cheap trip into orbit is going to be possible by around 2025 or 2030.\u003C/p\u003E\u003Cp\u003ESABRE is estimated to enter operation around 2020, I think, maybe a little earlier, and I must say, I\u0027m rather excited by the prospect of Skylon, even if the vehicle is piloted by a computer and not people \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m actually tremendously excited about Skylon - the problem is, they\u0027re not getting the funding they need to really accelerate development of the SABRE propulsion system (and, by extension, the aircraft itself). The governments of Europe have been incredibly stingy with their money, and have only funded little bits and pieces of the project. I think the Skylon project should get Airbus on board - maybe the aerospace giant could try and expand into a new market segment?\u003C/p\u003E\n"},{"CreatedByName":"Arbolus","CreatedById":74833,"CreatedDateTime":"2013-09-08T22:04:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPlease forget space elevators. The theory is nice but it is completely impractical. The amount of materials to build one is astronomical and the technology required is pure sci-fi.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly because we haven\u0027t yet found a material strong enough, or a way to mass-produce it once we have. But there\u0027s no reason those problems can\u0027t be solved with enough research. In the last few decades we\u0027ve gone from glass fibre to carbon nanotubes; in another 50 years time who knows what we\u0027ll be able to use?\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-08T22:16:37Z","Content":"\n\u003Cp\u003EI guess I\u0027ll just have to keep dreaming. \u003C/p\u003E\u003Cp\u003ESpeaking of dreaming, I\u0027ll bet there will be some kind of immersive neurological interface before space becomes cheap. Dreams will become an even bigger industry than movies or games. The infinite universe of imaginary landscapes only limited by our collective imagination is the true final frontier.\u003C/p\u003E\u003Cp\u003EAll the best things in the Universe (that we know of) are man-made.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-09-08T22:23:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RogueMason\u0022 data-cite=\u0022RogueMason\u0022\u003E\u003Cdiv\u003EI\u0027m surprised nobody has mentioned the in-development SABRE engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrecisely because that\u0027s all they are: a design on paper. I\u0027ll be more enthused if they actually manage to build working full-scale demonstrators of some of the key components, such as the precooler, which would have to have some pretty insane performance. There are a lot of things that could still throw some massive spanners into the works. Nobody yet knows for sure if a SABRE engine will even work, how well it will perform, or if it will be reliable.\u003C/p\u003E\u003Cp\u003EI wish them every success, but they\u0027ve got a long way to go.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-09T00:00:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EPrecisely because that\u0027s all they are: a design on paper. I\u0027ll be more enthused if they actually manage to build working full-scale demonstrators of some of the key components, such as the precooler, which would have to have some pretty insane performance. There are a lot of things that could still throw some massive spanners into the works. Nobody yet knows for sure if a SABRE engine will even work, how well it will perform, or if it will be reliable.\u003Cp\u003EI wish them every success, but they\u0027ve got a long way to go.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re already built and tested the precooler, and secured the funding they need to construct a full-size prototype of the SABRE. Skylon is, at this time, probably one of the best prospects for the next generation of spacecraft. And, even if Skylon doesn\u0027t get finished, someone will use those SABRE engines to build something like it.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-09-09T01:01:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NGTOne\u0022 data-cite=\u0022NGTOne\u0022\u003E\u003Cdiv\u003EThey\u0027re already built and tested the precooler\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow sure are you of this? I was reading the IET\u0027s magazine the other day and the SABRE developer was saying that building a working version was his next big challenge. I\u0027m sure they\u0027ve tested aspects of it during development, but an actual functional one? Not sure.\u003C/p\u003E\u003Cp\u003EI\u0027m always a little sceptical of claims made in the media by companies who\u0027re currently trying to drum up funding.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-09T02:28:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EHow sure are you of this? I was reading the IET\u0027s magazine the other day and the SABRE developer was saying that building a working version was his next big challenge. I\u0027m sure they\u0027ve tested aspects of it during development, but an actual functional one? Not sure.\u003Cp\u003EI\u0027m always a little sceptical of claims made in the media by companies who\u0027re currently trying to drum up funding.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been following Skylon as well, and apparently ESA has verified that REL actually tested and demonstrated the precooler. Apparently the Brits have pledged something like 60 million pounds to finance the next phase of development (that funding was contingent on the success of the precooler test - no test, no cash).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bbc.co.uk/news/science-environment-20510112\u0022 rel=\u0022external nofollow\u0022\u003EHave a look for yourself.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.wired.com/autopia/2012/11/reaction-engines-hypersonic/\u0022 rel=\u0022external nofollow\u0022\u003EOr this one, if you still need convincing.\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T02:39:33Z\u0022 title=\u002209/09/2013 02:39  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by NGTOne\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-09-09T08:50:37Z","Content":"\n\u003Cp\u003EDo we really need to have yet another discussion about Skylon? REL isn\u0027t much more that 4 old geezers who have been working in their shed for 30 years. We pretty much came to the conclusion that Skylon needs funding in the billions and what they are getting from ESA is in the millions. That\u0027s 3 orders of magnitude from what they need.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-09-09T08:58:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dimetime35c\u0022 data-cite=\u0022Dimetime35c\u0022\u003E\u003Cdiv\u003Eokay do you believe in your lifetime you will be able to buy a reasonably priced ticket into space?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes.\u003C/p\u003E\u003Cp\u003E1) I plan to live a long time.\u003C/p\u003E\u003Cp\u003E2) The main reason space travel is expensive today is not due to technological problems, but rather a lack of infrastructure. The technological hurdles have been largely solved; all we need now to make things affordable is to take advantage of economies of scale.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-09-09T10:37:43Z","Content":"\n\u003Cp\u003EI hoped I\u0027d see it, but then NASP was cancelled, and VentureStar, and Freedom was watered down to ISS, and NASA changed from a space agency to a global warming doomsday propaganda machine, Hotol was cancelled, and a spade of other steps backwards were taken that pushed mankind from the brink of becoming a space faring civilisation to being stuck with one foot on the treshold and shuddering at the magnitude of the task at hand, thinking it\u0027s too big a risk to take that step and slowly letting the door slip shut again into its locks that took so long to open.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-09-09T10:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EDo we really need to have yet another discussion about Skylon? REL isn\u0027t much more that 4 old geezers who have been working in their shed for 30 years. We pretty much came to the conclusion that Skylon needs funding in the billions and what they are getting from ESA is in the millions. That\u0027s 3 orders of magnitude from what they need.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. It looks like they have got some useful IP in their engine, but they don\u0027t have anything near an entire vehicle. I hope they do manage to work SABRE up into an actual engine, or sell it to someone who can, but any talk of the Skylon vehicle is immensely premature.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-09-09T12:15:12Z","Content":"\n\u003Cp\u003EWell, although I don\u0027t consider it proper \u0022space flight\u0022, a Virgin Galactic ride is already accessible to anyone who is willing to spend $250000. It\u0027s affordable if you are willing to sell your house... If I finish paying my mortgage when I retire in 20 years, I suppose I could do it, but I still find it expensive and rather pointless for only 5 minutes of weightlessness. \u003C/p\u003E\u003Cp\u003EHopefully, the price will have come down a bit by then, or they might be offering orbital Dragon rides for an equivalent price. I\u0027m not counting on it though. The sheer amount of energy needed to boost 100 kilos of human meat to 24000km/h is never going to be cheap.\u003C/p\u003E\u003Cp\u003EI\u0027m willing to bet that we will actually see neural-level virtual reality simulators that will provide an identical experience for cheaper than an actual space flight. If we can create VR experiences that are indistinguishable from reality, there will be no more point in space tourism (or travelling at all).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T12:24:08Z\u0022 title=\u002209/09/2013 12:24  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-10T00:57:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EIndeed. It looks like they have got some useful IP in their engine, but they don\u0027t have anything near an entire vehicle. I hope they do manage to work SABRE up into an actual engine, or sell it to someone who can, but any talk of the Skylon vehicle is immensely premature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot as much as you\u0027d think, actually - there are no technologies for Skylon that haven\u0027t been developed. The SABRE precooler was the last piece of the puzzle. The next step for REL and Skylon is full-scale engine construction and testing (hence the 60 million pounds from the Brits), and finalizing the on-paper design for the vehicle itself. Now, of course, that\u0027s still a lofty goal, but Skylon is showing far more promise than a lot of other space projects, DESPITE not having all their funding secured. At this point, with so little of their overall project funding, most space projects (especially something as ambitious as a launch vehicle) would be dying a quiet death - Skylon hasn\u0027t, and is instead continuing to advance. And all the analyses I\u0027ve read seem to think it\u0027s going to CONTINUE to advance, simply BECAUSE it doesn\u0027t rely on any really \u0022new\u0022 technologies (that haven\u0027t already been developed for the project). That\u0027s FAR more than virtually any other low-cost-to-orbit project can claim.\u003C/p\u003E\u003Cp\u003EThe reason this discussion has effectively become a discussion of Skylon is because there\u0027s only three major launch systems under development today: The American SLS, the Russian Angara (both conventional expendable rockets), and the privately-developed Skylon. Neither Angara or SLS are promising ANYTHING new; rather, they are simply re-inventing the wheel (quite literally for SLS - they dredged up a Saturn V first-stage engine from the bottom of the ocean, and are studying it like crazy to figure out what the engineers in the 60s were thinking, to save some man-centuries on research). Skylon is the only system that relies on new ideas, and might produce some gains for the space industry and space exploration as a whole (especially due to the projected lower launch costs).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-10T01:30:38Z\u0022 title=\u002209/10/2013 01:30  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 10, 2013\u003C/time\u003E by NGTOne\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-09-10T01:31:22Z","Content":"\n\u003Cp\u003EI suppose you\u0027re right, after all Skylon is just another 80m long, ceramic-skinned hypersonic unmanned SSTO burning hydrogen in an engine that\u0027s never even been tested. Hmm.\u003C/p\u003E\n"}]}