{"TopicId":45446,"ForumId":32,"TopicTitle":"Designs for Boats","CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2013-09-09T17:36:17Z","PageNum":1,"Articles":[{"CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2013-09-09T17:36:17Z","Content":"\n\u003Cp\u003ESo I\u0027m working up the final stages of a large Laythe Expedition. I\u0027ve managed to design and hang all the other components on my delivery vehicle (space stations, satellites, planes, rovers, probe landers, accommodation etc) but I\u0027m having trouble designing a decent boat and the forum search hasn\u0027t helped much.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking jet powered but my current ones lose steering above about 10m/s while in the water. Anybody have any good ideas? Ideally it would be nice if it also had wheels to drive up onto the beach.\u003C/p\u003E\n"},{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2013-09-09T17:41:50Z","Content":"\n\u003Cp\u003ETry Firespitter pack, it has some parts for landing airplanes on water, they could work well. There was also a good mod with \u0022boat parts\u0022 in its name, but I cannot remember it right now... It had parts for massive ships, regular size ships and boat size ships.\u003C/p\u003E\n"},{"CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2013-09-09T18:02:15Z","Content":"\n\u003Cp\u003ESorry, I should have mentioned.\u003C/p\u003E\u003Cp\u003EAs I still haven\u0027t done everything in the stock game I haven\u0027t moved on to mods yet. I\u0027m not saying they don\u0027t look fun and interesting but instead that I haven\u0027t got there yet and do everything totally stock.\u003C/p\u003E\u003Cp\u003EI am finding that a plane in the water is very ungainly (ie 10m/s max speed) but a powdered raft of panels actually can manage 20 m/s \u002B but is more difficult to steer.\u003C/p\u003E\n"},{"CreatedByName":"Libra00","CreatedById":29336,"CreatedDateTime":"2013-09-09T18:38:25Z","Content":"\n\u003Cp\u003EWithout resorting to mods, the key to boats in KSP is to make sure only wing parts are in the water, and oriented correctly. Probably the best place to look for design inspiration is in the various boat race challenges, if they still exist. But basically you want to build hydrofoils rather than traditional boats. You want a reasonably long, reasonably wide stance for improved stability, and you want to build it in such a way that anything that isn\u0027t a wing is lifted out of the water. I\u0027m not sure how the gravity on Laythe compares with Kerbin, so it may require some testing to figure out how long your foils will have to be.\u003C/p\u003E\u003Cp\u003EThe upside to this kind of design is that it can be very fast (I have designs that can exceed 200m/s in the water). The downside is they can be hard to steer (keep your control surfaces out of the water or they break off pretty consistently at speed), unstable, and if you\u0027re going long distances they seem to have a proclivity for speeding up as fuel drains until either parts fall off or you suddenly leap out of the ocean, lose lift, and crash back into it. If you want something that isn\u0027t quite so fast it\u0027s possible to build hull-like shapes out of wing parts, but every attempt I\u0027ve ever made has had bad stability issues.\u003C/p\u003E\u003Cp\u003EAlso, as for mods, the pontoons from the firespitter pack are a little buggy for me. If you use the gear bays anywhere in them (to allow it to drive on land) they tend to bend and warp a lot where the gear bays connect to other parts.\u003C/p\u003E\u003Cp\u003EAnyway, hope this helps.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-09-09T18:40:07Z","Content":"\n\u003Cp\u003EI made a boat once. Then it became a u-boat. Then it became a coral reef. Bill Kerman still isn\u0027t speaking to me.\u003C/p\u003E\n"},{"CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2013-09-09T18:43:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EI made a boat once. Then it became a u-boat. Then it became a coral reef. Bill Kerman still isn\u0027t speaking to me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Best comment ever!\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-09-09T20:30:38Z","Content":"\n\u003Cp\u003EOhhh, whackjob, what would we do with out you?\u003C/p\u003E\u003Cp\u003EAny way, back on topic, I recommend have a little surface area in water as possible and to have mass on the top so your craft isn\u0027t constantly trying to turn due to STUPID UNWANTED TOQUE!!!!!!\u003C/p\u003E\n"},{"CreatedByName":"Blackstar","CreatedById":61238,"CreatedDateTime":"2013-09-09T20:36:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSphereOfDeath\u0022 data-cite=\u0022SpaceSphereOfDeath\u0022\u003E\u003Cdiv\u003ESTUPID UNWANTED TOQUE!!!!!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.giantbomb.com/uploads/original/0/1405/1205305-toque.jpg\u0022 alt=\u00221205305-toque.jpg\u0022\u003E ?\u003C/p\u003E\n"},{"CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-09-09T20:45:19Z","Content":"\n\u003Cp\u003EI think he meant torque\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-09-09T20:50:31Z","Content":"\n\u003Cp\u003EMaybe he meant Torgue.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EI got one, and only one question for you, Bob Kerman!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MgG7Q9e.jpg\u0022 alt=\u0022MgG7Q9e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:48px;\u0022\u003EEXPLOSIONS?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0RaRShwl.jpg\u0022 alt=\u00220RaRShwl.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T20:53:18Z\u0022 title=\u002209/09/2013 08:53  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Whackjob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Flyer10254","CreatedById":47839,"CreatedDateTime":"2013-09-09T21:36:08Z","Content":"\n\u003Cp\u003EIve found that a mixture of wings and air intakes as pontoons make for a nice ship.\u003C/p\u003E\n"},{"CreatedByName":"ApocSurvivor713","CreatedById":68720,"CreatedDateTime":"2013-09-10T18:04:40Z","Content":"\n\u003Cp\u003EI use the structural plates as the floats. In the end, whatever boat you make ends up looking a bit like a hydroplane. I\u0027ve never actually built a boat with them, but they can withstand a water landing at 90m/sec. Just put one lying horizontally, and attach another to it at an angle. Use 3 or 4 on a body that looks like an airplane without wings and you should be good. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"UH60guy","CreatedById":77959,"CreatedDateTime":"2013-09-11T17:57:01Z","Content":"\n\u003Cp\u003EI used nose cones for floats on a base (image here: \u003Ca href=\u0022http://i.imgur.com/KcvJxWc.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/KcvJxWc.jpg\u003C/a\u003E), you may want to try those or the smaller ones underneath some scaffolding beams for a boat. \u003C/p\u003E\u003Cp\u003EJust be careful that whatever you do that the ladder or seats for Kerbals are close to the water surface (within right click range to board). The way the game is set up, it treats objects that are floating as falling, and Kerbals cannot stand on floating objects. They can climb ladders and board floating modules, just they can\u0027t stand. I\u0027m not sure about control stations, but that\u0027s what testing is for! There is a mod for that though (sea sickness cure), but I know you\u0027re shooting for stock.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T18:01:03Z\u0022 title=\u002209/11/2013 06:01  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by UH60guy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}