{"TopicId":45551,"ForumId":21,"TopicTitle":"UKNS Orca Dropship (B9)","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-10T21:10:41Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-10T21:10:41Z","Content":"\n\u003Cp\u003EHello! Don\u0027t you think I have completely forgotten the skunkworks thread now that I\u0027m having a second honeymoon with stock. This one I just love, and yes, I\u0027m VTOLing a bit too much lately.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EOrca SSTO VTOL\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENeed to drop supplies in a minuscule island in, say, Laythe, from the supply depot you have set hidden on a deep crater on Bop for the coming invasion of your land forces? Then this here is the ship you will want, beacuse it carries stuff, and it does so with style.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/QeZAe1g\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QeZAe1g.jpg\u0022 alt=\u0022QeZAe1g.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt may not be able to carry much payload because of CoM/CoT issus, but who cares when you can drop them on top of the VAB? And the insane amount of torque those 10 reaction wheels provide helps keeping it maneuverable with considerable thrust misalignments (which is kind of essential on a VTOl with a rear cargo bay). It flies with or without the provided cargo (an armored rover, IIRC, but I also had a truck and a kethane version, so there may be surprises, sorry in advance). Besides, it\u0027s got crew transport potential, with cabin space for four, and an undetermined capacity on the payload bay... I kinda want to see that now, how many kerbals can you transport with this? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s got quite the complicated action group setup, so you would be wise to look that up. Also, there may or may not be a KAS winch in there, since that is a new mod I\u0027m playing with now that I am seriously messing with ground ops. The good news is that you can more or less ignore flameouts, since you have \u003Cem\u003Ea lot\u003C/em\u003E of available torque. And believe it or not, even though it has all those different engines and not that many fuel tanks, it has enough to land on Mun and take off again, for example, and can reach quite high kerbin orbits by itself. Self-ferry range, actually, with an orbital depot on LKO and the destination, is kind of limited to not trying landing in Tylo and Eve, I think. Though Duna and Vall might stress the T/W a bit too...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIMGUR ALBUM:\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SLtbY\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EDOWNLOAD:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/57okhzpz4c3cz4i/Orca_VTOL_SSTO_Mk_2.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/57okhzpz4c3cz4i/Orca_VTOL_SSTO_Mk_2.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERune. Enjoy the trucking!\u003C/p\u003E\n"},{"CreatedByName":"SilentFall","CreatedById":16734,"CreatedDateTime":"2013-09-11T14:23:12Z","Content":"\n\u003Cp\u003EAs a note, this craft also uses Kerbal Engineer and Procedural Wings, as well as the previously mentioned \u0027surprises\u0027.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T14:29:52Z\u0022 title=\u002209/11/2013 02:29  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by SilentFall\u003C/strong\u003E\n\u003Cbr\u003EAccidentally finding things makes me frustrated.\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-11T16:21:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SilentFall\u0022 data-cite=\u0022SilentFall\u0022\u003E\u003Cdiv\u003EAs a note, this craft also uses Kerbal Engineer and Procedural Wings, as well as the previously mentioned \u0027surprises\u0027.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhoops! Yeah, you are totally right about both. Sorry I forgot to mention! So it is the kethane rover after all, I got a file up quite a while ago and I wasn\u0027t sure what version it was. Well, it\u0027s quite loaded. I\u0027ll go link them in the skunkworks thread now, thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T16:25:55Z\u0022 title=\u002209/11/2013 04:25  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"}]}