{"TopicId":45595,"ForumId":16,"TopicTitle":"lock a stage to prevent dumping the service module","CreatedByName":"BamBam","CreatedById":11581,"CreatedDateTime":"2013-09-11T04:25:48Z","PageNum":1,"Articles":[{"CreatedByName":"BamBam","CreatedById":11581,"CreatedDateTime":"2013-09-11T04:25:48Z","Content":"\n\u003Cp\u003EToday, and not for the first time, I had my lander on a perfect lunar course. I was just about to do the de-orbit burn and land on the mun when i accidentally hit the spacebar and dropped the service module. Now there is a capsule with parachutes and a docking port orbiting the mun. Those Kerbals are dead even before they know it....\u003C/p\u003E\u003Cp\u003EIs there a way to lock a stage to prevent accidental separation?\u003C/p\u003E\u003Cp\u003EThis was a practice run with a new lander. Think of the frustration if i had made it all the way out to Duna and then dumped the SM!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T12:22:50Z\u0022 title=\u002209/11/2013 12:22  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by BamBam\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-09-11T04:34:11Z","Content":"\n\u003Cp\u003EYou can\u0027t lock a stage, but you can:\u003C/p\u003E\u003Cp\u003E* Hit F5 occasionally to save the game state. I do this at least twice on every mission. Once before I start my descent burn and then once when I\u0027m happy with where I\u0027m going to land. You should mabye add one for once you\u0027re in orbit around Kerbin and maybe another for when you reach orbit around the other body. Then you can just hold F9 to restore from your backup.\u003C/p\u003E\u003Cp\u003E* Create an empty stage right before your current stage. You\u0027ll have to do this manually I think. That way, hitting space by accident executes the \u0022do nothing\u0022 stage.\u003C/p\u003E\n"},{"CreatedByName":"FastMINI42","CreatedById":76767,"CreatedDateTime":"2013-09-11T04:40:41Z","Content":"\n\u003Cp\u003EActually, if you hit Mod\u002BL you will lock the stage and prevent bad things from happening by accidentally pressing the space-bar. When you hit Mod\u002BL, you should see the green light on the lower left of the HUD turn a pink color. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Key_Bindings\u0022 rel=\u0022external nofollow\u0022\u003EKey Bindings\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-09-11T04:42:06Z","Content":"\n\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Controls\u0022 rel=\u0022external nofollow\u0022\u003Ealt\u002BL locks the current stage\u003C/a\u003E\n"},{"CreatedByName":"BamBam","CreatedById":11581,"CreatedDateTime":"2013-09-11T12:22:38Z","Content":"\n\u003Cp\u003EAwesome! That is exactly what I needed. Thanks\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-09-12T01:14:50Z","Content":"\n\u003Cp\u003EIt\u0027s amazing what you learn (and how late you learn it). Thanks also for me. I\u0027ve been doing what I said above and now I have a better way!\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-09-12T02:09:30Z","Content":"\n\u003Cp\u003EJust don\u0027t forget to unlock it to pop the chutes after reentry.\u003C/p\u003E\n"}]}