{"TopicId":45652,"ForumId":16,"TopicTitle":"A Landing Site at Duna","CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-09-11T17:56:41Z","PageNum":1,"Articles":[{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-09-11T17:56:41Z","Content":"\n\u003Cp\u003EIn a few minutes I\u0027ll have a lander in orbit around Duna. I originally figured I would enter a near-equatorial orbit and just drop the craft down on the first convenient patch I could see, but it turns out due to accident that I\u0027m only a small-ish correction away from a total polar orbit, so I basically have the complete pick of landing sites. The thing is, now I don\u0027t know where to go. What regions of Duna are most curious or attractive from the ground? I don\u0027t have any mobility gear (rovers, long range flyers etc.) so it\u0027s mostly going to be strolling, planting flags and peering vacantly at rocks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T19:21:26Z\u0022 title=\u002209/11/2013 07:21  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by rodion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-09-11T18:00:45Z","Content":"\n\u003Cp\u003EThe south pole is home to a pyramid that gives off a SSTV signal. If you want the easiest landing, aim for the darker patches of Duna, those are close or at sea level. so you can actually trust the altimeter.\u003C/p\u003E\u003Cp\u003EBEWARE SPOILERS\u003C/p\u003E\u003Cp\u003EYou can also try to find the Coords for the Kerbal head if you want to try there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T18:09:31Z\u0022 title=\u002209/11/2013 06:09  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by Rage097\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-09-11T18:01:47Z","Content":"\n\u003Cp\u003EIn the northern temperate lattitudes there\u0027s a big Mariner canyon-kind of thing. It\u0027s a good landing spot for scenery, because the bottom is almost perfectly flat, and because it\u0027s so low that the atmosphere will make parachutes work better.\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-09-11T18:27:41Z","Content":"\n\u003Cp\u003EThis is all looking really nice...the crater floors on the border between the poles and equator seem like they would be good too.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/31907122/screenshot265.png\u0022 alt=\u0022screenshot265.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe graphics anomaly at the pole where the textures come together is very clear from orbit.\u003C/p\u003E\n"},{"CreatedByName":"MrPopcup","CreatedById":75533,"CreatedDateTime":"2013-09-11T18:42:31Z","Content":"\n\u003Cp\u003EThere is a mountain that is 7km high I believe ( maybe more, but not less. ) I landed on there but goddamn,, it was hard to! \u003C/p\u003E\u003Cp\u003Eafter re-loading and stuff I finally managed to land, completely worth it, the view is breathtaking.\u003C/p\u003E\u003Cp\u003ETry it out, you\u0027ll be happy, ( it\u0027s between the north Ice cap and the dunanian sand.\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-09-11T19:19:18Z","Content":"\n\u003Cp\u003EWent for one of the extremely flat, oxide-saturated looking beds that a lot of the huge vaguely canalia-like fissures radiate from. It looks like it could almost have been an ocean in older days, actually.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/31907122/screenshot272.png\u0022 alt=\u0022screenshot272.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for your help.\u003C/p\u003E\u003Cp\u003EOh, gotta get the contingency sample.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/31907122/screenshot273.png\u0022 alt=\u0022screenshot273.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-09-11T21:26:52Z","Content":"\n\u003Cp\u003EMy understanding is that all the interesting stuff was buried underneath the surface with 0.21; I can confirm that\u0027s the case with the SSTO Pyramid (I\u0027ve got a sci probe sitting right on top of the coordinates, there is no pyramid, but if I zoom into the ground I can listen to the signal). Just FYI.\u003C/p\u003E\n"}]}