{"TopicId":45752,"ForumId":16,"TopicTitle":"How to detach ships and prevent them from crashing?","CreatedByName":"dronkit","CreatedById":67237,"CreatedDateTime":"2013-09-12T19:59:33Z","PageNum":1,"Articles":[{"CreatedByName":"dronkit","CreatedById":67237,"CreatedDateTime":"2013-09-12T19:59:33Z","Content":"\n\u003Cp\u003EHi!\u003C/p\u003E\u003Cp\u003ESuppose I have a crane that detachs a payload or a mother sub-orbital ship or plane that launches a smaller craft to orbit a la X crafts or SpaceShip 2. I can fly, detach, then I can control either the spaceship or the mother ship. But if both are on sub-orbital trajectory one of them will crash! I can either put the orbiter in orbit or safely land the launcher plane but not both :/\u003C/p\u003E\u003Cp\u003ESame with say, a crane, I detach the payload wich maybe I need to control to ensure it doesn\u0027t fall off a hill or something, but at the same time I need to re-orbit the crane.\u003C/p\u003E\u003Cp\u003EIs there any way?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-13T02:12:51Z\u0022 title=\u002209/13/2013 02:12  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 13, 2013\u003C/time\u003E by dronkit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thomas Cook","CreatedById":77805,"CreatedDateTime":"2013-09-12T20:13:09Z","Content":"\n\u003Cp\u003EIn a stationary orbit I often just retrograde until I got a decent landing spot. After that I immediately detach both ships and prograde the command module back in orbital speeds. If you perform this maneuver it also doesn\u0027t have to cost that much delta-v\u003C/p\u003E\u003Cp\u003EThe landing vehicle still has the deorbiting speeds so that vehicle should land. In a 1x speed you should have plenty of time to perform this maneuver before both ships reach dangerously low altitudes.\u003C/p\u003E\n"},{"CreatedByName":"Thomas Cook","CreatedById":77805,"CreatedDateTime":"2013-09-12T20:14:31Z","Content":"\n\u003Cp\u003EOops. Excuse me. I think I misread the situation of your question...\u003C/p\u003E\n"},{"CreatedByName":"lewisd","CreatedById":66947,"CreatedDateTime":"2013-09-12T20:21:21Z","Content":"\n\u003Cp\u003EThe only idea I have involves mods, but I\u0027m not sure if that\u0027s ok with you. For that matter, I don\u0027t even know if it would work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou might be able to use MechJeb2 (or maybe original MechJeb) to fly one, while you fly the other. I\u0027m not sure if it\u0027ll be able to control a craft other than the one you\u0027re focused on though. But, if that *does* work, then immediately after detaching, you could use MechJeb to quickly set up a maneuver node to put the orbiter back into orbit, and execute it, then switch to your lander to manually control it\u0027s landing.\u003C/p\u003E\n"},{"CreatedByName":"Thomas Cook","CreatedById":77805,"CreatedDateTime":"2013-09-12T20:24:03Z","Content":"\n\u003Cp\u003ESo both planes are sub-orbital.\u003C/p\u003E\u003Cp\u003EI think my answer is semi valid IF you take a trajectory where it doesn\u0027t take much effort to bring the crane in stationary orbit. Doesn\u0027t have to be a decent orbit, as long ad it doesn\u0027t fall back.\u003C/p\u003E\u003Cp\u003EOnce it has a decent orbit where it doesn\u0027t crash back to a planet, you can shift your focus to the lander, which should always have some minutes left before it crashes blind on the surface.\u003C/p\u003E\n"},{"CreatedByName":"orangexception","CreatedById":72566,"CreatedDateTime":"2013-09-12T20:33:07Z","Content":"\n\u003Cp\u003ETry using Remote Tech. I haven\u0027t tried using it for this use case yet, but it seems like that\u0027s something it can do.\u003C/p\u003E\n"},{"CreatedByName":"Read have Read","CreatedById":60863,"CreatedDateTime":"2013-09-12T20:47:05Z","Content":"\n\u003Cp\u003EUnattended vehicles in atmosphere will be deleted if they get unloaded (2.2km away from the active vessel). There is a mod that will increase the loading range ( romfarer\u0027s Lazor), and one I belive by TouhouTorpedo specifically for range that can do even longer distances. \u003C/p\u003E\u003Cp\u003ENow control, RemoteTech, MechJeb and kOS will remotely control a vehicle to varying levels. Remotetech, which is not compatable for .21 had many of the same SmartASS as mechjeb, plus the ability to do timed burns. kOS is fully programable with a ingame editor to fly both vehicles to where ever at the same time if you are savvy.\u003C/p\u003E\n"},{"CreatedByName":"Evrion","CreatedById":70825,"CreatedDateTime":"2013-09-12T20:49:56Z","Content":"\n\u003Cp\u003EIf I get this right:\u003C/p\u003E\u003Cp\u003EYou have a Rocket and a Plane. Rocket designed for orbital flight, and plane built for atmospheric flight. In a suborbital trajectory, you detach the rocket from the plane, then want to have both do their thing safely.\u003C/p\u003E\u003Cp\u003EFirst: it IS possible to switch to any craft you have from the map view by simply clicking on them, then selecting \u0022Switch to\u0022. (The other option there, \u0022Set as target\u0022 is also useful, but not in this case.) The rocket, when it gets to orbit, will be safe, that\u0027s the quick part.\u003C/p\u003E\u003Cp\u003ESo, I would try things this way, if you can get both to an apoapsis of more than 70 km.\u003C/p\u003E\u003Cp\u003E1) Suborbital trajectory should be relatively long, say up to 80-90 km.\u003C/p\u003E\u003Cp\u003E2) control the rocket, once you get to apoapsis, burn so the rocket is safe.\u003C/p\u003E\u003Cp\u003E3) switch to the plane, hopefully before the atmosphere plays havoc with it.\u003C/p\u003E\u003Cp\u003EIf you can\u0027t get them both into space. I would try the same procedure, be quick with the rocket and hope you can recover from whatever KSP\u0027s aerodynamics have done with your plane once you switch back.\u003C/p\u003E\n"},{"CreatedByName":"stringyquark","CreatedById":74565,"CreatedDateTime":"2013-09-12T21:05:13Z","Content":"\n\u003Cp\u003EBut can you switch vehicles while throttled up? I\u0027m pretty sure you can\u0027t in stock.\u003C/p\u003E\n"},{"CreatedByName":"Evrion","CreatedById":70825,"CreatedDateTime":"2013-09-12T22:01:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stringyquark\u0022 data-cite=\u0022stringyquark\u0022\u003E\u003Cdiv\u003EBut can you switch vehicles while throttled up? I\u0027m pretty sure you can\u0027t in stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, you can\u0027t.\u003C/p\u003E\u003Cp\u003EYou have to try and leave one craft in a \u0022stable enough\u0022 position while you work on the other. If you can\u0027t do that, you will have to use, um, I have no idea, mods?\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-09-12T23:09:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EUnattended vehicles in atmosphere will be deleted if they get unloaded (2.2km away from the active vessel). There is a mod that will increase the loading range ( romfarer\u0027s Lazor), and one I belive by TouhouTorpedo specifically for range that can do even longer distances.\u003Cp\u003ENow control, RemoteTech, MechJeb and kOS will remotely control a vehicle to varying levels. Remotetech, which is not compatable for .21 had many of the same SmartASS as mechjeb, plus the ability to do timed burns. kOS is fully programable with a ingame editor to fly both vehicles to where ever at the same time if you are savvy. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree. Facing the same problem here.\u003C/p\u003E\u003Cp\u003ENote: Press \u0022[\u0022 or \u0022]\u0022 to quickly switch in between craft.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/1Mysq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-09-12T23:10:52Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ stringyquark\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@ Evrion \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou just press the [ or ] key to switch between them.\u003C/p\u003E\n"},{"CreatedByName":"dronkit","CreatedById":67237,"CreatedDateTime":"2013-09-13T02:12:06Z","Content":"\n\u003Cp\u003EThanks guys! I\u0027ll try some of the mods and stuff!\u003C/p\u003E\n"}]}