{"TopicId":45774,"ForumId":16,"TopicTitle":"downloading ship and other add ons","CreatedByName":"tmcshee","CreatedById":82420,"CreatedDateTime":"2013-09-13T00:36:11Z","PageNum":1,"Articles":[{"CreatedByName":"tmcshee","CreatedById":82420,"CreatedDateTime":"2013-09-13T00:36:11Z","Content":"\n\u003Cp\u003ENo this may seem silly, but I have a problem downloading content. (or more I dont know how) once I download something, like a lunar lander, how do access it in game.\u003C/p\u003E\u003Cp\u003Ei.e. I am able to download the files to my desktop but how do I actually use them in game?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-09-13T02:07:34Z","Content":"\n\u003Cp\u003EFor ships, copy the craft file to yourKSPfolder/saves/yoursavedgame/ships/VAB, and then the next time you play the game, it will show up in the VAB just like the ships you have made and saved yourself. As for mods, I don\u0027t know because only evil people use them.\u003Cspan style=\u0022font-size:8px;\u0022\u003E (Kidding!) \u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2013-09-13T04:28:06Z","Content":"\n\u003Cp\u003EIf you wish to come to the dark side and install any mods or plugins, try using KSP MODAdmin...It has an integrated browser window so you can download and install just about anything in-program, directly from the spaceport, or even this forum. Support for downloading and \u0022installing\u0022 craft files is forthcoming. \u003C/p\u003E\u003Cp\u003EIt will automatically detect and install most mods in the proper directories for you, and those pre-0.21 legacy mods that still work with 0.21, but dont get installed to the Gamedata folder, will give you the option to manually select the install location, then the program will do the rest.\u003C/p\u003E\u003Cp\u003EYou can also use it to pick thru parts mods, and install only the parts you want to use...Very handy for trimming down the large packs like B9, NovaPunch, KSPX, FusTek, etc, if all you want is just a few parts from them, vs having to install the whole pack, then delete parts manually.\u003C/p\u003E\u003Cp\u003EIt also has features you can use if you only play stock, as well...The biggest being an auto-backup for your save games and craft.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/ksp-mod-admin/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/ksp-mod-admin/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-13T04:37:37Z\u0022 title=\u002209/13/2013 04:37  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 13, 2013\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"}]}