{"TopicId":45956,"ForumId":55,"TopicTitle":"Flight History and Museum","CreatedByName":"Soiguapo","CreatedById":81051,"CreatedDateTime":"2013-09-14T22:00:38Z","PageNum":1,"Articles":[{"CreatedByName":"Soiguapo","CreatedById":81051,"CreatedDateTime":"2013-09-14T22:00:38Z","Content":"\n\u003Cp\u003EI feel there needs to be a way to build a legacy for your flights. It is very satifying to land on the moon or send a sattelite in orbit around a planet, but there is no record of it. I would love for there to be a way to take photographs on the flight, from a camera part or from the point of view of a kerbal. To be able to collect rock samples and bring them back, and for all of these to be put into a mission log that can be reviewed and maybe even have a museum where you can view your flights.\u003C/p\u003E\u003Cp\u003EI know this is quite a large feature, but I feel it will make accomplishments in the game much more satifying and can serve as way to show your friends the game to possibly reach more customers.\u003C/p\u003E\u003Cp\u003EI am a developer so I may look into making this a mod on my own but I wanted to see what other thought of the idea as well.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-09-14T22:17:30Z","Content":"\n\u003Cp\u003EThis was suggested a looong time ago. Several times, in-fact. As I recall, one of the developers mentioned something along the lines of a museum being in the pipeline. When we\u0027ll see such a thing is unknown, but it\u0027ll probably show us successful crafts or pictures or something like that to remind us of our achievements. It was mentioned \u0027round the time they implemented background progress tracking....which was just an update or two ago.\u003C/p\u003E\u003Cp\u003EIt\u0027s also been suggested that we have an encyclopedia that we fill out over time with our missions. Start with grainy pictures of other planets, moons and even other stars then over time get better pictures and more data as you point orbital telescopes \u0027round and send probes out there to explore the stuff...with manned missions bringing in the most precise or definitive data. The encyclopedia idea seems to have become the knowledgebase, so that\u0027s cool. Can\u0027t wait to get that going in career mode.\u003C/p\u003E\u003Cp\u003ESo yes, it\u0027s more or less a planned feature already. So...yay~\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-09-14T23:24:57Z","Content":"\n\u003Cp\u003EA simple research of the word museum would give you plenty of info of what other think about the idea.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/48447-Mission-Pictures-Rock-Samples-Kerbal-Museum?highlight=museum\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/48447-Mission-Pictures-Rock-Samples-Kerbal-Museum?highlight=museum\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/46699-Recoverable-Randomly-Generated-Artifacts-with-Display-Museum?highlight=museum\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/46699-Recoverable-Randomly-Generated-Artifacts-with-Display-Museum?highlight=museum\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45688-Space-and-aeronautics-museum?highlight=museum\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/45688-Space-and-aeronautics-museum?highlight=museum\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/37803-Museum%21?highlight=museum\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/37803-Museum%21?highlight=museum\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd since you are the one who posted the last one just a few weeks ago, I will fell free to lock that thread!\u003C/p\u003E\n"}]}