{"TopicId":46132,"ForumId":44,"TopicTitle":"Does gas giants have \u0026quot;habitable zones\u0026quot;?","CreatedByName":"ReptilianGameplays","CreatedById":65831,"CreatedDateTime":"2013-09-16T15:11:28Z","PageNum":1,"Articles":[{"CreatedByName":"ReptilianGameplays","CreatedById":65831,"CreatedDateTime":"2013-09-16T15:11:28Z","Content":"\n\u003Cp\u003EIt might be a foolish question (I guess).\u003C/p\u003E\u003Cp\u003EBut does the gas giants have \u0022habitable zones\u0022?\u003C/p\u003E\u003Cp\u003ENot like hot, good and cold. (Or maybe yes)\u003C/p\u003E\u003Cp\u003EBut like instable, good and not landing worthy.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-09-16T15:17:23Z","Content":"\n\u003Cp\u003EThe amount of stuff inside Jupiter is a very large number. The range of temperatures found if you were to fall all the way from the outer, wispy atmosphere to the dense core is another large number. Somewhere inside Jupiter there will be an onion like layer of water vapour or even liquid water. It will be in some kind of state that depends on the temperature and pressures at that level of atmosphere, but it\u0027s bound to be there.\u003C/p\u003E\u003Cp\u003EA spherical onion layer of liquid water with organic volatiles from the many, many asteroid and comet impacts, means there could even be an ecosystem living away in there. It\u0027s a possibility I tellz yer!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T15:21:43Z\u0022 title=\u002209/16/2013 03:21  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by Monkeh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2013-09-16T15:21:30Z","Content":"\n\u003Cp\u003EThey\u0027re made of gas, have a giant gravity, so they would colapse everything, and(if you survive, which is impossible), you will descend until reach an small rocky object, the planet core.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-09-16T15:23:07Z","Content":"\n\u003Cp\u003EI believe the current thinking has the core of these monsters as some kind of weird metallic state of matter not really found anywhere else. It\u0027s kind of a liquid but has mettalic properties...or something, can\u0027t remember fully, but simple rocks it sure isn\u0027t. Too much heat and pressure.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-16T16:27:10Z","Content":"\n\u003Cp\u003Ea) There are no ordinary liquid layers in gas giants. Pressures and temperatures grow at such rates that every constituent of its atmosphere reaches critical points where matter is indistinguishable from gas and liquid. Going even deeper, the conditions are just more dense and more hot, but there is no boundary. It\u0027s just thicker and thicker \u003Cem\u003Esupercritical fluid\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EOne exception might be metallic hydrogen, but that\u0027s a degenerate state of matter and we don\u0027t know much about it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Phase-diag2.svg/530px-Phase-diag2.svg.png\u0022 alt=\u0022530px-Phase-diag2.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Ice giants, same thing. \u0022Ice\u0022 doesn\u0027t mean there\u0027s any actual ice inside. Ice is a term planetary geology uses for volatile materials such as ammonia, water, nitrogen, hydrocarbons, etc. State of matter is unimportant - ice means type of chemical compound, that\u0027s all.\u003C/p\u003E\u003Cp\u003EUranus and Neptune contain almost identical hell inside, except the amounts of ices are a bit elevated compared to Jupiter and Saturn, hence the bluish colors. It\u0027s still close to the \u0022trace\u0022 amounts.\u003C/p\u003E\u003Cp\u003EAll our gas giants are mostly hydrogen with some helium. Their cores should contain every element Earth already contains. Iron, nickel, oxygen, aluminium, uranium, chlorine, sodium, you name it. Temperatures and pressures are greater than what\u0027s in Earth\u0027s center. It\u0027s degenerate matter akin to plasma, but it\u0027s still called rocky, because rock is a term planetary geologists use for heavy elements like iron.\u003C/p\u003E\u003Cp\u003EConclusion - after the initial falling through whispy clouds of ices in perpetual balance of sublimation and deposition, probe going deeper and deeper into the bowels of any gas giant will experience only increasing temperature and pressure. (Actually Jool now has something like that, the other day I\u0027ve measured close to 1000Ã‚Â°C deep inside.)\u003C/p\u003E\u003Cp\u003ENobody knows about the visual transparency of that hell, or any optical qualities. Nobody knows is there a complete darkness for the human eyes. I suppose there is a thick layer of darkness, and then when the temperatures reach sufficient values, human eye would see increasing red glow. Venus and Titan have gloomy surfaces and their atmospheres are very thin compared to gas giants. After few hundred kilometres, it\u0027s darkness.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T16:29:47Z\u0022 title=\u002209/16/2013 04:29  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-09-16T16:39:59Z","Content":"\n\u003Cp\u003Eand even if there was liquid water, the radiation levels would be so high as to make life as we know it impossible.\u003C/p\u003E\u003Cp\u003EOf course it\u0027s possible something could have evolved there that is based on nothing we can yet conceive, but I\u0027m not holding my breath.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-17T04:28:32Z","Content":"\n\u003Cp\u003ENothing can evolve in Jupiter clouds. It\u0027s gaseous environment at the depths where the temperature is convenient for organic chemistry, and in the upper layers where ices form aerosols, it\u0027s freakishly cold, so particles are either too separate to interact well enough, or their movement is too slow. Life requires liquid environment to form.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen those ideas and concept art with living sacks floating in Jupiter. Pipedreams.\u003C/p\u003E\n"},{"CreatedByName":"chrischambers","CreatedById":69113,"CreatedDateTime":"2013-09-17T10:13:48Z","Content":"\n\u003Cp\u003Ethe real question is that no one knows, untill we go there and send in probels that are looking for organic life.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-17T11:36:24Z","Content":"\n\u003Cp\u003EWe don\u0027t literally \u003Cem\u003Eknow\u003C/em\u003E what\u0027s 5000 km below Earth\u0027s surface, but we have calculated the conditions. If we took only our eyes for evidence, science would be a wasteland of human knowledge. Not everything needs to be literally seen, and even then, senses can fool us.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-09-17T23:51:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003Ea) There are no ordinary liquid layers in gas giants. Pressures and temperatures grow at such rates that every constituent of its atmosphere reaches critical points where matter is indistinguishable from gas and liquid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat depends on the temperature at the liquid/gas boundary. If it is below the triple point, there will be a firm boundary in which the surface tension of liquid meets the thin gas. Since they are the same material, however, you might have enormous wave crests that evaporate as they rise into the gas, while their troughs draw gas downward and cause it to condense into liquid. That is most likely to happen very near (but slightly below) the triple point in temperature, and would be a grand sight to behold!\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-09-18T01:48:12Z","Content":"\n\u003Cp\u003EWe have to be careful about saying life couldn\u0027t exist in Jupiter\u0027s atmosphere. After all, we all \u0022knew\u0022 that the sunless bottoms of the deep ocean couldn\u0027t possibly support life because there was no sunlight to support photosynthesis... until we found those chemosynthetic ecosystems around \u0022black smokers\u0022 in the late \u002770s. (And, now that I look it up, apparently they found some species of bacteria that could \u003Ca href=\u0022https://en.wikipedia.org/wiki/Green_sulfur_bacteria\u0022 rel=\u0022external nofollow\u0022\u003Ephotosynthesise with the blackbody glow\u003C/a\u003E from those thermal vents. Amazing.)\u003C/p\u003E\u003Cp\u003EI agree that the odds are long against there being life there, but there\u0027s still a chance.\u003C/p\u003E\u003Cp\u003EAs for a human-habitable zone, well, no... not that a human being could get to one thanks to the radiation belts created by the Jovian magnetosphere.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-09-26T02:14:02Z","Content":"\n\u003Cp\u003E1: Objects don\u0027t necessarily sink infinitely into Gas giants, since they contain layers of super-critical fluids and such which would provide buoyancy.\u003C/p\u003E\u003Cp\u003E2: Radiation is not probably relevant except on the dense crust of heavy metals that may form above the liquid metallic hydrogen.\u003C/p\u003E\u003Cp\u003E3: Gasses would probably be stacked in such a way as to make them have liquid layers of substances like methane and water and and whatnot. These would be organized in order of compressed density, but would be organized roughly by molecular weight when not fully compressed. There may be some substances, e.g. methane, which can exist in liquid or solid form deep down, and gas form near the cloud-top, but do not exist in-between. Therefore, it may be possible for two likely completely seperate regions to evolve life, one which is in the thick atmosphere and is limited to gaseous matter, and another which lives deep in an organic ocean and chooses not to venture very far upward or downward due to the lack of food and the toxicity of the environment (e.g., something from the water layer dares not enter the alcohol layer).\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-09-26T02:25:08Z","Content":"\n\u003Cp\u003EIn fact, it may be possible for life to evolve on one of the solid surfaces under one of the oceans, obviously, some substances, such as silicon, water, etc simply don\u0027t solidify down there, but metals and most organic materials certainly could. The physics there would be very odd, if such life gained sentience, it would be unlikely to identify the concept of a perfect vacuum for a long time, CRTs would never be invented, and in fact would not be very useful as eyes would be useless in the murky depths of rubble-pile organic dirt and metal on top of possibly just a lower ocean of a liquid denser than the solid, picture what would happen to mercury, it would be below the crust, but then uranium would be below even that.\u003C/p\u003E\u003Cp\u003ESonar would be critical to any life that did exist there, and guns would be basically useless due to the fact that the bottom layer of ocean would likely be highly viscous.\u003C/p\u003E\u003Cp\u003ELight may be discovered only after advanced thermodynamics, vacuum, etc are discovered, the fact that their world is a rapidly spinning sphere could take a long time as well because the only noticeable effects would be the Coriolis force or odd sonar effects.\u003C/p\u003E\n"},{"CreatedByName":"beck","CreatedById":75592,"CreatedDateTime":"2013-09-26T02:48:07Z","Content":"\n\u003Cp\u003EYou should all read Clark\u0027s \u0022Encounter with Medusa\u0022. The story features the use of a hot air balloon to explore Jupiter.\u003C/p\u003E\n"}]}