{"TopicId":46216,"ForumId":44,"TopicTitle":"Would we colonize a planet already inhabited?","CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-09-17T15:36:57Z","PageNum":1,"Articles":[{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-09-17T15:36:57Z","Content":"\n\u003Cp\u003EAs the title says, I\u0027d we found a habitable planet, but it had life on it already, would we still colonize it?\u003C/p\u003E\u003Cp\u003EI honestly don\u0027t think we should, even if there\u0027s so much as a tiny organism already living there, I say we leave it alone to evolve\u003C/p\u003E\u003Cp\u003EAnd if we colonize a barren planet and then find life there, we should leave immediately afterwards.\u003C/p\u003E\u003Cp\u003EPost your opinions\u003C/p\u003E\n"},{"CreatedByName":"cypher_00","CreatedById":61486,"CreatedDateTime":"2013-09-17T15:51:04Z","Content":"\n\u003Cp\u003EDepends on what kind of life really. If it\u0027s inhabited by a sentient species that is not as developed as us I think we should leave them alone. If it\u0027s only animal lifeforms we could colonize but try not to destroy the native wildlife and fauna. If it\u0027s just microbial life... why the heck not?\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-09-17T16:02:39Z","Content":"\n\u003Cp\u003EShould? No. Would? Well. Ask the Native Americans.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-17T16:05:04Z","Content":"\n\u003Cp\u003EAs things currently stand humans will probably destroy any indigenous life that could compete with us and simply take the place over for its resources. Only a superior species could stop us. Depending on how our interstellar travel works, we\u0027ll either strip all the easily reachable resources and move on, or stay and develop the place into something akin to Earth (we might do that anyway).\u003C/p\u003E\u003Cp\u003EIMO it will take a fundamental shift in how humans as a whole think before we ditch the competitive ways that got us where we are and transition over to an \u0022ethical\u0022 species. It could be argued that would be detrimental to the survival of our own species, but that really depends on who is out there and how we interact with them.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-17T16:52:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAs things currently stand humans will probably destroy any indigenous life that could compete with us and simply take the place over for its resources. Only a superior species could stop us. Depending on how our interstellar travel works, we\u0027ll either strip all the easily reachable resources and move on, or stay and develop the place into something akin to Earth (we might do that anyway).\u003Cp\u003EIMO it will take a fundamental shift in how humans as a whole think before we ditch the competitive ways that got us where we are and transition over to an \u0022ethical\u0022 species. It could be argued that would be detrimental to the survival of our own species, but that really depends on who is out there and how we interact with them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, any resource you can find on an earth-like planet (well, except organics/biomass, I guess), you can get from asteroids at a fraction of the cost assuming you have space-born industry. That is pretty much a given if you are considering going to another star system. And that applies even before taking into account that you would need to lug those resources out of that planet\u0027s gravity well.\u003C/p\u003E\u003Cp\u003EThe asteroid in our own asteroid belt have enough resources to keep Human industry running for thousands of years, and odds are that we will develop the capability to extract those resources long before the capability to go interstellar. So no, we probably won\u0027t be blowing up trees populated by giant smurfs any time soon to dig for unobtanium. \u003C/p\u003E\u003Cp\u003EAs for colonization, we have no idea how life from Earth might react in contact with an alien biosphere. Every living thing there might be deadly poison or an allergen to us. Their biochemistry might be using proteins of opposite chirality, making it incompatible with ours.\u003C/p\u003E\u003Cp\u003EIt might turn out to be easier to take a dead world like Mars and terraform it to our liking than it is to adapt an alien biosphere to make it suitable for us...\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-09-17T16:57:10Z","Content":"\n\u003Cp\u003ELet\u0027s rephrase the question. Is there money to be made?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-17T17:28:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EWell, any resource you can find on an earth-like planet (well, except organics/biomass, I guess), you can get from asteroids at a fraction of the cost assuming you have space-born industry. That is pretty much a given if you are considering going to another star system. And that applies even before taking into account that you would need to lug those resources out of that planet\u0027s gravity well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll have to see just how cost effective asteroid mining is before we compare it to planet-based resource extraction. Another question to ask is whether the species is developing towards space-based living. If not, all those resources need to be shipped planetside, which makes resource extraction on the ground much most cost effective. Not to mention safer in the overall scheme of things. And, as you said, organics/biomass will most likely only be available for exploiting planetside.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EAs for colonization, we have no idea how life from Earth might react in contact with an alien biosphere. Every living thing there might be deadly poison or an allergen to us. Their biochemistry might be using proteins of opposite chirality, making it incompatible with ours.\u003Cp\u003EIt might turn out to be easier to take a dead world like Mars and terraform it to our liking than it is to adapt an alien biosphere to make it suitable for us...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably a lot easier to terraform an alien atmosphere than create one where none existed, especially considering that if there isn\u0027t an atmosphere to begin with, the conditions for supporting one probably don\u0027t exist. If the biochemistry doesn\u0027t work, move on.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-09-17T17:39:45Z","Content":"\n\u003Cp\u003EIt\u0027s unlikely that any pathogens or parasites would affect us on an alien world, because on Earth, all pathogens and parasites evolved alongside their hosts, and it\u0027s unlikely for that to be any different on another Planet.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-17T17:48:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EIt\u0027s unlikely that any pathogens or parasites would affect us on an alien world, because on Earth, all pathogens and parasites evolved alongside their hosts, and it\u0027s unlikely for that to be any different on another Planet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever said anything about pathogens and parasites.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-17T17:51:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EProbably a lot easier to terraform an alien atmosphere than create one where none existed, especially considering that if there isn\u0027t an atmosphere to begin with, the conditions for supporting one probably don\u0027t exist. If the biochemistry doesn\u0027t work, move on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut that\u0027s the point - it might turn out that the only way to make the planet habitable to humans is to completely sterilize it...\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-17T17:51:59Z","Content":"\n\u003Cp\u003EThis is dependent on who is paying. If gov\u0027t or corporations are paying, they\u0027d probably push ahead anyways. If private sector science is paying, never.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-17T17:57:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EBut that\u0027s the point - it might turn out that the only way to make the planet habitable to humans is to completely sterilize it...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo what? The question is whether we would colonize an otherwise inhabited planet, and the answer really depends on how much trouble it is to do so and how much we would get out of the bargain (ala Kerbart\u0027s statement). If we\u0027re still a planetside species and the biosphere is close enough to our own, and the inhabitants aren\u0027t too smart, there is no reason not to seed the place with our own bio-engineered goo to make the place habitable to us, or even to bio-engineer ourselves to live there. It might even be worth it to seed a very toxic planet to eventually handle us, just keep tabs on the progress and alter as we go, come back in a few thousand years.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-09-17T18:35:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EIf gov\u0027t or corporations are paying, they\u0027d probably push ahead anyways. If private sector science is paying, never.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is private sector science not part of the private sector? (And how are corporations not private sector?)\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-09-17T19:21:45Z","Content":"\n\u003Cp\u003EHumans\u0026gt;everything else\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-09-17T19:36:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EThis is dependent on who is paying. If gov\u0027t or corporations are paying, they\u0027d probably push ahead anyways. If private sector science is paying, never.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is this private sector science of which you speak? Are you talking about university labs, which are funded by grants from... governments and corporations? Are you talking about labs at private businesses, which have to justify the business side of the research they\u0027re conducting? Hell, I work at a privately owned \u0022national\u0022 lab that is funded almost entirely by the DOE. Research costs money. Someone has to pay for it. Private sector science is just as compromised by incentives and constituencies as any other human endeavor.\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-09-17T20:15:38Z","Content":"\n\u003Cp\u003EIt may turn out that all worlds suitable for human colonization are inhabited (it probably is so; where is the copious amount of oxygen in the air coming from?), in which case, we should try to section out an area for the humans and leave the rest for the indigenous population. What will probably happen is exactly the opposite: the aliens will be sectioned off instead.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2013-09-17T20:45:15Z","Content":"\n\u003Cp\u003EThe first planet that we will have to terraform into something that can support us will probably be Earth.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-17T22:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EThe first planet that we will have to terraform into something that can support us will probably be Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat will provide valuable experience in dealing with toxic environments. I have high hopes for humanity\u0027s survival.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-18T00:05:15Z","Content":"\n\u003Cp\u003EYou can think of it like this - everything we\u0027ve done in history would repeat again. We\u0027re a genocidal species.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-18T01:36:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EYou can think of it like this - everything we\u0027ve done in history would repeat again. We\u0027re a genocidal species.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe space faring countries of Earth are not all that genocidal. For the most part, we are over that phase. I think we would be very very careful around a life-bearing planet precisely because we are an adaptable and intelligent species that learns from history.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-18T02:03:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EThe space faring countries of Earth are not all that genocidal. For the most part, we are over that phase. I think we would be very very careful around a life-bearing planet precisely because we are an adaptable and intelligent species that learns from history.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t be offended, but that\u0027s naive thinking.\u003C/p\u003E\u003Cp\u003EThis world is not governed by healthy respect based on good deeds. It\u0027s governed by force. Most people are violent and stupid. If you don\u0027t enforce law, they will steal, murder, torture, destroy, and the people who enforce the law are mostly just like that, except that, unlike the general mob, they have the need to be disciplined, i.e. they prefer to be a pack of wolves, so you can use various goods (material like money and resources or conceptual like honor) to keep them loyal. The rest of the population is a mindless bunch of parasites that just wants to eat, drink and screw around.\u003C/p\u003E\u003Cp\u003EIt\u0027s the tiny tiny fragment of the whole population that does amazing things, so that someone can make a totally misleading and biased youtube video \u0022Humans are awesome\u0022. We are not awesome. We\u0027re, overall, a plague on this planet. I have no doubt that we\u0027d destroy a civilization if we encountered one, given the chance. We don\u0027t even need motives. We just like to destroy stuff. With motives it only gets worse.\u003C/p\u003E\u003Cp\u003EIf there are intelligent life forms out there who are aware of our presence, I don\u0027t blame them for not contacting us.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-18T02:13:27Z","Content":"\n\u003Cp\u003EOne\u0027s outlook on the value of humanity is a matter of opinion. My thinking is not naive, it is deliberately optimistic because when it comes to matters of opinion, culture or anything else that exists solely in the minds of people, we literally make it up as we go along. Whatever we collectively think we do eventually becomes what we actually do.\u003C/p\u003E\u003Cp\u003EIn the words of Mahatma Gandhi, Be the change you want to see in the world.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-18T02:21:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EThe first planet that we will have to terraform into something that can support us will probably be Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that would be the hard way of doing it. Terraforming could take thousands of years, but human habitat design can be adapted to the local climate immediately. Look at what we do here, when we go live in antarctica, we don\u0027t terraform it, we just build a well-insulated base with a reliable power supply and create a reasonable environment inside it. \u003C/p\u003E\u003Cp\u003EWhether we decide to inhabit the surface of an exoplanet, assuming we get a generation ship in orbit around the place, depends on how easy it is to build habitats there, vs just taking the water and minerals from the surface and expanding our ship in orbit.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-18T02:25:29Z","Content":"\n\u003Cp\u003EI do not agree. Historical experience dwarfs any opinions. The history speaks for itself and so far it has always been repeating, not only the crimes, but also the naive thinking that the current society is modern and will not do bad stuff. Too much pride, too little deeds. Lots of pomp, too little substance.\u003C/p\u003E\u003Cp\u003EIs there a reason to think we\u0027re more good today? Yes, socially evolved a bit more. Good \u003Cem\u003Eenough\u003C/em\u003E? LOL, no. No way. Miles and miles away from that.\u003C/p\u003E\u003Cp\u003EEverything good we possess at the moment is so tiny compared to the necessary amount and is very delicate, weak and fragile.\u003C/p\u003E\u003Cp\u003EI\u0027m an optimist, too, but also a realist. I know stuff probably won\u0027t be better, but I hope it will be. Your best chances are to make your local environment acceptable. The rest is too chaotic.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-09-18T05:15:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EDon\u0027t be offended, but that\u0027s naive thinking.\u003Cp\u003EThis world is not governed by healthy respect based on good deeds. It\u0027s governed by force. Most people are violent and stupid. If you don\u0027t enforce law, they will steal, murder, torture, destroy, and the people who enforce the law are mostly just like that, except that, unlike the general mob, they have the need to be disciplined, i.e. they prefer to be a pack of wolves, so you can use various goods (material like money and resources or conceptual like honor) to keep them loyal. The rest of the population is a mindless bunch of parasites that just wants to eat, drink and screw around.\u003C/p\u003E\u003Cp\u003EIt\u0027s the tiny tiny fragment of the whole population that does amazing things, so that someone can make a totally misleading and biased youtube video \u0022Humans are awesome\u0022. We are not awesome. We\u0027re, overall, a plague on this planet. I have no doubt that we\u0027d destroy a civilization if we encountered one, given the chance. We don\u0027t even need motives. We just like to destroy stuff. With motives it only gets worse.\u003C/p\u003E\u003Cp\u003EIf there are intelligent life forms out there who are aware of our presence, I don\u0027t blame them for not contacting us.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWithout law people will likely shoot you as they fear you are an bad guy. \u003C/p\u003E\u003Cp\u003EMost people are decent, look around you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd yes just an tiny tiny fragment of the whole population that does amazing things, things most does like raising kids are not amazing but common. \u003C/p\u003E\u003Cp\u003EIt\u0027s plenty of exceptions and in an raw fight for power some psychopath is more likely to end up on top than someone decent. Again its blocks here someone who is too insane would have issues getting into an position where he could fight for power on an grand scale like taking over an country. Again is happens look at Hitler and Stalin. \u003C/p\u003E\u003Cp\u003EOne major thing has changed the last hundred years, the concept of humanity. Historical anybody outside your tribe was an enemy or target, most people don\u0027t think like that anymore. Yes they still try to cheat you but that is business.\u003C/p\u003E\n"}]}