{"TopicId":46212,"ForumId":16,"TopicTitle":"The Mun","CreatedByName":"klarish","CreatedById":82916,"CreatedDateTime":"2013-09-17T13:24:37Z","PageNum":1,"Articles":[{"CreatedByName":"klarish","CreatedById":82916,"CreatedDateTime":"2013-09-17T13:24:37Z","Content":"\n\u003Cp\u003ESo I\u0027ve been playing KSP for 3 days and I haven\u0027t gotten to the Mun yet. I\u0027ve tried all the tutorials, I\u0027ve tried MechJeb, IVE TRIED EVERYTHING! Can someone tell me an easy stragety to getting to other planets?\u003C/p\u003E\n"},{"CreatedByName":"Xetalim","CreatedById":64539,"CreatedDateTime":"2013-09-17T14:03:17Z","Content":"\n\u003Cp\u003EFor mun:\u003C/p\u003E\u003Cp\u003EFirst make a craft with enough delta V, use mechjeb or flight engineer for calculating that.\u003C/p\u003E\u003Cp\u003ELaunch into a stable orbit (100X100km)\u003C/p\u003E\u003Cp\u003EWait until mun rises on the horizon when looking forward and pointing to prograde.\u003C/p\u003E\u003Cp\u003EBurn until you get an encounter.\u003C/p\u003E\u003Cp\u003EBurn retrograde when you are at the apoapsis.(can be spelled wrong, i hope you know what i mean) until you get a stable orbit.\u003C/p\u003E\u003Cp\u003EThat at least is how to get to mun.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-09-17T14:10:01Z","Content":"\n\u003Cp\u003EPlay around a bit with maneuver nodes. Also, could you send a screenshot? It\u0027d help a lot.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-17T14:17:08Z","Content":"\n\u003Cp\u003E4,500m/s to get to orbit, 850m/s to get to the Mun, and about 350~400m/s to circularize at the Mun. You\u0027ll need some 600m/s to land, should make it 1000m/s for safety. Double that to get back to orbit. Another 850~1000m/s to get back into Kerbin aerocapture, more if you want to circularize or whatever. There\u0027s your mission delta-V budget. Combined, all the stages on your craft must meet that total.\u003C/p\u003E\u003Cp\u003EOnce circularized around Kerbin at 75~80km, go into the map view and rotate the camera until the Mun is about 45 degrees to the right off the line running from you through Kerbin. Create a maneuver node there and drag it out until you get an encounter. Transfer, circularize, land, do whatever, launch, (rendezvous and dock,) create a maneuver node at the point in your orbit approximately between the Mun and Kerbin, drag it out until you get a Kerbin encounter that fits your mission profile, burn, return.\u003C/p\u003E\n"},{"CreatedByName":"matt_cain","CreatedById":63941,"CreatedDateTime":"2013-09-17T14:17:13Z","Content":"\n\u003Cp\u003EThere are tons of great tutorials (other than the in-game ones) for reaching the mun out there. Some are on this forum but there are also a bunch on YouTube. If you\u0027ve tried those for inspiration, could you describe where you think your problem is? Are you having trouble getting the payload into orbit, having trouble intercepting the mun, trouble landing on the mun without crashing, getting back, etc? Thanks and good luck with your mun program.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-09-17T14:18:04Z","Content":"\n\u003Cp\u003EThe question is what exactly you tried and what were your mistakes.\u003C/p\u003E\u003Cp\u003EIf your ship is too weak, you can try Kerbal X stock craft, it is readily available and strong enough to get to either of the two moons and back, unless you waste too much fuel (as I did which led to my first rescue mission). You can also progress in steps and always try next step after you can handle the previous step efficiently enough - orbit Kerbin, transit to Mun, orbit Mun, landing. Or I\u0027d suggest you to try Minmus first, it is further away but the gravity is much less there and it\u0027s easier to land (particularly on the ice).\u003C/p\u003E\n"},{"CreatedByName":"RocketYeah","CreatedById":54474,"CreatedDateTime":"2013-09-17T14:25:28Z","Content":"\n\u003Cp\u003EThe in game tutorial \u0022To the Mun, Part 1\u0022 is quite good, if you follow the instructions it gives you. If by \u0022tried all the tutorials\u0022 you mean looked on YouTube or the wiki that is, other wise ignore this haha \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-09-17T15:50:33Z","Content":"\n\u003Cp\u003EI\u0027ve released an in-game moon travel tutorial a few days ago. Perhaps you might want to try this out. (see signature)\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-09-17T16:24:51Z","Content":"\n\u003Cp\u003EWhat do you mean by \u0022all\u0022 the tutorials? Have you tried mine? \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25029-A-moon-rocket-for-newbies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25029-A-moon-rocket-for-newbies\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Andr0s","CreatedById":80489,"CreatedDateTime":"2013-09-17T16:33:12Z","Content":"\n\u003Cp\u003EI have to admit Project: Munraker was a fun one for me. On a stock KSP (No MechJeb etc) it took me a weekend worth of playing - about 12 hours - to:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cdiv\u003E#1 orbit Mun and return to KSC\u003C/div\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cdiv\u003E#2 drop a satellite in a nice 10K orbit around Mun\u003C/div\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cdiv\u003E#3 land an unkerbaled rover on the Mun\u003C/div\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cdiv\u003E#4 land a kerbaled craft on Mun and return it to KSC.\u003C/div\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI found Mun to be easy to achieve once I learned basics of Orbit circularization. Bring Apoapsis to Mun orbit, circularize a bit above/below it depending on whether you\u0027re trying to catch up to Mun or waiting for it to catch up to you, and you\u0027re 90% there. The fact that Mun has a perfectly circular equatorial orbit relative to Kerbin makes it an easy target. Minimus with its inclined orbit is proving far more annoying to me...\u003C/p\u003E\n"},{"CreatedByName":"JiWint","CreatedById":78150,"CreatedDateTime":"2013-09-17T16:50:55Z","Content":"\n\u003Cp\u003Eall you need is a simple lander (lv 909 engine),and 6 o FL-8000 tanks with 3 engines\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-09-17T21:34:17Z","Content":"\n\u003Cp\u003EGeneral easy steps after lots of practice;\u003C/p\u003E\u003Cp\u003E1. launch into equatorial Kerbal orbit of 100K\u003C/p\u003E\u003Cp\u003E2. Set up a maneuver mode for a burn where the apogee intercept Mun orbit.\u003C/p\u003E\u003Cp\u003E3. Move the maneuver mode until you get a Mun encounter\u003C/p\u003E\u003Cp\u003E4. Fine tune the maneuver until you get an efficient capture, but not one that flings you into escape velocity should you miss the next step\u003C/p\u003E\u003Cp\u003E5. Point your ship into the maneuver marker on the Navball and fire the engine when the clock reaches about half of the burn time required. Be sure to throttle down as the expanding orbit reaches the influence of Mun since the actual encounter will be brief.\u003C/p\u003E\u003Cp\u003E6. Shut down as soon as you have a capture.\u003C/p\u003E\u003Cp\u003E7. When you are under the influence of Mun, set up a retro burn to place you into orbit.\u003C/p\u003E\u003Cp\u003EWhen you want to return to Kerbal, set up a maneuver burn that points your escape against Mun orbital direction. Fine tune that maneuver to give you a reentry window into Kerban\u0027s atmosphere, about 15,000 meters. That is the most efficient way to get back home.\u003C/p\u003E\u003Cp\u003EAnd, the size of the rocket doesn\u0027t matter. The size of the payload sent does. This makes Mun orbit easily as it has enough fuel after reaching Kerbal orbit for the trip.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TD8RZk9.jpg\u0022 alt=\u0022TD8RZk9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is what a return to Kerbal burn should look like in map mode.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/x7EEqHn.jpg\u0022 alt=\u0022x7EEqHn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA larger version with a lander\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YPIScwa.jpg\u0022 alt=\u0022YPIScwa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat landed on Minmus.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s05XvqG.jpg\u0022 alt=\u0022s05XvqG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have since redesigned to make it less top heavy.\u003C/p\u003E\n"},{"CreatedByName":"klarish","CreatedById":82916,"CreatedDateTime":"2013-09-17T22:45:57Z","Content":"\n\u003Cp\u003EMy troubles are getting to and into Mun\u0027s Orbit.\u003C/p\u003E\u003Cp\u003EThank you, I will try that.\u003C/p\u003E\u003Cp\u003EI have heard of Minimus\u0027s lower gravity before. But, how many stages should I use?\u003C/p\u003E\u003Cp\u003EP.S. Can someone provide a download for a plane or UFO that can reach The Mun?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-18T02:22:33Z\u0022 title=\u002209/18/2013 02:22  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 18, 2013\u003C/time\u003E by stupid_chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-09-18T00:56:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klarish\u0022 data-cite=\u0022klarish\u0022\u003E\u003Cdiv\u003EI have heard of Minimus\u0027s lower gravity before. But, how many stages should I use?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou will notice that the Minmus lander is three stages. It likely has enough fuel left to return to Kerban but no parachute to recover. The probe that orbited Mun is two stage but is much lighter as it has no thruster pack or landing legs and therefore needed less fuel to reach its goal. \u003C/p\u003E\u003Cp\u003EThe number of stages is all in the design and payload size being delivered.\u003C/p\u003E\u003Cp\u003EDo Mun first. Practice getting efficiently into 100k orbit, the Mun encounter, orbit and return. Next is the challenge of Minmus intercept since it is inclined and smaller. Then start designing bigger and better to acomplish your goals.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-09-18T09:57:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klarish\u0022 data-cite=\u0022klarish\u0022\u003E\u003Cdiv\u003EP.S. Can someone provide a download for a plane or UFO that can reach The Mun?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can start with Kerbal X stock craft. When in construction building, choose Load and select it from the list.\u003C/p\u003E\u003Cp\u003EIt may not be good enough for you to land on Mun and return (experienced players can do that but newbies waste fuel too much), but you should be able to get to Mun or Minmus orbit and back to Kerbin with it.\u003C/p\u003E\u003Cp\u003EThen you can try experimenting with it, e.g. adding more fuel, more stages, or more boosters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klarish\u0022 data-cite=\u0022klarish\u0022\u003E\u003Cdiv\u003EMy troubles are getting to and into Mun\u0027s Orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1/ Get in Kerbin orbit.\u003C/p\u003E\u003Cp\u003E2/ Switch to Map view, click on Mun and select it as target\u003C/p\u003E\u003Cp\u003E3/ Check the two yellow AN and DN arrows. If they show values above 1.0, you need to align your orbit planes. If the value is small, skip to point 9/\u003C/p\u003E\u003Cp\u003E4/ Add a maeuver node to one of the AN/DN nodes.\u003C/p\u003E\u003Cp\u003E5/ Pull/push normal markers (pink) until you get the AN/DN values between -1.0 and 1.0 (the closer to zero the better)\u003C/p\u003E\u003Cp\u003E6/ Orient your ship towards the blue marker\u003C/p\u003E\u003Cp\u003E7/ When the time is up, execute the maneuver (time to execute and time needed are beside navball)\u003C/p\u003E\u003Cp\u003E8/ Go to map view, click on the used maneuver and delete it\u003C/p\u003E\u003Cp\u003E9/ Add a maneuver anywhere on your orbit and pull the Prograde marker (yellow) until you get ellipse reaching Mun\u0027s orbit.\u003C/p\u003E\u003Cp\u003E10/ Drag the maneuver by the middle circle until you get encounter with Mun.\u003C/p\u003E\u003Cp\u003E11/ Orient your ship to point directly at the blue marker\u003C/p\u003E\u003Cp\u003E12/ Wait till the time to execute the maneuver is half the time estimate (values beside the navball). Or just execute it when T=0\u003C/p\u003E\u003Cp\u003E13/ Time accelerate until you get to Mun\u0027s vicinity\u003C/p\u003E\u003Cp\u003E14/ add a maneuver to the Mun periapsis marker. If there is no such marker, just put a maneuver anywhere in Mun\u0027s part of the trajectory\u003C/p\u003E\u003Cp\u003E15/ pull the retrograde yellow marker until you get an orbit\u003C/p\u003E\u003Cp\u003E16/ execute that maneuver (see points 11-12)\u003C/p\u003E\n"},{"CreatedByName":"aeTIos","CreatedById":17032,"CreatedDateTime":"2013-09-18T10:08:33Z","Content":"\n\u003Cp\u003EJust try hard, I spent weeks of playing till I first \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Elanded on\u003C/span\u003E impacted Mun. (Even though that was in .12 or .13)\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-09-18T11:30:30Z","Content":"\n\u003Cp\u003EThing to remember is this game has a HUGE learning curve. I remember getting extremely frustrated at first, now I\u0027m only moderately frustrated (heh). These guys are throwing all sorts of numbers and formula\u0027s at you and if you\u0027re like me, it\u0027s all \u0022rocket science\u0022 babble and I\u0027m not able to follow it. You\u0027ll fail many more times than you\u0027re going to succeed, but eventually you do find methods that work for you.\u003C/p\u003E\n"}]}