{"TopicId":46413,"ForumId":16,"TopicTitle":"Uneven Thrust for Spaceplanes","CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-24T17:25:13Z","PageNum":1,"Articles":[{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-24T17:25:13Z","Content":"\n\u003Cp\u003EThe spaceplane I\u0027m working on performs generally pretty well, getting into orbit and such, but during the ascent, I find uneven thrust between the two larger Sabre engines in the middle. The one on the right will have a thrust of 500, and the left will have 480 (the numbers change with the atmosphere, but the ratio stays more or less the same). This causes the plane to shift to the left. RCS does a fine job compensating, but the higher I go, the more significant the difference, and it shifts more and more. \u003C/p\u003E\u003Cp\u003ENotably, when I switch to rocket mode, the thrust becomes even amongst the engines. I\u0027m assuming it\u0027s some kind of air-intake thing.\u003C/p\u003E\u003Cp\u003EFor those of you who don\u0027t use this mod, the big Sabre engines are in the middle and they have the ability to switch from air-breathing jet engines to rocket fuel engines with an action group.\u003C/p\u003E\u003Cp\u003EAny thoughts? Picture below. I\u0027m happy to include more if needed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TD8Xbvh.jpg\u0022 alt=\u0022TD8Xbvh.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-24T17:37:16Z","Content":"\n\u003Cp\u003EThe question is what is your slip angle when climbing, are you flying slightly sideways. If so that will affect the air intake of the engines, and cause uneven thrust between them. The easiest way to fix this is to mount your larger SABREs on the main body and this will help some, it will also help clean up the lines of the aircraft. So you won\u0027t need as many struts that far out to hold the weight of the SABRE Ms. Also I would ditch those intakes on the ends of the LV-Ns, they are only good at subsonic speeds, use the variable geometry intakes they have less drag and are far more useful at higher speeds.\u003C/p\u003E\n"},{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-24T17:42:52Z","Content":"\n\u003Cp\u003EWow thanks for the quick and thorough response Hodo. I\u0027ll definitely try out some of those recommendations. I\u0027d love to keep the engines out to the side, to keep it looking kinda-sorta like the skylon, but I\u0027ll definitely get rid of the air intakes you mentioned, since i went with a \u0022more is better\u0022 approach. And aesthetics, for that matter. \u003C/p\u003E\u003Cp\u003EIs there a difference between the \u0022DSI Diverterless supersonic Inlet\u0022 (the ones I have now, the low-profile ones), and the other two?\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-24T18:09:42Z","Content":"\n\u003Cp\u003EHere is one of my fastest climbing SSTOs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img716/8517/ylte.jpg\u0022 alt=\u0022ylte.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here is my workhorse SSTOs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img801/1434/br3i.jpg\u0022 alt=\u0022br3i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img51/8121/h7zh.jpg\u0022 alt=\u0022h7zh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere are some design differences but not much with mine due to I found what works for me and stuck with it. \u003C/p\u003E\u003Cp\u003EAnd the DSI intake is good but is really not much better than the standard SABRE S intake. I like it for when I want cleaner lines or a sleaker look.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-09-24T18:41:26Z","Content":"\n\u003Cp\u003EThe game doesn\u0027t assign specific intakes to engines. It takes the sum total intake and then subtracts each engines consumption. The last engine gets starved if there isn\u0027t a surplus.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-24T18:46:02Z\u0022 title=\u002209/24/2013 06:46  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 24, 2013\u003C/time\u003E by BubbaWilkins\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-24T19:52:46Z","Content":"\n\u003Cp\u003EAh man, I love those spaceplanes. Yeah, I think my biggest issue right now is how the two engines are set up on the wings. I can still go high and fast enough that when i switch to rocket mode, i can get into orbit (with a small payload), but i feel like every change I make just makes it worse. I\u0027m sure we all know that feeling. And yeah, even the slightest roll in one direction or the other dramatically changes the thrust im getting. Though a successful ship, i might have to start back at the drawing board. Thanks for your help.\u003C/p\u003E\n"},{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-25T14:04:59Z","Content":"\n\u003Cp\u003EThanks for everyone\u0027s help. Here\u0027s an updated craft I made yesterday. It can take 18 tons up into orbit with a nice margin of error. I still struggle with flying at high altitudes and thrust differences. Fortunately, thing go well if I just switch to rocket mode as things get hairy, and then the plane will fly stable up to orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/COeTo2p.jpg\u0022 alt=\u0022COeTo2p.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-09-25T17:41:58Z","Content":"\n\u003Cp\u003EGood looking craft. If I may make some suggestions to help with your part counts and weight savings. \u003C/p\u003E\u003Cp\u003EYou can reduce the numbers of RCS thrusters on the sides of the nose to one per side. And for that matter everywhere where you have more than one in a location you can reduce that to one. It will slow down your reactions a bit but unless you are making a space fighter you don\u0027t need to move that fast in space. I try and mount them on the flatter parts of it so they are inline with the aircraft. This reduces drift when use in space. You can also get rid of the solar panels if you have the retractable panels, and the smaller cased ones would work just fine. I personally like to stick a pair of nuke reactors in the cargobay, on one of the walls to generate power so I don\u0027t have to worry about being on the dark side of anything. \u003C/p\u003E\u003Cp\u003ENot sure if you have your wings strutted if they are needed.\u003C/p\u003E\n"},{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-09-30T01:33:12Z","Content":"\n\u003Cp\u003EThanks Hodo. I had a long weekend away and I wasn\u0027t able to respond. Your suggestions are definitely good. I have a lot of RCS to counter the problem this thread was originally about. mostly, they are for keeping the thing level at the 20,000m altitude area. Nuke reactors are a good idea. I\u0027ll have to try that one out. I guess overall, I don\u0027t have too many issues with part counts. My computer can handle quite a bit, and i dont like extendables because they break up in the atmosphere, and I always take forever to land. what might be better for me is using one of the solar panels from Bobcat, the big radial mounted ones, since clearly im not apposed to mods. However, my solar panels spread is clearly not ideal.\u003C/p\u003E\u003Cp\u003EFinally, here is a pic of the payload I took up. I sent it on a Dres-and-back mission. On a not-spaceplane note, I was proud of using the stretchy-tanks to fill in that empty space around the nuclear engine, as well as using them as landing gear. Also two mini-satellites that are in orbit around Dres right now. though, I would recommend attaching actual landing gear to them, as the landing was a bit rough.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RKYS4DC.png\u0022 alt=\u0022RKYS4DC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0sWgN4t.png\u0022 alt=\u00220sWgN4t.png\u0022\u003E\u003C/p\u003E\n"}]}