{"TopicId":46541,"ForumId":25,"TopicTitle":"CLOSED -- Flying Duna AGAIN (Thanks for Participating)","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-25T21:21:12Z","PageNum":6,"Articles":[{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-26T04:11:04Z","Content":"\n\u003Cp\u003EThe last two I hyperedited there. I dont quite have the patience you do for interplanetary transfers, or actually calculating what the performance should be based on kerbin performance. \u003C/p\u003E\u003Cp\u003EThat said, the second design (not the massive one) is functionally identical with my first, so launching it wouldnt be out of the question. That third one, though... I mean, with enough struts and mainsails its possible, sure, but my computer would explode everywhere. \u003C/p\u003E\u003Cp\u003EGha. Now Im going to have to try. Not today, though.\u003C/p\u003E\u003Cp\u003EThe problem that I have is that installing interstellar just by itself makes this PC run out of memory. You have a larger part pool to pick from, but I can use more from my limited pool at once, heh.\u003C/p\u003E\u003Cp\u003EI suppose I could just grab a few parts, like the thermal turbos. Orrr.... I wonder if I could make a tiny little plane powered by a VASMIR or something. That way I wouldnt have to worry about intake air, just lift. Lift I can do.\u003C/p\u003E\u003Cp\u003EAnyway, flying on duna is lots of fun. It actually feels like I am designing a plane. On kerbin, just about every plane I have ever made has a TWR\u0026gt;1, which is silly. Even that huge flying wing could fly straight up on kerbin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T04:18:48Z\u0022 title=\u002211/26/2013 04:18  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-26T04:49:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EThe last two I hyperedited there. I dont quite have the patience you do for interplanetary transfers, or actually calculating what the performance should be based on kerbin performance. \u003Cp\u003EThat said, the second design (not the massive one) is functionally identical with my first, so launching it wouldnt be out of the question. That third one, though... I mean, with enough struts and mainsails its possible, sure, but my computer would explode everywhere. \u003C/p\u003E\u003Cp\u003EGha. Now Im going to have to try. Not today, though.\u003C/p\u003E\u003Cp\u003EThe problem that I have is that installing interstellar just by itself makes this PC run out of memory. You have a larger part pool to pick from, but I can use more from my limited pool at once, heh.\u003C/p\u003E\u003Cp\u003EI suppose I could just grab a few parts, like the thermal turbos. Orrr.... I wonder if I could make a tiny little plane powered by a VASMIR or something. That way I wouldnt have to worry about intake air, just lift. Lift I can do.\u003C/p\u003E\u003Cp\u003EAnyway, flying on duna is lots of fun. It actually feels like I am designing a plane. On kerbin, just about every plane I have ever made has a TWR\u0026gt;1, which is silly. Even that huge flying wing could fly straight up on kerbin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad you finally found a challenge to put your not-inconsiderable aircraft design skills to use...\u003C/p\u003E\u003Cp\u003EI think I\u0027ve finally got a working SSTABK design, though. The final version of my \u0027Blackhawk\u0027, as I\u0027ve named the final version, is probably my highest-lift small plane design ever- yet due to the very thick wings it is still in a very compact (and controllable) package. It has great maneuverability- and begins to hit its prime performance above 7800 meters on Kerbin- which not coincidentally is the air pressure equivalent of just about sea level on Duna... And, finally, it has a TWR of more than 2 when it activates its 5 LFO-fueled engiens (killing my framerate in the process) to get that last kick of speed out of the atmosphere.\u003C/p\u003E\u003Cp\u003EHere are some screenshots of it during its initial climb on Kerbin:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Jh7Km\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s currently running in the background, and is at 11,000 meters and climbing quite rapidly with a just 7 degree heading- so it won\u0027t be too long now before it reaches max altitude and I push it into orbit. After that, the rest is cake- it just needs to make a couple refueling pit-stops (one just after reaching orbit- which uses up all its LFO mix, and one in orbit of the Mun or Minmus before its transfer burn).\u003C/p\u003E\u003Cp\u003E*Shudder* I wonder what this design would perform like with an UPGRADED fission reactor, or a FUSION reactor! (I could increase my thrust by at least 50-100% with fusion- without adding any weight, though the reactor fuel doesn\u0027t last nearly as long- and the required tech node is very expensive and advanced. I\u0027m able to finally see it now though- I just need 2000 more Science- which means sending some Jool-system probes most likely...)\u003C/p\u003E\u003Cp\u003EAnyways, my design will actually have to wait quite a while for its transfer window to Duna... The last one is pretty much just closing now (and it only can pack about 1200 Delta-V, not enough for anything more than a low-energy transfer with Aerocapture on Duna from Munar or Minmus orbit...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003EEDIT: By the way, I\u0027m sorry if I sounded a little bitter before. It\u0027s just... You do realize I had a thermal turbojet plane design (the Eagle Mk2) already en-route to Duna with a 31,250 meter altitude ceiling on Kerbin and the capability to reach a speed of over 1000 m/s at that height (faster than orbital speed on Duna) when you posted that first, sickeningly-laggy 20-seat design that basically raped the Scoreboard, right? I was poised to sweep into first place, and then... Ughhh... The Eagle Mk2 would have to cruise at 14,000 meters on Duna just to meet that score (and, while it should be more than capable of that altitude form a TWR and lift perspective, its one giant atmosphere intake probably isn\u0027t nearly sufficient for the job now that KSP Interstellar nerfed the 1.25 meter level-2 fission reactor ISP...)\u003C/p\u003E\u003Cp\u003EOh well. The Eagle Mk2 wasn\u0027t a SSTDABK, and she did handle a little poorly... My \u0027Blackhawk\u0027 design should take the scoreboard nonetheless- if you don\u0027t manage to swamp it with a 40-Kerbal mega-design my CPU would die simulating first...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T05:05:09Z\u0022 title=\u002211/26/2013 05:05  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-26T05:24:16Z","Content":"\n\u003Cp\u003EEEK!\u003C/p\u003E\u003Cp\u003ETurns out the TWR calculator included in MechJeb was a little over-optimistic to say the least: the Blackhawk\u0027s TWR with the rocket engines engaged is only a little over 1...\u003C/p\u003E\u003Cp\u003EAlso, the ISP nerfs on the 1.25 meter level-2 fission reactors were worse than I thought- the plane is already losing thrust due to low IntakeAtm levels at 16,000 meters- with a 2.5 meter intake and two 1.25 meter intakes! Turns out I was wrong to predict it would have a similar cruising altitude to the Eagle, due to its performance at lower altitudes (the wealth of experience I\u0027ve built up with these thermal turbojet designs says it would have the same 30,000 meter cruising altitude based on how it was doing- but that was when the ISP was 33% higher than it is now...)\u003C/p\u003E\u003Cp\u003EI might have to upgrade the design with an additional pair of thermal turbojets, some extra intakes, and some parachutes (to ensure safe landing on Duna) if this version doesn\u0027t make it... This also worries me about the Eagle Mk2\u0027s performance - since while previously it could cruise at 31,250 meters with just its one 2.5 meter intake, now it might have trouble flying at high-altitude on Duna at all due to the intake nerfs...\u003C/p\u003E\u003Cp\u003EI\u0027ll see what happens with this attempt with the Blackhawk, and report...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EUmm, nope. The nerfed ISP values, and altered thrust curves with climbing altitudes are really messing with my designs... The Blackhawk can only maintain a *measly* 16,000 meter cruising altitude- whereas the Eagle Mk2 was able to maintain 30,000 meters with similar TWR, similar lift, and similar mass before the KSP Interstellar update... Darn, I may need the upgraded fission reactors (at the very least) or fusion reactors to make the design work...\u003C/p\u003E\u003Cp\u003EFor that matter, to counteract the nerfs to the thermal tubojets, I\u0027ll probably also have to take to using the new Thorium reactor fuel (which is more powerful, but high-maintenance) if I continue using fission reactors (fusion reactors require an extensive infrastructure of deuterium centrifuges- which require oceans to work- and tritium breeder reactors to be sustainable in-situ. If I use fusions, I\u0027ll probably be hauling regular shipments of deuterium and tritium out to Duna from Kerbin to keep my Duna planes in the air... At least it\u0027s an extremely lightweight reactor fuel- being nothing more than rare/unstable hydrogen isotopes...)\u003C/p\u003E\u003Cp\u003EEDIT #2:\u003C/p\u003E\u003Cp\u003EI call 16,000 meters measly- but that\u0027s still better than the Hummingbird, while carrying a cargo of 12 Kerbals, and over 5.4 tons of LFO mix- enough to make orbit if I could get up high enough...\u003C/p\u003E\u003Cp\u003EI\u0027ll definitely consider using a stripped-down version of the Blackhawk (I think I\u0027ll call it the \u0027Bluejay\u0027) to take the #1 slot on the Scoreboard if nothing else (if Steven doesn\u0027t come up with an even better design before then), since without all the LFO, if it rode there on a rocket, it could definitely perform quite well on Duna (probably better point-wise than as a SSTDABK, in fact)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T05:57:08Z\u0022 title=\u002211/26/2013 05:57  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-26T07:05:30Z","Content":"\n\u003Cp\u003EOI! It looks like I was being a bit too hard on my plane design. Far too hard, in fact.\u003C/p\u003E\u003Cp\u003EI was expecting my new airframe to lift crew capacity for 12 Kerbals AND SSTABK-capable ascent system to the same height as I could previously only achieve with a plane with crew capacity for just 4 Kerbals and no ascent system...\u003C/p\u003E\u003Cp\u003EMuch improved as my new airframe design might have been, it just wasn\u0027t up to the task- at least not with only a level-2 fission reactor and level-1 thermal turbojet (both parts have an additional upgrade at Fusion Power- which also unlocks the much more powerful, but fuel-hungry, fusion reactors).\u003C/p\u003E\u003Cp\u003EHowever it WAS up to the task of competing with the Eagle Mk2\u0027s performance, with crew capacity for 12 Kerbals instead of 4 (Kerbals are weightless when inside crew compartments- unlike while in Command Chairs- so there is no need for me to hire 20 additional Kerbals just for a test-flight- or to make claim to the crew capacity points for the Challenge for that matter...)\u003C/p\u003E\u003Cp\u003EHere, I present the \u0027Bluejay\u0027- a version of the Blackhawk without the heavy rocketry for attempted SSTDABK.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xRZCo\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess this means I\u0027ll probably be sending a copy of the \u0027Bluejay\u0027 (or maybe a further-improved version) to Duna if the Eagle Mk2 doesn\u0027t outperform the current Leaderboard...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T07:54:39Z\u0022 title=\u002211/26/2013 07:54  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-26T17:49:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EI have a request... make a leader board for ... 100% stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*Darth Vader Voice*\u003C/p\u003E\u003Cp\u003ECome over to the mod side Sirine. It is unavoidable. It is your destiny...\u003C/p\u003E\u003Cp\u003ESeriously though, there are a lot of great mods out there, and they have a lot of cool features. Used properly, many of them add realism to the game, and expand its scope. You should really give some of the mods a try...\u003C/p\u003E\u003Cp\u003EAs for my planes- please remind me to post a craft files thread and a link to them soon. I\u0027ve designed a whole fleet of Duna-capable planes (though some models perform better than others) and it would really be a shame to lose all of them to a computer-crash or something...\u003C/p\u003E\u003Cp\u003EThis is my latest model- the \u0027Blackhawk Mk2\u0027. It\u0027s another attempt at a SSTDABK spaceplane, and I have high hopes for this one. The only problem is, its thrust and lift are so powerful relative to its mass, it has the tendency to tear itself apart in Kerbin\u0027s dense lower-atmosphere if I try and throttle it up too high in the initial climb (which I basically always do- I haven\u0027t had the patience to play it safe...)\u003C/p\u003E\u003Cp\u003EIf it makes it to Kerbin orbit, I\u0027ll park it there, and resume the flight later (probably in a week or two) when I get the chance to play this game again until the next Duna transfer window...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/9f5EH\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-11-27T01:15:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E*Darth Vader Voice*\u003Cp\u003ECome over to the mod side Sirine. It is unavoidable. It is your destiny...\u003C/p\u003E\u003Cp\u003ESeriously though, there are a lot of great mods out there, and they have a lot of cool features. Used properly, many of them add realism to the game, and expand its scope. You should really give some of the mods a try...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not resistance to having mods. I just want to push the stock to their limits, before going for mods. And I learn lots of thing from the original stock. And I have a list of craft files that are improvable through all the game version updates. (I\u0027ve no worries of the version compatibilities issues.)\u003C/p\u003E\u003Cp\u003EAnd I;m proud of my creation, and I\u0027m keeping them.\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-27T05:03:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI challenge you to build something that will fly HIGHER, rather than carry more Kerbals, actually. *THAT* would be a better show of skill, rather than just computer-strength... (my computer pretty much caps out at 7 engines and 6 control surfaces- any more of either and I\u0027m running in the red/orange...)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont think I can compete with your crazy low wing loading (I mean, climbing at 7m/s??) or your part frugalness, but I can do speed. So,\u003C/p\u003E\u003Cp\u003ECHALLENGE ACCEPTED!\u003C/p\u003E\u003Cp\u003EI finally got the interstellar pack to work, and I learned two things. One, flying on Duna is lots of fun, and two, thermal turbojets are probably the coolest thing EVER. I designed a plane to play with them- Let me introduce \u003Cem\u003ELast Dancer\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EjDawuq.jpg\u0022 alt=\u0022EjDawuq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts a massive vessel, but only weighs 50 tons and has 70 parts. The 3 interior crew sections are actually welded parts, and I made sure that they have the correct mass and fuel capacity. Structurally, they are connected to each other and the other parts normally, so I didnt form the entire backbone out of a single welded part. This way, I dont think I am making anything stronger than it otherwise would have been. I also tried to weld the engine nacelles into a single part, but it wouldnt let me weld reactors or the large intakes. It would let me weld the small intakes with the quad coupler though, so that reduced part count further.\u003C/p\u003E\u003Cp\u003EIts powered by 6 thermal turbojets, each connected to an un-upgraded fusion reactor. There are four atmosphere intakes for each, with one large one just because.This ensures that they still produce great thrust at extremely high altitudes, assuming that I am going fast enough. The one plasma thruster lets me perform orbital maneuvers. \u003C/p\u003E\u003Cp\u003EThe idea was that I was going to just play around with it, like I had my other designs, but this one turned out to be fully capable of reaching orbital velocities in the atmosphere, so I decided to take it to Duna, and gave this challenge another run!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aT0cLOk.jpg\u0022 alt=\u0022aT0cLOk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooong burns. Luckily, I discovered that I can run fuel through those thermal turbojets, so I shortened this down to about 10 minutes.\u003C/p\u003E\u003Cp\u003EIt had a nasty habit of turning over upside down trying to reenter duna, but after excessive simulations, I finally got it to land in once piece. \u003C/p\u003E\u003Cp\u003ETaking off, once again, proved to be quite a challenge, but eventually I found a cliff I could just sort of drop it off of, and it gains velocity fast enough that I got it into the air. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AuwV6Jp.jpg\u0022 alt=\u0022AuwV6Jp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow is when things get interesting. It seems that thermal turbojets dont care so much about how fast I am going, only how much intake atmosphere I am getting, and there are looots of intakes on this guy. Even in dunas thin atmosphere, the faster I went, the more air I got, so on, and so forth. Turns out it is quite capable of reaching escape(!) velocity in dunas atmosphere, and by steering down towards the planet, maintain constant altitude. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FMqobEH.jpg\u0022 alt=\u0022FMqobEH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat said, it\u0027s tricky to define its maximum altitude. At 18,000 feet I confirmed that it is capable of maintaining altitude at less than orbital velocity, but this should always be the case as long as their is some atmosphere at all. To really determine it, we would need an infinity long, flat duna to fly over. If you just want to stick with the basic interpretation though, its maximum altitude is the end of duna\u0027s atmosphere, or 30,000 meters (I think thats it, it might be 50km)\u003C/p\u003E\u003Cp\u003EIt also carries a total of 73 kerbals, all inside. \u003C/p\u003E\u003Cp\u003ESo, let me add this all up.\u003C/p\u003E\u003Cp\u003E\u002B71 kerbals\u003C/p\u003E\u003Cp\u003E\u002B1 all inside\u003C/p\u003E\u003Cp\u003E\u002B2 SSTDABTK \u003C/p\u003E\u003Cp\u003E\u002B25 operating altitude(or whatever you think it should be)\u003C/p\u003E\u003Cp\u003E\u002B1 for FAR\u003C/p\u003E\u003Cp\u003E\u002B1 for Circumnavigation\u003C/p\u003E\u003Cp\u003EThat adds up to 101 points. \u003C/p\u003E\u003Cp\u003EAs for refueling it, it only used up about 2 percent of its liquid fuel on the trip over, and the deuterium in those reactors is enough to last for years. If it does start to run out, its pretty easy for it to just fly back to kerbin. \u003C/p\u003E\u003Cp\u003EHere are the rest of the pictures from the mission-\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/pfC7A\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T06:10:55Z\u0022 title=\u002211/27/2013 06:10  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-27T06:20:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EI dont think I can compete with your crazy low wing loading (I mean, climbing at 7m/s??) or your part frugalness, but I can do speed. So,\u003Cp\u003ECHALLENGE ACCEPTED!\u003C/p\u003E\u003Cp\u003EI finally got the interstellar pack to work, and I learned two things. One, flying on Duna is lots of fun, and two, thermal turbojets are probably the coolest thing EVER. I designed a plane to play with them- Let me introduce \u003Cem\u003ELast Dancer\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EjDawuq.jpg\u0022 alt=\u0022EjDawuq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts a massive vessel, but only weighs 50 tons and has 70 parts. The 3 interior crew sections are actually welded parts, and I made sure that they have the correct mass and fuel capacity. Structurally, they are connected to each other and the other parts normally, so I didnt form the entire backbone out of a single welded part. This way, I dont think I am making anything stronger than it otherwise would have been. \u003C/p\u003E\u003Cp\u003EIts powered by 6 thermal turbojets, each connected to an un-upgraded fusion reactor. There are four atmosphere intakes for each, with one large one just because.This ensures that they still produce great thrust at extremely high altitudes, assuming that I am going fast enough. The one plasma thruster lets me perform orbital maneuvers. \u003C/p\u003E\u003Cp\u003EThe idea was that I was going to just play around with it, like I had my other designs, but this one turned out to be fully capable of reaching orbital velocities in the atmosphere, so I decided to take it to Duna! I changed out the large air intakes for smaller ones to avoid cheaty part clipping, and gave this challenge another run!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aT0cLOk.jpg\u0022 alt=\u0022aT0cLOk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooong burns. Luckily, I discovered that I can run fuel through those thermal turbojets, so I shortened this down to about 10 minutes.\u003C/p\u003E\u003Cp\u003EIt had a nasty habit of turning over upside down trying to reenter duna, but after excessive simulations, I finally got it to land in once piece. \u003C/p\u003E\u003Cp\u003ETaking off, once again, proved to be quite a challenge, but eventually I found a cliff I could just sort of drop it off of, and it gains velocity fast enough that I got it into the air. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AuwV6Jp.jpg\u0022 alt=\u0022AuwV6Jp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow is when things get interesting. It seems that thermal turbojets dont care so much about how fast I am going, only how much intake atmosphere I am getting, and there are looots of intakes on this guy. Even in dunas thin atmosphere, the faster I went, the more air I got, so on, and so forth. Turns out it is quite capable of reaching escape(!) velocity in dunas atmosphere, and by steering down towards the planet, maintain constant altitude. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FMqobEH.jpg\u0022 alt=\u0022FMqobEH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat said, it\u0027s tricky to define its maximum altitude. At 18,000 feet I confirmed that it is capable of maintaining altitude at less than orbital velocity, but this should always be the case as long as their is some atmosphere at all. To really determine it, we would need an infinity long, flat duna to fly over. If you just want to stick with the basic interpretation though, its maximum altitude is the end of duna\u0027s atmosphere, or 30,000 meters (I think thats it, it might be 50km)\u003C/p\u003E\u003Cp\u003EIt also carries a total of 73 kerbals, all inside. \u003C/p\u003E\u003Cp\u003ESo, let me add this all up.\u003C/p\u003E\u003Cp\u003E\u002B71 kerbals\u003C/p\u003E\u003Cp\u003E\u002B1 all inside\u003C/p\u003E\u003Cp\u003E\u002B2 SSTDABTK \u003C/p\u003E\u003Cp\u003E\u002B25 operating altitude(or whatever you think it should be)\u003C/p\u003E\u003Cp\u003E\u002B1 for FAR\u003C/p\u003E\u003Cp\u003E\u002B1 for Circumnavigation\u003C/p\u003E\u003Cp\u003EThat adds up to 101 points. \u003C/p\u003E\u003Cp\u003EAs for refueling it, it only used up about 2 percent of its liquid fuel on the trip over, and the deuterium in those reactors is enough to last for years. If it does start to run out, its pretty easy for it to just fly back to kerbin. \u003C/p\u003E\u003Cp\u003EHere are the rest of the pictures from the mission-\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/pfC7A\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh God- *FUSION* reactors, and HOW MANY engines??!!\u003C/p\u003E\u003Cp\u003EMy computer has huge lag issues with just under 70 parts and only two thermal turbojets in my latest design. You used- SIX?! (my computer would EXPLODE)\u003C/p\u003E\u003Cp\u003EI don\u0027t think I\u0027m EVER going to be able to outdo your score, given how much more powerful your computer is...\u003C/p\u003E\u003Cp\u003EAs for the FUSION reactors (from the performance, they look to be the upgraded versions)- I understand they\u0027re awesome- but how did you get them? If you play Sandbox mode, you\u0027re supposed to have to wait a LONNNG time for a Science Lab to turn out enough Science to upgrade reactors (normally, Sandbox doesn\u0027t use Science, but KSP Interstellar kind of forces it down your throat). And on Career Mode, it takes 2000 Science Points just for the basic version, and some ungodly number for the upgraded fusion reactors- so it\u0027s not something you can afford right after installing the mod on a fresh Career save. Since KSP Interstellar uses a different tech tree than normal, you also can\u0027t just add it onto an existing Career Mode game and be able to immediately buy the node that way...\u003C/p\u003E\u003Cp\u003EFinally, I\u0027d like to see the part files for those welded crew cabins. I\u0027d like to check that the parameters have been adjusted correctly, and see how you made them (I\u0027ve been having a lot of trouble welding parts myself). If you used Ubo\u0027s Welding Utility, you can count on them being pretty much disqualified though- it doesn\u0027t adjust the parameters correctly, and you can end up with things like insanely low (or high) drag coefficients and masses on non-stock parts. If you did balanced them correctly, though, I\u0027d like to use the part in my own designs.\u003C/p\u003E\u003Cp\u003EI\u0027ve been limited by my technology (level 2/3 fission reactors). It looks like you played the tech trump card on me- level 2 fusion reactors (may I repeat, *FUSION* reactors- seriously? that is *NOT* a level playing-field...) can MASSIVELY outperform level 2 fissions. And antimatter reactors- are just scary powerful.\u003C/p\u003E\u003Cp\u003EAs for my part frugalness and low wingloads- that\u0027s because of my weak computer. It can handle more wing parts than engines, which tend to generate a LOT more lag per-part. Plus, it\u0027s *MUCH* safer to land a low-wingload plane on Duna- and much easier to take off. None of my plane designs should have to do a cliff jump like you did, for instance...\u003C/p\u003E\u003Cp\u003EHere\u0027s my latest design- the \u0027Blackhawk Mk3\u0027. It STILL can\u0027t reach LKO though (it has enough Delta-V to get from LKO to Duna on its own, with a refueling stop at the Mun, though.) I\u0027m starting to think it\u0027s impossible to accomplish an SSTDABK with the designed crew capacity (12 passengers \u002B 1 pilot) without a crazy-high part count (especially, more than two engines) *OR* better reactors- at least level 3 fissions, or level 1 fusions...\u003C/p\u003E\u003Cp\u003EStill, here she is. She\u0027d make a nice Kerbin airliner, though, if that Challenge allowed KSP Interstellar, and its host was still maintaining it... (I also used NovaPunch2 struts- but those could easily be replaced with stock ones)\u003C/p\u003E\u003Cp\u003EHer Maximum Cruising Altitude is only about 17,550 meters. Her max landspeed is 216 m/s. She suffers form a really low TWR- but with Mk-3 fission reactors, or fusion reactors (they unlock at the same tech node), she could easily be an SSTDABK- as she packs enough Delta-V (almost exactly 2000 m/s in vacuum) to reach orbit from a higher altitude (which would require more thrust to achieve).\u003C/p\u003E\u003Cp\u003EI *MIGHT* post a Mk-4 version that can actually work as a SSTDABK soon- if I\u0027m willing to push the part-count and lag a little higher for an extra engine... (the Mk3 already dips into the yellow now and then on mid-level graphics settings)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/VdoPr\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess I\u0027m just going to have to be happy to send all my spaceplanes up on a rocket... Show me that three-part crew cabin though- I need it to bring my part-count further down...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T06:28:27Z\u0022 title=\u002211/27/2013 06:28  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-27T07:07:29Z","Content":"\n\u003Cp\u003EAs for getting fusion reactors, I guess I did cheat a bit for those by unlocking the entire tech tree, but I am not doing any of this in my career save which DOES have the entire tree filled out, but it is currently 1300 miles away from me at college. If I was there, however, it honestly would have been worse because I would have been using antimatter reactors instead, but I don\u0027t have an antimatter factory on this save. I cant imagine what that would be like, probably just tear this thing apart.\u003C/p\u003E\u003Cp\u003EAs for welding, I did use ubizos, I wasnt aware that it could so subtly tinker part coefficients like that. If that does count as a a disqualification, then I can go back to using the non-welded versions, because other than being almost constantly in the red, it still flies with them. (and the 6 or so struts required to hold them together-curse KSPs inability to join more than one node). Actually, the first picture with the larger intakes is before I started welding anything. \u003C/p\u003E\u003Cp\u003EThis craft did have a bit of lag, especially when I activated all of the reactors. It was constantly in the yellow. I really wish I was at college still, you seem to think that this computer is a monster, but iirc it\u0027s over 8 years old, running one of the first intel dual cores. Im just used to dealing with laggy everything here, I guess. \u003C/p\u003E\u003Cp\u003EIts funny, that one of the main reasons I decided to do a space plane challenge was because of my part count limitations- I used to regularly launch 600/700 part rockets without too much problem. This computer crashes before it can load 300 parts, and is unplayable with anything over ~90.\u003C/p\u003E\u003Cp\u003EIf you honorably want to continue this bound by your tech tree, send those probes out to jool, lots of science to be had, and fusions are rather nice. This isnt quite the same craft with the fission reactors. \u003C/p\u003E\u003Cp\u003EUnfortunately, it is the nature of challenges like this that award uncapped points for kerbals to end up being decided by larger and larger craft. I do feel like this might have been a bit exploitative, though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Your planes have a certain elegance that mine don\u0027t quite achieve. \u003C/p\u003E\u003Cp\u003EEither way, you may be surprised how well your thermal turbojet designs perform on duna. Last Dancer was baaarely able to creep into LKO, with quite a bit of work being done by the plasma thruster. For some reason, though, it absolutely blasted through duna\u0027s atmosphere, obtaining essentially uncapped speeds in its outer atmosphere. I got up to over 3000 meters per second before I let it kick me out into orbit, and the thrust on my turbojets was still increasing due to increasing intake air. It took forever to get to 2000, but once it got there, it just went nuts. \u003C/p\u003E\u003Cp\u003EStill landing and taking off with my planes is a nightmare, especially landing for this one. Essentially a matter of luck if I can find a flat place.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T07:53:05Z\u0022 title=\u002211/27/2013 07:53  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-27T09:27:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EAs for getting fusion reactors, I guess I did cheat a bit for those by unlocking the entire tech tree, but I am not doing any of this in my career save which DOES have the entire tree filled out, but it is currently 1300 miles away from me at college. If I was there, however, it honestly would have been worse because I would have been using antimatter reactors instead, but I don\u0027t have an antimatter factory on this save. I cant imagine what that would be like, probably just tear this thing apart.\u003Cp\u003EFOUL! FOUL! Haha, I\u0027m just kidding. But seriously though, that is a bit unbalanced/unfair. One of the MAJOR limitations to getting the more advanced reactors in KSP Interstellar is the time it takes to do the research and set up the infrastructure to use the more advanced stuff. It\u0027s a *BIG* part of the mod\u0027s balance- even in Sandbox it forces you to do a sort of research, and this feature predates the tech tree...\u003C/p\u003E\u003Cp\u003EAlso, if you had unlocked all the engines, you weren\u0027t just using more advanced reactors (even the fission reactors would have been a level further upgraded than mine)- you were also using more advanced thermal turbojets. The type you were using, with everything unlocked, should have been called \u0022Hybrid Turbojets\u0022- I think they are more powerful, and as you noticed, allow you to run fuel through them as well (the basic thermal turbojets I had to work with *DO NOT*)\u003C/p\u003E\u003Cp\u003EI\u0027m just curious- how much thrust were you getting with the upgraded (they have a very advanced upgrade you would have automatically been using if everything was unlocked- it normally requires the Antimatter Power node) fusion-powered hybrid turbojets? (wow, that\u0027s a mouthful) I was only getting 19.1 kN each with my level-2 fission reactors and basic thermal turbojets at sea level on Kerbin- and a peak of about 35-38kN at a little higher altitude...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EAs for welding, I did use ubizos, I wasnt aware that it could so subtly tinker part coefficients like that. If that does count as a a disqualification, then I can go back to using the non-welded versions, because other than being almost constantly in the red, it still flies with them. (and the 6 or so struts required to hold them together-curse KSPs inability to join more than one node). Actually, the first picture with the larger intakes is before I started welding anything. \u003Cp\u003EPost the config files for the welded parts in a text-box. I\u0027ll see if I can\u0027t compare them to the values for the normal ones some time if I get the chance. However, they still might not be allowed, since they make up the vessel fuselage- and Geschosskopf explicitly disallowed using welded or upsized parts for the fuselage, after I tried something like that myself...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EThis craft did have a bit of lag, especially when I activated all of the reactors. It was constantly in the yellow. I really wish I was at college still, you seem to think that this computer is a monster, but iirc it\u0027s over 8 years old, running one of the first intel dual cores. Im just used to dealing with laggy everything here, I guess. \u003Cp\u003EIts funny, that one of the main reasons I decided to do a space plane challenge was because of my part count limitations- I used to regularly launch 600/700 part rockets without too much problem. This computer crashes before it can load 300 parts, and is unplayable with anything over ~90.\u003C/p\u003E\u003Cp\u003EThat\u0027s about on par with the performance of my current computer (it\u0027s a 2 going on 3-year old crappy laptop made in China, with a bad memory leak.) So, I guess you\u0027re just willing to put up with a lot more lag than I am...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EIf you honorably want to continue this bound by your tech tree, send those probes out to jool, lots of science to be had, and fusions are rather nice. This isnt quite the same craft with the fission reactors. \u003Cp\u003EAs I pointed out, the reactors you have access to are Fusion Mk-2\u0027s, not the basic level that I still haven\u0027t unlocked yet. The tech node for the fusion Mk2\u0027s requires Antimatter Power- which is a node so expensive that pretty much the only way to get it is by spamming Science Labs (a 3.5 TON part that requires 5000 EC/s to work) in low orbit of Moho... Even with all the mods I have that add potential Science Points from probes and larger ships (KSP Interstellar has a magnetometer and Gamma-Spectrophotometer; Kethane mod has a Kethane detector- which I think might give Science too; and Extraplanetary Launchpads has an Orbital Mass Detector- which is used to detect Ore, but I\u0027m pretty sure also can give some science points...), Antimatter Power is so expensive, and requires so many prerequisite nodes, that no amount of standard exploration will probably ever unlock it on its own without Science Labs, even for me- unless the Sentar system (Krag\u0027s Planet Factory mod) has a really high science multiplier- much higher than Jool.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EUnfortunately, it is the nature of challenges like this that award uncapped points for kerbals to end up being decided by larger and larger craft. I do feel like this might have been a bit exploitative, though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Your planes have a certain elegance that mine don\u0027t quite achieve.\u003Cp\u003EThanks for the compliment on my designs. You are indeed correct about the point scoring bit... The top scores always go to the top computers in the end...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EEither way, you may be surprised how well your thermal turbojet designs perform on duna. Last Dancer was baaarely able to creep into LKO, with quite a bit of work being done by the plasma thruster. For some reason, though, it absolutely blasted through duna\u0027s atmosphere, obtaining essentially uncapped speeds in its outer atmosphere. I got up to over 3000 meters per second before I let it kick me out into orbit, and the thrust on my turbojets was still increasing due to increasing intake air. It took forever to get to 2000, but once it got there, it just went nuts. \u003Cp\u003EI\u0027ve developed a very sophisticated understanding of the stock aerodynamics model by this point, and of orbital mechanics, so let me give you some insight into why that was:\u003C/p\u003E\u003Cp\u003E- First of all, Duna\u0027s gravity is much lower than Kerbin\u0027s, as I\u0027m sure you\u0027re aware. This means you can maintain a lower angle of attack- greatly reducing the drag from your wings (the wings work on a sinusoidal angle-based drag/lift model- you can think of the component opposite your direction of motion as drag) as well as directing more of your thrust in the prograde direction rather than to fight gravity.\u003C/p\u003E\u003Cp\u003E- Second, Duna\u0027s radius is also significantly less than Kerbin\u0027s. This hasn\u0027t made too much of an impact on the low-and-slow flying propeller plane models we\u0027ve seen in the challenge so far; but when your altitude is higher its curvature can more easily match the planet\u0027s- even at lower speeds- than on Kerbin (this is essentially what orbit is- when the curvature of your trajectory becomes slight enough that it never touches the atmosphere or surface of a body). This greatly reduced effective gravity. The effective orbital speed high up in Duna\u0027s atmosphere is only a bit over 1000 m/s (it\u0027s about 950 m/s just above Duna\u0027s atmosphere)- which means as long as you can produce enough thrust to cancel drag and maintain speed, you can effectively experience no gravity and remain airborne forever...\u003C/p\u003E\u003Cp\u003E- Third, as I\u0027m sure you\u0027re aware, lift increases exponentially with speed in this game. So does drag, and so does intake by your air intakes. So, if you are flying very fast with a very low-drag plane (especially if welding those crew cabins substantially reduced the drag coefficient- as it often does with that utility), you will easily be able to cancel out gravity with your lift alone (and in fact, may need to fight some of it with your thrust- by pointing downwards), and your intakes will easily remain full at very high speeds.\u003C/p\u003E\u003Cp\u003EAll of this is why, if you noticed, I would usually first give a direct translation to Duna Cruising Altitude based on an equivalent air pressure alone (for instance my \u0022Bluejay\u0022 model of thermal turbojet which I presented before- and was basically a stripped-down version of the Blackhawk Mk1 without the spaceplane ascent system- had a cruising altitude of 29,500 meters on Kerbin- which equates to the air pressure at about 12,870 meters on Duna), and then add 1-2 scale heights to the estimated altitude ceiling (so, about 3000-6000 meters) based on the lesser gravity and smaller radius on Duna...\u003C/p\u003E\u003Cp\u003EOf course, the effects of the smaller radius grow exponentially with altitude and speed- so the electric propeller planes we saw earlier benefited very little from the smaller radius, whereas your thermal turbojet benefited enormously from it (and my Eagle Mk2- which is currently en-route to Duna, and has an altitude ceiling of 31,250 meters and top speed of a little over 1000 m/s on Kerbin, will likely be able to escape to orbit on turbojet power alone- if it can keep its atmospheric intakes full...)\u003C/p\u003E\u003Cp\u003EOh, and, uhhh, since you\u0027re using FAR mod for your aerodynamics model- one additional affect applies. Mach effects. Basically the coefficient of drag (the only thing really limiting your speed at that altitude otherwise) falls off exponentially as you get faster and faster once you exceed Mach 1 in that mod... That means that the same plane, without FAR, might not fly NEARLY as fast or high on Duna- probably not reaching escape velocity for instance...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EStill landing and taking off with my planes is a nightmare, especially landing for this one. Essentially a matter of luck if I can find a flat place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s for that reason that I wouldn\u0027t consider your plane designs to be very useful at all on Duna. While they may earn lots of Challenge points, they won\u0027t serve a colony there too well... My designs, on the on the other hand, have been built to be as utilitarian as possible- hence why some of them have had significant cargo capacity even if that won\u0027t earn as many Challenge points as crew capacity- and all of them have had very low wingload (which makes landing MUCH safer and easier). In fact, I\u0027m surprised your Last Dancer survived landing (or re-entry for that matter, given how not-solid it looks) at all...\u003C/p\u003E\u003Cp\u003EI guess, in summary- flying on Duna isn\u0027t really that hard at all, provided you have a good enough propulsion system. The biggest challenge is that stock really offers nothing that works well and lasts a long time (rockets run out of fuel too quickly, ion engines are usually too weak- though Sirine managed to make an ion flyer somehow...)\u003C/p\u003E\u003Cp\u003EElectric Propellers do work, but, uhh, well, only sort of... They require too much weight in solar panels to fly very high; like all propellers their thrust is already very low at the relevant air pressures, and falls off exponentially with further decreases based on altitude; and individually they\u0027re VERY weak at those air pressures- which means you have to use a lot of CPU power simulating five or six or seven of them just to keep a low altitude with any sort of decent-sized craft. \u003C/p\u003E\u003Cp\u003EThermal Turbojets are a much better option. Their TWR is actually a bit lower at the lower altitudes on Duna when only using Mk-2 fission reactors and basic turbojets like I did, but their engine profile means they maintain their thrust into much higher altitudes- as it follows that of a standard turbojet a lot more closely than that of a standard propeller. They pack more thrust into a lower part-count (just three parts yield between 19 and 38 kN with the tech level I used- vs. about 2-5 kN each for electric propellers at even the lower altitudes on Duna). And, perhaps most importantly for your Last Dancer craft, their performance improves greatly with each tech level advance- eventually greatly exceeding even standard fuel-powered turbojets (when powered with Antimatter Reactors).\u003C/p\u003E\u003Cp\u003ETBH, my greatest advantage so far, and the reason all my designs have looked ready to greatly outperform all the competitors up until yours (if I can just get them to Duna- I\u0027ve mostly been focusing my efforts on trying to develop a Spaceplane version for that reason- because I can\u0027t strap anything bigger than one of my smallest designs to a rocket...) is that I had the insight and mod to use Thermal Turbojets instead of propellers.\u003C/p\u003E\u003Cp\u003EThat being said, I will be designing even better, specialized cargo-hauler models for my own personal use on Duna once I have a colony set up there- only I will need to construct them *ON* Duna (using RocketParts hauled from Kerbin, or mined and refined locally- vessels you build off-planet aren\u0027t free...) as they will be too large to transport there, and too complex as spaceplane variants- so they won\u0027t be able to use them for this challenge... Some of the largest and last-built ones would even be designed to operate between constructed runways at permanent bases once I have those set up- so their landing wheels would be smaller, and they wouldn\u0027t be nearly as useful for the kind of on-a-dime landings in the rough terrain needed for this challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T10:24:16Z\u0022 title=\u002211/27/2013 10:24  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-27T14:53:23Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E@ StevenRS11:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHoly Kow!\u003C/p\u003E\u003Cp\u003EHandling the refueling issue is as simple as slapping a KAS port in a convenient place. I guess you don\u0027t really need ladders to board all those crew modules due to jetpacks working on Duna.\u003C/p\u003E\u003Cp\u003EI\u0027m unsure how to score the altitude of Last Dancer, however. From your description, it sounds like you might well have entered ballistic territory. This can happen at less than orbital velocity and you can usually tell when it happens because you have to keep pushing the nose down to maintain level flight. If I read your report correctly, you were having to do this.\u003C/p\u003E\u003Cp\u003EThis is a very common phenomenon with airhogging jets, although most folks only see it when trying to leave Kerbin with an SSTO so this is actually a good thing for them. This typically happens at some point during the long, high-altitude run where you\u0027re building up as much speed as possible prior to starting the rockets for the final jump into orbit, and is one of the important milestones in the whole launch process. As long as there\u0027s still enough air coming in to run the engines, and the engines are making enough thrust to accelerate the plane, speed will increase until wings become unnecessary. At this point, you have an air-breathing rocket, not an airplane.\u003C/p\u003E\u003Cp\u003EThus, I urge you and all others striving for extreme speeds and altitudes to be very careful. We\u0027re trying to make airplanes here, not rockets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E@ Everybody\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI apologize for the scoring system but I must say that it\u0027s a product both of its times and possibly my own ignorance. As far as I knew back when I issued this challenge, there weren\u0027t many choices for how to power a Duna plane, I had personally tried them all, and all of them were only capable of producing rather marginal planes. Thus, I figured all planes would have roughly comparable performance so it would be a tight contest decided by engineering finesse, not brute force. As such, I saw no need to cap any of the scoring categories.\u003C/p\u003E\u003Cp\u003ESince then, the Interstellar mod has really expanded, going from just warp drive to adding thermal jets and such. I didn\u0027t know of this until they started showing up in this thread; I wasn\u0027t interested in the original warp drive so had ignored this mod completely. But now I\u0027m seeing it everywhere because the reactors and such have such insane power-to-weight ratios compared to anything else, stock or mod, that folks are using them as exploits. For example, it\u0027s becoming popular to use an Interstellar reactor with lots of Near Future engines to make SSTE (Single Stage To Everywhere) ships, thereby combining the TWR of chemical rockets with the endurance of ion engines.\u003C/p\u003E\u003Cp\u003EThe bottom line is that IMHO the Interstellar mod, at least its reactors, are way over-powered. Sure, the mod\u0027s engines and such require lots of electricity so need a way to produce this, but the power-to-weight ratios of the reactors are orders of magnitude better than anything else in the game. This now allows brute force (aka MOAR) solutions to the problem of flying on Duna and exposes the weakness in the scoring system.\u003C/p\u003E\u003Cp\u003EBecause most of the ways of flying on Duna require mods, I left the door wide open there to provide variety. Of course, this accepts the risk that future mod releases and/or updates, or mods I\u0027m unaware of at the time, will break the challenge. But I don\u0027t like changing the rules in mid-stream, especially given all the effort expended in good faith under the existing rules. However, I think it should be obvious to all that it\u0027s apples and oranges when you compare Interstellar things to everything else.\u003C/p\u003E\u003Cp\u003ESo, because Interstellar planes are figuratively in a league of their own, I think the only equitable solution is to make this literal as well. I am thus going to divide the leaderboard into 2 categories: those using Interstellar and those that don\u0027t. Understand that I am not at all a fan of equitable solutions because they change the rules, thus reducing the value of the rules. If you can\u0027t read the motto in my sig, it\u0027s an old legal maxim that translates as \u0022Nothing is so inequitable as taking equity too far.\u0022 But in this case, I\u0027m afraid something has to be done.\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-27T19:35:54Z","Content":"\n\u003Cp\u003EI agree that interstellar does rely on a fundamentally different method to provide balance for its parts- one that so far hasn\u0027t really been present in KSP, \u0022Leveling Up\u0022. Not sure if its a \u0027good\u0027 thing, but it sure is fun. I will say that it seems like it is balanced if the tech level remains capped at fission reactors. Its only when you get the fusions/antimatter than it gets out of hand. Just messing around, I tried it with antimatter reactors. The resultant aberration of a plane was more than capable of flying into Jool\u0027s atmosphere, then accelerating to KERBOL escape velocities while still inside its atmosphere. Each turbojet gave over 1000kn of thrust. \u003C/p\u003E\u003Cp\u003E@Northstar, \u003C/p\u003E\u003Cp\u003EThe fusion powered turbojets peaked at right under 200 k/n each, if I remember correctly. Thats actually just about what a regular turbojet would give at its maximum operating efficiency, I think. The thermals, unlike the regular turbojets, don\u0027t produce less thrust if they go to fast though. Thats the kicker. \u003C/p\u003E\u003Cp\u003EAs for Last Dancer, it actually does have ladders leading down the sides of all the compartments, all facing towards the outsides. I can confirm that it was actually flying on a non ballistic trajectory at 18,000 feet, as cutting thrust caused me to instantly being to descend. If you have some sort of test that I can perform for higher altitudes, well, I can turn it around and blast it back into duna with no problem. \u003C/p\u003E\u003Cp\u003EAlso, I have no problem with you splitting up the scoreboard, or anything. I still like my first plane the best, anyway. Too bad kerbals lag so much in lawnchairs. They look so happy.\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-29T03:39:47Z","Content":"\n\u003Cp\u003EAlso, Geschosskopf, my first submission didn\u0027t use interstellar at all. Only my second entry for 101 points used the reactors and turbojets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-29T06:25:25Z\u0022 title=\u002211/29/2013 06:25  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 29, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-29T15:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EAlso, Geschosskopf, my first submission didn\u0027t use interstellar at all. Only my second entry for 101 points used the reactors and turbojets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHope you all had a happy Thanksgiving if that\u0027s your thing.\u003C/p\u003E\u003Cp\u003EAnyway, I put your original plane back in the non-Interstellar category and added Last Dancer to the Interstellar list. 89 points there because you said 18km was your nonballistic altitude. Still quite an impressive beast, though.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-01T01:21:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EHope you all had a happy Thanksgiving if that\u0027s your thing.\u003Cp\u003EAnyway, I put your original plane back in the non-Interstellar category and added Last Dancer to the Interstellar list. 89 points there because you said 18km was your nonballistic altitude. Still quite an impressive beast, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAww, a different category?\u003C/p\u003E\u003Cp\u003EI agree with Steven- Interstellar is rather balanced until you get to fusion reactors and level 3 fissions. In fact, even with my best engineering effort, I *STILL* haven\u0027t been able to build an SSTDABK-capable spaceplane with the level-2 fission reactors- though at this point I\u0027ve come extremely close, with a suborbital design:\u003C/p\u003E\u003Cp\u003EThe Blackhawk Mk5\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Tsdxx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is, as you can see, pushing the absolute limits of what\u0027s possible with lvl-2 fission reactors and basic thermal turbojets, while still maintaining a low enough wingload to permit safe landing... With a little more refinement, I *might* have a SSTDABK. But this is hardly possible without KSP Interstellar mod- unless you make a vessel that flies as a rocket-plane on Duna.\u003C/p\u003E\u003Cp\u003ESo, I\u0027m not really sure it\u0027s the mod- I think it\u0027s the really advanced tech levels it offers that go all super-futuristic.\u003C/p\u003E\u003Cp\u003EStick with your principles man. How about limiting it to vessels using pre-fusion reactors (fission reactors before their final upgrade with Fusion Power) vs. those after the \u0022discovery\u0022 of controlled fusion power technology? IMHO, the Interstellar mod fusion-reactors are quite overpowered. The fission reactors, not so much... Don\u0027t make me mention antimatter- the technology is realistic as implemented, but in reality, antimatter power is, I don\u0027t know, CENTURIES off...\u003C/p\u003E\u003Cp\u003EMy current tech level is quite balanced. For instance, to get a design that can even go suborbital, I had to load up so much fuel that the thing\u0027s altitude ceiling is only 10,000 meters when full fueled (the atmospheric pressure barely above sea level on Duna- which means it needs to fly with a partial or empty LFO load when on Duna...) I also had to drop ALL the extra crew capacity beyond the minimum of 2, and stick with one of the lightest cockpit types.\u003C/p\u003E\u003Cp\u003E(Fission) nuclear reactor/thermal turbojets are HEAVY- each pair weighs between 2 and 3 tons (depending on reactor loading) and only produces between 19 and 36 kN of thrust! (depending on altitude) That\u0027s actually very inferior to electric propellers at low altitudes on Duna, *IF* you use the \u0022Cargo Throttle\u0022 setting on the electric propellers... (through Action Groups- raises maximum thrust by 50%, as well as EC/s consumption) Which was, by the way, the trick I discovered before- from reading the Firespitter Parts Guide...\u003C/p\u003E\u003Cp\u003EOh and Steven, yes, the thermal turbojet force output DOES fall off with increasing speed. I\u0027ve tested this extensively with the fission-powered ones I\u0027ve been limited to. Just with the fusion-powered ones you used, the effect might not have been noticeable enough on that beast of a plane...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T01:43:43Z\u0022 title=\u002212/01/2013 01:43  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shalashalska","CreatedById":81412,"CreatedDateTime":"2013-12-01T08:05:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E-snip-\u003Cp\u003EDon\u0027t make me mention antimatter- the technology is realistic as implemented, but in reality, antimatter power is, I don\u0027t know, CENTURIES off...\u003C/p\u003E\u003Cp\u003E-snip\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore like a couple dozen years. I\u0027m guessing we\u0027ll have reliable antimatter reactors by the end of the century. The only real problems with antimatter are storage and actually getting it. We\u0027ve managed to store antimatter for over 1000 seconds now, and we produce about 1 billionth of a gram every ten years. These numbers are steadily improving. (I\u0027m pretty sure the billionth of a gram every ten years is outdated, I think the LHC alone does that much) It probably won\u0027t be used for conventional power, that will be fusion (which won\u0027t work on spacecraft, an energy positive fusion reactor needs to be over 40 meters wide, and weigh something on the order of several megatons) but antimatter will be used on spacecraft, due to it\u0027s insane energy density, and ability to start micro-fission reactions.\u003C/p\u003E\u003Cp\u003EOT: I agree that fission reactors and lower tech Interstellar is balanced. Fusion and especially antimatter is incredibly overpowered. (1000 kN turbojets, anyone?) I\u0027ve managed to launch a 500 ton station into orbit using a 200 ton launcher with antimatter powered turbojets. (I used TAC to fill it on the launchpad)\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-01T09:12:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shalashalska\u0022 data-cite=\u0022Shalashalska\u0022\u003E\u003Cdiv\u003EMore like a couple dozen years. I\u0027m guessing we\u0027ll have reliable antimatter reactors by the end of the century. The only real problems with antimatter are storage and actually getting it. We\u0027ve managed to store antimatter for over 1000 seconds now, and we produce about 1 billionth of a gram every ten years. These numbers are steadily improving. (I\u0027m pretty sure the billionth of a gram every ten years is outdated, I think the LHC alone does that much) It probably won\u0027t be used for conventional power, that will be fusion (which won\u0027t work on spacecraft, an energy positive fusion reactor needs to be over 40 meters wide, and weigh something on the order of several megatons) but antimatter will be used on spacecraft, due to it\u0027s insane energy density, and ability to start micro-fission reactions.\u003Cp\u003EOT: I agree that fission reactors and lower tech Interstellar is balanced. Fusion and especially antimatter is incredibly overpowered. (1000 kN turbojets, anyone?) I\u0027ve managed to launch a 500 ton station into orbit using a 200 ton launcher with antimatter powered turbojets. (I used TAC to fill it on the launchpad)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose are some of the problems I was mentioning about it being OP\u0027d. The necessary size of the reactors for fusion being just one issue. As for antimatter, I\u0027m not talking about experimental use- I\u0027m talking about literally producing TONS of the stuff, like you do in KSP Interstellar, and blithely pumping it around a ship. That\u0027s at least a couple centuries off...\u003C/p\u003E\u003Cp\u003EAnyways, limited to level-2 fission reactors and basic thermal turbojets, I finally developed my first SSTDABK-capable spaceplane! I respectfully submit the (not very creatively named) Blackhawk Mk6...\u003C/p\u003E\u003Cp\u003ESince this plane is SSTDABK-capable, and already in orbit, this also marks the beginning of my challenge-run with it (I will be sending it to Duna after sending up a replacement crew- the pilot was a low-stats expendable test pilot- and a refueling tanker, as it used up ALL its fuel reaching a equatorial prograde 150/100 km Api/Peri orbit)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/rDnX2\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI invite anybody looking through the album to notice a couple pics in particular:\u003C/p\u003E\u003Cp\u003EFirst, there\u0027s the flight log screen. As you notice, it shows the (rather insane) flight time of over 5 *HOURS*. That wasn\u0027t because the plane took nearly that long to climb to its maximum Kerbin cruising altitude of 8435 meters (when fully loaded with fuel), but rather because I left the autopilot (aka. MechJeb ASAS) on while I went and took a long nap. When I got back, the plane was at a stable cruise at maximum altitude- which just shows how stable and long-lived the design is in flight... From that pic alone, I calculate the plane flew halfway around Kerbin while I was asleep (not very far, I know- but it was cruising very low).\u003C/p\u003E\u003Cp\u003EThe second thing I wanted to point out is the radiation exposure meter (\u0022Radiation Level\u0022) on my Kerbal during EVA, while performnig a manual shutdown of the fission reactors... I know there\u0027s been some discussion of KSP Interstellar being overpowered here, so I wanted to point this out because radiation exposure management is one of the two (not fully implemented) major obstacles it adds to the game that help counterbalance its (realistic until fusion) technological advantages. The other other obstacle is WasteHeat management, which is already implemented. When your Kerbals can die from radiation exposure, or your vessel can explode from heat-buildup, it starts to seem a lot less OP\u0027d...\u003C/p\u003E\u003Cp\u003E(For those curious- the radiation exposure my Kerbal was experiencing was mostly from solar radiation, rather than my ship\u0027s three, inactive at the time, fission reactors. The level declined heavily whenever I was moving towards Periapsis, an climbed whenever I moved towards Apoapsis- indicating my Kerbal was benefiting heavily from the protection of Kerbin\u0027s magnetic field...)\u003C/p\u003E\u003Cp\u003EI was shutting down the fission reactors to save uranium, by the way. My ship relies on a single RTG (visible just above the engines in some screenshots) rather than a much heavier (and unnecessarily powerful) KSP Interstellar Electric Generator to provide the electrical power for its SAS wheels... A KSP Interstellar generator would also compete with the thermal turbojets for the level-2 fission reactors\u0027 (very limited) power supply...\u003C/p\u003E\u003Cp\u003EFinally, for those still wondering about the Blackhawk-6\u0027s low altitude ceiling: it will fly *MUCH* higher when it\u0027s not carrying all that heavy LFO rocket fuel around... You may have noticed from the screenshots its mass is only about 22 tons when empty (it\u0027s over 46.5 tons when fully fueled)- with 3 (20-30kN) thermal turbojets and quite a lot of wing area, that\u0027s more than enough to fly quite high on Duna.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T09:38:04Z\u0022 title=\u002212/01/2013 09:38  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-01T09:44:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shalashalska\u0022 data-cite=\u0022Shalashalska\u0022\u003E\u003Cdiv\u003EMore like a couple dozen years. I\u0027m guessing we\u0027ll have reliable antimatter reactors by the end of the century. The only real problems with antimatter are storage and actually getting it. We\u0027ve managed to store antimatter for over 1000 seconds now, and we produce about 1 billionth of a gram every ten years. These numbers are steadily improving. (I\u0027m pretty sure the billionth of a gram every ten years is outdated, I think the LHC alone does that much) It probably won\u0027t be used for conventional power, that will be fusion (which won\u0027t work on spacecraft, an energy positive fusion reactor needs to be over 40 meters wide, and weigh something on the order of several megatons) but antimatter will be used on spacecraft, due to it\u0027s insane energy density, and ability to start micro-fission reactions.\u003Cp\u003EOT: I agree that fission reactors and lower tech Interstellar is balanced. Fusion and especially antimatter is incredibly overpowered. (1000 kN turbojets, anyone?) I\u0027ve managed to launch a 500 ton station into orbit using a 200 ton launcher with antimatter powered turbojets. (I used TAC to fill it on the launchpad)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne last thought- don\u0027t get me wrong on this, antimatter is NOT overpowered in terms of it being unrealistic. Those kinds of feats (500 ton station with a 200 ton launcher) are MORE THAN FEASIBLE with antimatter, in real life. It\u0027s perfectly within the laws of physics. The only problem is, as stated, that kind of refinement of the technology is centuries off. Even seeing use of antimatter power on spacecraft at all (most likely early on not to power thermal rocket engines directly, but to power huge arrays of ion engines) is still at least a century or two away...\u003C/p\u003E\u003Cp\u003EGiven what\u0027s possible with fusion and antimatter someday, mankind WILL be colonizing places like Mars at some point- the question is just WHEN? (do we wait for more advanced propulsion systems- or pull something like \u0022Mars Direct\u0022 and rely heavily on unamnned tech and in-situ-resource-utilization)\u003C/p\u003E\u003Cp\u003EConsidering my SSTDABK spaceplane utilizes mostly technology that is currently available (the power densities of the level-2 1.25 meter fission reactors are actually exceeded by some of the better/bigger fission reactors nowadays- and thermal turbojets were designed back in the 1960\u0027s, just never put to use due to concerns over crew radiation exposure... The only currently undeveloped technology is the two in-line fusion NERVA\u0027s it utilizes...), I\u0027d say we could do Mars *NOW* if we really wanted... We might irradiate a few of the early astronauts badly enough to give some of them cancer after a couple years- but I guess that\u0027s just the price we\u0027d pay for progress.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T10:03:32Z\u0022 title=\u002212/01/2013 10:03  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-02T00:21:19Z","Content":"\n\u003Cp\u003EOk, here are pics of my refueling and crew-transfer mission to the Blackhawk Mk6... Once again, this is for the challenge-run:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/yMfKG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Blackhawk Mk6 now has about 4200 m/s vacuum Delta-V, and two crew members. Hopefully that will be enough fuel to get her to Duna- which is now almost at closest approach to Kerbin (and well beyond the ideal transfer window for low Delta-V use)- without having to wait for a better transfer window...\u003C/p\u003E\u003Cp\u003EAlso, some of you might have noticed the LFO-tanker is missing its three top-stage LV-N NERVA engines in the later pictures. That\u0027s because they popped off the moment I decoupled the top stage for some unknown reason, despite it being a completely unpowered stage separation (and the engines were far enough from the decoupler not to be impacted by any decoupler-force). I think it might have been a clipping issue (the radial flanges I used have problems with not extending quite far enough out to avoid clipping with parallel attachments- despite this being precisely what they were designed for...) This tanker-launch was only supposed to be a test-flight anyways, but since it made it to orbit, I figured I\u0027d go with it... Hopefully none of this disqualifies this challenge run in some way?\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T00:27:08Z\u0022 title=\u002212/02/2013 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shalashalska","CreatedById":81412,"CreatedDateTime":"2013-12-04T00:27:00Z","Content":"\n\u003Cp\u003EThere were some people in the 60\u0027s who designed a single-stage beeline to Mars craft called Project Orion. The reason it was scrapped was because it called for dropping nukes below itself, and the ecological society was freaking out about it, even though if we launched from Siberia, it really wouldn\u0027t be an issue. The Russians tested a 50 megaton nuke there, so a couple extra 50 kiloton nukes wouldn\u0027t really make a difference.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-07T13:04:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shalashalska\u0022 data-cite=\u0022Shalashalska\u0022\u003E\u003Cdiv\u003EThere were some people in the 60\u0027s who designed a single-stage beeline to Mars craft called Project Orion. The reason it was scrapped was because it called for dropping nukes below itself, and the ecological society was freaking out about it, even though if we launched from Siberia, it really wouldn\u0027t be an issue. The Russians tested a 50 megaton nuke there, so a couple extra 50 kiloton nukes wouldn\u0027t really make a difference.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah- I was just PM\u0027ing Geschosskopf about that (in a private discussion we\u0027ve had going back-and-forth) particular plan a second ago... The nicest thing about that plan is, since it works with thermonuclear (fusion explosions, initiated by a smaller fission reaction) warheads; you can get exponentially increasing ISP, and steadily increasing thrust, the more you scale it up- as the ratio of fusion to fission warhead content tilts more and more towards fusion content... (fission content remains essentially unchanged- all additional mass is in fusion content)\u003C/p\u003E\u003Cp\u003ESeveral of the designs that were developed for that (it was developed starting in the 50\u0027s, not the 60\u0027s, by the way) had an engine base with a diameter on the order of KILOMETERS, as a result- and were capable of moving megatons, or even gigatons (with the larger designs), of payload to Mars... They did develop and launch (on a low ballistic trajectory) a very small model-version that utilized small chemical explosive packets, rather than nuclear explosives, as proof-of-concept, by the way... (and it worked as planned!) The video of it nowadays can be found floating around somewhere on YouTube according to one source...\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EBy the way, for those who were curious- no, I still haven\u0027t gotten the Blackhawk Mk6 or the Eagle Mk2 to Duna yet.. (though the latter is currently en-route). I got rather involved with real-life things lately, and spending my gaming time playing Sid Meier\u0027s Alpha Centauri (which I figured out how to get working on my current laptop- having previously only been able to play it on an old desktop my family had a long time ago, when I was still in high school)- which is a GREAT game by the way, for anyone who wants to dig up a copy (it\u0027s abandonware from over 10 years ago, so you really don\u0027t need to own a copy like I do- the company really doesn\u0027t care about the title anymore) and give it a try...\u003C/p\u003E\u003Cp\u003EIf you do give the game a try, get your hands on the Alien Crossfire expansion as well- it adds a few nice additional \u0022Secret Projects\u0022, and even two factions of an alien race (at civil-war with itself) if you want to make them one or two of the 6 factions you compete against, or even play as one... (I typically do neither- it\u0027s not required, and I prefer the human storyline) in a single-player game... (there\u0027s Multiplayer built into the game too- though almost nobody plays it anymore)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-07T13:23:48Z\u0022 title=\u002212/07/2013 01:23  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 7, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-10T11:35:10Z","Content":"\n\u003Cp\u003EAlright, so, guys, (hopefully some people are still paying attention to this thread) another update on the Blackhawk Mk6, and its progress towards Duna...\u003C/p\u003E\u003Cp\u003E[The Blackhawk leaving low-altitude Kerbin orbit...]\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CTE0gSD.png\u0022 alt=\u0022CTE0gSD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI started this baby out a little differently than I do with most of my interplanetary missions- with a Munar transfer designed for capture and (relative) circularization, rather than a Munar gravity assist... Proximally, that\u0027s because it will be refueling in Munar orbit (even though it carries more than enough fuel for a straight transfer- in fact, more than enough fuel for a Dunar aerocapture and return without refueling once if I was willing to put my Kerbals through a sufficiently low-energy transfer...) Ultimately, though, that\u0027s because I want to perform a gravity slingshot off Kerbin (you heard me right- Kerbin, using its velocity relative to the Mun and Duna) to get to Duna faster- as well as the two periapsis burns this gives me to utilize the Oberth effect to its greatest potential.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/1h1hv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, some of you might be wondering- why Kerbin? Surely I must be crazy right? You perform gravity slingshots off a moon, to get to a more distant planet- not the other way around...\u003C/p\u003E\u003Cp\u003EWell, yes and no. If I was simply going for Delta-V straight off gravity to escape the Kerbin system, with no other goal in mind; then yes- I would only perform gravity assists off the Mun and never off Kerbin... (except where a Munar gravity assist manages to shoot me directly back towards Kerbin- which is awesome...)\u003C/p\u003E\u003Cp\u003EHowever, it\u0027s more complicated than hat. You see, this nice little thing called the Oberth effect comes into play. It says that the faster you are moving when you fire a rocket\u0027s engines off, the more energy you get off the burn (since E=(1/2)mv^2, but a rocket\u0027s engines will produce the same Delta-V for the same amount of fuel burned no matter how fast the vessel is moving- until it starts to approach the speed of light...). And, a corollary to that is- you can perform a more powerful burn (one that gives you more energy) the stronger the gravity field is holding you in where you perform the burn- meaning you can utilize the effect more fully when you are closer to a planet or moon, and when it is more massive- as the increased gravity will keep you from shooting off into space for a longer period of time, allowing you more time to fire off the engines...\u003C/p\u003E\u003Cp\u003ESo, to take maximum advantage of the Oberth effect, I need to perform my transfer burn to Duna when I\u0027m really close to Kerbin (though most definitely not in the atmosphere, due to drag), and moving really fast. Which means, a highly elliptical orbit with a really close periapsis to Kerbin will allow me to get the most energy from the fuel the Blackhawk (or any other vessel) can carry with it if full...\u003C/p\u003E\u003Cp\u003EAnd that leaves me with basically two options to establish such an orbit. Either (a) I can establish an extremely-high orbit around Kerbin, and then a massive retrograde/radially-inward burn to establish a close periapsis at as high a speed as possible... or (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I can establish an orbit around the Mun or Minmus, and then depart from there, still arriving at periapsis with a great deal of speed- as energy is stored in the orbit around the moon as well as the orbit around the planet.\u003C/p\u003E\u003Cp\u003EOption (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E makes the most sense of course. Even without KSP Interstellar, Extraplanetary Launchpads, or the Kethane Pack installed, and the great advantages the Mun thus provides me as also being a potential mining hub for no fewer than four different raw resources (Ore, Kethane, Uranium, and Thorium), virtually unlimited repository of regolith (which KSP Interstellar lets me electrolyze to produce Aluminum and Oxidizer), and spacecraft-construction site (this challenge required me to build my vessel on Kerbin- but that doesn\u0027t mean I can\u0027t send off fuel tankers and other unrelated missions from the Mun, constructed out of RocketParts mined from Ore on the Mun; and fueled with LiquidFuel and Oxidizer, refined from Kethane and regolith respectively, from the Mun...)- the Mun also has the advantage of being much closer to Kerbin, and thus quicker to get to, than an ultra-high orbit around Kerbin...\u003C/p\u003E\u003Cp\u003ESo, long tangent about the other advantages of the Mun over an ultra-high Kerbin orbit aside; the Mun allows me to Kerbin-dive quite effectively for two even more important reasons. One, its gravity constantly rotates a portion of my spacecraft\u0027s total velocity about in a circle not necessarily always parallel to Kerbin\u0027s horizon- which means it does some of the velocity-turning for my craft using its gravity (essentially, what I need to do in order to Kerbin-dive is turn the craft\u0027s velocity close to 90 degrees inwards relative to Kerbin), so it doesn\u0027t have to it all with its fuel- reducing the total Delta-V requirements of Kerbin-diving. And two, it allows me to take advantage of the Oberth effect a second (earlier) time on a much smaller scale- since some of the craft\u0027s velocity will already start out pointing in the direction I want to burn in...\u003C/p\u003E\u003Cp\u003ESo, if I haven\u0027t put you all to sleep with that super-long tangent, the plan was/is this: first, I moved the Blackhawk Mk6 to a high Munar orbit, as you can see above/below. Soon, I will move it to a somewhat lower orbit to amplify the advantages of the Mun\u0027s gravity-field (I circularized it in a higher orbit because of its low TWR- it would have taken a longer burn near Kerbin to push it closer to the Mun, and my burn near Kerbin was already longer than I would have liked- at over 2.5 minutes total. I was also too tired, doing this too much by the seat of my pants, and too busy with a simultaneous transfer of my Early Spacedock to Munar orbit- which didn\u0027t go quite as smoothly as planned; to think of performing an adjustment burn to move the Blackhawk\u0027s periapsis closer en-route...)\u003C/p\u003E\u003Cp\u003EThere, it will dock with a fuel tanker, and top off its fuel tanks one last time. From there, it will perform an escape burn from the Mun targeted to give it a low periapsis (but as high a speed as possible) near Kerbin. At periapsis with Kerbin, the Blackhawk will perform a transfer burn for Duna (thanks to its high speed at periapsis, Kerbin\u0027s gravity will also be less capable of pulling the vessel off-course in a radially-inward direction in the limited time it is close by- which is especially important as the Blackhawk has a rather limited TWR...) Finally, at Duna, the Blackhawk will perform a Dunar aerobrake and/or gravity-brake with Ike to allow for capture and safe (low-speed) atmospheric-entry with its limited remaining LFO supply at that point (I will be utilizing a high-energy transfer to get the Blackhawk to Duna in less time- and Duna is currently at closest approach to Kerbin, which drastically increases minimum direct-transfer Delta-V requirements over an ideal transfer window...) Luckily, my design doesn\u0027t require ANY fuel (aside from a limited mass of fissile reactor fuel) to fly in-atmosphere on Duna, so at least I don\u0027t have to worry about that...\u003C/p\u003E\u003Cp\u003EI hope I didn\u0027t put you guys all to sleep with that. Here are pictures of the Blackhawk\u0027s Munar transfer (and the before/after), by the way. Remember, all this is for my challenge run...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/LIQvi\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E-Northstar out-\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-10T11:54:55Z\u0022 title=\u002212/10/2013 11:54  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 10, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-12-11T21:36:59Z","Content":"\n\u003Cp\u003ECool beans, NS! I look forward to what happens with it on Duna.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-18T10:57:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003ECool beans, NS! I look forward to what happens with it on Duna.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the well-wishes Geschosskopf!\u003C/p\u003E\u003Cp\u003EI just updated to 0.23, and was THRILLED to discover the new RAPIER engines... It looks like I won\u0027t have to wait to discover the tech node for B9 Aerospace SABRE engines after all (which I think actually have better performance than the RAPIER engines, as they are closer to rel-life SABRE engines- but higher weight) to implement some of my more ambitious designs for this challenge...\u003C/p\u003E\u003Cp\u003EBe on the lookout for posts not only on the Blackhawk Mk6 making its trans-Duna injection; but also on my design of a line of newer, better-performing STTDABK spaceplanes that utilize RAPIER engines as well as thermal turbojets to escape Kerbin gravity... I might also design a line that utilizes Firespitter electric propellers rather than thermal turbojets for sustained propulsion on Duna- since the RAPIER engines massively reduce the minimum size of my 2-man SSTDABK designs...\u003C/p\u003E\u003Cp\u003EAny chance I could convince you to make an exception for Tier 1 KSP Interstellar technology being in a separate class, by the way? (stuff that\u0027s accessible with only stock tech tree nodes) It turns out I was incorrect before- the KSP Interstellar fission reactors I was using weren\u0027t level-2, they were level-1! There are only 2 levels of fission rector (molten-sodium and solid-core), and the level-2 ones don\u0027t become available until Fusion Power!\u003C/p\u003E\u003Cp\u003EThe Tier 1 Fission Reactors, in combination with Tier 1 (atmospheric) Thermal Turbojets are still very weak, and underperform Firespitter electric propellers (in terms of TWR- they produce 2-3x the thrust, but at over 4 times the weight) at low-altitude on Duna (they only outperform them at high altitude- due to their difference performance curves relative to air density)... The Tier 1 technology is far from overpowered- the most useful thing it can actually do is make a very compact nuclear powerplant for a moderately large array of Firespitter electric propellers (like in my Hummingbird design, posted earlier)...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T11:06:12Z\u0022 title=\u002212/18/2013 11:06  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-12-18T11:06:31Z","Content":"\n\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003ESteven, just so you know, the higher tiers of KSP Interstellar tech are now a little more balanced with the latest update (0.9). The engines on your ultra-high speed plane design (Last Dancer) would now *EXPLODE* a LONG TIME BEFORE reaching the kinds of speeds you accomplished using level-2 fusion reactors coupled to level-2 TTJ\u0027s, as the KSP Interstellar thermal turbojets now overheat much more readily (due to compression-heating) at high speeds in atmospheric use- and require a (slightly heavy, and actually functional- unlike the stock and B9 Aerospace versions) precooler part directly attached to the air-intakes to prevent engine overheats...\u003C/p\u003E\u003Cp\u003EAlso, you MIGGGGHT want to check the fuel-consumption on those fusion reactors... In the newest update, those reactors will burn through their entire fuel supply in just a couple weeks or less (the more powerful reactors consume their fuel much more quickly)- not years... Even the level-1 1.25 meter fission reactors can only last about a year on their full (100%) reactor loading in 0.90- which is not coincidentally why I performed a manual shutdown on the nuclear reactors of my Blackhawk Mk6 as soon as I reached LKO... (the Blackhawk Mk6, with its less than 5% reactor load, now only carries enough fissile fuel for a couple weeks of standby reactor operation- or about a week of full-throttle flying. The RTG included in the design provides all necessary power for maneuvering and imagined life-support during the long Trans-Dunar injection.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T11:22:56Z\u0022 title=\u002212/18/2013 11:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"}]}