{"TopicId":46635,"ForumId":55,"TopicTitle":"Simple Modular Difficulty","CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2013-09-26T22:54:38Z","PageNum":1,"Articles":[{"CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2013-09-26T22:54:38Z","Content":"\n\u003Cp\u003EI recall seeing in another thread someone mention that difficulty is not likely to be implimented. \u003C/p\u003E\u003Cp\u003EIf we are talking about difficulty options a typical game has, then I agree with this. KSP does not need a vague, blanket and hard-wired \u0022easy,\u0022 \u0022medium,\u0022 and \u0022hard\u0022 somewhere. I\u0027d just as soon prefer to remain with \u0022one difficulty\u0022 like we have now, and mod the game, then deal with a \u0022blanket difficulty option.\u0022 \u003C/p\u003E\u003Cp\u003EHowever, the idea of \u0022modular difficulty\u0022 appeals to me. This would essentially be a small list of toggles and selections you can make before starting a new game. The mechanics in question would not alter core parts of the game much, but rather would apply a simple multiplier to how that saved game reads certain information before treating it the same it always does. I\u0027ll give some potential examples. \u003C/p\u003E\u003Cp\u003EEdit: Subsequent posts have convinced me that one of the ideas is probably best NOT to have. Specifically, the fuel related one. It is likely best if all aspects of \u0022modular difficulty\u0022 have no effect on the general stats of parts with regards to flight, thrust, delta-v, range, etc. \u003C/p\u003E\u003Cp\u003ELets say the first of that short list was \u0022fuel difficulty\u0022 (putting aside that it is still called \u0022difficulty\u0022 for lack of creativity in naming on my part). \u003C/p\u003E\u003Cp\u003ESetting it to easy would make it such that all fuel-containing parts contain 1.2 times as much fuel as usual (this is a good bit more then it sounds actually considering the exponential nature of rocket mass vs delta-V). Setting it to hard would perhaps make them contain 0.85 times as much as normal. It would be a simple multiplier applied to the maximum fuel levels of all parts in that game, no more and no less. Perhaps there could be a \u0022custom\u0022 setting in which you input the multiplier yourself in sandbox mode. \u003C/p\u003E\u003Cp\u003ELets say the next item on the list is \u0022research difficulty\u0022 \u003C/p\u003E\u003Cp\u003EIt would be the same sort of things. A simple base multiplier applied to research generated. Easier means you get a bit more research. Harder means you get a bit less. You can set this one independantly of fuel. So perhaps you want harder fuel economy, but to make research easier (or maybe you want the reverse)? Just select a different option for each modular part of the difficulty settings. This applies to any given thing that has a little \u0022difficulty\u0022 option for it. \u003C/p\u003E\u003Cp\u003ENow lets say that Life Support gets added at some point. And that EVAs have a life support timer, and the kerbal dies when it runs out. But it recharges itself when inside any ship or station with its life support turned on (or on any planet with breathable atmosphere), and continues draining in ships without powered life support. And that said life support systems for ships and stations requires a small power draw to function. \u003C/p\u003E\u003Cp\u003EFor this, there could just be \u0022normal,\u0022 \u0022easy,\u0022 and \u0022off.\u0022 Or even just \u0022on\u0022 and \u0022off.\u0022 If the former, normal would be normal, easy could perhaps double EVA life support time and halve power requirements for life support systems, and \u0022off\u0022 would simply allow the kerbals to live forever like they do currently (putting aside whether they can fly or turn unpowered ships or not). \u003C/p\u003E\u003Cp\u003EThat is the gist of my suggestion. A difficulty option like most games is a bad idea because of the nature of this game. And because it would be a pain to try and \u0022balance\u0022 different preset difficulties for different parts of the game\u0027s player base. Doing so may also require a good deal of work and effort to adjust parts of the deeper game mechanics to satisfy people as well, which is a pain in the laval nozzle. \u003C/p\u003E\u003Cp\u003EHowever, make it a simplistic modular system like the one I outlined, and you don\u0027t have to balance it in any way. Any given \u0022normal\u0022 will simply be setting a simple multiplier to 1, so that it uses the default statistics for parts and such. And said multipliers are simple and can probably be added without needing to interfere with core game system mechanics much. The multiplier could simply be applied to the stats in question when it loads part fuel capacity/be applied to the part stats already saved in RAM when a new game is started or a saved game is loaded. \u003C/p\u003E\u003Cp\u003EBest of all, if a particular player happens to have a somewhat skewed sense of how hard or easy they want some aspect of the game, they can just adjust that piece of the modular options, rather then having to mod their parts manually or come here and complain about it being too easy or hard to acquire \u0022science points\u0022 or something (despite other people perhaps feeling its just fine as-is, and not wanting it to be changed; modular difficulty allows both groups of people to enjoy the game equally). \u003C/p\u003E\u003Cp\u003EIt may also improve replay value for those who might like to play the game easier at first, then start a new game that is \u0022more strict.\u0022 \u003C/p\u003E\u003Cp\u003EBefore implementing a starting-a-new-game menu for these options, they could also be added one at a time to the debug/cheats menu to allow for testing before making them a proper feature as well. So they needn\u0027t all be added at once. \u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-18T18:25:14Z\u0022 title=\u002210/18/2013 06:25  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 18, 2013\u003C/time\u003E by Ryu Gemini\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-09-27T00:07:06Z","Content":"\n\u003Cp\u003EI very much like this modular approach - you have my support.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-09-27T00:48:15Z","Content":"\n\u003Cp\u003Eand mine, too\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-27T03:20:56Z","Content":"\n\u003Cp\u003EThirded. I\u0027ve seen it done in flight simulators in general for as long as I can remember.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-09-27T05:33:38Z","Content":"\n\u003Cp\u003Ei dont share this idea.\u003C/p\u003E\u003Cp\u003EThere will be some craft design that only would serve for certain level of difficulty.\u003C/p\u003E\u003Cp\u003EIf that happens then we cant share ship any more.\u003C/p\u003E\u003Cp\u003EPeople need to learn how to do it right from the first time. If is hard for them they can always get a little help from the debug menu to get more fuel. But if they wanna do it right, they need to learn sooner or later.\u003C/p\u003E\u003Cp\u003EAnd KSP is not about difficulty, is about what kind of desings we do.\u003C/p\u003E\u003Cp\u003ESomeone with experience can send a really big ship to duna with full equip, and somebody noob will send only a pod with a kerbal.\u003C/p\u003E\u003Cp\u003EThat is the difference, but also the first step. That would encourage him/she to do it better next time.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-09-27T06:06:25Z","Content":"\n\u003Cp\u003EI think it is a great idea, adds a bunch of flexibility to the difficulty. However, people would brag and say \u0022I\u0027m way better than you, I made it to the Mun on the 164874th attempt with all difficulty options to hard!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-27T07:02:43Z","Content":"\n\u003Cp\u003ETailoring the game to a personal preference of difficulty. I like. The only problem I forsee has already been said once. craft files and designs built on hard, would be insane overkill on easy and easy would be nowhere close on hard therefore, the shipbuilding community may not see this as such a great idea. That aside, I think this is one of the better approaches to difficulty out there.\u003C/p\u003E\n"},{"CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2013-09-29T23:54:20Z","Content":"\n\u003Cp\u003EThat is a definite concern. One way the community could deal with it would be to have an unofficial rule to only use a \u0022standard\u0022 set of settings when designing ships. Presumeably the setting with the multiplier of 1. Or they could make it a point to specify which fuel difficulty they were using, and nag people who forget to mention it until they do. \u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Djsnowboy267","CreatedById":34545,"CreatedDateTime":"2013-09-30T00:38:33Z","Content":"\n\u003Cp\u003EPersonally, I would like to see the option do disable certain features like life support. However, I don\u0027t like the idea of difficulty levels like you described for the fuel. I feel it might throw of the balance of certain parts, and would just mess with the shipbuilding community, as others state.\u003C/p\u003E\n"},{"CreatedByName":"team.leit","CreatedById":68347,"CreatedDateTime":"2013-09-30T01:58:18Z","Content":"\n\u003Cp\u003EOr something that could be done is have it only for the career mode and have the sandbox remain unaffected by it, that way people could still share ships, they would just have to say if they made it in sandbox or if they made it in career then they would have to say the settings they used.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ESorry for rambling on\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EKaos\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-09-30T02:51:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Djsnowboy267\u0022 data-cite=\u0022Djsnowboy267\u0022\u003E\u003Cdiv\u003EPersonally, I would like to see the option do disable certain features like life support. However, I don\u0027t like the idea of difficulty levels like you described for the fuel. I feel it might throw of the balance of certain parts, and would just mess with the shipbuilding community, as others state.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. Personally, I wouldn\u0027t disable those features, but if the option to disable them will keep people from complaining about it, OK\u003C/p\u003E\n"},{"CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2013-10-04T00:00:36Z","Content":"\n\u003Cp\u003EHow about this then: \u003C/p\u003E\u003Cp\u003EThe same idea. But nothing that modifies things that would actually affect ship capabilities (i.e. fuel). \u003C/p\u003E\u003Cp\u003EIts probably safe to assume that a ship built by someone with life support turned off for instance will still be capable of functioning well enough due to the likelihood of the system being built into a crew chamber part. And if its not, then you can slap on a couple uranium generators so it doesn\u0027t run out of power. \u003C/p\u003E\u003Cp\u003EAnd making it such that you don\u0027t have to build quite as well to unlock the next set of ship parts (i.e. something that modifies how quickly you gain \u0022science points\u0022 for the upcoming features) also doesn\u0027t affect a ship\u0027s characteristics. It merely determines when you can build the ship in question. \u003C/p\u003E\u003Cp\u003EYou guys have convinced me that a fuel multiplier option would be annoying to deal with, community-and-ship-sharing-wise. The rest of the ideas still stand however. Which really makes it all the less like a difficulty option now, actually, but more of a way to modify your personal game experience a bit without altering the core aspects of what makes a particular ship capable of doing what that particular ship does.\u003C/p\u003E\n"},{"CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2013-10-18T18:25:44Z","Content":"\n\u003Cp\u003EAny more comments?\u003C/p\u003E\n"}]}