{"TopicId":46695,"ForumId":16,"TopicTitle":"Superglued landing gear","CreatedByName":"AWellTrainedFerret","CreatedById":83471,"CreatedDateTime":"2013-09-27T17:44:31Z","PageNum":1,"Articles":[{"CreatedByName":"AWellTrainedFerret","CreatedById":83471,"CreatedDateTime":"2013-09-27T17:44:31Z","Content":"\n\u003Cp\u003EOk, so recently I\u0027ve been having a problem with landing gear being stuck to the runway. I mean like stuck as in even kicking in rockets for a nearly 4:1 wtr doesn\u0027t even budge them. I\u0027ve tried toggling brakes, and nothing. I\u0027ve tried removing the landing gear and placing them differently, still nothing. Here is a pic of the plane on the runway:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xxz4uop.png\u0022 alt=\u0022xxz4uop.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote how the rear landing gear isn\u0027t even settling on the ground. The front landing gear is so stuck to the runway that it actually holds the plane up.\u003C/p\u003E\u003Cp\u003ENow, just to clarify that this isn\u0027t an issue with the engine thrust being blocked by the rear wings, here\u0027s a pic with those rear wings removed:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y6pGI3b.png\u0022 alt=\u0022y6pGI3b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe plane still won\u0027t even budge. Thrust vectoring will make the plane wobble as if it\u0027s trying to move, but the landing gear are firmly cemented to the ground.\u003C/p\u003E\u003Cp\u003EAny help would be appreciated.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-27T19:49:27Z\u0022 title=\u002209/27/2013 07:49  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 27, 2013\u003C/time\u003E by AWellTrainedFerret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nexustrimean","CreatedById":33308,"CreatedDateTime":"2013-09-27T18:47:19Z","Content":"\n\u003Cp\u003ETry Toggling the breaks with the B key.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-09-27T18:52:29Z","Content":"\n\u003Cp\u003EIt\u0027s those girders that you have the mounted on. There\u0027s something about them and how they are handled by the physics engine because of a property on them set in their parts file.\u003C/p\u003E\n"},{"CreatedByName":"Cranium","CreatedById":69153,"CreatedDateTime":"2013-09-27T19:11:11Z","Content":"\n\u003Cp\u003ENow, do you set your brakes to start off, then throttle up?\u003C/p\u003E\u003Cp\u003EIf so, I\u0027ve experienced the same thing on much smaller planes, the problem being that when you brake, and throttle up, part of it clips through the ground, gluing you there. You can \u0027fix\u0027 this by \u0027wiggling\u0027 around, or just waiting until the thrust overcomes the quicksand.\u003C/p\u003E\n"},{"CreatedByName":"AWellTrainedFerret","CreatedById":83471,"CreatedDateTime":"2013-09-27T19:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nexustrimean\u0022 data-cite=\u0022Nexustrimean\u0022\u003E\u003Cdiv\u003ETry Toggling the breaks with the B key.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI already mentioned in first post that toggling brakes doesn\u0027t help.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EIt\u0027s those girders that you have the mounted on. There\u0027s something about them and how they are handled by the physics engine because of a property on them set in their parts file.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe second pic can\u0027t show it very well, but I removed the mod\u0027d girders and used vanilla structural parts. It still doesn\u0027t help.\u003C/p\u003E\n"},{"CreatedByName":"AWellTrainedFerret","CreatedById":83471,"CreatedDateTime":"2013-09-27T19:40:50Z","Content":"\n\u003Cp\u003EAlright, so I figured out what the problem is. The front of the SSTO is a small lander that is just strong enough to land and return to orbit from any place except Eve and Laythe. Problem is, I\u0027m using Quantum struts to keep it in place because the docking port isn\u0027t nearly strong enough.\u003C/p\u003E\u003Cp\u003EApparently, Quantum struts can sometimes lock a plane in place. (I say sometimes because my heavy lift shuttle uses them to stabilize the cargo, and it flies fine)\u003C/p\u003E\u003Cp\u003EI\u0027m not really sure what exactly causes this, but I guess I need to completely re-think my plans of using interplanetary SSTOs if I can\u0027t get a lander to safely dock to it for the return trip \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-27T20:12:10Z","Content":"\n\u003Cp\u003EWhat happens when you go off the end of the runway? It\u0027s elevated quite a bit at the far end, so you\u0027ll at least briefly be airborne, even if you can\u0027t get the wheels off the ground normally. What happens then is generally indicative of what\u0027s causing the problem.\u003C/p\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2013-09-27T20:56:34Z","Content":"\n\u003Cp\u003EQuantum Struts targeting cubic octogonal struts (and propably similar parts) can lock themselves in place. Not in place relative to the vessel, as you would expect, but to the target body or something. There was a video on youtube where someone build a...vessel with Quantum Struts and Infernal Robotics which abused this effect to kind of walk through the air.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-09-27T22:28:22Z","Content":"\n\u003Cp\u003EI had the same problem when a quantum strut attached to one of the small non-extendable ladders.\u003C/p\u003E\n"},{"CreatedByName":"Mangles91","CreatedById":98157,"CreatedDateTime":"2014-05-07T04:32:47Z","Content":"\n\u003Cp\u003EIs there a way to use quantum struts without this happening? \u003C/p\u003E\u003Cp\u003E I\u0027ve been attempting the affordable space program challenge but I\u0027ve been defeated by my ssto being so stuck to the runway, even lifting the legs and flooding in the air, that nothing moves me even crashing a crane into it doesn\u0027t move it. If I don\u0027t engage the QS until I\u0027m airborne will that fix it?\u003C/p\u003E\n"}]}