{"TopicId":46721,"ForumId":16,"TopicTitle":"Eve, 12,000 Delta-V... Really?","CreatedByName":"Talonsin","CreatedById":76826,"CreatedDateTime":"2013-09-28T00:05:26Z","PageNum":1,"Articles":[{"CreatedByName":"Talonsin","CreatedById":76826,"CreatedDateTime":"2013-09-28T00:05:26Z","Content":"\n\u003Cp\u003EDoes it really take 12,000 delta-V to land or launch from Eve? Obviously you can use parachutes on the way down and reduce the needed Delta-V but does it really take 12,000 to launch into a low orbit from Eve? Anyone land and take off from Eve? If you have, how about a pic of your ship? \u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-28T00:40:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talonsin\u0022 data-cite=\u0022Talonsin\u0022\u003E\u003Cdiv\u003EDoes it really take 12,000 delta-V to land or launch from Eve? Obviously you can use parachutes on the way down and reduce the needed Delta-V but does it really take 12,000 to launch into a low orbit from Eve? Anyone land and take off from Eve? If you have, how about a pic of your ship? \u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEve has 1.7 times as much gravity as Kerbin and an atmosphere 5 times thicker than Kerbin\u0027s at their respective sea levels. The atmosphere also extends about 27km higher than Kerbin\u0027s. All this adds up to substantially increased drag and gravity losses, plus needing to go higher (because of the greater extent of the atmosphere) and faster (because of the higher gravity) before reaching a stable orbit.\u003C/p\u003E\u003Cp\u003EEve is the hardest place to land and return from...although strictly by virtue of the fact that you can\u0027t land on Kerbol or Jool.\u003C/p\u003E\u003Cp\u003EI can\u0027t say for sure that the number\u0027s accurate, but given the atmospheric and gravity characteristics I wouldn\u0027t be at ALL surprised if it were HIGHER than that.\u003C/p\u003E\n"},{"CreatedByName":"Syhrus","CreatedById":64839,"CreatedDateTime":"2013-09-28T01:07:29Z","Content":"\n\u003Cp\u003EI\u0027d suggest following Scott Manley\u0027s current series. He\u0027s trying to do just this.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-09-28T02:18:54Z","Content":"\n\u003Cp\u003EEvery kilometre of altitude you can gain from sea level is more than 800m/s you save in Delta-v in the ascent. Launching from the highest point on Eve is roughly 7000m and that\u0027s enough to make the required launcher not much more demanding than a Kerbin sea-level launch.\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-09-28T02:21:53Z","Content":"\n\u003Cp\u003EEven from the highest mountains, the usual number people throw around is 7km/s to get into Eve orbit.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-28T03:39:56Z","Content":"\n\u003Cp\u003EOn the plus side, if you can somehow get high enough that gravity stops being a problem for the LV-N\u0027s thrust-to-weight issues, they reach 99% of their Isp efficiency just after 43km up, at least if the same principles apply as in Kerbin\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EGranted, I have yet to actually test this to see if it\u0027s practical.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T03:47:15Z\u0022 title=\u002209/28/2013 03:47  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-28T03:58:16Z","Content":"\n\u003Cp\u003EThe LV-Ns are so bloody heavy though. I think you\u0027d waste more dV than you\u0027d save dragging them to an altitude where they would work.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-09-28T04:03:47Z","Content":"\n\u003Cp\u003EWith mod or mechjeb, yes. Without = No. \u003C/p\u003E\u003Cp\u003EPinpoint landing on Eve is hard, driving up hill to 7000m is even harder. Why the hack take the risk? Check my sign, my craft takeoff from Eve sea. and Yes, it can land on the Eve sea. Tested and proven, Just one thing, you can\u0027t plant a flag on water.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-09-28T04:08:17Z","Content":"\n\u003Cp\u003EI built a lander with 10.5k delta-v and after about half a dozen failed attempts to land it on a mountain, I landed it on some plains about 2km high.\u003C/p\u003E\u003Cp\u003EIt failed to get up to orbit and jebediah fell back down into the ocean and died.\u003C/p\u003E\n"},{"CreatedByName":"csanders","CreatedById":82143,"CreatedDateTime":"2013-09-28T05:12:04Z","Content":"\n\u003Cp\u003EThis is what it took to get me off of Eve. And yes, it\u0027s Dv is around 12000m/s. If you look at all the parachute packs, that\u0027s so I could land without burning hardly any fuel - and they all decouple on launch, along with the landing legs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://growlersoftware.com/users/kerbal/2013-09-23_0000202.jpg\u0022 alt=\u00222013-09-23_0000202.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eafter launch:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://growlersoftware.com/users/kerbal/2013-09-23_0000503.jpg\u0022 alt=\u00222013-09-23_0000503.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMamma I\u0027m coming home\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://growlersoftware.com/users/kerbal/2013-09-24_0000105.jpg\u0022 alt=\u00222013-09-24_0000105.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T05:16:36Z\u0022 title=\u002209/28/2013 05:16  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by csanders\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-09-28T05:26:08Z","Content":"\n\u003Cp\u003EFAR tends to reduce aerodynamic effects for most launches on Kerbin. How does it alter the Eve situation?\u003C/p\u003E\n"},{"CreatedByName":"csanders","CreatedById":82143,"CreatedDateTime":"2013-09-28T05:28:13Z","Content":"\n\u003Cp\u003EFYI, that ship has 6 outer asparagus stages, with 1 onion stage (the engines without the doubled up fuel tanks). The onion stage gave higher TWR, the asparagus gave efficiency.\u003C/p\u003E\u003Cp\u003EThe two red dots on the \u0022after launch\u0022 picture are SAS modules - I used to have ONE on the second to last stage, didn\u0027t work. The thing is almost all aerospike engines, thus unstable, so it does need them to take off from a non-level service. Moving the SAS to the first aspargus stage that decoupled was key. Looking at that design, I could probably get more by making the last decoupler smaller as well.\u003C/p\u003E\n"}]}