{"TopicId":46778,"ForumId":19,"TopicTitle":"Mein erster Satellit im Orbit!","CreatedByName":"Taurec","CreatedById":83561,"CreatedDateTime":"2013-09-28T15:37:58Z","PageNum":1,"Articles":[{"CreatedByName":"Taurec","CreatedById":83561,"CreatedDateTime":"2013-09-28T15:37:58Z","Content":"\n\u003Cp\u003ENachdem ich meine Probleme mit den Feststoffboostern lÃƒÂ¶sen konnte (Ich hatte einfach eine falsche Reihenfolge bei den Stufen: Die Booster wurden gezÃƒÂ¼ndet, aber die Halteklammern lÃƒÂ¶sten sich nicht, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ), habe ich es geschafft, meinen ersten Satelliten ins All zu schieÃƒÅ¸en. Da isser:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bilder-hochladen.net/files/4e7o-aj-0c74-jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://www.bilder-hochladen.net/files/thumbs/4e7o-aj-0c74.jpg\u0022 alt=\u00224e7o-aj-0c74.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnd daneben das Mutterschiff, dass nun wieder nach Kerbal zurÃƒÂ¼ckkehren sollte:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bilder-hochladen.net/files/4e7o-ah-0504-jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://www.bilder-hochladen.net/files/thumbs/4e7o-ah-0504.jpg\u0022 alt=\u00224e7o-ah-0504.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDa ich nur noch wenig Sprit hatte, setzte ich ein BremsmanÃƒÂ¶ver so an, dass der niedrigste Punkt in der AtmosphÃƒÂ¤re saÃƒÅ¸, um diese zum Bremsen zu nutzen. Nach dem Verlassen der AtmosphÃƒÂ¤re wollte ich dann mit dem restlichen Treibstoff ein LandemanÃƒÂ¶ver so setzen, dass ich wieder beim KSC ankommen sollte. Doch ich hatte mich verschÃƒÂ¤tzt:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bilder-hochladen.net/files/4e7o-ag-5ef6-jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://www.bilder-hochladen.net/files/thumbs/4e7o-ag-5ef6.jpg\u0022 alt=\u00224e7o-ag-5ef6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELaut Mechjebs Orbitanzeige wÃƒÂ¼rde ich die AtmosphÃƒÂ¤re nicht wieder verlassen kÃƒÂ¶nnen, ich hatte den Punkt zu niedrig gewÃƒÂ¤hlt! Obendrein hatte ich auch noch vergessen, dass ich in der Nachthalbkugel landen wÃƒÂ¼rde... Und auÃƒÅ¸erdem hatte ich vergessen, Landebeine zu montieren! Nun... Schlechte Sicht wegen Dunkelheit und ein Erdboden, der 1.500 Meter ÃƒÂ¼ber dem Meeresspiegel lag (Man sollte das Bodenradar auch sehen kÃƒÂ¶nnen! GRRRR!) fÃƒÂ¼hrten dann zu:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bilder-hochladen.net/files/4e7o-ai-cf00-jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://www.bilder-hochladen.net/files/thumbs/4e7o-ai-cf00.jpg\u0022 alt=\u00224e7o-ai-cf00.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETrotz 4 Fallschirmen... Eigentlich wollte ich kurz ÃƒÂ¼ber dem Erdboden dann noch mal das Triebwerk zÃƒÂ¼nden, um langsamer aufzusetzen und den Tank leer zu bekommen, aber leider hatte ich mich auf die HÃƒÂ¶henanzeige verlassen. Und so... BUMM. Trost: Alles ist/war unbemannt. Aus der Erfahrung kann ich ja nur lernen.\u003C/p\u003E\u003Cp\u003EWarum ist das Schiff eigentlich explodiert? Die Sinkgeschwindigkeit lag zuletzt noch bei 9,5 m/s, lags Am Bodenkontakt mit dem Triebwerk? Oder daran, dass noch Treibstoff im Tank war?\u003C/p\u003E\u003Cp\u003EWeitere PlÃƒÂ¤ne:\u003C/p\u003E\u003Cp\u003EDen ausgesetzten Satelliten will ich auf einen geostationÃƒÂ¤ren Orbit schaffen. Das hatte ich schon vorher geplant, deshalb verfÃƒÂ¼gt der Satellit ÃƒÂ¼ber eine Dockingvorrichtung. Ich kann nun also mit einem besser ausgerÃƒÂ¼steten Schiff zurÃƒÂ¼ckkehren und den Orbit (derzeit 747 -750 Km) entsprechend erweitern. \u003C/p\u003E\u003Cp\u003ESpÃƒÂ¤ter mÃƒÂ¶chte ich dann noch einen Pol-zu-Pol Orbit versuchen und irgendwann dann mal die Landung auf einem der Monde. Aber bis dahin muss ich noch viel lernen. *lach*\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T17:40:55Z\u0022 title=\u002209/28/2013 05:40  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by Taurec\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoHun","CreatedById":92103,"CreatedDateTime":"2014-01-17T11:15:21Z","Content":"\n\u003Cp\u003EMoin!\u003C/p\u003E\u003Cp\u003EIch glaube, es lag an der hohen Sinkgeschwindigkeit. Ich versuche, auf weniger als 5 m/s zu kommen, aber ich lande meist nur Kapseln - alles unbemannte lasse ich herzlos zerschellen :-)\u003C/p\u003E\u003Cp\u003ETschÃƒÂ¼s!\u003C/p\u003E\u003Cp\u003EHoHun\u003C/p\u003E\n"},{"CreatedByName":"Seth","CreatedById":101095,"CreatedDateTime":"2014-01-21T08:29:34Z","Content":"\n\u003Cp\u003EBei den einzelnen Teilen gibt es mitlerweile eine Anzeige fÃƒÂ¼r die \u0022Impact Tolerance\u0022. Eigentlich sollte diese einem verraten wie schnell man damit landen darf. Habe ich jedoch selbst noch nicht drauf geachtet.\u003C/p\u003E\u003Cp\u003EWas die HÃƒÂ¶henanzeige angeht: Das ist die HÃƒÂ¶he ÃƒÂ¼ber Normal Null und nicht die RadarhÃƒÂ¶he. Bedeutet also das sie sich auf den Meeresspiegel bezieht (auch dort wo es keinen gibt). In Kapseln hat man die MÃƒÂ¶glichkeit im IVA die RadarhÃƒÂ¶he zu sehen und ansonsten kÃƒÂ¶nnen einem KER oder MJ helfen.\u003C/p\u003E\n"}]}