{"TopicId":46853,"ForumId":32,"TopicTitle":"Where all have you taken the stock rover?","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-09-29T06:49:51Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-09-29T06:49:51Z","Content":"\n\u003Cp\u003ELast night I dug out the \u003Ca href=\u0022http://partsbyemc.com/pub/RovaLifter.craft\u0022 rel=\u0022external nofollow\u0022\u003ERovaLifter\u003C/a\u003E, which I\u0027d put together just to dink around with, getting the stock rover that comes with KSP into orbit and landing it back at KSC a couple of times, and to try out procedural fairings. Getting it back to Kerbin with solar panels intact is simply a matter of leaving the last stage on until reentry heat is done. MJ then does fine with waiting until the atmo slows it down enough for the skycrane rockets to safely land it - on the edge of the pad railway, off which it rolls and trashes half the panels and two wheels, but it still moves.\u003C/p\u003E\u003Cp\u003EI figured I\u0027d need to do some changes to get it to the Mun, I\u0027d made it before I found out that nosecones increase drag... I didn\u0027t recall how high I\u0027d flown it so I aimed for 75KM with MJ on its default path... and it made it. There\u0027s still fuel left! Hohmann transfer to Mun, here we go. If it runs out I can always stick on a clampotron jr. and make a mini refueler to send up for the next try.\u003C/p\u003E\u003Cp\u003ESurely it wouldn\u0027t have enough left to get into a circular orbit, and reduce the periapsis to 10KM, and circularize again... Yep, did, with still a little left over. OK, F5 in case of a screwup, jettison the transfer stage and we are go for landingohcrapitusedallthefuelintwoseconds! F9! F9!\u003C/p\u003E\u003Cp\u003EOK, *don\u0027t* jettison the transfer stage, ride it down on empty until an altitude befitting the flyweight mass of the rover and its puny amount of fuel, then cut the final stage loose and touchdown, we are ready to roll on the Mun - after mission ctrl hits left shift then spacebar real quick to toss the skycrane.\u003C/p\u003E\u003Cp\u003ESo now the rover is sort of stuck in a big crater inside that very large and dark crater on the upper half of the Mun. Haven\u0027t been able to drive out without it tumbling down the hillside. But it\u0027s on the Mun, using a rocket I put together with no intention of it going beyond LKO, before I\u0027d sent anything to the Mun or anywhere else. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the Mun that rover is pretty tough. One tumble broke nothing. Quite funny to see the antenna repeatedly stabbing into the ground but not breaking off. One only broke three of the solar panels, without breaking any off. The last one left it with only the probe body, two batteries, the center wheels and the base plate it\u0027s all attached to, and I could still drive it around (dragging one end or the other) until it ran out of power. I tried to break it more but just ended up at the lowest part of the crater.\u003C/p\u003E\u003Cp\u003EP.S. I renamed the rover \u0022MunRovia\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhere have you taken the stock rover?\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T06:52:38Z\u0022 title=\u002209/29/2013 06:52  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-09-29T07:57:39Z","Content":"\n\u003Cp\u003EKerbin.\u003C/p\u003E\u003Cp\u003EAnd the mun ON TOP OF ANOTHER ROVER.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve developed a lithobraking technique for Minmus, works quite well.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-29T12:56:15Z","Content":"\n\u003Cp\u003EIt\u0027s on Minmus, currently heading towards a nearby lake for easy and fun driving.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-09-29T13:02:58Z","Content":"\n\u003Cp\u003EMinmus, the MÃƒÂ¼n, Gilly, and even - sorta accidentally - Eve. I sent a dual-rover mission to Gilley but after taking so damned long to land on Gilly due to the low gravity, I decided to just dump my second rover in Eve and be done with it. Even without chutes, that darn thick atmosphere slowed it enough to survive a crash landing skycrane-down. The crane stage exploded and tossed the rover off to the side. One wheel got sort of embedded into the Eve surface but even tilted down and stuck in that attitude, I could drive it all around the landing site. All the solar panels ans science instruments survived too, which was pretty amazing.\u003C/p\u003E\n"}]}