{"TopicId":4689,"ForumId":18,"TopicTitle":"Anyone else manage this?","CreatedByName":"tjrieves","CreatedById":1379,"CreatedDateTime":"2011-12-19T01:24:50Z","PageNum":1,"Articles":[{"CreatedByName":"tjrieves","CreatedById":1379,"CreatedDateTime":"2011-12-19T01:24:50Z","Content":"\n\u003Cp\u003ESo, I think I may have launched the Kermans into the Sun...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UABYq.jpg\u0022 alt=\u0022UABYq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEverything was going fine. I wanted to land on Mun with a simple two stage rocket. Eventually, it started accelerating too rapidly, and everything blew up. Well, everything except for the command module. I decided to fast-forward, and within half a second that shot past Mun. Eventually, \u003Cem\u003Esomething\u003C/em\u003E with a strong gravitational pull caused me to stop accelerating, and then accelerate in the opposite direction. I thought it was Kearth, as I was losing altitude, but as time wore on, I noticed that the Sun was getting larger, until all it was all I could see. As of writing this, I still have 100,000 Km to go until I figure out what\\\u0027s going on.\u003C/p\u003E\n"},{"CreatedByName":"tjrieves","CreatedById":1379,"CreatedDateTime":"2011-12-19T01:31:24Z","Content":"\n\u003Cp\u003EUPDATE\u003C/p\u003E\u003Cp\u003EIt seems I am done accelerating, but now I am rapidly gaining altitude.\u003C/p\u003E\u003Cp\u003EUPDATE 2.0\u003C/p\u003E\u003Cp\u003EWhile writing that, I checked KSP again. I have gone through the Sun. I am now on the \u0027other side\u0027, and I hypothesize that I will continue back and forth like a yo-yo, gaining and losing altitude, accelerating and slowing down, until I come to rest at the \u0027center\u0027 of the Sun.\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2011-12-19T01:40:33Z","Content":"\n\u003Cp\u003Enope, the orbit you have is the orbit you have and your command pod is stickin\\\u0027 to it.\u003C/p\u003E\u003Cp\u003Ealso\u003C/p\u003E\u003Cp\u003Eyou are \u003Cem\u003Eway\u003C/em\u003E past escape velocity\u003C/p\u003E\u003Cp\u003Ekerbol\\\u0027s escape velocity is 28km/s\u003C/p\u003E\n"}]}