{"TopicId":46947,"ForumId":25,"TopicTitle":"Alien Planet Challenge","CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2013-09-30T03:19:24Z","PageNum":1,"Articles":[{"CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2013-09-30T03:19:24Z","Content":"\n\u003Cp\u003EYour scientists have discovered an exo-planet two light-years away from kerbin that may support life on it! The KSC has put you to the task of building a ship to explore this planet and determine if this is so!\u003C/p\u003E\u003Cp\u003EMission instructions: the ship has to have two main sections: the propulsion/communications center and the P.R.O (Plannetary Reconnaissance Orbiter). The P.R.O will carry three rovers that will explore the surface and take samples of the enviroment, along with any objects of interest discovered. The ship will have interstellar capabilities (meaning able to exit the solar system) and a shield in front of the craft to protect it from high speed collision impacts from interstellar particles and gas.\u003C/p\u003E\u003Cp\u003EMission Procedure: After leaving our solar system, the craft will enter the alien solar system and will rendevous with the third planet from Star AB3561 AKA \u0022Darwin\u0022. Then when the craft achieves a stable circular orbit around Exo-planet KC0945 AKA \u0022Erasmus I\u0022 the craft\u0027s communication\u0027s relay will deploy and the P.R.O will seperate itself from the communications/propulsion center and enter a circular polar orbit. The P.R.O will then map out the surface of Erasmus I until full mapping is accomplished. The three rovers will then seperate from the P.R.O and land on the surface to conduct further scientific research.\u003C/p\u003E\u003Cp\u003EMission Goal: To determin if life does exist on Erasmus I, and if so, to explore and catagorize any lifeforms that are encountered.\u003C/p\u003E\u003Cp\u003EChallenge Goal: The ship has to be as large as you can build it, and still be able to fly, with 5 points awarded to every 30 parts that make up the ship.\u003C/p\u003E\u003Cp\u003EYou cannot use over-powered parts or mods like hyper-edit, but other than that you can use any mods you want.\u003C/p\u003E\u003Cp\u003EEdit: This challenge DOES NOT involve actually going out two light years. It does involve going into an orbit a little beyond Eeloo and returning after 200 days (for the sake of time).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T11:12:45Z\u0022 title=\u002209/30/2013 11:12  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by Geo793\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-09-30T03:57:43Z","Content":"\n\u003Cp\u003EUm... so to be clear, does this challenge actually involve going 2 light-years away and returning?\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-09-30T04:29:16Z","Content":"\n\u003Cp\u003ECan someone click on the report thread to ask moderator to send OP to 2 light-year away?\u003C/p\u003E\n"},{"CreatedByName":"chuangatronic","CreatedById":78585,"CreatedDateTime":"2013-09-30T08:31:44Z","Content":"\n\u003Cp\u003ESo... how many people have successfully left Kerbol SOI WITHOUT encountering a kraken attack?\u003C/p\u003E\n"},{"CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2013-09-30T10:55:26Z","Content":"\n\u003Cp\u003Eno, just go a little beyond Eeloo and park there for a while to simulate going into interstellar space. You do not actually go two light years out.\u003C/p\u003E\n"},{"CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2013-09-30T10:56:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chuangatronic\u0022 data-cite=\u0022chuangatronic\u0022\u003E\u003Cdiv\u003ESo... how many people have successfully left Kerbol SOI WITHOUT encountering a kraken attack?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually went extremely far out of the solar system before hitting the kraken, so it should not be a problem.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-09-30T10:58:42Z","Content":"\n\u003Cp\u003EPlease....\u003C/p\u003E\u003Cp\u003EGo read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24898-Challenge-Submission-Rules\u0022 rel=\u0022external nofollow\u0022\u003EChallenge Submission Rules\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2013-09-30T11:06:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EPlease....\u003Cp\u003EGo read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24898-Challenge-Submission-Rules\u0022 rel=\u0022external nofollow\u0022\u003EChallenge Submission Rules\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis should be in code, except for one thing, which I will correct as soon as I can.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-09-30T16:04:35Z","Content":"\n\u003Cp\u003EBeyond the few specific requirements you\u0027ve listed this challenge still needs more information and preferrably additional scoring beyond \u0022most parts wins\u0022.\u003C/p\u003E\u003Cp\u003EAdditional information could/should include:\u003C/p\u003E\u003Cp\u003E- Planetary information, what gravity / atmosphere would the rovers be landing at?\u003C/p\u003E\u003Cp\u003E- Do the rovers need to land on one location or three separate, if the latter how far apart?\u003C/p\u003E\u003Cp\u003E- Do the rovers have to be manned?\u003C/p\u003E\u003Cp\u003E- Sample / crew return capabilities?\u003C/p\u003E\u003Cp\u003E- How do we demonstrate landing/return capabilities?\u003C/p\u003E\u003Cp\u003E- Crew requirements on the main ship?\u003C/p\u003E\u003Cp\u003E- In case of crew, emergency return capabilities?\u003C/p\u003E\u003Cp\u003EClearer guidelines/requirements would help, exactly what do you want us to do?\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-09-30T17:19:41Z","Content":"\n\u003Cp\u003EYou cannot actually leave the Kerbol SOI, what you can do is reach escape velocity and never fall back down. I currently use this as a means of disposing of rocket boosters used to get objects into orbit and then to orbital rendezvous (yeah, they have way more Delta V than necessary for LKO, but I like that because it means I can use them as interplanetary engines if I need to).\u003C/p\u003E\u003Cp\u003EAlso, my current out-bound objects are encountering no Kraken-related effects.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2013-10-03T11:40:53Z","Content":"\n\u003Cp\u003EThis is a nice job for my ISV Aghanim! Picture and real challange proven follows later\u003C/p\u003E\n"}]}