{"TopicId":46963,"ForumId":55,"TopicTitle":"A few Suggestions...","CreatedByName":"DeafFrog","CreatedById":83717,"CreatedDateTime":"2013-09-30T06:23:34Z","PageNum":1,"Articles":[{"CreatedByName":"DeafFrog","CreatedById":83717,"CreatedDateTime":"2013-09-30T06:23:34Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAutomated Flights\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EFirst and foremost I would love to see some automated flights. I was thinking along the lines of using maneuver nodes. Using an additional command centre structure will ask you to select a saved ship or build a new one, like the launch pad. Also have another button in the assembly build to send the craft to the command centre.\u003C/p\u003E\u003Cp\u003EThe CC (Command centre) will open up the map with an additional slider at the top to adjust the position of planets. Basicly time acceleration that can go backwards and instead of buttons you have a slider. Then a dialogue will open in which you input your take off parameters. (like mechjeb) then it will create the orbit. Now like maneuver nodes you can input more on the supposed orbit. But we need more types of nodes, for landing, take off, docking and operations. I was thinking of having these as additional options when you right click to delete the node. This others will bring up mechjebish dialogues where you cam input parameters. For the operations node I was thinking that all it will do is carry out an action group, so you can deploy your science modules.\u003C/p\u003E\u003Cp\u003EThen when the planets align in real time with the slider, the mission will launch. I think it would also be cool to save the mission so that you can keep redoing it.\u003C/p\u003E\u003Cp\u003EAlso I don\u0027t think it would be a good idea to give those additional nodes to the player in a normal situation.\u003C/p\u003E\u003Cp\u003EI was also thinking that you could plan your own piloted missions with this.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMore crew management\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHave 3 different types of crew; Pilots, Scientists and Passengers.\u003C/p\u003E\u003Cp\u003EPilots have skills, I was thinking like RCS, Fuels Efficiency, Engine Power, Stabilisation... etc... I think these are all kind of explanatory.\u003C/p\u003E\u003Cp\u003ESo the more skill a crew man has the more of a boost he will provide in that area. Even more reason to bring them back. Then obviously you can train them on the ground. Another option would be assign your crew tasks (Kinda like FTL) and as they do the same task more they get better and better. You could perhaps assign them from the map screen. \u003C/p\u003E\u003Cp\u003ENow Scientists provide no flying boosts, they provide a boost to your science generated.\u003C/p\u003E\u003Cp\u003EPassengers are Kerbal Billionaires that want to go to space. And they pay well for the flight. But they are hard to keep happy as they after the flight. Take them another planet and they get very happy, but keep them waiting in space too long and they get bored... I was thinking of having a bar that displays how they feel about the trip. You know the slider that moves from the happy side to dark side depending on how they feel.\u003C/p\u003E\u003Cp\u003EAnd then depending on the average of the slider when you land is your money that they pay you.\u003C/p\u003E\u003Cp\u003ESo that\u0027s all for now folks...\u003C/p\u003E\u003Cp\u003EAnd thanks for reading all of this.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-09-30T07:58:20Z","Content":"\n\u003Cp\u003EHi DeadFrog,\u003C/p\u003E\u003Cp\u003EBoth suggestions are under the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ewhat not to suggest list\u003C/a\u003E sticky thread, so I will close the thread.\u003C/p\u003E\u003Cp\u003EThey are on that list because they have been suggested lot of times.\u003C/p\u003E\u003Cp\u003ESquad have already confirmed that they don\u0027t want any kind of Automated Flights with the vanilla game. They may add one after release with an dlc/extension but nothing confirm since they have to finish the game first.\u003C/p\u003E\u003Cp\u003EAt the moment you have a few different mods like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/12384-PART-0-21-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-0-9\u0022 rel=\u0022external nofollow\u0022\u003EMechjeb\u003C/a\u003E, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/47399-kOS-Scriptable-Autopilot-System-0-7\u0022 rel=\u0022external nofollow\u0022\u003EKOs\u003C/a\u003E that can automate your flight.\u003C/p\u003E\u003Cp\u003EFor the crew managment, Squad have added Stupidy and Courage skills to the Kerbals, at the moment it doesn\u0027t do anything (except for the in flight facial expression), but it might later. As Squad works on the career mode, I am sure we will see something to make them useful.\u003C/p\u003E\n"}]}