{"TopicId":47223,"ForumId":36,"TopicTitle":"[WIP] Nert\u0026#039;s Dev Thread - Current: such nuke, wow","CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2013-10-02T23:56:27Z","PageNum":57,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-07-21T13:31:53Z","Content":"\n\u003Cp\u003EYou are of course correct... I blame bleary-eyed early mornings x_x\u003C/p\u003E\n"},{"CreatedByName":"alphaparrot324","CreatedById":144542,"CreatedDateTime":"2015-07-21T17:20:48Z","Content":"\n\u003Cp\u003ETurns out the Heavy Ram Intakes make for *excellent* pontoons. Looking forward to the full release!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jfkBulH.png\u0022 alt=\u0022jfkBulH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mZi7exQ.png\u0022 alt=\u0022mZi7exQ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-21T17:27:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EYou are of course correct... I blame bleary-eyed early mornings x_x\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EXD we all have them.\u003C/p\u003E\u003Cp\u003ENertea, quick bug report and balance suggestion:\u003C/p\u003E\u003Cp\u003EThe throttle piece in cockpit IVA is backwards.\u003C/p\u003E\u003Cp\u003EI suggest moving the extended nacelle, high bypass intake, and Dudley, to the tech node, subsonic flight, instead of high altitude flight (this \u003Cem\u003Eis\u003C/em\u003E with CTT, not stock tree; screw balancing for the stock tree)\u003C/p\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-07-21T17:52:43Z","Content":"\n\u003Cp\u003EWould you consider using Alcor prop pack to create the IVA? That has the best instruments and panels for IVA actual usage. That would really make the mk4 look amazing inside and out.\u003C/p\u003E\n"},{"CreatedByName":"TicTacToe!","CreatedById":44675,"CreatedDateTime":"2015-07-21T17:55:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Svm420\u0022 data-cite=\u0022Svm420\u0022\u003E\u003Cdiv\u003EWould you consider using Alcor prop pack to create the IVA? That has the best instruments and panels for IVA actual usage. That would really make the mk4 look amazing inside and out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeconded. Some really otherworldly IVA experiences could be had, if you\u0027re up for it Nert.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-21T18:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Svm420\u0022 data-cite=\u0022Svm420\u0022\u003E\u003Cdiv\u003EWould you consider using Alcor prop pack to create the IVA? That has the best instruments and panels for IVA actual usage. That would really make the mk4 look amazing inside and out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERPM IVAs are already in the workflow, they just take time. One does not create a full 4-kerbal RPM IVA overnight.\u003C/p\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-07-21T18:06:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003ERPM IVAs are already in the workflow, they just take time. One does not create a full 4-kerbal RPM IVA overnight.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course no rush from me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I just wondered if nertea was open to using the Alcors props as they are very nice and very functional.\u003C/p\u003E\n"},{"CreatedByName":"WolfMP","CreatedById":148499,"CreatedDateTime":"2015-07-21T19:11:30Z","Content":"\n\u003Cp\u003EApologies if you\u0027ve covered this earlier in the thread, but the attachment nodes are a little low to attach 3.75m parts inside the cargo bays. The parts clip slightly through the floor while having lots of space above them. Its pretty easy to just surface attach the docking port a little higher though.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-21T23:24:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WolfMP\u0022 data-cite=\u0022WolfMP\u0022\u003E\u003Cdiv\u003EApologies if you\u0027ve covered this earlier in the thread, but the attachment nodes are a little low to attach 3.75m parts inside the cargo bays. The parts clip slightly through the floor while having lots of space above them. Its pretty easy to just surface attach the docking port a little higher though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt has to do with wing attachment, centerline, and other things. It\u0027d be cool to see the nodes higher up, but I don\u0027t think that\u0027d work well.\u003C/p\u003E\u003Cp\u003EActually now I wanna test it. Brb\u0027s peeps.\u003C/p\u003E\u003Cp\u003EUPDATE: Okay . . . it doesnt look bad.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oz4OvRh.png\u0022 alt=\u0022oz4OvRh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose aren\u0027t the small squares, those are full length wing segments attached via the 3.75m can in the bay (which I offset up to fit properly). THe lower wing was set at a 5* offset down so I could see if it was possible to still mount the wings on the center of the blisters (which I know is a design consideration Nertea makes). Turns out it can be quite well.\u003C/p\u003E\u003Cp\u003ENert, thoughts? I know moving the node lines and CoMs up would be tedious, but this shows that it wouldn\u0027t work out terribly at all. Perhaps something to consider for a future release?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-21T23:38:40Z\u0022 title=\u002207/21/2015 11:38  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 21, 2015\u003C/time\u003E by Captain Sierra\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-07-21T23:37:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EIt has to do with wing attachment, centerline, and other things. It\u0027d be cool to see the nodes higher up, but I don\u0027t think that\u0027d work well.\u003Cp\u003EActually now I wanna test it. Brb\u0027s peeps.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWing attachment is only dependent on the part\u0027s origin, not the location of stack nodes. Those can be moved at will.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-21T23:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blowfish\u0022 data-cite=\u0022blowfish\u0022\u003E\u003Cdiv\u003EWing attachment is only dependent on the part\u0027s origin, not the location of stack nodes. Those can be moved at will.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo is CoM. You can also offset CoM in the .cfg but be honest, you probably want your wings to snap level to your CoM right?\u003C/p\u003E\n"},{"CreatedByName":"ozraven","CreatedById":106313,"CreatedDateTime":"2015-07-22T02:11:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EYeah, but doesn\u0027t the NEEDS statement itself default to a certain pass? A huge amount of mods only ever call NEEDS and don\u0027t bother specifying a pass...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, NEEDS only determines if a given patch is going to be applied. In my thinking having a pass specifier would imply a NEEDS, except for FOR. I think the trick may be that any \u0022fix\u0022 would probably break some valid patches and with little benefit. And yes, tons of mods don\u0027t specify a pass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EAs for the issue with B9, that\u0027s probably a bug you should report to sarbian. By logic, a call of :FOR[ModName] should not even run if ModName is not present. You can bet that this would have created tons of problems long before the development of Nertea\u0027s MkIV system, so it may be unintended behavior introduced only recently in MM v2.6.6.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that ModuleManager can\u0027t properly validate a FOR, in at least two cases: 1) A mod that doesn\u0027t have a plugin (DLL) and wants to be known as something other than the directory name it lives in. 2) Individual mods that live under a common directory, such as UmbraSpaceIndustries/Kolonization. I expect this does create subtle hard-to-diagnose problems, that either are unresolved or inadvertently fixed as the interacting mods evolve. I\u0027m planning to mention it to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/%252%24s\u0022 rel=\u0022external nofollow\u0022\u003Esarbian\u003C/a\u003E, but I\u0027m a bit out of touch the next two weeks. I at least want to write a ModuleManager self test to exercise the behavior for ease of discussion and, in lieu of a change, that will provide a proof of the current implementation.\u003C/p\u003E\n"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2015-07-23T19:27:13Z","Content":"\n\u003Cp\u003EMmmkay, I think I\u0027ve fixed the FAR bug, a few IVA problems, the cargo tail bugs, a few small texture fixes (I will not change the attach node location, surface attach to load 3.75m cargo). Think I\u0027m done? Any other issues?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-23T20:30:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nertea\u0022 data-cite=\u0022Nertea\u0022\u003E\u003Cdiv\u003EMmmkay, I think I\u0027ve fixed the FAR bug, a few IVA problems, the cargo tail bugs, a few small texture fixes (I will not change the attach node location, surface attach to load 3.75m cargo). Think I\u0027m done? Any other issues?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell that answers that question.\u003C/p\u003E\u003Cp\u003ENothing glaring, certainly nothing that cant wait until the next release. Judging by your sentiments in this thread I\u0027m guessing returning to pure modeling (plugin coding be damned) is mildly therapeutic for you. How many versions of Mk4 are you going to go through before returning to the mess of NFP/NFE/HC? 2.0, 2.1, 2.2?\u003C/p\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2015-07-23T23:53:59Z","Content":"\n\u003Cp\u003EI vote for a release! =)\u003C/p\u003E\n"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2015-07-24T01:21:43Z","Content":"\n\u003Cp\u003EWill there be 2.5m multi engine nacelles, or at least tweakscale support on the 1.25m ones?\u003C/p\u003E\n"},{"CreatedByName":"WolfMP","CreatedById":148499,"CreatedDateTime":"2015-07-24T03:37:02Z","Content":"\n\u003Cp\u003EThe DRP-120 Mk4 Ventral Cargo Bay has the same drag cube as the DRP-60, and its about half the CRG-120. Not a big deal. Only other comment I would have is that the drone core\u0027s name begins with \u0022Mark IV\u0022 and the cockpit is \u0022Mk4\u0022, so they don\u0027t end up near each other in my giant parts list, but feel free to ignore that.\u003C/p\u003E\u003Cp\u003EThanks for all your work, this is one of the coolest mods by far. Tested on Duna and Kerbin and it handles great.\u003C/p\u003E\n"},{"CreatedByName":"westy","CreatedById":110662,"CreatedDateTime":"2015-07-24T12:41:12Z","Content":"\n\u003Cp\u003ENertea, these parts are awesome. Top Notch! \u003C/p\u003E\u003Cp\u003EThank you so much! \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/bys49\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-12-04T21:53:38Z","Content":"\n\u003Cp\u003E\nDigging the dev thread out of the depths to discuss an issue and get some feedback \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027m going to brainstorm a bit here. So beware, behind this spoiler there\u0027s quite a wall of text waiting, and I can\u0027t promise that it\u0027ll be particularly coherent \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E What I\u0027d like people to do is telling me where my thoughts are not logical, and whether they agree with me or not.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo, the current situation is this:\n\u003C/p\u003E\n\u003Cp\u003E\nXenon, argon and liquid hydrogen tanks in Near Future Propulsion all have different fuel/mass ratios. This is not yet accounted for in engine balance, resulting in some engines being as much as 8% above the baseline.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the fuel/mass ratio of liquid hydrogen tanks affects the HydrogenNTRs patch negatively. Because of dry mass differences between stock tanks and Near Future liquid hydrogen tanks, the LV-N loses at least 35% of its performance and thus becomes so weak that in most use cases it delivers less dV than common chemical engines. Other NTRs are similarly affected when patched.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, changing tank masses to fix the first issue makes the second worse - and vice versa. And *then* there\u0027s CryoEngines, a wholly different mod which also uses LH2 tanks, but with different dry masses again. A fundamental review of the whole setup is required.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\nCurrently, tank dry masses look like this:\u003Cbr\u003E\n- Stock liquid fuel, 8:1 across the board\u003Cbr\u003E\n- Near Future LH2, from 2.56:1 to 3.54:1 depending on tank size class\u003Cbr\u003E\n- CryoEngines LH2, 2.02:1 across the board\n\u003C/p\u003E\n\u003Cp\u003E\n- Stock xenon, 1.27:1 across the board\u003Cbr\u003E\n- Near Future xenon, from 1.43:1 to 1.48:1 depending on tank size class\u003Cbr\u003E\n- Near Future argon, from 1.37:1 to 2.00:1 depending on tank size class\n\u003C/p\u003E\n\u003Cp\u003E\nHigher values mean less dry mass per fuel, which results in more TWR and more dV. That\u0027s why the LV-N dies such a horrible death when switching from stock LF to NF LH2.\n\u003C/p\u003E\n\u003Cp\u003E\nThis also illustrates another issue: installing Near Future together with CryoEngines currently lets the player use Near Future\u0027s lighter hydrogen tanks to get noticably better performance out of the engines than the mod intended.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIgnoring other mods for the moment and focusing fully on Near Future Propulsion, the way I see it, there\u0027s two main approaches we can take.\n\u003C/p\u003E\n\u003Cp\u003E\nOption 1: ignore the tanks, balance the engines. Dropping performance by ~4% for argon thrusters and ~8% for hydrogen thrusters brings all electric engines back onto the same baseline.\n\u003C/p\u003E\n\u003Cp\u003E\nProblems with Option 1: HydrogenNTRs will require absurd stat changes to restore stock performance, such as increasing Isp to twice what their inspirations had IRL, and lots of testing. Also doesn\u0027t fix disparity between stock and NFT xenon tanks, which does exist.\n\u003C/p\u003E\n\u003Cp\u003E\nOption 2: leave the engines, fix the tanks. Bringing Argon and Xenon together on one baseline ought to be easy, since they aren\u0027t far apart. Could even tweak the three stock tanks to match with little to no effort.\n\u003C/p\u003E\n\u003Cp\u003E\nProblems with Option 2: What to do with hydrogen tanks? You cannot pick a value for them that satisfies both electric engine balance and NTR balance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\nAdditional considerations:\n\u003C/p\u003E\n\u003Cp\u003E\n- Is it worth keeping the HydrogenNTRs patch in the first place? Sure, it is a nod to realism, but is it strictly necessary from a game design perspective? Since stock KSP removed the need for oxidizer, NTRs are already differentiated from normal engines more than they were in the past when the patch was first conceived. Dropping the patch would eliminate the most severe issues in *both* options above.\n\u003C/p\u003E\n\u003Cp\u003E\n- Do the hydrogen tanks have to copy values directly from real life? A thought I recently had was: KSP has entirely unrealistic dry masses on tanks and engines alike to account for needing less dV to orbit, but the math still comes out heavily in favor of the player, as is apparent from ~15% payload fractions in KSP compared to ~3% payload fractions IRL. This probably makes chemical engines a better alternative to realistically statted NTRs and tanks than they would be IRL. As such, maybe the hydrogen tanks need artificially elevated numbers over what you\u0027d find IRL. After all, the stock LV-N does benefit from tanks with no boiloff yet significantly better dry mass ratios than NASA\u0027s zero-boiloff hydrogen tank concepts, which I suspect are the inspiration for the current numbers.\n\u003C/p\u003E\n\u003Cp\u003E\n- Large disparities between the tank dry masses that are compensated for by adjusting engine stats look fairly interesting at first glance and work out perfectly fine in the spreadhseet, but are extremely intransparent to the player in practice. He will unlock different engines in the tech tree, and the engines running on fuel A will constantly have significantly better stats across the board than the engines running on fuel B. The player doesn\u0027t realize that tank dry masses are so much better for fuel B that fully built ships offer comparable performance to ships built with fuel A, because this would require looking at the tanks to compare engine performance, not at the engines. That\u0027s not only counterintuitive from a user experience design standpoint, but the fuel/mass fraction of a tank is also not directly displayed, and needs to be figured out by hand. While these considerations definitely exist IRL, for a game it would appear to make perhaps more sense to have very similar dry mass ratios for all fuel types, so that the player can actually compare different engines directly - unless you want to add hints to every single engine description about how good its available fuel tanks are.\n\u003C/p\u003E\n\u003Cp\u003E\n- The same intransparency problem exists for fuel costs, which are currently very far apart from each other and only tenuously factored into engine design. But since it is a far less pressing issue, I\u0027m not going to bother with it right now until we\u0027ve figured the dry mass thing out.\n\u003C/p\u003E\n\u003Cp\u003E\n- Should tanks really scale their mass ratios with size class? Neither stock KSP nor most other mods do this. It may be worth settling on one value across the board.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\nOverall:\n\u003C/p\u003E\n\u003Cp\u003E\nI still haven\u0027t entirely formed an opinion on everything, due to its sheer complexity, but I\u0027m tending towards the following:\u003Cbr\u003E\n- You will have to either drop the HydrogenNTRs patch entirely, *or* give all the NTRs super-inflated stats. I see no other option right now, even if I\u0027m open to be proven wrong.\u003Cbr\u003E\n- Engines should have very little stat adjustments to help balance tanks, because this is intransparent to the player.\u003Cbr\u003E\n- I would recommend not scaling dry mass with size. Instead, dry cost can scale with size, like stock does it. This still leaves a small incentive for using larger parts, while keeping balance relevant values tightly under control.\u003Cbr\u003E\n- Fuel/mass ratios on xenon and argon tanks, including stock tanks, are best adjusted upwards, instead of adjusting hydrogen down. Ironically this will make them more realistic... \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E Or perhaps, if xenon, argon and hydrogen could all meet around the 2:1 point, then NF can be fixed while simultaneously achieving parity with CryoEngines and fixing the current cross-mod exploit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow the question is... who agrees with me, and who tells me I\u0027m crazy? \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2015-12-05T00:29:17Z","Content":"\n\u003Cp\u003E\nA thought - what if VASIMRs could no longer use LH2 as a fuel and MPDTs used lithium?\n\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2015-12-05T01:03:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222308448\u0022 data-ipsquote-contentid=\u002247223\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449266018\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(250,250,250);\u0022\u003E- You will have to either drop the HydrogenNTRs patch entirely, *or* give all the NTRs super-inflated stats.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI prefer the latter. As you pointed out earlier in your post, chemical engines are significantly more effective in KSP than on Earth. It\u0027s only logical that other engines require advantages over their real-world counterparts in order to be balanced relative to chemical engines and to maintain a gameplay niche. For example, KSP ion engines have tremendously greater thrust than real ion engines. I see no reason why NTR ISP should be held sacred. However, NTRs running on kerosene just seems silly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(250,250,250);\u0022\u003E- Engines should have very little stat adjustments to help balance tanks, because this is intransparent to the player.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think I mostly agree, or I at least don\u0027t strongly object. However, we do need to have meaningful differences between fuel types (e.g., density, cost, maxTemp), because otherwise we might as well just have a single fuel type.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(250,250,250);\u0022\u003E- I would recommend not scaling dry mass with size. Instead, dry cost can scale with size, like stock does it. This still leaves a small incentive for using larger parts, while keeping balance relevant values tightly under control.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStrongly agree. I have never liked NFT\u0027s divergence from the stock paradigm on this issue.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(250,250,250);\u0022\u003E- Fuel/mass ratios on xenon and argon tanks, including stock tanks, are best adjusted upwards, instead of adjusting hydrogen down. Ironically this will make them more realistic...\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 style=\u0022vertical-align:middle;border:0px;color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(250,250,250);\u0022 title=\u0022;)\u0022\u003E\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(250,250,250);\u0022\u003E\u003Cspan\u003E \u003C/span\u003EOr perhaps, if xenon, argon and hydrogen could all meet around the 2:1 point, then NF can be fixed while simultaneously achieving parity with CryoEngines and fixing the current cross-mod exploit.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, I don\u0027t immediately have a strong opinion one way or the other. There is a certain elegance in the latter solution, I suppose.\n\u003C/p\u003E\n\u003Cp\u003E\nUltimately, I think agreement between NFT and CryoEngines should be regarded as a necessity. Fundamentally, there\u0027s no reason why the two mods shouldn\u0027t be able to co-exist in a balanced manner, without either one overwriting the configs of the other. Whether that ought to involve NFT conforming to CryoEngines, or CryoEngines conforming to NFT, I don\u0027t know. One additional point of consideration (and the principle thorn in my side when I wrote the current CryoEngines fuel-switching patch): LH2/OX configurations of stock tanks need to be included in the balancing process, and - logically - the LH2 portion of these tanks need to be consistent with pure LH2 tanks in terms of the density and dry mass ratios.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-05T01:05:15Z\u0022 title=\u002212/05/2015 01:05  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 5, 2015\u003C/time\u003E by Fraz86\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Psycho_zs","CreatedById":137644,"CreatedDateTime":"2015-12-05T03:23:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n- Fuel/mass ratios on xenon and argon tanks, including stock tanks, are best adjusted upwards, instead of adjusting hydrogen down. Ironically this will make them more realistic... Or perhaps, if xenon, argon and hydrogen could all meet around the 2:1 point, then NF can be fixed while simultaneously achieving parity with CryoEngines and fixing the current cross-mod exploit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat sounds very promising. It wouldn\u0027t be too invasive, because NFP already tweaks stock ion engine, so xenon tanks would fit right into the mix.\n\u003C/p\u003E\n\u003Cp\u003E\nScaling tank dry mass ratio with size? better go with stock.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for hydrogen, I\u0027ve already flown a couple of nuclear tugs with hydrogen NTR patch installed in previous versions. It was fun to assemble.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat would we get if we take the shift between IRL LF\u002BOX engines/tanks and KSP Stock LF\u002BOX engines/tanks and apply something roughly similar to IRL Hydrogen NTR?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-05T03:36:30Z\u0022 title=\u002212/05/2015 03:36  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 5, 2015\u003C/time\u003E by Psycho_zs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-12-05T03:31:20Z","Content":"\n\u003Cp\u003E\nSierra\u0027s mod senses are tingling.\n\u003C/p\u003E\n\u003Cp\u003E\nOh hey an NFP discussion, something worthy of bringing me back. Glad to see you \u0027round Nert. Your mod suite is what has kept me playing even in the face of being driven from the community by Squad\u0027s console port fever. I will always keep coming back for your work.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTestimonial aside, allow me to address the issue.\u003Cbr\u003E\u003Cstrong\u003EFuel Ratios\u003C/strong\u003E\u003Cbr\u003E\nI agree with the solution of standardizing dry mass/full mass across all tanks of a given fuel type. It seems the most elegant way to do things and means that X units of any given fuel feeding Y engines will always provide the same delta V regardless of the tanks used to provide those X units.\u003Cbr\u003E\nI would balance the value of one over another by cost and by mass (say: argon propulsion setup is, when all is said and done, heavier than an LH2 setup but cheaper, and a xenon setup may offer the most delta V by weight but also has the highest cost per delta V)\u003Cbr\u003E\u003Cstrong\u003EHydrogen NTRs\u003C/strong\u003E\u003Cbr\u003E\nI honestly think we should deprecate it. At least from my quick head math, I can see no way to make it not lose a ton of performance, and if we can by boosting ISP to the ridiculous, it may begin to compete with the ion engines a bit too favorably. (I sense this may be the case already when paired with the fuel switch patch in Cryo-Engines). I dont see too many options for fixing this without either throwing realism to the wind (which I dont object to) or completely rebalancing the stock tank/engine paradigm (which is far out of the scope of this mod)\u003Cbr\u003E\u003Cstrong\u003ECryo Engines\u003C/strong\u003E\u003Cbr\u003E\nIf NFP hydrogen tanks cannot be properly balanced to encourage vacuum-only use (low impact tolerance, low heat resist, higher drag if possible), then the next best option in my opinion is to simply not enable fuel switching on those tanks. They\u0027re not meant to be used on launch vehicles, so why should they be able to be? Instead of trying to make the two mods collaborate gracefully, simply make them coexist indifferent to the other\u0027s presence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELithium\u003C/strong\u003E\u003Cbr\u003E\nLithium is a solid, so would that not give MPDTs a hard limit on their effective lifespan by having an internal solid fuel? I also think that would make them a good bit stronger (perhaps too strong) because of losing most of their tank mass requirement. As for VASIMRs, I played with this mod before they even had the hydrogen mode so I\u0027d really be indifferent to such a change.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ERequisite Thermal Questions\u003C/strong\u003E\u003Cbr\u003E\nI know Street was the one that brought this up, but if you\u0027re going to be bringing NFP back from the dead (again \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E) then does that mean by any extension that the NFE/HC package will be seeing some love? (the stock game is progressively including more and more stuff to make it easy on you to add these things into it with less and less code work, which as far as I can tell is a very good thing).\n\u003C/p\u003E\n"},{"CreatedByName":"Psycho_zs","CreatedById":137644,"CreatedDateTime":"2015-12-05T04:03:11Z","Content":"\n\u003Cp\u003E\n\u002B1 for making hydrogen tanks unsuitable for atmosphere. They should be fragile and pop like balloons on a slightest attempt of reentry.\n\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2015-12-05T07:39:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222308859\u0022 data-ipsquote-contentid=\u002247223\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449286280\u0022 data-ipsquote-userid=\u002274666\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Captain Sierra said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECryo Engines\u003C/strong\u003E\u003Cbr\u003E\nIf NFP hydrogen tanks cannot be properly balanced to encourage vacuum-only use (low impact tolerance, low heat resist, \u003Cstrong\u003Ehigher drag if possible\u003C/strong\u003E), then the next best option in my opinion is to simply not enable fuel switching on those tanks. They\u0027re not meant to be used on launch vehicles, so why should they be able to be? Instead of trying to make the two mods collaborate gracefully, simply make them coexist indifferent to the other\u0027s presence.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHigher drag is possible (though a bit tedious to implement), as I outlined in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/47786-104-near-future-technologies-040915-bugfix-for-nfe/\u0026amp;do=findComment\u0026amp;comment=2051490\u0022\u003Ethis post\u003C/a\u003E.\n\u003C/p\u003E\n"}]}