{"TopicId":47390,"ForumId":16,"TopicTitle":"Planes/SSTO\u0026#039;s, Yaw and Roll","CreatedByName":"Sundancer","CreatedById":83716,"CreatedDateTime":"2013-10-04T17:59:54Z","PageNum":1,"Articles":[{"CreatedByName":"Sundancer","CreatedById":83716,"CreatedDateTime":"2013-10-04T17:59:54Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI\u0027m in the process of putting together an SSTO and it\u0027s going pretty well. I\u0027m using FAR, B9 and procedural wings after some poking about looking for things to improve the way my planes looked/handled, but I have a few stock designs as well. \u003C/p\u003E\u003Cp\u003EHowever, I\u0027ve come across a problem that appears in every single aircraft I build. No matter how I place the rudder, it always tries to control roll as well as yaw, which tends to result in what is essentially a wildly flailing incendiary bomb with wings attached shortly after take off. \u003C/p\u003E\u003Cp\u003EI\u0027ve tried mounting the rudder(s) vertically, at an inward angle, at an outward angle, and any configuration imaginable really.\u003C/p\u003E\u003Cp\u003EIs this normal or is it some issue with the mods installed or something else? Is there some way I can get rid of this?\u003C/p\u003E\u003Cp\u003EI doubt it\u0027s the mods since the other designs that have since been created and tested using all stock parts have the same problem.\u003C/p\u003E\u003Cp\u003EThis is my most successful design:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jZgtzZG.png\u0022 alt=\u0022jZgtzZG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: I\u0027ve made a point of keeping the CoM in front of the CoL by placing the jet fuel tank foremost, since that one will still have a great deal left once in orbit. Then once the oxidizer in the other tanks runs out I pump all the liquid fuel that is remaining into the fore jet fuel tank, any surplus going into the one behind it. Still nada.\u003C/p\u003E\u003Cp\u003EThe only way I got that into orbit (only the once) was by not touching the yaw/roll and simply pitching up at a very slow rate. Maybe 5degree\u0027s every 15 seconds or so. \u003C/p\u003E\u003Cp\u003EAnother thing, which I think may be FAR, is that if I pitch up too hard, the plane ends up facing back the way it came very very quickly. This results in a dead kerbal almost every time due to flat spin or otherwise unrecoverable spin of doom.\u003C/p\u003E\u003Cp\u003EI\u0027m doing something wrong, but I can\u0027t work out what. So if anyone can point out what I\u0027m missing or lend some pointers that\u0027d be brilliant.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T18:02:44Z\u0022 title=\u002210/04/2013 06:02  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Sundancer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"firstpirlo","CreatedById":83458,"CreatedDateTime":"2013-10-05T05:41:07Z","Content":"\n\u003Cp\u003EI have this problem too.My huge SSTO with B9 is so hard to handle.When I try to yaw,it pitch as well,and lose control.Waiting for a solution.\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-10-05T13:05:01Z","Content":"\n\u003Cp\u003EIn FAR, you can set which control surfaces act for which axes. Unless that\u0027s been removed in the past few versions (haven\u0027t used it in months). In the VAB there\u0027s a controller for it.\u003C/p\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2013-10-05T13:20:24Z","Content":"\n\u003Cp\u003EWell, the rolling-with-rudders issue, with my stock crafts, I try to add another control surface on the bottom side if I have a rudder on the top.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-10-05T17:03:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sundancer\u0022 data-cite=\u0022Sundancer\u0022\u003E\u003Cdiv\u003EHello,\u003Cp\u003EI\u0027m in the process of putting together an SSTO and it\u0027s going pretty well. I\u0027m using FAR, B9 and procedural wings after some poking about looking for things to improve the way my planes looked/handled, but I have a few stock designs as well. \u003C/p\u003E\u003Cp\u003EHowever, I\u0027ve come across a problem that appears in every single aircraft I build. No matter how I place the rudder, it always tries to control roll as well as yaw, which tends to result in what is essentially a wildly flailing incendiary bomb with wings attached shortly after take off. \u003C/p\u003E\u003Cp\u003EI\u0027ve tried mounting the rudder(s) vertically, at an inward angle, at an outward angle, and any configuration imaginable really.\u003C/p\u003E\u003Cp\u003EIs this normal or is it some issue with the mods installed or something else? Is there some way I can get rid of this?\u003C/p\u003E\u003Cp\u003EI doubt it\u0027s the mods since the other designs that have since been created and tested using all stock parts have the same problem.\u003C/p\u003E\u003Cp\u003EThis is my most successful design:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jZgtzZG.png\u0022 alt=\u0022jZgtzZG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPart of your problem is you don\u0027t have enough control surfaces. You are using 1 set of controls to handle pitch and roll. You also may need a larger tail with a rudder.\u003C/p\u003E\n"},{"CreatedByName":"Starglider","CreatedById":82321,"CreatedDateTime":"2013-10-05T20:31:42Z","Content":"\n\u003Cp\u003ERudders do have an impact on rolling. This is true IRL as well as ksp. The issue is that the forces they produce are not centered vertically with the CoM. To do that, you have to have equivalent rudders underneath the plane, and this vastly complicates landings. IRL, planes bank before turning; the banking angle helps to \u0022center\u0022 the rudder so it can be used effectively (this is an oversimplification, but close enough).\u003C/p\u003E\u003Cp\u003EIf you don\u0027t want to bank before turning, you need to minimize the difference between where the rudder acts vertically, and the CoM. Start with multiple, smaller rudders, placed on the wings - the center of smaller rudders aren\u0027t as far away as bigger rudders from the CoM, and the wings are right on the CoM instead of above it like the tops of those tanks are. You can also place the wings lower on the tanks, then angle them so they\u0027re still horizontal - this places them below the CoM, which can bring small wing-mounted rudders mostly in-line with the CoM.\u003C/p\u003E\n"},{"CreatedByName":"antbin","CreatedById":22389,"CreatedDateTime":"2013-10-05T21:35:43Z","Content":"\n\u003Cp\u003EI don\u0027t know about FAR, but with stock aero the winglet/canard parts apply the force at their attachment point, not where you\u0027d expect. So if you use them as rudders, attached to a wing, they will have very little (if no) effect on yaw.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-10-05T22:05:54Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img41/5112/nvue.jpg\u0022 alt=\u0022nvue.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img14/9439/ighd.jpg\u0022 alt=\u0022ighd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img716/8517/ylte.jpg\u0022 alt=\u0022ylte.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my smallest fastest, and most efficient lightweight SSTO. It handles like a dream and will easily pull 11Gs without flying apart. But it takes a little shifting of the fuel on re-entry like all my craft, I have shift the oxidizer to the forward most tank when I hit atmo.\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2013-10-05T23:36:33Z","Content":"\n\u003Cp\u003EIn the SPH, open up the FAR tab and take a look at options for your control surfaces. You can assign the rudders to yaw only.\u003C/p\u003E\n"}]}