{"TopicId":47392,"ForumId":16,"TopicTitle":"Flat Flat Flat","CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-10-04T19:44:36Z","PageNum":1,"Articles":[{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-10-04T19:44:36Z","Content":"\n\u003Cp\u003EDoes anybody know some good areas that are of a flatter variety on the Mun, Laythe, Eve, and Duna?\u003C/p\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-10-04T19:57:14Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESelect planet or moon and viewing options including slope.\u003C/p\u003E\n"},{"CreatedByName":"Haze-Zero","CreatedById":71279,"CreatedDateTime":"2013-10-04T20:00:57Z","Content":"\n\u003Cp\u003EMinmus\u0027 frozen lakes are quite flat\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-04T20:08:23Z","Content":"\n\u003Cp\u003EAfter the addition of procedural cratering, the Mun is a b***h to find a level area on. Try your best to eyeball it from orbit. if you can\u0027t see craters from map view, you probably are in luck. Aim there and fine tune as needed to a flat spot when you come in on descent.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-04T20:10:36Z","Content":"\n\u003Cp\u003ESpecifically for the Mun: If you\u0027re coming down over a heavily-cratered field, aim for the center of one of the craters as your landing site. While the edge of the crater is obviously very steep, the center tends to be flat enough to safely land on.\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-10-04T22:10:24Z","Content":"\n\u003Cp\u003EWhen it comes to the Mun, a nice flat area - conveniently on the equator, right under Kerbin and located between several anomalies - can be found in the vicinity of 0d N, 57d 30\u0027 E. There\u0027s another to the southwest, at roughly 0d - 2d S, 52d E. You might want to drop a rover there first to scout around for even more precise coordinates.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-04T22:19:55Z\u0022 title=\u002210/04/2013 10:19  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 4, 2013\u003C/time\u003E by Commander Zoom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-04T22:25:15Z","Content":"\n\u003Cp\u003EFor Lathe, I don\u0027t know on the fly but I do know there are a few low and flat stretches of coastline near the equator. Easily within a rover\u0027s range if you drop one from equatorial.\u003C/p\u003E\u003Cp\u003EAs for Eve, I just eyeball it on landing. it usually isn\u0027t that hard if you aim for a low lying area, which you might want to avoid if you want to take off again. Duna, aim for the poles. That is teh only flat areas I know of where you won\u0027t be finding dunes.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-04T23:25:29Z","Content":"\n\u003Cp\u003EMUN:\u003C/p\u003E\u003Cp\u003ENot really any flat areas to speak of. Orbit at 10km so you can see the craters as well as possible before committing. Note that rovers are usually able to climb OUT of craters but typically crash trying to get back into them.\u003C/p\u003E\u003Cp\u003ELaythe:\u003C/p\u003E\u003Cp\u003EMost of this planet is totally flat (the ocean). Go there with a seaplane. Problem solved.\u003C/p\u003E\u003Cp\u003EEve:\u003C/p\u003E\u003Cp\u003EThe oceans are flat so you can do a seaplane there, too, but don\u0027t expect to get it off the planet. If you intend to return from Eve, you want the opposite of flat. You want to land on the tallest mountain peak you can find to get above as much of the atmosphere as possible before you start your ascent. Each 1000m of altitude above sea level saves you about 1000m/s of delta-V needed to reach orbit.\u003C/p\u003E\u003Cp\u003EDuna:\u003C/p\u003E\u003Cp\u003EThis entire planet is covered with sand dunes so flat ground is very hard to find. \u0022Flat\u0022 ground there just means a sand dune that\u0027s wide and short so is reasonably level on top across a few hundred meters. Such \u0022nice\u0022 dunes are quite common in the bottoms of the big craters and canyons, where the air is also the thickest if you want to use parachutes or wings. Everywhere else is at higher elevation and the dunes are narrow and tall with only a few reasonably level areas of a couple hundred meters width scattered thinly and randomly over vast distances.\u003C/p\u003E\n"},{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-10-24T15:06:20Z","Content":"\n\u003Cp\u003EThanks but I have no idea how to build a interplanetary space plane. Let alone one that is seaworthy haha. However with eve I have been scouting with a small drone for kethane! For laythe is it easier to make a floating base that lands in the bay then moves ashore?\u003C/p\u003E\n"}]}