{"TopicId":47545,"ForumId":44,"TopicTitle":"Biggest Problem Facing Humanity","CreatedByName":"Apotheosist","CreatedById":9399,"CreatedDateTime":"2013-10-06T16:06:46Z","PageNum":4,"Articles":[{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-10-07T21:07:27Z","Content":"\n\u003Cp\u003EI\u0027m going to have to vote for toast falling butter side down.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-10-07T22:13:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003ENot exactly correct... You can\u0027t talk about cultures in this aspect. You need to use \u0022societies\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d bet that defining the differences between the two would be difficult.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe worst impact comes from developing societies such as the West during the 19th and 20th century when all that burned coal and released artificial toxic chemicals were used to lift the society from the gutters of poverty. Now most of the West is heading to the policy of sustainability. It\u0027s still a long way ahead, but it started. At this moment the West is still struggling with makeshift solutions such as using false-green stuff (produced in China using a ****load of coal and toxic stuff), but the progress is on the way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThus you support the idea that humanity, though part of the \u0022problem\u0022, is also part of the solution. Very good.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Don\u0027t fool yourself into thinking that primitive cultures were benign. \u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EI haven\u0027t. I knew it was a generalization, but I\u0027m sure there are valid examples.\u003C/p\u003E\u003Cp\u003EI just got through reading an article about mass extinction and how some of that may relate to Sol\u0027s orbit around the galaxy (and thus through the galactic arms). In the past it was thought the sun was more exposed to supernovae between the arms, but this article puts forth the case that being in an arm increases the likelihood of comets tumbling out of the Oort cloud at us.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.abc.net.au/science/articles/2013/10/02/3857090.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.abc.net.au/science/articles/2013/10/02/3857090.htm\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-07T22:22:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI do not agree. The notion of the \u003Cem\u003Edark ages\u003C/em\u003E became popular during the enlightenment, but nowadays scholars and scientists are realising that it was not the retarded age we think it was. There was a lot going on back then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course there was a lot going on. The fact is that the amount of the good stuff going on was very low and amount of bad stuff was very high, compared to other periods.\u003C/p\u003E\u003Cp\u003EIt was truly the dark ages in Europe and no modern revisionism can change that.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-07T22:29:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EOf course there was a lot going on. The fact is that the amount of the good stuff going on was very low and amount of bad stuff was very high, compared to other periods.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is the traditional view, but it does not seem to hold up scientifically. There was a definite influence of religion, but that did not mean other progress was halted. It is just that the enlightenment came afterwards and people at the time felt compelled to look down on that earlier, in their eyes more primitive age.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt was truly the dark ages in Europe and no modern revisionism can change that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is changing and will be changing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Be prepared. You say it like it is bad to have better insights into what actually happened.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-10-07T22:40:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dispatcher\u0022 data-cite=\u0022Dispatcher\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI just got through reading an article about mass extinction and how some of that may relate to Sol\u0027s orbit around the galaxy (and thus through the galactic arms). In the past it was thought the sun was more exposed to supernovae between the arms, but this article puts forth the case that being in an arm increases the likelihood of comets tumbling out of the Oort cloud at us.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.abc.net.au/science/articles/2013/10/02/3857090.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.abc.net.au/science/articles/2013/10/02/3857090.htm\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll check the article out, but I thought that the Sun orbited at a distance where the spiral arm density waves travel at about the same speed as a star in a circular orbit? Wasn\u0027t that like, half the idea behind the \u0022galactic habitable zone\u0022 concept (the other half being high enough metalicy for terrestrial planets)?\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2013-10-07T22:59:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003ETo be honest, this problem is rapidly disappearing. There are many online courses you can follow for free, in your own tempo and on the subjects you like. As soon as poorer countries have internet access, they can benefit from this. The knowledge gap is becoming a lot smaller than it once was.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAmongst people who care to learn, yes. Most of the people I know are only interested in football teams or stupid celebrities. Anything real, and they aren\u0027t interested.\u003C/p\u003E\n"},{"CreatedByName":"Drunken Hobo","CreatedById":52000,"CreatedDateTime":"2013-10-07T23:04:58Z","Content":"\n\u003Cp\u003EIgnorance. And those who exploit people\u0027s ignorance. Pretty much every other problem can be traced back to this. Education is the only cure, be very wary of any group that tries to restrict access to knowledge.\u003C/p\u003E\u003Cp\u003EThankfully with the internet, that\u0027s becoming impossible. That\u0027s why I regard it as mankind\u0027s greatest invention, unlikely ever to be surpassed.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-10-07T23:09:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u002B1 for overpopulation. It is the elephant in the room that is either the root cause or the biggest contributor to all of our other problems. Yet none of our politicians wants to address or even acknowledge the problem, mostly because the actual solutions (including worldwide birth control and sex education campaigns) go against \u0022family values\u0022 and religious dogma.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe demographers project that the total number of humans will plateau at 9 to 11 billion in about 2050. After 2070 projections are for it to drop back to around 8.5 billion and stay there.\u003C/p\u003E\u003Cp\u003EI agree that too many people is the upstream cause of many real and hypothesized global problems. Who knows if we can coexist with the natural ecology of Earth at even our current numbers, much less the increased number of us over the next 35 years and beyond. Certainly it would seem that fewer humans would be better for those who were alive = less competition and for the natural ecologies. However, the only ethical way for this to occur is for more and more people to choose to live their lives without reproducing. Many people globally now live this way, and they are I think to be applauded when it is done out of choice. Moreover, many people do not make particularly good parents. Unhealthy relationships between parents and offspring account for a huge proportion of the problems in the world. With those points laid out, at least superficially, I would say that, the most pressing problem on Earth today is the complete lack of seriousness when it comes to childrearing. \u0022Serious\u0022 is not the right word, but it is about the best I can think of. We simply do not take childrearing seriously. Way too many people do it by accident, or on a whim, people do it to manipulate other people, people do it because they cannot think of anything better to do with their lives. People who just simply do not have the maturity, resilience, compassion, patience, etc., to excel at parenting do it. Reproducing is the single most important thing one will do or not do, and if you do reproduce, parenting is by far and away the most important thing in your life from that point onwards. These two points should be axiomatic but they are not.\u003C/p\u003E\u003Cp\u003ESo I would say that, that is the most serious problem: virtually no cultures on Earth as yet, \u0022take reproduction and parenting seriously\u0022 from an ecological standpoint.\u003C/p\u003E\u003Cp\u003EPlease note: I am not suggesting that anyone\u0027s opportunity to have children much less their biological capacity to have children should ever be infringed. What I\u0027m saying is that, our cultures should do a better job of socializing us (via our parents, peers and communities) to regard parenting not as an \u0027automatic\u0027 or \u0027no big deal\u0027 but as a very important thing. By the time we reach puberty we should all have a sense that either (a) I am not sure I have the skill and devotion to be an exceptional parent, and as such I will be waiting, and perhaps never reproducing, or (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I am sure I have the skill and devotion to be an exceptional parent, and I am on my way toward devoting my life to that calling.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-07T23:18:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThat is the traditional view, but it does not seem to hold up scientifically. There was a definite influence of religion, but that did not mean other progress was halted. It is just that the enlightenment came afterwards and people at the time felt compelled to look down on that earlier, in their eyes more primitive age.\u003Cp\u003EIt is changing and will be changing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Be prepared. You say it like it is bad to have better insights into what actually happened.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll go straight to the point - are you a Christian apologetic with an agenda?\u003C/p\u003E\n"},{"CreatedByName":"Apotheosist","CreatedById":9399,"CreatedDateTime":"2013-10-07T23:33:56Z","Content":"\n\u003Cp\u003EI\u0027ve read through all of the replies so far, they make for very interesting reading indeed.\u003C/p\u003E\u003Cp\u003EI\u0027ve made a list of all the problems people have suggested. I have 25 points. Obviously I don\u0027t count the repeated ones. Overpopulation, stupidity, and ourselves seem to be the most popular ones \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was thinking, maybe I should add a poll onto this thread with all the main problems so far mentioned, so people can vote which they think is the biggest one and we will all be able to see the results. What do you guys think?\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-10-07T23:36:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EWhat I\u0027m saying is that, our cultures should do a better job of socializing us (via our parents, peers and communities) to regard parenting not as an \u0027automatic\u0027 or \u0027no big deal\u0027 but as a very important thing. By the time we reach puberty we should all have a sense that either (a) I am not sure I have the skill and devotion to be an exceptional parent, and as such I will be waiting, and perhaps never reproducing, or (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I am sure I have the skill and devotion to be an exceptional parent, and I am on my way toward devoting my life to that calling.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile it is a noble idea, we\u0027d never be able to get the \u0022go forth and multiply\u0022 crowd to buy into it... And it makes me think of the opening sequence in \u003Ca href=\u0022https://en.wikipedia.org/wiki/Idiocracy\u0022 rel=\u0022external nofollow\u0022\u003EIdiocracy\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-10-08T00:15:28Z","Content":"\n\u003Cp\u003EApathy. Too many times have I been told to stop worrying about a specific problem because I won\u0027t be alive to see the consequences, or it\u0027s not my job, surely other people will take care of it.\u003C/p\u003E\u003Cp\u003EHonestly, this kind of thinking will get us all killed. We need to work together to solve our problems as a species for the benefit of all.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-08T00:43:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WestAir\u0022 data-cite=\u0022WestAir\u0022\u003E\u003Cdiv\u003EWell that was full of happiness and sunshine.\u003Cp\u003EI\u0027m hesitant to consider the looming oil disaster as, well, disastrous. When the oil industry collapses and fossil fuels run dry, which will happen, I can\u0027t help but feel like all it will do is turn us to create a new industry in its place. Maybe we\u0027ll turn to alternate types of mogas like kerosine or avgas for combustion as petroleum resources fade. Note that the collapse of the oil industry won\u0027t happen on the 2nd Tuesday of October and catch everyone by surprise. It\u0027ll be a gradual collapse that will see to the gradual rise of gas prices and the reduction of oil infrastructure and manufacturing. As industry jobs are lost and oil prices exceed affordable rates, it will make alternative industries less expensive than oil, and they\u0027ll begin to take hold.\u003C/p\u003E\u003Cp\u003EWhile none of us can see the future, it\u0027s hard to say definitively that we\u0027re in for \u0022centuries of hell\u0022. People have been saying that for centuries, and it\u0027s never come to fruition. If anything, life has become \u003Cem\u003E\u003Cstrong\u003Ea lot\u003C/strong\u003E\u003C/em\u003E better over the centuries despite the complexities we continue to throw into our society as a result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen oil becomes rarer price goes up, this makes other options become more interesting. At 120-140$/ barrel synthetic oli from coal or gas becomes economical. Gas can be used directly and works pretty well however electrical cars and hybrids will probably become common before this because they are more environmental friendly and has the possibility to be cheaper to run. \u003C/p\u003E\u003Cp\u003EOn the other hand US oil production is increasing.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-10-08T00:55:13Z","Content":"\n\u003Cp\u003EHumanity..\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-10-08T01:21:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EI\u0027ll check the article out, but I thought that the Sun orbited at a distance where the spiral arm density waves travel at about the same speed as a star in a circular orbit? Wasn\u0027t that like, half the idea behind the \u0022galactic habitable zone\u0022 concept (the other half being high enough metalicy for terrestrial planets)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the ideas I have read essentially posit that Sol has tended to spend most of its time within galactic arms, rather than between them, however it still crosses those voids. I still think the galactic hab zone is a valid idea. Solstation is a good site for that kind of info. As for metallicity, tau Ceti is relatively metal poor, but there are strong indications that it has planets (and the PHL at Arecibo accepts the data as true), and tC 4 is considered to be a super terran.\u003C/p\u003E\u003Cp\u003EBack on topic, yes siree, Earth and humanity are facing problems.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T01:26:18Z\u0022 title=\u002210/08/2013 01:26  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by Dispatcher\u003C/strong\u003E\n\u003Cbr\u003EGetting back on topic.\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-08T01:43:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrewas\u0022 data-cite=\u0022andrewas\u0022\u003E\u003Cdiv\u003EAmongst people who care to learn, yes. Most of the people I know are only interested in football teams or stupid celebrities. Anything real, and they aren\u0027t interested.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESurround yourself with different people \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E The rest will be sorted out by evolution in the long run.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EI\u0027ll go straight to the point - are you a Christian apologetic with an agenda?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, and I love spamming these forums that are full of scientific heretics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELet\u0027s stick to the facts without resorting to ad hominems, shall we?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T01:50:58Z\u0022 title=\u002210/08/2013 01:50  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-10-08T03:17:12Z","Content":"\n\u003Cp\u003EAh a fellow heretic. Good! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-08T04:51:04Z","Content":"\n\u003Cp\u003Elack of nuclear wars. we need to do something about that.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-08T07:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EAir travel will disappear. Trucking will disappear and since most stuff in the US is shipped by truck, that\u0027ll have pretty large consequences. Overseas shipping, diesel-electric trains, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not really how it will work. Over time oil will become more expensive, but it won\u0027t become totally unavailable. It\u0027ll just become uneconomic to access what does remain. Even if the cost of crude oil becomes preclusive, there are other chemical routes that will be exploitable to bridge the gap while retaining the same or similar engine technology, such as coal to oil, or biofuels. The transition will give industry enough time to adapt their power plants to entirely new fuels if required. Things like transport are fundamental to the economy, they simply won\u0027t be allowed to go away. They might have to change, prices might go up or down, there will be disruption and change, but they won\u0027t disappear.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T07:15:55Z\u0022 title=\u002210/08/2013 07:15  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nuclearpower13","CreatedById":83461,"CreatedDateTime":"2013-10-08T12:27:30Z","Content":"\n\u003Cp\u003EI honestly believe its religion . For those that live in the United States Congress and most of the Republican party is composed of right wing bible thumper nut cases. These are the people that control our education system, funding for NASA, funding for research into vaccines to cure deceases, and passing laws that contradict our constitution. We need to get religion out of our political system.\u003C/p\u003E\n"},{"CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2013-10-08T12:49:24Z","Content":"\n\u003Cp\u003EI\u0027m going to say \u003Cem\u003Echeap\u003C/em\u003E Sustainable Energy, as producing that would solve or significantly reduce many of the other problems.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-10-08T13:06:15Z","Content":"\n\u003Cp\u003EI\u0027m with jbowon, Overpopulation isn\u0027t a problem. ( Yet )\u003C/p\u003E\u003Cp\u003EAlthough there is cause for concern, i think we need to focus on other matters first. Like Education and Alternate clean fuel sources for my F-150.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-10-08T13:16:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nuclearpower13\u0022 data-cite=\u0022nuclearpower13\u0022\u003E\u003Cdiv\u003EI honestly believe its religion . For those that live in the United States Congress and most of the Republican party is composed of right wing bible thumper nut cases. These are the people that control our education system, funding for NASA, funding for research into vaccines to cure deceases, and passing laws that contradict our constitution. We need to get religion out of our political system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunfact about the GOP: Science hast most of the time been funded more under Republican administations than under the Democrats. I don\u0027t like either parties tho.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-10-08T15:35:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Airbornem4\u0022 data-cite=\u0022Airbornem4\u0022\u003E\u003Cdiv\u003EI\u0027m with jbowon, Overpopulation isn\u0027t a problem. ( Yet )\u003Cp\u003EAlthough there is cause for concern, i think we need to focus on other matters first. Like Education and Alternate clean fuel sources for my F-150.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd, once again, overpopulation is not just about running out of food or natural resources. Clean energy wouldn\u0027t be such an urgent problem if we only had like 1/5th the current population, and hence, 1/5th the current pollution. Overpopulation = pollution \u002B destruction of forests/land for farmland/housing. We bemoan invasive species and try to fight their spread, when we are by far the worst invasive species on the planet. I\u0027m not saying we shouldn\u0027t live on every continent, I\u0027m saying we should live responsibly, in better controlled numbers with better environmental stewardship. We\u0027re not like some dumb pythons invading the Everglades; we\u0027re smart enough to know better, but too damn apathetic to care.\u003C/p\u003E\u003Cp\u003EHonestly, if we don\u0027t get our act together, we deserve to be wiped out. Hopefully, one day another intelligent race would arise on Earth and learn from our mistakes. At least they\u0027d have a hard time finding enough left over oil and coal to !@#$ up the atmosphere. However, even if we were to totally wreck the environment, it\u0027s unlikely the human species would become extinct. Humans are the most adaptable animals on the planet, and the most adaptable animals are always the ones to survive the mass extinctions.\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cp\u003EI\u0027m actually surprised how few mentions of nuclear weapons there are. The nuclear threat still hangs over our heads today, it\u0027s greatly reduced but it\u0027s still there, and given enough time, a nuclear war is very likely to break out. But maybe the threat of nuclear war can be filed under the heading of \u0022human stupidity\u0022, since it is ultimately stupid humans who press the button.\u003C/p\u003E\u003Cp\u003EAgain though, I find the possibility of a nuclear war completely driving humans to extinction unlikely.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T15:51:23Z\u0022 title=\u002210/08/2013 03:51  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-10-08T16:07:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EI\u0027m not saying we shouldn\u0027t live on every continent, I\u0027m saying we should live responsibly, in better controlled numbers with better environmental stewardship. We\u0027re not like some dumb pythons invading the Everglades; we\u0027re smart enough to know better, but too damn apathetic to care.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would add \u0022too self interested to care\u0022. Look at the justifications people use for driving their F150s. For taking \u0022adventure\u0022 cruises to the Galapagos and Antarctica. For caving. Even in the absence of religious ideology that encourages exploitation of the planet\u0027s resources, people almost always place their own self interests ahead of the greater good. That\u0027s probably human instinct, but one of the most unique things about us is that we have the capacity to override our instincts with reason if we\u0027re willing to make the effort.\u003C/p\u003E\n"}]}