{"TopicId":47793,"ForumId":55,"TopicTitle":"An alternative tech tree idea: categories of research","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-09T02:11:40Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-09T02:11:40Z","Content":"\n\u003Cp\u003EI don\u0027t expect Squad to change their tech tree to accommodate for this or even really care that much about it, but the idea for it has been bouncing about in my head for some time. I figured I might as well mention it now that we have the tech tree coming. What I came up with was a fluid, natural development cycle which focuses more on categories of research. Instead of having parts be unlocked by tiers, parts are instead developed based on what type of scientific research you perform.\u003C/p\u003E\u003Cp\u003E The categories I came up with were:\u003C/p\u003E\u003Cp\u003ERocketry\u003C/p\u003E\u003Cp\u003EAerodynamics\u003C/p\u003E\u003Cp\u003EStructural\u003C/p\u003E\u003Cp\u003EUtility\u003C/p\u003E\u003Cp\u003EElectronics\u003C/p\u003E\u003Cp\u003EExperimentation\u003C/p\u003E\u003Cp\u003EMicro-Scale\u003C/p\u003E\u003Cp\u003EMacro-Scale\u003C/p\u003E\u003Cp\u003E As you invest in them, you get more advanced parts. Get enough development overall in the branches, and you unlock better tech. Here are a few examples I cooked up from the engine categories (assuming that you start with Rocketry 1 and nothing else):\u003C/p\u003E\u003Cp\u003ELV-T30 Liquid Fuel Engine: Rocketry 1\u003C/p\u003E\u003Cp\u003ELV-T45 Liquid Fuel Engine: Rocketry 2\u003C/p\u003E\u003Cp\u003ELV-909 Liquid Fuel Engine: Rocketry 3\u003C/p\u003E\u003Cp\u003ERockomax 24-77: Rocketry 2, Micro-Scale 1\u003C/p\u003E\u003Cp\u003ERockomax 48-7S: Rocketry 3, Micro-Scale 2\u003C/p\u003E\u003Cp\u003ELV-1 Liquid Fuel Engine: Rocketry 1, Micro-Scale 2\u003C/p\u003E\u003Cp\u003ELV-1R Liquid Fuel Engine: Rocketry 2, Micro-Scale 2\u003C/p\u003E\u003Cp\u003ERockomax Mark 55 Radiam Mount Liquid Engine: Rocketry 2, Macro-Scale 1\u003C/p\u003E\u003Cp\u003ERockomax \u0022Poodle\u0022 Liquid Engine: Rocketry 3, Macro-Scale 2\u003C/p\u003E\u003Cp\u003ERockomax \u0022Skipper\u0022 Liquid Engine: Rocketry 3, Macro-Scale 3\u003C/p\u003E\u003Cp\u003ERockomax \u0022Mainsail\u0022 Liquid Engine: Rocketry 4, Macro-Scale 3\u003C/p\u003E\u003Cp\u003EToroidal Aerospike Rocket: Rocketry 4, Experimentation 3\u003C/p\u003E\u003Cp\u003ELV-N Atomic Rocket Engine: Rocketry 5, Electronics 3, Experimentation 4\u003C/p\u003E\u003Cp\u003EBasic Jet Engine: Rocketry 1, Aerodynamics 1\u003C/p\u003E\u003Cp\u003ETurboJet Engine: Rocketry 2, Aerodynamics 2\u003C/p\u003E\u003Cp\u003ERT-10 Solid Fuel Booster: Rocketry 1\u003C/p\u003E\u003Cp\u003ERockomax BACC Solid Fuel Booster: Rocketry 2, Macro-Scale 1\u003C/p\u003E\u003Cp\u003ESepratron I: Rocketry 2, Micro-Scale 1\u003C/p\u003E\u003Cp\u003E The basic idea behind this is that technology is not something which develops in chunks independently of other research, but rather that breakthroughs are the result of continuous expansion of understanding in a multitude of categories. It was just my own take on things, and a bit different than the usual sort of tech trees you see in video games. I\u0027m not too terribly surprised that a potentially very complicated system like this wasn\u0027t used.\u003C/p\u003E\n"}]}