{"TopicId":47818,"ForumId":50,"TopicTitle":"Basic Aircraft Design - Explained Simply, With Pictures","CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-09T14:33:25Z","PageNum":1,"Articles":[{"CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-09T14:33:25Z","Content":"\n\u003Cp\u003E\nHey KSP folks! The Space Plane Hangar remains a conundrum for quite a few, and since it\u0027s one of my favorite parts of KSP, I wanted to shed some light on concepts that might help others build their own successful aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\nIn retrospect, this is something between a design and basic concepts of flight tut, but whatever, here goes!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://drive.google.com/open?id=1ZEC8Utd8d2l3eUZxglNpTRbPfw0p1T8u\u0022 rel=\u0022external nofollow\u0022\u003EBasic Aircraft Design .craft pack\u003C/a\u003E - Here is a basic .craft pack I\u0027ve put together with some stupid-simple designs taking different approaches.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the easiest plane to fly ever, the \u003Ca href=\u0022https://drive.google.com/open?id=1kKo4DrDnwmiIbixNBCwK6cxklwzx4AbL\u0022 rel=\u0022external nofollow\u0022\u003EEZ Trainer Mk7 \u0022Just hold the S-key\u0022 Edition\u003C/a\u003E. \u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cem\u003ENote: These crafts were built on KSP v0.21.1.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv style=\u0022text-align:center;\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E~The tut is an embedded image, you should see it below this text. It may take some time to download.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlternate Mirror: \u003Ca href=\u0022https://drive.google.com/open?id=1ksvqjX8FzRU6-Vqs2qDNbtpOxYJnhNj0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/open?id=1ksvqjX8FzRU6-Vqs2qDNbtpOxYJnhNj0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GqLQktX.jpg\u0022 src=\u0022http://i.imgur.com/GqLQktX.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETranslations:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFrench guide, by Varsass - \u003Ca href=\u0022http://kerbalspaceprogram.fr/forum/viewtopic.php?f=10\u0026amp;t=2758\u0022 rel=\u0022external nofollow\u0022\u003EBasic Aircraft Design - Français\u003C/a\u003E, \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/66999462/AircraftDesign_FrenchGuide.jpg\u0022 rel=\u0022external nofollow\u0022\u003EMirror\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nChinese guide, by Baozidai - \u003Ca href=\u0022http://bbs.3dmgame.com/forum.php?mod=viewthread\u0026amp;tid=5586843\u0026amp;page=1\u0026amp;extra=#pid192551452\u0022 rel=\u0022external nofollow\u0022\u003EBasic Aircraft Design - 简体中文版\u003C/a\u003E, \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/66999462/AircraftDesign_ChineseGuide.png\u0022 rel=\u0022external nofollow\u0022\u003EMirror\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETranslation Permissions:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EYou have my permission to translate this guide into other languages if one does not already exist. Please be respectful to the original content by maintaining its indented meaning if possible. The font used for the guide is Humor Sans and can be \u003C/em\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/66999462/Humor-Sans.ttf\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003Edownloaded here\u003C/em\u003E\u003C/a\u003E\u003Cem\u003E. You may use different fonts for your translation as needed.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EPlease include a link to this thread in your post for your translated version. In addition, please private message me a link to your translation so I may include it here. Thanks!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\nv28.1 2/12/20 - Updated thread links; reuploaded .craft files and image mirror link.\nv28.1 - Added section for Angle of Incidence, asymmetric thrust compensation, landing gear positioning, minor fixes\nv25.1 - Minor fixes and rephrasing, spelling corrections\nv25 - Expanded drag force, landing gear, CoL relative to CoM, Added section on AoA, several other fixes\nv20 - Clarified the relationship of CoL to CoM, neutral stability\nv19 - With an additional 50% material; center of thrust, center of lift, edit fixes on existing articles\nv11 - Turbo infused with 100% more knowledge!\nv7 - Initial Release\n\u003C/pre\u003E\n\u003Cdiv style=\u0022text-align:center;\u0022\u003E\n\u003Cp\u003E\nFor a more realistic drag model get\n\u003C/p\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20451\u0022 rel=\u0022\u0022\u003EFerram Aerospace Research\u003C/a\u003E.\n\u003Cp\u003E\nIf you\u0027re looking for more aircraft parts, check out my own mod, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155448-122-kerbal-aircraft-expansion-kax-v264/\u0022 rel=\u0022\u0022\u003EKerbal Aircraft Expansion (KAX)\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n.\n\u003C/p\u003E\n\u003Cdiv style=\u0022text-align:center;\u0022\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76668\u0022 rel=\u0022\u0022\u003E\u003Cimg alt=\u0022uFPqHRa.jpg\u0022 src=\u0022http://i.imgur.com/uFPqHRa.jpg\u0022\u003E\u003C/a\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-13T07:02:05Z\u0022 title=\u002202/13/2020 07:02  AM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 13, 2020\u003C/time\u003E by keptin\u003C/strong\u003E\n\u003Cbr\u003EAdded Chinese version of guide\n\u003C/span\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2013-10-09T14:37:55Z","Content":"\n\u003Cp\u003EI see no pictures..\u003C/p\u003E\n"},{"CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-09T14:47:58Z","Content":"\n\u003Cp\u003EHmm, I just changed hosts, it should work now. I added some mirror links at the bottom of the OP if it doesn\u0027t.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E*10/9 Edit* - Updated the tutorial with 100% more knowledge!\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-10T04:18:41Z\u0022 title=\u002210/10/2013 04:18  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 10, 2013\u003C/time\u003E by keptin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pwnstarr","CreatedById":84803,"CreatedDateTime":"2013-10-10T12:27:05Z","Content":"\n\u003Cp\u003EThanks! Needed this a lot. Very well done.\u003C/p\u003E\n"},{"CreatedByName":"Chase","CreatedById":69765,"CreatedDateTime":"2013-10-10T17:21:43Z","Content":"\n\u003Cp\u003EGood job, glad to see you added a much needed section on CoT, hopefully more people will know what causes their jets to start spinning out at high altitudes (or weird orientations).\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-10T17:31:46Z","Content":"\n\u003Cp\u003EHumorous, and informative. Even more veteran KSP pilots can pick up a thing or two here. This deserves to get stickied.\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-10-10T17:45:30Z","Content":"\n\u003Cp\u003EMassive props for this thread!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-10T19:11:40Z","Content":"\n\u003Cp\u003EMost definitely one for the Drawing Board!\u003C/p\u003E\n"},{"CreatedByName":"Trann","CreatedById":83801,"CreatedDateTime":"2013-10-10T19:21:30Z","Content":"\n\u003Cp\u003EUpvote. \u002B1. Would read again.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-10T19:53:29Z","Content":"\n\u003Cp\u003EFantastic work keptin, you\u0027ve been stickied \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-10-10T19:55:27Z","Content":"\n\u003Cp\u003EAmazing work! I\u0027ve been playing for a long time and I think I made one successful SSTO out of 20 or so designs by luck. This will REALLY help!\u003C/p\u003E\u003Cp\u003E\u002Brep\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-10T23:18:13Z","Content":"\n\u003Cp\u003EVery good, but I want to make one little correction:\u003C/p\u003E\u003Cp\u003EThe section on \u0022distance the CoL is behind the CoM\u0022 is correct up until \u0022Too Far\u0022 which doesn\u0027t equal flip-happy; if the CoL is too far behind the CoM that should be \u0022Lawn Dart / LOL how does pitch up?\u0022 \u0022Flip happy\u0022 should correspond to \u0022Anywhere in front of\u0022 which would help make the information a little more consistent for new airplane designers.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-10T23:23:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EThis deserves to get stickied.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EFantastic work keptin, you\u0027ve been stickied \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat didn\u0027t take long now did it. Rep on both Keptin and Sal for that one.\u003C/p\u003E\n"},{"CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-10T23:26:13Z","Content":"\n\u003Cp\u003EThanks ferram, I\u0027ll clarify that in the next update by differentiating \u003Cem\u003E\u0022CoL too far behind CoM\u0022\u003C/em\u003E and \u003Cem\u003E\u0022CoL too far in front of CoM\u0022\u003C/em\u003E as having two separate behaviors. I like the lawn dart analogy.\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2013-10-10T23:41:01Z","Content":"\n\u003Cp\u003EThis is probably one of the most helpful things i have found on the forums, as have only gotten two space planes into orbit! Thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-10-11T00:01:16Z","Content":"\n\u003Cp\u003EJust one point on drag - more parts does not mean more drag. Drag is proportional to mass, which means the acceleration of each part is determined solely by its drag value, and the mass weighted average of all the drag values determines the overall drag value. When you add a part, you essentially pull the craft\u0027s drag closer to that part\u0027s drag.\u003C/p\u003E\u003Cp\u003EFor example, a SRB has 0.3 drag. add a rocket nosecone (with 0.3 drag) and the craft\u0027s drag will stay at 0.3. Add wings (about 0.02 drag) and the craft\u0027s drag will go down. Add a cupola (0.4 drag) and the craft\u0027s drag will go up again.\u003C/p\u003E\u003Cp\u003ETL;DR: KSP drag is weird but not weird in the way you think it\u0027s weird. Unless I\u0027m mistaken.\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-10-11T02:01:26Z","Content":"\n\u003Cp\u003EVery nice tutorial, good read and informative. \u003C/p\u003E\u003Cp\u003EYou missed a point on dihedral angle though. Even with its primitive drag model positive dihedral will tend to roll a plane back level again which is key if you want to fly without SAS (which i find makes landings much easier).\u003C/p\u003E\u003Cp\u003EHope to see more.\u003C/p\u003E\n"},{"CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-11T04:55:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Supernovy\u0022 data-cite=\u0022Supernovy\u0022\u003E\u003Cdiv\u003ETL;DR: KSP drag is weird but not weird in the way you think it\u0027s weird. Unless I\u0027m mistaken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way drag is calculated in KSP still confuses me and I feel I need an Explain Like I\u0027m Ten on this so I can ELI5 in the tut.\u003C/p\u003E\u003Cp\u003EOk, for the sake of an example, say our craft consists of nothing but 2 fuel tanks, each with 0.2 drag. How will this compare to a craft made of 4 fuel tanks, drag wise? Now, what if we have a craft with 2 fuel tanks, one with 0.2 drag and the other with 0.1 drag?\u003C/p\u003E\u003Cp\u003EWhat is the relationship between the drag value, mass, and number of parts, and how does that affect actual performance?\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-10-11T05:07:10Z","Content":"\n\u003Cp\u003EAs far as I can tell, drag is just The drag value (ex. 0.2) times mass (2). Then it is applied to every part in the craft as a negative acceleration aiming retrograde (not actually sure about the last parr)\u003C/p\u003E\u003Cp\u003EWhat I would like to know is what the drag coefficient in thrme configs stands for.\u003C/p\u003E\u003Cp\u003EBtw, AMAZING thread! Inspired me to make a U-2 remake.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-11T05:19:29Z","Content":"\n\u003Cp\u003EI think your confusion is that Supernovy is talking about the arbitrary \u0022maximum_drag\u0022 factor that goes into the drag equation, and that you are thinking in terms of \u0022drag force\u0022 which does increase with the number of parts. Here\u0027s the drag equation:\u003C/p\u003E\u003Cp\u003Edrag force = 0.5 * air_density * surface_velocity\u003Csup\u003E2\u003C/sup\u003E * maximum_drag * mass * FlightGlobals.DragMultiplier\u003C/p\u003E\u003Cp\u003EThis is worked out for each part, where maximum_drag, mass and surface_velocity are part-specific, air_density is based on altitude, and the DragMultiplier is a constant factor that can be ignored for our purposes.\u003C/p\u003E\u003Cp\u003EAssuming all fuel tanks have the same mass for this:\u003C/p\u003E\u003Cp\u003EFor your example of 2 fuel tanks vs. 4 fuel tanks, both craft will have a maximum_drag of 0.2; the average maximum_drag of each vessel is 0.2. However, the craft with 4 tanks will have twice as much drag as the one with 2 tanks, because it has twice as much mass. \u003C/p\u003E\u003Cp\u003EFor a craft with two fuel tanks, one with maximum_drag = 0.2, the other 0.1, the average maximum_drag of your craft will be 0.15 (mass averaged), and the total drag force will be 75% of the original 2 fuel tank craft.\u003C/p\u003E\u003Cp\u003EI think you understand it fine, and the explanation in the tutorial is correct; however, make sure to differentiate between total drag \u003Cem\u003Eforce\u003C/em\u003E and the maximum_drag \u003Cem\u003Evalue\u003C/em\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T06:03:51Z\u0022 title=\u002210/11/2013 06:03  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003Cbr\u003Etypos\n\u003C/span\u003E\n"},{"CreatedByName":"keptin","CreatedById":8884,"CreatedDateTime":"2013-10-11T05:39:58Z","Content":"\n\u003Cp\u003EAwesome, thanks, that was exactly the rundown I needed. I think I\u0027ll expand on drag a bit in the tut and differentiate between those values.\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-10-11T05:56:51Z","Content":"\n\u003Cp\u003EAs long as the center of lift is inside the center of mass, it should be a pretty stable aircraft.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-10-11T10:22:44Z","Content":"\n\u003Cp\u003ELet me put it this way: there is no difference in aerodynamic properties (e.g. terminal velocity) between the 2 0.2 drag tanks and the 4 0.2 drag tanks. The force may be different, but the mass dependence on drag exactly cancels out. For example, dropping a full fuel tank and empty fuel tank through the air, both will hit the ground at the same speed. Adding more parts will not make drag slow you down more.\u003C/p\u003E\u003Cp\u003EFerram4\u0027s entire post is correct, but I want to point out that the drag properties of a KSP craft can be determined solely through the maximum_drag values, just like you don\u0027t need the mass of an object to figure out what rate it will fall at under gravity.\u003C/p\u003E\u003Cp\u003EAmpsterMan: I believe the maximum_drag value represents the drag coefficient, which depends on shape. The mass dependence then represents the surface area. The actual values, however, seem to be chosen without respect to shape.\u003C/p\u003E\u003Cp\u003EIf I have something wrong, please correct me.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-10-11T17:08:46Z","Content":"\n\u003Cp\u003EAwesome tutorial! I think it achieves its goals exactly, and will certainly help visual thinkers get in the air. \u003C/p\u003E\u003Cp\u003ENot sure about the font though... But that\u0027s just personal taste.\u003C/p\u003E\n"},{"CreatedByName":"antbin","CreatedById":22389,"CreatedDateTime":"2013-10-11T17:38:45Z","Content":"\n\u003Cp\u003EGreat summary pic. Some nitpicks / comments:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKSP lift model is a simple curve - wings give tiny ift at zero AOA, lots of lift at 20 degrees, and less lift after that.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhat this means is Canards don\u0027t stall before the main wing in KSP, unless you give them a notch of trim-up rotation in the SPH. Same goes for elevons (but less important).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWing aspect ratios don\u0027t matter much without FAMod, the same wing pieces give the same lift. Only thing that changes is your plane is harder to roll.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWing sweep does matter in KSP, but not like in real life. Stock KSP wings only produce lift from air flow perpendicular to the part (not the plane!). This has two effects. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1) If you rotate wing panels 90 degrees, they won\u0027t do anything.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2) If you make swept wings, with wing segments rotated, your plane will have less lift when going straight, and yaw-roll coupling (when it goes sideways, one wing side will generate more lift than the other, rolling the plane). Due to this, swept-forward wings are actually more stable in KSP!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWinglets and Canards apply force at their mounting point (not their apparent center), so canards-on-wings can act like almost perfect rudders (no yaw-roll coupling)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe most common complaint about tricycle landing gear is \u0022why does my plane swerve off the runway\u0022. The answer: \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1) Your rear gear isn\u0027t straight or\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2) your plane\u0027s rear is lifting off first, putting all the weight on the front wheel (wheelbarrowing).\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGreat explanations though! I\u0027d also love to help with an advanced guide.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-11T17:42:56Z\u0022 title=\u002210/11/2013 05:42  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 11, 2013\u003C/time\u003E by antbin\u003C/strong\u003E\n\u003C/span\u003E\n"}]}