{"TopicId":47935,"ForumId":16,"TopicTitle":"Pre-rotating my craft in the VAB, and, does this affect SAS modules?","CreatedByName":"tfabris","CreatedById":82885,"CreatedDateTime":"2013-10-10T17:27:25Z","PageNum":1,"Articles":[{"CreatedByName":"tfabris","CreatedById":82885,"CreatedDateTime":"2013-10-10T17:27:25Z","Content":"\n\u003Cp\u003EWhen creating or editing new spacecraft in the VAB, I have taken to starting it off with the command capsule pre-rotated 1/4 turn (press \u0022Q\u0022 once with the capsule \u0022picked up\u0022 IIRC) so that, when I finally put the craft on the launch pad, it automatically starts off facing eastward. This makes the launch and the gravity turn simpler (at least to my monkey brain) so that I\u0027m simply nosing over instead of tilting right (or rotating right then nosing over). \u003C/p\u003E\u003Cp\u003EI\u0027ve noticed that I have to make sure to do the same thing with docking ports and remote-control modules that I add to the craft. Basically, anything that I can select \u0022control from here\u0022 for. If I don\u0027t rotate those parts to match in the VAB, then when I select \u0022control from here\u0022 for those parts, they are not aligned the same way as the capsule. Those parts seem to contain a handy marker or polarization indicator to make that process easy for me, so that I can tell which way they\u0027re rotated in the VAB.\u003C/p\u003E\u003Cp\u003ESo far so good.\u003C/p\u003E\u003Cp\u003EMy question is probably a silly one, is this:\u003C/p\u003E\u003Cp\u003EDoes the same need-for-proper-rotation apply to SAS modules? They don\u0027t seem to have a polarization indicator. I\u0027m wondering if, sometimes when I have trouble rotating the ship via SAS reaction wheels, it\u0027s because various modules are fighting each other, such as the SAS built into the command capsule rotated one way is fighting the SAS ring I installed on the ship that I didn\u0027t rotate. Is that possible? Or do the SAS modules Just Work no matter what rotation they have?\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-10-10T18:06:35Z","Content":"\n\u003Cp\u003EDocking ports / pods does have a up and rotation orientation because they can be used as reference points for the navball (the control from here).\u003C/p\u003E\u003Cp\u003EReaction whells does not have that and so work the same way no matter how you put them.\u003C/p\u003E\u003Cp\u003EOne of my suggestion for the first remarue is to design your rocket without rotation first, and then rotate all the rocket, so you have the orientation you like for the launching.\u003C/p\u003E\n"}]}