{"TopicId":4802,"ForumId":16,"TopicTitle":"Awkward RCS tank usage","CreatedByName":"ARock","CreatedById":349,"CreatedDateTime":"2011-12-24T01:28:00Z","PageNum":1,"Articles":[{"CreatedByName":"ARock","CreatedById":349,"CreatedDateTime":"2011-12-24T01:28:00Z","Content":"\n\u003Cp\u003EPlaying with the stages has changed which RCS tanks are used first and then second. With this design the RCS in the Lunar Lander Probe are drained first then the large 2m RCS tank, then the orbital module. The proper RCS usage should be 2m RCS -\u0026gt; Orbital module -\u0026gt; then Lander. Attached is an image of Vehicle in question, is this fixable or is this some kind of RCS fuel usage bug?\u003C/p\u003E\u003Cp\u003EThis is severely hampering my ability to fly this rocket, without the RCS on the lander, the probe engine cannot supply enough force to softly land the probe.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-12-24T01:32:43Z","Content":"\n\u003Cp\u003ETurn the RCS off.\u003C/p\u003E\n"},{"CreatedByName":"ARock","CreatedById":349,"CreatedDateTime":"2011-12-24T02:37:31Z","Content":"\n\u003Cp\u003EWouldn\\\u0027t really solve the problem, as without the RCS the Ship can\\\u0027t flip itself for a retro burn in munar orbit. Having RCS is pointless if I don\\\u0027t use it.\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2011-12-24T02:57:38Z","Content":"\n\u003Cp\u003EIdk if you\\\u0027d call it a bug, but it is the way the game is designed I believe.\u003C/p\u003E\u003Cp\u003EFuel is used Top - \u0026gt; Down, which is nice for regular fuel tanks, but not RCS.\u003C/p\u003E\n"},{"CreatedByName":"Hypocee","CreatedById":8609,"CreatedDateTime":"2011-12-24T03:00:29Z","Content":"\n\u003Cp\u003EIt\\\u0027s difficult to work out stage structures from pictures; the .craft file from your KSP/Ships directory would be a better way for people to get their hands on your problem. For what it\\\u0027s worth, RCS was initially created with a counterintuitive but customizable algorithm that used tanks in the order they were placed on the craft. It\\\u0027s now supposedly changed to purely using the physically lowest tank on the craft first. A couple of people are having issues that suggest that the latter may not be true, or may become untrue in some circumstances.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2011-12-24T05:03:10Z","Content":"\n\u003Cp\u003EIt would appear, from a somewhat closer examination of the pictures provided, that the problem is not likely to be the ship, and is unfortunately not fixable on your end. With any luck, this but will be backtraced and fixed with the release of version 0.13.1.\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2011-12-24T23:41:08Z","Content":"\n\u003Cp\u003ERCS uses fuel bottom to top, whilst normal fuel is used up top to bottom...\u003C/p\u003E\u003Cp\u003EIt must be a bug. But like what buzz said, in a pinch you can just turn them off.\u003C/p\u003E\n"}]}