{"TopicId":48258,"ForumId":16,"TopicTitle":"3 Easy Steps to Finding the Gilly Pyramid","CreatedByName":"TheBrisbyMouse","CreatedById":80175,"CreatedDateTime":"2013-10-13T19:32:35Z","PageNum":1,"Articles":[{"CreatedByName":"TheBrisbyMouse","CreatedById":80175,"CreatedDateTime":"2013-10-13T19:32:35Z","Content":"\n\u003Cp\u003EHello all! This is my first tutorial for KSP, so it\u0027s not going to be the best thing ever.\u003C/p\u003E\u003Cp\u003ESo you\u0027ve landed successfully on Gilly, you\u0027ve done your EVA\u0027s, planted your flags, and drove your rovers around(or failed to drive due to the minimal gravity). Now what? Once you\u0027ve landed, you notice you still have enough Delta-V to escape the Kerbol system! Well, probably not that much, but you get the idea. So what do you do with it? So you look at the wiki and see under easter eggs, that there\u0027s a pyramid on Gilly! If you\u0027re like me, one thing will be going through your head: \u0022Find ALL the easter eggs!\u0022 and you go looking for it. And after almost an hour of looking, you ragequit and head home. But look no further! I have 3 simple steps for finding it!\u003C/p\u003E\u003Cp\u003EStep 1: Aquire a perfectly equatorial orbit(important, but not nessecary)\u003C/p\u003E\u003Cp\u003EStep 2: Drop your orbit until your periapsis and apoapsis is between 6450 and 6500 meters. This is about the lowest you can get without unintentional lithobraking. Turning ground scatter off helps too.\u003C/p\u003E\u003Cp\u003EStep 3: On Gilly, there are many \u0022knobs\u0022 sticking out from the surface. When you fly over one, look very closely at it. Keep looking until one of the \u0022knobs\u0022 has several ridges meeting near the top of it like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1092.photobucket.com/albums/i414/Swayti14/screenshot51_zps6a4ed4cd.png\u0022 alt=\u0022screenshot51_zps6a4ed4cd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe pyramid is where those ridges in the center meet. You may need to descend quite a distance to see the pyramid itself, depending on how good your vision is and how the sunlight is striking the pyramid. \u003C/p\u003E\u003Cp\u003EStep 4: Land on that sucker! And be sure to stick a flag on its top, you don\u0027t want to try finding it again!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1092.photobucket.com/albums/i414/Swayti14/screenshot47_zps4f421525.png\u0022 alt=\u0022screenshot47_zps4f421525.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe craft pictured here was the one I used to locate it. I can understand how people who easily found the pyramid on Duna have problems finding this one. The Gilly pyramid is much, much smaller and blends in pretty well with the terrain(as apposed to the Duna pyramid, which is white). I hope this helped!\u003C/p\u003E\n"}]}