{"TopicId":48409,"ForumId":55,"TopicTitle":"New part sizes","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-14T22:37:13Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-14T22:37:13Z","Content":"\n\u003Cp\u003ESo, we are all pretty familiar with the stock parts sizes, but where to next? KSP really has three main options for improving size.\u003C/p\u003E\u003Cp\u003EThey can go the way of RLA Stockalike and make more sizes of 0.625m tanks and engines (that pack really needs to go stock). They can go the way of KW Rocketry with 3.75m parts like tanks and engines (we should be then seeing bigger control surfaces and SAS units to help control those monstrosities). Or lastly, they can go the way of Novapunch, including 3.75 and even the rediculously large 5m tanks and engines. Once this thread begins to generate a consensus on which sizes Squad should pursue, I\u0027ll post that as an official suggestion. With these extra parts, I think it would also be time for the subcategory system, already written into the config files, to be implemented in .23.\u003C/p\u003E\u003Cp\u003ESo, my personal opinion is that 5m is too big. Smaller probe size tanks, great! Larger heavy lift tanks and engines, great! Overzealously large tanks and engines, too much.\u003C/p\u003E\u003Cp\u003EShare your opinions below.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-10-14T23:13:20Z","Content":"\n\u003Cp\u003EI\u0027ll add my point of view on this matter, or rather link it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51243\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/51243\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbol Prime","CreatedById":57626,"CreatedDateTime":"2013-10-15T01:47:28Z","Content":"\n\u003Cp\u003EI personally agree that Squad should stay away from huge 5m parts. Definitely more small parts, I\u0027d really like to see more probe construction possibilities in the future (I\u0027ve always wanted .625m inline RTGs). As for 3.75 meter parts, they are fine, they will certainly add more launcher possibilities. \u003C/p\u003E\u003Cp\u003ESo in conclusion I\u0027m with you on the small-and-large-but-no-huge-parts idea.\u003C/p\u003E\u003Cp\u003EI think Squad should also add a size in between 1.25 and 2.5, perhaps 2 meters or 1.8. There should also be 3 meter parts. But it shouldn\u0027t get out of hand. A good selection of diameters is good, but too many parts and its overwhelming like kw or novapunch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-15T01:51:57Z\u0022 title=\u002210/15/2013 01:51  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 15, 2013\u003C/time\u003E by Kerbol Prime\u003C/strong\u003E\n\u003C/span\u003E\n"}]}