{"TopicId":48517,"ForumId":55,"TopicTitle":"Visibility of other Crafts (aka small glowing dots)","CreatedByName":"rob3110","CreatedById":87181,"CreatedDateTime":"2013-10-15T20:28:19Z","PageNum":1,"Articles":[{"CreatedByName":"rob3110","CreatedById":87181,"CreatedDateTime":"2013-10-15T20:28:19Z","Content":"\n\u003Cp\u003EI think it would be nice if other crafts would be visible even if they are more then 2km away. The crafts out of render-distance could be replaced by small glowing white dots (at least when the craft is iluminated by the light of kerbol), and those dots would fade away with increasing distances. This would imitate the reflection of sunlight. \u003C/p\u003E\u003Cp\u003EI imagine it like seeing a satellite or the iss from earth, it looks like a fast moving, bright star. maybe the closest planets could also be seen like this, a small red dot for duna, a small purple dot for eve and so on.\u003C/p\u003E\u003Cp\u003EFor reference, the free 3d-planetarium program celestia does this quite nicely!\u003C/p\u003E\u003Cp\u003EMaybe the yellow indicator for a non-selected craft nearby would only be visible for closer distances, like 10km or so, or could be turned on/off in the settings-menu. A selected target on the other hand should still be indicated, of course!\u003C/p\u003E\u003Cp\u003Ewhat do you guys think?\u003C/p\u003E\u003Cp\u003Egreetings from germany\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-10-15T20:42:25Z","Content":"\n\u003Cp\u003EThis is a very popular suggestion, but it\u0027s nice to see it come up again!\u003C/p\u003E\u003Cp\u003EUnfortunately, there are too many different ways to describe this idea, so it\u0027s almost impossible to spot earlier versions.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"Rockhem","CreatedById":57141,"CreatedDateTime":"2013-10-15T21:00:12Z","Content":"\n\u003Cp\u003EI would like this addition,showing your 1km wide station wizzing by would be amazing. For people with lower-power computers it should also be able to be toggled.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-15T21:04:19Z\u0022 title=\u002210/15/2013 09:04  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 15, 2013\u003C/time\u003E by Rockhem\u003C/strong\u003E\n\u003Cbr\u003EWrong word\n\u003C/span\u003E\n"},{"CreatedByName":"rebelcommando1807","CreatedById":5892,"CreatedDateTime":"2013-10-16T00:28:59Z","Content":"\n\u003Cp\u003EPerhaps even taking into account the amount of light the vehicle itself is giving off? So that, if you\u0027re crazy enough, you could make a ring (or half-ring) of really freaking bright satellites in KSO over the dark side.\u003C/p\u003E\n"},{"CreatedByName":"BenHR","CreatedById":58402,"CreatedDateTime":"2013-10-16T00:40:28Z","Content":"\n\u003Cp\u003EHow are the planets currently rendered? Do they ever go out of draw distance? Or are they just usually smaller than a pixel?\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-16T02:23:00Z","Content":"\n\u003Cp\u003ENot only crafts. Debris and planetary bodies. Everything should be glowing dots. Angular diameter drops down faster than luminosity.\u003C/p\u003E\u003Cp\u003EI\u0027d really prefer a pitch dark sky without the hideous galaxy and stars, and just glowing dots in the distance. Just like in real world. Stars are invisible to astronauts most of the time.\u003C/p\u003E\u003Cp\u003EIf debris can be shown as markers, it can be shown as glowing \u0022points\u0022, too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T02:28:13Z\u0022 title=\u002210/16/2013 02:28  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AncientAstronaut","CreatedById":36093,"CreatedDateTime":"2013-10-16T02:25:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003ENot only crafts. Debris and planetary bodies. Everything should be glowing dots. Angular diameter drops down faster than luminosity.\u003Cp\u003EI\u0027d really prefer a pitch dark sky without the hideous galaxy and stars, and just glowing dots in the distance. Just like in real world.\u003C/p\u003E\u003Cp\u003EIf debris can be shown as markers, it can be shown as glowing \u0022points\u0022, too\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI completely agree. The current sky box is so ugly that it actually detracts from the entire game. Luckily we can use universe replacer but it slows down FPS when you use it...\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-16T02:30:35Z","Content":"\n\u003Cp\u003EHonestly, some times I can\u0027t see where something is because of the galaxy. For example if the system loses the target, I can\u0027t see it anymore.\u003C/p\u003E\u003Cp\u003ESome time ago I asked how to remove the skybox, but never got an answer. It should be fairly easy, but I don\u0027t want to mess with my installation.\u003C/p\u003E\n"},{"CreatedByName":"eyecikjou567","CreatedById":22618,"CreatedDateTime":"2013-10-16T15:21:38Z","Content":"\n\u003Cp\u003ECurrently planets and moons are rendered all the time. You can download a telescope mod and a good asas system like mech-jeb to see this.\u003C/p\u003E\u003Cp\u003EYou can see duna and eve by adjusting with the hand but anything farther out may just swish by.\u003C/p\u003E\u003Cp\u003EAlso there is a mod to change the skybox. (BTW I like it the way it is..., could be brighter)\u003C/p\u003E\u003Cp\u003EThat could be in the game.\u003C/p\u003E\u003Cp\u003EFor the glowing dots, I disagree. The light reflected of a craft is minimal. The ISS is only visible on dark nights. A half moon might just make it vanish and blur.\u003C/p\u003E\u003Cp\u003EBut maybe there could be a adjustable option?\u003C/p\u003E\u003Cp\u003E(Like: No Visual Assistance (Fly-by-eye), Position Assistance (the normal dots), Visual Assistance after 5km (the glowing dot), PA until 10km \u002B VA after 5km (both but with a distance without it), Automatic PA or VA (will use the better option))\u003C/p\u003E\n"},{"CreatedByName":"rob3110","CreatedById":87181,"CreatedDateTime":"2013-10-16T18:31:12Z","Content":"\n\u003Cp\u003EI live in one of the bigger cities in germany with a fair amount of light pollution and you can still easily spot satellites and the iss during starry nights. they appear as bright as the brightest stars, even with the full moon in the sky.\u003C/p\u003E\u003Cp\u003ESatellites and Stations reflect a fair amount of light. most satellites are wrapped in golden foil to reflect sunlight to prevent overheat, and they have large solar panels which also reflect light... of course they fade away when entering the shadow of the earth.\u003C/p\u003E\u003Cp\u003Evenus, mars and jupiter are even brighter, they are visible even at dusk and dawn when you can hardly see any stars, so imho it would be more realistic to be able to see crafts and planets als bright dots even if their actual size would be to small to see them directly.\u003C/p\u003E\u003Cp\u003Ethe amount of reflected light depends on the surface area and the albedo of an object, it would require a lot of change to the part-files to implement this and this could break (older) mods, but maybe this could be aproximated with the mass of the craft and a general average albedo, because most parts are white and light grey anyway. It doesn\u0027t need to be perfectly correct in ksp, it should just look nice. Of course an objects becomes less visible with bigger distance, so based on the mass of an obect the, general albedo and weather it is iluminated by kerbol or not the absolute magitude could be calculated, and based on its distance to the viewer the apparent magitude. the naked eye can see objects with a magitude of 6mag at clear nights, and as kerbin has no weather, cities and light pollution (at least right now) a clear night can be assumed. in cities objects with a magnitude of 4mag can be seen. i haven\u0027t found values for visibility in space, but I guess 6mag is a acceptable value. \u003C/p\u003E\u003Cp\u003ESo far there is no implementation of HDR in ksp, so a spacecraft would be visible even next to a planet or moon. When something like HDR gets implemented the magnitude of everything is needed anyway, so it would not create aditional problems or unrealistic behavior.\u003C/p\u003E\u003Cp\u003ELast but not least, I would really like to see my spacestations, ships and debris while approaching them from further distances and see my gps-satellites flying overhead my munar base, and not only a yellow crosshair as its representation...\u003C/p\u003E\u003Cp\u003Eedit: some values of magnitudes of objects in space viewed from earth to show that spacecraft are rather bright; lower means brighter:\u003C/p\u003E\u003Cp\u003EThe iss has a magnitude of -5.9mag in the nightsky, which is even brighter than the maximum magnitude of venus (\u0022the morningstar\u0022, -4.89mag). Satellite flares (light reflecting in the solar panels) reach magnitudes up to -9.5mag, while the brightest star has a magnitude of -3.99. Full moon has a magnitude of -12.92mag, the sun -26.74mag. This is not a linear scale, but yet, satellites and the iss can be a lot brighter than the brightest stars in the nightsky. So it is wrong to say crafts would be rather faint!\u003C/p\u003E\u003Cp\u003ENevertheless, I\u0027m talking more about the visibility of objects in space, not from kerbin.\u003C/p\u003E\u003Cp\u003Eedit 2: typo\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-16T19:04:44Z\u0022 title=\u002210/16/2013 07:04  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 16, 2013\u003C/time\u003E by rob3110\u003C/strong\u003E\n\u003C/span\u003E\n"}]}