{"TopicId":48610,"ForumId":55,"TopicTitle":"What I would love to see this career mode become at 1.0","CreatedByName":"justchad","CreatedById":73717,"CreatedDateTime":"2013-10-16T12:59:19Z","PageNum":1,"Articles":[{"CreatedByName":"justchad","CreatedById":73717,"CreatedDateTime":"2013-10-16T12:59:19Z","Content":"\n\u003Cp\u003EYou start out with a kerbal and (maybe) a telescope.\u003C/p\u003E\u003Cp\u003EAnd science begins...\u003C/p\u003E\u003Cp\u003EStart out with small toy solid fuel rockets (that later become decoupler rockets?) and a very basic probe, add parachutes for increased hang time. That earn you more science points and maybe even something like fame that nets you grants or donations from the public/government, allowing for better telescopes and rockets. You can only see as far as your tools allow, so, for example, you may not know what the gravity is on mun. So you will have to decide whether to chance a trip there when you get upgraded enough or spend the money to launch a probe. Mission failures may or may not cost you fame depending whether you send manned or unmanned crafts or other deciding factors (maybe you spend some money to hype the project to get more grants or even scientists to join your team. The more you explore the more you see. Send you a \u0022Hubble\u0022 and you see more of your solar system/universe. \u003C/p\u003E\u003Cp\u003EWell I think you all get the idea. I bet this all has been already thought of, but hopefully there might be a nugget in there that can help.\u003C/p\u003E\u003Cp\u003EThanks, Chad\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-10-16T16:00:04Z","Content":"\n\u003Cp\u003EKerbal \u0022\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Espace program\u003C/span\u003E\u0022\u003C/p\u003E\u003Cp\u003EThis is way to far back....\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-10-16T18:21:38Z","Content":"\n\u003Cp\u003EI\u0027m in love with the core idea, starting with one engineer (you) building small rockets and building up your tycoon-style organization from nothing to the space center we have now. I don\u0027t think it will be implemented exactly this way since it wouldn\u0027t really add much to the game. Just an even more limited early game and a longer time before a new player can see space, where the meat of the game is. Some might say it stretches their idea of a realistic space program (not my opinion, but a valid one).\u003C/p\u003E\u003Cp\u003EDiscovery of celestial objects is (I believe) confirmed for a future update, and I think upgrading telescope technology as you go in Career would be a logical progression. Requiring some interesting tasks or at least a science point cost before you can launch for the farther reaches of space. Basic telescopes, observatories, radio-telescopes, geographically wide telescope arrays, and orbital telescopes would be fun to see/build/deploy in game.\u003C/p\u003E\n"}]}