{"TopicId":49260,"ForumId":55,"TopicTitle":"Subsurface exploration and submersibles","CreatedByName":"Fixr","CreatedById":60356,"CreatedDateTime":"2013-10-18T18:38:50Z","PageNum":1,"Articles":[{"CreatedByName":"Fixr","CreatedById":60356,"CreatedDateTime":"2013-10-18T18:38:50Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EFirst things first..\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI think that we need oceans and water in general to be more than just a good (and incredibly noisy) spot to land. Imagine the potential probes and spacecraft would have exploring the depths of the ocean... Lots of room for science!\u003C/p\u003E\u003Cp\u003EHere is a brief concept I came up with.\u003C/p\u003E\u003Cp\u003EKsp is home to few oceans, currently. I\u0027m sure some planets like vall and eeloo may have subsurface oceans, but as awesome as it sounds, i\u0027m not mad enough to assume the developers intend on adding drills, or other means to reach them.\u003C/p\u003E\u003Cp\u003ESo lets focus on the clear oceans free of icy surfaces.\u003C/p\u003E\u003Cp\u003EKerbin looks to have a good bit of ocean on it, and i\u0027m sure folks who love exploring home would love to check out its oceans.\u003C/p\u003E\u003Cp\u003EWhats far more interesting to me though is Laythe.\u003C/p\u003E\u003Cp\u003ELaythe is a bit of an \u0022endgame\u0022 spot in ksp currently. its by far the most appealing body in the Kerbol system, due to its (possibly) survivable atmosphere and oceans. Its also notoriously hard to reach.\u003C/p\u003E\u003Cp\u003ESo, you\u0027ve landed. Now what? The islands are dull and grey, the sand is dull and grey, even the oceans have a grey tint to them. what was so beautiful from the telescope back home is in fact, incredibly boring. (besides the beauty of Jool in the sky, which I wont lie, is awesome)\u003C/p\u003E\u003Cp\u003EI think it only makes sense to brighten up the oceans a bit, right?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EFirst and foremost, command modules!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ethis would include manned and unmanned modules, unmanned modules resembling a AUV or \u0022hydrobot\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/AUV\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/AUV\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWith manned modules being more submarine-like, perhaps with one to three crew modules.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EPropulsion!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAs with most parts, they increase with size and power, but of course require more charge to power them.\u003C/p\u003E\u003Cp\u003Ethis is pretty straightforward, simple propellers would do the job, right? They could work like rocket engines, with varying levels of thrust.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EAnchors!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhen you want so settle down for a bit, or maybe even cobble together an underwater base, use an anchor to keep it all from floating away.\u003C/p\u003E\u003Cp\u003EAgain, small, medium and large, with varying length from a break from coastal meandering, to hunkering down from heavy duty subsurface exploration.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ENo pressure, but..\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis wouldn\u0027t be fun if the whole thing didn\u0027t explode at the last minute. So, you need to be careful of pressure when you get too far down. I think only the huge clunky parts would be able to survive the deepest regions of the ocean. It could alert you when you are in danger of being crushed. If a Kerbal tried to EVA at the bottom of the ocean, then sorry pal, instant death.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EFor Science! \u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHow does the goo behave under the sea? Can a Kerbal plant a flag underwater? What temperature is the ocean floor? is it just me, or does this rock sort of look like a fish?\u003C/p\u003E\u003Cp\u003EWho knows what the ocean holds?\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-10-18T18:59:50Z","Content":"\n\u003Cp\u003EUnfortunately, oceanic exploration is on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863\u0022 rel=\u0022external nofollow\u0022\u003Ewhat not to suggest list\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAs such, thread locked. Have a nice day.\u003C/p\u003E\n"}]}