{"TopicId":49265,"ForumId":34,"TopicTitle":"VetTech - Lightweight Tech Tree reordering for experienced players (1.4)","CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-18T19:18:22Z","PageNum":1,"Articles":[{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-18T19:18:22Z","Content":"\n\u003Cp\u003EThe vanilla tech tree was made as a teaching aid, which is laudable, but it means it deliberately backloads essential components to avoid presenting the \u003Cem\u003Econcepts\u003C/em\u003E they depend upon. This is a problem for the experienced player, who would like to apply the full repertoire of concepts to address science missions - \u003Cstrong\u003Enot only after the need for science missions is almost exhausted\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003EThe primary aim of this mod is to bring forward the essential concepts and capabilities, such as wings, jets, rover wheels, and docking, while holding back \u003Cem\u003Erefinements\u003C/em\u003E and quantitative improvements in these areas. There are several other mods of this type. To put this one in context of the others, it takes the real historical development path into account more than stock, but is still \u003Cstrong\u003Eprimarily gameplay-motivated\u003C/strong\u003E. It keeps the stock arrangements of nodes to maintain forward compatibility.\u003C/p\u003E\u003Cp\u003EThe Stayputnik is available from the start, but you\u0027ll still need crew and EVA reports to advance to science parts at a tolerable pace. Probe cores in more convenient form factors remain a fairly late development.\u003C/p\u003E\u003Cp\u003EScience parts have been reordered to put the basic pre-.22 sensors earlier, and give some science-generation opportunities in the upper (rocket/aerodynamics) half of the tech tree.\u003C/p\u003E\u003Cp\u003EHeavy and Heavier Rocketry have been rearranged to fulfill the expectation that 2m 1st stages will generally precede 2m orbital stages.\u003C/p\u003E\u003Cp\u003EA new save is ideal, but not required. Parts that have moved down the tech tree to a node you\u0027ve already opened can be clicked in the R\u0026amp;D building to enable. Parts that have moved up to a node you don\u0027t have will prevent a new launch, but not prevent controlling a vessel that already exists.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDownload \u003C/strong\u003E\u003Ca href=\u0022https://www.dropbox.com/s/4pnchiyrrn2l98a/VetTech1-4-2.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ehttps://www.dropbox.com/s/4pnchiyrrn2l98a/VetTech1-4-2.zip\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReleased under Creative Commons Attribution-NonCommercial-ShareAlike 3.0 United States\u003C/p\u003E\u003Cp\u003EChangelog:\u003C/p\u003E\u003Cp\u003E1.1\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EAdded configs for KW Rocketry, KSPX, and Kerbal Engineer\u003Cbr\u003EProbes other than Stayputnik have kOS if kOS is installed\u003Cbr\u003EAdded the decoupler that was left out from Deadly Reentry\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E1.2\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFixed placement of small control surface and KW 1.25m nosecone\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E1.3\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFixed placement of LV-909\u003Cbr\u003EScience jr. now has 0% radio efficiency so there will still be return missions in the late game\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E1.4\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eadded configurations for B9, KAS, Infernal Robotics, IonCross Crew Support, and a subset of NovaPunch (liquid engines only)\u003Cbr\u003Emoved the basic ladder down to Start\u003Cbr\u003Efixed some typos in node names\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E1.4.2\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFixed problem of missing mod parts\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T18:39:37Z\u0022 title=\u002210/27/2013 06:39  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by rhoark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2013-10-18T19:26:58Z","Content":"\n\u003Cp\u003ENice idea, I like it. I may uninstall Novapunch and try this out.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-18T20:06:27Z","Content":"\n\u003Cp\u003EUninstalling NovaPunch shouldn\u0027t be necessary. From what I\u0027ve seen, it adds its parts in reasonable locations. The extension I\u0027m planning is for ensuring consistency and avoiding redundancy when using KSPX, NovaPunch, and KW all together. (KSPX has the best looking escape tower, NovaPunch the best looking Mainsail equivalent, KW has the best looking 1.25m fuel tanks, etc.)\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2013-10-19T00:49:39Z","Content":"\n\u003Cp\u003ENP also has a 2.5m NERVA (Nuclear) rocket, which is excellent for making extremely large vessels. \u003C/p\u003E\u003Cp\u003EBut the reason I\u0027d want to uninstall is to try out your flavor of stock tree reordering. Certainly when your reordering of NP/KW, etc comes out I\u0027ll reinstall NP again. Maybe even KW if I can keep it all under the 3.5gig limit.\u003C/p\u003E\n"},{"CreatedByName":"jpkerman","CreatedById":14965,"CreatedDateTime":"2013-10-19T02:59:43Z","Content":"\n\u003Cp\u003EHow fast can you advance techs? I think the current tech tree lets advancements too easy. I feel that at least 5-6 launches with the starting parts should be needed since (for novice players) it is a learning experience and for veteran players it makes them use the basic parts for a while since they become so quickly forgotten once more advanced parts are available.\u003C/p\u003E\n"},{"CreatedByName":"Synthesis","CreatedById":26557,"CreatedDateTime":"2013-10-19T03:03:14Z","Content":"\n\u003Cp\u003EAn excellent idea, I commend you for it! My first thought after clicking the new building was, \u0022Why the heck can I send a manned module up, but not an unmanned probe? Are we using abacuses?\u0022 I\u0027m definitely giving this a try, hopefully it\u0027ll mesh well with K\u0026amp;W parts (I\u0027ve come to think of K\u0026amp;W as a more modern, efficient take on existing Squad parts shaped by experience, but we\u0027ll see).\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-19T03:31:04Z","Content":"\n\u003Cp\u003E1.1\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EAdded configs for KW Rocketry, KSPX, and Kerbal Engineer\u003Cbr\u003EProbes other than Stayputnik have kOS if kOS is installed\u003Cbr\u003EAdded the decoupler that was left out from Deadly Reentry\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGoing through the parts one by one, I decided I\u0027m not going to do a cfg for NovaPunch after all, for two reasons:\u003C/p\u003E\u003Cp\u003EIts node assignments are generally good\u003C/p\u003E\u003Cp\u003EI only really like the engines, so it would be easier to just cut it down to the engine folder than copy down every part id of what I don\u0027t want.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-19T13:45:53Z","Content":"\n\u003Cp\u003EI wanted to reduce the transmit efficiency of surface samples to 0%, to close the loophole that physically returning anything becomes obsolete with solar panels. I can\u0027t get it to work, though, so you\u0027re on your honor.\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2013-10-19T14:10:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rhoark\u0022 data-cite=\u0022rhoark\u0022\u003E\u003Cdiv\u003EI wanted to reduce the transmit efficiency of surface samples to 0%, to close the loophole that physically returning anything becomes obsolete with solar panels. I can\u0027t get it to work, though, so you\u0027re on your honor.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure I agree. It\u0027s one thing for a rover/human to get a surface sample and examine it on a faraway rock.\u003C/p\u003E\u003Cp\u003EIt\u0027s quite another thing for that sample to be brought back to Kerbin to unleash the full potential of science against it. We can learn far more from extraterrestrial rocks on Earth than we can in their natural habitats. For example, one company just made a special fall beer that\u0027s brewed with moon dust. No joke! While it may not seem like the biggest scientific revolution, it\u0027s certainly one application that is only possible with the physical sample. \u003C/p\u003E\u003Cp\u003EConsider reducing the transmission efficiency to a lower percentage, like 40 or 20.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-19T14:45:55Z","Content":"\n\u003Cp\u003EI think you misunderstand. I want there to be strong incentive to physically return samples. The problem is, once you have solar panels you can repeatedly pick up rocks and transmit data, removing any incentive to return the samples to Kerbin. So for now, sample return will just have to be for personal satisfaction.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-19T14:48:29Z","Content":"\n\u003Cp\u003E1.2\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFixed placement of small control surface and KW 1.25m nosecone\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2013-10-19T14:59:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rhoark\u0022 data-cite=\u0022rhoark\u0022\u003E\u003Cdiv\u003EI think you misunderstand. I want there to be strong incentive to physically return samples. The problem is, once you have solar panels you can repeatedly pick up rocks and transmit data, removing any incentive to return the samples to Kerbin. So for now, sample return will just have to be for personal satisfaction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh, I misread your original post. That makes more sense.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-19T15:33:23Z","Content":"\n\u003Cp\u003ESorry for the update spam - I think I\u0027m done now.\u003C/p\u003E\u003Cp\u003E1.3\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFixed placement of LV-909\u003Cbr\u003EScience jr. now has 0% radio efficiency so there will still be return missions in the late game\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrazyCanadian","CreatedById":59404,"CreatedDateTime":"2013-10-19T22:44:46Z","Content":"\n\u003Cp\u003Eso far I like it.\u003C/p\u003E\n"},{"CreatedByName":"Synthesis","CreatedById":26557,"CreatedDateTime":"2013-10-20T04:19:43Z","Content":"\n\u003Cp\u003ECorrect me if I\u0027m wrong, but if we\u0027re using mods like, for example, KAS and Service Module Adapter, we won\u0027t be able to get them working with this, right? Only Novapunch/K\u0026amp;W. Can we take a crack at them with a tree editor? Sorry for the questions, I\u0027m still trying to wrap my head around the tree.\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-10-20T04:29:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Synthesis\u0022 data-cite=\u0022Synthesis\u0022\u003E\u003Cdiv\u003ECorrect me if I\u0027m wrong, but if we\u0027re using mods like, for example, KAS and Service Module Adapter, we won\u0027t be able to get them working with this, right? Only Novapunch/K\u0026amp;W. Can we take a crack at them with a tree editor? Sorry for the questions, I\u0027m still trying to wrap my head around the tree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E add them to a existing node is all u have to do. if u look at any stock part u will be able to see the simple line to add to the .cfg\u003C/p\u003E\u003Cp\u003Efor example i added all my kethane and kas to when u get base building parts.\u003C/p\u003E\n"},{"CreatedByName":"Synthesis","CreatedById":26557,"CreatedDateTime":"2013-10-20T04:56:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sidfu\u0022 data-cite=\u0022sidfu\u0022\u003E\u003Cdiv\u003Eadd them to a existing node is all u have to do. if u look at any stock part u will be able to see the simple line to add to the .cfg\u003Cp\u003Efor example i added all my kethane and kas to when u get base building parts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, I\u0027m going to try this, once I actually figure out the mod\u0027s new tech tree--I\u0027m comfortable with CFG editing (for some reason, modulemanager always seems to crash for me).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T05:12:04Z\u0022 title=\u002210/20/2013 05:12  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by Synthesis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-10-20T06:15:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Synthesis\u0022 data-cite=\u0022Synthesis\u0022\u003E\u003Cdiv\u003EThank you, I\u0027m going to try this, once I actually figure out the mod\u0027s new tech tree--I\u0027m comfortable with CFG editing (for some reason, modulemanager always seems to crash for me).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emodmanager has issues at times if there flaws in the cfg like a bad space in a word. also like any .dll if there to much for it to do it can crash. since this just modifies the tree but keeps all stock parts on it go to stock parts and also check out he cfg he is using to best judge where u want the parts if u spreading them out. also fyi modmanager hates database refreshes from ingame. if u refresh ingame modmanager stops working also u lose any loaded things from it. a good example is if u refresh ingame ironcross life support stops working and is removed till game restart.\u003C/p\u003E\u003Cp\u003Ebest thing to do is say u adding a solar pannel then loock at stock and compare it with what u putting in and decide which node from those.\u003C/p\u003E\n"},{"CreatedByName":"Hontik1969","CreatedById":89375,"CreatedDateTime":"2013-10-20T07:34:01Z","Content":"\n\u003Cp\u003Enot bad not bad at all i am looking forward to downloading\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-20T14:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Synthesis\u0022 data-cite=\u0022Synthesis\u0022\u003E\u003Cdiv\u003ECorrect me if I\u0027m wrong, but if we\u0027re using mods like, for example, KAS and Service Module Adapter, we won\u0027t be able to get them working with this, right? Only Novapunch/K\u0026amp;W. Can we take a crack at them with a tree editor? Sorry for the questions, I\u0027m still trying to wrap my head around the tree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny mod I haven\u0027t specifically addressed isn\u0027t affected by VetTech at all. So if it puts its parts in the tree, they will be there, and if it doesn\u0027t, they won\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-10-20T16:16:02Z","Content":"\n\u003Cp\u003EI can\u0027t seem to get this to work at all. I have the modulemanager dll in the GameData folder, the VetTech folder also in GameData. I only wanted the Deadly Reentry heatshields, so I deleted every cfg except the deadlytech.cfg. Nothing shows under any of the nodes as far as the heatshield parts go. I started a new career game as well, and unlocked the survival node. Still no heatshields. Am I doing something wrong? The Deadly Reentry parts do show under sandbox mode.\u003C/p\u003E\n"},{"CreatedByName":"Photonically","CreatedById":60531,"CreatedDateTime":"2013-10-20T20:56:46Z","Content":"\n\u003Cp\u003EI\u0027m having the same problem with heat shields not showing up.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-21T01:44:15Z","Content":"\n\u003Cp\u003EDefinitely works for me, so I don\u0027t know what guidance to provide.\u003C/p\u003E\n"},{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-10-21T03:32:35Z","Content":"\n\u003Cp\u003EAdding the TechRequired line manually into the part.cfg seems to work. I honestly have no idea why it wouldn\u0027t work, I\u0027ve gone over the deadlytech.cfg several times now and all the part names look good, everything SHOULD work fine. Nothing I have changed or tried has made it work except adding the techrequired info straight into the part.cfg for the heatshields. I don\u0027t have any other mods loaded for career mode so I can\u0027t test any of the other .cfg except the stocktech.cfg, which works exactly as expected.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-21T03:39:11Z","Content":"\n\u003Cp\u003EAh. Don\u0027t the part names have weird characters in them, like periods or something?\u003C/p\u003E\n"}]}