{"TopicId":49558,"ForumId":16,"TopicTitle":"How low can Jeb hold on?","CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T00:33:55Z","PageNum":1,"Articles":[{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T00:33:55Z","Content":"\n\u003Cp\u003EJeb ran out for an EVA report at 35km during re-entry. His body has never been found. The only reason we even know he left is that the capsule survived landing at 120 m/s, and he had just taken down an EVA report about conditions at 45 km (the entire science payload was destroyed).\u003C/p\u003E\u003Cp\u003EHow low can I reasonably expect Bill to safely take an EVA report on an unpowered reentry from orbit?\u003C/p\u003E\n"},{"CreatedByName":"toomuchbrew","CreatedById":57346,"CreatedDateTime":"2013-10-20T01:52:16Z","Content":"\n\u003Cp\u003EIs this a serious question?\u003C/p\u003E\n"},{"CreatedByName":"AletzN1","CreatedById":65154,"CreatedDateTime":"2013-10-20T01:57:33Z","Content":"\n\u003Cp\u003EI think it is a legitamate question.\u003C/p\u003E\u003Cp\u003Ebut back to topic, I think it would be when you start to slow down, \u003C/p\u003E\u003Cp\u003EAKA when the difference in drag between the capsule an the kerbal starts to matter.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-20T02:08:18Z","Content":"\n\u003Cp\u003EThe height doesn\u0027t matter. It\u0027s the speed of the rushing air that throws him off, obviously.\u003C/p\u003E\n"},{"CreatedByName":"Steve-S","CreatedById":74649,"CreatedDateTime":"2013-10-20T04:14:12Z","Content":"\n\u003Cp\u003EIt\u0027s his inability to hold on under the G load of deceleration from the atmospheric effects on the ship. I tried to take an EVA reading on re-entry and the Kerbal landed long before the ship did. Apparently they are rather aerodynamically shaped. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T04:14:49Z\u0022 title=\u002210/20/2013 04:14  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by Steve-S\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T05:01:12Z","Content":"\n\u003Cp\u003EOf course this is serious!\u003C/p\u003E\u003Cp\u003EAt 45 km on Kerbin, I can always sneak out, get a EVA report, and sneak back in. At 35 km, the kerbal always flies off during re-entry. I\u0027ve gotten an EVA report by skipping out at the top of the flight of my first rocket (an SRB with a capsule on top); that\u0027s easy to screw up.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-20T05:10:14Z","Content":"\n\u003Cp\u003EAs others have mentioned, you might want to consider that at those altitudes for a normal reentry from orbit, your atmospheric drag is going to be a very significant force acting on the vessel as a whole. The capsule and your kerbonaut probably have different aerodynamic properties resulting in different terminal velocities, even given KSP\u0027s wonky atmospheric model.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T05:42:21Z","Content":"\n\u003Cp\u003EOK, so what\u0027s the maximum force that a kerbal can exert to stay on the ladder of a capsule, and what is a kerbal\u0027s coefficient of drag? I can work out the remainder. KSP has no turbulence, so it\u0027s all simple.\u003C/p\u003E\u003Cp\u003EI was expecting others to have tried this trick and have a better ballpark than \u0022somewhere above 35 km and below 45 km\u0022 for where you can easily step out of the capsule and get back in.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-20T07:58:10Z","Content":"\n\u003Cp\u003EIf the kerbal has something to stand on like putting an small pod on a 2.5 meter tank they can take pretty much any g like Eve aerobraking and parachute release. parachute release tend to kick kerbals out of seats. On Eve they might survive this. \u003C/p\u003E\u003Cp\u003ESo just putting an small strut or two below the stairs and you are safe.\u003C/p\u003E\n"},{"CreatedByName":"GavinZac","CreatedById":68719,"CreatedDateTime":"2013-10-20T13:44:31Z","Content":"\n\u003Cp\u003EUnlock the command seat which appears to have an invisible seatbelt which prevents unaided Kerbal reentry. Hmm... I\u0027m actually not sure if the EVA report or the Crew report comes from the seat. Well, another experiment to run!\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-10-20T15:50:06Z","Content":"\n\u003Cp\u003ETry to go slower. Use retrorockets to slow down, or be creative and make some sort of helicopter.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T15:52:35Z\u0022 title=\u002210/20/2013 03:52  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by Psycix\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T16:03:23Z","Content":"\n\u003Cp\u003ESure I could hover, but that\u0027s not really the goal of the exercise. I want to be reentering freely from some orbit, say 100 km circular.\u003C/p\u003E\u003Cp\u003EI don\u0027t see how a platform should help. As noted, Kerbals have less drag than the spacecraft. But maybe I\u0027ll try it.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-10-20T16:34:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003ESure I could hover, but that\u0027s not really the goal of the exercise. I want to be reentering freely from some orbit, say 100 km circular.\u003Cp\u003EI don\u0027t see how a platform should help. As noted, Kerbals have less drag than the spacecraft. But maybe I\u0027ll try it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOther than the command seat I don\u0027t see how your gonna do it. At 35 Km your hitting the point that the atmosphere starts to become significantly dense. There\u0027s no way a Kerbal is going to be able to hold on at that height without some form of engine to slow yourself down. Realistically a number of the parts of our ships wouldn\u0027t even survive a typical re-entry so I don\u0027t see how a Kerbal on a ladder stands a chance. We\u0027re lucky Jeb hasn\u0027t been cooked like a Christmas turkey using a command seat.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-20T16:46:40Z","Content":"\n\u003Cp\u003EI\u0027m not stuck on sticking kerbals heads out at 35km. I\u0027m interested in knowing how low you can go.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-10-21T09:51:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI don\u0027t see how a platform should help. As noted, Kerbals have less drag than the spacecraft. But maybe I\u0027ll try it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you put a decoupler or a large fuel tank above the capsule, the Kerbal will collide with it and usually stay on the ladder in my experience.\u003C/p\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2013-10-21T11:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EI\u0027m not stuck on sticking kerbals heads out at 35km. I\u0027m interested in knowing how low you can go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like you\u0027ll have to be the pioneer here. Maybe do a quicksave, tell Jeb to stand outside during re-entry and check at which altitude he falls off. Then quickload and get him inside just before then. Or, if save/load doesn\u0027t suit you, use another (expendable) kerbal for the test run.\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2013-10-21T12:06:37Z","Content":"\n\u003Cp\u003EWhy not just test it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T12:08:38Z\u0022 title=\u002210/21/2013 12:08  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by Person012345\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"toomuchbrew","CreatedById":57346,"CreatedDateTime":"2013-10-21T13:51:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EOf course this is serious!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t mean to be insulting, but why would you try to EVA during re-entry? \u003C/p\u003E\u003Cp\u003EIf Squad made the EVA report viable during re-entry, shame on them. I know we are talking a game, based on science, but stepping outside of your protective capsule during a re-entry is pretty foolish.\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2013-10-21T14:00:19Z","Content":"\n\u003Cp\u003EI think the upper atmosphere EVA report happens from 20km to 50km, the upper limits of which is not affected by air speed, so an EVA report is definitely safe at the upper limit. As for how low, I think Jeb will still fall off a \u0027ladder\u0027 if his pod is falling at terminal velocity with a parachute fully open...\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-21T15:04:23Z","Content":"\n\u003Cp\u003Etavert may win this thread; I\u0027ll test it tonight!\u003C/p\u003E\u003Cp\u003EAs to why: Why do anything in KSP? Answer: Because it\u0027s there!\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-10-21T15:36:17Z","Content":"\n\u003Cp\u003EI think the easiest way is to simply launch a rocket straight up to a 50km apo.\u003C/p\u003E\u003Cp\u003EAt about 40km up when the craft is slowing down and about to fall back, hop in and out and spam some reports.\u003C/p\u003E\n"},{"CreatedByName":"FOARP","CreatedById":78629,"CreatedDateTime":"2013-12-28T16:39:57Z","Content":"\n\u003Cp\u003EI\u0027m interested to know the answer to this one - I managed to mess up a Minimus expedition and leave the three pilots stranded there. I\u0027ve sent a three-seater with a single pilot to pick them up, and I\u0027m wondering if I can\u0027t get the extra Kerbal just to hold on the outside ladder during re-entry.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2013-12-28T16:47:16Z","Content":"\n\u003Cp\u003EJust strap a probe core to it and send it without any pilot...\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-28T19:39:49Z","Content":"\n\u003Cp\u003EThe problem with holding the ladder all the way back from Minmus isn\u0027t the atmosphere so much as the fact that you can\u0027t warp faster than 4x.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-28T20:34:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toomuchbrew\u0022 data-cite=\u0022toomuchbrew\u0022\u003E\u003Cdiv\u003EI don\u0027t mean to be insulting, but why would you try to EVA during re-entry? \u003Cp\u003EIf Squad made the EVA report viable during re-entry, shame on them. I know we are talking a game, based on science, but stepping outside of your protective capsule during a re-entry is pretty foolish.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbals have no concept of \u0027foolish\u0027, remember.\u003C/p\u003E\n"}]}