{"TopicId":49734,"ForumId":44,"TopicTitle":"What language do you dream in in you are born deaf","CreatedByName":"Sarge82nd","CreatedById":58306,"CreatedDateTime":"2013-10-20T21:10:37Z","PageNum":1,"Articles":[{"CreatedByName":"Sarge82nd","CreatedById":58306,"CreatedDateTime":"2013-10-20T21:10:37Z","Content":"\n\u003Cp\u003EThe title is enough\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-20T21:22:25Z","Content":"\n\u003Cp\u003Esign language of course.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-10-20T21:53:23Z","Content":"\n\u003Cp\u003EI don\u0027t think you have to dream in any language at all.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-10-20T22:12:27Z","Content":"\n\u003Cp\u003EProbably whatever language you learned. Being deaf only prevents you from hearing, not from communicating through language - sign language or written, are both in, for example, english.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-10-21T00:20:45Z","Content":"\n\u003Cp\u003EThis is like asking what a Blind person sees when they dream. The answer is they don\u0027t. You know your brain isn\u0027t powerful enough to create faces when you sleep so everyone in you dreams is someone you have seen. So if a deaf person dreamed they would\u0027t here anything, but they might as someone said dream in sign language.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-10-21T04:20:51Z","Content":"\n\u003Cp\u003EThe same way that you visualize the 4th dimension in your dreams.\u003C/p\u003E\u003Cp\u003EThe point is, the brain is highly flexible, and it isn\u0027t born knowing how to process languages or types of information it hasn\u0027t learned. Your brain works well for seeing 2d representations of 3d objects, hearing 1d representations of 3d points, smelling 0d representations of 3d points, etc.\u003C/p\u003E\u003Cp\u003EYour brain does not work well at all for doing things outside of its experience. If you aren\u0027t used to the idea of vibrations in the air being interpreted as abstract communication by organs that are alien to you, you certainly aren\u0027t going to make it up.\u003C/p\u003E\u003Cp\u003ELikewise, you probably aren\u0027t used to taking a jumble of voxel data and somehow interpreting it as a chronology or a 4-dimensional object. That idea seems completely nonsensical to your subconscious, and you would be very unlikely to just make it up and dream about it.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-21T09:16:08Z","Content":"\n\u003Cp\u003EFor most of deaf people spoken words and sounds in general are just impossible to hear correctly. The sounds are very dull and quiet, so the brain can\u0027t use that information for advanced communication. Small part of deaf people have absolutely no ability to hear at all (problems with neural connections, brain parts responsible for processing audible information, etc.).\u003C/p\u003E\u003Cp\u003EMost blind people differentiate at least light and darkness, but a lot of them simply have such huge problems with eye focusing system that everything is extremely out of focus so they see blobs and patches of colored light so you can\u0027t sneak up on them like they\u0027re, unfortunatelly, mocked in movies.\u003C/p\u003E\u003Cp\u003EWhat they see depends on the actual damage. If the damage is so severe (people born with no eyes, no retinas, poorly developed optical nerve or dedicated region in the brain), they don\u0027t have a clue what \u003Cem\u003Esight\u003C/em\u003E is. It might seem so scary for us, but if you never get to know something, you can\u0027t really miss it, can you?\u003C/p\u003E\u003Cp\u003EThe same goes for deaf people.\u003C/p\u003E\u003Cp\u003EIf they\u0027re completely deaf or blind, they don\u0027t have an audible language in their dreams and no images in their dreams, but there\u0027s always a possibility the brain of some of them produces random (we can\u0027t even imagine it) \u0022sounds\u0022 and \u0022sights\u0022 that disabled people just \u003Cem\u003Ecan\u0027t even name as such\u003C/em\u003E. They simply couldn\u0027t recognize that \u0022this is it\u0022.\u003C/p\u003E\u003Cp\u003EThis is a difficult subject for discussion because there are so many levels of disability and so many types of damage to sensory organs, neural connections and processing units in the brain. The latter is incredibly complex.\u003C/p\u003E\u003Cp\u003EThe complexity grows even bigger if we include the time when the damage occured (congenital, early childhood, early puberty, adulthood...).\u003C/p\u003E\u003Cp\u003EThe fact is that loss of sight or hearing in young childred represents an obstacle to proper general development so those kids have to be under special care to stimulate their brains. In the past, before health care we take for granted, it was normal for sensory deprived children to grow into mentally retarted individuals. The worst cases were kids without any such sensory input. They would either grow up in a basement, completely alone, or in lunatic asylums, tied to their beds. We can not imagine the pain they endured, with only human contact being occasional forced bathing and the notion that someone brings them food. Such horrors are stil present in today\u0027s world in rural parts of poorly developed countries. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T09:22:38Z\u0022 title=\u002210/21/2013 09:22  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"}]}