{"TopicId":49779,"ForumId":36,"TopicTitle":"Realism Overhaul","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-20T23:43:51Z","PageNum":9,"Articles":[{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-10-26T09:58:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EAt ground level it won\u0027t be, in space the difference is noticeable as the rocket it much smaller compared to the planet at the same heigth and those are, of course, your references in space. It is not like it is negligible, as a craft at 64% equates to a planet that is actually 156% of the craft scale. That is a huge difference!\u003Cp\u003EApparently they are not, NathanKell stated they are 64%.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ejebs yardstick says they are. is it lying?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-26T10:44:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EI agree that there should be some sort of automation for that rescaling, otherwise it\u0027ll be a day job for all of us to manually rescale all the parts in all mods (not to mention that a fair amount of them prohibit such distribution).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote, licenses are not a problem for this. Config files referencing the models and textures can be written independently of the mods containing them and even put into their own folders. MODEL calls can be used for that, AFAIK there\u0027s no mod with a special license provision against them. Not to mention we have Module Manager, while I\u0027m not terribly fond of it, it\u0027d probably be the best option for manual alteration of various mods. Again, no mod forbids writing MM configs for it.\u003C/p\u003E\u003Cp\u003EStill, an automatic rescaler would probably be the best option. I\u0027ve had bad experiences with rescaling parts that use MODEL calls, so KOSMOS for example could cause us a lot of grief. I\u0027ve had one of their parts \u0022come apart\u0022 when rescaled (basically, it seems that parts got rescaled, their positions did not), so a plugin would probably be a much less painful option.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-26T10:49:06Z\u0022 title=\u002210/26/2013 10:49  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 26, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-10-26T17:38:25Z","Content":"\n\u003Cp\u003ECan we see your development schedule? As in: What you will do next. Something like Frizzank did\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-26T18:09:34Z","Content":"\n\u003Cp\u003EWell, the next thing to do would be to iron out all the imperfections around Kerbin. There are still plenty. Once that\u0027s figured out, the mod would probably expand to other planets.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-10-26T18:37:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EWell, the next thing to do would be to iron out all the imperfections around Kerbin. There are still plenty. Once that\u0027s figured out, the mod would probably expand to other planets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost important issue right now is rocket instability on pad. Kerbin can look amazing but it\u0027s hard to even launch right now.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-26T18:46:21Z","Content":"\n\u003Cp\u003EI\u0027m currently working on a plugin to try and fix the instability on the pad and tighten up rockets as a whole; ultimate goal is that a purely vertical stack of diameter greater than 1.25m shouldn\u0027t \u003Cem\u003Eneed\u003C/em\u003E struts between the parts to not flex all over the place / engines shouldn\u0027t dance around under high thrust. Should be ready for a first release soon. Currently fixes parts sliding around but doesn\u0027t fix angular movement, which is really the big problem.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-26T18:48:48Z","Content":"\n\u003Cp\u003EFor rescaling...yeah. Batch would be good, but scaling is inconsistent. Some part makers use 1:1, some use 80%, some use 64%. And often while crewed craft are scaled down, uncrewed probes are left 1:1.\u003C/p\u003E\u003Cp\u003EI mean, heck, for Squad, the two capsules are roughly 64% (the Mk1 is more like 66%), but the probes are all over.\u003C/p\u003E\u003Cp\u003EProbably the best bet would be to write an offline script that would process a list of partnames and rescale values, and output corrected part CFGs. I mean, you could do it ingame too, I guess.\u003C/p\u003E\u003Cp\u003EOn another note: Just to see if everything\u0027s working right, Dragon01, do you want to try manually rescaling and matching data for the Soyuz? I\u0027ll handle Gemini. We can then see if they perform the way they should given correct stats. Or if the MFS stuff is confusing just get the sizes and dry weights right and I\u0027ll do engine/tank configs for you.\u003C/p\u003E\u003Cp\u003E(Those are the two LV/spacecraft configs that I know are complete simulations--are their other complete models with many real-world stats available to check?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-26T18:51:36Z","Content":"\n\u003Cp\u003Eferram, great! Another thing you might try at least as a temporary thing is to write your own launch clamp module that keeps parts rigid until it\u0027s disengaged, as a lot of the stability problem is the first few milliseconds on the pad. I mean, in flight things dance around some, but the first few ms are killer. And LaunchClamp makes things worse rather than better at the moment, must be something weird in the joint code.\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-26T18:58:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Eferram, great! Another thing you might try at least as a temporary thing is to write your own launch clamp module that keeps parts rigid until it\u0027s disengaged, as a lot of the stability problem is the first few milliseconds on the pad. I mean, in flight things dance around some, but the first few ms are killer. And LaunchClamp makes things worse rather than better at the moment, must be something weird in the joint code.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe purpose of clamps is exactly to allow simulation to settle down, if you disable physics before start, it will starts settling down during launch, and you don\u0027t want this to happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m off today to finalize alpha version of ECLSS mod - BobCat is waiting, and I just can\u0027t let \u003Cstrong\u003Ethat man\u003C/strong\u003E wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-26T19:01:42Z\u0022 title=\u002210/26/2013 07:01  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 26, 2013\u003C/time\u003E by asmi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-26T19:22:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003E(Those are the two LV/spacecraft configs that I know are complete simulations--are their other complete models with many real-world stats available to check?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, Proton is pretty well documented, but it\u0027s not a complete vehicle, meaning you need a payload. Also, if you use BobCat\u0027s fairings, you might have screwed-up aerodynamics, since they\u0027re much bulkier than the real deal. Ariane 5 from ESA pack with ATV would be another good choice. Space Shuttle (the CSS) is a heavy WIP, but we\u0027ve got \u003Cem\u003Etons \u003C/em\u003Eof tech data on it. I think I\u0027ll do the Soyuz TMA first, then we\u0027ll see. Oh, I don\u0027t like the Module Manager, so the configs will be drop-in replacements for the time being. With the amount of data being changed (i.e. pretty much everything), I think this makes sense.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-26T21:03:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@NathanKell: \u003C/strong\u003EIf you want a gauge of how things are going, consider this rocket:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gKXgryK.png\u0022 alt=\u0022gKXgryK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has two stages and just enough dV to put that tiny little Apollo-CSM-like vehicle in orbit.\u003C/p\u003E\u003Cp\u003EIt has two struts on it, total. \u003Cstrong\u003ETwo.\u003C/strong\u003E No unreasonable wobble in flight at all; engines don\u0027t slide around or anything funky like that. No other boosts to joint strength. The only reason there are any at all is because the 2nd stage engine to decoupler to fuel tank joint chain isn\u0027t stiff enough. I figure I\u0027ll add a some code to make sure that the parts connected to stack decouplers are strutted together, play with some numbers, and call it good.\u003C/p\u003E\u003Cp\u003EAs for the Launch Clamp issues... those are the nature of the beast; adding too many constraints can make things much, much worse because the clamp joints fight each other.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-26T21:28:23Z","Content":"\n\u003Cp\u003EOK, could somebody tell me what units KSP uses? I\u0027m assuming kN for thrust, T for mass and kW for electric charge. But I could be wrong.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-26T21:34:33Z","Content":"\n\u003Cp\u003EThrust is in kN. Mass is in metric ton / tonne. Electric charge is kind of arbitrary I think... try kJ or kW-h; keep in mind it has to be units of energy, not power.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-10-26T21:43:44Z","Content":"\n\u003Cp\u003ELooking good @ferram!\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-26T21:56:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EIt has two struts on it, total. \u003Cstrong\u003ETwo.\u003C/strong\u003E No unreasonable wobble in flight at all; engines don\u0027t slide around or anything funky like that. No other boosts to joint strength. The only reason there are any at all is because the 2nd stage engine to decoupler to fuel tank joint chain isn\u0027t stiff enough. I figure I\u0027ll add a some code to make sure that the parts connected to stack decouplers are strutted together, play with some numbers, and call it good.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow! \u0022I want it! I want it so bad it\u0027s driving me mad!\u0022 Ã‚Â© The Beetles\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-26T22:42:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EWow! \u0022I want it! I want it so bad it\u0027s driving me mad!\u0022 Ã‚Â© The Beetles\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQFmaximalT.\u003C/p\u003E\u003Cp\u003EDragon01, EC is, if you go by the RTG, kW-s. If you go by the lights, much less than a kW-s. I would suggest using maybe deka-watt-second? So 1Kw = 100EC/s.\u003C/p\u003E\u003Cp\u003EDoes anyone have a rough estimate on weight vs. charge for batteries over the last 50\u002B years? I know it\u0027s advanced by leaps and bounds, but I don\u0027t know \u003Cem\u003Enumbers\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003ESo far this graph is all I found: \u003Ca href=\u0022http://www.batterypoweronline.com/images/PDFs_articles_whitepaper_appros/ReddyBatteryFuture.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.batterypoweronline.com/images/PDFs_articles_whitepaper_appros/ReddyBatteryFuture.pdf\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-26T23:31:55Z","Content":"\n\u003Cp\u003EWell, I\u0027m gonna take kW-s and adjust the lights. I\u0027m trying to get Soyuz to work now. That thing\u0027s gonna be really hard to fly, it\u0027s main engine is terribly weak and carries very little fuel.\u003C/p\u003E\u003Cp\u003EAlso, MFT could use some way of making bipropellant RCS. It\u0027s a rather common solution, yet KSP doesn\u0027t allow that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-26T23:34:15Z\u0022 title=\u002210/26/2013 11:34  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 26, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Legwan","CreatedById":61076,"CreatedDateTime":"2013-10-27T00:01:15Z","Content":"\n\u003Cp\u003EOne suggestion regarding atmosphere height - would it be possible to increase the value even higher without scalling density at lower altitudes? \u003C/p\u003E\u003Cp\u003EBased on the neat source I\u0027ve found \u003Ca href=\u0022http://www.ips.gov.au/Category/Educational/Space%20Weather/Space%20Weather%20Effects/SatelliteOrbitalDecayCalculations.pdf\u0022 rel=\u0022external nofollow\u0022\u003EPDF\u003C/a\u003E (\u002B \u003Ca href=\u0022http://www.lizard-tail.com/isana/lab/orbital_decay/\u0022 rel=\u0022external nofollow\u0022\u003EImplemententation\u003C/a\u003E):\u003C/p\u003E\u003Cp\u003E\u0022In all but the heaviest satellites (those with a mass to area ratio well in excess of 100 kilogram per square metre), the actual lifetime from an altitude of less than 180 km is only a few hours.\u0022\u003C/p\u003E\u003Cp\u003EIn fact if one plays with the calculator even 180-200km results with rapid decay and the lowest orbit for the satellite was 215km (Sputnik 1 via Wikipedia).\u003C/p\u003E\u003Cp\u003EOf course it\u0027s more a matter of self control here if we want real life behavior (like not parking at 150km orbit for \u0026gt; 1 revolution). Nonetheless further increasing the atmosphere height is tempting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBTW I\u0027ve done some more research on orbital decay and it seems like a nice idea for a plugin - in short: all satellites in LKO need dV to maintain the orbit (amount depending on height), scan through all flights, deduct dV, if no left play with orbital parameters next time vessel becomes active, Ioncross does something familiar just with life support. I\u0027m not a programmer so feel free to steal the idea.\u003C/p\u003E\u003Cp\u003EFinally I\u0027d like to thank developers of this mod - You\u0027ve fulfilled my last wish towards this game. \u003C/p\u003E\u003Cp\u003EFelling like it should be a separate mode unlockable at some stage in career more (kind research on space telescope/planet detection \u002B placing big junk in orbit)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T00:02:18Z\u0022 title=\u002210/27/2013 12:02  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by Legwan\u003C/strong\u003E\n\u003Cbr\u003Egrammar bits\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-27T00:01:42Z","Content":"\n\u003Cp\u003EYeah, I was about to post that we should just do kW-s, otherwise the battery size is insane.\u003C/p\u003E\u003Cp\u003EWoking on Gemini right now.\u003C/p\u003E\u003Cp\u003EI\u0027ll see about RCS; the problem is the game seems to only allow one type of resource for RCS, and even changing that is hard (you have to set the resourceName *and* call SetResource() on the RCS module). I\u0027ll see if I can make my own module later maybe.\u003C/p\u003E\u003Cp\u003EMaybe I could make a hack plugin with a fake single resource that, every time it\u0027s used, replenishes it from the appropriate bipropellant resources?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-10-27T00:23:31Z","Content":"\n\u003Cp\u003EHeh. I just realized you ended up with a much easier task than me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Gemini is a simple 2-stage rocket with spacecraft on top, Soyuz has an intricate LES system (that I\u0027m also going to replicate), 3 stages and a rather complicated spacecraft. Right now, using MFT fuel values made the thing somewhat overweight. That probably means those engines run fuel-rich, but I haven\u0027t been able to find a proper ratio for anything but the Soyuz Service Module engines (which seems to run \u003Cem\u003Eoxidizer\u003C/em\u003E-rich for some reason).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T00:27:05Z\u0022 title=\u002210/27/2013 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-27T00:43:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@NathanKell: \u003C/strong\u003EIf you want a gauge of how things are going, consider this rocket:\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan we try it out too? The wobble is killing me. Literally. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-27T00:47:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Legwan\u0022 data-cite=\u0022Legwan\u0022\u003E\u003Cdiv\u003EOne suggestion regarding atmosphere height - would it be possible to increase the value even higher without scalling density at lower altitudes? \u003Cp\u003EBased on the neat source I\u0027ve found \u003Ca href=\u0022http://www.ips.gov.au/Category/Educational/Space%20Weather/Space%20Weather%20Effects/SatelliteOrbitalDecayCalculations.pdf\u0022 rel=\u0022external nofollow\u0022\u003EPDF\u003C/a\u003E (\u002B \u003Ca href=\u0022http://www.lizard-tail.com/isana/lab/orbital_decay/\u0022 rel=\u0022external nofollow\u0022\u003EImplemententation\u003C/a\u003E):\u003C/p\u003E\u003Cp\u003E\u0022In all but the heaviest satellites (those with a mass to area ratio well in excess of 100 kilogram per square metre), the actual lifetime from an altitude of less than 180 km is only a few hours.\u0022\u003C/p\u003E\u003Cp\u003EIn fact if one plays with the calculator even 180-200km results with rapid decay and the lowest orbit for the satellite was 215km (Sputnik 1 via Wikipedia).\u003C/p\u003E\u003Cp\u003EOf course it\u0027s more a matter of self control here if we want real life behavior (like not parking at 150km orbit for \u0026gt; 1 revolution). Nonetheless further increasing the atmosphere height is tempting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBTW I\u0027ve done some more research on orbital decay and it seems like a nice idea for a plugin - in short: all satellites in LKO need dV to maintain the orbit (amount depending on height), scan through all flights, deduct dV, if no left play with orbital parameters next time vessel becomes active, Ioncross does something familiar just with life support. I\u0027m not a programmer so feel free to steal the idea.\u003C/p\u003E\u003Cp\u003EFinally I\u0027d like to thank developers of this mod - You\u0027ve fulfilled my last wish towards this game. \u003C/p\u003E\u003Cp\u003EFelling like it should be a separate mode unlockable at some stage in career more (kind research on space telescope/planet detection \u002B placing big junk in orbit)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was trying to do something like that, but faced odd behaviour of KSP\u0027s Orbit class - but that was back in 0.19-ish times. Maybe I\u0027ll try to do that again once I get a second. Such mod would definetly be very useful as you won\u0027t need to worry about final stages flying around just above the edge of atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-27T00:49:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EHeh. I just realized you ended up with a much easier task than me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Gemini is a simple 2-stage rocket with spacecraft on top, Soyuz has an intricate LES system (that I\u0027m also going to replicate), 3 stages and a rather complicated spacecraft. Right now, using MFT fuel values made the thing somewhat overweight. That probably means those engines run fuel-rich, but I haven\u0027t been able to find a proper ratio for anything but the Soyuz Service Module engines (which seems to run \u003Cem\u003Eoxidizer\u003C/em\u003E-rich for some reason).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy don\u0027t you just take BobCat\u0027s Soyuz-U/FG and change parameters to real ones from Wiki or some other source? The beauty of realism is that you don\u0027t need made-up number - use real ones \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T00:54:19Z\u0022 title=\u002210/27/2013 12:54  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by asmi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-27T01:20:21Z","Content":"\n\u003Cp\u003EAstronautix has the fuel ratios for Soyuz U and Soyuz FG engines.\u003C/p\u003E\u003Cp\u003EYeah, Titan II GLV and Gemini is easier, but it\u0027s still wicked hard getting the spacecraft weights and Isps exactly right. Still wouldn\u0027t trade you though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003Easmi, I\u0027ve been thinking about that too, but I think I\u0027ll leave that to you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m already maintaining like five mods, although with help. :]\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-27T01:33:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EI\u0027m already maintaining like five mods, although with help. :]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFine, but can you please please please add option to disable all heat production for engines in MFSC? I really hate this stupid system!\u003C/p\u003E\n"}]}