{"TopicId":49917,"ForumId":16,"TopicTitle":"Zeroing surface velocity for lander","CreatedByName":"Jaxal1","CreatedById":85315,"CreatedDateTime":"2013-10-21T18:28:17Z","PageNum":1,"Articles":[{"CreatedByName":"Jaxal1","CreatedById":85315,"CreatedDateTime":"2013-10-21T18:28:17Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to land on the Mun.\u003C/p\u003E\u003Cp\u003EI actually managed to get a probe down, but landed on a slope so it rolled down the hill, busted its engine and became a stationary \u0027science station\u0027.\u003C/p\u003E\u003Cp\u003EBut every time I try to send a Kerbal, I have lateral velocity when I touch down, so the lander tips over, and usually breaks. Which means a revert, because I\u0027m trying to run a zero loss program, and I can\u0027t count on a rescue when I can\u0027t even land.\u003C/p\u003E\u003Cp\u003EI ground enough Science to get RCS, and I\u0027ve been trying to null my lateral speed with it, but it is difficult to keep the Translation keys straight in my head while also keeping an eye on my velocity and altitude with the main rocket. Especially when there is no special indicator of horizontal vs. vertical velocity components.\u003C/p\u003E\u003Cp\u003EIs there a trick to this? Do people simply fire their rocket retrograde until their velocity is exactly zero, then resume falling?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T19:41:51Z\u0022 title=\u002210/21/2013 07:41  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by Jaxal1\u003C/strong\u003E\n\u003Cbr\u003ESpelling, mark answered\n\u003C/span\u003E\n"},{"CreatedByName":"Nasakev","CreatedById":72681,"CreatedDateTime":"2013-10-21T18:39:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDo people simply fire their rocket retrograde until their velocity is exactly zero, then resume falling?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoing this near the surface is called a \u0022suicide burn\u0022 and is actually one of the more fuel efficient ways to land. Doing it a bit higher up give you more margin for error, but do it too high up and you\u0027ll just have to do it again later as the planet rotates under you.\u003C/p\u003E\u003Cp\u003EFor someone having trouble like you are, I\u0027d recommend killing most of your velocity a few kilometers up (anywhere from 5 to 25 depending on what you\u0027re comfortable with/how fast the ship can accelerate) and falling more gently to the surface, making smaller correction burns retrograde on the way down. Pack some extra fuel when you do it!\u003C/p\u003E\u003Cp\u003EOh, and protip: if it looks like you\u0027ll be hitting the ground with too much velocity, don\u0027t be afraid to floor it for a few seconds to gain altitude. Better to land with low fuel than crash, after all.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"Jaxal1","CreatedById":85315,"CreatedDateTime":"2013-10-21T19:13:25Z","Content":"\n\u003Cp\u003EThanks for the tip. Related question, is it possible to get an altitude reading from the actual ground instead of \u0027sea level\u0027? It was jarring for me the first time I thought I have another kilometer to fall but then saw my shadow rushing up toward me.\u003C/p\u003E\u003Cp\u003EI know the game calculates it because parachutes always deploy at 500m over surface, not 500m over sea level.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-21T19:27:25Z","Content":"\n\u003Cp\u003EYou can get surface altitude in IVA, or use Kerbal Engineer.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-10-21T19:37:54Z","Content":"\n\u003Cp\u003EBasically, you have to watch how the prograde/retrograde markers behave when you burn while not centered directly on them. Burning while oriented near the prograde marker will cause the marker to move TOWARDS the center of the navball because you are increasing the velocity towards that direction. Similarly, when you are burning while oriented near the retrograde marker, the marker will move AWAY from the center of the navball.\u003C/p\u003E\u003Cp\u003ETo kill your lateral velocity center the navball in such a way so that the retrograde marker is located somewhere on the line between the center of the navball and the dot in the middle of the blue navball hemisphere (the point you orient towards when facing \u0027up\u0027). This way, when you burn, the retrograde marker will move away from the center of the navball and TOWARDS the \u0027up\u0027 marker. Once they overlap, you are falling straight down with very little lateral velocity. \u003C/p\u003E\u003Cp\u003EThen point your ship up, turn on sas and descend, slowly reducing your velocity as you get closer to the surface. The retrograde marker will try to drift away from the center, but just point your ship towards it while burning to bring it back to center.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-10-21T19:45:14Z","Content":"\n\u003Cp\u003EI suggest Kerbal Engineer for altitude. It\u0027s dumb that the game doesn\u0027t tell you except in IVA.\u003C/p\u003E\u003Cp\u003EAs to the killing velocity... yes that\u0027s exactly what you do. Burn prograde right before you\u0027d crash. A \u0022suicide burn\u0022 is not quite as dangerous as its name sounds for 2 reasons:\u003C/p\u003E\u003Cp\u003E1) Quicksave! Hit F5 well before you start, so you can restart with F9 if you didn\u0027t time it right.\u003C/p\u003E\u003Cp\u003E2) Maneuver nodes! Make one right before the ground, and drag it retrograde until it show you dropping. Watch out it likes to freak out with 0 velocity. Note the time it will take (do a test burn to make the time realistic if you don\u0027t trust it), and then when you think you\u0027re that many seconds from the ground (plus a few seconds!) go full throttle.\u003C/p\u003E\u003Cp\u003ENot only is it efficient, a suicide burn is insanely fun and thrilling when you get it right.\u003C/p\u003E\n"},{"CreatedByName":"Lheim","CreatedById":62665,"CreatedDateTime":"2013-10-21T19:50:50Z","Content":"\n\u003Cp\u003EMake sure your velocity read-out is in surface mode, not orbital. It\u0027ll switch by itself at a certain altitude, but I like to switch it a little earlier.\u003C/p\u003E\u003Cp\u003EThe way I usually land is to set my PE fairly low - say 10000 meters, and as I zoom by watch the surface for my landing spot. When I see a good spot coming up, I point at the horizon along my vector, then kill most of my lateral speed - the retrograde marker moves up close to vertical. Then I do just slow slow engine burn keeping myself pointed retrograde as I fall - not to slow down so much as to manage the speed of it to what I feel is safe for the altitude.\u003C/p\u003E\u003Cp\u003EPro tip: lights pointed down work wonders even for dayside landings. The round ones are very powerful and you\u0027ll notice them on the ground a good ways up.\u003C/p\u003E\u003Cp\u003EPro-pro tip: the height you want to start burning to kill your velocity at will vary. Ships with good thrust:weight ratios can start much later.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-10-21T19:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ENot only is it efficient, a suicide burn is insanely fun and thrilling \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewhen you get it right.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere, I fixed it.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-21T19:57:58Z","Content":"\n\u003Cp\u003EI\u0027d suggest installing Mechjeb. You can let it land for you, observe what it does and try to mimic.\u003C/p\u003E\u003Cp\u003EAlternatively if you don\u0027t want to use autopilot, Mechjeb can also tell you seperate horizontal and vertical speed, true altitude (the one you need for landing), and attitude control.\u003C/p\u003E\u003Cp\u003EWhen I land, I tell attitude control to turn the craft towards retrograde, and just burn slowly. Doing this will slowly move the retrograde vector up towards the top of the navball. Once it\u0027s there, your vertical velocity is 0\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T20:31:44Z\u0022 title=\u002210/21/2013 08:31  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by Sirrobert\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Morokth","CreatedById":62433,"CreatedDateTime":"2013-10-21T20:27:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EI\u0027d suggest installing Mechjeb. You can let it land for you, observe what it does and try to mimic.\u003Cp\u003EAlternatively if you don\u0027t want to use autopilot, Mechjeb can also tell you seperate horizontal and vertical speed, true altitude (the one you need for landing), and attitude control.\u003C/p\u003E\u003Cp\u003EWhen I land, I tell attitude control to turn the craft towards prograde, and just burn slowly. Doing this will slowly move the prograde vector up towards the top of the navball. Once it\u0027s there, your vertical velocity is 0\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe means RETROGRADE. Burning prograde will increase your orbital period. Retrograde slows you down because you\u0027re burning against your current velocity.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-21T20:31:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Morokth\u0022 data-cite=\u0022Morokth\u0022\u003E\u003Cdiv\u003EHe means RETROGRADE. Burning prograde will increase your orbital period. Retrograde slows you down because you\u0027re burning against your current velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMajor epic super facepalm. Thanks\u003C/p\u003E\u003Cp\u003EWorst part is I looked at the word prograde, thought something was wrong... Checked the spelling, concluded it was right... still felt something was wrong.\u003C/p\u003E\u003Cp\u003EI\u0027m editting the original to prevent confusion\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-10-21T21:11:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ENot only is it efficient, a suicide burn is insanely fun and thrilling \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewhen you get it right\u003C/span\u003E.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EThere, I fixed it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha! So true. But it\u0027s harder to get back and tell Bill and Bob about if you get it wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2013-10-21T22:40:59Z","Content":"\n\u003Cp\u003EGet your periapsis down close to the surface and start your landing burn at periapsis. This is the most efficient way to land.\u003C/p\u003E\u003Cp\u003EI would hardly call it a suicide burn because you can easily abort the landing by pointing straight up.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-10-21T22:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kosmo-not\u0022 data-cite=\u0022Kosmo-not\u0022\u003E\u003Cdiv\u003EGet your periapsis down close to the surface and start your landing burn at periapsis. This is the most efficient way to land.\u003Cp\u003EI would hardly call it a suicide burn because you can easily abort the landing by pointing straight up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not what I call a suicide burn. For me, a suicide burn is coming in at a fairly steep slope and burning with only a few seconds to spare. You\u0027re already essentially pointing straight up and burning at full throttle, so if anything goes wrong there\u0027s nothing you can do* but crash.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E*Other than F9 to restore\u003C/em\u003E\u003C/p\u003E\n"}]}