{"TopicId":49916,"ForumId":55,"TopicTitle":"More science ideas","CreatedByName":"wronkiew","CreatedById":60802,"CreatedDateTime":"2013-10-21T18:20:06Z","PageNum":1,"Articles":[{"CreatedByName":"wronkiew","CreatedById":60802,"CreatedDateTime":"2013-10-21T18:20:06Z","Content":"\n\u003Cp\u003EHarvesteR mentioned that the Kerbin biomes were created as a way to get initial science points. I think that\u0027s great, because it gives the Kerbals a chance to test their spacesuits and hardware in various environments, like NASA sometimes does with craters, barren islands, and undersea laboratories. After playing career mode in 0.22 for a while, I think there are some additional opportunities for science that I was sad to see were missing:\u003C/p\u003E\u003Cp\u003EPoints for flight control and SSTO tricks. Right now you get points for recovering a suborbital mission with the control module intact. There should be a new category for landing a craft with all parts it launched with intact. Points for low altitude, suborbital, and (massive points for) orbital. I\u0027m pretty sure it\u0027s possible to do the low altitude task with just the initial parts.\u003C/p\u003E\u003Cp\u003EPoints for successful VTOL tests. There should be a bonus for landing a ship that launched without any parachute parts. It\u0027s probably not reasonable to expect players to be able to do this until they have developed landing legs.\u003C/p\u003E\u003Cp\u003EScience for crew reports during reentry. Not only would this be valuable science IRL, it requires a degree of player multitasking needed for more advanced missions.\u003C/p\u003E\u003Cp\u003EFinally, I would like to see the tech tree reworked so where a technology has two prerequisites, both need to be researched before the more advanced one is made available.\u003C/p\u003E\u003Cp\u003EThanks for the awesome game!\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-10-21T19:50:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wronkiew\u0022 data-cite=\u0022wronkiew\u0022\u003E\u003Cdiv\u003EFinally, I would like to see the tech tree reworked so where a technology has two prerequisites, both need to be researched before the more advanced one is made available.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is already true for some tech nodes. There\u0027s a link to a picture of the tech tree demonstrating this in [thread=53025]this thread[/thread].\u003C/p\u003E\u003Cp\u003Eeg. Heavier Rocketry requires Heavy Rocketry \u003Cem\u003Eand\u003C/em\u003E Fuel Systems.\u003C/p\u003E\n"},{"CreatedByName":"wronkiew","CreatedById":60802,"CreatedDateTime":"2013-10-21T20:23:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Supernovy\u0022 data-cite=\u0022Supernovy\u0022\u003E\u003Cdiv\u003EThis is already true for some tech nodes. There\u0027s a link to a picture of the tech tree demonstrating this in [thread=53025]this thread[/thread].\u003Cp\u003Eeg. Heavier Rocketry requires Heavy Rocketry \u003Cem\u003Eand\u003C/em\u003E Fuel Systems.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, excellent! I hadn\u0027t gotten that far yet.\u003C/p\u003E\n"},{"CreatedByName":"wronkiew","CreatedById":60802,"CreatedDateTime":"2013-10-24T18:10:14Z","Content":"\n\u003Cp\u003ESome more suggestions:\u003C/p\u003E\u003Cp\u003EAdd orbital rendezvous objectives. Bring two separately-launched spacecraft within 50m of each other and recover at least one of them. More advanced objectives could be swapping crews and docking.\u003C/p\u003E\u003Cp\u003EAdd an abort test. Design a spacecraft with functions assigned to the abort key. Hit the abort button while in the lower and/or upper atmosphere and recover what\u0027s left of the craft successfully.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-10-24T18:29:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wronkiew\u0022 data-cite=\u0022wronkiew\u0022\u003E\u003Cdiv\u003ESome more suggestions:\u003Cp\u003EAdd orbital rendezvous objectives. Bring two separately-launched spacecraft within 50m of each other and recover at least one of them. More advanced objectives could be swapping crews and docking.\u003C/p\u003E\u003Cp\u003EAdd an abort test. Design a spacecraft with functions assigned to the abort key. Hit the abort button while in the lower and/or upper atmosphere and recover what\u0027s left of the craft successfully.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat will all come when economy is implemented and we get to perform specific missions to earn money. Science is just the beginning of career mode.\u003C/p\u003E\n"}]}