{"TopicId":50190,"ForumId":32,"TopicTitle":"More bang for your buck - What would you like next for KSP?","CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-10-23T12:16:58Z","PageNum":5,"Articles":[{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2013-10-25T15:18:45Z","Content":"\n\u003Cp\u003EImplementation of the Tiberdyne Aerospace Shuttle Booster System, which was very recently updated to use only stock resources and, thanks to the new super-beefed 0.22 A/SAS, no longer requires an off-set COM compensator plugin. Ksp could use some 3m parts, as well an actual use for the very shuttle-esque Mk 3 plane parts. This could also be used as an excuse to upgrade and re-texture the plane parts.\u003C/p\u003E\n"},{"CreatedByName":"Highlad","CreatedById":64590,"CreatedDateTime":"2013-10-25T16:28:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EDefinitely not realistic ... \u003Cp\u003E***\u003C/p\u003E\u003Cp\u003EAlso killing a Kerbal (or even a whole capsule crew) as condition for GAME OVER could make the game rather short \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I know its not actually realistic, I figure i would put it in inverted commas. I was thinking of it as more of a super hard difficulty more than a realistic space program.\u003C/p\u003E\n"},{"CreatedByName":"raygundan","CreatedById":78300,"CreatedDateTime":"2013-11-27T20:45:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SunJumper\u0022 data-cite=\u0022SunJumper\u0022\u003E\u003Cdiv\u003E5) Rebalance the tech tree so that it can only be completed by \u0027mining\u0027 all bodies in the system for all science types\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a bit extreme. The \u0022kerbal universe\u0022 should contain more possible science points than it takes to unlock the full (current) tree. Not everyone is going to get everywhere, particularly if they\u0027re limited in the parts they have to do it. I can\u0027t count the number of attempts I made to land on Eve and return before I succeeded-- if I had been limited to only part of the tree because all the Eve science was required to get the last unlocks, I\u0027m not sure I ever would have made it.\u003C/p\u003E\u003Cp\u003EWhat might work, to go along with some other things you suggested like \u0022better nuke engines further in the tech tree,\u0022 is putting some seriously ultra-high-tech Kerbal rockets that don\u0027t currently exist further on as \u0022completist unlocks.\u0022 But I don\u0027t think making the current tech tree require all science on every body is going to do much besides raise a frustrating barrier for people who aren\u0027t ultra-hardcore that drives them away from using career mode at all. \u003C/p\u003E\u003Cp\u003EIn addition, there\u0027s very little point in having a tech tree that is only fully unlocked upon total completion even for the hardcore. What are you going to do with your newly-unlocked whizbang engines if they only appear after you\u0027ve already been everywhere and done everything? If a part is going to be used, it needs to be in your hands before you\u0027ve finished the game.\u003C/p\u003E\n"}]}