{"TopicId":50305,"ForumId":44,"TopicTitle":"Recycling: Thoughts?","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-10-23T23:01:43Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-10-23T23:01:43Z","Content":"\n\u003Cp\u003ERecycling is a rather big issue nowadays, so I thought it would be interesting to see how other people see it. What do you think of the idea of recycling? Each country has a different policy on it, so how does your country think of it? What would you like to see happen?\u003C/p\u003E\u003Cp\u003E[EDIT] Not sure if science labs or space lounge.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-10-23T23:30:31Z","Content":"\n\u003Cp\u003EDepends. Some things are better to produce newly, and just put on a landfill than to recycle.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-10-24T01:57:06Z","Content":"\n\u003Cp\u003EI recycle my rocket parts.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2013-10-24T02:03:42Z","Content":"\n\u003Cp\u003EAccording to Penn and Teller Recycling costs multiple billions of dollars to the gov in the US. I expect it to be the same in Canada just less. I hope someone ends this madness. If you haven\u0027t seen it you should watch the Penn and Teller on recycling.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-24T02:19:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EDepends. Some things are better to produce newly, and just put on a landfill than to recycle.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the long run this will not hold. We will inevetably move towards a model akin to that of nature; every material is a resource for another material. As mining will become more expensive and essentially is finite, we will start shifting existing materials around. Production and refinement is likely to be much more local, as resources will at that stage be fairly equally distributed around the globe through the industrial and transportational efforts we see today. This will also mean the cost of a product is purely based on the energy it takes to make instead of the cost of transport and things like that. This will be augmented by the further development of 3D-printers and the capability to manipulate materials on a molecular level (very local and small scale production) and open-source information though the internet combined with smart and easy computer aided design (no dominating brands making you pay for designs).\u003C/p\u003E\u003Cp\u003EAs soon as we are able to develop a cheap and virtually infinite energy source in the form of renewable energy or nuclear fusion, products will barely cost anything. Discarding them will not have the negative consequences they have today, as all parts will be directly or indirectly recycled into a new product. The whole process will go full cycle - at some point in the far future.\u003C/p\u003E\u003Cp\u003EA major advantage to go along with these developments is a lot more stability on a world scale; instead of countries fighting over resources, trading rights and routes (a, if not \u003Cem\u003Ethe\u003C/em\u003E, major source of conflict today) the resources and production are much more evenly distributed across the world. Local conflicts will not affect the rest of the world as they do now and rebuilding afterwards will be relatively painless. This is what I call modular society; seperate parts are able to sustain themselves without relying on partners on the other side of the world, while still interconnecting through modern communications.\u003C/p\u003E\n"},{"CreatedByName":"Superluminaut","CreatedById":58963,"CreatedDateTime":"2013-10-24T06:43:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dharak1\u0022 data-cite=\u0022dharak1\u0022\u003E\u003Cdiv\u003EAccording to Penn and Teller Recycling costs multiple billions of dollars to the gov in the US. I expect it to be the same in Canada just less. I hope someone ends this madness. If you haven\u0027t seen it you should watch the Penn and Teller on recycling.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen resources are gone it will cost even more. \u003C/p\u003E\u003Cp\u003EExample: After WWI in germany 1lb of bread cost 3,000,000,000 marks.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-24T06:49:07Z","Content":"\n\u003Cp\u003Esome things it pays off to recycle, like metals. i think 95% of all steel currently in use is recycled. you actually save money by not having to smelt ore. plastics are also a good thing for recycling because, being petroleum based, the supply is somewhat finite.\u003C/p\u003E\u003Cp\u003Ewhen it comes to recycling stuff like electronics, we essentially dont have a very good means for that. you have composite materials, lots of fiberglass and epoxy and lots of rare earth metals and some precious metals in tiny quantities, and the problem is separating all that. \u003C/p\u003E\u003Cp\u003Ei do component level salvage to feed my electronics projects for free. all the passive components i use are 95% recycled. im also somewhat good at removing dip package components and some surface mount parts with low pin counts. what i have trouble salvaging is newer lead free components and ics in surface mount packages with large pin counts (im sure this would be easily fixed by getting one of those hot air reflow stations and a good pair of forceps). i mostly stick to electronics that are at least a few decades old. most of the electronics i get dont work, but most of the parts are functional with a few that are ruined and some are destroyed while attempting removal. component level salvage really isn\u0027t economically viable. \u003C/p\u003E\u003Cp\u003Ewhat usually happens is electronics are salvaged for materials only (copper, silver, gold, rare earth metals, etc), and hundreds of perfectly working components are being destroyed in the process, and this is also bad for the environment spewing lead and alkali metals all over the place (lead free just makes repair more expensive or even impossible). component salvage really doesn\u0027t pay of considering many of the parts cost pennies when purchased in bulk. the best thing you could do is board level salvage. separate the stuff that works from the stuff that doesn\u0027t and create a market for functional but obsolete devices in the third world, to help stimulate their economy and promote use of technology. we still dont know what to do with the stuff that doesn\u0027t work, we just end up selling it to china for materials salvage. the other side of it is devices are getting smaller and producing less waste end of life.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-10-24T07:05:05Z","Content":"\n\u003Cp\u003EOne of the big advantages of recycling, that doesn\u0027t always get attention, is the fact that we are running out of landfill space and getting new ones approved is almost political suicide.\u003C/p\u003E\u003Cp\u003EOn one wants a land fill near them. Recycling has extended the useable life span of these landfills and we can\u0027t keep dumping our used materials forever.\u003C/p\u003E\u003Cp\u003EAt some point we well literally run out of space for them or the toxic runoff will be everywhere. I think at some point we might even have to go back and dig up some of it for proper processing where it threatens the ground water used for drinking.\u003C/p\u003E\u003Cp\u003EThat buried garbage is going to be leaching into groundwater for a couple of thousand years. Recycling isn\u0027t really an option in the long run, it\u0027s mandatory if we don\u0027t want to deal with the pollution.\u003C/p\u003E\u003Cp\u003EWe well have to come up with a way to ether recycle or render harmless all of the garbage we dispose of.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-10-24T07:29:45Z","Content":"\n\u003Cp\u003EThe problem with recycling in America right now is the way most cities have implemented it.\u003C/p\u003E\u003Cp\u003EMost large cities have one garbage company that controls 80%\u002B of the market. That company then bribes the politicians into starting a recycling program and sell it to the people as a \u0022green\u0022 initiative. Then they charge whatever they want to the city to pick up the recycling because they are the only ones that can fill the contract. The politicians don\u0027t care it\u0027s not their money and they are getting a cut, the \u0022green\u0022 voters don\u0027t even pay attention to the cost.\u003C/p\u003E\u003Cp\u003ECompare this to the \u0022old\u0022 system where you cart your recycling into a center and they pay you for the recycling.\u003C/p\u003E\n"},{"CreatedByName":"Monger","CreatedById":4143,"CreatedDateTime":"2013-10-24T07:34:05Z","Content":"\n\u003Cp\u003EThe problem is not throwing away garbage, but how to obtain resources. Recycling is a very lucrative industry. Prices for copper, silver, gold and steel have skyrocketed in the last decade. Plastic material is highly dependent on oil. And other resources are getting short which we are currently not always aware of, like groundwater.\u003C/p\u003E\u003Cp\u003EThink of it this way: for an astronaut, recycling is not an option, it is self-evident. On a space station you have to recycle air, water, food and spare parts. And although the earth is a lot bigger than a space station, in the end all resources on earth are finite, as well.\u003C/p\u003E\u003Cp\u003ERecycling is not an option, it is a necessity to survive.\u003C/p\u003E\n"},{"CreatedByName":"Monger","CreatedById":4143,"CreatedDateTime":"2013-10-24T07:45:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMost large cities have one garbage company that controls 80%\u002B of the market. That company then bribes the politicians into starting a recycling program and sell it to the people as a \u0022green\u0022 initiative. Then they charge whatever they want to the city to pick up the recycling because they are the only ones that can fill the contract.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounds almost exactly like in Germany. Private waste is getting less and less, and we still pay more and more for garbage disposal. You could argue that this is a way to create awareness for avoiding waste, but I guess the main reason is rather that it is a convenient way of additional income for the city.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-24T08:01:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003ERecycling is a rather big issue nowadays\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople often assume that recycling is new, it\u0027s not. The concept of recycling was invented by manufacturing, and is as old as manufacturing itself. The reason they do it is because it\u0027s efficient. Factories try to recover as much of their waste as possible as early as possible and recycle it back into their process.\u003C/p\u003E\u003Cp\u003ERecycling at a domestic level is essentially the same idea. Some products have so much energy or money embodied in them that it makes sense to recover them after use. Glass, aluminium, paper all stand a good chance of being economical to recover, for example, because processing them from raw requires so much energy.\u003C/p\u003E\u003Cp\u003EFood waste is more of an environmental issue than an efficiency one. If chucked in landfill it degrades anaerobically, which generates methane. That\u0027s a powerful GHG, so people should either be encouraged to compost at home or it should be collected kerbside.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-10-24T08:22:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superluminaut\u0022 data-cite=\u0022Superluminaut\u0022\u003E\u003Cdiv\u003EWhen resources are gone it will cost even more. \u003Cp\u003EExample: After WWI in germany 1lb of bread cost 3,000,000,000 marks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat had nothing to do with lack of resources, and everything with the German government printing money in unlimited supply.\u003C/p\u003E\u003Cp\u003EE.g. if there are 1000 loafs of bread and 1000 units of currency to pay for them, each costs 1 unit of currency in a free market economy.\u003C/p\u003E\u003Cp\u003EIf there are 1.000.000.000 units of currency, each costs 1.000.000 units of currency.\u003C/p\u003E\u003Cp\u003EThat\u0027s what happened in Germany in the Weimar republic, and in most any country suffering from hyper inflation.\u003C/p\u003E\u003Cp\u003EYes, it\u0027s slightly more complicated than that, but that\u0027s the version for people without advanced degrees in mathematics and economics.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-10-24T08:27:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monger\u0022 data-cite=\u0022Monger\u0022\u003E\u003Cdiv\u003EThis sounds almost exactly like in Germany. Private waste is getting less and less, and we still pay more and more for garbage disposal. You could argue that this is a way to create awareness for avoiding waste, but I guess the main reason is rather that it is a convenient way of additional income for the city.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the long and short of it.\u003C/p\u003E\u003Cp\u003ERecycling many things costs more than making new. In fact when you pay to have many things recycled and dilligently spend time and effort putting them in those different coloured bins your city supplies to you (at a price of course), many a time the dump trucks picking it all up just mix it all together again and cart it all off to an incinerator or landfill rather than sending things to recycling plants.\u003C/p\u003E\u003Cp\u003EGlass, paper, and some plastics and metals are an exception to that, but even there the resulting product is of inferior quality to what it was recycled from unless in some cases a massive effort at manually sorting and filtering the incoming streams is undertaken (e.g. with glass, everything\u0027d need to be sorted very carefully by colour else the resulting new glass will never be other than brown and somewhat milky).\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-10-24T08:59:27Z","Content":"\n\u003Cp\u003ERecycling isnt any new. Actually people was recycling literaly everithing before they got lazy and stoped to recycle.\u003C/p\u003E\u003Cp\u003EWhen i was kid, my parrents recycled, reused, or repurposed anything that was at least somehow usefull. I was rised on farm so all organic waste was turned to fertilizer or fed to animals. Botles were used to store food over and over untill they broke and after that even the scrap glass was repurposed for decoration or construction purposes (you need lot less concrete to make a floor or wall if you put lot of glaas and other garbage to it).\u003C/p\u003E\u003Cp\u003EMy younger siblings was wearing my old clothes as i outgrew it, i was wearing slightly adjusted old clothes after my parrents or older cousins. Broken toys was repaired instead of thrown away, leftowers from onedays dinner was used for next day lunch. \u003C/p\u003E\u003Cp\u003EThen things started to be cheaper, we moved to the city, we grew lazy over time. We stopped recycle as just buy things became easier, and the things themselves became cheaper.\u003C/p\u003E\u003Cp\u003ENowadays some things becoming more expensive again, so some people put a bit more thought before they just throw it away, but i doubt that anyone will ever again recycle everithing as my parrents did.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-10-24T10:20:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003E[...]\u003Cp\u003EFood waste is more of an environmental issue than an efficiency one. If chucked in landfill it degrades anaerobically, which generates methane. That\u0027s a powerful GHG, so people should either be encouraged to compost at home or it should be collected kerbside.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs of june 2005 (IIRC) all european household waste must decompose housed (inside a building or reactor) and the gases must be Ã‚Â´dealt withÃ‚Â´ (filtered, burned...) first, before getting on a landfill. I did an internship at such a place. Fun. The stuff rots in a big hall, piled 2-3m high. Maggots form a centimeter high top-layer ontop of the newest charges (week 2 and 3, mostly). The temperature inside the pile goes upto 80Ã‚Â°C (maximum for the bacteria to work - i actually measured that, climbing on top of the pile in a hazard-suite and sticking a sensor-lance into it), and is 40\u002BÃ‚Â°C in the Ã‚Â´airÃ‚Â´ (CO2 upto 1%...). The waste gets on the fill after 12 to 16 weeks, with itÃ‚Â´s drymass about halved in the process. This ensures, that the gases produced during decomposition can be caught and dont get into the atmosphere, or, worse, start a fire on the landfill. \u003C/p\u003E\u003Cp\u003EAll this takes place after the household waste has been sorted mechanically, first. Plastics tend to be easily carried by wind and to carry high amounts chemical energy at the same time. They are called the Ã‚Â´fly-able factionÃ‚Â´ (FlugfÃƒÂ¤hige Fraktion - FluF - Ã‚Â´fluffigÃ‚Â´, oder?) and get blown from the converyer belt to be burned in a power plant. Metals get drawn from it with a strong electro-magnet (gosh, cleaning that thing, chisseling off the bottlecaps of the ceiling with a big chissel and heavy hammer - and that thing had been turned off for hours!). Then the waste gets maimed and only whats smaller than 80mm will get into the hall for biological decompisition, while the rest re-enters the cycle. \u003C/p\u003E\u003Cp\u003EUh, yeah...\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-24T10:31:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003EThe problem with recycling in America right now is the way most cities have implemented it.\u003Cp\u003EMost large cities have one garbage company that controls 80%\u002B of the market. That company then bribes the politicians into starting a recycling program and sell it to the people as a \u0022green\u0022 initiative. Then they charge whatever they want to the city to pick up the recycling because they are the only ones that can fill the contract. The politicians don\u0027t care it\u0027s not their money and they are getting a cut, the \u0022green\u0022 voters don\u0027t even pay attention to the cost.\u003C/p\u003E\u003Cp\u003ECompare this to the \u0022old\u0022 system where you cart your recycling into a center and they pay you for the recycling.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewhen i was a kid i remember they used to have these reverse vending machines. you put in some cans and it gives you some change. so we would dig through dumpsters looking for cans, bag em, take em to those machines, and crush em for cash. we managed about $10 each every time we did that and that was a lot of money back then (and thats what we could carry).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003E(e.g. with glass, everything\u0027d need to be sorted very carefully by colour else the resulting new glass will never be other than brown and somewhat milky).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethere are ways to automate sorting. with improvements in sensor technology it is possible to time firing of an array of air jets to the passage of a piece of glass of a certain color, flinging it onto another conveyor belt. this would of course require some preprocessing, such as ensuring a uniform sized particle by crushing larger chunks before sending it through the optical sorter.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-24T10:42:03Z\u0022 title=\u002210/24/2013 10:42  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 24, 2013\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-24T10:42:10Z","Content":"\n\u003Cp\u003EYeah, the simple option is just to chuck a membrane over the whole landfill and pipe the gases that build up under it off to be flared off. Bit of a waste, if it could be done economically you\u0027d have to prefer that all that energy could be recovered instead of just blown into the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-24T10:43:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EYeah, the simple option is just to chuck a membrane over the whole landfill and pipe the gases that build up under it off to be flared off. Bit of a waste, if it could be done economically you\u0027d have to prefer that all that energy could be recovered instead of just blown into the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eor run it to diesel engines to turn generators, or fuel garbage trucks. that kinda stuff has been done before.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2013-10-24T11:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Eor run it to diesel engines to turn generators, or fuel garbage trucks. that kinda stuff has been done before.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, diesel cannot autoignite kethane, burn it in gas turbine or gas engine instead... Or pass it through a Fischer Tropsch reactor and it will be good\u003C/p\u003E\u003Cp\u003ESo here is my solution: Divide the organic waste stream into 2: The first half go to anaerobic digester and it produce methane and biodigestate. The second half go to biochar retort and it produce syngas and biochar. Burn methane and syngas in gas turbine to generate electricity, mix biodigestate and biochar to make superfertilizer, kill chemical fertilizer dependence\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-24T13:52:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ewhen i was a kid i remember they used to have these reverse vending machines. you put in some cans and it gives you some change. so we would dig through dumpsters looking for cans, bag em, take em to those machines, and crush em for cash. we managed about $10 each every time we did that and that was a lot of money back then (and thats what we could carry).\u003Cp\u003Ethere are ways to automate sorting. with improvements in sensor technology it is possible to time firing of an array of air jets to the passage of a piece of glass of a certain color, flinging it onto another conveyor belt. this would of course require some preprocessing, such as ensuring a uniform sized particle by crushing larger chunks before sending it through the optical sorter.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn Europe at least Norway this is common, you get money back from cans and bottles or more accurate 0.1$ is added to the price and you get it back then recycling. \u003C/p\u003E\u003Cp\u003EMain problem is that glass is not very nice to drive over with an bike or step on then barefoot, no issue putting in an landfill. \u003C/p\u003E\u003Cp\u003EYou preferable sort the bottles then unbroken, then you can just clean and reuse them if not its probably better to use for something else, some industrial use don\u0027t care about color. \u003C/p\u003E\u003Cp\u003ENow a lot of recycling is political based as in no need to recycle paper in continents with lots of forests. You have more leftover wood than you can use so its smarter to just burn it.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-24T13:54:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EYeah, the simple option is just to chuck a membrane over the whole landfill and pipe the gases that build up under it off to be flared off. Bit of a waste, if it could be done economically you\u0027d have to prefer that all that energy could be recovered instead of just blown into the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClose to where I lived earlier they actually had an gas field doing that. Gas was burned and used for heating. \u003C/p\u003E\u003Cp\u003EOld landfill they build houses on and once the gas content in the drainpipes was so high it started to burn.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-24T21:34:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003ENo, diesel cannot autoignite kethane, burn it in gas turbine or gas engine instead... Or pass it through a Fischer Tropsch reactor and it will be good\u003Cp\u003ESo here is my solution: Divide the organic waste stream into 2: The first half go to anaerobic digester and it produce methane and biodigestate. The second half go to biochar retort and it produce syngas and biochar. Burn methane and syngas in gas turbine to generate electricity, mix biodigestate and biochar to make superfertilizer, kill chemical fertilizer dependence\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edude, its been done. you must remember that besides methane the process also generates heat which brings the gas temperature closer to the ignition point. when mixed with oxygen and compressed, boom. contrary to popular belief, diesel engines can run on anything.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-24T21:52:58Z","Content":"\n\u003Cp\u003ENot everything is viable for recycling, but we must remember that viable has two meanings: economically and enviromentally.\u003C/p\u003E\u003Cp\u003EThere are all possible combinations.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-10-24T22:11:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003Ewe must remember that viable has two meanings: economically and environmentally.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd we should remember that the 3 R\u0027s in the waste hierarchy: \u0022reduce, reuse, recycle\u0022 run in that order for good reason.\u003C/p\u003E\n"}]}