{"TopicId":50606,"ForumId":16,"TopicTitle":"A good way to get your Science Jr\u0026#039;s down from the atmosphere","CreatedByName":"Starfellowe","CreatedById":90330,"CreatedDateTime":"2013-10-26T01:23:32Z","PageNum":1,"Articles":[{"CreatedByName":"Starfellowe","CreatedById":90330,"CreatedDateTime":"2013-10-26T01:23:32Z","Content":"\n\u003Cp\u003EI\u0027m trying to figure out a way to successfully parachute a stack of three Science Jrs from orbit. I\u0027ve been using radially mounted parachutes, but it always gets destroyed on landing, even though it deploys fine. Has anyone had any luck getting large amounts of the things safely to the ground?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-10-26T01:28:37Z","Content":"\n\u003Cp\u003ESimply put -- \u003Cem\u003Elots\u003C/em\u003E of parachutes. Also be very careful where you place them to ensure the object lands with the greatest surface area hitting the ground at once.\u003C/p\u003E\n"},{"CreatedByName":"Alistone","CreatedById":60032,"CreatedDateTime":"2013-10-26T01:32:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starfellowe\u0022 data-cite=\u0022Starfellowe\u0022\u003E\u003Cdiv\u003EI\u0027m trying to figure out a way to successfully parachute a stack of three Science Jrs from orbit. I\u0027ve been using radially mounted parachutes, but it always gets destroyed on landing, even though it deploys fine. Has anyone had any luck getting large amounts of the things safely to the ground?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt tends to automatically destroy \u0022debris\u0022 that falls too close to a planet. More importantly, it stops rendering atmospheric drag for object beyond a certain distance from the ship you are flying. I think you actually have to switch to the debris then \u0022fly\u0022 it to the ground.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried it yet, but attaching a \u0022probe\u0022 to it may help prevent the \u0022delete debris\u0022 issue. But you\u0027d still have to fly it to allow physics to render (and thus for the parachutes to function all the way to the ground to avoid a cratering impact).\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-10-26T02:44:50Z","Content":"\n\u003Cp\u003EAre you following them down, or are you staying focused on a ship in orbit. Even with a parachute unattended ships will just get deleted if they get too close to a planets surface, since they are not being fully simulated.\u003C/p\u003E\u003Cp\u003EIf you are following them down, are the parachutes snapping (unlikely) or are one or more pods exploding when they touch the ground? To prevent them from exploding on impact you need to be aware of each parts impact resistance (it\u0027s in the tool tip). An impact resistance of 6 means the part will be destroyed if it hits the ground at 6m/s or more. Since the pods are so fragile you need enough parachutes to slow them down to below 6m/s. The speed of a falling item is based on its weight and drag. Adding more pods increases weight which increases speed. Adding more parachutes increasings drag which reduces speed.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-10-26T04:44:19Z","Content":"\n\u003Cp\u003EThe way I bring down a single pod is with 3 parachutes attached to the back. You might try a similar solution, just attach 3 radial chutes to the back of each pod and see if that works.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-10-26T05:03:15Z","Content":"\n\u003Cp\u003ECould put some landing legs on it. For greater stability, you could add the legs on one side and parachutes on the other (bring it down sideways). Just be careful of your center of mass. Could also add a fuel tank and some radial engines to slow it at the end, but now you\u0027re just building a lander.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-26T08:52:12Z","Content":"\n\u003Cp\u003EPut them on a pod with engine and lander legs would probably make it alot easier\u003C/p\u003E\n"}]}