{"TopicId":50619,"ForumId":50,"TopicTitle":"Rendesvous from surface to orbiting ship: the easy way!","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-26T03:17:38Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-26T03:17:38Z","Content":"\n\u003Cp\u003EThis is a little trick I picked up over time that\u0027s proven very useful. And it\u0027s dead-easy to do. The only caveat is that you have to be trying to intercept a ship that will fly \u0022relatively\u0022 overhead at some point. That\u0027s usually not a problem, though!\u003C/p\u003E\u003Cp\u003E1. Target the craft you want to intercept.\u003C/p\u003E\u003Cp\u003E2. Wait for the indicator to switch to Target, or switch it to Target when it\u0027s about 45 degrees away from you on the map.\u003C/p\u003E\u003Cp\u003E3. Blast off!\u003C/p\u003E\u003Cp\u003E4. Push the retrograde vector (yellow X) towards the anti-target vector (purple X). You do this by firing in the direction that the anti-target vector is relative to the retrograde vector, but even further away still. Ie. if the anti-target is on north and the retrograde is on northwest, you should be firing west to push retrograde towards anti-target.\u003C/p\u003E\u003Cp\u003E5. Once you\u0027ve got the vectors fairly close, check the map: the intercept indicators should also be really close!\u003C/p\u003E\u003Cp\u003E6. Time accelerate a little and then perform adjustments again. You don\u0027t want to get closer than about 30 seconds away or more than a minute away, and you want to keep pushing those two vectors closer to each other whenever the opportunity presents itself. This will cause you to approach at a fairly fast but also safe speed, which is a nice boon.\u003C/p\u003E\u003Cp\u003E7. Once you\u0027ve got your relative speeds down low enough and your ships close enough, it\u0027s all docking from there! If you have trouble with docking, well, there\u0027s a lot of tutorials on that already, so check one of them.\u003C/p\u003E\u003Cp\u003E This isn\u0027t the absolute most efficient way to intercept, it should be noted, but it WILL get you an intercept as long as your target\u0027s orbital path isn\u0027t too far afield of \u0022overhead\u0022 for your landed ship.\u003C/p\u003E\n"}]}