{"TopicId":50642,"ForumId":55,"TopicTitle":"Career mode: Evolve KSC in unison with thech tree","CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-10-26T10:52:00Z","PageNum":1,"Articles":[{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-10-26T10:52:00Z","Content":"\n\u003Cp\u003EAt the start of career mode you\u0027re being presented with a fully developed KSC. You\u0027ve got a huge research center but nothing yet to research and several other buildings that are next to useless. A smaller, less exuberant KSC would suffice.\u003C/p\u003E\u003Cp\u003ESo here\u0027s the idea:\u003C/p\u003E\u003Cp\u003EWhy not evolve KSC in unison with the tech tree, add or expand buildings as you unlock certain key fields in science? The current research complex consists of at least 7 or 8 distinct buildings (counting those connected with the bridge as two). One for each tech tier. The same goes for a few other buildings. Until the third and/or forth tier is unlocked the Space Plane Hanger and runway are almost useless. The radar complex could be evolved from a single dish to the full complex and the north and south wings of the Astronaut complex could become later additions.\u003C/p\u003E\u003Cp\u003ESeeing KSC grow from something small and simple to the pinacle of science and technology would add to a sense of achievement, of physical progress.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/c/c5/KSC.png\u0022 alt=\u0022KSC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Of course in sandbox mode the entire KSC should be there from the start.)\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-10-26T11:08:24Z","Content":"\n\u003Cp\u003EI am pretty sure that\u0027s the plan.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-10-26T11:11:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EI am pretty sure that\u0027s the plan.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI sincerely hope so but I haven\u0027t seen/heard anything along those lines yet.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-26T12:42:01Z","Content":"\n\u003Cp\u003EI love it.\u003C/p\u003E\u003Cp\u003EMaybe even make the VAB grow between tiers. You don\u0027t need anyone this big when you\u0027re at tier0 anyway\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-10-26T12:43:28Z","Content":"\n\u003Cp\u003EThey said during the .22 presentation/marathon, that they change the grid of the buildings, so they can easily add/remove building as the game advance.\u003C/p\u003E\n"},{"CreatedByName":"Roderik","CreatedById":85776,"CreatedDateTime":"2013-10-26T16:35:37Z","Content":"\n\u003Cp\u003EThis already wil being implemented\u003C/p\u003E\n"}]}