{"TopicId":50673,"ForumId":32,"TopicTitle":"[Question for devs] Licence on a mod/addon with modified stock parts","CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2013-10-26T16:16:24Z","PageNum":1,"Articles":[{"CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2013-10-26T16:16:24Z","Content":"\n\u003Cp\u003EHi Squad Devs or others who might be able to awnser me, so i\u0027ll make a short and long version\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ELong version:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhen making different airplanes, both stock and especially with the fabulous B9 pack, I run into the problem with the landing gear beeing to small, thu resulting in lots of \u0026lt;strike\u0026gt;fun\u0026lt;/strike\u0026gt; crashes on both takeoffs and landings. And I have not managed to find some \u0027proper\u0027 addons with bigger and functional landingear. There are some in the firespitter pack, but they dont seem to work too well with heavy planes.\u003C/p\u003E\u003Cp\u003EHowever, it is quite easy to duplicate the stock landing gear, and then resizeing it. For my own personal use I\u0027ve made a few bigger ones, with 25% increment in size\u003C/p\u003E\u003Cp\u003EI would like to release theese landing gear, but I\u0027m not sure if im allowed to do so, without breaking any kind of EULA or copyright.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EShort version:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECan I, and if so; with what licence, release a .zip with theese added/modified landing gears.\u003C/p\u003E\u003Cp\u003ECheers, DJ Nekkid\u003C/p\u003E\n"},{"CreatedByName":"Mokmo","CreatedById":62363,"CreatedDateTime":"2013-10-26T18:06:56Z","Content":"\n\u003Cp\u003ENew B9 has a ton of bigger landing gears now, go check em out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-10-26T18:15:14Z","Content":"\n\u003Cp\u003EIsn\u0027t that in TV Aerospace?\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-10-26T19:00:02Z","Content":"\n\u003Cp\u003Eif you just resize, you only need the cfg, so there\u0027s no issue. There\u0027s several mods that are just cfgs and resize or repurpose the stock parts.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2013-10-26T19:04:35Z","Content":"\n\u003Cp\u003EIt is fair to ask the devs, and they do have a direct email for such inquiries. But as long as you are giving the mod out for free and not falsely claiming all of it as your work, giving fair credit to Squad as it is due, you can give the mod out for free to your heart\u0027s desire.\u003C/p\u003E\n"}]}