{"TopicId":50796,"ForumId":32,"TopicTitle":"Open discussion: Dev Blogs have come to an end?","CreatedByName":"Luigi Broglio","CreatedById":17650,"CreatedDateTime":"2013-10-27T13:58:35Z","PageNum":1,"Articles":[{"CreatedByName":"Luigi Broglio","CreatedById":17650,"CreatedDateTime":"2013-10-27T13:58:35Z","Content":"\n\u003Cp\u003EI\u0027d like to launch this discussion: Dev Blogs have come to an end?\u003C/p\u003E\u003Cp\u003EFirst of exposing all the criticism I have, let me start saying a thing that I would like to mantain clear during the discussion: I love SQUAD and I love KSP. I expect that you do too, or at least you mantain respect for Dev\u0027s work.\u003C/p\u003E\u003Cp\u003EThat say, I have to express a bit of my upset for the way developing of KSP is comunicated to the community.\u003C/p\u003E\u003Cp\u003ELet\u0027s start with number: since august 2013, we have had 5 Dev Blog entries, with bits of interesting information and near no images. But I see this tendency to have started some time before, near june.\u003C/p\u003E\u003Cp\u003EWhat about articles? Our great PD and Maxmaps kept us informed, with their KSP weekly, about developing of the game in a way that I would define Heroic. But I have to say that, comparing with the past (and with no blames for PD and Maxmaps), articles from the devs were more expressive because they were full of images and source explaination on what was boiling in the pot.\u003C/p\u003E\u003Cp\u003EIn few words, I think that what IMO was a really good caracteristic of ksp interaction between developers and community is coming to an end, I see now clear than ever that devs are detaching this type of comunication from them, losing in expressivity.\u003C/p\u003E\u003Cp\u003EI\u0027m sad about this, every time I visit the forum I HOPE there\u0027s a new entry with consistent information and images, but since some months I don\u0027t find that.\u003C/p\u003E\u003Cp\u003EI miss the ol\u0027 days where C7 and Harvester (and others) were posting something about their work.\u003C/p\u003E\u003Cp\u003EAre you comparting this feel with me?\u003C/p\u003E\u003Cp\u003EPS: I know, now you\u0027ll start saying \u0022ok, but with 0.21 and 0.22 devs were really busy with implementing stuffs and no time to write something\u0022 yes you\u0027re right, but it doesn\u0027t change the fact that we have little infos about developing, and I think that 10 minutes a day exist for 1 dev (I don\u0027t say 2 or 3, I say only 1) to write or posting an image without writing. If not everyday, once a week but NOT with KSP weekly.\u003C/p\u003E\u003Cp\u003EPPS: Sorry for bad english, I don\u0027t want right now to revise errors \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E .\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-27T14:00:36Z","Content":"\n\u003Cp\u003ENope, they havn\u0027t, you are just jumping the gun, we\u0027ve just had 0.22 and the devs need \u003Cem\u003Esome\u003C/em\u003E downtime, plus it\u0027s the weekend, they don\u0027t work the weekends.\u003C/p\u003E\u003Cp\u003EGive them a chance, sheesh \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Luigi Broglio","CreatedById":17650,"CreatedDateTime":"2013-10-27T14:06:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003ENope, they havn\u0027t, you are just jumping the gun, we\u0027ve just had 0.22 and the devs need \u003Cem\u003Esome\u003C/em\u003E downtime, plus it\u0027s the weekend, they don\u0027t work the weekends.\u003Cp\u003EGive them a chance, sheesh \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMmmh, as said, it\u0027s not a matter of right now, it\u0027s a matter I believe started with june, ok we had summer in it but summer was 2 week or a month only.\u003C/p\u003E\u003Cp\u003EAnd I repeat that I love them anyway, not a question of chances 8)\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-27T14:09:49Z","Content":"\n\u003Cp\u003EThey will be coming back, don\u0027t worry, and I and the other mods will poke Felipe and Chad to do some new blogs when they are in the office tomorrow \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Luigi Broglio","CreatedById":17650,"CreatedDateTime":"2013-10-27T14:12:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EThey will be coming back, don\u0027t worry, and I and the other mods will poke Felipe and Chad to do some new blogs when they are in the office tomorrow \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat cheers up me, thanks!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-27T14:14:18Z","Content":"\n\u003Cp\u003ENo problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Luckless","CreatedById":3954,"CreatedDateTime":"2013-10-27T14:25:46Z","Content":"\n\u003Cp\u003EHave you ever developed complex software? It is not easy to keep making short little \u0027updates\u0027 on work after a given point in development. You burn out, you have already said everything obvious about the project, and you become distracted by your focus on code and feature development. Rarely is it because the developers stop caring about the community, but far more often it is because they have no idea how long it has been since they\u0027ve made a post that has zero impact on their software development. \u003C/p\u003E\u003Cp\u003EIt is part of the reason why having a dedicated community management team member is often a very good thing, as they are far less likely to \u0027forget\u0027 small details like dealing with the fan base instead of becoming overly focused on code and tools. A QA lead is often one of the better options to fill this role for smaller teams where everyone has to wear a few hats. They\u0027re generally focused on organization anyway, and get their fingers in everyone\u0027s pies to understand what is going on, so they\u0027re usually already in a position to give updates on the entire team. (Or you can always hire a contractor to do things for you.)\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-27T14:28:41Z","Content":"\n\u003Cp\u003EQA lead would be Ted, but he\u0027s also got a lot on his plate as they say.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-10-27T14:29:13Z","Content":"\n\u003Cp\u003EThere is 2 things I believe that makes them blog a bit less often at the moment:\u003C/p\u003E\u003Cp\u003E- They have been working a lot more into the back end of KSP (the code more than feature) in the last few updates, and so there is less to make a good blog post about.\u003C/p\u003E\u003Cp\u003E- Squadcast, instead of blogging, every friday there is a dev talking in the squadcast, with live Q\u0026amp;A at the end. \u003C/p\u003E\u003Cp\u003EAs more new feature will come, i am sure there will be more blog going in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-27T15:02:17Z","Content":"\n\u003Cp\u003EYou need to be of certain nature to enjoy keeping up a blog. So I believe there was that idea, let\u0027s all have blogs, and everybody has put some effort to it. But over time they found it\u0027s too much of a hassle.\u003C/p\u003E\n"},{"CreatedByName":"Luigi Broglio","CreatedById":17650,"CreatedDateTime":"2013-10-30T22:28:47Z","Content":"\n\u003Cp\u003EWell ladies and gentlemen, I don\u0027t want to be annoying but I think I\u0027m right when I say that this is a period of careless about updating the community, look at what\u0027s happening with ksp weekly.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-10-30T22:36:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luigi Broglio\u0022 data-cite=\u0022Luigi Broglio\u0022\u003E\u003Cdiv\u003EWell ladies and gentlemen, I don\u0027t want to be annoying but I think I\u0027m right when I say that this is a period of careless about updating the community, look at what\u0027s happening with ksp weekly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh come on, it\u0027s been delayed by a mere 24 hours just yet.\u003C/p\u003E\n"},{"CreatedByName":"Xyd","CreatedById":73520,"CreatedDateTime":"2013-10-30T22:42:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luigi Broglio\u0022 data-cite=\u0022Luigi Broglio\u0022\u003E\u003Cdiv\u003EWell ladies and gentlemen, I don\u0027t want to be annoying but I think I\u0027m right when I say that this is a period of careless about updating the community, look at what\u0027s happening with ksp weekly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh the old psychological effect of fandom and what happens when a routine stops becoming a routine...\u003C/p\u003E\u003Cp\u003EI really fail to see how a delay in the KSP weekly is going to be a period of carelessness. I\u0027ve seen this many times before with certain specific people with specific traits, its a vicious circle of Delay\u0026gt;\u0026gt;ConsumerUnhappy\u0026gt;\u0026gt;ConsumerInsultsDevs\u0026gt;\u0026gt;Repeat ...\u003C/p\u003E\u003Cp\u003ENow if turns out that KSP weekly has been done and dusted; you should bear in mind that it was a luxury and certainly not something that anyone in the community is entitled to. I really don\u0027t get the sense of entitlement when it comes to non-compulsory devblogs. Sure, if a developer turns off the lights, and nobody is home, then you can complain to your hearts content! But you\u0027ve been getting updates, snapshots of whats to come.\u003C/p\u003E\u003Cp\u003EA single delay out of the established norm of what is KSP weekly is nothing to moan about or to start throwing careless insults about.\u003C/p\u003E\n"},{"CreatedByName":"Luckless","CreatedById":3954,"CreatedDateTime":"2013-10-30T23:04:42Z","Content":"\n\u003Cp\u003EI actually tend to avoid following game development too closely. But I\u0027m 27 and generally busy with work, photography, and other projects, so game related stuff frequently goes on the back burner for months at a time.\u003C/p\u003E\u003Cp\u003EAnd honestly I kind of find it nicer now that I rarely hear updates on some of the projects I follow. Like a few things I\u0027ve bought in Kickstarter that got delayed. I had completely forgotten I bought them, and then get a cool surprise when the quiet dev pops up months later to say \u0022Hey! I finished a working beta!\u0022. I don\u0027t suffer disappointments from delays, because the only time I really hear much or pay attention is when someone points out that the new working release is out.\u003C/p\u003E\u003Cp\u003EBut yeah, community management and interaction is a really hard thing to deal with, and it is very easy to have things sour and spiral out of control if a series of things happen to go wrong at the worst times.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-10-30T23:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luigi Broglio\u0022 data-cite=\u0022Luigi Broglio\u0022\u003E\u003Cdiv\u003EWell ladies and gentlemen, I don\u0027t aant to be annoying but I think I\u0027m right when I say that this is a period of careless about updating the community, look at what\u0027s happening with ksp weekly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t jump the gun on that one. Is it anomalous? Yes. Is it indicative of a new paradigm? No one can tell at this point.\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2013-10-30T23:35:15Z","Content":"\n\u003Cp\u003EI\u0027d rather they spent their time making progress on awesome features for this already awesome game, personally.\u003C/p\u003E\u003Cp\u003EThere are a finite number of working hours in a day, would you prefer they were spent A) working on the game, or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E writing blog posts?\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-10-31T00:07:24Z","Content":"\n\u003Cp\u003ETalking about the Devs releasing images. Does anyone know what the status of Nova is? I mean he is on leave but it has almost been a year since the last update he worked on. Also the Dev page lists him as legacy. Was there ever a official announcement that he left Squad. I do not mean to start conspiracy theories but...yeah.\u003C/p\u003E\n"},{"CreatedByName":"JebIsMyHero","CreatedById":90580,"CreatedDateTime":"2013-10-31T00:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027d rather they spent their time making progress on awesome features for this already awesome game, personally.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. I can\u0027t even imagine how difficult it must be to implement all the fantastic ideas they\u0027ve got flying around in their heads! They\u0027re doing great so far and I suspect that everyone is pushing to get career mode up and running. In my view, the skeleton of the game itself is very much taking shape still, perhaps we\u0027ll get updates more often when the devs can focus more on adding content and such rather than recoding the entire game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Maxmaps","CreatedById":66172,"CreatedDateTime":"2013-10-31T00:58:36Z","Content":"\n\u003Cp\u003EWeekly\u0027s coming in a new format. Trying to get it out before the day\u0027s out, as well as a new blog on the matter.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/1049-A-Weekly-five-times-a-week%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/entries/1049-A-Weekly-five-times-a-week%21\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T01:20:46Z\u0022 title=\u002210/31/2013 01:20  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by Maxmaps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2013-10-31T01:05:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EWeekly\u0027s coming in a new format. Trying to get it out before the day\u0027s out, as well as a new blog on the matter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweetness. Thanks for the info, sir!\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2013-10-31T01:42:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EWeekly\u0027s coming in a new format. Trying to get it out before the day\u0027s out, as well as a new blog on the matter.\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/1049-A-Weekly-five-times-a-week%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/entries/1049-A-Weekly-five-times-a-week%21\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMuch appreciated, although on a scale of one to ten, with ten being \u0027the sky is falling\u0027, a delay on the weekly comes in about 0.2\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}