{"TopicId":50831,"ForumId":55,"TopicTitle":"Curved solar panels for curved surfaces","CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-10-27T18:00:26Z","PageNum":1,"Articles":[{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-10-27T18:00:26Z","Content":"\n\u003Cp\u003Ethis is an idea that came to me after looking at the light up windows in LLL\u0027s part pack\u003C/p\u003E\u003Cp\u003Ethe basic idea behind this is to have solar panels that are curved so that they can wrap around fuel tanks and lander cans without lowering fps from attaching dozens of singular solar panels onto miscellaneous parts. \u003C/p\u003E\u003Cp\u003Eif this is a good idea post below\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2013-10-27T18:15:35Z","Content":"\n\u003Cp\u003ESounds like a good idea. It\u0027s definitely possible. YARD aerospace has made a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/44273-0-21-x-YARD-Aerospace-Pack-%280-12%29\u0022 rel=\u0022external nofollow\u0022\u003Ecargo bay with built-in solar panels\u003C/a\u003E, so I don\u0027t see why not. I think it\u0027s something for a mod though. Since Kerbal Space Program is in it\u0027s alpha stages more parts don\u0027t seem to be a huge priority.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2013-10-27T18:16:28Z","Content":"\n\u003Cp\u003EIf tweakables ever get added maybe it would be possible to have surface panels as a an option on fuel tanks? Treat them as one part with the tank, kill two birds with one stone so to speak. The downside could be that they\u0027re a bit heavier and more fragile as far as impact damage goes than regular fuel tanks. Also would be a good option for wings IMO.\u003C/p\u003E\n"},{"CreatedByName":"pizzaoverhead","CreatedById":26349,"CreatedDateTime":"2013-10-27T19:40:53Z","Content":"\n\u003Cp\u003EThis is a good idea. Curved solar panels have been common on satellites since the early days of space communications.\u003C/p\u003E\u003Cp\u003ECourier 1B, the world\u0027s first active repeater satellite:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://4.bp.blogspot.com/_8ggXDemZk8Y/TKmYfm4uLPI/AAAAAAAAAQo/OlQHVhpVh4Q/s1600/tamrc_10_2.jpg\u0022 alt=\u0022tamrc_10_2.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-10-30T00:32:15Z","Content":"\n\u003Cp\u003Eyou know this can also extend to having maybe even procedural solar panels although they would be just normal non sun tracking panels it would still be cool right?\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-30T00:35:35Z","Content":"\n\u003Cp\u003EIntegrating it into the tank might work, but it seems like just having a curved part might not work since there are different diameters and sizes, especially with command modules.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-10-30T01:49:07Z","Content":"\n\u003Cp\u003Ei know but there can be just different sizes for different stuff or even implement procedural solar panels if necessary\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-10-30T02:07:26Z","Content":"\n\u003Cp\u003EI wonder why only HTV uses it in real life, while ATV and other capsules use normal \u0022wing\u0022 solar arrays.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/c/cc/HTV_after_grapple.jpg\u0022 alt=\u0022HTV_after_grapple.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-10-30T02:32:23Z","Content":"\n\u003Cp\u003EStrictly speaking, none of the examples shown so far are truly \u0022curved\u0022 solar panels - they are simply lots of tiny flat silicon-based panels affixed in varying orientations onto a curved surface.\u003C/p\u003E\u003Cp\u003ETrue flexible thin-film PV technology is still very much in the experimental / prototype stages, and currently lack the resilience to withstand the rigors of launch.\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2013-10-30T09:24:25Z","Content":"\n\u003Cp\u003EThere\u0027s no curved solar panel IRL, they\u0027re just clusters of small panels. If we do that in KSP, a 0.5t satellite may cost 200 parts. But we can have a (one-part) curved solar panel array\u003C/p\u003E\n"},{"CreatedByName":"Zamaszysty","CreatedById":63306,"CreatedDateTime":"2013-10-30T09:46:51Z","Content":"\n\u003Cp\u003ESpeaking of different solar panel shapes:\u003C/p\u003E\u003Cp\u003EWe could use some panels designed with landers in mind like here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kidela.com/wp-content/uploads/2012/08/Mars-probe.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kidela.com/wp-content/uploads/2012/08/Mars-probe.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/images/content/181837main_phoenix-brief1-516.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/images/content/181837main_phoenix-brief1-516.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(the Phoenix lander probe)\u003C/p\u003E\u003Cp\u003Eor here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/4/4a/Mars_Polar_Lander.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/4/4a/Mars_Polar_Lander.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://thewaythetruthandthelife.net/index/2_background/2-1_cosmological/2-1-12_child-overview/mars_polar_lander.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://thewaythetruthandthelife.net/index/2_background/2-1_cosmological/2-1-12_child-overview/mars_polar_lander.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(Mars Polar Lander)\u003C/p\u003E\u003Cp\u003EThere is so much more to be done in the subcject of different solar panels for various crafts that it could take a massive amount of work to implement them all ... but of course I do agree that curved solar panels are also something that could be done. The only problem with curved solar panels is that they are not that efficient at all as 99% of the surface is never angled correctly towards the sun and as a result such curved panel never gets used in 100%. Maybe some sort of unified module that is a solar panel \u0022ring\u0022 integrated with a rircular batery into one \u0022power module\u0022 would do the trick?\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2013-10-30T09:52:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnV\u0022 data-cite=\u0022SaturnV\u0022\u003E\u003Cdiv\u003EThere\u0027s no curved solar panel IRL, they\u0027re just clusters of small panels. If we do that in KSP, a 0.5t satellite may cost 200 parts. But we can have a (one-part) curved solar panel array\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI figure collision detection could perhaps be disabled for the OX-STAT solar panels and other flat parts. That way they will have much less impact on physics performance and we could actually afford having dozens on a satellite. I mean, who doesn\u0027t love the deep blue look of solar panels covering every square centimetre of their craft\u0027s surface? Just an idea to be perhaps expanded upon, of course, I\u0027m sure there are situations where this does not make sense and would be undesirable...\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-10-30T12:29:27Z","Content":"\n\u003Cp\u003Emight as well have the solar panels painted on but that is a bit OP\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-30T12:35:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Emight as well have the solar panels painted on but that is a bit OP\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about you but surface space is at a premium on many of my landers now that I cover them in science. It might be an interesting step between extendable solar panels and 1 static one, but I think it might be fairly difficult to do. Set curves generally don\u0027t seem too friendly when you have so many things that are different shapes.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-10-30T15:26:53Z","Content":"\n\u003Cp\u003EMaybe a modified procedural Fairing mod could make them Procedural too?\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2013-10-30T15:45:42Z","Content":"\n\u003Cp\u003EWhy not just arrange the static surface attach panels in a circle, then rotate them so that they aren\u0027t any gaps in between them?\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-30T19:21:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003EWhy not just arrange the static surface attach panels in a circle, then rotate them so that they aren\u0027t any gaps in between them?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat has the issue of high part count.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2013-10-31T14:45:37Z","Content":"\n\u003Cp\u003EAt some point, high part count is always going to be an issue. \u003C/p\u003E\u003Cp\u003EBesides, its only aesthetic. If you have a problem with high part count, use the solar panels that rotate to face the sun, or use rtgs. Using curved solar panels also has the issue of high part count if you wrap the entire vessel in them, which you don\u0027t need to do.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-11-21T03:06:10Z","Content":"\n\u003Cp\u003Eagain how about a paint tool that instead of using parts it changes the textures into solar panels with a high cost per meter and a increase in weight\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-21T03:30:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eagain how about a paint tool that instead of using parts it changes the textures into solar panels with a high cost per meter and a increase in weight\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaterials that can be painted on a surface and magically turn into working solar panels do exist in real life, but they are currently limited to a laboratory setting, and as always, it will be many (uncertain) years before the technology could possibly be commercialized. Besides, \u003Ca href=\u0022http://www.popsci.com.au/science/energy/paint-your-roof-with-working-solar-cells-made-from-grass-clippings\u0022 rel=\u0022external nofollow\u0022\u003Ecurrent state-of-the-art efficiency of sunlight-to-electricity conversion via this paint-on method is barely 0.1%\u003C/a\u003E, in contrast to the rigid solar cells used in real spaceflight, which are up to 40% efficient.\u003C/p\u003E\u003Cp\u003EEven if we assume Kerbals are a few years more advanced than humans, there is the problem of how to actually implement them in-game. KSP\u0027s solar panels work by checking how much of sunlight falls on a special \u0022suncatcher\u0022 transform, dubbed raycastTransformName; for a paint-on PV surface to have even basic coverage at all angles you would need to generate a very large number of these object transforms over the painted area, all perpendicular to the curved surface. \u003C/p\u003E\u003Cp\u003EHow do you propose the software generate all these transforms dynamically with user input? How would you store the transforms and properties for each craft? How would you deal with discontinuities / edges / no-paint areas?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-21T03:34:31Z\u0022 title=\u002211/21/2013 03:34  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 21, 2013\u003C/time\u003E by sumghai\u003C/strong\u003E\n\u003C/span\u003E\n"}]}