{"TopicId":50911,"ForumId":34,"TopicTitle":"[1.3] Kerbal Joint Reinforcement v3.3.3 7/24/17","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-28T08:04:32Z","PageNum":13,"Articles":[{"CreatedByName":"Prowler_x1","CreatedById":78175,"CreatedDateTime":"2013-11-11T18:32:38Z","Content":"\n\u003Cp\u003EAfter installing KJR 1.4.1 I am loosing mouse clicking abilities in the SPH, VAB and Space Center. I can roll back to the main menu using exit button. when I get there, nothing responds to mouse clicks, I have to Alt\u002BEnter to X out of the game and reload. Is anyone else suffering from this? I went back to KJR 1.3 and do not suffer from this. The error presents it self after about 20 minutes of SPH or VAB assembly.\u003C/p\u003E\u003Cp\u003EIs anybody else experiencing this? \u003C/p\u003E\u003Cp\u003EIs this error related in any way to KJR? (I saw this problem before in KSP 0.21.1 and B9).\u003C/p\u003E\u003Cp\u003ECan anybody help me understand whats going on? (I may be exceeding 32 bit limits or something else.)\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-11-11T18:43:05Z","Content":"\n\u003Cp\u003EAnything in the erorr log? Also, try launching and immediately reverting to editor when that happens - I had a similar issue before KJR even existed, and that workaround helps with it.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-11T18:44:22Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Prowler_x1: \u003C/strong\u003EKJR doesn\u0027t do anything in the editor, and so it can\u0027t be the cause. It\u0027s an issue with either the stock game or another mod.\u003C/p\u003E\n"},{"CreatedByName":"Captain_Party","CreatedById":59820,"CreatedDateTime":"2013-11-11T22:32:42Z","Content":"\n\u003Cp\u003EDoes this mod conflict with anything? Because I have been using the Module Manager wildcard, and this mod doesn\u0027t seem to be doing its job... is there any way around this? (Other than deleting the wildcard, and if not, any other way to implement MJ into all pods and probes?)\u003C/p\u003E\n"},{"CreatedByName":"psistorm","CreatedById":67537,"CreatedDateTime":"2013-11-12T01:51:31Z","Content":"\n\u003Cp\u003EI\u0027ve been having a bit of an issue with this mod as well, which strangely doesn\u0027t seem to make things overall better, it just changes one problem into another. Rather than the parts wobbling by turning, they wobble a bit by sliding when I use the mod. Upping the linear drive spring/damper doesn\u0027t seem to have any effect that I can notice. So far I tested some kw rocketry 1.25m parts (just the standard tanks in all sizes), their 2.5m, and some b9 aerospace ones (the shuttle style series with cargo bay). all of them seem to slide rather than bend, but especially on planes the sliding wobble causes the same instability.\u003C/p\u003E\u003Cp\u003EI will play around more and see what I can find though\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-12T02:41:40Z","Content":"\n\u003Cp\u003EThe \u003Cstrong\u003E1.4.2 revision\u003C/strong\u003E is out, which fixes some wobbliness, though I suspect it may cause other issues. You can only get it from spaceport for now though, since mediafire is down.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@psistorm: \u003C/strong\u003EIf the current version doesn\u0027t fix it, try upping the \u0022max force\u0022 values and see if that helps.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Captain_Party: \u003C/strong\u003EI\u0027m not aware of any hard conflicts with this mod, though it tends to not like stretchy tanks a bit and causes them to spaz out and break. See if the current version fixes your issue.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-12T05:42:36Z","Content":"\n\u003Cp\u003Eferram, regarding the heat shield, asmi noticed that breaking force and torque weren\u0027t set. Setting them to 630 fixed the issue for him; I\u0027ll confirm on my end when I get home.\u003C/p\u003E\n"},{"CreatedByName":"Glorious Dear Leader","CreatedById":34116,"CreatedDateTime":"2013-11-12T06:47:26Z","Content":"\n\u003Cp\u003EDamn, I\u0027ve been waiting for a mod like this. It struck me as odd as to why you would design an engine mount and tank structure in such a way that it required a multitude of struts to augment their structure. Awesome stuff.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-11-12T07:04:47Z","Content":"\n\u003Cp\u003EHow exactly does this work?\u003C/p\u003E\u003Cp\u003EI know people have been requesting that SQUAD should rework the part connections, suggesting everything from \u0027invisible struts\u0027 (more part physics calculations) to a complete overhaul to a multiple node system (lots of work).\u003C/p\u003E\u003Cp\u003EHow does this mod achieve it?\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-11-12T07:12:50Z","Content":"\n\u003Cp\u003EIt replaces every default \u0027fixed joint\u0027 which has its properties in a black box and mostly but not quite does the right thing, with a joint with manually configured parameters based on part size and whatnot. For decouplers and launch clamps it does also create \u0027invisible struts\u0027 that span the decoupler and connect parts on either side to each other, as a workaround for the issue of a tiny light decoupler connecting big heavy tanks.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-12T08:17:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Eferram, regarding the heat shield, asmi noticed that breaking force and torque weren\u0027t set. Setting them to 630 fixed the issue for him; I\u0027ll confirm on my end when I get home.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I use this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E@PART[*]:HAS[#module[Part],~breakingForce[]]\u003Cbr\u003E{\u003Cbr\u003E\tbreakingForce = 1000\u003Cbr\u003E}\u003Cbr\u003E@PART[*]:HAS[#module[Part],~breakingTorque[]]\u003Cbr\u003E{\u003Cbr\u003E\tbreakingTorque = 1000\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E*Requires either ModuleManager 1.3 \u0026amp; Sarbian\u0027 MM Extensions OR ModuleManager 1.5\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EYeah, the PART[*] and module[Part] are redundant; that\u0027s a holdover from when Sarbian\u0027s extensions were bugged and applying the patch to all nodes, not just PART nodes. Probably could take that out. Might speed startup a bit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T08:19:51Z\u0022 title=\u002211/12/2013 08:19  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by Starwaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ratzap","CreatedById":75982,"CreatedDateTime":"2013-11-12T23:44:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Eferram, regarding the heat shield, asmi noticed that breaking force and torque weren\u0027t set. Setting them to 630 fixed the issue for him; I\u0027ll confirm on my end when I get home.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was having problems with a chunk of a large station where I had a dock senior at the bottom and about 90t of station on top. It kept on breaking at the join between the senior and the tank above it. The part.cfg for the senior had no breakingforce or torque set so I put them in at 600 which at least stops it instantly snapping.\u003C/p\u003E\u003Cp\u003EMaybe it would be an idea to add some sensible default value if they have missing standard parameters as there seem to be a fair number of them.\u003C/p\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-11-13T13:00:15Z","Content":"\n\u003Cp\u003EDoes this work with B9 parts cause my plane still tends to wobble a lot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wGkJQuy.jpg\u0022 alt=\u0022wGkJQuy.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-13T14:05:12Z","Content":"\n\u003Cp\u003EI believe it does; my B9 planes seem to have less of that problem since I installed it. I only tend to use the Mk2 size though.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-11-13T14:13:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SnappingTurtle\u0022 data-cite=\u0022SnappingTurtle\u0022\u003E\u003Cdiv\u003EDoes this work with B9 parts cause my plane still tends to wobble a lot.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame thing happens with my B9 craft. They seem a lot sturdier, but they wobble like crazy during maneuvers. It has to be noted that the same thing as in your screenshot(displacement of segments) happens when no struts are present. I haven\u0027t tried strutting segments at all, because I thought KJR works fine on aircraft too.\u003C/p\u003E\u003Cp\u003EAlso, another issue is my post in the Procedural fairings thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/39512-0-22-Procedural-Fairings-2-4-2-tech-tree-and-minor-improvements-%28Oct-19%29?p=776527\u0026amp;viewfull=1#post776527\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/39512-0-22-Procedural-Fairings-2-4-2-tech-tree-and-minor-improvements-%28Oct-19%29?p=776527\u0026amp;viewfull=1#post776527\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd I am using the latest version of KJR \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CheesySquid279","CreatedById":67883,"CreatedDateTime":"2013-11-13T17:15:41Z","Content":"\n\u003Cp\u003EHi! I am making a modpack of mods that improve the stock KSP experience! I was wondering if it would be possible to add your mod into the pack?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-13T20:30:43Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@SnappingTurtle \u0026amp; smunisto: \u003C/strong\u003EI\u0027ve noticed that, and I\u0027ve been trying to fix it. See if a previous version happens to fix it (there\u0027s a link to a mediafire folder on the front page) or if you can fix it by increasing the max force parameters in the config.xml.\u003C/p\u003E\u003Cp\u003EI think the issue has to do with how heavy the B9 parts are compared to other parts.\u003C/p\u003E\u003Cp\u003Eedit: Further investigation indicates that it only happens with very, very heavy crafts or crafts under very heavy loads; basically, some flexing should be expected there. I was only able to cause dramatic flexing like in the image by buffing the SABRE engines heavily and then severely overspeeding while I used full control inputs. In reality, it would have broken from those loads. With that in mind, the only solution would be to try and have the flexing dependent on the size of the part so that joints between smaller parts flex less than joints between longer parts, but that wouldn\u0027t be well received at all, since it would defeat the purpose of larger parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@CheesySquid279: \u003C/strong\u003EI\u0027d prefer if you didn\u0027t, because then that gets into versioning problems. If I release a new version and you aren\u0027t up-to-date on making sure that the pack contains the most recent version, then people will continue to suffer from already-fixed issues, and then they\u0027ll all show up here to complain, and I\u0027ll have to tell them to download the most recent version from here. It\u0027s more hassle than it\u0027s worth, for everyone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-13T21:38:31Z\u0022 title=\u002211/13/2013 09:38  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 13, 2013\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-11-13T21:33:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E...people will continue to suffer from already-fixed issues, and then they\u0027ll all show up here to complain...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpeaking of which the problem I mentioned seems to have been fixed by downloading the latest version. I should have done that first but I don\u0027t have enough RAM for all the mods I have, which means the game can be extremely slow with all the page file operations, which often leads me to posting before I\u0027ve checked all the usual solutions.\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-11-13T22:04:45Z","Content":"\n\u003Cp\u003EI\u0027ll admit to having mulled over the thought of a package-manager style mod handling system. Compare e.g. Ruby gems, Node.js\u0027 NPM, and the excellent APT system for Debian-derived Linuxen. A package system that will download and install your desired mods, making sure to get the latest versions, the right DLLs, etc. Tracking dependencies between things, allowing mod makers to depend on other mods, like when B9 needs Firespitter\u0027s DLL, or FAR requires ModuleManager.dll. I wonder if such a system would be possible to get people on board with.\u003C/p\u003E\n"},{"CreatedByName":"SnappingTurtle","CreatedById":69795,"CreatedDateTime":"2013-11-13T22:15:11Z","Content":"\n\u003Cp\u003E@Autochton\u003C/p\u003E\u003Cp\u003EI\u0027m sure I\u0027m not the only one waiting for something like that. As long as it\u0027s not too much hassle to actually use.\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-11-14T08:27:10Z","Content":"\n\u003Cp\u003EThe main issue would be modder support. Today, mods are packed in a hundred different ways, and programmatically sussing out what\u0027s contained within each is... a trick. Not an impossible one - if they have a GameData folder, for example, that helps. But the packages would pretty much need to be formatted a certain way for it to work reliably. Which leads to questions of licensing and databases of mods...\u003C/p\u003E\u003Cp\u003EAnyhow, this thread isn\u0027t the place for this discussion. Just wanted to air that thought. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cleric2145","CreatedById":73281,"CreatedDateTime":"2013-11-15T10:12:24Z","Content":"\n\u003Cp\u003EI really liked how solid everything was in 1.0, but with 1.4.1, everything felt significantly less sturdy than I liked, especially docking ports. They wobble and slide about, making it very tricky to dock if you\u0027re not perfectly aligned and slide straight into the port. I\u0027m just now installing 1.4.2 so maybe this will improve my situations a bit. \u003C/p\u003E\u003Cp\u003EA changelog in the first post would be fantastic, since it\u0027s a trick to find your latest post to judge if I want to update or not. (E.g. if you remove something that I liked, or change some things that I want to look for to see the difference.) I know there\u0027s a changelog in the readme, but a simply copy/paste to the first post would be greatly appreciated. \u003C/p\u003E\u003Cp\u003EThanks for all your work!\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-11-15T10:40:53Z","Content":"\n\u003Cp\u003EVersions prior to 1.3 are a bit buggy, they tend to cause the launchpad to like your rockets so much it just won\u0027t let them go. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-15T16:14:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003EVersions prior to 1.3 are a bit buggy, they tend to cause the launchpad to like your rockets so much it just won\u0027t let them go. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Epre-1.3 versions liked to rickroll you.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-15T18:50:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Cleric2145: \u003C/strong\u003EI put the changelog into the title post. The joint max forces were calculated wrongly in v1.4.1, so v1.4.2 should fix things for you.\u003C/p\u003E\n"}]}