{"TopicId":50914,"ForumId":39,"TopicTitle":"Experiments In Warfare - A KSP Mod Heaven","CreatedByName":"AcheronLP","CreatedById":90484,"CreatedDateTime":"2013-10-28T08:48:09Z","PageNum":1,"Articles":[{"CreatedByName":"AcheronLP","CreatedById":90484,"CreatedDateTime":"2013-10-28T08:48:09Z","Content":"\n\u003Cp\u003EHello, everyone! My name is Acheron (If you could not tell already by my name.) I do Youtube videos, and for a while, was doing Kerbal Space Program... until I lost all the files. \u003C/p\u003E\u003Cp\u003ESo, I\u0027m back, with mods in tow, and a grim understanding of how they... MOSTLY work.\u003C/p\u003E\u003Cp\u003ESay hello to Experiments in Warfare! The Intro is WIP, just thought I would mention that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=sZdYewqFdUA\u0026amp;feature=youtu.be\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=sZdYewqFdUA\u0026amp;feature=youtu.be\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBackstory: Six years ago, a strange starship of unknown origins \u0022sort of\u0022 crashed onto Kerbin, right into the territory of one of three factions based on Kerbin:\u003C/p\u003E\u003Cp\u003EThe kings of the skies, the Acher Allied States.\u003C/p\u003E\u003Cp\u003ERulers of technology, the United Kerbal Republic.\u003C/p\u003E\u003Cp\u003EMasters of heavy weaponry, the Syndicate Empire.\u003C/p\u003E\u003Cp\u003EWith the arrival of the strange ship, it has forced the small, fledgling nation of the Acher Allied States to play their hand early in what had turned into a very long, arduous cold war on the planet of Kerbin. With war rearing its ugly head, and kerbals from the other factions closing in, will the crew of the downed spacecraft accept the help?\u003C/p\u003E\u003Cp\u003E(It is inspired by World War K, one of my favourite series. My computer is not very beefy, so if the video has lag in it, computer lag, not streaming lag.)\u003C/p\u003E\u003Cp\u003EIf there is any criticism you guys have, please, tell me now. I always want to improve. I\u0027m currently working on editing skills. As I said, the intro is VERY MUCH WIP. I wasn\u0027t very enthusiastic because I was doing those lines off the top of my head, which will change in the future.\u003C/p\u003E\u003Cp\u003EAlso, in EiW, expect guns. Lots and lots of guns.\u003C/p\u003E\n"}]}