{"TopicId":50911,"ForumId":34,"TopicTitle":"[1.3] Kerbal Joint Reinforcement v3.3.3 7/24/17","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-28T08:04:32Z","PageNum":48,"Articles":[{"CreatedByName":"ModZero","CreatedById":89470,"CreatedDateTime":"2014-12-28T19:58:30Z","Content":"\n\u003Cp\u003EI put this in Sounding Rockets thread, because this only happened to me in that mod, but it\u0027s an interaction with KJR, so I\u0027ll cross-post:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ModZero\u0022 data-cite=\u0022ModZero\u0022\u003E\u003Cdiv\u003EHi there, I come bearing bugs (possibly not in this mod, though - also sorry if this is known, I didn\u0027t spot it in a search). \u003Cp\u003EIf there\u0027s \u003Ca href=\u0022https://kerbalstuff.com/mod/53/Kerbal%20Joint%20Reinforcement\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Joint Reinforcement\u003C/a\u003E installed, \u003Ca href=\u0022http://i.imgur.com/XID42Ho.png\u0022 rel=\u0022external nofollow\u0022\u003Efirst stage of a two-stage SR doesn\u0027t drop\u003C/a\u003E if there are fins attached to the first stage, but it works correctly on \u003Ca href=\u0022http://i.imgur.com/r8gmebh.png\u0022 rel=\u0022external nofollow\u0022\u003Ea rocket without these fins\u003C/a\u003E. To make things even more confusing, \u003Ca href=\u0022http://i.imgur.com/L5EgFUB.png\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E (sounding rocket with fins, but using small boosters for both stages) works properly.\u003C/p\u003E\u003Cp\u003ESorry if it\u0027s not your bug - it seems to be an interaction with KJR. \u003Ca href=\u0022https://gist.github.com/aleander/fa21e85a51a05301c951\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s a log of a single launch of the broken rocket.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT: also, I remember it happening before I upgraded KJR, but I didn\u0027t do any isolated tests back then.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-28T21:00:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI need full reproduction steps and output logs in order to address any issues. I have not sen \u003Cem\u003Eany\u003C/em\u003E issues with regards to clamps or decouplers, and nothing has changed with how they are handled at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is some stock issue with the 1-to-n adapters, especially when stages are attached radially to tanks attached to the bottom sides of the adapters, or if the adapters are used upside down. I first notices that with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51115-Ship-to-ship-kinetic-energy-transfer-test-report\u0022 rel=\u0022external nofollow\u0022\u003Ethis project\u003C/a\u003E in the version with the four missiles. Switch around the order of the four missile stages and the decouplers will not trigger.\u003C/p\u003E\u003Cp\u003EI built an all stock parts rocket in .25 with the 1-to-4 adapter then used radial decouplers to mount Kerbodyne tanks to the sides of the tanks attached to the bottom of the decoupler. Those side boosters had second tanks atop them, with the big decouplers and plenty of Sepratrons to kick them away. With the decouplers right side up it worked. Flip them upside down to drop their weight with the tanks and it all goes worng.\u003C/p\u003E\u003Cp\u003EThe same node order issue appears, not because of staging individually, but because the Kerbodyne size decouplers have Physics Signifigance set to 1 so they have no mass in flight. (Cheaty by default!) The problem also manifests when using an up-scaled version of the 1-to-n adapters to fit Kerbodyne tanks. With Physics Significance left at 1, those decouplers directly in line beneath those adapters will not all activate. One will, the next stage engines will, but the other 1, 2 or 3 big decouplers fail. *big explosion* as the engine flames destroy the decouplers.\u003C/p\u003E\u003Cp\u003ESo if you are having staging problems using the kerbodyne decoupler in anything but a single stack rocket or in an asparagus rocket where Kerbodyne size stacks are \u003Cem\u003Enot\u003C/em\u003E attached below a stock 1-to-n adapter, you need to enable Physics Significance in the Kerbodyne decoupler.\u003C/p\u003E\u003Cp\u003ESquad has kept that error in .90 and I don\u0027t know why. Those decouplers are supposed to be heavy parts that require appropriate rocket design to account for the mass, unlike struts and various other small parts. None of the other decouplers or stack separators has that setting and they cause no issues in any configuration I\u0027ve used them in.\u003C/p\u003E\u003Cp\u003EAs long as you\u0027re not trying to do sequential staging off the bottom of a 1-to-n adapter (right side up or otherwise) there shouldn\u0027t be a problem - unless by some weird thing the latest KJR is interacting with the bug in how the multi-node side of those stock adapters operates?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-28T22:02:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ModZero: \u003C/strong\u003ENah, that\u0027s on my side; I see what\u0027s happening. OnPartJointBreak doesn\u0027t fire for decoupling events, and since USI drop tanks and sounding rockets go around that, KJR doesn\u0027t clean up like it should. Dev version should have a fix.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Galane: \u003C/strong\u003EHmm... I just tried playing around with that, and I wasn\u0027t able to reproduce it. Could you throw together a small test vehicle for me to mess with? I\u0027m slightly concerned that I\u0027m missing something important in throwing it together.\u003C/p\u003E\u003Cp\u003EEdit: You know, just once I\u0027d like an x.0 release to be bug-free.\u003C/p\u003E\n"},{"CreatedByName":"NuAoA","CreatedById":122258,"CreatedDateTime":"2014-12-29T03:01:36Z","Content":"\n\u003Cp\u003EI just updated this mod along with Kerbal engineer redux, and occasionally when I drop out of a time warp too fast my ship will combust or my velocity will drop to ~0 and become unchangeable. I\u0027ve progressed pretty far through career, including several landings with the ship i\u0027m using and never had this issue until I updated.\u003C/p\u003E\u003Cp\u003EEdit: Removed KJR and the issue was gone. It was happening on a sub 6000m minmus orbit, and didn\u0027t happen until I got close to the planet. I\u0027ve also switched back to 2.4.5 and the issue is gone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T03:28:18Z\u0022 title=\u002212/29/2014 03:28  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by NuAoA\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NuAoA","CreatedById":122258,"CreatedDateTime":"2014-12-29T03:20:38Z","Content":"\n\u003Cp\u003E\nIs there a 2.4.5 version kicking around? Its not on the \u003Ca href=\u0022http://www./folder/b61tblubl6a7c/Kerbal_Joint_Reinforcement\u0022 rel=\u0022external nofollow\u0022\u003Eearlier versions list\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: its on kerbalstuff, don\u0027t ask me how I found it: [Defunct link removed by a moderator]\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-08-28T08:32:50Z\u0022 title=\u002208/28/2022 08:32  AM\u0022 data-short=\u00221 yr\u0022\u003EAugust 28, 2022\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003Elink removed\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-29T03:43:05Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@NuAoA: \u003C/strong\u003EI cannot reproduce the issue following the little information you have provided. I will need full reproduction steps, a full copy of the output log, and a full list of all mods that you have been running in order to address the issue. Less than that leaves out critical information and makes fixing the issue impossible. Why do people never provide logs?\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2014-12-29T04:08:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E Why do people never provide logs?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust for you ferram4.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://nicktoons.nick.com/videos/clip/stimpys-big-day-log-song-1.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nicktoons.nick.com/videos/clip/stimpys-big-day-log-song-1.html\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NuAoA","CreatedById":122258,"CreatedDateTime":"2014-12-29T04:31:05Z","Content":"\n\u003Cp\u003EMost likely because the average person doesn\u0027t mod ksp or have a clue about what logs you are talking about.\u003C/p\u003E\u003Cp\u003EAll of these mods plus KW Rocketry: \u003Ca href=\u0022http://i.imgur.com/qlWBhxy.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/qlWBhxy.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EZip of my save: \u003Ca href=\u0022http://www.filedropper.com/tothemun\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/tothemun\u003C/a\u003E. KSP saves compress surprisingly well (~8%!). \u003C/p\u003E\u003Cp\u003EThe ship is called something like mun lander mk2 and is orbiting minmus.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-29T04:34:10Z","Content":"\n\u003Cp\u003EThe save doesn\u0027t help me, I\u0027m not able to derive what went from from that, nor am I sure that I can get the exact install that you have there (maybe some things aren\u0027t updated, who knows).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003EFollow this\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"NuAoA","CreatedById":122258,"CreatedDateTime":"2014-12-29T05:06:06Z","Content":"\n\u003Cp\u003EHeres the log, but as a heads up, I never saved the game after it happened and i\u0027ve revered back to 2.4.5 and continued on since.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/outputlog_5\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/outputlog_5\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs to how to recreate it, I gave you as much detail as I could. The ship does involve some oddly placed and/or overlapping parts, so if you could get it loaded from the save (Its saved as a VAB ship in there, \u0027mun lander mk2\u0027) that would be your best chance at recreating it. Everything went fine with the launch/transfer to minimus, and once I got close to the planet (~6000m periapsis) it would blow when I dropped out of timewarp.\u003C/p\u003E\u003Cp\u003EEvery mod on that list is the newest version, except realchute and KAC, which are probably 1 version behind.\u003C/p\u003E\u003Cp\u003EEdit: the only other tidbit was that the first collision occurred on a decoupler, the up13 decoupler from deadly reentry I think, otherwise it was the stock tt-38k. And I only checked what caused it once, so those might just be random parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T05:15:50Z\u0022 title=\u002212/29/2014 05:15  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by NuAoA\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-29T06:22:00Z","Content":"\n\u003Cp\u003EHere\u0027s an all stock test craft demonstrating the sequential staging bug in the stock 1-to-4 adapter. \u003Ca href=\u0022http://pastebin.com/dA1Prjny\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/dA1Prjny\u003C/a\u003E Saved in .25, tested in .25 and .90 to verify the bug in both versions. \u003C/p\u003E\u003Cp\u003ESwap the positions of any two stages in the stack in the VAB and all four will fire correctly. Leave it as it is and the second stage will not activate the engine. It doesn\u0027t affect Sepratrons, just liquid fuel engines. I just tested it many times in both KSP versions to verify that swapping *any two* stage stack positions will have the probes launching in the assigned order while leaving it as-built causes the second probe\u0027s engine to fail to activate.\u003C/p\u003E\u003Cp\u003EWhy? I dunno. Bugs tend to be that way. Tricky bastards. Been there since at least .21, which is the first version I used and when I noticed this problem. If it can be fixed by making changes to the cfg files for those adapters, then I\u0027ll apply that to the ReStock part. Fixing the original? That\u0027s up to Squad, or individuals to do on their own if a fix is found.\u003C/p\u003E\u003Cp\u003EIf you want, I can re-build a sure-fire-fail rocket with all stock parts, using Kerbodyne stacks hung off the sides of small stacks below this quad adapter. But it will only exhibit the failure if the Kerbodyne decoupler has the Physics Significance = 1 line left active. Should also be able to replicate the partial stage separation failure with the massless Kerbodybe separator used below the Bigger, Beastlier adapters. \u0027Course those issues are easily fixed by removing the physics line.\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2014-12-29T21:49:25Z","Content":"\n\u003Cp\u003EWell, this seems to be broken. Trying to launch a tantares station from the Kosmodrome (kerbal konstructs thing) pad using the ALV launch vehicle, I could not use launch clamps as when staged they acted as if detached in functionality, but did not animate and remained attached to the rocket. Flying without clamps, once I staged away Block A, the command module tore itself away from the ship. I have no idea why it is acting up, but I suspect it has something to do with the multipart joints for the command module tearing away, and it seems as if KJR isnt considering the clamps detached when I stage or something like that.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-29T22:02:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@NuAoA: \u003C/strong\u003EI haven\u0027t been able to reproduce it in the latest build, even while coming out of high timewarp at ridiculous velocities near Minmus. I suspect another mod is to blame.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Galane: \u003C/strong\u003EAh, I see. Yay, stock bugs. I\u0027m not exactly sure how to fix it, tbh.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@mike9606: \u003C/strong\u003ENo output log, no support. I have been unable to reproduce the issue on my build, so I will need full reproduction steps using as few mods as possible. If it is due to KJR, you should be able to cause it with \u003Cem\u003Eno\u003C/em\u003E other mods.\u003C/p\u003E\u003Cp\u003EAnyway, \u003Cstrong\u003EKJR v3.0.1\u003C/strong\u003E is out, fixing some of the new multipart joint shenanigans, particularly with USI drop tanks and sounding rockets.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-12-30T06:08:10Z","Content":"\n\u003Cp\u003EThought I\u0027d give a heads up, it seems if you have a ship already launched updating this will cause it to rip itself apart or otherwise do really weird things like self propelling itself under torque somehow. Reverting back to 2.4.5 does correct it for continued play so landing / disposing of current flights before installing 3.0.1 seems to be advisable. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-30T06:11:01Z","Content":"\n\u003Cp\u003EWait, all of the reports require already-existing ships? If that\u0027s the case, why didn\u0027t anyone else mention that? That could be really important!\u003C/p\u003E\u003Cp\u003EBut KJR doesn\u0027t save anything that could be reloaded anyway... so what?! How?\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-12-30T06:18:38Z","Content":"\n\u003Cp\u003EWeirdness seems to be KSP\u0027s stock in trade \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Don\u0027t know about anyone else, but 3 loads with 3.0.1 all caused existing ship sadness (crashed out to prevent saving) but reloading after reverting to 2.4.5 allows everything to continue as usual first try.\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2014-12-30T06:31:48Z","Content":"\n\u003Cp\u003EI haven\u0027t been able to triage fully... but weirdness for me involves the tiny cubic frame part or the tiny octagon shaped frame part. I\u0027ve had a few rockets with those which would not lift off as one or more of those parts were welded to the universe (turned into immovable objects). Possibly only bugs out if I start stacking them.\u003C/p\u003E\u003Cp\u003EBut not 100% that it\u0027s KJR doing it, so might be a useless lead.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-30T07:35:40Z","Content":"\n\u003Cp\u003E@WuphonsReach Do these craft by any chance happen to include any TR-38-D? NASAmission/parts/size3decoupler Open the CFG and insert // in front of the Physics Significance line or change the 1 to a 0. Your crafts using that will gain a bit of weight but the flipping weirdness sometimes caused by having such a large part \u0022massless\u0022 in flight will go away. None of the other separators or decouplers have that setting, I dunno why Squad put that in the TR-38-D.\u003C/p\u003E\u003Cp\u003EYes, KSP seems to revel a bit in weirdness. When I was testing my assemble-on-site Gilly refueling lander it suddenly developed an aversion to having Quantum Struts aimed at some parts that had never given trouble before - and this was one day to the next in the same install, probably some funky interaction with one or more other mods recently updated.\u003C/p\u003E\u003Cp\u003EWas a real hair puller figuring out why the thing suddenly was spinning out of control or wouldn\u0027t maneuver correctly and would rip itself apart when hyperedited to Gilly orbit. Took off two QStruts and the problem went away.\u003C/p\u003E\u003Cp\u003EStill waiting on some mods to get sorted out for .90 so I\u0027ve been working a bit on ReStock updates and fixes.\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2014-12-30T07:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EWait, all of the reports require already-existing ships? If that\u0027s the case, why didn\u0027t anyone else mention that? That could be really important!\u003Cp\u003EBut KJR doesn\u0027t save anything that could be reloaded anyway... so what?! How?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounded easy enough to test and try reproducing, so I tried the following to see if KJR v3.0.1 would blow up a pre-existing stock Kerbal X:\u003C/p\u003E\u003Cp\u003E1. Made a new blank sandbox save.\u003C/p\u003E\u003Cp\u003E2. Launched a Kerbal X under pure stock, no mod (not even KJR) environment into a stable orbit.\u003C/p\u003E\u003Cp\u003E3. Exited KSP and installed KJR.\u003C/p\u003E\u003Cp\u003E4. Booted up KSP (with KJR installed) and loaded up the save with the Kerbal X.\u003C/p\u003E\u003Cp\u003E5. Switched to it through the Tracking Station.\u003C/p\u003E\u003Cp\u003E6. KJR did its magic.\u003C/p\u003E\u003Cp\u003E7. Nothing out of the ordinary happened.\u003C/p\u003E\u003Cp\u003EThe end result was that KJR \u003Cstrong\u003Edid not\u003C/strong\u003E do anything bad or not intended to a pre-existing Kerbal X, in an environment where no other mods were at play.\u003C/p\u003E\u003Cp\u003EThe logs, even though I doubt they\u0027ll be interesting:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://rpgmaker.net/media/content/users/6088/locker/PreKJR_output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rpgmaker.net/media/content/users/6088/locker/PreKJR_output_log.txt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://rpgmaker.net/media/content/users/6088/locker/PostKJR_output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rpgmaker.net/media/content/users/6088/locker/PostKJR_output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-12-30T08:14:31Z","Content":"\n\u003Cp\u003EThat did not test upgrading from KJR 2.4.5 to 3.0.1 so did not attempt to reproduce the problem.\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2014-12-30T08:34:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeffreyCor\u0022 data-cite=\u0022JeffreyCor\u0022\u003E\u003Cdiv\u003EThat did not test upgrading from KJR 2.4.5 to 3.0.1 so did not attempt to reproduce the problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I missed that part. My bad, will go and test that (and edit this post once I get something post-worthy). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E---EDIT---\u003C/p\u003E\u003Cp\u003EMod present: KJR 2.4.5 -\u0026gt; 3.0.1\u003C/p\u003E\u003Cp\u003ESteps to reproduce:\u003C/p\u003E\u003Cp\u003E1. Made a new blank sandbox save, KJR 2.4.5 installed.\u003C/p\u003E\u003Cp\u003E2. Launched Kerbal X to orbit.\u003C/p\u003E\u003Cp\u003E3. Exited, deleted KJR 2.4.5, installed KJR 3.0.1.\u003C/p\u003E\u003Cp\u003E4. Booted up KSP after KJR 3.0.1 install, loaded save with Kerbal X in orbit.\u003C/p\u003E\u003Cp\u003E5. Switched to Kerbal X via Tracking Station.\u003C/p\u003E\u003Cp\u003E6. KJR did its magic.\u003C/p\u003E\u003Cp\u003E7. Nothing out of the ordinary happened.\u003C/p\u003E\u003Cp\u003EThe end result was that, once again, KJR \u003Cstrong\u003Edid not\u003C/strong\u003E do anything bad or not intended to a pre-existing Kerbal X, in an environment where no other mods were at play.\u003C/p\u003E\u003Cp\u003EThe logs:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://rpgmaker.net/media/content/users/6088/locker/245_output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rpgmaker.net/media/content/users/6088/locker/245_output_log.txt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://rpgmaker.net/media/content/users/6088/locker/301_output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rpgmaker.net/media/content/users/6088/locker/301_output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ErrHead","CreatedById":131678,"CreatedDateTime":"2014-12-30T09:01:54Z","Content":"\n\u003Cp\u003EWith the new version of KJR my rockets have every joint fail as soon as KJR initializes physics, resulting in every part falling down individually and exploding on the pad.\u003C/p\u003E\u003Cp\u003EI run realism overhaul on KSP 0.90 linux x64 (on debian wheezy). The rockets in question do happen to be very large, my goal is usually around 1000 metric tons to LEO per launch, but everything worked and works just fine with KJR v2.4.5\u003C/p\u003E\u003Cp\u003EI tried reinstalling KJR manually instead of through CKAN, nothing changed.\u003C/p\u003E\u003Cp\u003EOutput.log:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/q72myl45gtclma8/Player.log.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/q72myl45gtclma8/Player.log.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is another log with KJR\u0027s debug option turned on:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/h64enuif1al45f3/Player.log2.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/h64enuif1al45f3/Player.log2.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is the same log, with debug on, but from version 2.4.5 where my rocket does not automatically disassemble.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/my657v4mart6srs/Player.log2.4.5.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/my657v4mart6srs/Player.log2.4.5.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGamedata:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EGameData/\u003Cbr\u003E000_Toolbar\u003Cbr\u003EActiveTextureManagement\u003Cbr\u003EAIES_Aerospace\u003Cbr\u003EAJE\u003Cbr\u003EAmbientLightAdjustment\u003Cbr\u003Eblackheart\u003Cbr\u003EBobCatind\u003Cbr\u003EChatterer\u003Cbr\u003ECollisionFX\u003Cbr\u003ECrossFeedEnabler\u003Cbr\u003ECustomBiomes\u003Cbr\u003EDDSLoader\u003Cbr\u003EDeadlyReentry\u003Cbr\u003EDistantObject\u003Cbr\u003EDMagic Orbital Science\u003Cbr\u003EEditorExtensions\u003Cbr\u003EEngineGroupContoller\u003Cbr\u003EEnvironmentalVisualEnhancements\u003Cbr\u003EFASA\u003Cbr\u003EFerramAerospaceResearch\u003Cbr\u003EFirespitter\u003Cbr\u003EFreedomTex\u003Cbr\u003EImprovedChaseCamera\u003Cbr\u003EJSI\u003Cbr\u003EKAS\u003Cbr\u003EKerbalJointReinforcement\u003Cbr\u003EKlockheed_Martian\u003Cbr\u003EKlockheed_Martian_SmartParts\u003Cbr\u003EKSP-AVC\u003Cbr\u003EMechJeb2\u003Cbr\u003EModuleRCSFX\u003Cbr\u003ENASAmission\u003Cbr\u003ENavyFish\u003Cbr\u003ENearFutureConstruction\u003Cbr\u003ENearFutureSolar\u003Cbr\u003ENEBULA\u003Cbr\u003ENothkeSerCom\u003Cbr\u003EPlanetShine\u003Cbr\u003EProceduralFairings\u003Cbr\u003EProceduralParts\u003Cbr\u003ERCSBuildAid\u003Cbr\u003ERealChute\u003Cbr\u003ERealFuels\u003Cbr\u003ERealismOverhaul\u003Cbr\u003ERealSolarSystem\u003Cbr\u003ERemoteTech\u003Cbr\u003ERLA_Stockalike\u003Cbr\u003ERN_R7\u003Cbr\u003ERN_Soviet_Probes\u003Cbr\u003ERSSTextures\u003Cbr\u003ERVE\u003Cbr\u003ESCANsat\u003Cbr\u003ESmokeScreen\u003Cbr\u003ESpace Factory\u003Cbr\u003ESquad\u003Cbr\u003EStretchySNTextures\u003Cbr\u003ETextureReplacer\u003Cbr\u003EThunderAerospace\u003Cbr\u003ETriggerTech\u003Cbr\u003ETweakScale\u003Cbr\u003EVNG\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E61 directories\u003Cbr\u003E\u003Cbr\u003EAVC Output:\u003Cbr\u003EKSP: 0.90 (Unix) - Unity: 4.5.5f1 - OS: Linux 3.2 Debian 7.7 64bit\u003Cbr\u003EAmbient Light Adjustment - 1.3.1.1\u003Cbr\u003EChatterer - 0.8.0.86\u003Cbr\u003EDMagic Orbital Science - 0.9.1\u003Cbr\u003EEditor Extensions - 2.5\u003Cbr\u003EFerram Aerospace Research - 0.14.6\u003Cbr\u003ERasterPropMonitor - 0.18.3\u003Cbr\u003EKSP-AVC Plugin - 1.1.5\u003Cbr\u003EKerbal Joint Reinforcement - 2.4.5\u003Cbr\u003EPlanetShine - 0.2.2.1\u003Cbr\u003EProcedural Parts - 0.9.21\u003Cbr\u003ERCS Build Aid - 0.5.4\u003Cbr\u003ERealChute - 1.2.6.3\u003Cbr\u003ERealSolarSystem - 8.5\u003Cbr\u003ERealismOverhaul - 7.0.4\u003Cbr\u003ERemoteTech - 1.5.2\u003Cbr\u003ESCANsat - 1.0.8.1\u003Cbr\u003ETextureReplacer - 2.1.2\u003Cbr\u003ETAC Life Support - 0.10.1.1320\u003Cbr\u003ETransfer Window Planner - 1.2.2\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EScreenshot of the rocket featured in my logs (in version 2.4.5):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/2jTht7m\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/2jTht7m\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2jTht7ml.png?1\u0022 alt=\u00222jTht7ml.png?1\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERepro steps:\u003C/p\u003E\u003Cp\u003EInstall KJR 3 or 3.0.1\u003C/p\u003E\u003Cp\u003ELoad my save\u003C/p\u003E\u003Cp\u003EGo to this rocket on the pad\u003C/p\u003E\u003Cp\u003EWatch everything explode\u003C/p\u003E\u003Cp\u003EReinstall KJR 2.4.5\u003C/p\u003E\u003Cp\u003ELoad save\u003C/p\u003E\u003Cp\u003EGo to this rocket on the pad\u003C/p\u003E\u003Cp\u003ENothing happens\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-30T09:23:26Z\u0022 title=\u002212/30/2014 09:23  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 30, 2014\u003C/time\u003E by ErrHead\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Urgante","CreatedById":120746,"CreatedDateTime":"2014-12-30T14:51:24Z","Content":"\n\u003Cp\u003ESame bug than ErrHead, windows 32 bit opengl, borderless window.\u003C/p\u003E\u003Cp\u003EBig ships disassemble on load, smaller ones seem to work but they are constantly under acceleration.\u003C/p\u003E\u003Cp\u003ERestoring 2.4.5 and all work perfectly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-30T14:53:35Z\u0022 title=\u002212/30/2014 02:53  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 30, 2014\u003C/time\u003E by Urgante\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2014-12-30T16:18:56Z","Content":"\n\u003Cp\u003EThe primary decouplers that I use are: TR-2V (0.625m part), TR-18A (1.25m part) and Rockomax Brand Decoupler. No use of the TR-38-D part.\u003C/p\u003E\u003Cp\u003EI was using 2.4.5 previously and upgraded to Kerbal_Joint_Reinforcement-v3.0.zip. Going to downgrade to 2.4.5 again.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-12-30T16:44:01Z","Content":"\n\u003Cp\u003EFerram4, I am having troubles with the new update and sounding rockets not letting go of each other. I do have a lot of mods installed and Have yet tried to trace the trouble down yet! I plan to do that today or soonÃ‚ÂÃ¢â€žÂ¢. But other then the KSP.log file and a mod list what else is needed for the bug report?\u003C/p\u003E\n"}]}