{"TopicId":51064,"ForumId":32,"TopicTitle":"Maximum Machine specs.","CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2013-10-29T14:33:41Z","PageNum":1,"Articles":[{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2013-10-29T14:33:41Z","Content":"\n\u003Cp\u003Ewith the limitations on the current unity build, what are the top specs for a pc where an upgrade won\u0027t see any improvement in ksp? i know theres that 4gb ram cap, but what else? sorry if thread in wrong place. seems pretty general to me.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-10-29T14:39:01Z","Content":"\n\u003Cp\u003Ei dont think there are any other limiting factors.\u003C/p\u003E\u003Cp\u003Ememory? you said it.\u003C/p\u003E\u003Cp\u003Egraphics? well, ok. you dont need a GTX Titan to run KSP. \u003C/p\u003E\u003Cp\u003Ecpu? single thread performance (clockfrequency) is the thing. a high clocked quad cpu would be better than a low clocked 8 or 12 core.\u003C/p\u003E\u003Cp\u003Eharddisk? a faster ssd would load the game faster.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-29T14:43:57Z","Content":"\n\u003Cp\u003EYou want 8 GB ram. Windows and other programs use a lot, but you will not see any improvements going from 8 and up.\u003C/p\u003E\u003Cp\u003EPretty much any budget gaming graphic card works well.\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2013-10-29T14:44:17Z","Content":"\n\u003Cp\u003EI am ordering a new rig today, going with an i5 4670K and going to OC it to 4.5GHZ, hoping I can get like 500 part count vessels out of that\u003C/p\u003E\n"},{"CreatedByName":"FluffyBob","CreatedById":32449,"CreatedDateTime":"2013-10-29T14:49:27Z","Content":"\n\u003Cp\u003ELoading from SSD doesn\u0027t make much of a difference. The long load times seem to be more of an engine / CPU limitation.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-10-29T14:56:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FluffyBob\u0022 data-cite=\u0022FluffyBob\u0022\u003E\u003Cdiv\u003ELoading from SSD doesn\u0027t make much of a difference. The long load times seem to be more of an engine / CPU limitation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei had a significant speed boost. then again.. the upgrade from my old seagate to a samsung 840 pro was pretty big..\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-10-29T15:09:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022-RanZ-\u0022 data-cite=\u0022-RanZ-\u0022\u003E\u003Cdiv\u003EI am ordering a new rig today, going with an i5 4670K and going to OC it to 4.5GHZ, hoping I can get like 500 part count vessels out of that\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is probably the best CPU option for KSP. The more expensive i7s or the consumer level Xeon chips won\u0027t make much difference for this game (though they shouldn\u0027t be any worse) so I would stick with the i5s. \u003C/p\u003E\u003Cp\u003EYou should certainly be able to handle a 500 part craft, but you could do that anyway. It\u0027s really a question of what level of performance is acceptable. You could make a 5000 part craft if you could accept running at 5 FPS. But with that CPU you should expect at least 25 FPS with around 500 parts.\u003C/p\u003E\u003Cp\u003EAs for the other components, it\u0027s like everyone else said, 8GB RAM and a decent video card (HD7850 or GTX 660) should be able to handle anything KSP can throw at them.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-10-29T15:20:02Z","Content":"\n\u003Cp\u003EYeah a mid grade video card is pretty much going to allow you to max out the graphics and have no graphically based limitations on your frame rates.\u003C/p\u003E\u003Cp\u003EYour limitation will be on the CPU side. There is probably no actual maximum where you\u0027d see no return, but the question would be, how big?\u003C/p\u003E\u003Cp\u003EI can easily push 300\u002B part ships and stations with no evidence of slow down (IE never see under 30FPS) on my i5-3570 running at 4/4.2Ghz (4Ghz quad and 4.2ghz single core turbos) and 5570 (graphics aren\u0027t turned all the way up as my low end card can\u0027t handle them, but I do run at 1080p and medium settings, no AA).\u003C/p\u003E\u003Cp\u003EI can\u0027t recall a time I\u0027ve ever had a ship over 400 parts on my desktop as I play almost exclusively on my laptop (i5-3317u). The laptop is high enough spec to handle most of what I want to do in the game and lounging on the couch or the easy chair in my living room with my wife is more important to me than sitting in my basement office. That\u0027ll probably change some in a year or two once we\u0027ve finished renovating our basement (just finishing touches now) and we also have the spare change to get a nice new TV (until then, the 42\u0022 in the upstairs family/playroom and the 32\u0022 is in the basement). Then the basement will be the main entertaining room and I\u0027ll probably use my desktop a heck of a lot more.\u003C/p\u003E\u003Cp\u003ESo all that said, my laptop can regularly run 200 part ships at over 30fps through most of game play. I do get a bit of launch lag and a bit of orbital horizon view and looking down on oceans lag on larger ships, but it probably still hits over 15fps most of the time and regular play is over 30fps (granted, 768p). The last few releases I haven\u0027t done much other than stuff right around Kerbin, Mun and Minmus with a couple of quick probe forays to Eve and Duna as I just haven\u0027t had much spare time the last few months (and a back injury over the summer). Earlier on, I did have a bit of a frustrating time with some really big ships in the 300\u002B part range for Moho and Jool missions, but I am a lot more efficient in design now, so I tend not to need them that big. I won\u0027t mind (hopefully) a couple of years from now getting a new laptop and fingers crossed, CPU performance will have gone up a moderate amount (at least 20-30%, preferable 25-35%) over what I have now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T15:24:13Z\u0022 title=\u002210/29/2013 03:24  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by lazarus1024\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DeathFromBelow","CreatedById":27284,"CreatedDateTime":"2013-10-29T19:21:12Z","Content":"\n\u003Cp\u003EThe Intel i5 4670k is the best performance/value, KSP doesn\u0027t benefit from more cores. You might actually get slightly better performance out of the older socket 1155 3570k\u0027s since Ivy Bridge will overclock a bit further than the newer Haswell architecture, but I\u0027d still go with the 4670k for the power savings and improved chipset features on the socket 1150 boards. I don\u0027t have any GPU recommendations, I\u0027ve always played with a Radeon HD 7970 GPU.\u003C/p\u003E\u003Cp\u003EYou really can\u0027t go wrong with any of the high-end chips. I\u0027ve run KSP on a heavily overclocked AMD FX 8320 (4.8 GHz) and my current i7 Extreme 4930k (4.5 GHz) setup. The FX did just fine at 1080p resolution. The i7 can definitely handle higher part counts, but the Kerbin horizon still causes slowdowns at 4k resolution (3840x2160). That seems like a GPU bottleneck rather than CPU.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T20:02:36Z\u0022 title=\u002210/29/2013 08:02  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by DeathFromBelow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-10-29T20:38:13Z","Content":"\n\u003Cp\u003EI have and SSD, 8GB ram, I7-4770K to be overclocked and a GTX 660 Ti 3GB. How\u0027s that sound?\u003C/p\u003E\n"},{"CreatedByName":"Spence1012","CreatedById":88591,"CreatedDateTime":"2013-10-29T23:01:28Z","Content":"\n\u003Cp\u003EAs others have said, Intel is best for KSP. I have AMD for other uses and it is a bit noticeable compared to what I see youtubers experiencing as far as lag goes. \u003C/p\u003E\u003Cp\u003EAlso, I have an FX 8320 as DeathFromBelow has/had and it does well until I start going nuts with 5m Novapunch rockets or 500\u002B parts. I have a golden chip that runs at 4.3 Ghz \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EUNDERVOLTED\u003C/span\u003E. (P95/Cinebench/game stable, for what it\u0027s worth) I could probably do 5 Ghz on near stock volts at that rate but I\u0027ll take 4.3-4.5 Ghz @45*C all day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, I think an Intel chip is the best option for the time being (until multi core support happens). Other than that, make sure you have 8 GB or RAM and a decent, mid range GPU like an HD 7850 or GTX 660/760 if you want something that will be amazing for someone on a budget. I have a GTX 660 Ti and it barely breaks a sweat at 1080p. It\u0027s more than what you need for KSP, but it can handle any other game, too. I had a 7850 but I had the 1 GB model so I pretty much \u0027had\u0027 to ditch it because I\u0027m running 2 monitors and play games on a 1080p monitor with a secondary 1600x900 that was my old monitor. I have noted that Battlefield 3 and other games do in fact use a fair bit more than 1 GB of vRAM, about 1.3 GB of usage from what I remember seeing in GPU-Z. I didn\u0027t want to have issues with something dumb like lack of vRAM. Plus, I got the 660 Ti for $165. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonal stories aside, if you\u0027re going to be building this sometime soon, you would do best with an Intel i5 (don\u0027t buy an i7 or 16 GB of RAM unless you do editing or find one or the other for the same price as the lower end component. it won\u0027t help KSP performance at all), a mid range GPU that should cost about $150 or less if you get a 7850, and 8 GB of RAM. Just make sure you get quality components elsewhere in your system. Notably, don\u0027t cheap out on the power supply. A Corsair CX 600 is a great entry level PSU that shouldn\u0027t explode on you (many cheap ones will). I used to recommend Antec, but I had one explode in my face and screw up my system in some very subtle ways. Notably, I lost onboard sound and had to get a cheapo sound card at Best Buy. Antec is supposed to be good, but after seeing sparks and light come out of that PSU I don\u0027t feel comfortable with them anymore. If you have more money, look at a Seasonic or higher-end Corsair PSU. Seasonic is about the best you can get.\u003C/p\u003E\n"}]}