{"TopicId":51073,"ForumId":36,"TopicTitle":"[PLUGIN\u002BPARTS][0.23] SCANsat terrain mapping","CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-10-29T16:06:22Z","PageNum":1,"Articles":[{"CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-10-29T16:06:22Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ENotice: SCANsat mod updates are now presented and discussed in \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80369\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003Ethis thread\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/thatfool/SCAN/releases/download/build5/SCANsat_b5.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EDownload build 5 here\u003C/span\u003E\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ESource code for the plugin \u003Ca href=\u0022https://github.com/thatfool/SCAN\u0022 rel=\u0022external nofollow\u0022\u003Elives on github\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping?p=850999\u0026amp;viewfull=1#post850999\u0022 rel=\u0022external nofollow\u0022\u003EChangelog post for build 5.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping?p=769648\u0026amp;viewfull=1#post769648\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EChangelog post for build 4.\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping?p=750179\u0026amp;viewfull=1#post750179\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EChangelog post for build 3.\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping?p=744371\u0026amp;viewfull=1#post744371\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EChangelog post for build 2.\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ENote for new users: \u003C/span\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThis is a work in progress\u003C/span\u003E\u003C/span\u003E, and the current state of the plugin is different from the initial description. Please refer to the changelogs linked above to see what\u0027s changed so far. This mod is \u003Cem\u003Eusable\u003C/em\u003E, but not \u003Cem\u003Efinished\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOriginal first post:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been working on a mapping mod for a bit, and I\u0027m now at a point where I\u0027d say it\u0027s definitely not ready for release, but maybe ready for some feedback. \u003C/p\u003E\u003Cp\u003EThe main aim of this mod is that mapping should work as a game. Meaning, you should be able to put a mapping satellite in an orbit and get a reasonably useful map by playing normally, without long waits. It should be fun to watch how your satellite uncovers the map, but you should still have to work for it a bit if you want the map to be \u003Cem\u003Eperfect\u003C/em\u003E. At the same time, all data is pulled from the game - \u0022faking it\u0022 by just showing you parts of an existing map isn\u0027t acceptable. I also wanted to be able to have several different sensors that show you different things under different conditions, which is something I\u0027m getting close to now. Unfortunately, if you haven\u0027t already guessed, all this meant realism has had a somewhat low priority so far...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESo what does this do?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XVuAHf8.png\u0022 alt=\u0022XVuAHf8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is what the main UI looks like right now. Every part in this mod opens this UI if you enable it via the right-click menu or action groups.\u003C/p\u003E\u003Cp\u003EIn this particular example, you can see that I have three scanning vessels active. Number 3 is the active vessel, which is why it\u0027s green, and the abbreviations below the map tell me that it has both low- and high-resolution altimetry sensors active as well as a slope detecting sensor. Because they\u0027re green; you\u0027re probably noticing a pattern here. It doesn\u0027t have a biome sensor active, it doesn\u0027t have an anomaly sensor active, and it also doesn\u0027t have a BTDT sensor, which is another anomaly sensor that can also identify (as in, name) anomalies, but has to be very close to do that (i.e. on a lander or a rover, not a satellite). Oh, and if any of these tags were orange, that\u0027d tell me I\u0027m at the wrong altitude.\u003C/p\u003E\u003Cp\u003EYou can also see that these sensors cover a fairly large area of land - although the high resolution altimetry sensor covers a smaller area than the other sensors, which is why there are greyscale bands around my active satellite\u0027s track. The other satellite in orbit around Kerbin in this game only has a low resolution sensor, which is why \u003Cem\u003Eits\u003C/em\u003E track is \u003Cem\u003Eonly\u003C/em\u003E greyscale. And lastly, the vessel named \u0022Anomaly Scanner\u0022 is really a rover sitting near the KSC that has a BTDT sensor equipped, so it doesn\u0027t leave a visible track at all because this window currently only shows elevation.\u003C/p\u003E\u003Cp\u003EOh, and that red line shows update progress, because this map is continuously rebuilt line by line. It\u0027s not as slow as it sounds, I promise. I could \u003Cem\u003Eprobably\u003C/em\u003E make it update completely live too, but this way should give more constant performance (and I liked the look of it...).\u003C/p\u003E\u003Cp\u003EObviously there are two buttons here that you can click. The one that says \u0022Forget Map\u0022 will reset all mapping data for this system. I mean it. It\u0027ll forget everything about whatever you\u0027re orbiting at the time. \u003C/p\u003E\u003Cp\u003EThe other one opens a larger map window. This is a part of that window showing a map of Eve:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cTbNjiN.png\u0022 alt=\u0022cTbNjiN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo surprise here. It\u0027s a larger map with more detail than the smaller map. It takes a few seconds to render, because this is when the mod actually scans the terrain. It uses the same coverage data as the small map, meaning you\u0027ll see tracks of your satellites here too. But since that coverage data is recorded at a much lower resolution than this map, edges will be jaggy.\u003C/p\u003E\u003Cp\u003EThe small square that looks like a magnified view of the two craters to the left of it is in fact a magnified view of those craters; you get it by right-clicking somewhere. If you right-click inside the magnified view, it\u0027ll magnify it even more, too. Good thing that satellite had a high resolution altimetry sensor on it, because otherwise this zoom would not be so useful. \u003C/p\u003E\u003Cp\u003EThe text at the bottom refers to the mouse position within the map (or the magnified bit). Green means there\u0027s data of that particular type, grey means there\u0027s no data of that type, and red means there would be data if the game had that kind of data (Eve does not have biomes, but if it ever gets biomes, then I would be able to see the biome in this location). The number is terrain height under the mouse cursor, again good thing that I had a high resolution sensor, because otherwise this number would be rounded to the nearest multiple of 500.\u003C/p\u003E\u003Cp\u003EThe buttons are pretty self explanatory, they switch display modes. You can also use them to refresh the map if your satellites have scanned some more land. The greyscale button actually affects all maps, or at least I hope it does.\u003C/p\u003E\u003Cp\u003EI need to say something about biomes here - you\u0027ve no doubt seen the biome map of Kerbin in that blog post that introduced biomes. That map is exactly what I can get from the game, too. I didn\u0027t really like the colour scheme, so biome maps rendered by this mod look different. Here\u0027s one showing Mun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rRsV7oN.png\u0022 alt=\u0022rRsV7oN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe actual biome map from the game is very colourful, with lots of brightly coloured blobs of biome. Unfortunately, there is a small problem: There is a function in the API that seems to be made for finding the biome at a given location, but I couldn\u0027t figure out how to use it without printing debug messages to the screen. So I implemented my own interpretation of \u0022closest map color\u0022, meaning biome edges can be inaccurate on these maps.\u003C/p\u003E\u003Cp\u003EAlso, since I mentioned anomaly detection before, here\u0027s the difference between the anomaly sensor you put on a satellite and the BTDT sensor:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mEsje76.png\u0022 alt=\u0022mEsje76.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, the BTDT sensor on my rover I mentioned earlier has correctly identified the KSC, while the Island Airstrip nearby still shows up as a generic \u0022Anomaly\u0022. (Note, these names are pulled from the game too, if you don\u0027t like the lack of spaces or the extra zeroes in some, that\u0027s not my fault \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003Cp\u003EOh, and another thing about this window: Every time a map is fully rendered, it\u0027s exported as a PNG image to the PluginData folder inside the mod\u0027s folder. Existing images get overwritten, so if you want to keep anything you should probably copy it somewhere safe.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESome other things that I think are nice about this\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E Scanning a planet can be completed in a few minutes if you set up a good orbit, or throw enough satellites at the problem, and time warp for a bit. This mod doesn\u0027t actually interpolate positions during time warp, but with the current field of view sizes, I\u0027ve had good results from up to 1000x time warp around planets like Kerbin. Faster time warp works too, it just doesn\u0027t paint recognizable tracks anymore. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E All active scanners scan at the same time, including those on vessels in different SoIs. You don\u0027t have to keep your satellite as the active vessel until you\u0027re done, as long as your other vessel also has a part from this mod that can open the mapping interface. (The non-scanning one counts.) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Watching your satellites make pretty tracks doesn\u0027t use too much processing power and shouldn\u0027t slow anything down. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Works on Macs, too! At least on mine, anyway. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ESo, what\u0027s the catch?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell, near as I can tell, this mod is actually working as described, and usable even on my Macbook that struggles with running KSP in the first place. But there are some things that are just unfinished or bad:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E All the parts in this mod currently use the same terrible mesh that I made to find out how to get a mesh into a mod, with a texture I made to find out how painting textures works in blender. I don\u0027t know how soon I can make the actual models. At least it looks vaguely like a sensor array. But it\u0027s not pretty, and it\u0027s not animated. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E It\u0027s not properly integrated with career mode yet. Currently, the parts should be hooked into \u0022Science Tech\u0022. Obviously, the plan is that the better sensors should come much later. But those sensors didn\u0027t even exist two complete refactorings ago. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Parts don\u0027t use electrical charge yet. This is never going to be perfect, as I can\u0027t drain charge on inactive vessels. But I still want it at least for the active one. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E I\u0027m also hoping that eventually, scanning planets and in particular, discovering anomalies, can generate science, but I don\u0027t even know where to look for that yet. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Map sizes aren\u0027t configurable yet. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The small updating map still needs a way to show progress for sensors other than altimetry. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Only scanning vessels (and the active vessel) are currently displayed on maps. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E All the map markers are basically text labels that start with an x or an o, which means they\u0027re all potentially off by a few pixels. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Scanning isn\u0027t very realistic, and I don\u0027t know if I can ever change this because it\u0027s \u003Cem\u003Ereally\u003C/em\u003E important to me that this works as part of a game. One thing I\u0027d like to do at some point is make the field of view dependant on the altitude of the scanning vessel. But the fairly low resolution coverage map limits this somewhat. And the amount I\u0027m willing to blow up persistence files limits the resolution of that coverage map. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Scanning (basically) only happens while the mapping interface is open. It wouldn\u0027t be too hard to make it go on while you\u0027re doing something completely unrelated on a different vessel, but I haven\u0027t gotten around to it yet. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E There are probably a bunch of bugs in the code too, since I haven\u0027t touched C# in about ten years. (You can probably tell...) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E There\u0027s even at least one bug visible on one of the pictures in this post... doh. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhat I\u0027m looking for here is primarily feedback on whether I\u0027m on the right track with my ideas on making this a \u0022gamey\u0022 feature. Also, I haven\u0027t been finding too many NullReferenceExceptions lately, so that probably means it wouldn\u0027t hurt if more people could try to use it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo anyone brave enough to try this, thank you, and I hope it\u0027s not entirely useless.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-18T14:37:46Z\u0022 title=\u002205/18/2014 02:37  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 18, 2014\u003C/time\u003E by diomedea\u003C/strong\u003E\n\u003Cbr\u003ENotice added about SCANsat continuation thread\n\u003C/span\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-29T16:19:57Z","Content":"\n\u003Cp\u003EDownloading and testing as we speak. This is the ISA replacement if you can work out the kinks.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-10-29T16:26:04Z","Content":"\n\u003Cp\u003ENice work! It looks like you handily beat me to the prototype phase. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E It\u0027s great to see someone get a mapper working with deferred terrain queries without using a prebuilt map outright.\u003C/p\u003E\u003Cp\u003EDon\u0027t get too hung up on some of the scanning challenges like interpolating through timewarp or draining electricity while unfocused. Depending on how picky you are, the solutions to those problems can be straightforward but unsatisfying or just incredibly difficult.\u003C/p\u003E\u003Cp\u003EI also suggest you not stay in the development forum for too long. Fix up a few issues, and go for a release. Too many good plugins get lost in this forum for fear of releasing. (You can always continue development after release!)\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-10-29T16:33:39Z","Content":"\n\u003Cp\u003ESo how exactly are you solving the \u003Cem\u003E*drumroll*\u003C/em\u003E memory usage problem?\u003C/p\u003E\n"},{"CreatedByName":"Sochin","CreatedById":78402,"CreatedDateTime":"2013-10-29T16:34:57Z","Content":"\n\u003Cp\u003EOK stupid question what is BTDT? Secondly good work.\u003C/p\u003E\u003Cp\u003EFeeback, \u003C/p\u003E\u003Cp\u003ETo make it fun what about a satelite or vehicle icon instead of the X. What about an orbital map showing the satelites track aswell.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52122-Ground-track-maps-of-spacecraft-orbits-in-tracking-center\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/52122-Ground-track-maps-of-spacecraft-orbits-in-tracking-center\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAn idea,\u003C/p\u003E\u003Cp\u003Ewhen you spot an anomoly could it be possible to give a lat long position in Ã‚Â° \u0027 \u0027\u0027 (deg min sec) rather than decimal?\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-10-29T17:06:53Z","Content":"\n\u003Cp\u003EAh, finally someone tackled the issue of Not Enough Mapping! in KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Kudos.\u003C/p\u003E\n"},{"CreatedByName":"BFGfreak","CreatedById":57395,"CreatedDateTime":"2013-10-29T17:09:55Z","Content":"\n\u003Cp\u003EIf you don\u0027t mind me asking, how will science factor into this?\u003C/p\u003E\u003Cp\u003EAlso nice work, I\u0027m glad to see that someone\u0027s updating the old mapsat idea.\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-10-29T17:13:50Z","Content":"\n\u003Cp\u003EExcellent! I have been missing my mapping satellite. I\u0027ll download this tonight.\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-29T17:42:45Z","Content":"\n\u003Cp\u003EWell, I have to say, I\u0027m throughly impressed. I\u0027m not running into memory leakages, I have it scanning WITH Kethane and all of the scanners simultaneously, without incident. The map renders well enough, and so far, I think you are your best critic. It\u0027s running on my Macbook without a hiccup.\u003C/p\u003E\u003Cp\u003EI honestly have zero issues other than what you\u0027ve already pointed out.\u003C/p\u003E\u003Cp\u003EEDIT: When using Greyscale the text should change from black to either cyan or orange.\u003C/p\u003E\u003Cp\u003EPICTURES!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/E4qhk\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T18:13:54Z\u0022 title=\u002210/29/2013 06:13  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by sharpspoonful\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2013-10-29T17:56:49Z","Content":"\n\u003Cp\u003E*Kneels down, kisses floor*\u003C/p\u003E\u003Cp\u003EConcrats on the WIP (beta?) release of SCANsat damny!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMulti-vessel scan is awesome, I wonder how you got it to work without the game loading the parts (how does the game know what vessels can scan, and what sensors they have? MAGIC!)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMap shows only scan-enabled vessels: I don\u0027t see the problem there. I find it logical that only vessels with SCANsat-tech show up on SCANsat maps, other vessels are not hooked up to the network.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIs there a \u0027view map only\u0027 part? (for landers or basic orientation) (Maybe adding a list of all parts with their specs in the first post would be an idea?)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf scanning continuous while doing completely unrelated stuff, that would be dream come true.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen you get around generating science, may I suggest it delivers based upon the percentage of mapped terrain? A few points for every 10% for example, slowly increasing since 0-\u0026gt;10% isn\u0027t as much of an achievement than 70-\u0026gt;80 is (I think)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T18:10:06Z\u0022 title=\u002210/29/2013 06:10  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by OrtwinS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-10-29T17:57:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BFGfreak\u0022 data-cite=\u0022BFGfreak\u0022\u003E\u003Cdiv\u003EIf you don\u0027t mind me asking, how will science factor into this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewould be interesting if it generated science based off how complete the map is\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-10-29T18:03:13Z","Content":"\n\u003Cp\u003EOh man, this looks great. Even more upfront utility than ISA, and support for multiple scanners is pretty much the best thing for making the task less tedious. If I may make a suggestion though, the \u0027forget map\u0027 is a little bit too large and prominent for my taste. Hope it has a confirmation.\u003C/p\u003E\u003Cp\u003EAlso, as far as science goes, beyond unlocking different sensors have you considered gaining science based on map completeness? Each body has some arbitrary value for being completely mapped, maybe use whatever method Interstellar uses to deposit science but based on how much more you\u0027ve mapped since the last check.\u003C/p\u003E\n"},{"CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2013-10-29T18:18:04Z","Content":"\n\u003Cp\u003EOut - standing!\u003C/p\u003E\u003Cp\u003EYes, you are definitely on the right track. Multiple scanner types, multiple vessels active, that\u0027s all good.\u003C/p\u003E\u003Cp\u003EI especially like the slope scanner - the first thing I do when trying to find a new LZ is look at the slope map on kerbalmaps.com for a flat area.\u003C/p\u003E\u003Cp\u003EIt will be great to be able to do that in-game.\u003C/p\u003E\u003Cp\u003EI take it you are detecting anomolies, not just looking them up from a static list? So new anomolies will be detected without a patch?\u003C/p\u003E\u003Cp\u003ECan we get a table/list of detected anomalies? That would be excellent, even if it\u0027s only from a text file in the data directory.\u003C/p\u003E\u003Cp\u003EAlso - how about a small non-scanning part that allows a vessel to open the map window and show up on the maps - like a GPS/beacon type part.\u003C/p\u003E\u003Cp\u003EGoing to download and have a play.\u003C/p\u003E\u003Cp\u003EDamn, I\u0027m going to have to send out a new fleet of science recon probes and my old network\u0027s not built yet :-)\u003C/p\u003E\n"},{"CreatedByName":"a__gun","CreatedById":83859,"CreatedDateTime":"2013-10-29T18:51:23Z","Content":"\n\u003Cp\u003EBeen looking forward to this ever since you mentioned it in the requests forum and it looks great so far \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHavn\u0027t had a chance to test it extensively yet but I\u0027ve already had a few ideas.\u003C/p\u003E\u003Cp\u003EFirstly, I imagine that spamming satellites will eventually start to have a hit on performance, so I think it would be great to be able to turn each scanner on and off individually.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022damny\u0022 data-cite=\u0022damny\u0022\u003E\u003Cdiv\u003EParts don\u0027t use electrical charge yet. This is never going to be perfect, as I can\u0027t drain charge on inactive vessels. But I still want it at least for the active one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThink I\u0027ve got a work around for this too - when a vessel becomes inactive you read and store its current charge. Then it is a \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Esimple\u003C/span\u003E case of calculating the time it can run for under its current drain and deactivating scanning when this time is up. When the vessel next becomes active you calculate the charge that should be drained and take it off then. By no means a priority but think it should work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-29T18:51:34Z","Content":"\n\u003Cp\u003EAnyone else having issues with the download link? Was so happy to see this, and still very excited to test it out...but can get the page to load =(\u003C/p\u003E\u003Cp\u003Eedit: I got it...it didnt like Firefox for some reason...got it to download with IE though...go figure lol\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T19:12:44Z\u0022 title=\u002210/29/2013 07:12  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by KhaosCorp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2013-10-29T19:02:23Z","Content":"\n\u003Cp\u003EDownload worked for me ten minutes ago\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-10-29T19:17:50Z","Content":"\n\u003Cp\u003EAbsolutely amazing. It seems to work just fine and my first low resolution alt map and biome map of Kerbin and the mun was a resounding success.\u003C/p\u003E\u003Cp\u003EI didn\u0027t find any bugs during the scanning itself, but after I deorbited my scanning probe and crashed it into the surface the KSP interface became unresponsive. I couldn\u0027t click anything in the esc menu, the space center or the start scene. I am uncertain this was caused by SCANsat however, since I run a lot of mods and this bug is pretty common.\u003C/p\u003E\u003Cp\u003EAlso, while building it was pretty hard to keep the different scanners apart. I would suggest giving them at least some differing colors until you have time to implement some proper models.\u003C/p\u003E\u003Cp\u003EAnother thing, in the big map I was seemingly unable to get rid of the zoom box. I don\u0027t know if I just missed something or if that\u0027s actually impossible. The second zoom level also doesn\u0027t give much magnification compared to the first zoom, don\u0027t know if that\u0027s intended.\u003C/p\u003E\u003Cp\u003EOther than that, Great work! The fact it shows biomes will no doubt make it immeasurably useful in career mode. It gives you the ability to identify landing sites where 2 or 3 biomes meet for maximum science with minimal walking/driving. That alone is more than enough incentive for me to make this a must have mod.\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-10-29T19:34:56Z","Content":"\n\u003Cp\u003EWow. Despite the issues mentioned this is pure awesome. I\u0027m very impressed. It was fun getting the Z-Map craft up and running.\u003C/p\u003E\n"},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2013-10-29T19:44:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EAnyone else having issues with the download link? Was so happy to see this, and still very excited to test it out...but can get the page to load =(\u003Cp\u003Eedit: I got it...it didnt like Firefox for some reason...got it to download with IE though...go figure lol\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe download link has a temper, it didn\u0027t work for me the first 2 tries, it did on the third and fourth, not on the fifth, and did work again on the sixth time I clicked it (yes, I downloaded the zip 3 times, FOR SCIENCE).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EAbsolutely amazing. It seems to work just fine and my first low resolution alt map and biome map of Kerbin and the mun was a resounding success.\u003Cp\u003EI didn\u0027t find any bugs during the scanning itself, but after I deorbited my scanning probe and crashed it into the surface the KSP interface became unresponsive. I couldn\u0027t click anything in the esc menu, the space center or the start scene. I am uncertain this was caused by SCANsat however, since I run a lot of mods and this bug is pretty common.\u003C/p\u003E\u003Cp\u003EAlso, while building it was pretty hard to keep the different scanners apart. I would suggest giving them at least some differing colors until you have time to implement some proper models.\u003C/p\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI second the \u0027different colors\u0027 idea. It is an easy fix to keep them apart without having to invest in complicated new models or textures.\u003C/p\u003E\u003Cp\u003EAbout the interface becoming unresponsive, I have that every hour, and had that before trying SCANsat. I don\u0027t think it is related.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-10-29T20:19:43Z","Content":"\n\u003Cp\u003EWow, this is working really great so far. I have a single craft with all six parts running without any real problems. I can only see a few issues:\u003C/p\u003E\u003Cp\u003E- The dark anomaly text is hard to read against the greyscale as has been mentioned above. Some way to change the color would be nice, it might also be nice to be able to toggle the anomaly text on/off. \u003C/p\u003E\u003Cp\u003E- What is the distance for the BTDT detector? I can see the anomaly names for the KSC, Island Airfield, the Pyramids and two monoliths from a satellite in a 160*180 km orbit. I didn\u0027t have any scanners running until I reached orbit. I also have two unnamed anomalies. \u003C/p\u003E\u003Cp\u003E- The only real bug that I can see is that the craft indicator on the small map is off. The \u0022x\u0022 is displayed about 20\u003Csup\u003Eo\u003C/sup\u003E to the east of the actual position. It\u0027s correct on the big map and can be confirmed by looking down at the surface. \u003C/p\u003E\u003Cp\u003EThe latitude is correct in both maps, but the longitude indicator on the small map doesn\u0027t match the ship\u0027s position on the big map, found by holding the cursor over the \u0022x\u0022 on the big map (also, the order of the lat/long and alt values are switched on the two maps, I assume that\u0027s what you were referring to in the first post).\u003C/p\u003E\u003Cp\u003E- Is there any way to clear the zoom in window? Once I right-click somewhere I can\u0027t remove the zoom in window, I can move it to somewhere else, but it\u0027s always there.\u003C/p\u003E\u003Cp\u003E- The \u0022Forget Map\u0022 button is usefull for testing, but I imagine it will be better to shrink it or hide it somewhere for later versions. It\u0027s pretty easy to accidently click it and erase your map.\u003C/p\u003E\u003Cp\u003E- As for the suggestion to add a map-only part, I assume that\u0027s what the MapTraq will be.\u003C/p\u003E\u003Cp\u003EOtherwise this is looking really good, nice work. I\u0027ll get around to testing multiple crafts later.\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-10-29T20:22:31Z","Content":"\n\u003Cp\u003EThis looks awesome... I\u0027m gonna try in now... Well... As soon as I have time for KSP at least...\u003C/p\u003E\u003Cp\u003EI would love seeing \u003Cem\u003ESCIENCE!\u003C/em\u003E being implemented into this and even have a few ideas for Cabana Corp.\u0027s own \u0022Expanded \u003Cem\u003ESCIENCE!\u003C/em\u003E\u0022 Project...\u003C/p\u003E\u003Cp\u003EHere\u0027s a suggestion- \u003C/p\u003E\u003Cp\u003EHooking up \u0022passive\u0022 \u003Cem\u003ESCIENCE!\u003C/em\u003E generation with the satellites, giving you X amount of \u003Cem\u003ESCIENCE!\u003C/em\u003E per area scanned (bonus if scanned by multiple methods and faster yield for more satellites) with extra \u003Cem\u003E SCIENCE!\u003C/em\u003E for uncovering anomalies and even more \u003Cem\u003ESCIENCE!\u003C/em\u003E for identifying them. All \u003Cem\u003ESCIENCE!\u003C/em\u003E gathered in this way would be stored on-board the satellites\u0027 equipment (or maybe Cabana Corp.\u0027s Data Drives, if those ever get anywhere) to then be transmitted using conventional means (or by returning a Cabana Corp. Data Drive to KSC).\u003C/p\u003E\u003Cp\u003EAs far as feedback goes- You can use stock part models as place-holders for stuff if you feel you don\u0027t have \u0022presentable\u0022 models of your own... It\u0027s how Cabana Corp has done it so far...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T20:31:12Z\u0022 title=\u002210/29/2013 08:31  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by BananaDealer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2013-10-29T20:32:40Z","Content":"\n\u003Cp\u003EDamn, this is awesome. I\u0027d be willing to donate time to model/texture parts if you\u0027d like!\u003C/p\u003E\u003Cp\u003EBecause I\u0027m a remote sensing analyst by trade, I think it\u0027d be super cool if you could split this into a few parts - perhaps a multispectral scanner that would detect biomes, a visible-band scanner for doing pretty pictures, maybe a SAR scanner for elevation? Again, willing to provide models and textures \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2013-10-29T20:49:22Z","Content":"\n\u003Cp\u003EI like where this seems to be going, and I like also what Nertea said. It mades sense to have different parts for different scan types, I like the idea of having to place more specialized satellites... or some franken-sat with a bunch of electricity hungry parts ready to break apart \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-29T20:51:24Z","Content":"\n\u003Cp\u003EThere are different part for the different scan types.\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-10-29T20:55:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nertea\u0022 data-cite=\u0022Nertea\u0022\u003E\u003Cdiv\u003EDamn, this is awesome. I\u0027d be willing to donate time to model/texture parts if you\u0027d like!\u003Cp\u003EBecause I\u0027m a remote sensing analyst by trade, I think it\u0027d be super cool if you could split this into a few parts - perhaps a multispectral scanner that would detect biomes, a visible-band scanner for doing pretty pictures, maybe a SAR scanner for elevation? Again, willing to provide models and textures \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that\u0027s already the way he\u0027s going...\u003C/p\u003E\n"}]}