{"TopicId":51076,"ForumId":34,"TopicTitle":"KMP v0.1.5.1 [0.23] [alpha] [inactive]","CreatedByName":"TehGimp666","CreatedById":61424,"CreatedDateTime":"2013-10-29T16:27:34Z","PageNum":75,"Articles":[{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-04-22T07:03:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E@Vladthemad: It\u0027s a bug that appeared in the 0.23.5 update, So it\u0027s always been there as far as I know. I do not run steam or windows, and I still get the issue, so you can count both of those factors out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, we personally experienced the same issue in .23. It wasn\u0027t every time, but around every other until we figured out it was Steam. We had a similar issue with other games...the alt-tab to open the overlay can mess with certain games. If it\u0027s doing it now for you in .23.5 and outside steam, same issue different cause XD Sorry it wasn\u0027t helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2014-04-22T20:17:19Z","Content":"\n\u003Cp\u003EIgnore this post!... sorted\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T20:21:37Z\u0022 title=\u002204/22/2014 08:21  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by Mulbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Solar Trade Confederacy","CreatedById":104809,"CreatedDateTime":"2014-04-22T20:54:40Z","Content":"\n\u003Cp\u003EHi guys, have been lurking here for a while.\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003ESo, I have really enjoyed vanilla KSP KMP, but now want to start my own server for my steam group (half dozen people) with industrial mods.\u003C/p\u003E\u003Cp\u003EBut before I do that, I have a few questions:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWill the current KMP client/server build work in KSP 23.5?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhat is the time-frame for the next release? (although judging by the last several pages, it seems like the project has shed lots of developers) If it is in the terms of weeks, not months, great! (still sorting out EPLP issues)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI heard there is problems with Kethane and Extraplanetary Launch Pads seeds, everytime you join the seed changes. Is there a way around this? Can the server give everyone a set seed? Or can the player edit his client to keep his seed the same?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInterstellar was my first and favorite mod, does the resource generation affect it like it does to Kethane and EPLP? Does the unique warpdrive work?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDoes locking ships mean people cant spawn ships at your extraplanetary launch pad on your base? I hope so.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAnything I can do to help?\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOh, list of mods:\u003C/p\u003E\u003Cp\u003E-Interstellar\u003C/p\u003E\u003Cp\u003E-B9 Aerospace \u0026amp; 23.5 B9 plugin fix\u003C/p\u003E\u003Cp\u003E-Kethane\u003C/p\u003E\u003Cp\u003E-Extraplanetary Launchpads (and Baha\u0027s new parts for them, which I am having trouble getting to work)\u003C/p\u003E\u003Cp\u003E-KAS\u003C/p\u003E\u003Cp\u003E-MagicSmokeIndustries (the robotic parts)\u003C/p\u003E\u003Cp\u003E-Mechjeb2\u003C/p\u003E\u003Cp\u003E-Chatterer\u003C/p\u003E\u003Cp\u003E-ActiveTextureManagement (medium mode, cuts the memory usage by a lot)\u003C/p\u003E\u003Cp\u003E-000_Toolbar\u003C/p\u003E\u003Cp\u003E-zzz parts (specifically habitat dome and greenhouse, awesome base/station moduals, still customizing the config though)\u003C/p\u003E\u003Cp\u003E-Oh, and of course NASAmission, though I should mention it anyways.\u003C/p\u003E\u003Cp\u003EThere will be combat, but no combat mods will be installed. This way, weapons developed out of vanilla parts are more unique, and MaceyDean inspired.\u003C/p\u003E\u003Cp\u003ECareer mode, for the investment you need to place into it.\u003C/p\u003E\u003Cp\u003EIndustry Mods for setting up bases and kickass capital ships though, B9 will allow bigger ships with lower part count!\u003C/p\u003E\u003Cp\u003ECombat will only occur when the other party is online and bases will be considered off limits. Its more of ship battles for the control of bases, if you win and land your own Kebals, then the base is yours. That way the original owners don\u0027t have there base wiped out, they can still retake there old base, and not have to reconstruct something they sunk 10 or more hours into.\u003C/p\u003E\u003Cp\u003EThankfully this is among a small steam group all with video capture software for awesome videos. \u003C/p\u003E\u003Cp\u003E____________________\u003C/p\u003E\u003Cp\u003ESo, as i coordinate my steam group and fix compatibility issues, I was wondering if the experts here could help me judge how feasible this is.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-04-23T01:23:27Z","Content":"\n\u003Cp\u003EThe current development build works in 0.23.5, but the space center bug is an awful bug. Also KMP hasn\u0027t really shed developers recently, And even though I\u0027ve switched to working on DMP, I\u0027ve still got things ready for KMP after gimp finds time for the space center bug. Anything good I can take from DMP that makes sense will find its way back into KMP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t want to put up with the space center bug and don\u0027t mind 0.23, \u003Ca href=\u0022http://chrisand.no-ip.info/kmp/testing/old/\u0022 rel=\u0022external nofollow\u0022\u003Ethe development version right before the arm update was in very good state\u003C/a\u003E (as in leaps and bounds more playable than 0.1.5.1). To use the older version, download the 0.1.5.1 version and overwrite both files on the server, and the KerbalMultiPlayer.dll file on the client.\u003C/p\u003E\u003Cp\u003EWhat is the time-frame for the next release: The main blocker is the space center bug, and because I haven\u0027t had it in DMP, I\u0027ve got something to test. If I\u0027m right, The development version will be in a state ready to be released today.\u003C/p\u003E\u003Cp\u003EMost mods will just work (I know kethane/MJ definitely work, KAS probably works locally must other players may not see winches, No idea about interstellar but it\u0027s likely to work), but you will have to add the modded parts into KMPModControl.txt. If you decide to use 0.23.5, just type /modgen on the server after you have placed the mods (not squad or nasa) under Mods/ in the server directory. If not, you will need to use the KMPModControl builder that\u0027s in the original post of the thread.\u003C/p\u003E\u003Cp\u003EClient side mods don\u0027t do anything special, Editor extensions/kerbal alarm clock/texture packs/toolbar don\u0027t make any difference from a multiplayer point of view, I\u0027d be surprised if they didn\u0027t work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Solar Trade Confederacy","CreatedById":104809,"CreatedDateTime":"2014-04-23T02:37:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E-Awesome Snip-\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks dude for responding!\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EI misunderstood the KSP-Space center bug that people keep talking about, everyone was saying how Gimp has to fix it etc, and though that people were leaving the project. Also, what does that bug do?\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EI was just asking about the mods, just in case someone had tried it before, and if they could give me a heads up like \u0022hey, use this or change this to this and get a smoother game\u0022 advice, but I see that I will be the one testing all that! Nothing wrong with that, of course, just wanted to check with the community before I tried, just to make sure I didn\u0027t repeat any mistakes.\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EIf the next release is in a week or so, thats fine, don\u0027t feel rushed by me.\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EDoing some research, I sort of know how adding mods and adding parts one by one works (maybe it was a guild written by you?) but I have yet to reach that stage of this \u0022modpack\u0022 yet. Still waiting on the final version of magic smoke industries (might actually be released now, I\u0027ll check tomorrow) to get the robotic parts in, and I have just finished neutering, er I mean thinning ExtraPlanetary Launchpads of the tanks and extra parts that clutter the VAB lists. Will probably thin some of the other mods, before I enter them.\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EI did read that people had issues with Kethane and other seed based resource systems, cause the game generated a new one whenever they joined the server for them, so there mining rig may have been on a big pocket but now its on dry, empty ground.\u003C/p\u003E\u003Cp\u003EIs there a way around that? Or a way for the server to send the players clients information and they would click accept as they join the server? Like, the server sends them a seed file for resources so instead of getting a random new one every day its consistent (even if it keeps replenishing? Its at least a start). Would that be possible? Or has it already been addressed, I don\u0027t know yet, and I\u0027ll keep searching.\u003C/p\u003E\u003Cp\u003EThank you for your time!\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-23T06:03:08Z","Content":"\n\u003Cp\u003EActually, KSPI\u0027s resource generation is set, so that should def work :-)\u003C/p\u003E\u003Cp\u003ENo idea about the warp drive though!\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-23T06:36:29Z","Content":"\n\u003Cp\u003EHorndgmium: If you add velocity, you will alter its orbit, so when warping you maybe have an apoapsis higher than the Mun\u0027s orbit instead of a 100km one :-)\u003C/p\u003E\n"},{"CreatedByName":"Solar Trade Confederacy","CreatedById":104809,"CreatedDateTime":"2014-04-23T16:59:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EActually, KSPI\u0027s resource generation is set, so that should def work :-)\u003Cp\u003ENo idea about the warp drive though!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweet, that\u0027s primarily what I was wondering about, don\u0027t really care if the warp drive works or not. Now just got to find a way to keep Kethane and EXLP resources from resetting each time you log in.\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2014-04-23T18:01:06Z","Content":"\n\u003Cp\u003EI\u0027m curious too as to what the \u0022space centre bug\u0022 is... I don\u0027t fancy trawling through 181 pages to find out... maybe the main post needs updating?\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-23T19:45:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mulbin\u0022 data-cite=\u0022Mulbin\u0022\u003E\u003Cdiv\u003EI\u0027m curious too as to what the \u0022space centre bug\u0022 is... I don\u0027t fancy trawling through 181 pages to find out... maybe the main post needs updating?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t quote me on this one, but if I\u0027m not completely wrong it was a bug that stopped you from entering the buildings.\u003C/p\u003E\n"},{"CreatedByName":"Xenoamor","CreatedById":108338,"CreatedDateTime":"2014-04-23T23:05:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E@Xenoamor: If anything is going to do integration, it\u0027s going to be KSP. Simply setting the angular velocity should be enough when I get to that point, I shouldn\u0027t really have to worry about velocity as it doesn\u0027t generally change without an engine, and as you saw, that\u0027s already transferred.\u003Cp\u003EThe action group sync (landing gear/light/brakes) is something I already have ready for KMP 0.1.6, it was held because it would break the update message format and I was going to tack the conversion to using orbital parameters in that update.\u003C/p\u003E\u003Cp\u003EThat space center bug though is the only reason why I\u0027m rolling my own multiplayer. If I end up getting it into a playable state, I\u0027ll create a seperate thread - This one is for KMP.\u003C/p\u003E\u003Cp\u003EThe DMP source is actually available on \u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer\u0022 rel=\u0022external nofollow\u0022\u003Egithub\u003C/a\u003E, but mainly for a personal backup. DMP isn\u0027t worth it trying out just yet, I\u0027ll add it to my sig when it is (if I continue working on it, which is likely).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s for the in-depth response Godarklight!\u003C/p\u003E\u003Cp\u003EI\u0027ve looked through your code briefly and it\u0027s looking short and sweet! Get on adding Vessel.angularVelocity syncing so we can see how well it runs =D\u003C/p\u003E\u003Cp\u003EEdit - Forget this we\u0027ve discussed it on the IRC =p\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T01:22:42Z\u0022 title=\u002204/24/2014 01:22  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by Xenoamor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-04-24T20:44:39Z","Content":"\n\u003Cp\u003EFrom what I understand, space center bug is after you log in you can\u0027t access anything. No entering buildings, no exiting back to the main menu, nothing normally clickable working...alt-f4 and restart. It\u0027s not every time, and doesn\u0027t seem to follow any particular sequence of events. Hence why it\u0027s not easy to fix.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-04-25T00:13:54Z","Content":"\n\u003Cp\u003E@Everyone using 0.23.5: Use KMPUpdater-development or download the development build from my sig, The space center bug isn\u0027t 100% fixed, but it\u0027s much more rare. The current fix for the space center bug also makes the initial sync faster.\u003C/p\u003E\u003Cp\u003EThe bug at the tracking station should be 100% fixed now if anyone was still having issues with it.\u003C/p\u003E\u003Cp\u003EEDIT: If anyone runs into anything major with the latest dev build, please post here or jump on IRC. As \u003Ca href=\u0022https://github.com/TehGimp/KerbalMultiPlayer/issues/764\u0022 rel=\u0022external nofollow\u0022\u003E#764 is likely to be deferred for 0.1.6\u003C/a\u003E, gimp is looking to release \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Etomorrow\u003C/span\u003E, so now would be a good time to mention anything \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T00:41:34Z\u0022 title=\u002204/25/2014 12:41  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by godarklight\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-25T05:54:36Z","Content":"\n\u003Cp\u003EWell, since it is a KSP bug that might be the cause for those rare cases. GO AHEAD AND DROP 0.1.5.2 ALREADY! #hype\u003C/p\u003E\n"},{"CreatedByName":"Solar Trade Confederacy","CreatedById":104809,"CreatedDateTime":"2014-04-25T14:48:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EWell, since it is a KSP bug that might be the cause for those rare cases. GO AHEAD AND DROP 0.1.5.2 ALREADY! #hype\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought he basically just did...\u003C/p\u003E\n"},{"CreatedByName":"Solar Trade Confederacy","CreatedById":104809,"CreatedDateTime":"2014-04-25T17:45:23Z","Content":"\n\u003Cp\u003EOkay, I have a question. Why is it that all my ships that I am flying/driving transparent? They handle the same, but they are ghostes\u003C/p\u003E\u003Cp\u003EEdit: once they get 2ish kilometers off the ground, they aren\u0027t see though any more, yay! NVM about this post\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T17:57:38Z\u0022 title=\u002204/25/2014 05:57  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by Solar Trade Confederacy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-04-25T19:19:22Z","Content":"\n\u003Cp\u003EThat\u0027s something I took from my orbit branch - I wanted to make being inside the safety bubble obvious \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EYou can also \u0022/set safetyBubbleRadius 0\u0022 to remove the big bubble now, theres 2 extra little ones protecting the spawn points.\u003C/p\u003E\n"},{"CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2014-04-26T07:15:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003EEDIT: If anyone runs into anything major with the latest dev build, please post here or jump on IRC. As \u003Ca href=\u0022https://github.com/TehGimp/KerbalMultiPlayer/issues/764\u0022 rel=\u0022external nofollow\u0022\u003E#764 is likely to be deferred for 0.1.6\u003C/a\u003E, gimp is looking to release \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Etomorrow\u003C/span\u003E, so now would be a good time to mention anything \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003EYou can also \u0022/set safetyBubbleRadius 0\u0022 to remove the big bubble now, theres 2 extra little ones protecting the spawn points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s nothing major and not even a bug, but with extra safety bubbles, maybe it would work well to have safetyBubbleRadius 0 as default in the next release? I\u0027ve actually followed this thread for quite a while now and there always seem to be people confused by the safety bubble. If it\u0027s no longer strictly needed, it might save some confusion on the user side to have it zero as default and leave it as an optional feature for those who like tinkering with settings?\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-04-26T09:08:18Z","Content":"\n\u003Cp\u003EProbably time for another \u0022living dangerously\u0022 commit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. With the extra bubbles it\u0027s a sane move - Without them when another player spawns inside of you, you generally either crash KSP or get sent to kraken universe (where everything is black).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/TehGimp/KerbalMultiPlayer/commit/43fcd6c10f4743b33d81981df1a1af85ef478856\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/TehGimp/KerbalMultiPlayer/commit/43fcd6c10f4743b33d81981df1a1af85ef478856\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBad news, After a bit of streaming today (twitch always brings out the worst in KMP) there\u0027s some pretty serious vessel replacement and velocity issues, but those will be trivial to fix. I\u0027ve dealt with velocity for orbital-parameters. The server was lagging around 5 seconds, but that\u0027s still playable. Unlike 0.1.5.1 which was in the minute or 3 range \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI\u0027m going to be \u003Ca href=\u0022http://www.twitch.tv/godarklight\u0022 rel=\u0022external nofollow\u0022\u003Estreaming KMP on my twitch channel\u003C/a\u003E and most likely hot-fixing/working around simple issues as I come across them (hopefully we get another streamer so you don\u0027t have to see my tap on the keyboard - Unless you\u0027re into that thing). After 2 or 3 hours of that, I\u0027m going to start streaming DarkMultiPlayer - I\u0027m at a position where I\u0027d like to do some testing in a real use case. The stream will start at 00:00UTC.\u003C/p\u003E\u003Cp\u003EThere will be a public open mumble server with the voice hooked up to my stream. If everything goes fairly well, then we may release \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T09:14:25Z\u0022 title=\u002204/26/2014 09:14  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by godarklight\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sanoj688","CreatedById":83090,"CreatedDateTime":"2014-04-26T21:30:04Z","Content":"\n\u003Cp\u003EI\u0027m not sure if this was known already, but if you get the \u0027space center\u0027 bug where you can\u0027t open the VAB and such, you don\u0027t need to alt\u002Bf4. You can open the KMP menu, go to options and then do disconnect\u0026amp;exit.\u003C/p\u003E\u003Cp\u003ESorry if this was already known xD, by the way I wish you good luck in improving this. KSP multiplayer is awesome\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-26T21:33:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sanoj688\u0022 data-cite=\u0022sanoj688\u0022\u003E\u003Cdiv\u003EI\u0027m not sure if this was known already, but if you get the \u0027space center\u0027 bug where you can\u0027t open the VAB and such, you don\u0027t need to alt\u002Bf4. You can open the KMP menu, go to options and then do disconnect\u0026amp;exit.\u003Cp\u003ESorry if this was already known xD, by the way I wish you good luck in improving this. KSP multiplayer is awesome\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you know whether it still has the bug after reconnection?\u003C/p\u003E\n"},{"CreatedByName":"Uberlyuber","CreatedById":97462,"CreatedDateTime":"2014-04-27T04:27:11Z","Content":"\n\u003Cp\u003EWow. This really is an AMAZING mod. Thank you.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Houston, we have a problem:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://imgur.com/6aATG4E\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/6aATG4E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T05:12:25Z\u0022 title=\u002204/27/2014 05:12  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by Uberlyuber\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-04-27T06:59:21Z","Content":"\n\u003Cp\u003EUberlyuber - Run the server in blacklist mode and don\u0027t specify and files to ban. Although I don\u0027t think the development version bans .mbm\u0027s \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sanoj688","CreatedById":83090,"CreatedDateTime":"2014-04-27T20:06:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EDo you know whether it still has the bug after reconnection?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe bug goes away, although I guess you always have the random chance it simply happens again, but it\u0027s worth a try. Much faster than restarting the game.\u003C/p\u003E\n"},{"CreatedByName":"veniteo","CreatedById":18626,"CreatedDateTime":"2014-04-27T23:22:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sanoj688\u0022 data-cite=\u0022sanoj688\u0022\u003E\u003Cdiv\u003EThe bug goes away, although I guess you always have the random chance it simply happens again, but it\u0027s worth a try. Much faster than restarting the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edoes anyone have an active server/a list of servers i can join?\u003C/p\u003E\n"}]}