{"TopicId":51076,"ForumId":34,"TopicTitle":"KMP v0.1.5.1 [0.23] [alpha] [inactive]","CreatedByName":"TehGimp666","CreatedById":61424,"CreatedDateTime":"2013-10-29T16:27:34Z","PageNum":54,"Articles":[{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2014-01-08T21:02:25Z","Content":"\n\u003Cp\u003EEdited as godarklight decided to show his knowledge \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-08T21:33:09Z\u0022 title=\u002201/08/2014 09:33  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 8, 2014\u003C/time\u003E by Yilmas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-01-08T21:28:46Z","Content":"\n\u003Cp\u003E@Wilmotron: It sounds like the joystick is still being detected somehow by KSP. Perhaps try rebooting with it unplugged?. It sounds like it has something to do with input locks.\u003C/p\u003E\u003Cp\u003E@soulmakerpl: That usually means it\u0027s not installed correctly :-/\u003C/p\u003E\u003Cp\u003E@YellowDart: The hardcoded error messages do say what mods are missing, but if you are a small group just tell them to use the mod pack you made \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. I made a form of mod manager where it re-arranges GameData and backs up mods in GameData-KMPModControl, it\u0027s on my build page. It\u0027s helpful for playing on different modded servers - but it\u0027s a command line program atm.\u003C/p\u003E\u003Cp\u003E@ChronicSilence: Fork \u003Ca href=\u0022https://github.com/TehGimp/KerbalMultiPlayer\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/TehGimp/KerbalMultiPlayer\u003C/a\u003E, do your magic, then pull request it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. It\u0027s handy to jump on IRC where most devs and server operators hang out: irc.esper.net #KMP.\u003C/p\u003E\u003Cp\u003E@SCVsUnion: I knew that would happen eventually. I talked to ryan about putting that file in memory but he said it\u0027s a good idea to see what config the server has. That file must be changed on the server, the client one gets overwritten on connect.\u003C/p\u003E\u003Cp\u003EEDIT: Also note KMPPartList.txt is completely unused now.\u003C/p\u003E\n"},{"CreatedByName":"SCVsUnion","CreatedById":100394,"CreatedDateTime":"2014-01-08T21:57:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@SCVsUnion: I knew that would happen eventually. I talked to ryan about putting that file in memory but he said it\u0027s a good idea to see what config the server has. That file must be changed on the server, the client one gets overwritten on connect.\u003C/p\u003E\u003Cp\u003EEDIT: Also note KMPPartList.txt is completely unused now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the response godarklight. So my problem is that I\u0027m running the server on the same machine as I\u0027m running the client. If I understand correctly, I need to run the server on a different computer? Or maybe I\u0027m not understanding... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2014-01-08T22:22:55Z","Content":"\n\u003Cp\u003EThe server can be run on the same computer. However, you need to change the file in the server folder, and not in your kmp plugin folder.\u003C/p\u003E\n"},{"CreatedByName":"Runalotski","CreatedById":100448,"CreatedDateTime":"2014-01-09T04:26:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bondematt\u0022 data-cite=\u0022bondematt\u0022\u003E\u003Cdiv\u003EHas anyone gotten this to work with Mechjeb?\u003Cp\u003EI edited \u0022KMPPartList.txt\u0022 in place with a shotgun approach and it still says the part is not allowed when I try to launch with the side attached Mechjeb part.\u003C/p\u003E\u003Cp\u003EThe names I used:\u003C/p\u003E\u003Cp\u003Emumech_MJ2_Pod\u003C/p\u003E\u003Cp\u003Emumech_MJ2_AR202\u003C/p\u003E\u003Cp\u003EMechJeb2_AR202\u003C/p\u003E\u003Cp\u003EMechJeb2_Pod\u003C/p\u003E\u003Cp\u003EMechJeb 2 (AR202 case)\u003C/p\u003E\u003Cp\u003EI\u0027ve also tried without the last one just incase it messes up at spaces or something. Restarted both server and client.\u003C/p\u003E\u003Cp\u003Eand has anyone tried Kethane?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes under scores need to be replaced by periods and it is the only the first two that you need so it will be :\u003C/p\u003E\u003Cp\u003Emumech.MJ2.Pod\u003C/p\u003E\u003Cp\u003Emumech.MJ2.AR202\u003C/p\u003E\u003Cp\u003Ei have used these names in my server and it works.\u003C/p\u003E\u003Cp\u003Ei found this info in the \u0022kmp sever\u0022 folder in the KMPmodControl.txt file\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-01-09T07:11:13Z","Content":"\n\u003Cp\u003EAny ETA for the next patch?\u003C/p\u003E\u003Cp\u003EAlso, I haven\u0027t been keeping an eye on git, what will be included for the release?\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-01-09T11:54:12Z","Content":"\n\u003Cp\u003EBecause of a few questions regarding the server and mods, I\u0027ve made a server documentation file, currently work in progress. The final version may contain more or less humor.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/godarklight/KerbalMultiPlayer/blob/docs/docs/user/server-config.md\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/godarklight/KerbalMultiPlayer/blob/docs/docs/user/server-config.md\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E@KvickFlygarn87: Most people have been concentrating on things for 0.1.6, but there\u0027s been a few fixes for 0.1.5.1\u003C/p\u003E\u003Cp\u003EProbably the most notable for everyone:\u003C/p\u003E\u003Cp\u003ECareer mode should now work without loosing science points\u003C/p\u003E\u003Cp\u003ESomething that obsoletes my command line chat program:\u003C/p\u003E\u003Cp\u003ELinux users can now type in chat without fear of staging their rockets\u003C/p\u003E\u003Cp\u003EAnd the ton of things gimp does. He will make the changelog when it\u0027s released. A release date has not been discussed yet though.\u003C/p\u003E\u003Cp\u003EYou can always check KMP\u0027s pulse if needed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/TehGimp/KerbalMultiPlayer/pulse\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/TehGimp/KerbalMultiPlayer/pulse\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spider0804","CreatedById":10868,"CreatedDateTime":"2014-01-09T12:16:30Z","Content":"\n\u003Cp\u003EWhat I would like more than anything else is an easier way to delete ships, every day I have to delete about 15 ships that do not auto delete and I got to enter those super long codes.\u003C/p\u003E\u003Cp\u003E5 of us play on the server.\u003C/p\u003E\n"},{"CreatedByName":"AlchemicalAgent","CreatedById":90478,"CreatedDateTime":"2014-01-09T20:15:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spider0804\u0022 data-cite=\u0022Spider0804\u0022\u003E\u003Cdiv\u003EWhat I would like more than anything else is an easier way to delete ships, every day I have to delete about 15 ships that do not auto delete and I got to enter those super long codes.\u003Cp\u003E5 of us play on the server.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI came to ask the same thing. Any ship that stays in orbit, splashes down, or lands outside of the Kirbin safety bubble continues to reappear after recovery/deletion. Ships where the command pod or probe core are destroyed are removed as normal.\u003C/p\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-01-09T21:40:35Z","Content":"\n\u003Cp\u003EAlright, finally registered on the forums to post in your thread. There goes my anonymous lurker status! I\u0027ve been able to get just about every mod I\u0027ve wanted to working correctly...until KMP came along...curses and krakens!\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027ve been experiencing the \u0022lost science\u0022 issues in 1.5.0 as well as a lot of random crazy flights showing up on the map. A few observations I\u0027ve noted, related or not:\u003C/p\u003E\u003Cp\u003E1. When I *try* to get this problem to to repeat, it refuses to set me back to first day career mode.\u003C/p\u003E\u003Cp\u003E2. It\u0027s not only that you lose your science status at the science building, even worse it still keeps track of what experiments you\u0027ve already completed. This prevents you from getting that first five points just by doing some science on the launch platform. You\u0027re totally screwed if you\u0027ve been to the moon already when it resets!\u003C/p\u003E\u003Cp\u003E3. I noticed that while the \u0027revert\u0027 button is missing in KMP, you can still throttle up and get the orange \u0027space center\u0027 button, allowing you to roll back a flight that you botched. It may be coincidental but I found that when one of the three people playing was constantly doing this we had the science building reset issue. After he left I personally didn\u0027t have a science reset issue, and I logged in and out a few times to test. \u003C/p\u003E\u003Cp\u003E3a. This also seemed to cause a LOT of odd issues with ships not being recovered. If I logged out and logged back on, I could go to the tracking station and see all sorts of crazy things. Three Bill Kermans in orbit around the moon...IN EVA. Ships that were in the future and the past. Random ships on the launch pad. Chaos and mayhem!\u003C/p\u003E\u003Cp\u003EAlso, we are running the server on a Centos platform, and when I start up I get this error after the /start command:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E[23:18:31] [info] : Command Input: /start\u003Cp\u003E[23:18:31] [Error] : Unexpected exception encountered! Crash report written to log file\u003C/p\u003E\u003Cp\u003E[23:18:31] [Error] : System.Data.SQLite.SQLiteException: SQL logic error or missing database\u003C/p\u003E\u003Cp\u003EFailed to initialize logging.\u003C/p\u003E\u003Cp\u003E at System.Data.SQLite.SQLiteLog.Initialize () [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at System.Data.SQLite.SQLiteConnection..ctor (System.String connectionString, Boolean parseViaFramework) [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at System.Data.SQLite.SQLiteConnection..ctor (System.String connectionString) [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at (wrapper remoting-invoke-with-check) System.Data.SQLite.SQLiteConnection:.ctor (string)\u003C/p\u003E\u003Cp\u003E at KMPServer.Server.startDatabase () [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at KMPServer.Server.clearState () [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at KMPServer.Server.hostingLoop () [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E at KMPServer.ServerMain.hostServer (KMPServer.ConfigStore settings) [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/p\u003E\u003Cp\u003E[23:18:31] [info] : Loading universe...\u003C/p\u003E\u003Cp\u003E[23:18:31] [info] : Universe OK.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe odd thing is, after the Universe OK statement, I can type /start again and it loads fine. So what\u0027s going on here exactly?\u003C/p\u003E\u003Cp\u003EIs it safe to assume we should NOT be using the throttle up return to space center work around?\u003C/p\u003E\u003Cp\u003ELastly, I\u0027ve seen a few posts here and there about 1.5.1 taking care of the career issue, but I see no place to get this. I\u0027ve been to the github but to be honest it\u0027s like I\u0027m Jeb trying to read a flight manual when I\u0027m there. It\u0027s all a jumble of mumbo jumbo that I can\u0027t follow and I just want to fly my rockets!!! Hahah. So please, if there\u0027s a fix for this somewhere explain what I need to do to get it.\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2014-01-09T22:28:01Z","Content":"\n\u003Cp\u003Edownload and use the dev version. It solve the problem about science.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://chrisand.no-ip.info:82/kmp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://chrisand.no-ip.info:82/kmp/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-01-09T23:05:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peder\u0022 data-cite=\u0022Peder\u0022\u003E\u003Cdiv\u003Edownload and use the dev version. It solve the problem about science.\u003Cp\u003E\u003Ca href=\u0022http://chrisand.no-ip.info:82/kmp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://chrisand.no-ip.info:82/kmp/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh! Thanks for that! I remember reading something about his dodgy server, but I thought it was a KMP server that I\u0027d go play on. I notice it doesn\u0027t have the all the files in the download, for the server side at least. Do I just copy these files into the 1.5.0 folder and overwrite? The rest of the files stay the same I\u0027m guessing? What about the client side? Giving it all a test right now to see, but thought I\u0027d ask while I\u0027m doing all that.\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2014-01-10T00:12:01Z","Content":"\n\u003Cp\u003EWhen I use the dev version, then I always play with both the dev client/server \u003C/p\u003E\u003Cp\u003EI recommend that you make a fresh install of both server/client, and that you do not use your old KMP save game so you avoid problems.. \u003C/p\u003E\u003Cp\u003EPersonal I run all dev versions in sandbox mode and avoid career mode. Reason are then all players can use all ships and there are no limited to who have what science or parts/modules.\u003C/p\u003E\u003Cp\u003E- Yes you are correct there are maybe missing some files if you compare your \u0022old\u0022 version and the new... When you download the server you need to put 3 files in your server folder, and also the very first time you run the server it will create some files. So that is why you see less files than with your old server.\u003C/p\u003E\u003Cp\u003EYou properbly know the below step by step guide, but in case it can help other people then I write it again ;-)\u003C/p\u003E\u003Cp\u003E0). Copy 3 files from Kerbal Space Program\\KSP_Data\\Managed\u003C/p\u003E\u003Cp\u003Enamed \u003C/p\u003E\u003Cp\u003Eassembly-CShard.dll\u003C/p\u003E\u003Cp\u003EAssembly_csharp-firstpass.dll\u003C/p\u003E\u003Cp\u003Eunityscript.lang.dll\u003C/p\u003E\u003Cp\u003ECopy them and put in your server folder.\u003C/p\u003E\u003Cp\u003E1). right click the server exe and choose run as admin.\u003C/p\u003E\u003Cp\u003E2). type either /mode sandbox or /mode career\u003C/p\u003E\u003Cp\u003E3). type /start\u003C/p\u003E\u003Cp\u003E4). Type /dekessler 10 ( then it will automatic clean up debris every 10 minutes ).\u003C/p\u003E\u003Cp\u003ETo stop the server type /quit and it will save the data and close the window.. \u003C/p\u003E\u003Cp\u003ENext time you start the server just type /start and it should work like you left it..\u003C/p\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-01-10T01:04:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peder\u0022 data-cite=\u0022Peder\u0022\u003E\u003Cdiv\u003EWhen I use the dev version, then I always play with both the dev client/server \u003Cp\u003EI recommend that you make a fresh install of both server/client, and that you do not use your old KMP save game so you avoid problems.. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I get that. That\u0027s what I\u0027ve done. What I\u0027m saying is that when I downloaded the dev version it had four files whereas the 1.5.0 release version had many more in the zip. The program wouldn\u0027t run if I only used those four files. What I did was extract the 1.5.0 version than extracted the dev version over it. It seemed to work, although oddly it wouldn\u0027t run in sandbox mode, only in career.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-10T01:10:02Z\u0022 title=\u002201/10/2014 01:10  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 10, 2014\u003C/time\u003E by Vladthemad\u003C/strong\u003E\n\u003Cbr\u003ESpelling Correction\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-01-10T01:45:55Z","Content":"\n\u003Cp\u003E@Spider0804/AlchemicalAgent: I commented on that bug report, When I can confirm it I\u0027ll reopen it.\u003C/p\u003E\u003Cp\u003E@Vladthemad:\u003C/p\u003E\u003Cp\u003E1-2: *Should* be fixed in dev.\u003C/p\u003E\u003Cp\u003E3: I\u0027ve noticed that too. I intend to reallow reverting and physwarping, and stopping the \u0022User kicked for being too slow\u0022 messages. The time would catch up when you\u0027re back on the pad / in flight.\u003C/p\u003E\u003Cp\u003E4. Usually that\u0027s caught and it rebuilds the database if it\u0027s missing or bad. Nothing\u0027s wrong after the database exists :-/\u003C/p\u003E\u003Cp\u003EMy build server isn\u0027t actually dodgy, but I just wanted to let the people using it know that things can break in the development version. It sounds like my build script is messing up on the packaging.\u003C/p\u003E\u003Cp\u003EYou have the right idea updating from 0.1.5 though, for the client you only need to replace KerbalMultiPlayer.dll, for the server you have to replace KerbalMultiPlayer.dll and KMPServer.exe.\u003C/p\u003E\n"},{"CreatedByName":"mnau","CreatedById":88446,"CreatedDateTime":"2014-01-10T18:41:55Z","Content":"\n\u003Cp\u003Ehey guys i have a problem sometimes i cant launch any ship in my server idk why... i press the launch button and it just locks up or something... and when i try to launch a ship from space centre from launchpad it does some weird zoom from kerbin... can someone help me pls?\u003C/p\u003E\n"},{"CreatedByName":"matcr","CreatedById":100652,"CreatedDateTime":"2014-01-10T19:42:05Z","Content":"\n\u003Cp\u003ETwo i7 equipped computers with 16 gb of ram each, win 7 x64, 1 meter apart from each other, connected directly via LAN cable (1gb/s), no mods, clean install and docking, flying close or even driving by is impossible. I tried fiddling with the settings, most importantly updates per second and it\u0027s still like second player\u0027s ship has some kind of parkinson ;/, constantly blowing up and ship jumping to hyperspace when ~2,5 km from each other. I know it is mentioned in known issues section, but with my \u0022perfect\u0022 setup i cant possibly imagine playing this over hamachi. Either that or I am doing something wrong. I dont suppose that linux x64 kerbal version runs this any better? Is there some recommended server config?\u003C/p\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-01-10T19:50:39Z","Content":"\n\u003Cp\u003EGodarklight, or anyone that might know...regarding the issue where Kerbals show up in odd places on login. Frigging Jeb is on the MUN! Normally I just recover him when he\u0027s somewhere on Kerbin when I log in, but um...you can\u0027t exactly do that when he\u0027s on the Mun. The problem is when this happens those Kerbals aren\u0027t usable...so my question is, if I \u0022terminate\u0022 him will he be back in the roster if I log out an log back in? I NEEDZ MAH JEBZ!!!!\u003C/p\u003E\u003Cp\u003EEdit: Ok weird...I posted that before logging on today, and overnight it appears he\u0027s miraculously made his way back to Kerbin without a ship. Is there anything Jeb can\u0027t do?!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-10T19:54:45Z\u0022 title=\u002201/10/2014 07:54  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 10, 2014\u003C/time\u003E by Vladthemad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-01-10T21:33:18Z","Content":"\n\u003Cp\u003E@mnau, does it look like this?:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/MRcetShcw8Q?start=141\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E (Bug #557)\u003Cp\u003EI suspect it\u0027s a KSP bug, but it seems to become very common with KMP...\u003C/p\u003E\u003Cp\u003E@Vladthemad: I would totally laugh if it\u0027s just another player messing with you. Leaving Jeb stranded seems a little odd though... I usually care about my kerbals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I haven\u0027t heard of this bug before...\u003C/p\u003E\u003Cp\u003EEDIT: Welcome to the forums matcr\u003C/p\u003E\u003Cp\u003EIt seems something\u0027s up with docking mode, the vessel updates are sent 3 times a second which is why you see jumpyness. However you should see the same thing from both computers, It worked in 0.1.4.2, but 0.1.5 looks like there is a problem with it :-/\u003C/p\u003E\u003Cp\u003EEDIT 2: My interim server is up and running again, chrisand.no-ip.info 2076. I\u0027m profiling the server and think I\u0027ve worked out the source of the lag, but need some actual players to hammer it for a while to see if it breaks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. It\u0027s compatible with the release 0.1.5 (I think).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-11T07:21:16Z\u0022 title=\u002201/11/2014 07:21  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 11, 2014\u003C/time\u003E by godarklight\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mnau","CreatedById":88446,"CreatedDateTime":"2014-01-11T13:02:19Z","Content":"\n\u003Cp\u003Efixed it... i have to launch any plane before launching the ship itll clear the launch pad but i have another problem... whenever i go to tracking station in any server it laggs like crazy...\u003C/p\u003E\n"},{"CreatedByName":"Spider0804","CreatedById":10868,"CreatedDateTime":"2014-01-11T18:04:56Z","Content":"\n\u003Cp\u003EWhen you pick up a flag it does not delete, it re appears the next time you log in.\u003C/p\u003E\n"},{"CreatedByName":"Vladthemad","CreatedById":100533,"CreatedDateTime":"2014-01-11T21:07:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E@Vladthemad: I would totally laugh if it\u0027s just another player messing with you. Leaving Jeb stranded seems a little odd though... I usually care about my kerbals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I haven\u0027t heard of this bug before...\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI take care of mine too. Jeb had made the return to Kerbin in his lunar lander. He just magically made it back to the moon afterward! It seems to be the same glitch that leaves ghost vessels sometimes. I assume it self corrected.\u003C/p\u003E\u003Cp\u003EYou had mentioned possibly making it so you can revert and possibly physics warp. I had an idea about that. Perhaps make launches in their own instance, not becoming part of the KMP until you have left back to the space center or the ship gets above a certain height? This would let me freely crash and revert repeatedly until I get it right without causing any multiplayer craziness. Don\u0027t know if that could be useful, but seemed like an easy and safe way to deal with it and thought I\u0027d share. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-11T23:35:24Z","Content":"\n\u003Cp\u003Edid i download a wrong thing?\u003C/p\u003E\u003Cp\u003Ebut i can\u0027t find a sever nor join any nor create any, WHAT DO I DO?\u003C/p\u003E\u003Cp\u003EEveryone has servers and everything, But all those \u0022Servers\u0022 Don\u0027t even show up.\u003C/p\u003E\u003Cp\u003EEither explain why this is happening, Please. Or tell me if im downloading the wrong one and correct me with a link?\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2014-01-11T23:53:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lolaks\u0022 data-cite=\u0022Lolaks\u0022\u003E\u003Cdiv\u003Edid i download a wrong thing?\u003Cp\u003Ebut i can\u0027t find a sever nor join any nor create any, WHAT DO I DO?\u003C/p\u003E\u003Cp\u003EEveryone has servers and everything, But all those \u0022Servers\u0022 Don\u0027t even show up.\u003C/p\u003E\u003Cp\u003EEither explain why this is happening, Please. Or tell me if im downloading the wrong one and correct me with a link?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E \u003Ca href=\u0022http://kerbal.wlsing.nl/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbal.wlsing.nl/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand I recommend to visit page 1 of this forum tread there is a long list of Faq and a guide ;-)\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-01-12T08:20:35Z","Content":"\n\u003Cp\u003E@Lolaks: Servers don\u0027t automatically show up, you would be after the add server button in the main menu.\u003C/p\u003E\u003Cp\u003EWe don\u0027t want to rely on any central server from what I understand, although technically that would be possible to implement...\u003C/p\u003E\u003Cp\u003EI put the server list that Peder linked in my signature because of the sheer amount of posting I do on here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@Everyone: Just trying to keep you all updated, If we don\u0027t skip 0.1.5.1, these are probably the current blockers:\u003C/p\u003E\u003Cp\u003EIssue 555, assigned to: godarklight: Constant 100% cpu usage on KMPServer \u003Ca href=\u0022https://github.com/tehgimp/kerbalmultiplayer/issues/555\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/tehgimp/kerbalmultiplayer/issues/555\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIssue 577, assigned to: nobody: Unable to terminate ships for good. \u003Ca href=\u0022https://github.com/tehgimp/kerbalmultiplayer/issues/577\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/tehgimp/kerbalmultiplayer/issues/577\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf we do skip it, we\u0027ve got a few things ready to be merged in and some really close:\u003C/p\u003E\u003Cp\u003Eclient-side-priority-splitting: Basically better management of the TCP stream. Talking in chat while uploading screenshots and syncing will work completely fine. Oh... And no UDP dropouts. Ever.\u003C/p\u003E\u003Cp\u003Entp-sync: Instead of getting the user to skip time and get kicked if they are too slow for too long, the game will dynamically warp them (1.05, 1.1, 1.5x) them similar to how NTP works.\u003C/p\u003E\u003Cp\u003Etoolbar-support: If we like it.\u003C/p\u003E\u003Cp\u003Eserver-side-modcontrol-upgrade: Basically dump the mods in a Required and Optional folder and /modgen will do the rest of the work making a KMPModControl.txt file for you.\u003C/p\u003E\u003Cp\u003EAs per usual: I would have missed a ton of things. Gimp has avada kedavra\u0027ed the bug with career mode (and many others) so you will be able to SCIENCE!!! with your friends \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-12T13:06:01Z\u0022 title=\u002201/12/2014 01:06  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 12, 2014\u003C/time\u003E by godarklight\u003C/strong\u003E\n\u003C/span\u003E\n"}]}