{"TopicId":51098,"ForumId":44,"TopicTitle":"Why are so many people opposed to nuclear energy?","CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T21:23:43Z","PageNum":1,"Articles":[{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T21:23:43Z","Content":"\n\u003Cp\u003EPerhaps I have been reading too much Asimov, but nuclear energy seems to be a much better alternative to oil than wind power or solar power. Nuclear energy (particularly fusion) is very clean, (when done correctly) safe, and reliable. This being the case why are so many people opposed to nuclear energy, my best guess would be many from the cold war era are frightened by the very mentioning of... NUCLEAR! This seems very presumptuous and frankly an unfounded fear.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-10-29T21:27:56Z","Content":"\n\u003Cp\u003EWell, it depends as a start which sort of nuclear you mean. There is the standard fission one everyone thinks of that makes enriched plutonium for bombs, then there is the thorium reactor (which is great, we should have more of those) and at some point we may have nuclear fusion.\u003C/p\u003E\u003Cp\u003EI\u0060d say the cheap, safe thorium reactors are the way to go unless we get fusion.\u003C/p\u003E\n"},{"CreatedByName":"Warhorse","CreatedById":83495,"CreatedDateTime":"2013-10-29T21:28:03Z","Content":"\n\u003Cp\u003EBut .. but ... ZOMG! NOOKYOOLUR! MUSHROOM CLOUDS! RADIOACTIVE WASTE! AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA!!!!!111!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E[/sarc]\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-10-29T21:30:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EWell, it depends as a start which sort of nuclear you mean. There is the standard fission one everyone thinks of that makes enriched plutonium for bombs, then there is the thorium reactor (which is great, we should have more of those) and at some point we may have nuclear fusion.\u003Cp\u003EI\u0060d say the cheap, safe thorium reactors are the way to go unless we get fusion.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThorium reactors produce U\u003Csup\u003E233\u003C/sup\u003E, which is perfectly usable as bomb material. The nation with the most advanced thorium reactor program (India) has already tested a U\u003Csup\u003E233\u003C/sup\u003E bomb.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T21:31:22Z","Content":"\n\u003Cp\u003EI believe that fusion should be the primary focus of agency\u0027s like NASA or DOE. Or at least thorium reactors.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T21:32:05Z","Content":"\n\u003Cp\u003EEven more reason for the US to look into thorium.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-10-29T21:37:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EPerhaps I have been reading too much Asimov, but nuclear energy seems to be a much better alternative to oil than wind power or solar power. Nuclear energy (particularly fusion) is very clean, (when done correctly) safe, and reliable. This being the case why are so many people opposed to nuclear energy, my best guess would be many from the cold war era are frightened by the very mentioning of... NUCLEAR! This seems very presumptuous and frankly an unfounded fear.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople are afraid of nuclear energy is because \u003Cstrong\u003Ethey do not understand\u003C/strong\u003E how it works.\u003C/p\u003E\u003Cp\u003EThe general population knows absolutely -nothing- about radiation, what it is, how it works, and what effects it has. All they know is that it can kill you without being able to do anything about it. \u003C/p\u003E\u003Cp\u003EThis makes them terrified, it is untouchable yet as far as they know it is going to kill all of them with nowhere to hide.\u003C/p\u003E\u003Cp\u003EIf they knew how it worked, and nuclear power was not complete magic to them, they would not be so scared.\u003C/p\u003E\u003Cp\u003ESome studies even pointed out, that after a nuclear disaster, the fear of radiation did more harm to people (stress, depression, increased suicide rates) than the fallout itself!\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2013-10-29T21:42:08Z","Content":"\n\u003Cp\u003ENuclear isn\u0027t economical anymore even with its benefits. 4 plants have gone out this year, replaced by gas and renewables.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-10-29T21:52:11Z","Content":"\n\u003Cp\u003EThere are multiple factors that make the average population fear nuclear energy:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe potential to go really, really, really bad. Chances of that are of course astronomically small, but for the same reason people play the powerball, they don\u0027t understand probability with very large numbers. Coal plants don\u0027t blow up. Gas/oil plants \u003Cem\u003Emight\u003C/em\u003E blow up but seriously, what can happen. But in the rare event a nuclear plant goes haywire an area in a radius of 10km or more is made uninhabitable for decades.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt\u0027s witchcraft. At least, that\u0027s how it\u0027s perceived. People don\u0027t understand it and it\u0027s a natural tendency to fear the unknown.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe notion of \u0022\u003Cem\u003Eit\u0027s safe when dealt with properly\u003C/em\u003E\u0022 is there, but the nuclear industry has a history right from it\u0027s inception of taking regulatory shortcuts, running dangerous experiments and when something goes wrong plainly lie to the public in practically any event (Fukushima showed that once again).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECombine the previous two: you \u003Cem\u003Eknow\u003C/em\u003E when a coal/oil plant has problems. Or when a windturbine has issue. You can see it, hear it, feel it. With nuclear energy you\u0027ll have to trust what management of the local plant is telling. And once again, the track record is not very encouraging.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENow I\u0027m not saying I agree with or support the above point, but the OP\u0027s question was why people in general don\u0027t trust Nuclear power, not what \u003Cem\u003EI\u003C/em\u003E think about it.\u003C/p\u003E\n"},{"CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2013-10-29T21:58:01Z","Content":"\n\u003Cp\u003EBecause people are stupid. Most people don\u0027t know jack about how a nuclear reactor works or what radiation exactly is. And nobody really cares to find out. When you ask a common anti-nuclear activist to tell how a nuclear reactor works you\u0027ll get an answer in the line of \u0022Well uhh... uhh... It gives you cancer... And cancer is bad.\u0022. \u003C/p\u003E\u003Cp\u003EThe big problem for people is the atomic bomb. Even though it functions in a completely different way than a nuclear reactor people know the A-bomb is nuclear. And during the cold war people got really afraid of the A-bomb. (and who shouldn\u0027t be scared we had/have enough ammunition totalled to kill the world 3 times over). In fact. Yesterday I learned that the biggest demonstration ever in my home country (The Netherlands) was against the storage of atomic bombs on Dutch soil. \u003C/p\u003E\u003Cp\u003EWhen you mention nuclear power a simple peoples mind goes like this : \u003C/p\u003E\u003Cp\u003ENuclear reactor = nuclear\u003C/p\u003E\u003Cp\u003EAtomic bomb = nuclear\u003C/p\u003E\u003Cp\u003EAtomic bomb = bad\u003C/p\u003E\u003Cp\u003ENuclear reactor = bad\u003C/p\u003E\u003Cp\u003EThen there is also Chernobyl. We could have a long big discussion about the Chernobyl reactor (and I would love to read / contribute to it). But the only reason the accident happened was because of mismanagement and poor construction. But this made people even more scared of nuclear power. This is still a recent happening, in the fact that when I was a baby my parent\u0027s where told by our government not t feed kids from home grown crops because they could be contaminated by the radioactive cloud comming over Europe. Whether they are right or not. This scared a lot of mothers / caring parents of radioactive reactors.\u003C/p\u003E\u003Cp\u003EWhat might be a little point of light for reactors is Fukushima. I know that went terribly wrong during the 2011 Earthquake / Tsunami. But to date no one died of the effects of the meltdown / radioactive leak. Granted that Tepco currently has a lot of problems cleaning it up. But for such a unique situation, Who would do well? \u003C/p\u003E\u003Cp\u003EBut also Fukushima is plagued with misinformation. The spend fuel rods are being stored in water containers. This is just like normal reactors do because water is quite the isolator. Yet people misread this and think Tepco is poring \u0027radioactive\u0027 into the sea.\u003C/p\u003E\u003Cp\u003EAnd also the media keeps reporting Fukushima as 1000 times as powerful as the Hiroshima atomic bomb. No it\u0027s not as powerful as a weapon! It\u0027s like comparing the power from your microwave to that of an handgun. \u003C/p\u003E\u003Cp\u003ELong story short. Radioactive stuff is really complicated and people do not want to learn complicated things.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T21:59:13Z","Content":"\n\u003Cp\u003EI suppose that\u0027s one disadvantage of working in a college town.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-10-29T22:02:49Z","Content":"\n\u003Cp\u003EJust wait until we have generation 4 fast reactors that:\u003C/p\u003E\u003Cp\u003E-Use thorium and nuclear waste for fuel. Yes, they can put nuclear waste to an use.\u003C/p\u003E\u003Cp\u003E-Effectively \u0022burn\u0022 all waste, causing the eventual waste to have a much much shorter lifespan.\u003C/p\u003E\u003Cp\u003E-Get up to 300 times more energy out of the same fuel. Yes, three hundred, that is not a typo.\u003C/p\u003E\u003Cp\u003E-Enhanced safety overall.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-10-29T22:10:05Z","Content":"\n\u003Cp\u003EAre you referring to fusion reactors?\u003C/p\u003E\n"},{"CreatedByName":"Rockhem","CreatedById":57141,"CreatedDateTime":"2013-10-29T22:21:37Z","Content":"\n\u003Cp\u003ENuclear fission is the best and safest power we currently have. Once fusion comes around we can hop over from fission to it.\u003C/p\u003E\u003Cp\u003ENuclear power is statistically the safest power we have, even safer than renewable. (Fukushima didn\u0027t kill one person, despite failure of the plant.) Sauce (source): \u003Ca href=\u0022http://theenergycollective.com/willem-post/191326/deaths-nuclear-energy-compared-other-causes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://theenergycollective.com/willem-post/191326/deaths-nuclear-energy-compared-other-causes\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESee that? 0.04 deaths per TWH, wind is nearly 4 times as dangerous, coal is off the charts compared to it, and solar is 10-20 times the death rate.\u003C/p\u003E\u003Cp\u003EThe only reason plants fail is because they are outdated, and past their expiration date. Why they are outdated, is because of the anti nuclear movement.\u003C/p\u003E\u003Cp\u003EWhen they protest the power plants being built, they stop the new generation, safer ones from being built and keep the old ones in service. Only 3 accidents so far which is practically a spotless record.\u003C/p\u003E\u003Cp\u003EAs for other things don\u0027t make a big boom, destroying everything in their path, there is \u003Ca href=\u0022https://www.youtube.com/watch?v=AVoDvdPUsw0\u0022 rel=\u0022external nofollow\u0022\u003Ethis.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-10-29T22:23:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hugix\u0022 data-cite=\u0022hugix\u0022\u003E\u003Cdiv\u003EBecause people are stupid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you obviously feel that you\u0027re enlightened on the subject, can I suggest that you provide some more references for those of us who are too \u0022stupid\u0022 to share your viewpoint? I\u0027m afraid that the tone of your post doesn\u0027t compel me to accept your argument without further research.\u003C/p\u003E\u003Cp\u003EI am open to nuclear energy as an alternative to oil, but I am concerned about widespread use of energy technology that generates dangerous waste that must be isolated for millennia and that has the potential to render large areas uninhabitable when things go wrong. I have friends who are engineers working in the nuclear power industry and respect their technical expertise, and I do not equate nuclear reactors to atomic bombs. Even so I agree with the level of caution that surrounds more widespread adoption of nuclear power to solve our energy needs for the reasons that I mentioned above.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-10-29T22:24:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hugix\u0022 data-cite=\u0022hugix\u0022\u003E\u003Cdiv\u003EWhat might be a little point of light for reactors is Fukushima. I know that went terribly wrong during the 2011 Earthquake / Tsunami. But to date no one died of the effects of the meltdown / radioactive leak. Granted that Tepco currently has a lot of problems cleaning it up. But for such a unique situation, Who would do well? \u003Cp\u003EBut also Fukushima is plagued with misinformation. The spend fuel rods are being stored in water containers. This is just like normal reactors do because water is quite the isolator. Yet people misread this and think Tepco is poring \u0027radioactive\u0027 into the sea.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been working in and around radiation and nuclear reactions my whole career: both fission and fusion. So I\u0027m hardly an anti-nuclear activist. But Fukushima is an ongoing disaster. It is actually still leaking water contaminated with fairly long-lived radiating particles into the ocean. As recently as a couple weeks ago, pumping facilities there were overwhelmed by rainwater and leaked out.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.reuters.com/article/2013/10/21/us-japan-fukushima-strontium-idUSBRE99K01B20131021\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reuters.com/article/2013/10/21/us-japan-fukushima-strontium-idUSBRE99K01B20131021\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPeople have a problem with fission because it\u0027s hard and expensive and, yes, undoubtedly dangerous. (Fusion is not a reality and won\u0027t be for decades.) It does no good to downplay the risks associated with these technologies. You can\u0027t shut a nuclear reactor down and walk away; it has to be watched and cooled and maintained 24/7 for the life of the reactor and well beyond. Nuclear plant materials are subjected to extreme conditions of heat and humidity and radiation. It is difficult to make electronics, for instance, that will work properly in a high-rad environment. The materials age rapidly and maintenance becomes overwhelming. There is constant regulatory pressure because of the dire consequences of missing any detail that might cause catastrophe, which extracts a toll on personnel. The major plant near me (San Onofre, which you see a couple hundred meters away from the freeway as you drive from San Diego to Los Angeles) has been shut down for a year or so now because a couple thousand of the steam generator u-tubes were found to be prematurely near failure.\u003C/p\u003E\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2013-10-29T22:24:42Z","Content":"\n\u003Cp\u003ESadly, too many people are horribly ignorant in this world, and don\u0027t care to learn anything that doesn\u0027t directly affect their lives.\u003C/p\u003E\u003Cp\u003ESpica\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-10-29T22:33:21Z","Content":"\n\u003Cp\u003EThis is a big problem in my area, the local council members here don\u0027t know squat about how nuclear energy works. As a result the power plant in Fort Calhoun has been shut down for a almost a year while they sit there arguing about it. Electricity was dirt cheap here before they shut it down.\u003C/p\u003E\u003Cp\u003EEDIT: Some people don\u0027t understand that nuclear reactors don\u0027t work like bombs...\u003C/p\u003E\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2013-10-29T22:56:37Z","Content":"\n\u003Cp\u003EI feel the same will happen to Indian Point Power Plant.\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-10-29T22:59:00Z","Content":"\n\u003Cp\u003EMy guess is that the Green Peace gurus are complaining about Nuclear propulsion. Even if it\u0027s clean, efficient and safe, the word NUCLEAR is so scary to them! So they start complaining and they start demanding regulations.\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2013-10-29T23:02:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThe major plant near me (San Onofre, which you see a couple hundred meters away from the freeway as you drive from San Diego to Los Angeles)...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI spent six years in the U.S. Navy running nuclear power plants on submarines. I remember an instructor in nuke school who said, \u0022When you ask any person in downtown San Diego, half a mile from the sub base, where the nearest nuclear reactor is, they\u0027ll say, \u0027San Onofre\u0027. And we want to keep it that way.\u0022 It\u0027s all about perception. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EChernobyl was easily the worst nuclear accident in history, Fukushima notwithstanding. To date, 27 years later, the only long-term health effects that have been conclusively connected to the radiation released at Chernobyl have been approximately 3,000 cases of thyroid cancer. If instead the Soviet Union had constructed a coal-fired power plant that generated the same amount of electricity over the same time period as the lifetime of Chernobyl-4, the air pollution produced would have killed tens of thousands of people through lung cancer, emphysema, and other diseases that have been directly connected to airborne micro-particle pollution. So, even after experiencing the worst nuclear disaster in history, it is still very likely that the Chernobyl-4 reactor saved more lives than it took. \u003C/p\u003E\u003Cp\u003EBut the Chernobyl disaster was all over television. Plumes of smoke visible from orbit! Radiation detectors going off in Sweden! Helicopters dropping buckets of sand trying to quench a fire in the shattered remains of a nuclear reactor! Every armchair pundit chimed in their opinion of how it was going to alter life on this planet forever. All far more dramatic than Uncle Danny quietly dying of lung cancer in a hospice when he\u0027d never smoked a single cigarette in his life. Or even 10,000 Uncle Dannys. As I said, it\u0027s all about perception. People let science and reason take a back seat to hysteria and emotion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T23:15:41Z\u0022 title=\u002210/29/2013 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003Cbr\u003EReversed my sentence.\n\u003C/span\u003E\n"},{"CreatedByName":"Superluminaut","CreatedById":58963,"CreatedDateTime":"2013-10-29T23:06:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EPerhaps I have been reading too much Asimov, but nuclear energy seems to be a much better alternative to oil than wind power or solar power. Nuclear energy (particularly fusion) is very clean, (when done correctly) safe, and reliable. This being the case why are so many people opposed to nuclear energy, my best guess would be many from the cold war era are frightened by the very mentioning of... NUCLEAR! This seems very presumptuous and frankly an unfounded fear.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUltimately I think is has the same drawbacks as oil. It produced waste and is finite. \u003C/p\u003E\u003Cp\u003EAlso both are perceived as explosive. \u003C/p\u003E\u003Cp\u003EAlso **** happens as has been proven time and time again. If a nuclear plant suffers a problem it can contaminate water, ground and clouds, which result in a butterfly effect type scenario. The water gets into plants, livestock and people, livestock and people eat the plants, people eat the livestock. At each stage the concentration of contaminants is increased. Things like milk can become very hazardous.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T23:08:50Z\u0022 title=\u002210/29/2013 11:08  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by Superluminaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shoveycat","CreatedById":71091,"CreatedDateTime":"2013-10-29T23:08:17Z","Content":"\n\u003Cp\u003EAm i the only person who ENTIRELY blames the Simpsons for Nuclear Energy\u0027s stigma?\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-10-30T00:06:11Z","Content":"\n\u003Cp\u003ERelevant XKCD (references are given on the lower left corner of the chart):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgs.xkcd.com/blag/radiation.png\u0022 alt=\u0022radiation.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2013-10-30T00:21:37Z","Content":"\n\u003Cp\u003ETo the OP.\u003C/p\u003E\u003Cp\u003ENuclear is scary, Chernobyl and Fukushima scare people, because radioactivity is black magic, and because of uncontrollable bias against risk.\u003C/p\u003E\u003Cp\u003EIf you invented a cigarette that\u0027s perfectly safe except it explodes killing you once in a million times, it would actually be safer, but people would not smoke it, because we prefer killing ourselves slowly rather than taking a tiny chance of getting a very bad outcome. And that\u0027s why we prefer burning fossil fuels that kill us slowly rather than use nuclear power that is perceived as more dangerous.\u003C/p\u003E\u003Cp\u003EAbout the waste:\u003C/p\u003E\u003Cp\u003ENuclear power plants produce horrible waste, but they produce small amount of highly concentrated waste, which makes it easy to process. Oh, and that waste can be recycled to extract the unburnt uranium and plutonium and turn it into fuel. As far as I know, most countries don\u0027t do it because making new fuel is cheaper, but France has a factory that does it (we don\u0027t like being dependent on other countries for our energy, and we don\u0027t have uranium mines).\u003C/p\u003E\u003Cp\u003EBy comparison, fossil fuels generate massive amount of diffuse waste, CO2, soot, particles, etc. Coal plants actually cause a detectable amount of radioactivity by releasing ashes that contain small amounts of radionucleides, much more than nuclear plants do.\u003C/p\u003E\u003Cp\u003EWind power requires massive amounts of steel and concrete to build, which means CO2 released. It takes years to offset that.\u003C/p\u003E\u003Cp\u003ESolar is worse, it takes an absurd amount of time to offset the energy needed to build them, although they\u0027re improving fast. And nobody knows what to do with the old ones, as they contain very toxic materials.\u003C/p\u003E\u003Cp\u003EAnother thing about nuclear: virtually all commercial reactor is built with one objective: make plutonium for bombs. They were designed and built during the cold war, and electricity was just seen as a useful side product. The development of the thorium reactor was dropped they would not produce plutonium but U233, which is not as good for bombs (risk of fizzle, shorter half life), and because the USA wanted to pay off the development costs on PWR. Other countries either didn\u0027t care for such a reactor, or didn\u0027t have the will to invest the huge effort and money required to make it a reality.\u003C/p\u003E\u003Cp\u003EBut the thorium reactor has a lot of advantages over PWR, producing much less waste, burning waste from other reactors, using a very common resource. The best advantage is that they don\u0027t use pressurized water as a coolant, which means no need for a pressurized vessel that can explode. If the chosen coolant is a molten salt, waste cannot burn and be carried by the wind as it binds to the salt that solidifies when the reactor stops. And with dissolved fuel schemes, entirely passive safety mechanisms can completely stop the reaction and remove the fuel from the reactor.\u003C/p\u003E\n"}]}