{"TopicId":51162,"ForumId":44,"TopicTitle":"Oberth Effect and FTL Travel?","CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T11:06:28Z","PageNum":1,"Articles":[{"CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T11:06:28Z","Content":"\n\u003Cp\u003EAlright, before I post this I have a little disclaimer: I like to think I know rocket science stuff, but deep down I\u0027m really an idiot - so bear with me on this one.\u003C/p\u003E\u003Cp\u003ESo, the Oberth Effect essentially means that the faster your spacecraft goes, the more speed you gain from a burn? (I think that\u0027s what it means anyway)\u003C/p\u003E\u003Cp\u003EYou start your journey far away from the Sun, around Pluto, and you began to travel towards the Sun to the minimum Periapsis possible without melting your spacecraft, and then burn about 1/5th of your fuel (Hypothetically, we have a lot of fuel. It\u0027s not infinite though.) to perform an Oberth maneuver to escape the solar system. When you escape the solar system and you have a minimal amount of gravity acting on your spacecraft, you burn the rest of your fuel prograde to get to FTL, because you are getting faster and therefore your burn is increasing your speed exponentially. (Once again, we hypothetically have enough fuel to do this.) So, I guess what I\u0027m asking is this possible, and if not, why?\u003C/p\u003E\u003Cp\u003EThanks for reading this, I hope you didn\u0027t loose too many IQ points. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-10-30T11:11:06Z","Content":"\n\u003Cp\u003ENo. Because your mass is increasing as you gain speed so it takes more and more energy to accelerate. You will never have enough fuel to get to lightspeed itself. This is why the LHC is so large. Getting particles up to 99% of lightspeed is one thing. Getting them to 99.9% is a \u003Cem\u003Ewhooole\u003C/em\u003E different ballgame, let alone beyond that; and it\u0027s impossible to get to 100%\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-10-30T11:56:58Z","Content":"\n\u003Cp\u003EThe Oberth effect says that more energy generated by the burn is deposited into the ship as it goes faster. This makes sense if you look at the equations:\u003C/p\u003E\u003Cp\u003EE = 0.5*m*v^2. So if you make v twice as big you increase your energy fourfold.\u003C/p\u003E\u003Cp\u003EBut, the acceleration of your ship is independent of your velocity. Its not like your rocket will provide more thrust or anything, it\u0027ll still accelerate at the same rate: dV = a*t\u003C/p\u003E\u003Cp\u003ESo, this means that a ship that accelerates from 0 to 100m/s takes the same time and fuel as accelerating a ship from 1000m/s to 1100m/s. But due to the quadratic nature of the kinetic energy equation the latter takes far more energy.\u003C/p\u003E\u003Cp\u003EBut, as you can see, it makes your spaceship merely more efficient. It does NOT make your rockets more powerful or magically makes your ship go faster. So you can\u0027t use this to circumvent the speed of light limit. You are right that for interstellar travel using current technology doing a sundive is probably the easiest. Though even with that velocity boost it\u0027ll still take thousands of years before you even get close to another star.\u003C/p\u003E\n"},{"CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T11:57:57Z","Content":"\n\u003Cp\u003EOh right, so the Oberth effect is only helpful up to a certain maximum speed before it becomes redundant?\u003C/p\u003E\u003Cp\u003EEdit: So what I understand now is that the Oberth effect merely decreases the amount of energy required to accelerate the faster you go?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T12:13:35Z\u0022 title=\u002210/30/2013 12:13  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by Reccy\u003C/strong\u003E\n\u003Cbr\u003ESeen Ralathon\u0026#039;s post after posting.\n\u003C/span\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-10-30T12:21:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reccy\u0022 data-cite=\u0022Reccy\u0022\u003E\u003Cdiv\u003EOh right, so the Oberth effect is only helpful up to a certain maximum speed before it becomes redundant?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah, it just gets better and better as you go faster and faster. But the reason you can\u0027t break the lightspeed is a bit more complicated. It has to do with the way the universe works when things move really really fast.\u003C/p\u003E\u003Cp\u003ESay we have 2 people. One is in a very very fast train and the other is on the station. Inside the train are 2 mirrors and a beam of light bouncing between the 2:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/idLRerQ.png\u0022 alt=\u0022idLRerQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe left picture is what the guy on the train sees, the right one is what the guy on the station sees. The path of the right lightbeam is obviously longer than that of the left one. But the universe is weird, and both guys measure the exact same speed of light. This means that it\u0027d take longer for the light to bounce from the perspective of the guy on the station (same speed, longer round trip) and the bounces would go out of sync. After a few minutes they\u0027d be screaming at each other that \u0022No really! It bounced 500 times! Not 400 you idiot!\u0022.\u003C/p\u003E\u003Cp\u003EThe only way to resolve that is to say that time slows down for the guy in the train, that way he can have the same speed of light, but because he is moving slower through time the light still has enough time to complete a bounce from the perspective of the station guy.\u003C/p\u003E\u003Cp\u003EThis is why you can never pass the speed of light. As you go faster and faster time will go slower and slower. And since acceleration is a function of time you\u0027ll accelerate slower and slower. From your own perspective everything is fine and dandy, but it\u0027ll take infinite time before you hit c from the perspective of the universe.\u003C/p\u003E\n"},{"CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T13:09:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003ENah, it just gets better and better as you go faster and faster. But the reason you can\u0027t break the lightspeed is a bit more complicated. It has to do with the way the universe works when things move really really fast.\u003Cp\u003ESay we have 2 people. One is in a very very fast train and the other is on the station. Inside the train are 2 mirrors and a beam of light bouncing between the 2:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/idLRerQ.png\u0022 alt=\u0022idLRerQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe left picture is what the guy on the train sees, the right one is what the guy on the station sees. The path of the right lightbeam is obviously longer than that of the left one. But the universe is weird, and both guys measure the exact same speed of light. This means that it\u0027d take longer for the light to bounce from the perspective of the guy on the station (same speed, longer round trip) and the bounces would go out of sync. After a few minutes they\u0027d be screaming at each other that \u0022No really! It bounced 500 times! Not 400 you idiot!\u0022.\u003C/p\u003E\u003Cp\u003EThe only way to resolve that is to say that time slows down for the guy in the train, that way he can have the same speed of light, but because he is moving slower through time the light still has enough time to complete a bounce from the perspective of the station guy.\u003C/p\u003E\u003Cp\u003EThis is why you can never pass the speed of light. As you go faster and faster time will go slower and slower. And since acceleration is a function of time you\u0027ll accelerate slower and slower. From your own perspective everything is fine and dandy, but it\u0027ll take infinite time before you hit c from the perspective of the universe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for that explanation, I was always confused by that \u0022time slowing down the faster you go\u0022 thing.\u003C/p\u003E\u003Cp\u003EStill kinda hard to wrap my head around the whole thing but I think I get the basic idea. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-10-30T13:18:36Z","Content":"\n\u003Cp\u003EAnother nice way to think about is this. We are constantly travelling through spacetime at the same overall speed. If you move faster through space you move slower through time. If you move faster through time you move slower through space.\u003C/p\u003E\n"},{"CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T13:24:57Z","Content":"\n\u003Cp\u003ESo, does that mean Astronauts who have moved slower through time are technically in the past, or are we all at the same point in time?\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-10-30T13:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reccy\u0022 data-cite=\u0022Reccy\u0022\u003E\u003Cdiv\u003EThanks for that explanation, I was always confused by that \u0022time slowing down the faster you go\u0022 thing.\u003Cp\u003EStill kinda hard to wrap my head around the whole thing but I think I get the basic idea. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn addition to the whole time slowing down thing, there\u0027s also mass to contend with.\u003C/p\u003E\u003Cp\u003E Whenever you add energy to anything, you add mass. Remember that E = mc^2 So that means that m = E / c^2 So obviously the amount of mass is tiny in most situations but as we start approaching the c we need to start adding insane amounts of energy to accelerate any faster, and that starts adding insane amounts of mass, which means further accelerations needs even more energy. And since the formula is built around c^2 then as you approach the speed of light you get to the point where adding any energy is paying off less and less, it\u0027s just adding more mass, and at c the amount of energy needed to accelerate any faster is infinite. \u003C/p\u003E\u003Cp\u003ESo time stops and your mass is infinity, and it takes infinity energy to accelerate. \u003C/p\u003E\u003Cp\u003EBasically the universe REALLY doesn\u0027t want anything to go faster than the speed of light, which is a good thing, cuz FTL makes causality paradoxes.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-10-30T13:38:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reccy\u0022 data-cite=\u0022Reccy\u0022\u003E\u003Cdiv\u003ESo, does that mean Astronauts who have moved slower through time are technically in the past, or are we all at the same point in time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I think you are miss understanding. So lets take and make the numbers bigger.\u003C/p\u003E\u003Cp\u003ELets grab twin brothers. Able and Bob, Both are 20 years old. \u003C/p\u003E\u003Cp\u003EWe\u0027ll put Able in a spaceship that can travel .99c And send it out for a trip to a star just almost 5 light years away and back, we\u0027ll round thinks and say that it\u0027s 10 years at .99c \u003C/p\u003E\u003Cp\u003EIn Able\u0027s frame of reference, time is slowed. Only 514 days went by aboard the ship, he\u0027s tired and needs to stretch his legs and decides to look his brother up since now that he\u0027s 21 he can get a drink. But Bob, is now 30.\u003C/p\u003E\u003Cp\u003EThey both stand at the same place at the same time and can see they did not age the same because Able experienced less time than Bob did.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-10-30T13:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reccy\u0022 data-cite=\u0022Reccy\u0022\u003E\u003Cdiv\u003ESo, does that mean Astronauts who have moved slower through time are technically in the past, or are we all at the same point in time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022time\u0022 is a relative notion. From an earth bound observer, a pilot travelling near c would seem frozen in time, because he would seem slowed down. But from his own point of view, everything would seem \u0022normal\u0022 (apart from space time compression effects such as stars moving) and actually from his pov the journey would be near instant. But from observers he would have been out for years... (or centuries, or millenia, the closer you get to c the faster you move in time). Think of it as forward time travel. Unfortunately there is no backward (that would break causality)\u003C/p\u003E\u003Cp\u003E(edit) ha, ninja\u0027ed. Oh well i gave another version of it :-)\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-10-30T14:05:16Z","Content":"\n\u003Cp\u003EI love relativity, it\u0027s so much fun.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-10-30T14:14:31Z","Content":"\n\u003Cp\u003EIt\u0027s fun until you learn that c itself is relative to its frame of reference (and of course absolute within its bounds), and that everything in space is in motion... Then your mind implodes :-)\u003C/p\u003E\u003Cp\u003EA fun example: have two beams of light point at each other (in a vacuum, so they \u0022move\u0022 at c relative to observers). At which speed do you think they would collide ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T14:18:34Z\u0022 title=\u002210/30/2013 02:18  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by Surefoot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reccy","CreatedById":77340,"CreatedDateTime":"2013-10-30T15:53:38Z","Content":"\n\u003Cp\u003EIf it\u0027s in a vacuum, then it would be 1c I think.. \u003C/p\u003E\u003Cp\u003EI made this thread expecting some Oberth effect stuff and it just slowly changed into relativity and time travel, oh I love these forums \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-10-31T02:20:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Surefoot\u0022 data-cite=\u0022Surefoot\u0022\u003E\u003Cdiv\u003EIt\u0027s fun until you learn that c itself is relative to its frame of reference (and of course absolute within its bounds), and that everything in space is in motion... Then your mind implodes :-)\u003Cp\u003EA fun example: have two beams of light point at each other (in a vacuum, so they \u0022move\u0022 at c relative to observers). At which speed do you think they would collide ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are asking at what speed the light beams go relative to each other, it is still exactly \u003Cem\u003Ec\u003C/em\u003E. A similar thing would happen if two rockets were going at 75% \u003Cem\u003Ec\u003C/em\u003E (from a reference frame next to them) straight at each other. An outside observer would see them going at 75% \u003Cem\u003Ec\u003C/em\u003E, but observers on them would \u003Cem\u003Enot\u003C/em\u003E see them going at 150% \u003Cem\u003Ec\u003C/em\u003E. Instead, they would see the other one going at a large fraction of \u003Cem\u003Ec\u003C/em\u003E, but slowed down in time (someone better with the formulas can give a better number than me for the exact time dilation).\u003C/p\u003E\u003Cp\u003EEdit: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Velocity-addition_formula\u0022 rel=\u0022external nofollow\u0022\u003EThe equation in this article\u003C/a\u003E shows that they would both be going at 0.6\u003Cem\u003Ec\u003C/em\u003E from each other\u0027s perspective.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T02:32:09Z\u0022 title=\u002210/31/2013 02:32  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by TheDarkStar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Depth","CreatedById":81698,"CreatedDateTime":"2013-10-31T02:53:23Z","Content":"\n\u003Cp\u003EThe earth rotates its own axis as it rotates the sun, and the sun rotates in the galaxy at 200km/s. NASA claims the galaxy moves at 600 km/sec compared to cosmic radiation.\u003C/p\u003E\u003Cp\u003EWith all this movement in different directions on different axis\u0027, how can we accurately measure c, when we only have our own rapidly changing point of reference?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-10-31T03:00:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Depth\u0022 data-cite=\u0022Depth\u0022\u003E\u003Cdiv\u003EWith all this movement in different directions on different axis\u0027, how can we accurately measure c, when we only have our own rapidly changing point of reference?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause c is exactly the same relative to any observer. Weren\u0027t you paying attention? Light moves at the same speed relative to center of the galaxy as it does relative to the Sun and as it does relative to the Earth. Any frame of reference you chose, you can measure the speed of light and have it right.\u003C/p\u003E\n"},{"CreatedByName":"Depth","CreatedById":81698,"CreatedDateTime":"2013-10-31T03:08:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EBecause c is exactly the same relative to any observer. Weren\u0027t you paying attention? Light moves at the same speed relative to center of the galaxy as it does relative to the Sun and as it does relative to the Earth. Any frame of reference you chose, you can measure the speed of light and have it right.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I\u0027m sorry. Time dilation. Had to read Ralathons post one more time.\u003C/p\u003E\u003Cp\u003E11 hour shifts into the night doesn\u0027t mix very well with the science forum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-10-31T03:30:53Z","Content":"\n\u003Cp\u003EFun fact, they have to reset the clocks on gps satellites every day because time is slower in orbit.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-10-31T04:25:08Z","Content":"\n\u003Cp\u003EHow does space expanding faster than C not break any rules of causality? I know Galaxies grow further apart faster than C, which means that no information can be exchanged faster than C, but it still seems like a breakdown of causality.\u003C/p\u003E\u003Cp\u003EIf it isn\u0027t, would space *contracting* faster than C violate causality? If Galaxies converged at speeds faster than C, information could be exchanged between them faster than a photon could propagate. This is one part of relativity I do have a hard time understanding.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-10-31T04:35:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EFun fact, they have to reset the clocks on gps satellites every day because time is slower in orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFaster, actually. Gravitational time dilation on Earth\u0027s surface is stronger than the combined time dilation from gravity and GPS satellite\u0027s velocity. This is true for any satellite in circular orbit above approximately 9,500 km from Earth\u0027s center. Bellow that altitude, satellites move faster and experience stronger gravitational effect, and so the net time dilation is stronger than on the Earth\u0027s surface.\u003C/p\u003E\u003Cp\u003ESo time on Earth\u0027s surface flows faster than on ISS, for example, but slower than on a GPS satellite.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHow does space expanding faster than C not break any rules of causality?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does. Causality is a strictly local feature. Global causality may be violated.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T04:38:20Z\u0022 title=\u002210/31/2013 04:38  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-10-31T10:23:54Z","Content":"\n\u003Cp\u003ENote that space expanding is actually still a theory. So causality may be safe still. Until we have an actual meaurement (that would be from an interstellar probe) we can only have guesses at what causes the red shift. Multiple theories exist...\u003C/p\u003E\u003Cp\u003ECloser to the topic, gravity assists are a consequence of rules of conservation of energy inside a frame of reference, combined with moving across multiple frames of reference. Kinda cheating with the rules of physics... I hope we can get a KSP mod or patch that would allow us to plot multiple assists.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-10-31T19:18:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Surefoot\u0022 data-cite=\u0022Surefoot\u0022\u003E\u003Cdiv\u003ESo causality may be safe still.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECausality isn\u0027t safe either way. We know that there are situations when it breaks down. In particular, near rotating black holes. So Sgr A* at the center of our galaxy already provides a causality breakdown.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-10-31T21:51:18Z","Content":"\n\u003Cp\u003EHow can causality be taken seriously, then, if it\u0027s violated by something as natural as a rotating neutron star, or by the natural expansion of space on a global scale?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-10-31T22:13:44Z","Content":"\n\u003Cp\u003EBlack hole, not a neutron star. Neutron star barely puts a dent in space-time. You need a good and proper twist, and for that you need a rotating black hole.\u003C/p\u003E\u003Cp\u003EBut it doesn\u0027t mean causality isn\u0027t practically useful. Nothing you are likely to interact with in your life time is going to have a world-line that passes through a region of any more than slightly stretched space-time in any time frame that matters. So in every practical sense, causality works here, on Earth. And almost anywhere else that matters. Yes, it\u0027s a local property, but so long as space-times you are dealing with are more or less uniform, a local property is as good as a global one.\u003C/p\u003E\u003Cp\u003ENow, if we figure out how to build Alcubierre Drive, that will be a different question. Ask me again when we do.\u003C/p\u003E\n"}]}