{"TopicId":51198,"ForumId":16,"TopicTitle":"ships not loading into VAB","CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-30T17:55:37Z","PageNum":1,"Articles":[{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-30T17:55:37Z","Content":"\n\u003Cp\u003Ehi there\u003C/p\u003E\u003Cp\u003Eseems like i cannot load ships when i am in VAB.\u003C/p\u003E\u003Cp\u003Ei have a save folder, and in there is my ships files, so the save must be working. but just now\u003C/p\u003E\u003Cp\u003Ei wanted to finish the ships i preassembled this morning and nothing happens when i click the load-button.\u003C/p\u003E\u003Cp\u003Ehelp ? \u003C/p\u003E\u003Cp\u003Ethx in advance\u003C/p\u003E\n"},{"CreatedByName":"phunk","CreatedById":77377,"CreatedDateTime":"2013-10-30T18:20:24Z","Content":"\n\u003Cp\u003EThis happened to me when I copied a craft file over from my old 0.21.1 install. Are you missing any mods that the ships require?\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-30T18:24:13Z","Content":"\n\u003Cp\u003Eno. like i said, i just built the ships this morning and didnt change the game afterwards. \u003C/p\u003E\u003Cp\u003Estrange. and frustrating as i hat preassembled a full duna mission flotilla\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-10-30T18:58:51Z","Content":"\n\u003Cp\u003ENote that you can\u0027t load anything built in the Space Plane Hanger into the Vehicle Assembly Building, so if you build something in the SPH hoping to plop it on top of a rocket in the VAB, you\u0027re SOL. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"phunk","CreatedById":77377,"CreatedDateTime":"2013-10-30T19:17:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psykikk\u0022 data-cite=\u0022Psykikk\u0022\u003E\u003Cdiv\u003Eno. like i said, i just built the ships this morning and didnt change the game afterwards. \u003Cp\u003Estrange. and frustrating as i hat preassembled a full duna mission flotilla\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry I skimmed your post too fast and missed that.\u003C/p\u003E\u003Cp\u003EOne of the craft files might be corrupted. I suggest you make a backup of the saves folder, then remove the craft one at a time until it will let you load. The last one you remove will be the bad one. Then restore the save folder and just remove that one craft, and you\u0027ll just have to rebuild one instead of the whole armada.\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-30T19:20:21Z","Content":"\n\u003Cp\u003Eoh geeze. :-)\u003C/p\u003E\u003Cp\u003Ewell if it wortks that way... off i go then.- thx\u003C/p\u003E\n"},{"CreatedByName":"jwilhite","CreatedById":90637,"CreatedDateTime":"2013-11-01T14:47:02Z","Content":"\n\u003Cp\u003EI had exactly the same problem. None of my ships would load. I play on two different machines and use rsync to keep files in sync between the two machines so that I don\u0027t lose my progress when I switch machines. I could load ships on one of my machines but not on the other. After reading this thread I think I understand why it works on one machine but not on the other. rsync gave me an error the other day when I tried to sync from the machine that doesn\u0027t work to the machine that does work. It said that it didn\u0027t have permission to copy one of my .craft files. I thought that was odd, but because it couldn\u0027t copy that corrupt .craft file to my second machine, my second machine was spared from the bug.\u003C/p\u003E\n"}]}