{"TopicId":51269,"ForumId":16,"TopicTitle":"How the hell do you aim flags.","CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-10-31T03:53:28Z","PageNum":1,"Articles":[{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-10-31T03:53:28Z","Content":"\n\u003Cp\u003ESo I\u0027ve run into a really annoying problem. No matter which kerbal, no matter how long they\u0027ve EVA\u0027d or what direction they\u0027re facing, every flag planted lately is set up so that it PERFECTLY parallels the sun\u0027s path. Meaning the flag is all black, all the time, every time, as the LIGHT NEVER HITS IT. How the hell do I get my kerbals to aim the damn thing in another direction?\u003C/p\u003E\n"},{"CreatedByName":"RSwordsman","CreatedById":78678,"CreatedDateTime":"2013-10-31T03:55:26Z","Content":"\n\u003Cp\u003EI don\u0027t think you can aim flags actually. As far as I can tell you can point the Kerbal in any direction, but they just rotate automatically to give you the same issue. I\u0027ve gotten lucky a few times though, with *slight* sunlight showing the flag\u0027s face.\u003C/p\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-10-31T03:57:00Z","Content":"\n\u003Cp\u003Eseriously, it wasn\u0027t like this in -any- version before this one. I wonder if I can saveedit the damn thing to actually be visible.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-10-31T05:08:22Z","Content":"\n\u003Cp\u003EIn the meantime, you can make the flag visible by aiming the Kerbal\u0027s helmet lights (the \u0022L\u0022 key) at the flag: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cFmXEM0.png\u0022 alt=\u0022cFmXEM0.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-10-31T05:51:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYour Kerbal always turns to his right to plant it, so you have to point him in some weird direction, then he will turn to his right and plant it. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom someone at the tutorial thread.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-10-31T07:45:30Z","Content":"\n\u003Cp\u003EFirst off, Tassyr please try to remain calm, it\u0027s understandable that you\u0027re frustrated but filling your posts with hell and damn isn\u0027t going to help.\u003C/p\u003E\u003Cp\u003ENow then, this issue has been brought up / asked about plenty of times, mostly so right after flags were added. Back then I got tired of all the threads with this exact same topic/question and did a bit of testing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ec8Xgu6.jpg\u0022 alt=\u0022ec8Xgu6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy conclusion then was that flags were placed in a north/south facing, no matter the location. Perhaps it was changed, I\u0027d have to go test it again, however the \u0027workaround\u0027 I came up with back then was that after you place the flag, you can rightclick it and pick it up again. The plant flag button won\u0027t be immidiately available again, but if you move a couple of steps it\u0027ll pop up.\u003C/p\u003E\u003Cp\u003ESo, if the flag isn\u0027t placed in the facing you want, pick it up, walk a few steps, try again. And if it keeps staying in the wrong facing, move accordingly to place it in view of whatever you want it to be in front/behind when taking your screenshot.\u003C/p\u003E\u003Cp\u003EIn case the flag planting was changed and it\u0027s now west-east then both the planet\u0027s orbital inclination and your landing location\u0027s inclination would take part. Very few places should actually be \u0027perfect\u0027 for not getting any light on the flag. The workaround there would be to not land perfectly equatorial on planets/moons that are in perfectly equatorial orbits around the sun.\u003C/p\u003E\u003Cp\u003EI know, I know, you\u0027ll say you *want* to aim the flag or that you *shouldn\u0027t* have to use a workaround, but it\u0027s what it is right now. Feel free to make a suggestion in the suggestions subforum, but as for an answer to how you aim a flag, you can\u0027t seems to be the only answer right now.\u003C/p\u003E\u003Cp\u003EI\u0027ll go do some more testing later to see if things have changed, but for now, try the workaround(s) I\u0027ve suggested.\u003C/p\u003E\n"}]}