{"TopicId":51454,"ForumId":36,"TopicTitle":"[WIP] Mass Relay - Warping all over the place","CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T19:12:42Z","PageNum":1,"Articles":[{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T19:12:42Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EAnswering to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43071-request-Stargate-mod/page2\u0022 rel=\u0022external nofollow\u0022\u003Ethis topic\u003C/a\u003E, I started working on my first plugin, with the help of Frizzank for the desining of parts\u003C/p\u003E\u003Cp\u003EThe concept is having some way to warp vessels from one orbit to another, using parts that you send on the location previously\u003C/p\u003E\u003Cp\u003EHere is how it will work as for version 1:\u003C/p\u003E\u003Cp\u003EA bit like the mass relay from Mass Effect, in fact, ence the name.\u003C/p\u003E\u003Cp\u003E- If you have a tracking device (new part) on your ship,\u003C/p\u003E\u003Cp\u003E- If you are \u0022close enough\u0022 of a Mass Relay (new part),\u003C/p\u003E\u003Cp\u003E- If there is at least one other Mass Relay somewhere on space,\u003C/p\u003E\u003Cp\u003EThen you will have a \u0022Warp\u0022 button available for you to click on, and it will get you to your new destination. Several buttons if more than one \u0022other\u0022 warp engine available.\u003C/p\u003E\u003Cp\u003EOf course, the first version will be only a \u0022proof of concept\u0022 mod, next version will make it less overpowered. Here is the list of things I\u0027d like to include at some time:\u003C/p\u003E\u003Cp\u003E- Power requirement - at least 1 000 000 power consumed for a warp, more the far you want to go. Maybe getting yourself in trouble if you warp with not enough power.\u003C/p\u003E\u003Cp\u003E- Parts Improvements using Science - more science spended means better parts, meaning lest power, and the \u0022close enough\u0022 distance increased.\u003C/p\u003E\u003Cp\u003E- Multi-part station: instead of a mass relay, creating something like a warp ring using several \u0022mass relay\u0022 parts in circle. harder, but can be cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Some limitation: do not try to warp Mass Relay, impossible to warp during acceleration/high speed vs the target, those kind of things\u003C/p\u003E\u003Cp\u003EI gladly accept any suggestion.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EPlugin is almost done for the first release.\u003C/p\u003E\u003Cp\u003EHere is a short video showing the awesome design work of Frizzank, followed by the answer to the question: what happened if you try to warp a mass relay\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=cYs5o0dKV3c\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=cYs5o0dKV3c\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T16:15:04Z\u0022 title=\u002211/12/2013 04:15  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by Molybdene\u003C/strong\u003E\n\u003Cbr\u003Evideo\n\u003C/span\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-11-01T19:25:13Z","Content":"\n\u003Cp\u003ESince you don\u0027t have a download link yet, I\u0027m going to move this into the Add-on Development forum.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-11-01T19:33:08Z","Content":"\n\u003Cp\u003EIRRC, the mass-relay itself provides the power.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure I\u0027d consider this OP. I suppose it\u0027d really depend on how arduous it was to put up the mass-relays and maintain them.\u003C/p\u003E\u003Cp\u003EFor example if the relay consisted of parts that had to be brought up and assembled in orbit, that could be a considerable challenge all by itself. Especially since its twin would have to be man-handled out to the destination.\u003C/p\u003E\u003Cp\u003EIf you want to stick to the relay logic, they were all pairs. So for each destination relay, you\u0027d have to have an origin relay.\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T20:59:42Z","Content":"\n\u003Cp\u003EFor now it\u0027s just a single light weight part, but I did want to make a multi-part warping engine, and having people going trough circles looking like that: \u003Ca href=\u0022http://imgur.com/a/SdWat#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/SdWat#0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd for the destination part, what I currently made (and it\u0027s working after three days of developpement, including the \u0022how do I plugin\u0022 first day) is displaying a list of available Mass Relay all over the galaxy (giving the planet \u0026amp; orbit distance) for you to select. No pairs because for now I can\u0027t find any way to simply giving a pattern/id to ships (maybe with the ship names...), but you still need a Mass Relay at destination.\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-11-01T22:07:50Z","Content":"\n\u003Cp\u003EPerhaps you can find a way to figure out where the Relay itself is pointed so you can do an unguided launch (which is not safe when you are aiming at a planet and using full power) with varying amounts of power (slider maybe?) to determine how far it fires.\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T22:10:55Z","Content":"\n\u003Cp\u003EIt kinda goes against the \u0022two mass relay in sync\u0022 part of the module... but why not for early build.\u003C/p\u003E\u003Cp\u003EYou can already do that with engines and small vessels/Kerbin, as featured by Danny2462 (\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/MRcetShcw8Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E for example) \u003Cp\u003EBut I may consider it for early builds in carrier mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T22:18:14Z\u0022 title=\u002211/01/2013 10:18  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Molybdene\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-11-01T22:21:31Z","Content":"\n\u003Cp\u003EHere\u0027s a thought: Have two types of relays, and one transponder part.\u003C/p\u003E\u003Cp\u003EOne is an exit relay, and is basically a giant hollow circle. This relay is unresponsive and does nothing by itself.\u003C/p\u003E\u003Cp\u003EThe other part is a launch relay, and is basically shaped like the classic mass relay. It has to be targeted at an exit relay, using a function similar to Mechjeb\u0027s targeting SmartASS function.\u003C/p\u003E\u003Cp\u003EThe last part is a relay transponder. Having this turned on and flying close to a launch relay will sling you through and spawn you at the targeted exit relay.\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T22:30:02Z","Content":"\n\u003Cp\u003Ehmm, why not. the \u0022targeted at an exit relay\u0022 sound easy enough, but that will require moving the launch relay and switching back to the transponder. that sounds like a \u0022feature here just to be more realistic\u0022.\u003C/p\u003E\u003Cp\u003EWhat I thought for \u0022later\u0022 versions will be having the relay turning itself automatically before sending your ship after you clicked the warp button. Kinda the same thing as you suggested, but without the need to do it yourself. after all, the launch relay and the exit relay are supposed to be linked/sync\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-11-01T23:15:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Molybdene\u0022 data-cite=\u0022Molybdene\u0022\u003E\u003Cdiv\u003EIt kinda goes against the \u0022two mass relay in sync\u0022 part of the module... but why not for early build.\u003Cp\u003EYou can already do that with engines and small vessels/Kerbin, as featured by Danny2462 (\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/MRcetShcw8Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E for example) \u003Cp\u003EBut I may consider it for early builds in carrier mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell you don\u0027t have any idea where you will exit however unless you know the EXACT power for it to be where you want. A few hundred off can mean a lot.\u003C/p\u003E\n"},{"CreatedByName":"trekkie_","CreatedById":36130,"CreatedDateTime":"2013-11-01T23:51:30Z","Content":"\n\u003Cp\u003Ethis has been done already with another mod that has been around for quite a while. it consists of a few parts: an endpoint part you put somewhere else, and an engine part that allows your vessel to travel between the start and endpoint, allowing you to choose between various endpoints. I used to use it to make seed vessels that seeded end point in orbit all over.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T00:01:03Z\u0022 title=\u002211/02/2013 12:01  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by trekkie_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-01T23:55:26Z","Content":"\n\u003Cp\u003EHyperDrive is not supported since February I think. So I decided to made my own.\u003C/p\u003E\u003Cp\u003EAnd it is kinda different. Instead of having the warping device on you (so that you can warp from about anywhere) you have to be next to the warping device (mass Relay) in order to be able to warp to another mass relay.\u003C/p\u003E\u003Cp\u003EAnd I plan on having the mass relay to be a multi-part ship that you have to assemble in space\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-11-02T11:30:12Z","Content":"\n\u003Cp\u003EHyperDrive while it (kind of) works it laggy as hell to go anywhere besides orbit of kerbin from Kerbin\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-02T16:02:49Z","Content":"\n\u003Cp\u003EI\u0027m trying to make something very light and not overpowered, HyperDrive was (is?) a nice plugin, but provided you have enough energy, you can go anywhere from anywhere, and even land.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-11-02T23:02:34Z","Content":"\n\u003Cp\u003ESo this is just a concept and textures are just temporary. The rings rotate mass effect style gyroscope thingy.\u003C/p\u003E\u003Cp\u003EThe idea is you put this mass relay part on your station, give it a lot of power and it teleports you to another mass relay. Its small enough to fit inside a 2.5m fairing, and is surface attachable, but it would be extremely heavy. Probably necessitating construction in space with multiple launches.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/i96T3TQ.jpg\u0022 alt=\u0022i96T3TQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eGvEv62.jpg\u0022 alt=\u0022eGvEv62.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sOwRInZ.jpg\u0022 alt=\u0022sOwRInZ.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-03T00:14:34Z","Content":"\n\u003Cp\u003Ethanks Frizzank for this awesome part, I\u0027ll use it well ^^\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-11-05T08:23:46Z","Content":"\n\u003Cp\u003EAnother update, Gave the Mass Relay a texture.\u003C/p\u003E\u003Cp\u003EIt will probably use a lot more power than this but its just an example.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6ltEsIW.jpg\u0022 alt=\u00226ltEsIW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oL8Sy2G.jpg\u0022 alt=\u0022oL8Sy2G.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5HTbHPG.jpg\u0022 alt=\u00225HTbHPG.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-05T08:26:05Z","Content":"\n\u003Cp\u003E\\o/ You add cables, like I asked. Love you, Frizz ^^\u003C/p\u003E\u003Cp\u003EAnd for the news-hungry people: I have a working mod as of today, still working on some details for the first release.\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-11-05T12:11:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022frizzank\u0022 data-cite=\u0022frizzank\u0022\u003E\u003Cdiv\u003EAnother update, Gave the Mass Relay a texture.\u003Cp\u003EIt will probably use a lot more power than this but its just an example.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6ltEsIW.jpg\u0022 alt=\u00226ltEsIW.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESucks that that probably collides, I want to fly a tiny probe through it.\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-05T12:49:01Z","Content":"\n\u003Cp\u003EHaha, let\u0027s play Space Quidditch ^^\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-11-05T15:56:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pigbear\u0022 data-cite=\u0022Pigbear\u0022\u003E\u003Cdiv\u003ESucks that that probably collides, I want to fly a tiny probe through it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo let it be written, so let it be done!!!\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-05T15:58:33Z","Content":"\n\u003Cp\u003Egaaah.\u003C/p\u003E\u003Cp\u003ETrying it now.\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-05T16:46:37Z","Content":"\n\u003Cp\u003Eit fits \\o/\u003C/p\u003E\u003Cp\u003EBut someone stupid added some RCS thrusters on the side when I wasn\u0027t looking *kof*\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9BsjS0gl.png\u0022 alt=\u00229BsjS0gl.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T17:04:33Z\u0022 title=\u002211/05/2013 05:04  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Molybdene\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kaldak","CreatedById":71466,"CreatedDateTime":"2013-11-05T16:50:09Z","Content":"\n\u003Cp\u003EAwesome! I\u0027ve been quietly wishing for a mod like this since I started playing.\u003C/p\u003E\u003Cp\u003ESome thoughts on how I would balance it:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMass relays are heavy, and probably need to be launched in parts\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMass relays require massive power to warp a ship, but only briefly. So massive battery banks (or capacitor banks from Near Future Propulsion) and a few large solar panels might work well. Basically, you\u0027d need to build a small space station just to operate the relay. Maybe the power requirements would scale based on the mass of the object you\u0027re sending through?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe targeting computer mounted on board the ship would take significant power just before a warp, but nowhere near the relay itself.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can\u0027t send relay parts through a mass relay, so getting the relays to other planetary orbits remains a challenge.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMass relays work both ways. I don\u0027t really see the need for separate start and end versions.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAttempting to use a relay within atmosphere or while landed goes very badly...\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEssentially it gives you a nice shortcut for returning to places you\u0027ve already been, but doesn\u0027t make exploring the solar system trivial.\u003C/p\u003E\u003Cp\u003EAnyway, yay, thanks for tackling this!\u003C/p\u003E\n"},{"CreatedByName":"Molybdene","CreatedById":85275,"CreatedDateTime":"2013-11-05T17:00:30Z","Content":"\n\u003Cp\u003EHere is my answers to your thoughts:\u003C/p\u003E\u003Cp\u003E- Mass relays will weight more than 60tons. For now only a single part is available on my dev plugin, Will add stargate relays after first release.\u003C/p\u003E\u003Cp\u003E- Mass relays will require massive power to warp (probably over 9000!!!), and it will cost more to send farther. Random orbit around the sun if power requirement not met.\u003C/p\u003E\u003Cp\u003E- I did not plan on having the targeting computer consuming lots of power before a warp. It\u0027s just a computer that allows you to clic on \u0022WAAARP LOLZ\u0022.\u003C/p\u003E\u003Cp\u003E- You can try to send mass relay parts using mass relay. But that will be like dividing by zero and both ships will be destroyed.\u003C/p\u003E\u003Cp\u003E- Can\u0027t use a relay when landed, I had no issues with atmo-relays as it will not result in a stable orbit, but now you mentionned it, I can find some ways to exploit that, so no atmo it is \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn conclusion, your vision of this plugin is exactly what I have in mind. I added things today, like having to be on close encounter with the mass relay to be able to warp (less than 100m, less than 0.5m/s with the mass relay)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T17:03:34Z\u0022 title=\u002211/05/2013 05:03  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Molybdene\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-11-05T18:56:39Z","Content":"\n\u003Cp\u003Erealisticly a mass relay would rip your ship apart in atmos.\u003C/p\u003E\n"}]}