{"TopicId":51552,"ForumId":34,"TopicTitle":"Now-defunct-thread-that-should-not-appear-in-google-search.","CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-02T15:27:45Z","PageNum":22,"Articles":[{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-16T23:17:14Z","Content":"\n\u003Cp\u003EWhat\u0027s funny is that release 1.2 hadn\u0027t gone through my usual testing phase. I should\u0027ve sent it to some people to test like I had planned. *cough*.\u003C/p\u003E\u003Cp\u003EWorking on fixing the Target/Maneuver delays. For kOS integration I\u0027ll write a new interface that uses reflection and some form of dynamic typing that I can pull off in .NET 3.5. That\u0027ll keep me busy for an entire sunday.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T23:26:00Z\u0022 title=\u002211/16/2013 11:26  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Cilph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2013-11-16T23:53:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnsonwax\u0022 data-cite=\u0022johnsonwax\u0022\u003E\u003Cdiv\u003EA geosync satellite should have an orbital period of 6 hours (21600 sec). You can get that period with an expected error of 0.05 sec/orbit or .00023%. That\u0027s better than what you can accomplish by using altitude and would amount to a \u003Cem\u003Emaximum\u003C/em\u003E of 5 minutes of drift per year. That\u0027s not nothing, but it\u0027s pretty tolerable. Chuck an ion engine on your sat like I showed on my previous comment and you can correct that drift every few years without much trouble.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, as long as you put a geostationary sat with the right orbital period, they will be stable for a long time.\u003C/p\u003E\u003Cp\u003EI did run a 1.000.000X TimeWarp test for the game-equivalent of 1 year (I\u0027m using RealSolarSystem, which also adds higher time-warps) and the drift was less than 1Ã‚Âº of longitude:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ISLxSxa8pa4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThose sats are geo-synced to the second of accuracy, if I did bother syncing to tenths of second perhaps the drift would be even less.\u003C/p\u003E\n"},{"CreatedByName":"Lalwcat","CreatedById":3041,"CreatedDateTime":"2013-11-17T00:24:30Z","Content":"\n\u003Cp\u003EI can\u0027t quite figure out how to queue things up? I hit Q and I can see the currently executing option (Holding on node, burning for x m/s) but I clicking a new button or a new BRN just replaces what I have there.\u003C/p\u003E\u003Cp\u003EEDIT: Actually, im testing this on a locally controlled ship so I\u0027m guessing that\u0027s why. Presumably any actually delayed commands are added to the Q? Woops\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-11-17T00:53:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cilph\u0022 data-cite=\u0022Cilph\u0022\u003E\u003Cdiv\u003EWait, what? These are not single-frame throttle drops? You\u0027re not going to drop out of the sky with some minor hiccups.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I don\u0027t drop out of the sky, *because I never reach the sky*. The jitter is bad enough that the average thrust is a fraction of full throttle, on launch the clamps release and the vehicle simply drops to the pad and explodes. Orbital maneuvers are all-but-impossible as a few hundred meters per second burn can take five to ten minutes rather than a few tens of seconds.\u003C/p\u003E\u003Cp\u003EHeaded out to a party in a few, will test the emergency solution later tonight or first thing tomorrow. Thanks!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sma\u0022 data-cite=\u0022Sma\u0022\u003E\u003Cdiv\u003EYep, the \u0022jitter\u0022 is has been a known bug with kOS and MJ for a while now. I guess it\u0027s just that new people are using it and havent\u0027 seen the previous posts on the kOS thread about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was not present in the previous version, it appeared with yesterday\u0027s release. And it\u0027s not a conflict with MJ, I get it in manual mode (no MJ installed on the vehicle) as well.\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-11-17T01:06:21Z","Content":"\n\u003Cp\u003EIs there any way to have RemoteTech without Signal Delay?\u003C/p\u003E\n"},{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-17T01:20:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003EIs there any way to have RemoteTech without Signal Delay?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlay with filter icons on map view -\u0026gt; generates config file -\u0026gt; disable signal delay.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DerekL1963\u0022 data-cite=\u0022DerekL1963\u0022\u003E\u003Cdiv\u003ENo, I don\u0027t drop out of the sky, *because I never reach the sky*. The jitter is bad enough that the average thrust is a fraction of full throttle, on launch the clamps release and the vehicle simply drops to the pad and explodes. Orbital maneuvers are all-but-impossible as a few hundred meters per second burn can take five to ten minutes rather than a few tens of seconds.\u003Cp\u003EHeaded out to a party in a few, will test the emergency solution later tonight or first thing tomorrow. Thanks!\u003C/p\u003E\u003Cp\u003EIt was not present in the previous version, it appeared with yesterday\u0027s release. And it\u0027s not a conflict with MJ, I get it in manual mode (no MJ installed on the vehicle) as well.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrangely I can not reproduce it. No throttle glitches here.\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2013-11-17T01:25:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003EIs there any way to have RemoteTech without Signal Delay?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed there is. RT2 has a global config file called RemoteTech_Settings.cfg, this can be found in GameData\\RemoteTech2.\u003C/p\u003E\u003Cp\u003Eopen up the config in any text editor of your choosing and change EnableSignalDelay = True to EnableSignalDelay = False\u003C/p\u003E\n"},{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-17T01:43:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ERelease 1.2.6:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EFixed settings file not auto-generating;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed collection modified exception;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPossibly fixed throttle jitter again?;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed Target/Maneuver in Flight Computer;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDisable SAS when Flight Computer is on;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETweaked time warp throttling when commands are approaching.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2013-11-17T01:59:42Z","Content":"\n\u003Cp\u003EI have a few questions:\u003C/p\u003E\u003Cp\u003E1. Why RT2 not compatible with RT1? Problems with old dishes authors permission? Can anyone give a suggestion, how to combine old and new antennas?\u003C/p\u003E\u003Cp\u003E2. Whether there is a way to more precisely adjust antennas ranges? As I remember, pointing dish on omni-antennas will results in double range of omni-antenna.\u003C/p\u003E\u003Cp\u003EIt is far from real, range is depend on dish gain. Any way to adjust it?\u003C/p\u003E\u003Cp\u003E3. Whether there is a way to bind activate/deactivate functions from RT2 to other antennas animation (like antennas from LLL/AIES)?\u003C/p\u003E\n"},{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-17T02:11:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaxP\u0022 data-cite=\u0022MaxP\u0022\u003E\u003Cdiv\u003EI have a few questions:\u003Cp\u003E1. Why RT2 not compatible with RT1? Problems with old dishes authors permission? Can anyone give a suggestion, how to combine old and new antennas?\u003C/p\u003E\u003Cp\u003E2. Whether there is a way to more precisely adjust antennas ranges? As I remember, pointing dish on omni-antennas will results in double range of omni-antenna.\u003C/p\u003E\u003Cp\u003EIt is far from real, range is depend on dish gain. Any way to adjust it?\u003C/p\u003E\u003Cp\u003E3. Whether there is a way to bind activate/deactivate functions from RT2 to other antennas animation (like antennas from LLL/AIES)?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. It\u0027s a complete rewrite. It threw everything out. For the dishes, I wanted to maintain a stock look so some got left out.\u003C/p\u003E\u003Cp\u003E2. Doesn\u0027t happen anymore as a simplification of the system. This is a game after all and the point of RemoteTech is to enforce the building of networks - not be an accurate representation of gain and signal to noise ratios.\u003C/p\u003E\u003Cp\u003E3. There is. It now uses the stock Squad animation system, so if you can hook it into that, you can hook it into RT2.\u003C/p\u003E\n"},{"CreatedByName":"SandMan13","CreatedById":82394,"CreatedDateTime":"2013-11-17T02:48:19Z","Content":"\n\u003Cp\u003EIs there anyway to disable the mod without actually taking out the parts? There are things I want to do but I don\u0027t have sats in the right places so using probes is impossible and I don\u0027t have the time to put them all up. Any way to disable needing a connection on probes I guess is what I\u0027m asking.\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2013-11-17T03:01:00Z","Content":"\n\u003Cp\u003EJust delete dll ))\u003C/p\u003E\u003Cp\u003ECliph, thanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis is a game after all and the point of RemoteTech is to enforce the building of networks - not be an accurate representation of gain and signal to noise ratios.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut we building those networks according to antennas ranges - why not to be more precise? ))\u003C/p\u003E\u003Cp\u003EI understand, we don\u0027t need tons of maths, but this point is important, and, I think, it is not so hard to calculate - elementary actions.\u003C/p\u003E\u003Cp\u003EIt is offensively when sattellite with high-gain dish loose connection just because, while in real it can operate fine, don\u0027t you think so? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMore questions.\u003C/p\u003E\u003Cp\u003Ewhat is the strings in config:\u003C/p\u003E\u003Cp\u003ENathanKell_MultipleAntennaSupport\u003C/p\u003E\u003Cp\u003ERangeModelType\u003C/p\u003E\u003Cp\u003E?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T04:03:58Z\u0022 title=\u002211/17/2013 04:03  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by MaxP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deadpeople37","CreatedById":76804,"CreatedDateTime":"2013-11-17T03:05:01Z","Content":"\n\u003Cp\u003EI was toying around with the Real Scale solar system mod earlier today and I noticed a six second signal delay from my relay around Kerbin to the Mun. I figured that you had scaled down the speed of light to fit with the vanilla system, so I went into the config files and changed it. However, upon reopening KSP it appeared that I hadn\u0027t done anything to it; there was still a six second delay. I went back to the config files to see what I did wrong and it appeared to have automatically gotten rid of my changes, despite the fact that I had saved it. So upon seeing you fixed a similar glitch, I installed 1.2.6 and was wondering, how do I access the settings file? I can only find the files for the the probe cores, mech-jeb, and antennas.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-17T04:35:00Z","Content":"\n\u003Cp\u003EThat\u0027s to give you something \u0022more precise.\u0022\u003C/p\u003E\u003Cp\u003EIt allows multiple antennae to add together, though with diminishing returns; and it uses this model for the maximum range between two nodes:\u003C/p\u003E\u003Cp\u003Erange_of_weaker \u002B sqrt(range_of_weaker * range_of_stronger)\u003C/p\u003E\u003Cp\u003EAnd clamped to 1000x the weaker range if both are dishes, or 100x if at least one is an antenna.\u003C/p\u003E\u003Cp\u003EIt\u0027s not really power, sensitivity, and gain, but it does give you something of the feel of that.\u003C/p\u003E\u003Cp\u003ESet RangeModelType to Additive to try it out.\u003C/p\u003E\u003Cp\u003ECilph\u0027s seen some problems with the planet targeting in it, which I\u0027m fixing tonight.\u003C/p\u003E\n"},{"CreatedByName":"Lalwcat","CreatedById":3041,"CreatedDateTime":"2013-11-17T05:36:44Z","Content":"\n\u003Cp\u003ECan we get an update to the OP showing what the map-buttons do on the bottom right? I tried searching but wasn\u0027t having much luck from the search engine. Best I can tell is the left one turns signal delay/link required on/off... the middle one shows the arcs for body-pointing dishes, but I don\u0027t know what the 3rd one from the left is that has multiple toggle choices.\u003C/p\u003E\u003Cp\u003EAlso, in previous RT we were able to edit the dish pointings of satellites that weren\u0027t the one we were controlling...is that still possible or do we have to switch to them now?\u003C/p\u003E\n"},{"CreatedByName":"IRnifty","CreatedById":85825,"CreatedDateTime":"2013-11-17T05:36:55Z","Content":"\n\u003Cp\u003EWell... The more I look at this, the more I like it. It almost adds another goal to the career mode in that not only do you have to complete the tech tree, but now it gives you the requirement and the goal of providing coverage everywhere you can! It\u0027s too bad I chose to get this after transmitting from Duna...\u003C/p\u003E\n"},{"CreatedByName":"Scootaloo","CreatedById":85572,"CreatedDateTime":"2013-11-17T09:50:55Z","Content":"\n\u003Cp\u003EOk, I\u0027m at my wit\u0027s end. I don\u0027t know what I\u0027m doing wrong! I can\u0027t keep a signal when I enter the Mun\u0027s sphere of influence! I tried everything. I added relay\u0027s at Munar orbital height to that huge list of satellites from before, with 2 dishes, but the same thing happens, the signal for the probe drops!! I have the objects pointed at each other (I keep going into map view and juggling them with \u0022switch to\u0022 to make sure they\u0027re always pointed at each other), I have them targeted via there dishes, but the outcome is still the same!! It always drops when I enter the SoI.\u003C/p\u003E\u003Cp\u003EI have managed to get dishes to lock onto each other between craft, but the actual signal only shows up on one of the craft. For example, while the munar probe was near Kerbin on the early part of it\u0027s trans-Munar trajectory, the Munar relay had a comm lock on it, and there was a line connecting them in map view. But that line only showed up in the map view from the PoV of the Mun relay. Even though they were locked, when I went to map view from the PoV of the probe, the line between the two craft does not exist.\u003C/p\u003E\u003Cp\u003EIn addition, only the relay can initiate a comm lock-on. If I attempt to target a comm sat with the probe, nothing happens. Is there a dominant-submissive craft hierarchy built into this program I am not understanding? Or is it a glitch? I was originally thinking that when it comes to dishes, as long as two are in each other\u0027s range, and are targeted, they should link. Is it not that simple?\u003C/p\u003E\u003Cp\u003EI\u0027m beginning to think the Mun comm-lose issue may be a glitch. I have a couple of other add-ons installed and I have a sneaking suspicion something\u0027s not playing nice with something else. I\u0027m on Mac, and after a few launches I begin to get graphics artifacts (odd patches of shadows, craft becoming completely black as they climb into space, freezing, etc). That tends to happen with too many or incompatible add-ons. Is that the issue?\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2013-11-17T11:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EThat\u0027s to give you something \u0022more precise.\u0022\u003Cp\u003EIt allows multiple antennae to add together, though with diminishing returns; and it uses this model for the maximum range between two nodes:\u003C/p\u003E\u003Cp\u003Erange_of_weaker \u002B sqrt(range_of_weaker * range_of_stronger)\u003C/p\u003E\u003Cp\u003EAnd clamped to 1000x the weaker range if both are dishes, or 100x if at least one is an antenna.\u003C/p\u003E\u003Cp\u003EIt\u0027s not really power, sensitivity, and gain, but it does give you something of the feel of that.\u003C/p\u003E\u003Cp\u003ESet RangeModelType to Additive to try it out.\u003C/p\u003E\u003Cp\u003ECilph\u0027s seen some problems with the planet targeting in it, which I\u0027m fixing tonight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENathanKell, thank you, it is good enough for feel \u0022more precise\u0022 ))\u003C/p\u003E\u003Cp\u003ERange errors we can imagine as unpredictable conditions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T15:28:10Z\u0022 title=\u002211/17/2013 03:28  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by MaxP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sacred Aardvark","CreatedById":85856,"CreatedDateTime":"2013-11-17T11:16:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cilph\u0022 data-cite=\u0022Cilph\u0022\u003E\u003Cdiv\u003EWhat\u0027s funny is that release 1.2 hadn\u0027t gone through my usual testing phase. I should\u0027ve sent it to some people to test like I had planned. *cough*.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI spent last night playing with 1.2.0 expecting it to blow up, but couldn\u0027t find any fault in it. Didn\u0027t try the kOS integration though, was too busy setting up my satellite network. Absolutely Loving the flight computer after I figured out the queue, dat burn control \u0026lt;3 Only minor thing with it is that I\u0027d like an off button to mash repeatedly when things go pear shaped due to clicking the wrong thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MoVGI7V.jpg\u0022 alt=\u0022MoVGI7V.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFor kOS integration I\u0027ll write a new interface that uses reflection and some form of dynamic typing that I can pull off in .NET 3.5. That\u0027ll keep me busy for an entire sunday.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYayy, can\u0027t wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-17T11:24:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lalwcat\u0022 data-cite=\u0022Lalwcat\u0022\u003E\u003Cdiv\u003ECan we get an update to the OP showing what the map-buttons do on the bottom right? I tried searching but wasn\u0027t having much luck from the search engine. Best I can tell is the left one turns signal delay/link required on/off... the middle one shows the arcs for body-pointing dishes, but I don\u0027t know what the 3rd one from the left is that has multiple toggle choices.\u003Cp\u003EAlso, in previous RT we were able to edit the dish pointings of satellites that weren\u0027t the one we were controlling...is that still possible or do we have to switch to them now?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELeft to right - from memory - show uplink routing for active vessel, show dish arcs when pointing at bodies, show antenna/dish/both/none possible connections, setup target for dishes.\u003C/p\u003E\u003Cp\u003EYou can do so in the observatory at KSC, select a vessel and click on the fourth button of the RT menu we just talked about.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-11-17T11:31:25Z","Content":"\n\u003Cp\u003EI don\u0027t really understand the need for both dishes to be pointing at each other. If I select one of my sats from a ship, the sat should fix to the ship automatically, it\u0027s obvious I want to use it. Why must I switch vessels to the sat to tell it the same thing?\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2013-11-17T11:51:27Z","Content":"\n\u003Cp\u003EBecause dishes must be pointed at each other, because of directional pattern \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr you will have no connection.\u003C/p\u003E\n"},{"CreatedByName":"Sacred Aardvark","CreatedById":85856,"CreatedDateTime":"2013-11-17T11:58:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndreyATGB\u0022 data-cite=\u0022AndreyATGB\u0022\u003E\u003Cdiv\u003EI don\u0027t really understand the need for both dishes to be pointing at each other. If I select one of my sats from a ship, the sat should fix to the ship automatically, it\u0027s obvious I want to use it. Why must I switch vessels to the sat to tell it the same thing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause from the satellites perspective it isn\u0027t obvious. Until the satellite has aligned its dish in a suitable direction, it doesn\u0027t even know it\u0027s being yelled at for pointing in the wrong direction. (from a gaming perspective it\u0027s a little bit tedious, but I don\u0027t mind enough to care \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) Ofc in certain situations the dish would in reality be pointed in the right direction and pick up the hail, but we don\u0027t have physical aiming of dishes. (thank god, that\u0027d drive me nuts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Aerosfilis","CreatedById":83919,"CreatedDateTime":"2013-11-17T12:45:33Z","Content":"\n\u003Cp\u003EHow works dish to atenna network?\u003C/p\u003E\u003Cp\u003EI\u0027ve tried a lot but nothink seems to work.\u003C/p\u003E\n"},{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-17T13:27:26Z","Content":"\n\u003Cp\u003EOmnis can link with dishes pointing at them just fine.\u003C/p\u003E\n"}]}