{"TopicId":51603,"ForumId":44,"TopicTitle":"Competition or cooperation?","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-11-02T21:32:35Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-11-02T21:32:35Z","Content":"\n\u003Cp\u003EWith the Shuttle fleet enjoying retirement, and the ISS practically complete, we\u0027re all looking forward to the next big project in space. The national space agencies around the world are working away at their assigned projects, \u0022space station\u0022 this, \u0022Moon probe\u0022 that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.telegraph.co.uk/multimedia/archive/02300/rover_2300144b.jpg\u0022 alt=\u0022rover_2300144b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/2/28/ISS_ULF3_STS-129.jpg\u0022 alt=\u0022ISS_ULF3_STS-129.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.jsc.nasa.gov/jscfeatures/photos/115EVAs/s115e05753.jpg\u0022 alt=\u0022s115e05753.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EHi there, Earth, you giant, fat bastard. Sorry, what was that? I can\u0027t hear you, cause I\u0027m so far above you.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThere are more people in more countries involved in the exploration in space now than ever before. An entire generation of bright young scientists, engineers, ground crews and astronauts are ready to tackle the challenges of returning to the Moon, capturing and mining an asteroid, and the long overdue mission to Mars.\u003C/p\u003E\u003Cp\u003EThat is, if we get the drive and money to actually do it.\u003C/p\u003E\u003Cp\u003EThe way I see it, there are two ways for national space programs to make the case for space, in regards to their international counterparts: Competition and cooperation.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECompetition\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOn the 4th of October, 1957, a tiny piece of Soviet technology, on top of a significantly larger piece of Soviet technology, ran circles around the planet Earth.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.bis-space.com/wp-content/uploads/2011/03/Sputnik-1l.jpg\u0022 alt=\u0022Sputnik-1l.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI am so glad that Stalin didn\u0027t live to see this day.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWhile the USSR was busy fist-bumping itself, the people of the United States, who until this point was firmly convinced your average Soviet couldn\u0027t wire a plug, was gasping in horror. If they were going to win the Cold War, they had to show the \u0022Third World\u0022 that the US was the superior technological power, and they can\u0027t do that if there was a tiny metal ball going over their heads every 96 minutes, literally screaming at the world that the Soviets were, in a technical and industrial sense, better.\u003C/p\u003E\u003Cp\u003EThe US had to do \u003Cem\u003Esomething\u003C/em\u003E that would put them back on top, and do it before those atheistic, socialistic cowards did it. Put a man in orbit? Even if they did it first, the Soviets could quickly one-up them again. Space station? With the R-7, the Ruskies had the overwhelming heavy-lifting advantage, so they would do it first. They needed a target so far ahead, both sides had a decent shot of pulling it off-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://d1jqu7g1y74ds1.cloudfront.net/wp-content/uploads/2011/11/moon.jpg\u0022 alt=\u0022moon.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EHELLO. CAN WE BE FRIENDS? I\u0027LL HELP AROUND THE HOUSE.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOf course, you all know the story...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.jpl.nasa.gov/explorer/captions/images/explorer1-516.jpg\u0022 alt=\u0022explorer1-516.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EExplorer 1: When humanity gained access to version 0.22.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://pickle92.files.wordpress.com/2011/04/gagarin11.jpg\u0022 alt=\u0022gagarin11.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EYuri Alekseyevich Gagarin, sailor of the universe.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://pdxretro.com/wp-content/uploads/2011/04/Mercury7astronauts-700201.jpg\u0022 alt=\u0022Mercury7astronauts-700201.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe seven people on this planet who could pull off Aluminium clothes.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://blog.al.com/space-news/2009/05/large_aleksey.jpg\u0022 alt=\u0022large_aleksey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022At this rate, we\u0027ll beat those capitalist pi-\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.nasa.gov/sites/default/files/images/235794main_GPN-2006-000025_full.jpg\u0022 alt=\u0022235794main_GPN-2006-000025_full.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022SUPRISE!\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.videocosmos.com/images/luna-3-2.jpg\u0022 alt=\u0022luna-3-2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe reason most of the features on the far side of the Moon have Russian names.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.wired.com/images_blogs/wiredscience/2012/05/apollo11return_nasa.jpg\u0022 alt=\u0022apollo11return_nasa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDo you ever think Michael Collins looks at this picture and says to himself \u0022I am the only person in existence who is not in this photo.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/1/1e/Apollo_11_first_step.jpg\u0022 alt=\u0022Apollo_11_first_step.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ECOMMIES SUX LOLOLOLOLOLOLOLOLOL- Neil A. Armstrong, first words on the surface of the Moon.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EDuring this period of time we call \u0022the space race\u0022, both superpowers invested huge sums of money into being the first to get a guy on the surface. In my own opinion, the reason we don\u0027t have people on the Moon right now is not because we are less intelligent than our predecessors, or a lack of money, or sentient rocks brutally killing anyone we send there...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lightsinthedark.files.wordpress.com/2009/07/as11-40-5851.jpg\u0022 alt=\u0022as11-40-5851.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EApollos 18, 19 and 20 have taught us valuable lessons in taming these Moon rocks.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...the problem is we don\u0027t have someone to race. When your policy is centred around constantly one-upping someone, and that someone does something magical, of course you\u0027re going to do the most amazing thing that is still within the realm of sanity. It\u0027s not like the modern day United States has some rival that is about to overtake it any sec-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://bitcoinmagazine.com/wp-content/uploads/2013/07/China-flag.gif\u0022 alt=\u0022China-flag.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOhhhhhhhhhh...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...alright, first one on Mars is a rotten egg!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECooperation\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhen Armstrong and Aldrin brought the benefits of American Capitalism to the Lunar surface, the US saw that the Soviet Union were not going to put in the additional effort to only place second, so they started \u0022sizing down\u0022 NASA. After the cuts, all that was left for NASA to do was a space station and a crazy-looking spacecraft that would have to be used again, and again, and again. Once the space station used the remaining assets from Apollo, there\u0027ll be a large gap in the Manned program, when not a single American will be in space. To help plug this gap, and to keep the Cold War cool (cause seriously, that thing was getting crazy), NASA decided to meet up with the filthy stooges they just spent a decade trying to beat, and perform a joint space mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://galaxywire.net/wp-content/uploads/2009/06/apollo-soyuz-space-art-2.jpg\u0022 alt=\u0022apollo-soyuz-space-art-2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Apollo-Soyuz Test Project: what happens when superpowers high-five.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWhen the Americans and Soviets on-board mastered the art of chest-bumping in microgravity, they detached, and started work on their own things: The US, the Space Shuttle, and the USSR, space stations. What resulted in that was one country with a system of getting stuff and people into orbit, and one country with the skillset of keeping stuff and people in orbit for a very long time. When somebody realised how perfectly those two systems worked together, they decided to put aside decades of threatening to kill each other, and do ****.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dearloveonspace.files.wordpress.com/2011/05/shuttlemir.jpg\u0022 alt=\u0022shuttlemir.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022Cuban missile what?\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EReally, to properly show what international cooperation can do, we must look at Europe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://apod.nasa.gov/apod/image/0512/eunight2_pv_big.jpg\u0022 alt=\u0022eunight2_pv_big.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIf there is one region of the world that values working together, it is Europe.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe European space agency is not the most well known space program in the world, but it does certainly give a bang for it\u0027s buck. Costing each European 8 euros per year, ESA has went from a Frankenstein of a launch vehicle (Europa 1) to a capable launcher, an astronaut corps, a module of the ISS-itself an example of what cooperation can do on a global scale...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.esa.int/var/esa/storage/images/esa_multimedia/images/2011/06/the_international_space_station_with_atv-2_and_endeavour10/9726248-8-eng-GB/The_International_Space_Station_with_ATV-2_and_Endeavour_large.jpg\u0022 alt=\u0022The_International_Space_Station_with_ATV-2_and_Endeavour_large.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIt\u0027s like the Power Rangers, only these Rangers combine to form something even more high-tech and awesome.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...as well as scientific missions throughout the solar system, either alone or with partners, and a satellite navigation system in the works to rival GPS. Not bad for the cost of a cinema ticket per year!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EConclusion\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhat do you think the national space programs should do to advance humanity, get into a new space race, or work together? Working alone is what got us to the Moon, not having to worry about the other parties fulfilling their ends of the deal can speed things up. But this race might end up as a sprint rather than a marathon, and the risk of the winner not acting, and building upon their success is high. Everybody doing it without help also means everyone having to build everything themselves, and that can get very expensive. Working together means everyone can specialise, and each partner only has to do a fraction of the work. The threat of the project getting bogged down in red tape is higher, however.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/f/f1/Mars_mission.jpg\u0022 alt=\u0022Mars_mission.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMan will conquer space soon...ish.\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-03T01:45:48Z\u0022 title=\u002211/03/2013 01:45  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 3, 2013\u003C/time\u003E by Drunkrobot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2013-11-02T22:05:37Z","Content":"\n\u003Cp\u003EI have to say, very well put together.\u003C/p\u003E\u003Cp\u003EI think cooperation is the best path. You have much more money and more people. One person getting shut down isn\u0027t as big of a problem. And there are multiple ways to do the same thing.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2013-11-02T23:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dharak1\u0022 data-cite=\u0022dharak1\u0022\u003E\u003Cdiv\u003EI have to say, very well put together.\u003Cp\u003EI think cooperation is the best path. You have much more money and more people. One person getting shut down isn\u0027t as big of a problem. And there are multiple ways to do the same thing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E I agree. I would like cooperation. More resources and better relations. But I am not sure that cooperation is going to happen with China. They have a space program fueled by nationalism, and I doubt that being friendly to their space rivals is part of that.\u003Cp\u003E@Skyler4856 I don\u0027t think that private corporations have much of a will to do space exploration anyways.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-03T00:39:08Z\u0022 title=\u002211/03/2013 12:39  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 3, 2013\u003C/time\u003E by mdatspace\u003C/strong\u003E\n\u003Cbr\u003EWanted to not make an additional comment.\n\u003C/span\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-11-03T00:09:37Z","Content":"\n\u003Cp\u003EI believe that competition is more effective for private corporations while the opposite is true for public facets.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-03T00:44:46Z","Content":"\n\u003Cp\u003ECompetition is risky. It\u0027s more dangerous to go into a space while competeting, as many safety features are overlooked, and its really agency for space agencies to completely exhaust their funds out of complete attrition of resources and racing. But its faster, and makes Congress much more willing to allocate funds to NASA (Which is probably ANOTHER reason why they won\u0027t be cancelling the SLS anytime soon). \u003C/p\u003E\u003Cp\u003EBut cooperation is safe. It\u0027s slow. It\u0027s well developed. \u003C/p\u003E\u003Cp\u003EBasically.....\u003C/p\u003E\u003Cp\u003EIf you want progress and many achievements in space, go competition.\u003C/p\u003E\u003Cp\u003EIf you want technology and science, go cooperation.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2013-11-03T00:56:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ECompetition is risky. It\u0027s more dangerous to go into a space while competeting, as many safety features are overlooked, and its really agency for space agencies to completely exhaust their funds out of complete attrition of resources and racing. But its faster, and makes Congress much more willing to allocate funds to NASA (Which is probably ANOTHER reason why they won\u0027t be cancelling the SLS anytime soon). \u003Cp\u003EBut cooperation is safe. It\u0027s slow. It\u0027s well developed. \u003C/p\u003E\u003Cp\u003EBasically.....\u003C/p\u003E\u003Cp\u003EIf you want progress and many achievements in space, go competition.\u003C/p\u003E\u003Cp\u003EIf you want technology and science, go cooperation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E Competition is one of the strongest motives there is.\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2013-11-03T01:09:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdatspace\u0022 data-cite=\u0022mdatspace\u0022\u003E\u003Cdiv\u003ECompetition is one of the strongest motives there is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, it also can spur innovation, and interest people in space.\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2013-11-03T01:25:01Z","Content":"\n\u003Cp\u003EThat was very enjoyable to read.\u003C/p\u003E\u003Cp\u003EAs for competition vs co-operation, co-operation is better. I don\u0027t think competition is actually helpful at all in accomplishing a goal we have, \u003Cem\u003Ebut\u003C/em\u003E it gives a reason to have the goal in the first place. Oh sure, there are many good logical reasons to focus on advancement in space, but people don\u0027t care about logic and reasoning for the most part. They care about having a bigger you know what than the other guy. Which is why competition can bring advancement where co-operation doesn\u0027t. That being said we should ideally stop our sillyness, set ourselves lofty goals and have all space agencies work together to do it. I am firmly of the belief that humanity can achieve unimaginable things if we would all work together to do it. Just as the trillions of cells in your body come together to make something much greater than the sum of it\u0027s parts, so could the billions of individual humans, if we wanted to.\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-11-03T01:37:36Z","Content":"\n\u003Cp\u003EWriting this thread had reminded me of John Kennedy\u0027s proposal to Nikita Khrushchev of a joint American-Soviet Moon mission. Khrushchev initially refused, but then changed his mind. Unfortunately, before he could contact Kennedy to accept his offer, he was shot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ss100x.com/jfk.jpg\u0022 alt=\u0022jfk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EKennedy, of course, not Khrushchev.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ELBJ, Kennedy\u0027s successor, didn\u0027t have the rapport with Khrushchev that Kennedy had, and the idea was shelved. However, it is fun to imagine Neil Armstrong and Alexei Leonov getting into all kinds of shenanigans on the Moon! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If any of you know of any AU stories out there that has this as a theme, do share!\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-11-03T03:09:30Z","Content":"\n\u003Cp\u003EPersonally, I\u0027m of the view that nationalism on the whole is idiotic. \u0022Oh, hey, look, that guy over there speaks a different language than we do! BANG BANG BANG!\u0022.\u003C/p\u003E\u003Cp\u003ECo-operating on these sorts of projects is the ONLY way they will succeed, especially as it allows different agencies to share risk and costs. The era of competing space programs is, in a word, over - it was a ludicrous proposition then, and is even more so now.\u003C/p\u003E\u003Cp\u003ETo be honest, I think that private industry will drive space technology in the next 30-50 years. They won\u0027t be the ones doing the EXPLORING, but they\u0027ll be the ones establishing infrastructures and developing new technologies, leaving the national space agencies (or even space nonprofits - who knows?) to do the exploring.\u003C/p\u003E\n"},{"CreatedByName":"Shuttle","CreatedById":5225,"CreatedDateTime":"2013-11-03T13:37:04Z","Content":"\n\u003Cp\u003EI can\u0027t say for sure, but as far as I remember one of OKB-1 engineers wrote Sputnik didn\u0027t separate from the last stage of the rocket.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003EHowever, it is fun to imagine Neil Armstrong and Alexei Leonov getting into all kinds of shenanigans on the Moon! If any of you know of any AU stories out there that has this as a theme, do share!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt reminds me of the idea of the lead soviet engineer in ~1972: abandon risky 1-launch scheme, build a moon base with two N1 launches by ~1980 instead and invite an american there!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E But Glushko wanted his own rocket very much...\u003C/p\u003E\n"},{"CreatedByName":"Krevsin","CreatedById":83150,"CreatedDateTime":"2013-11-03T15:39:44Z","Content":"\n\u003Cp\u003ECompetition is the fastest way to advance, but it is often dangerous and reckless, leading to it being tiring for both sides. \u003C/p\u003E\u003Cp\u003ECooperation is not the fastest way to advance, but it is the safest and most secure if a bit slow. It\u0027s also the best for improving existant technology, whereas competition is mostly about having the biggest and newest, with little respect to thing such as safety and reliability.\u003C/p\u003E\n"},{"CreatedByName":"tychochallenge","CreatedById":85444,"CreatedDateTime":"2014-04-29T00:32:37Z","Content":"\n\u003Cp\u003ECooperation would be nice, but unfortunately, it isn\u0027t going to get Americans back into space fast. If China lands a manned mission to the moon by the end of this decade, the American public will once again be incited by space travel and duel off against the Chinese to be the first to Mars. Sadly, thats how things work out nowadays:(\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-29T01:19:21Z","Content":"\n\u003Cp\u003ECompetition can result in a lot of amazing things, but I can\u0027t help but think that we could accomplish a lot more if we all worked together.\u003C/p\u003E\n"},{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2014-04-29T02:14:37Z","Content":"\n\u003Cp\u003EI would recommend competition, I know a lot of people will say that offers high advancement rate but war may occur, but the difference is like if everyone had guns (cooperation) there would be no progress because everyone would be dangerous. \u003C/p\u003E\u003Cp\u003EHowever, we all have to admit that if one person had a gun it would not be good either. A more competitive space race would be useful but it would have to have cooperation for it to work properly and get the most advanced tech at the lowest cost to each country..... Think of it like an economy no one way is the best no country is pure market and only one is pure command and everyone knows that lead to poverty, terror, and dictatorship (A.K.A. North Korea ;( )\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-29T03:48:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Krevsin\u0022 data-cite=\u0022Krevsin\u0022\u003E\u003Cdiv\u003ECompetition is the fastest way to advance, but it is often dangerous and reckless, leading to it being tiring for both sides. \u003Cp\u003ECooperation is not the fastest way to advance, but it is the safest and most secure if a bit slow. It\u0027s also the best for improving existant technology, whereas competition is mostly about having the biggest and newest, with little respect to thing such as safety and reliability.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis.\u003C/p\u003E\u003Cp\u003EAlso those who compare corporate competition to a space race are missing something. Competition works best when there\u0027s a choice to be made, like in natural selection or brand competition, but space exploration is nothing like choosing between coke and pepsi. The general population aren\u0027t choosing between CNSA, ESA and NASA. There\u0027s no real pressure to drive that competition, especially when a people are anti-science in the first place. If the Americans ever get their act together in the light of Eurasian cooperation it probably wont be for the right reasons, just like it wasn\u0027t for the right reasons in the last century. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI\u0027ll\u003C/span\u003E It\u0027ll probably be an emotional reaction to being left behind, and not simply a desire to move forward.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T06:52:36Z\u0022 title=\u002204/29/2014 06:52  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-04-29T06:48:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EThis.\u003Cp\u003EAlso those who compare corporate competition to a space race are missing something. Competition works best when there\u0027s a choice to be made, like in natural selection or brand competition, but space exploration is nothing like choosing between coke and pepsi. The general population aren\u0027t choosing between CNSA, ESA and NASA. There\u0027s no real pressure to drive that competition, especially when a people are anti-science in the first place. If the Americans ever get their act together in the light of Eurasian cooperation it probably wont be for the right reasons, just like it wasn\u0027t for the right reasons in the last century. I\u0027ll probably be an emotional reaction to being left behind, and not simply a desire to move forward.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027ll be that way as long as NASA is a government agency with it\u0027s purse strings controlled by politicians. NASA has to justify it\u0027s funding to people who rely on demagoguery to keep their jobs.\u003C/p\u003E\u003Cp\u003E\u0022With public sentiment, nothing can fail; without it nothing can succeed.\u0022 Abe Lincoln\u003C/p\u003E\u003Cp\u003EAll NASA needs is a decent public relations campaign. It should spend every cent of it\u0027s present revenue on a mass marketing campaign to inspire the population which would in turn cause the House to increase NASA funding from a half cent on the tax dollar to maybe a full penny or more. The Coast Guard has better advertising.\u003C/p\u003E\u003Cp\u003ENASA is in direct competition with apathy, and it\u0027s losing.\u003C/p\u003E\u003Cp\u003EEDIT: what\u0027s the html tag for strikethrough?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T06:58:10Z\u0022 title=\u002204/29/2014 06:58  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by xcorps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-29T07:08:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EThat\u0027s BBcode though.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EAnyway I can\u0027t disagree with much of what you said there, except the statement that NASA just needs better PR. The problems in America run much deeper than that. It\u0027s \u0022cultural\u0022 and \u0022traditional\u0022. We\u0027re getting off topic again.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EIt just occurred to me that you might be in favour of NASA privatisation, which is kind of what I\u0027ve been arguing against in that post.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T07:13:04Z\u0022 title=\u002204/29/2014 07:13  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-04-29T07:10:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: what\u0027s the html tag for strikethrough?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt varies by website code.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://developer.mozilla.org/en-US/docs/Web/HTML/Element/strike\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://developer.mozilla.org/en-US/docs/Web/HTML/Element/strike\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E This works \u0022\u0026lt;s\u0026gt; Blah Blah Blah\u0026lt;/s\u0026gt; \u0022 Just replace the \u003Cstrong\u003E\u0026lt; \u0026gt;\u003C/strong\u003E with \u003Cstrong\u003E[ ]\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0026lt;s\u0026gt; Blah Blah Blah\u0026lt;/s\u0026gt; \u003C/p\u003E\u003Cp\u003E\u0026lt;strike\u0026gt;Blah Blah Blah\u0026lt;/strike\u0026gt;\u003C/p\u003E\u003Cp\u003E\u0026lt;span style=\u0022text-decoration:line-through;\u0022\u0026gt;Blah Blah Blah\u0026lt;/span\u0026gt;\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EBlah Blah Blah\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EBlah Blah Blah\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E[span style=text-decoration:line-through]Blah Blah Blah[/span]\u003C/p\u003E\u003Cp\u003EI guess group Cooperation does work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T07:20:54Z\u0022 title=\u002204/29/2014 07:20  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Tommygun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-04-29T07:18:46Z","Content":"\n\u003Cp\u003ECooperation imo. Competition achieves better results but just isn\u0027t sustainable. If more space programs would work together then the tiny budgets they receive would be less of a problem.\u003C/p\u003E\u003Cp\u003EHowever the whole industry needs to be streamlined to make more effective use of budgets. This isn\u0027t just a problem the space industry has but the whole of western industry.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-04-29T09:11:43Z","Content":"\n\u003Cp\u003EI really don\u0027t have an answer for the question. Competition is usually a waste of resources, whereas cooperation allows to share competencies and resources in a far more rational way. Humans however, are not fundamentally rational beings, especially in a group.\u003C/p\u003E\u003Cp\u003EI just wanted to thank the OP for his well constructed posts. The tone, the illustrations, the captions, and the actual content raise the quality of this forum. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-29T09:38:28Z","Content":"\n\u003Cp\u003ECompetition will always be better, in the event of cooperation countries tend to try to spend less than one another so they can appear to be contributing but only on the face of it, in the event of competition, countries forget about money and focus on out doing each other.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T11:03:25Z","Content":"\n\u003Cp\u003ECooperation. Duplication of effort is a waste of resources, IMO.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-04-29T11:12:09Z","Content":"\n\u003Cp\u003ELogically, cooperation is better.\u003C/p\u003E\u003Cp\u003EUnfortunately, we are not Vulcans. We are an race that is well characterized by our laziness, ambition, greed, and rather cunning way of finding loopholes then exploiting them heavily in every possible way until closed. Long story short, we are born slackers. We don\u0027t fully commit ourselves unles we are faced with a possible threat, then all these brain functions kick in and we accomplish things we didn\u0027t think we could before.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2014-04-29T11:26:24Z","Content":"\n\u003Cp\u003EBoth paths offer benefits and drawbacks.\u003C/p\u003E\u003Cp\u003EFor me personally, considering the costs involved to push the boundaries, and with space being a \u0022for all humanity\u0022 place. I would say Cooperation is the way forward.\u003C/p\u003E\u003Cp\u003EIt would be nice if nations could partition off a multi-national space agency as a separate entity, that all involved could contribute to, and benefit from. An institution immune from \u0022diplomatic issues\u0022. Unfortunately that won\u0027t happen... especially due to technology crossover, and military applications of technology intended for space science and exploration.\u003C/p\u003E\n"}]}