{"TopicId":51768,"ForumId":16,"TopicTitle":"Multiple science in 1 mission only works 1?","CreatedByName":"RawChicken","CreatedById":57199,"CreatedDateTime":"2013-11-03T22:07:25Z","PageNum":1,"Articles":[{"CreatedByName":"RawChicken","CreatedById":57199,"CreatedDateTime":"2013-11-03T22:07:25Z","Content":"\n\u003Cp\u003EI sent this lander to the MÃƒÂ¼n with 5 big science modules. Once landed, each science module gives me 100 science (the report said that).\u003C/p\u003E\u003Cp\u003ESo, I should have \u002B500 science with me.\u003C/p\u003E\u003Cp\u003EOnce I return to Kerbin with all the modules and rescuing the vessel, I only get \u002B136 science. How is this? I cant make the same experiment multiple times?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-04T10:12:24Z\u0022 title=\u002211/04/2013 10:12  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 4, 2013\u003C/time\u003E by RawChicken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-11-03T22:15:01Z","Content":"\n\u003Cp\u003EEach gives you 100 science, with diminishing returns for each experiment. I thought it was half each time but obviously it\u0027s less than that.\u003C/p\u003E\u003Cp\u003EThey reported 100 science because you hadn\u0027t returned that experiment yet. The experiment has no way to know that you *will* return the others, so it can only report what you\u0027d get if you returned only it.\u003C/p\u003E\n"},{"CreatedByName":"RawChicken","CreatedById":57199,"CreatedDateTime":"2013-11-04T10:12:08Z","Content":"\n\u003Cp\u003EThat is what I thought, thank you. \u003C/p\u003E\u003Cp\u003EI saw people with 8 little science modules on 1 orbital flight so I thought you could count with as many as you can carry!\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-11-04T10:30:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RawChicken\u0022 data-cite=\u0022RawChicken\u0022\u003E\u003Cdiv\u003EThat is what I thought, thank you. \u003Cp\u003EI saw people with 8 little science modules on 1 orbital flight so I thought you could count with as many as you can carry!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbin has biomes, and i believe that you get new science points from readings above each biome. Not entirely sure about the science modules, but i know this is true for EVA reports.\u003C/p\u003E\n"}]}