{"TopicId":51834,"ForumId":55,"TopicTitle":"Welding Torch","CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-11-04T12:24:10Z","PageNum":1,"Articles":[{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-11-04T12:24:10Z","Content":"\n\u003Cp\u003EHi there.\u003C/p\u003E\u003Cp\u003ESo you\u0027re in space, docking with a station. Maybe for fuel, or maybe for crew, it doesn\u0027t matter. But then disaster strikes! Your keyboard burps, and the ship is sent crashing into the station, tearing off half of the solar panels in the process. And, well, that\u0027s it. Without power the station will become uncontrollable and drift forever, almost complete but lacking one vital part. And you watch as the thing you put hours into designing and assembling has to be abandoned to rot- \u003Cem\u003Eordoesit?!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EMy idea is simple (though difficult to implement, I imagine) - give the Kerbalnauts a welding torch. If -when- Stuff Goes Wrong, you can send up a ship with spare parts (or have them already aboard the station), and a Kerbal can install the part by welding it on. Obviously, there would have to be limitations - you couldn\u0027t (for example) install anything bigger than the largest solar panel, but you can detach them. Now, a Kerbal could carry over small fuel tanks or power cells to dead ships - just enough to dock them properly, or burn for re-entry. This would allow for proper rescue missions, as well as lessen the need to destroy ships by the Tracking Station. It also enables cargo missions and the need to judge what parts should be sent up, as well as the ability to upgrade stations over time as more parts become available or to use it for more things.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-04T14:54:51Z\u0022 title=\u002211/04/2013 02:54  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 4, 2013\u003C/time\u003E by Artie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DartBoris","CreatedById":91729,"CreatedDateTime":"2013-11-04T12:48:02Z","Content":"\n\u003Cp\u003EI suggest looking into \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/53134-Kerbal-Attachment-System-%28KAS%29-0-4-4-Struts-pipes-part-containers-and-more-%280-22%29\u0022 rel=\u0022external nofollow\u0022\u003EKAS\u003C/a\u003E Mod , it allows to attach-detach some small parts (solars , ladders , batterys , fuel tubes , etc) during EVA. You can have a box with theese spare parts on station or just take them from other ship.\u003C/p\u003E\n"},{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-11-04T14:34:28Z","Content":"\n\u003Cp\u003EI\u0027ll check that out, thanks!\u003C/p\u003E\n"},{"CreatedByName":"JiWint","CreatedById":78150,"CreatedDateTime":"2013-11-04T14:39:26Z","Content":"\n\u003Cp\u003EAlso,you can send a spare resources container to your space station,so if you break solar panel,you just take a spare one from container,and just weld it!\u003C/p\u003E\n"},{"CreatedByName":"Artie","CreatedById":71040,"CreatedDateTime":"2013-11-04T14:53:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JiWint\u0022 data-cite=\u0022JiWint\u0022\u003E\u003Cdiv\u003EAlso,you can send a spare resources container to your space station,so if you break solar panel,you just take a spare one from container,and just weld it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe I included that, unless you\u0027re talking about KAS (which I doubt, looking at your sig).\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2013-11-05T04:45:47Z","Content":"\n\u003Cp\u003ESounds great, I also like to see a remove function that kerbonaut can remove broken attached parts (or good ones included too) to balance the vehicle, reduce useless weight, chang lift center, etc.\u003C/p\u003E\n"},{"CreatedByName":"stargazer1235","CreatedById":52505,"CreatedDateTime":"2013-11-05T04:57:56Z","Content":"\n\u003Cp\u003ESounds like a cool idea, my bet is that the Devs have already taught of this and will bring it in when EVA gets another update. Maybe around the same time that we get payload farrings and stuff.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-05T05:01:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnV\u0022 data-cite=\u0022SaturnV\u0022\u003E\u003Cdiv\u003ESounds great, I also like to see a remove function that kerbonaut can remove broken attached parts (or good ones included too) to balance the vehicle, reduce useless weight, chang lift center, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, KAS allows Kerbals to also \u0022grab\u0022 parts off existing vessels.\u003C/p\u003E\u003Cp\u003EI recently decided to ditch ISA MapSat in favour of transitioning to damny\u0027s new SCANSat, so I scheduled a crewed servicing mission to rendezvous with my satellite. Before I loaded the game, I configured KAS to recongnize the MapSat dish as \u0022grabbable\u0022, so that when I went back into the game, Sigdorf Kerman literally yanked the MapSat dish off the sat, carried it onto his back and then attached it my SDHI SMS-based orbital ferry. I then deorbited my ferry, jettisoned the crew to safety and watched as the service module with the MapSat dish attached to it burned up on re-entry thanks to NathanKell\u0027s DRE Continued.\u003C/p\u003E\n"}]}