{"TopicId":51929,"ForumId":36,"TopicTitle":"[WIP] Orbital Manufacturing","CreatedByName":"attosecond","CreatedById":79130,"CreatedDateTime":"2013-11-05T04:41:39Z","PageNum":1,"Articles":[{"CreatedByName":"attosecond","CreatedById":79130,"CreatedDateTime":"2013-11-05T04:41:39Z","Content":"\n\u003Cp\u003EThis thread is for anyone interested in the effort to replace/upgrade Orbital Construction (OC) with something more functional, challenging, and fun. I\u0027m calling it Orbital Manufacturing, and the plugin to support this effort is currently under development. Use this thread as a place to post your ideas (I\u0027ve seen many good ones already) about the features you\u0027d like to see in the successor to OC. Currently planned features include:\u003C/p\u003E\u003Cp\u003E1) Modular system of parts: a manufacturing core with add-on extender parts that will allow you to increase the size of the dock.\u003C/p\u003E\u003Cp\u003E2) Maximum space-built vessel size is limited by the size/configuration of the dock. Add more extenders (width or length or both) and you can build a bigger ship. For really gargantuan space-built projects (all-in-one station construction, etc), I\u0027m thinking of a set of long truss-like manufacturing center extenders so that we don\u0027t have to fudge this restriction. \u003C/p\u003E\u003Cp\u003E3) Resource compatibility with OC Redux and Extraplanetary Launchpads (uses RocketParts)\u003C/p\u003E\u003Cp\u003E4) Build in orbit (no more Hyperedit-derived teleport from the lauchpad)\u003C/p\u003E\u003Cp\u003E5) *tentative* Delayed construction (aka click \u0022build\u0022 and you don\u0027t get your new ship right away): I\u0027ve had a lot of requests for this and I think it can be done, but of course my imagination takes over and makes it more complicated than it probably needs to be. I\u0027m thinking of establishing a base construction rate for dry mass at 1 ton/day/Kerbal. Example: the manufacturing core has space for 5 Kerbals, but I only have one in residence, so I only build at a 1 ton/day rate. Fly up 4 more Kerbals and give them quarters in the core, and the rate increases to 5 tons/day. Add more living space with other crew modules filled with Kerbals, and the rate increases again. For the impatient, I\u0027m also thinking you can double the rate for a penalty: your RocketParts expenditure will equal 200% of the vessel dry mass. Maybe I can even add an instantaneous build if you\u0027re willing to spend 1000% of the vessel\u0027s dry mass in RocketParts tonnage.\u003C/p\u003E\u003Cp\u003EOther items I\u0027d like to work out are docking clamps to hold the vessel in place without being officially docked (think KAS connections in the undocked mode) and extendable/retractable umbilicals that WILL form a docked connection to enable resource/Kerbal transfers to the new vessel. Long-term, I\u0027d like to petition Squad to expose methods for switching to a customized editor environment from flight mode. This should be functionally the same as the VAB, but with the current orbital manufacturing center and the real-time view of the celestial body it\u0027s orbiting as the texture, instead of the static VAB/SPH textures. These are for later, though. Right now I\u0027m working on items 2,3,4 in the above list. Once I get these mostly working I\u0027ll start in on #1.\u003C/p\u003E\u003Cp\u003EContributions: anyone who would like to make a serious effort to contribute to this project is welcome to do so. I\u0027m not a modeller, but thankfully I\u0027ve had several offers for modelling help. What I\u0027d like to do is get the plugin working to the point where a variety of part models can make use of it: as an example look at how Sperical Launchpads uses the Extraplanetary Launchpads plugin. As soon as I think things are stable enough for you modellers to jump in and start imagining on top of the plugin, I\u0027ll let you know and post any requirements you should be aware of _before_ you invest a lot of time. Once I have a functional alpha available I\u0027ll push the code up to Github, so if you\u0027re more of a coding type you can still pitch in if you\u0027re so inclined. Suggestions welcome! Progress update soon...\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-05T04:56:30Z","Content":"\n\u003Cp\u003EI\u0027m interested in pitching in - in fact, as you may be aware, some of my FusTek modules can already be used for OrbitalConstruction and the proposed Orbital Manufacturing (the Warehouse can currently hold RocketParts, and will soon use KASPAR for resupply). I\u0027d also be interested in adapting existing FusTek / making new models for spacedock components.\u003C/p\u003E\u003Cp\u003EOne thing I would like to see is the ability to \u0022queue\u0022 RocketPart consumption:\u003C/p\u003E\u003Cp\u003E - Let\u0027s say a player has a 100t ship they want to build in orbit\u003C/p\u003E\u003Cp\u003E - The player has a spacedock big enough to contain the completed ship, but their warehouses\u0027 total RocketPart capacity is 20t (and for some reason they don\u0027t plan to add more warehouses)\u003C/p\u003E\u003Cp\u003E - The player goes ahead and starts on the 100t ship anyway; the 20t available at the warehouses are immediately consumed for the build\u003C/p\u003E\u003Cp\u003E - Through a series of resupply missions, the player restocks the warehouses with RocketParts while the spacedock consumes them\u003C/p\u003E\u003Cp\u003E - Once the required 100t total is consumed, the ship is spawned inside the dock\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T05:04:05Z\u0022 title=\u002211/05/2013 05:04  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by sumghai\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-05T16:25:48Z","Content":"\n\u003Cp\u003EI love the idea of scaling construction speed based on Kerbals in the station... ship? Is there anything against this being mobile? Maybe the construction should be paused if under acceleration? Just a thought.\u003C/p\u003E\u003Cp\u003EAs to Kerbals -\u0026gt; speed, perhaps a later upgrade would be controller computer cores. This would be advanced tech but would allow manufacturing plants to operate without Kerbals. However I like the idea of Kerbals being useful, including late tech, so perhaps the cores are as efficient as Kerbals are at early tech, but once they are added to a station they also increase Kerbal\u0027s efficiency. Thus you still gain from adding Kerbals instead of Computer Cores, as long as you have at least one core.\u003C/p\u003E\u003Cp\u003EOn the\u0027build when materials not all to hand\u0027, I like the concept Sumghai. Perhaps just give a warning when Rocket parts are not sufficient, then use the Parts gradually during constructioin. Maybe something Alarm Clock-ish to warn when an Orbital Manufacting Center is getting low on parts, including the predicted shortfall on the current build. (EDIT: Ack, just realized, it\u0027s really awkward to deal with contuously altering \u0027fuel\u0027 rates when not the active vessel. Yeah, perhaps add in partial loads of Rocket parts, then an alarm clock warning when that added material is about to run out)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T17:15:54Z\u0022 title=\u002211/05/2013 05:15  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-05T16:42:57Z","Content":"\n\u003Cp\u003EOh, and as to helping with the project, I could technically offer modelling skills, but it\u0027s been a long time since I did that, and I don\u0027t know exactly what it entails to import to KSP through Unity. Since you already have offers for that, and since I also haven\u0027t learned C# (know C from a long time ago, but most of my programming skill is in Pascal, Basic or propriatory languages) and so can\u0027t aid really in programming the plugin, perhaps writing? If you need any descriptions for parts, naming conventions etc feel free to ask. (EDIT: Oh, and also concept art sketches if you need them. I\u0027m pretty good with a pencil.)\u003C/p\u003E\u003Cp\u003EI thought I\u0027d draw something up as an example, and since I don\u0027t know what others are already drawing I did a sketch of an inline Manufacturing control computer:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Mk1%20Manufacturing%20Comp2.jpg\u0022 alt=\u0022Mk1 Manufacturing Comp2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T21:33:22Z\u0022 title=\u002211/05/2013 09:33  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Grease1991","CreatedById":75586,"CreatedDateTime":"2013-11-05T22:20:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EOh, and as to helping with the project, I could technically offer modelling skills, but it\u0027s been a long time since I did that, and I don\u0027t know exactly what it entails to import to KSP through Unity. Since you already have offers for that, and since I also haven\u0027t learned C# (know C from a long time ago, but most of my programming skill is in Pascal, Basic or propriatory languages) and so can\u0027t aid really in programming the plugin, perhaps writing? If you need any descriptions for parts, naming conventions etc feel free to ask. (EDIT: Oh, and also concept art sketches if you need them. I\u0027m pretty good with a pencil.)\u003Cp\u003EI thought I\u0027d draw something up as an example, and since I don\u0027t know what others are already drawing I did a sketch of an inline Manufacturing control computer:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Mk1%20Manufacturing%20Comp2.jpg\u0022 alt=\u0022Mk1 Manufacturing Comp2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI Like it, maybe you could also draw up a radial one as well, to go along with the that one.\u003C/p\u003E\u003Cp\u003Emaybe bigger cores for faster builds,\u003C/p\u003E\u003Cp\u003Eafterthought: maybe we could get UbioZur\u0027s help in make these two mods compatible and be able to have a larger truss/bay/pad (s) built from smaller ones but not create massive amounts of parts/lag\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/38577-0-22-UbioZur-Welding-Ltd-2-0-Playtest-3-Now-In-Game-Tool\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/38577-0-22-UbioZur-Welding-Ltd-2-0-Playtest-3-Now-In-Game-Tool\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Proply","CreatedById":65418,"CreatedDateTime":"2013-11-05T22:20:18Z","Content":"\n\u003Cp\u003EPersonally I would be most interested in an orbital construction mod that simply allows you to detach and rearrange parts manually in EVA; to build a large complex ship in orbit you would send all the parts required up in a series of launches in \u0022storage\u0022 form (eg: 20 large solar arrays attached to a small orbital stage) and after rendezvousing in orbit with all the other parts required you would EVA some kerbals, fly over to a part, select and detach it, fly over to another part, and attach the parts together. This would basically be like building a ship in the VAB, but with each part needing to be launched to orbit and manually manoeuvred \u002B assembled in EVA.\u003C/p\u003E\u003Cp\u003E[EDIT] Maybe require some kind of heavy EVA exoskeleton/vehicle with cutting/welding tools to enable this, so that you can\u0027t just do this anywhere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T22:28:27Z\u0022 title=\u002211/05/2013 10:28  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Proply\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-05T22:53:27Z","Content":"\n\u003Cp\u003EOK, here\u0027s a radial version:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Mk1r%20Radial%20Man%20Comp.jpg\u0022 alt=\u0022Mk1r Radial Man Comp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe extensions are so no matter what the clipping between the actual surface of what it attaches to, and the connect point, it should still look good. Of course if the part is shorter than this is tall then those extensions will stick out top and bottom. Maybe round the ends so it looks like piping curling back in to the part?\u003C/p\u003E\u003Cp\u003EAs to bigger cores, perhaps do the diameter for larger systems? IE, 0.625 is the small add on, 1.25 for medium and 2.5 for large. Or we could base it all off one diameter and increase heights for bigger systems if you want.\u003C/p\u003E\u003Cp\u003EI like Proply\u0027s idea, though I suspect it might not be doable in KSP right now. But given some of the extreme stuff happening in KSP right now (Real Earth, KMP, etc) maybe I could be wrong. If it isn\u0027t possible maybe a graphical variation only? Perhaps during the time it takes to assemble have robot arms push parts into place for assembly. Perhaps even build them alongside the construction part then move them into place. I suspect this too isn\u0027t possible, but we can hope.\u003C/p\u003E\u003Cp\u003EI didn\u0027t know the weld mod could weld parts IN GAME. I thought it was all outside of KSP itself. I\u0027ll have to check up on that. Yes, the possibilities of welding parts to a core unit to extend capabilities are fascinating Grease.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-05T23:01:37Z\u0022 title=\u002211/05/2013 11:01  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 5, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-05T23:12:41Z","Content":"\n\u003Cp\u003EProply\u0027s suggestion of EVA-based construction is (partially implemented) in KAS 0.4.x - I\u0027ve recently done a servicing mission where I rendezvoused a crewed orbital ferry with a satellite I launched in 0.19.x, and got a Kerbal to rip the ISA MapSat dish off and plonk it on the (soon-to-be-destroyed) service module. The logical step, of course, would be for KAS to also use the same snap attachment nodes in the VAB/SPH editor.\u003C/p\u003E\u003Cp\u003EThat being said, I prefer the Orbital Manufacturing proposal as it cuts down on the tedium involved.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-05T23:26:14Z","Content":"\n\u003Cp\u003EDang! I didn\u0027t even think of KAS. Honestly I haven\u0027t used the \u0027grab and plug\u0027 feature that much in KAS. I\u0027ll have to go back and find out what can be removed and placed currently.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-05T23:36:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EDang! I didn\u0027t even think of KAS. Honestly I haven\u0027t used the \u0027grab and plug\u0027 feature that much in KAS. I\u0027ll have to go back and find out what can be removed and placed currently.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy default, KAS comes with configs for very small parts like science sensors, solar panels and RCS thrusters. But it can actually be configured for \u003Cstrong\u003E\u003Cem\u003E*any*\u003C/em\u003E\u003C/strong\u003E part (although having a Kerbal on EVA carry a Rockomax Jumbo-64 Fuel Tank doesn\u0027t really make practical sense)\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-05T23:49:14Z","Content":"\n\u003Cp\u003ECould it be limited to only when something else is connected to the EVA\u0027d Kerbal? IE some kind of exoskeleton that Proply suggested. That would mean two connection points on the Kerbal though. Or maybe a connection on the exoskeleton?\u003C/p\u003E\n"},{"CreatedByName":"Yorik","CreatedById":3479,"CreatedDateTime":"2013-11-06T14:27:25Z","Content":"\n\u003Cp\u003ESince I\u0027ve got some time on my hands now I\u0027d be interested in helping out with modelling. I really like the sketches earlier in the thread. I could also model drills and converters for rocket parts if someone draws me a sketch.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-06T16:10:29Z","Content":"\n\u003Cp\u003EI\u0027ll see if I can come up with something. Can\u0027t right this minute as I\u0027m at work, but I\u0027ll sketch something up when I get back. Any constraints on how drills etc mount yet or is this still all up in the air? Radial, stacked with extension?\u003C/p\u003E\u003Cp\u003EAlso, for a \u0027convertor\u0027 that makes rocket parts is an animation of pistons or something moving (to represent stamping, molding parts etc) viable? I was thinking a standard cylindical thing that opens on the side so the mechanism extends out to function. still got top and bottom connectors, but no radial connectors due to animation... actually, if we\u0027re doing something to convert ore to metal, then another to make rocket parts from metal, perhaps use something opening sideways and glowing for a smelter, then use a few small arms facing inwards (you just see the elbows outside) that seem to be working on something within for the parts maker?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-06T16:16:07Z\u0022 title=\u002211/06/2013 04:16  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 6, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-06T20:52:10Z","Content":"\n\u003Cp\u003EOK, a couple of rough sketches (perspective is a little wonky on bits) of a drill, smelter and a rocket part fabricator.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Fold%20Out%20Drill.jpg\u0022 alt=\u0022Fold Out Drill.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a revolver type, similar to the extensions on drill on oil platforms (though automatic). A length extends, then the revolver section rotates, lining up another length of drill which locks to the first. Then it extends that length out and rotates again. Wash, rinse, repeat. The whole assembly hinges up, then slides into it\u0027s cover with a hatch plate to protect it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Smelter\u0026amp;Fabricator.jpg\u0022 alt=\u0022Smelter\u0026amp;Fabricator.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe smelter is covered in heat tiles, not to protect it but to keep the heat in. Minimizing thermal losses helps in such things. Odd then that there are four gaping holes in the side \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Just for effect to show when it\u0027s working.\u003C/p\u003E\u003Cp\u003EThe fabricator has an assembly of odd containers at the top representing stages in small, sub-component storage (electronics components like resisters etc in one can, spools of wire in another, small connectable plates in another, etc etc.), then below is an assembly bay using four robot arms to weld it all together. Then out the bottom into whatever rocket part storage you have on the vessel.\u003C/p\u003E\u003Cp\u003E(EDIT: After looking at what I drew, I think both the smelter and the fabricator should have wider plates top and bottom to fit into parts roughly the same diameter as their largest section. Should have thought of that when I drew them.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-06T20:57:24Z\u0022 title=\u002211/06/2013 08:57  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 6, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boberts314","CreatedById":69216,"CreatedDateTime":"2013-11-07T15:28:03Z","Content":"\n\u003Cp\u003EI am as interested in helping with this as I am unqualified to contribute to it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-07T15:35:54Z","Content":"\n\u003Cp\u003EThe drill concept looks great! I\u0027ll be watching this.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EThe logical step, of course, would be for KAS to also use the same snap attachment nodes in the VAB/SPH editor.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is something I\u0027d like to add. Unfortunately, my todo list is long and now spans several mods, but this may not be particularly challenging to implement. Still, assembling a craft with Kerbals could indeed become very tedious.\u003C/p\u003E\u003Cp\u003EI wonder if it would be fun to design a ship in the VAB but then require a Kerbal to move all the pieces into place manually. You\u0027d have the benefits of the editor building tools while also having more \u0022realistic\u0022 assembly.\u003C/p\u003E\n"},{"CreatedByName":"lijat","CreatedById":58830,"CreatedDateTime":"2013-11-07T15:46:35Z","Content":"\n\u003Cp\u003EWhat would be really cool (but probably hard to implement) is for the kerbals in orbital shipyard to go eva on their own and move pieces on their own, I guess it is technically possible as the EVA followers mod was possible but probably implementation is to complex to be worth it. I still love the image of lots of kerbals swarming around the ship as it is being built.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-07T15:57:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EThe drill concept looks great! I\u0027ll be watching this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Majiir. I like how that one came out too, though not too happy with the Smelter. Might give that another look sometime. Maybe it\u0027ll look better with the wider top and bottom plates, with the supports coming from between the ceramic plates? On an aside I did get my copy of Milkshape up and running again and had a go at modeling the radial computer core... not so hot (don\u0027t have a pic accessible right now). It\u0027s been a while since I modeled and I think it shows.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe logical step, of course, would be for KAS to also use the same snap attachment nodes in the VAB/SPH editor.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is something I\u0027d like to add. Unfortunately, my todo list is long and now spans several mods, but this may not be particularly challenging to implement. Still, assembling a craft with Kerbals could indeed become very tedious.\u003C/p\u003E\u003Cp\u003EI wonder if it would be fun to design a ship in the VAB but then require a Kerbal to move all the pieces into place manually. You\u0027d have the benefits of the editor building tools while also having more \u0022realistic\u0022 assembly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that would be cool, but I think it should be an option. Could get annoying to have to go through such construction time and again, as you said. Maybe it helps in certain ways to build things like that? Maybe more efficient if slower to build or something? That way it could be skipped if someone would rather just do it through some computerized, 3d printer-ish assembly method that didn\u0027t involve manual assembly\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T15:59:34Z\u0022 title=\u002211/07/2013 03:59  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-11-07T21:35:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EStill, assembling a craft with Kerbals could indeed become very tedious.\u003Cp\u003EI wonder if it would be fun to design a ship in the VAB but then require a Kerbal to move all the pieces into place manually. You\u0027d have the benefits of the editor building tools while also having more \u0022realistic\u0022 assembly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EI think that would be cool, but I think it should be an option. Could get annoying to have to go through such construction time and again, as you said. Maybe it helps in certain ways to build things like that? Maybe more efficient if slower to build or something? That way it could be skipped if someone would rather just do it through some computerized, 3d printer-ish assembly method that didn\u0027t involve manual assembly\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, manual assembly should be an option, and also limited to just adding trusses to space stations. Large vessels would be better off \u0022spawned\u0022 via Orbital Manufacturing\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lijat\u0022 data-cite=\u0022lijat\u0022\u003E\u003Cdiv\u003EWhat would be really cool (but probably hard to implement) is for the kerbals in orbital shipyard to go eva on their own and move pieces on their own, I guess it is technically possible as the EVA followers mod was possible but probably implementation is to complex to be worth it. I still love the image of lots of kerbals swarming around the ship as it is being built.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assume the EVA Follower mod makes following Kerbals mimic every move of the active Kerbal, but with a time delay to emulate following.\u003C/p\u003E\u003Cp\u003EAutonomous Kerbal operations in EVA would require access to some form of character rigging AVI, pathfinding in a three-dimensional space and traversing along the craft tree to determine which order parts should be placed, as well as issues with large amounts of physics happening as the craft is being built.\u003C/p\u003E\u003Cp\u003EStill, definitely a fun idea.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-07T23:38:51Z","Content":"\n\u003Cp\u003EI\u0027ve just had a thought. (I know, unbelievable isn\u0027t it!)\u003C/p\u003E\u003Cp\u003EI\u0027ve considered before limiting what a non-VAB builder can build in the way of ships before. Size limitation. Mass limitation etc. What about tech node limitation? Is it possible for a device to only build ships with components only from, say, one tier below when the construction device becomes available? That way it can\u0027t build itself, and maybe is fairly small. Larger units could build more advanced technology, including the smaller, low tech constructors. It might be a better way to limit construction growth and is at least partially realistic. It would force colonies to rely on older technologies and they\u0027d still have to ship the advanced stuff in from Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"boberts314","CreatedById":69216,"CreatedDateTime":"2013-11-07T23:56:13Z","Content":"\n\u003Cp\u003EThe golden ideal, at least in my head, would be to have trusswork and moving gantries with robotic arms putting things into place. Some aspects of which might be doable if your long term plans work out, attosecond. I\u0027m envisioning being able to custom build an assembly area and then have that represented in the editor environment you talked about such that players could add clamps and umbilicals to predesignated points. It seems like one issue you\u0027re liable to run into at some point is how to set the extenders up so that they won\u0027t limit unusual ship designs, if custom docks were possible they could be a way to pass that on to the player.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EI assume the EVA Follower mod makes following Kerbals mimic every move of the active Kerbal, but with a time delay to emulate following.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was actually based on some sort of simple crowdbased pathfinding logic, with the followers just trying to make their way to the followee while maintaining some space between each other. You\u0027re right about the difficulties though. As far as I know it never worked in 3d space, for example.\u003C/p\u003E\n"},{"CreatedByName":"attosecond","CreatedById":79130,"CreatedDateTime":"2013-11-08T04:47:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EOne thing I would like to see is the ability to \u0022queue\u0022 RocketPart consumption\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis can be added in without much fuss when I implement the delayed construction.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EAs to Kerbals -\u0026gt; speed, perhaps a later upgrade would be controller computer cores. This would be advanced tech but would allow manufacturing plants to operate without Kerbals.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m uncertain about this one... I might need some convincing that an add-on computer module can help make assembly happen faster. My PC, for instance, doesn\u0027t help me mow the lawn faster. Perhaps a robot storage facility that still needs 1 Kerbal to program the robots, and can have robots added in the same way Kerbals are added... I don\u0027t want to squash any ideas, but I also want to keep it at least somewhat realistic.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EWhat about tech node limitation? Is it possible for a device to only build ships with components only from, say, one tier below when the construction device becomes available? That way it can\u0027t build itself, and maybe is fairly small.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomething like this is planned for the first release. I was thinking of hard coding the mod so that manufacturing cores \u003Cem\u003Ecan not\u003C/em\u003E be built in space--they must be launched. I\u0027ve had both yea and nay votes for the ability to build dock extenders in space... these parts will probably be somewhat unwieldy, so in one sense it\u0027s reasonable to think that a manufactory could build its own expansion pieces. On the other hand, it\u0027ll make it almost too easy to put together a truly monstrous facility. Re other parts in the tech tree (limiting construction to 1 tier down and below), we\u0027d need to find a way to make it work with these custom trees I see bandies about. Some sort of tree crawler code... \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boberts314\u0022 data-cite=\u0022boberts314\u0022\u003E\u003Cdiv\u003EThe golden ideal, at least in my head, would be to have trusswork and moving gantries with robotic arms putting things into place. Some aspects of which might be doable if your long term plans work out, attosecond. I\u0027m envisioning being able to custom build an assembly area and then have that represented in the editor environment you talked about such that players could add clamps and umbilicals to predesignated points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMany of the functions exposed in Assembly-CSharp.dll are undocumented, so there\u0027s a lot of playing around to figure how things work (or if they work). It would be fantastic to be able to animate something like this and code the back end so that it actually builds any craft you give it... One step along the way is something I thought I might tinker with after I get the delayed construction working: crawling the part tree from the root part and adding each part to the vessel under construction once an appropriate quantity of RocketParts has been consumed. With this, at least you can see the ship appearing piece-by-piece over time, instead of all at once at the end. \u003C/p\u003E\u003Cp\u003EPatupi- I like the drill/smelter/RocketParts converter sketches a lot! There\u0027s no reason for you to wait for me to get an Orbital Manufacturing alpha out there before you make these parts. There are plenty of people (me, for one) who would love an alternative to the existing auger/smelter/factory included with ExLaunchpads. Put these parts together and release them on their own!\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-11-08T10:12:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022attosecond\u0022 data-cite=\u0022attosecond\u0022\u003E\u003Cdiv\u003EI\u0027m uncertain about this one... I might need some convincing that an add-on computer module can help make assembly happen faster. My PC, for instance, doesn\u0027t help me mow the lawn faster. Perhaps a robot storage facility that still needs 1 Kerbal to program the robots, and can have robots added in the same way Kerbals are added... I don\u0027t want to squash any ideas, but I also want to keep it at least somewhat realistic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThink car factory. A single Kerbal manning the computer and doing \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epercussive\u003C/span\u003E hands-on maintenance where needed, plus x number of robotic manufacturing tools. You might even make it so that ship size limits how much benefit is gained from having extra robots. There might be need for processing power to control the robots as well, though that could easily be integrated into the robot part/resource/thing.\u003C/p\u003E\u003Cp\u003EAdvanced computer tech might enable the facility to be wholly automated, with the computer recognizing and solving maintenance tasks with its own robots.\u003C/p\u003E\n"},{"CreatedByName":"gl0ryh0und","CreatedById":63038,"CreatedDateTime":"2013-11-08T11:16:31Z","Content":"\n\u003Cp\u003EI love where this is all going, but one thing I\u0027m smitten with is the Kerbals doing the construction. Somehow having a whole bunch of robotic construction steals some of the appeal. also robotic assembly in space would be very high tech, I would make it an end game type of technology, Perhaps something to augment the kerbals in the mean time? robotic gantry that gives a bonus to construction speed but which can\u0027t build on it\u0027s own. have work stations that you can assign Kerbals to, and while they are assigned they float about the ship under construction and when they are near joints you could generate sparks or flashes to give the impression of welding.\u003C/p\u003E\u003Cp\u003EAlso you could have a part assembly module that is all closed up, and as the part is made the doors open up and take the part to the assembly dock for integration into the main ship.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-08T11:29:18Z","Content":"\n\u003Cp\u003EPerhaps the first manufacturing plant is manual, kerbals only to run it. Later an automated version is developed, and can be operated by Kerbals or computer cores?\u003C/p\u003E\u003Cp\u003E(EDIT; Missed your post Gl0ryh0und. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Yeah, I too think that Kerbals doing manufacturing would be cool, and as I said before, even late game I think there should be an advantage to still using Kerbals in automated facilties instead of computer controlled systems. The comps just use electricity and are small (and less messy. SNACKS!) but maybe the automated plant with Kerbals running things is still more efficient than with comps... maybe their AI systems just aren\u0027t good enough to cope with anything beyond their programming)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T11:32:50Z\u0022 title=\u002211/08/2013 11:32  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}