{"TopicId":52103,"ForumId":16,"TopicTitle":"Atomic Engine Explosions","CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2013-11-06T16:26:08Z","PageNum":1,"Articles":[{"CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2013-11-06T16:26:08Z","Content":"\n\u003Cp\u003Eok, so i have another problem for you guys to help me with (seems i have a lot these days)\u003C/p\u003E\u003Cp\u003Ethis these pics show the top 2 stages of my rocket\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.imagebam.com/image/b58c48286954301\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://thumbnails104.imagebam.com/28696/b58c48286954301.jpg\u0022 alt=\u0022b58c48286954301.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://www.imagebam.com/image/dfb59e286954495\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://thumbnails107.imagebam.com/28696/dfb59e286954495.jpg\u0022 alt=\u0022dfb59e286954495.jpg\u0022\u003E\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E(click for full size)\u003C/p\u003E\u003Cp\u003Ewhen i hit the space bar to drop the 4 liquid fuel tanks and activate the 8 LV-N Atomic Rocket Motors something explodes and i lose 7-8 or the engines (varies with different attempts)\u003C/p\u003E\u003Cp\u003Ei cant see what im doing wrong so maybe you can\u003C/p\u003E\u003Cp\u003EPlease help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Cranium","CreatedById":69153,"CreatedDateTime":"2013-11-06T16:32:11Z","Content":"\n\u003Cp\u003EYour problem is the shrouds on the inner engines. They eject outwards, so they will collide with the outer engines. Why do you need so many engines for such a small payload? You\u0027re getting awfully inefficient with that many engines.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-06T16:38:52Z","Content":"\n\u003Cp\u003EThere are two visible stitches on each shroud, one on each side. It will open along these and the two parts will go apart with quite a bit of force. So you need to rotate your engines so the stitches are sticking diagonally out. Then they will collide to each other and your engines will stay intact.\u003C/p\u003E\u003Cp\u003EUse Shift\u002BQ/E to rotate your engines in VAB in increments of 5 degrees.\u003C/p\u003E\n"},{"CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2013-11-06T16:39:17Z","Content":"\n\u003Cp\u003Eits not got any payload \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003Eits the engine module for a bigger Eve ship (but isnt part of ksp designing insane/silly ships?)\u003C/p\u003E\u003Cp\u003Eand thanks, i didnt know they went out.... i\u0027ll have a rethink\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-06T16:42:19Z\u0022 title=\u002211/06/2013 04:42  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 6, 2013\u003C/time\u003E by ohlookabirdie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-06T18:27:50Z","Content":"\n\u003Cp\u003EVery similar to the problem discussed \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56797-Quadcoupler-Staging\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, including a fairly clever solution.\u003C/p\u003E\u003Cp\u003EYou do not need that many engines, even for going to Eve. You can ditch half those engines and keep the same amount of fuel and probably have a better interplanetary craft overall.\u003C/p\u003E\u003Cp\u003EAlso, most of those reaction wheels are a waste - with the arrangement you have, five inline reaction wheels != 5 times the turning power. Less is more, especially since you have RCS installed. There\u0027s also no source of power for those reaction wheels so they won\u0027t work with the engines off... AFAIK there\u0027s no internal energy storage on them.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2013-11-06T20:17:00Z","Content":"\n\u003Cp\u003EWho else came to this thread expecting little mushroom clouds?\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-11-06T20:41:12Z","Content":"\n\u003Cp\u003EWay too much dead weight in LV-N for what fuel your are carrying for them. You could use LV-909s, make up the weight difference with added fuel, and get better performance as the fuel gets used up.\u003C/p\u003E\u003Cp\u003EAs others have stated, the shrouds blowing off during staging are causing the loss of the engines. Rotate them 45% so they miss the engines while hitting each other.\u003C/p\u003E\n"},{"CreatedByName":"Jestem","CreatedById":79852,"CreatedDateTime":"2013-11-06T23:52:49Z","Content":"\n\u003Cp\u003EIf you use the extended decouplers that hold the external engines a good distance away from the central core, then you will not need to mess around with changing the orientation of the fairings in order to allow the engines to fire without damaging each other.\u003C/p\u003E\u003Cp\u003EInterestingly enough, it looks as if you are using the extended decouplers already. Seems odd as I have only had the problem you are describing with the decouplers that hold tanks much closer together.... Perhaps try moving the external engines down relative to the main craft a little, sometimes that might mean that the force is contained by the sturdier fuel tanks....\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-11-07T00:36:26Z","Content":"\n\u003Cp\u003EIf I was building this rocket, it would just be one orange tank, some batteries, some solar panels, a large docking port, and one nuclear engine. The whole thing would be built upside down on top of the launcher rocket, so that I wouldn\u0027t have to worry about the L-VN\u0027s decoupler shrouds.\u003C/p\u003E\u003Cp\u003EIn order to bypass having gimbal confusion, the interplanetary vehicle\u0027s control pod would also be upside down, like the payload, but the launcher would have its own control pod which would be mounted upright. Right before launch, I would select the launcher control pod and click \u0022Control from here\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zephram Kerman\u0022 data-cite=\u0022Zephram Kerman\u0022\u003E\u003Cdiv\u003EWho else came to this thread expecting little mushroom clouds?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did.\u003C/p\u003E\n"}]}