{"TopicId":52251,"ForumId":25,"TopicTitle":"(OLD) The Ultimate Jool-5 Challenge:land Kerbals on all moons and return in one big mission","CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-07T16:59:28Z","PageNum":48,"Articles":[{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-06-07T03:48:44Z","Content":"\n\u003Cp\u003E@McFarnsworth, that\u0027s a nice looking ship. Does it have dV for Tylo?\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-06-07T11:02:17Z","Content":"\n\u003Cp\u003ESorry I\u0027ve not been about much; tanker problems caused me to at first start playing around with another challenge for a bit (my own) then all of a sudden I had a Dead Island Epidemic Beta key to use... so been on that a lot!\u003C/p\u003E\u003Cp\u003EI have had to restart assembly on my mega-tanker due to the problems experienced earlier, I\u0027m hoping I can put it together right this time \u0026gt;.\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2014-06-07T11:58:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003E@McFarnsworth, that\u0027s a nice looking ship. Does it have dV for Tylo?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike I said, haven\u0027t tested anything yet. In theory it has enough dV, but the TWR is pretty low for a Tylo landing (\u0026lt;1 for a lot of the descent) so it might take 37 attempts to get the timing and the amount of fuel I take down with me right. The original plan was to not leave any parts behind so the entire ship can be parked back in Kerbin orbit, refuelled and used again. But I had to make use of a droptank for the Tylo part of the mission. Since the Tylo lander makes use of the ship\u0027s main engines I really need to get those back into orbit.\u003C/p\u003E\u003Cp\u003EI\u0027m also not sure about the dV of the mothership. I just guessed that 2 large tanks should do it, but it might not be enough or way too much. I want to do this in a single launch, so no refueling during the mission.\u003C/p\u003E\u003Cp\u003EI also noticed I haven\u0027t included any ladders yet on the Tylo lander.\u003C/p\u003E\n"},{"CreatedByName":"Himynameisjake","CreatedById":101602,"CreatedDateTime":"2014-06-07T13:52:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EI know he doesn\u0027t like clipping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know he doesn\u0027t, but you saw my zephyrus ship, it was ugly as sin lol. I can go ugly again, but I figure if I\u0027m going to spend that long looking at it, I just want it to look pretty.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022McFarnsworth\u0022 data-cite=\u0022McFarnsworth\u0022\u003E\u003Cdiv\u003ELike I said, haven\u0027t tested anything yet. In theory it has enough dV, but the TWR is pretty low for a Tylo landing (\u0026lt;1 for a lot of the descent) so it might take 37 attempts to get the timing and the amount of fuel I take down with me right. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E37 huh? that\u0027s an oddly specific number \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2014-06-07T16:53:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Himynameisjake\u0022 data-cite=\u0022Himynameisjake\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E37 huh? that\u0027s an oddly specific number \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGive or take a few dozen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Himynameisjake","CreatedById":101602,"CreatedDateTime":"2014-06-07T22:42:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022McFarnsworth\u0022 data-cite=\u0022McFarnsworth\u0022\u003E\u003Cdiv\u003EGive or take a few dozen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s how many tries it took to land my screwed up lander on Tylo lol\u003C/p\u003E\n"},{"CreatedByName":"OgreMagi","CreatedById":103767,"CreatedDateTime":"2014-06-08T07:21:32Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://imgur.com/a/p6TtP\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/p6TtP\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethere are the pics to my Laythe SSTO space plane it took a while but I am now working on the landers and main ship. that should go much easier. \u003C/p\u003E\u003Cp\u003Ebut here is my post \u003C/p\u003E\u003Cp\u003EUnshamming BLOG of advertismant for the ......\u003C/p\u003E\u003Cp\u003EPresenting the Hermes A4 SSTO, Pride of the JunkWorks Space plane demolition and assembly \u003C/p\u003E\u003Cp\u003Eyard. \u003C/p\u003E\u003Cp\u003EThe Hermes basically a modded Areas A4, with Kethan parts, a single turbo jet, and 2 Kommit \u003C/p\u003E\u003Cp\u003ENuclenics LtBY 12k nuclear engine with a lot of capability built into the craft. \u003C/p\u003E\u003Cp\u003EIt is capable of SSTO from sea level, able to search, mine, store and process Kethan, make standard \u003C/p\u003E\u003Cp\u003Elandings, parachute landings and conduct operations on water. \u003C/p\u003E\u003Cp\u003EYES it is capable of Floating/Landing and Take Off from sea level, the reversed radial intakes make \u003C/p\u003E\u003Cp\u003Egreat floats and since they are mounted in reverse they provide air intake with zero Drag. Notice that \u003C/p\u003E\u003Cp\u003Ethe landing gear is mounted low, on octaginal struts , for clearance when landing on water. \u003C/p\u003E\u003Cp\u003ESupplementing the radial intakes are 4 Ram intakes which left off until high in the atmosphere. \u003C/p\u003E\u003Cp\u003EAircraft like cars are dependant on fuel to move, like the saying about old cars they can pass \u003C/p\u003E\u003Cp\u003Eanything on the road but a gas station. However the Hermes isnt dependant on a mother ship to \u003C/p\u003E\u003Cp\u003Erefuel. The Hermes can self refuel as long as there is a kethane field within its flight range. \u003C/p\u003E\u003Cp\u003EWith its kethane equipment added, the small kethane detector, standard small drill, small processor, \u003C/p\u003E\u003Cp\u003Eand 2 small kethan storage tanks the Heremes can refuel itself in a few hours.\u003C/p\u003E\u003Cp\u003EIn addition it mounts a kethan power generator which adds the supplemental power needed to run \u003C/p\u003E\u003Cp\u003Ethe drill and processor without having to add a ton or more of solar panels. \u003C/p\u003E\u003Cp\u003EIn flight the Hermes is stable and resistive to roll but sensative enought to make water landings when \u003C/p\u003E\u003Cp\u003Eneeded. Take off from the runway is easy and the craft lefts at 60 m/s with lift arround 75 m/s. Flight \u003C/p\u003E\u003Cp\u003Etesting of the Hermes demonstrated it can move at 70 m/s on water, making it as capable as a hover \u003C/p\u003E\u003Cp\u003Ecraft over short distances. If there is not enought level ground to pit down on the Hermes carries a \u003C/p\u003E\u003Cp\u003Eparachute landing system however parachute landings on water will damage the aircraft and shoudl \u003C/p\u003E\u003Cp\u003Eonly be attempted in the most dire circumstances. \u003C/p\u003E\u003Cp\u003EWater landing do require a gentle touch as the plane is tail heavy and too fast decent will cause \u003C/p\u003E\u003Cp\u003Edamage to the engines and drilling probe. \u003C/p\u003E\u003Cp\u003EDont have a pilot, not a problem the Hermes carries the state of the art in electronics with hardwired \u003C/p\u003E\u003Cp\u003EProbodobodyne OKTO2 linked to the cockpit capable or remote piloting of the craft and with the \u003C/p\u003E\u003Cp\u003Eadvance communication gear, the communitron 88-88 and COMMS DTS-M1 ensure solid carrier \u003C/p\u003E\u003Cp\u003Esignals from ground, orbit and interplanetary.\u003C/p\u003E\u003Cp\u003ERational of design. \u003C/p\u003E\u003Cp\u003EYea i tried to build it all in one package, took a bit but it can do most of everything i want it too. \u003C/p\u003E\u003Cp\u003ETook a while to get it working but I spent way too much time trying to build larger complicated planes \u003C/p\u003E\u003Cp\u003Ewith little success. Had too many roll over crashes and uncontrolables until i remember an article \u003C/p\u003E\u003Cp\u003Eabout military aircraft. short version the military modded many of thier best designs simple because \u003C/p\u003E\u003Cp\u003Eit was easier to work with a stable, reliable aircraft. so that got me thinking i should use a stock craft \u003C/p\u003E\u003Cp\u003E and simply modify it . \u003C/p\u003E\u003Cp\u003ESpecs ...\u003C/p\u003E\u003Cp\u003E Max take off weight is 24.46 t with the kethan tanks and all standard tanks full but i fly it with less \u003C/p\u003E\u003Cp\u003Ethan the max fuel load ( 18.62 t take off wieght) to keep the mass down. Note that the center tanks \u003C/p\u003E\u003Cp\u003Efeed the jet engine and the outer tanks feed the LVN 14Kn. \u003C/p\u003E\u003Cp\u003E Typical fuel load for SSTO 100km orbit arround kerbin is to load the forward center tank FL-t800 \u003C/p\u003E\u003Cp\u003Ewith 252 fuel and no oxidizer, the rear center jet fuel tank with 90 units of fuel, the outer 2 FL -T400 \u003C/p\u003E\u003Cp\u003Etanks half load ( 90/110) and the 2 FL-T200 tanks full (90/110). you burn 3/4 of the center tanks to \u003C/p\u003E\u003Cp\u003Eget to orbit and not much of the outer tanks and easily enough left over to fly to the mun and back \u003C/p\u003E\u003Cp\u003Eand make a powered landing. \u003C/p\u003E\u003Cp\u003EIf you need more space Delta V you can load the forward center tank with oxidizer and fill the outer \u003C/p\u003E\u003Cp\u003Etanks this gives you 4700 Delta v over an HOUR of thrust more than enough to move between the \u003C/p\u003E\u003Cp\u003Emoons of Jool . \u003C/p\u003E\u003Cp\u003EHandling is easy, some slight instability issues when between 12, 000 and 25, 000 Meters but x3 \u003C/p\u003E\u003Cp\u003Ephysics while climbing is easily done. Turning is slow but not hard but its not a aerobatic flyer stick \u003C/p\u003E\u003Cp\u003Eto basic manuvering and you wont have too many problems. \u003C/p\u003E\u003Cp\u003EAs mentioned water landings are difficult you have to desend slowly and be careful of landing at too \u003C/p\u003E\u003Cp\u003Ehigh of angle as it will tear off the drill assembly ( if your lucky and the engines if your not). This is \u003C/p\u003E\u003Cp\u003Ewhy the landing gears are mounted so low, and the radial air intake mounted to the landing gear. One \u003C/p\u003E\u003Cp\u003Eside benefit from them is mounted in reverse the do make intake air but for zero drag.\u003C/p\u003E\u003Cp\u003E Once landed on water takeoff is easy nose up at 50m/s and air born by 70m/s. But for the simplest \u003C/p\u003E\u003Cp\u003Elandings use the chutes. Parachuts landings are the easiest way to land and the chutes are placed in \u003C/p\u003E\u003Cp\u003Eorder to make level landing easier. \u003C/p\u003E\u003Cp\u003EI also wanted a plane that wasnt tied to a mothership so i added the kethan parts to it, the kethan \u003C/p\u003E\u003Cp\u003Egenerator was a nice wieght saving addition, since it would take 3 to 4 Large solar arrays to power \u003C/p\u003E\u003Cp\u003Ethe processor and the drill and each XL solar array weighs 0.35 t , the Kethan power generator only \u003C/p\u003E\u003Cp\u003Ewieghs 0.3 t. \u003C/p\u003E\u003Cp\u003Eso what ya think. Ill try to post more pics once I figure out how to place them on the page but just check out my imgur picts\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-06-08T09:42:22Z","Content":"\n\u003Cp\u003EI think its \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/p6TtP\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHeh, first go! way I did it was to put {imgur}p6TtP{/imgur} (with square brackets instead of the ones I used there)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-08T09:46:03Z\u0022 title=\u002206/08/2014 09:46  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 8, 2014\u003C/time\u003E by Cmdr. Arn1e\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OgreMagi","CreatedById":103767,"CreatedDateTime":"2014-06-10T08:24:01Z","Content":"\n\u003Cp\u003Ethank for the info I will try that and for my next submission and that is right now since I have completed the main bus vehicle for the Jool mission \u003C/p\u003E\u003Cp\u003EI give you the Kerbal Atomic Ascension Bus zero zero Mod or the K.A.A.B 00 M and the Laythe Base lander \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/B5gpT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ETook a lot of work to balance out the ship and add what I wanted, seems like I went though a hundred variations until I got this one but it covers all the bases. I will launch it with mostly empty tanks ( probably 1/3 in the main orange tank) should make orbit...... Well I plan to try to keep the large SRB\u0027s to help with the boost for Jool but If I am short of orbit I can use them to boost myself up have to see how it goes........\u003C/p\u003E\u003Cp\u003EPlanned dockings \u003C/p\u003E\u003Cp\u003E2 Tylo capable landers one on each side using the triple docking clusters, the plan is to use the two Tylo landers to provide additional thrust when boosting/orbiting for Jool and they will detach when they arrive.\u003C/p\u003E\u003Cp\u003E2 Hermes A4 SSTO Sea planes for exploring Laythe and the Jool system. \u003C/p\u003E\u003Cp\u003Eand one Laythe Base lander to remain on Laythe \u003C/p\u003E\u003Cp\u003EOther features.... \u003C/p\u003E\u003Cp\u003ETHe KAAB 00 M has several mounted vehicles to help it accomplish it mission, \u003C/p\u003E\u003Cp\u003E1. The nose mounted ship, the Jool mini, will be used as a system explorer and a emergency return craft if we lose all other vehicles but if it is not needed for the return to Kerbin then the Jool mini will stay in system orbiting Val or Laythe.\u003C/p\u003E\u003Cp\u003E2. The 3 probe cluster on the left consists of 3 Jool impactor probes , 1 with a drogue chute, 1 with a standard chute and one with Wings. \u003C/p\u003E\u003Cp\u003E3. the 5 Probe cluster on the Right are heavy duty ComSats that will be deployed in system to monitor Jool and its moons and provide extra comms for the mission. \u003C/p\u003E\u003Cp\u003EMain Bus Mission \u003C/p\u003E\u003Cp\u003EOnce stripped of its docked craft the KAAB 00 M will be used as a mobile base with the landing craft to ferry samples and Fuel to it, While it should have enough thrust to land on Bop and Pol and perhaps even Val its primary mission is as a return vehicle to Kerbin. However is something is discovered, alien ruins , elvis ect ect then It can be landed to be used as a ground base . \u003C/p\u003E\u003Cp\u003ERational and shaky logic\u003C/p\u003E\u003Cp\u003EYea I know I built it waaaayy to big, the atomic engines are a mod , Kommet_Nucleonics , but I decided to use the smaller less efficient varients to perhaps get around the -100 point penality. \u003C/p\u003E\u003Cp\u003EThe main thrust comes from 2 clusters of Four FTmN 40 Nuclear rockets, stats are Isp 770 in vac, mass 1.52 so they arnt as efficient as a LVN rocket so maybe ....... Who knows I plan to try it again using standard rockets but I wanted to try this out first. \u003C/p\u003E\u003Cp\u003EOne thing was that all my craft have kethan mining/processing/storage equipment on them, part of it was simple redundancy. If I lose one craft I have others but another reason was a simple fix the the atmosphere requirments of the Kerbals. since we currently don\u0027t account for it I added the kethan processors as a combination processor/atmosphere scrubber. the extra weight of the kethan equipment I feel would simulate the mass of atmosphere processing equipment. \u003C/p\u003E\u003Cp\u003ELong post but I am taking my time to explain some of the reasons why I am building it this way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-10T08:58:57Z\u0022 title=\u002206/10/2014 08:58  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 10, 2014\u003C/time\u003E by OgreMagi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-06-10T14:35:52Z","Content":"\n\u003Cp\u003ELooking good Ogre. Keep us informed.\u003C/p\u003E\u003Cp\u003EI\u0027m also making progress. The decision to get 2 kerbals on each moon simultaneously has ended up meaning I\u0027m having to take 5 landers, each with a MK2 lander can (2.5t mass? seriously?). So everything has accordingly just got bigger and bigger. \u003C/p\u003E\u003Cp\u003EBut I got the mothership in LKO. Eventually. Ended up having to burn the nuke engines on the pad to use up about half the fuel, making the ship light enough for the 1st stage to get it to the point where the nuke engines were enough to circularise. Took a few goes but we got there in the end. But this is going to need a LOT of LKO refueling now....\u003C/p\u003E\u003Cp\u003EThe habitat/return module (crew capacity 12) will sit in the central atrium of the mothership. Then the Laythe, Pol, Bop \u0026amp; Val landers will sit on the sides, and the big Tylo lander will go on the front. All except the Laythe lander will have tugs attached. A few shoddy calculations have suggested the mothership should still have around \u0026gt;3000m/s dv when fully loaded, so we should be good for a one-way trip, with some aerobraking on arrival. Though TWR is gonna be low, so with whatever stupidly slow fps rate I get, burns are going to be painful. We\u0027ll see how bad it is when we get to that point.\u003C/p\u003E\u003Cp\u003EAnother thing I learned is that those big RCS thrusters guzzle monopropellant at an extraordinary rate. I need to keep my eye on that. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U55dx4Q.jpg\u0022 alt=\u0022U55dx4Q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jKWc7CT.jpg\u0022 alt=\u0022jKWc7CT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1MAqCl1.jpg\u0022 alt=\u00221MAqCl1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m reasonably confident that my landers should work. The Pol/Bop/Val landers are overkill, and should have no problems. Assuming jets are not too much less efficient in Laythe atmos I should have no problems getting off the surface. \u003C/p\u003E\u003Cp\u003EMy only real concern is the Tylo lander. I will have about 4.5km/s dv once the tug puts it in low Tylo orbit. Does this sound sufficient?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-10T17:19:59Z\u0022 title=\u002206/10/2014 05:19  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 10, 2014\u003C/time\u003E by Oafman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-10T21:44:59Z","Content":"\n\u003Cp\u003EHi Everybody, I\u0027m back from a long holiday and a hard working week, sorry for the long delay! I will check everything and answer or update the leaderboard now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-10T22:16:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technion\u0022 data-cite=\u0022technion\u0022\u003E\u003Cdiv\u003EI just completed my second run at this. Full report here.\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81046-Jool-5-mission\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/81046-Jool-5-mission\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI played with DRE which really increased the total mothership size.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Etechnion: Congratulations, you have finished the JOOL-5 mission on Level 3!\u003C/strong\u003E\u003C/span\u003E Yeah, it doesn\u0027t count as a Jebediah\u0027s level because you didn\u0027t bring a proper Science Package and a Lab neither, but it\u0027s okay for a Level 3 one. Nice one with the DRE and skipping the aerobraking phases!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETo be honest I wanted to disapprove this mission at first because you didn\u0027t have pictures about some landings on the ground. \u003C/strong\u003ERemember: no picture and it didn\u0027t happen! But I saw it is possible with the given ship so I accept it for now, but this is the last time.\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-10T22:51:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EOK, last landing, and the trip home. Basically, MISSION ACHIEVED! YAY!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice one, can you please collect all your pictures/information into one post?\u003C/p\u003E\u003Cp\u003EEDIT: I saw you made it later, thank you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-10T23:24:51Z\u0022 title=\u002206/10/2014 11:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 10, 2014\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-10T23:16:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EImages from my Level-1 Jool-5 mission using spaceplane as a plane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/YG4iW\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/YG4iW\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EKasuha: OMG, this was an absolutely epic mission! Congratulations, you have finished the JOOL-5 Challenge on Level 1 \u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EWITH A SPACEPLANE!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003Cstrong\u003E \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI really liked when the fuel tanks were dropped by using a sepratron. I also liked your way to get onto and back from the ground! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Running 300 m/s on the surface of Tylo is crazy, and nice job with the little engines to keep it just off the ground while accelerating into orbital speed (and avoid the mountains). And it looks like you used your last drops of fuel to get back to the spare fuels in orbit. Only one \u0022anomaly\u0022 found: when getting back into orbit from Vall your fuel is about 20% then later it jumps back about 60%. What happened there?\u003C/p\u003E\u003Cp\u003EThanks for sharing this mission, this was really something! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-11T00:04:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EI don\u0027t want to fill this thread up with a massive post so here\u0027s a link to a brief pic summary of my mission:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80441-Jool-5-Mission-report?p=1180760\u0026amp;viewfull=1#post1180760\u0022 rel=\u0022external nofollow\u0022\u003EJool-5 Summary\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EPatupi: Congratulations, you have finished the JOOL-5 Challenge on Level 3! \u003C/strong\u003E\u003C/span\u003EIf you wanted to go for Jebediah\u0027s Level then you should have landed all the Science Package back at Kerbin. You can still do that, I guess... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYour ship is really huge, and to put your whole ship into low Tylo orbit was a huge waste on fuel, this is not too elegant in space where every gramm counts! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E So I was sure that you will need a refuel mission. The refuel mission was well done. The Tylo and Laythe rescue missions also shows that this mission would have needed some more plan at the beginning, but I don\u0027t say anything else because at my first mission I had a rescue docking above Laythe too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (it was nerve racking)... There were some funny comments under the pictures! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo you want me to wait for the Jebediah\u0027s Level pictures or is it good for Level 3?\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-11T00:21:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stratzenblitz75\u0022 data-cite=\u0022Stratzenblitz75\u0022\u003E\u003Cdiv\u003EHello, I\u0027d like to enter my Kerbol system grand tour for this challenge: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81429-Sigma-Mission-Kerbol-System-Grand-Tour%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/81429-Sigma-Mission-Kerbol-System-Grand-Tour%21\u003C/a\u003E\u003Cp\u003EGame version is 0.23.5\u003C/p\u003E\u003Cp\u003EIt was done in sandbox in one launch and with no refueling.\u003C/p\u003E\u003Cp\u003ENo additional equipment was carried along, just Jeb and his flags.\u003C/p\u003E\u003Cp\u003EOnly 1 mod was used: Kerbal engineer, otherwise it is completely stock.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EStratzenblitz75: Congratulations, you have finished the JOOL-5 Challenge on Level 1 with an \u0022additional\u0022 Grand Tour!\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI guess you just posted this mission here as it meets all the criteria for the JOOL-5 Challenge too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Epic minimalistic mission and awesome mission planning. I really liked your Eve lander. Nice job, thank you for sharing it here too! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-06-11T01:50:46Z","Content":"\n\u003Cp\u003EThank you for the kind words! Your Jool-5 challenge is what inspired me to even do a grand tour in the first place so to have you recognize my mission means a lot to me. \u003C/p\u003E\u003Cp\u003EThat being said, the Sigma Mission will not be my last entry to this challenge. I am currently working on another grand tour but this time I will gather science along the way. When its finished, I hope to enter it as a Jebediah\u0027s level entry. If anyone\u0027s interested, you can read about it \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82724-The-Outer-Wilds-Mission-Jool-5-Challenge%28Jebediah-s-Level%29-Grand-Tour%21%28WIP%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-06-13T20:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EPatupi: Congratulations, you have finished the JOOL-5 Challenge on Level 3! \u003C/strong\u003E\u003C/span\u003EIf you wanted to go for Jebediah\u0027s Level then you should have landed all the Science Package back at Kerbin. You can still do that, I guess... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EYour ship is really huge, and to put your whole ship into low Tylo orbit was a huge waste on fuel, this is not too elegant in space where every gramm counts! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E So I was sure that you will need a refuel mission. The refuel mission was well done. The Tylo and Laythe rescue missions also shows that this mission would have needed some more plan at the beginning, but I don\u0027t say anything else because at my first mission I had a rescue docking above Laythe too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (it was nerve racking)... There were some funny comments under the pictures! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo you want me to wait for the Jebediah\u0027s Level pictures or is it good for Level 3?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I still have the save, so yes I can drop those science pods... that are now empty since I stripped the since out of \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E... back to Kerbin. As to mission efficiency... Yeah, not really efficient at all. I originally planned for it to be a totally reusable, with one lander for everything. Well, one out of two isn\u0027t bad \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But I really should have added some light landers for the smaller moons. Taking that beast of a lander down to everything was just silly. But it was a challenge, and I did manage to do it with only one refuel from Kerbin. Which is something I guess.\u003C/p\u003E\u003Cp\u003EI did plan out the whole thing, including the landing dV... but I didn\u0027t \u003Cem\u003Etest\u003C/em\u003E them out. Going by the pure maths they work just fine, and for Tylo was on the bare minimum of what was required to do it. Laythe was just my own stupid fault. I could have done that easily, but I reduced the fuel in the lander to save on gas. Dumb move! The reason Tylo was so hard was I think down to my skill with a lander not being quite as good as I thought.\u003C/p\u003E\u003Cp\u003EAnyway, thanks for the note, and yes I\u0027ll do some quick shots showing the science pods coming down. Do you need shots of all six pods? I have science from the five landings and a teeny bit from Jool orbit. Science also could have been done better, and also I should probably have done two versions of the pods. One for atmosphere and one for vacuum moons. *shrugs*\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-13T20:09:21Z\u0022 title=\u002206/13/2014 08:09  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 13, 2014\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-06-13T21:33:57Z","Content":"\n\u003Cp\u003EOK, I did the science pod recovery. Was going to just do a couple to show things until I got an answer from you Ziv, but then had an interesting affair with the first pod... I forgot to repack the chutes on that one pod where they were used!... and the pod bounced on touchdown at over 180m/s. After that I thought I\u0027d better land them all anyway, just to be sure.\u003C/p\u003E\u003Cp\u003EHere\u0027s the report: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80441-Jool-5-Mission-report?p=1212123\u0026amp;viewfull=1#post1212123\u0022 rel=\u0022external nofollow\u0022\u003ELast mission report\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-14T13:08:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EWell, I still have the save, so yes I can drop those science pods... [...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EPatupi: Congratulations, you have finished the JOOL-5 mission on Jebediah\u0027s Level!\u003C/strong\u003E\u003C/span\u003E \u003C/p\u003E\u003Cp\u003EYeah, the unpacked chutes shows why I want the mission to be done from alpha to omega... because in reality space exploration depends on both perfect planning and perfect mission executing.\u003C/p\u003E\u003Cp\u003EOne thing you forget and your mission is ruined! I know it is easy with hyperedit and F5/F9 but that steals the real joy and excitement of space exploration!\u003C/p\u003E\u003Cp\u003EIt may have sounded bad that you should finish the mission by the rules but it necessary to gain the Jebediah\u0027s Level Hall of Fame place. Yes, it is definitely something to make a JOOL-5 mission, but it became much more easier with the lot of sample missions, with the science transfer and with the new, huge and strong rocket part. And I want to maintain the original level of difficulty so the Science Stuff has to come back to the surface in the scientific equipment or in a lab...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T13:15:46Z\u0022 title=\u002206/14/2014 01:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-06-14T18:13:57Z","Content":"\n\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003Ebecause of the growing number of sample missions in the Hall of Fame, and the science collection have got easier (0.23) and because of the big rocket parts and the stronger ion in 0.23.5 \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#cc0000;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EI\u0027m considering to ban refueling missions for the 1-2-3-Jeb levels. Missions with refueling would go to the Mixed Solutions category. What do you think guys?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T18:16:35Z\u0022 title=\u002206/14/2014 06:16  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-06-14T18:48:11Z","Content":"\n\u003Cp\u003EI have no idea in which level this would go, but I just uploaded the first of what is proving to be at least a dozen (or two!) episodes of Joolpollo, which just so happens to be a Jool 5 mission. My goal is to - along with getting tons of science - return a capsule from being landed on all 5 moons and another from being in orbit around all 5 moons, and then 2 more from orbiting Jool and flying at Jool. Also I\u0027m hoping it\u0027ll all be one self-contained mission with no refueling and nothing that wasn\u0027t launched on the original (400\u002B part) ship. Not sure I\u0027ll make it but it\u0027s looking hopeful!\u003C/p\u003E\u003Cp\u003ESo far in this video, I got the ship lifted off Kerbin and to Jool, and I\u0027m prepping my first excursion, into Jool\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/p7Pc4j7KJZA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-06-15T12:37:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003Ebecause of the growing number of sample missions in the Hall of Fame, and the science collection have got easier (0.23) and because of the big rocket parts and the stronger ion in 0.23.5 \u003Cp\u003E\u003Cspan style=\u0022color:#cc0000;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EI\u0027m considering to ban refueling missions for the 1-2-3-Jeb levels. Missions with refueling would go to the Mixed Solutions category. What do you think guys?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E But... the hardest part of my mission so far has been trying to design a fuel tanker that will take enough fuel to complete the mission... so far this has taken me longer than the initial planning and execution to get the mothership to Jool in the first place! Okay, maybe my own fault for \u003Cem\u003Enot\u003C/em\u003E looking at any of the sample missions, and for using reasonably big, powerful and above all inefficient engines on my mothership...\u003C/p\u003E\u003Cp\u003EPlease, feel free to check out the mission so far, I just updated to include current status...\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-15T19:41:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003E.\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003Ebecause of the growing number of sample missions in the Hall of Fame, and the science collection have got easier (0.23) and because of the big rocket parts and the stronger ion in 0.23.5 \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#cc0000;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EI\u0027m considering to ban refueling missions for the 1-2-3-Jeb levels. Missions with refueling would go to the Mixed Solutions category. What do you think guys?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason why I value this challenge so high is that it is relatively forgiving to failures and does not come (at least in original categories) with ordering entries by some kind of points. You get an epic task, you\u0027re allowed multiple launches and all that matters is that you finish the task. Whatever way you do it, it takes a lot of effort. Each refueling or repair mission is even more effort, you get to design another ship and perform transfer, rendezvous and all necessary actions depending on the nature of the mission, all on top of the original program. So I believe it is a punishment on its own and there is no need to punish participants further by moving them to another category. \u003C/p\u003E\u003Cp\u003EI agree it got easier with 0.23 science collection and with 0.23.5 rocket parts and tweaks. That\u0027s why I think entries could be separated to groups by release in which they were done. Something similar to how the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/11214-The-K-Prize-100-reusable-spaceplane-to-orbit-and-back\u0022 rel=\u0022external nofollow\u0022\u003EK-prize\u003C/a\u003E used to do it.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-06-15T21:22:05Z","Content":"\n\u003Cp\u003EQuick query Ziv. I\u0027m considering doing another attempt at this with an Ion drive as the main ship, but the prototype I have up as over 380parts and is slugging my machine down a lot, and that\u0027s without the launch booster! I\u0027m assuming a modded fuel tank to hold Xenon rather than tons of the tiny Xenon tanks is OK as long as the proportions of the fuel is right relative to stock? If so I\u0027ll either mod an existing stock tank to hold Xenon or pinch a fuel tank from another mod that does Ion engines (as long as the proportions of fuel to mass are the same as stock).\u003C/p\u003E\u003Cp\u003E(EDIT: Looking at the Near Future Technologies Mod right now, maybe just getting a slightly larger Ion engine and a large Xenon fuel tank to cut back on parts... Further EDIT: Looks like NFT is close, but exactly stockalike. I remember another ion stockalike pack somewhere. Gonna search that up.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-15T23:42:42Z\u0022 title=\u002206/15/2014 11:42  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 15, 2014\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}