{"TopicId":52251,"ForumId":25,"TopicTitle":"(OLD) The Ultimate Jool-5 Challenge:land Kerbals on all moons and return in one big mission","CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-07T16:59:28Z","PageNum":2,"Articles":[{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-11T13:53:41Z","Content":"\n\u003Cp\u003Ettnarg: unbelievable! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E When I think I\u0027m close to the physically possible biggest launch rocket there\u0027s always somebody with a bigger design!\u003C/p\u003E\u003Cp\u003ENice Job and Good Luck, I\u0027m curious how this design will work, keep us informed!\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-11-11T13:57:25Z","Content":"\n\u003Cp\u003EAlmost done this in 0.22 \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/NIqh6fC\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/NIqh6fC.png\u0022 alt=\u0022NIqh6fC.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis ship has three landers, two with just an seat for kerbal but return the material lab, goo and other science stuff for Laythe and Tylo. \u003C/p\u003E\u003Cp\u003ETylo lander on the top, laythe lander hidden on the back. on front the reusable lander with an drop tank for Vall, the reusable lander returned from Vall refueled and docked with another science module for Pol and Bop. \u003C/p\u003E\u003Cp\u003EMission was not totally successful as the Laythe lander and the Jool atmospheric probe engines was stuck in the junior docking port and did not separate. \u003C/p\u003E\u003Cp\u003EI was able to drop the science module from the laythe lander into Laythes ocean as an probe, returning both atmospheric and in ocean messurments and the Laythe rover worked as an probe until it was used by the followup mission.\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-11T19:14:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ELead Engineer and Space Program Director to the press and the public:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003ELadies and Gentlemen, let me introduce you our Kerbonauts for the exorbitant JOOL-5 Grand Tour Mission: Bill, Bob, Jack, James ...and the mission commander, Jebediah! In the background, you can see the main Lander body with the Laythe lift-off Jet Engines attached!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.ziv.hu/ksp/screenshot1172.png\u0022 alt=\u0022screenshot1172.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChattering in the crowd at the back:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- What did you say, what are the odds at the bookmaker?\u003C/p\u003E\u003Cp\u003E- they pay 100/99 for an unsuccessful mission.\u003C/p\u003E\u003Cp\u003E- Oh! And for a successful mission?\u003C/p\u003E\u003Cp\u003E- Hmm! Nobody asked that before...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-11T19:16:35Z\u0022 title=\u002211/11/2013 07:16  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 11, 2013\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gm537","CreatedById":66746,"CreatedDateTime":"2013-11-11T23:11:42Z","Content":"\n\u003Cp\u003EWell looks like I have chosen the \u0022unnesseccarily hard\u0022 method. Using the external seats saves a bunch of weight and makes the whole ship a lot smaller but no... I decided to try and land a Mk2 Landercan on every moon. Well I guess I shall see if it\u0027s doable! I have almost finished construction of my craft just need the engines and probably some more fuel. Does any one know how much dV is needed to navigate the whole system? (Including the transfers to and from Kerbin) \u003C/p\u003E\u003Cp\u003EMy current craft:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ChMb157.png\u0022 alt=\u0022ChMb157.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother album showing some of the intermediate steps and a bunch of failed launches trying to get that fuel pack into orbit.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/QIgPw#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/QIgPw#0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEveryone\u0027s designs are looking pretty awesome!\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-12T02:42:22Z","Content":"\n\u003Cp\u003EI have put together my ship at last (it was 3 launches: the fuel\u002Bengines, the Main Body and the Lander parts). Everything fits perfectly but my computer became so slow that I will give it a shot to Jool/Laythe and if doesn\u0027t get better if I undock for a landing then I have to restart with a minimalistic (less science?) design...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.ziv.hu/ksp/screenshot1233.png\u0022 alt=\u0022screenshot1233.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Space Viking","CreatedById":92569,"CreatedDateTime":"2013-11-12T07:01:54Z","Content":"\n\u003Cp\u003EAs I was yet to do my first Jool mission, I decided to give this challenge a shot on Jebediah\u0027s level. Unfortunately, it was a failure (but I hope it\u0027s still alright to share) due to the lander for Tylo wasn\u0027t powerful enough and had to instead be downgraded into a flyby. It took 2 launches to get all the hardware into orbit (CSM and the landers). I also launched a fuel station to Jool.\u003C/p\u003E\u003Cp\u003EI\u0027m running vanilla KSP, so no mods here. I\u0027d also want to inform you don\u0027t actually need a separate pod for each taken surface sample. As long as the samples wasn\u0027t taken from the same biome, there is no limits on how much you can store (just like how EVA reports work).\u003C/p\u003E\u003Cp\u003ESo in order to achieve a scientific return mission on every moon of Jool, it was apparent each lander module would ideally require a detachable science module that could easily be brought to the CSM by some sort of vehicle. The backbone to this solution was a light and highly maneuverable spacecraft that could not only enable a kerbinaut to operate the lander modules, but also ferry their scientific hardware to the CSM. I guess it can be called a Multi-purpose Module?\u003C/p\u003E\u003Cp\u003EThe setup consists of:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECommand/Service Module\u003C/strong\u003E (Main propulsion and housing for the kerbinauts)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMulti-purpose Module\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2 Light Landing Modules\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2 Heavy Landing Modules\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1 Specialized Spaceplane\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe lander modules are your typical no-atmosphere divers. The light landers are designed for the smaller moons Bop and Pol, while the heavy ones are intended for landing on the larger moons Vall and Tylo. All of them houses an extractable science module that can be separately brought to the CSM by the Multi-purpose Module.\u003C/p\u003E\u003Cp\u003EThe spaceplane is designed to take advantage of Laythe\u0027s oxygenated atmosphere. It\u0027s not intended to dock with the Multi-Purpose Module since the craft can be controlled through its cockpit. During ascent it detaches its wings and then operates as a regular spacecraft capable of independently taking its scientific payload to the CSM.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/MOKP9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2013-11-12T13:29:59Z","Content":"\n\u003Cp\u003EI tweeked my craft. Mostly change the size of some of the docking ports. To make most of them use the tiny size so they all fit together and give me some more options once I get to Jool. Added more space take so the weeker ports hold together during take off and added remote guidance to all of the landers.\u003C/p\u003E\u003Cp\u003EI only had time to do Laythe so far but I\u0027m happy with it. The mission is going well.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ug03A\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-12T14:06:49Z","Content":"\n\u003Cp\u003EOh, so only one Capsule is enough for all the samples from all the moons? And one Kerbal\u0027s EVA for all?? Sure?\u003C/p\u003E\n"},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2013-11-12T14:22:18Z","Content":"\n\u003Cp\u003EI think so. But thats not the point of the lhallenge. At level 3 (which I\u0027m doing) the challenge is one kerbal per moon. I\u0027m not doing this for the sciance I\u0027m doing it for the flags. normly I take jeb alone in a small command pod. This challange makes it more intressing.\u003C/p\u003E\u003Cp\u003E(I\u0027m playing in sandbox mode)\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-12T15:42:18Z","Content":"\n\u003Cp\u003EI see. I will do an experiment mission to Mun/Minmus to see if different samples can be stored in the same pod. I play in Career mode now and I\u0027m curious how much science points can I collect with a huge mission like this... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut this Challenge is pretty hard even with only one Kerbal landing and returning from all the moons... so everybody is a winner who can achieve that!\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-13T00:43:19Z","Content":"\n\u003Cp\u003ESpace Viking: I really like as you put the lander on each other, and the design looks nice. But why do you use so much panel and struts? Just for design? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E And it\u0027s awesome how you landed on the engine of the ascent stage at Vall! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Nice job! And I love the little engines\u002Bfuel tanks on the sides of the Mk1... yeah, Tylo is the hardest part of this mission! Will you try again with an updated design?\u003C/p\u003E\u003Cp\u003EHm, I see you dropped the Mk1 cans... did you receive points for the samples this way too?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-13T00:59:38Z\u0022 title=\u002211/13/2013 12:59  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 13, 2013\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-13T02:40:24Z","Content":"\n\u003Cp\u003EI checked, one command pod is enough for any number of surface samples and EVA reports. But the scientific stuff can hold only one experiment. Anyway, I\u0027m going to recall the crew from orbit because the ship became too complex. I need a better optimized ship! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-13T02:53:01Z","Content":"\n\u003Cp\u003EThis is just an update I am still putting together my ship. Only one more launch to go but with the long launch and part lag I can only do one launch and dock sequence a day. Will probably be friday before I get to the jool system. In any case. I have moved my album to here and updated the pics. I will migrate my album as I update pics and mission updates.\u003C/p\u003E\u003Cp\u003EI think you will find i have the largest main engines to date.\u003C/p\u003E\u003Cp\u003EMain engines launch mass of over 3500 T and docked mass of over 500 T\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T01:18:04Z\u0022 title=\u002211/15/2013 01:18  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2013-11-13T10:36:19Z","Content":"\n\u003Cp\u003EMcirish3 thats a nice fuel tank booster. Is that lifting 10 full tanks? Mine can just about do that but I normly just do 7. Your craft looks wider then mine I can only build my craft 5 large tanks across before I cann\u0027t get camera angles to place stuff so I have to build tall. how did you build that?\u003C/p\u003E\u003Cp\u003EMy craft in orbit is 384 tons and I use 18 nukes to move it to jool with that I had an 18 min burn time which is a bit longer then I liked but did it in 2 orbits. First burn was 4 mins (2 mins before and after the node) second was started 2 mins before the node and put me on an escape path before my 4 mins limit was up so I keep burning.\u003C/p\u003E\u003Cp\u003EI would love to know the staging setup of your launch vehicles. Mine is:\u003C/p\u003E\u003Cp\u003Elower stage: 18 Mainsails each feed with 2 red tanks. (\u002B 12 solids but they dont do much)\u003C/p\u003E\u003Cp\u003Emid stage: 18 Mainsails each with 1 red tank cross feed and drop in groups of 6.\u003C/p\u003E\u003Cp\u003EUpper stage: single nuke with a small tank used to make finle orbit after the last 6 mainsails are drop just before orbit to stop debry. it has a remote guidance unit so it can deorbit it\u0027s self.\u003C/p\u003E\u003Cp\u003EI\u0027m surpizzed you rocket can hold it self up on the pad. I found if you add Rockomax Brand Decoupler to your mainsails you can attach a Launch Stability Enhancer to the bottom. So you can support your inner cores.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-13T11:15:01Z","Content":"\n\u003Cp\u003EWell technically it is 12 since two of the tanks with the mainsail are still full. I also have 5, mostly full large, mono propellant tanks on the main engine as well.\u003C/p\u003E\u003Cp\u003EI used lots of struts, and then I had to put lauch stabilizer on the inner fuel tanks if you look carefully at the pic of it on the launch pad you can just make out the bottom of them.\u003C/p\u003E\u003Cp\u003EOther than that asparagus, asparagus, asparagus. I used asparagus staging from beginning to end. I had to limit throttle to 85% while the outer layer burns off or one of my fuel lines would always break but other than that it works great. I have used this main engine for both a Moho and an Eeloo mission.\u003C/p\u003E\u003Cp\u003EI will try and get into more detail tonight on this but I have to head off to work now.\u003C/p\u003E\n"},{"CreatedByName":"Space Viking","CreatedById":92569,"CreatedDateTime":"2013-11-14T00:31:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003EI see. I will do an experiment mission to Mun/Minmus to see if different samples can be stored in the same pod. I play in Career mode now and I\u0027m curious how much science points can I collect with a huge mission like this... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EBut this Challenge is pretty hard even with only one Kerbal landing and returning from all the moons... so everybody is a winner who can achieve that!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! One thing I forgot to mention was the mission consisted of five kerbinauts, so there was always a different kerbinaut for each moon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E The ship with all its modules was also pretty laggy, so the first part of the mission was pretty time consuming and involved me doing other things while the CSM\u0027s single nuclear engine was doing all the work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe panels and and some struts are kind of a result of my passion for aesthetics, but I also wanted to make sure there was no wobble and that the landers would hold together incase of a rough landing. The panels themselves are also working slightly like extra shock absorbers for the landing struts. The funny thing is the heavy lander would have worked perfectly for Vall if it wasn\u0027t for I had to use it independently to get there from Laythe\u0027s orbit (since I was trying to save fuel for the CSM). The light lander modules was actually a modified model of a Mun lander, so they where proven quite overpowered for their respective landing missions on Pol and Bop.\u003C/p\u003E\u003Cp\u003EI might try this challenge again sometime in the future, but I\u0027m not sure when. With the gained experience things should be much easier on my next try. I will need to design a super-heavy landing system for Tylo. The light landing modules can be modified to be even lighter (especially the one for Pol). The Laythe spaceplane can probably be redesigned to be much lighter and also feature a safer VTOL landing system. It should probably also discard the cockpit when the science module has been delivered, since it\u0027s really just dead weight (even though it helps providing torque to the spacecraft). The Interplanetary CSM was also not intended for a mission of this scale, but since it was already in Kerbin orbit at the mission start, I decided to use it anyway. Next time I will design it with twice the fuel capacity (so no refueling will be required) and some sort of magazine for the science modules.\u003C/p\u003E\u003Cp\u003EI did indeed discard the MkI can, which was actually an overlook on my part. It wasn\u0027t until later I thought about the surface samples, but for some reason I still got the science scores involving the surface examinations anyway. I\u0027m not sure how this happened, but maybe the samples automatically get transferred to the currently crewed capsule (I.E. the command capsule) when the Mk1 can was undocked? It would make sense since the historical moon lander was also discarded after it had served its purpose.\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-14T02:58:44Z","Content":"\n\u003Cp\u003ESpace Viking, thank you for the details and Congratulation, you have done a JOOL-4 mission already! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHm, maybe the surface samples goes with the Kerbal who collected them and this way a lander can have only a seat and that\u0027s all. This stuff needs some more experiment (does anybody knows the answer?).\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-14T03:55:08Z","Content":"\n\u003Cp\u003EAs promised here are some extra stats on my ship. Last piece is in orbit but did not have time to dock tonight so no pics yet.\u003C/p\u003E\u003Cp\u003ECrew capacity 8.\u003C/p\u003E\u003Cp\u003ELaunches 6.\u003C/p\u003E\u003Cp\u003EBelow are the launch stats.\u003C/p\u003E\u003Cp\u003E[table=width: 500]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Ship Part[/td]\u003C/p\u003E\u003Cp\u003E [td]Parts[/td]\u003C/p\u003E\u003Cp\u003E [td]Stages[/td]\u003C/p\u003E\u003Cp\u003E [td]Mass (T)[/td]\u003C/p\u003E\u003Cp\u003E [td]Electric Charge [C][/td]\u003C/p\u003E\u003Cp\u003E [td]Liquid Fuel (L)[/td]\u003C/p\u003E\u003Cp\u003E [td]Oxidizer (L)[/td]\u003C/p\u003E\u003Cp\u003E [td]Solid Fuel (dm)^3[/td]\u003C/p\u003E\u003Cp\u003E [td]Mono Propellant (L)[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Main Engin X2[/td]\u003C/p\u003E\u003Cp\u003E [td] 2706[/td]\u003C/p\u003E\u003Cp\u003E [td]44[/td]\u003C/p\u003E\u003Cp\u003E [td]7496.56[/td]\u003C/p\u003E\u003Cp\u003E [td]3280[/td]\u003C/p\u003E\u003Cp\u003E [td] 550800[/td]\u003C/p\u003E\u003Cp\u003E [td]673200[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]7500[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Medium Lander X2[/td]\u003C/p\u003E\u003Cp\u003E [td]690[/td]\u003C/p\u003E\u003Cp\u003E [td]12[/td]\u003C/p\u003E\u003Cp\u003E [td]1133.16[/td]\u003C/p\u003E\u003Cp\u003E [td]8206[/td]\u003C/p\u003E\u003Cp\u003E [td]77040[/td]\u003C/p\u003E\u003Cp\u003E [td]94160[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]600[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Heavy Lander[/td]\u003C/p\u003E\u003Cp\u003E [td]483[/td]\u003C/p\u003E\u003Cp\u003E [td]10[/td]\u003C/p\u003E\u003Cp\u003E [td]748.26[/td]\u003C/p\u003E\u003Cp\u003E [td]904[/td]\u003C/p\u003E\u003Cp\u003E [td]42120[/td]\u003C/p\u003E\u003Cp\u003E [td]51480[/td]\u003C/p\u003E\u003Cp\u003E [td]13600[/td]\u003C/p\u003E\u003Cp\u003E [td]600[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Main Hub[/td]\u003C/p\u003E\u003Cp\u003E [td]505[/td]\u003C/p\u003E\u003Cp\u003E [td]13[/td]\u003C/p\u003E\u003Cp\u003E [td]668.77[/td]\u003C/p\u003E\u003Cp\u003E [td]4333[/td]\u003C/p\u003E\u003Cp\u003E [td] 39420[/td]\u003C/p\u003E\u003Cp\u003E [td]48180[/td]\u003C/p\u003E\u003Cp\u003E [td]4650[/td]\u003C/p\u003E\u003Cp\u003E [td]900[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Total[/td]\u003C/p\u003E\u003Cp\u003E [td]4384[/td]\u003C/p\u003E\u003Cp\u003E [td]79[/td]\u003C/p\u003E\u003Cp\u003E [td]10046.75[/td]\u003C/p\u003E\u003Cp\u003E [td]16723[/td]\u003C/p\u003E\u003Cp\u003E [td]709380[/td]\u003C/p\u003E\u003Cp\u003E [td]867020[/td]\u003C/p\u003E\u003Cp\u003E [td]18250[/td]\u003C/p\u003E\u003Cp\u003E [td] 9600[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-14T04:18:14Z\u0022 title=\u002211/14/2013 04:18  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 14, 2013\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-14T17:13:07Z","Content":"\n\u003Cp\u003EWow mcirish3, 4384 parts??? you\u0027re crazy! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Show us pictures!! How much lag do you have?\u003C/p\u003E\u003Cp\u003EI have decided to redesign my whole ship to a more simple one because I want it to run on (about) normal speed... I throw out most of the science units: only one of everything (and two Goo for symmetry), only for surface examinations. And I even don\u0027t use RCS for the Landers but four Rockomax Mark 55 radial engine. These gives me enough torque, and much more less part count. But I use a Moon-orbit Module with RCS\u002Batomrockets to separate the lander from the Mothership, bring it to orbit around the moon and after landing and coming back to re-dock to the lander and bring it back to the mothership... I\u0027ll show you pictures soon!\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-14T18:06:53Z","Content":"\n\u003Cp\u003ESo, I have gone to Jool, and made my first landing on Laythe. Experiences:\u003C/p\u003E\u003Cp\u003E1, I put my Mothership into a parking orbit between Laythe and Vall, and used a Moon-orbit Module to bring the Landing Module down to orbit and back to the Mothership.\u003C/p\u003E\u003Cp\u003EChanging orbit for Laythe intercept is about 300m/s, braking to orbit and getting back to the Mothership is 2 x 500m/s, landing is very cheap (parachutes), getting back works with jets and after 7100m with rockets, but you need a bigger rocket this way too. About \u002B1500-2000m/s back to orbit! And it\u0027s better to go straight up with the Jets because the atmosphere will brake you back soon under ~10000 m.\u003C/p\u003E\u003Cp\u003EMy rocket fuel was not enough for orbit so I almost gave up the mission here. The most what I was able to achieve is a long falling-back path with apoapsis at around 56\u0027000m. But after a lot of reloading and learning the right timing, I brought my Moon-orbital Module into a 50\u0027000 m (falling-down) path, I quickly catch the Lander Module and went back into orbit... it was VERY, VERY HARD! Took me a lot of time to save Jebediah and the mission!\u003C/p\u003E\u003Cp\u003E2, the Jet engines was a good idea, they gave me \u002B330 m/s until 7100m. But you need to cut them and separate before that or they will spin you at 7300m\u002B! And before launch you have to assign the Jet engines and the main rocket engines to Action Groups and so you can turn on/off them quickly and at the same time.\u003C/p\u003E\u003Cp\u003E3, The Moon-orbit Module is very useful and uses Nuclear Engines and an ASAS what gives it a lot of torque, so RCS can be held for dockings only. This way you don\u0027t have to move the whole Mothership to orbit and back to other moons and can save you a lot of fuel/weight.\u003C/p\u003E\u003Cp\u003E4, Changing the Mothership layout with the little Space Tug is big fun because this main ship doesn\u0027t have so much parts (about 300-350) and there\u0027s no lag! But docking with huge orange tanks is a slow and painful thing. I realized that I prefer smaller ships and parts...\u003C/p\u003E\u003Cp\u003EHere are the pictures: (To embed the imgur album, simply grab the ID of it, the following bold text - imgur.com/a/\u003Cstrong\u003EZCaAu\u003C/strong\u003E, and put them between an imgur tag, like this [ imgur ] ZCaAu [ /imgur ] but without the spaces!)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ZCaAu\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-14T18:38:40Z\u0022 title=\u002211/14/2013 06:38  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 14, 2013\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-14T20:40:12Z","Content":"\n\u003Cp\u003EI have made a scale picture about the SOI of the main moons, because I wanted to see which orbit is safe for the Mothership.... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.ziv.hu/ksp/Jool_system_SOI.jpg\u0022 alt=\u0022Jool_system_SOI.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-14T23:04:12Z","Content":"\n\u003Cp\u003EI am about to the start the docking sequence so hopefully will have pics later tonight.\u003C/p\u003E\u003Cp\u003EAs for the part count I think you misinterpreted it. Those are \u003Cstrong\u003ELaunch\u003C/strong\u003E numbers not \u003Cstrong\u003EOrbital\u003C/strong\u003E numbers. Those I will share with the pics. So NO I do not have a 4384 part ship in orbit. My PC could not handle that many parts. Lag is very bad as it is. But still functional (I think). Will have to see after I get the last part docked.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-15T01:24:05Z","Content":"\n\u003Cp\u003EINtroducing the Titus:\u003C/p\u003E\u003Cp\u003EStats\u003C/p\u003E\u003Cp\u003E[table=width: 800, class: grid, align: center]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td][/td]\u003C/p\u003E\u003Cp\u003E [td]Parts[/td]\u003C/p\u003E\u003Cp\u003E [td]Mass (T)[/td]\u003C/p\u003E\u003Cp\u003E [td]Liquid Fuel (L)[/td]\u003C/p\u003E\u003Cp\u003E [td]Oxidizer (L)[/td]\u003C/p\u003E\u003Cp\u003E [td]Solid Fuel (dm)^3[/td]\u003C/p\u003E\u003Cp\u003E [td]Mono Propellant (L)[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Launch Totals[/td]\u003C/p\u003E\u003Cp\u003E [td]4384[/td]\u003C/p\u003E\u003Cp\u003E [td]10046.75[/td]\u003C/p\u003E\u003Cp\u003E [td]709380[/td]\u003C/p\u003E\u003Cp\u003E [td]867020[/td]\u003C/p\u003E\u003Cp\u003E [td]18250[/td]\u003C/p\u003E\u003Cp\u003E [td]9600[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Kerbin Orbital Totals[/td]\u003C/p\u003E\u003Cp\u003E [td]1211[/td]\u003C/p\u003E\u003Cp\u003E [td]1202.58[/td]\u003C/p\u003E\u003Cp\u003E [td]79171[/td]\u003C/p\u003E\u003Cp\u003E [td]96765[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]6238[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]% Lost During Launch[/td]\u003C/p\u003E\u003Cp\u003E [td]72.38%[/td]\u003C/p\u003E\u003Cp\u003E [td]88.03%[/td]\u003C/p\u003E\u003Cp\u003E [td]88.84%[/td]\u003C/p\u003E\u003Cp\u003E [td]88.84%[/td]\u003C/p\u003E\u003Cp\u003E [td]100.00%[/td]\u003C/p\u003E\u003Cp\u003E [td]35.02%[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T23:21:42Z\u0022 title=\u002212/04/2013 11:21  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-15T02:30:39Z","Content":"\n\u003Cp\u003EOh, I see. Yeah, my PC start to lag at about 600\u002B parts... how do you check the part numbers during the flight?\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-15T04:14:50Z","Content":"\n\u003Cp\u003EThe little button with an \u0027i\u0027 on it in the map screen give status, mass of craft and parts.\u003C/p\u003E\n"}]}