{"TopicId":52254,"ForumId":36,"TopicTitle":"Command pod orientation inverts upon reload","CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-11-07T17:26:32Z","PageNum":1,"Articles":[{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-11-07T17:26:32Z","Content":"\n\u003Cp\u003EI\u0027ve been having a weird glitch with my command pods for a while and I guess it\u0027s time to confront it.\u003C/p\u003E\u003Cp\u003ESo, when I reload a craft, either by Revert-to-Launch or F9 quickload but not by Return-to-VAB/SPH, the command pod is pointing backwards. Here\u0027s an example\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DcN82Ok.jpg\u0022 alt=\u0022DcN82Ok.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe mesh doesn\u0027t move, the pod is still oriented level, but now it\u0027s heading 270 instead of 90\u003C/p\u003E\u003Cp\u003Ewhat gives?\u003C/p\u003E\u003Cp\u003Emu: \u003Ca href=\u0022https://github.com/Greys0/HexCans/blob/master/GameData/HexCans/Models/HexPod.mu\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Greys0/HexCans/blob/master/GameData/HexCans/Models/HexPod.mu\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ecfg: \u003Ca href=\u0022https://github.com/Greys0/HexCans/blob/master/GameData/HexCans/Parts/HexPod/Normal.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Greys0/HexCans/blob/master/GameData/HexCans/Parts/HexPod/Normal.cfg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnity: \u003Ca href=\u0022https://github.com/Greys0/HexCans/tree/master/Model%20Basefiles/Unity\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Greys0/HexCans/tree/master/Model%20Basefiles/Unity\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Enotes:\u003C/p\u003E\u003Cp\u003EDoes not invert repeatedly if reverted multiple times, settles at 270\u003C/p\u003E\u003Cp\u003EDoes not fix if Control-From-Here is used\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T18:06:47Z\u0022 title=\u002211/07/2013 06:06  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by Greys\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-07T17:37:38Z","Content":"\n\u003Cp\u003EUm WHAT!?!\u003C/p\u003E\u003Cp\u003EI\u0027m gonna guess its safe to assume nothing out of ordinary in debug/dump log?\u003C/p\u003E\u003Cp\u003EI have had issues with parts realigning on reload...but never where the model didn\u0027t move as well. This is by far the most odd little glitch have I seen in KSP. Only thing I can think of is double check scale and rotation in your modeling software and in Unity...past that Im sorry to say Im at a loss.\u003C/p\u003E\n"},{"CreatedByName":"angusmcbeth","CreatedById":42479,"CreatedDateTime":"2013-11-07T20:36:20Z","Content":"\n\u003Cp\u003EI had a problem like this yesterday Greys. I loaded a subassembly I had saved just a few moments earlier and it loaded upsidedown in the VAB. I can\u0027t replicate it though. I added the latest MJ and the new planets mod yesterday..I was assuming it to be related to one of these, but Im not sure.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T22:02:49Z\u0022 title=\u002211/07/2013 10:02  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by angusmcbeth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-11-07T20:44:33Z","Content":"\n\u003Cp\u003EI had a similar funny thing yesterday: I was launching a rocket like usual, with MechJeb. Shortly after liftoff, the thing began to roll like crazy. Or so I thought: It rolled by exactly 180 degrees, then stopped, and went perfectly for the rest of the launch. There was a subassembly involved for the lifter, but I haven\u0027t investigated further.\u003C/p\u003E\u003Cp\u003EAlso, I have the planets mod installed, but I really doubt that\u0027s causing problems there. Not that I have the source....\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-11-09T05:13:45Z","Content":"\n\u003Cp\u003EI seem to have resolved this by moving the actual geometry to eliminate the majority of orientations I have to change in Unity, which was annoying, Unity is annoying, I dislike you Unity, I hope you get barked at by small dogs while trying to talk to somebody.\u003C/p\u003E\u003Cp\u003EI have all my stuff in Unity assembled as an empty with PartTools on it, then an empty which contains all the actual stuff; this way I can fiddle with the second empty to make it all the way I want, and I can fiddle with the first empty to line things up in Unity without actually changing the output.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D71fHNz.png\u0022 alt=\u0022D71fHNz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI previously had HexPod/HexPod oriented as (in node notation) 0, -0.75, 0, 90, 0, 180; flipping it backwards, rotating it right side up, and correcting it for being offcenter.\u003C/p\u003E\u003Cp\u003EFor whatever reason reloading the ship seems to pass these down to the mesh or something weird, I can hardly guess; but changing the mesh has eliminated the need for a lot of this so whatever KSP does doesn\u0027t matter, I still need to doublecheck that I haven\u0027t broken anything crafts wise, I don\u0027t think I have.\u003C/p\u003E\n"}]}