{"TopicId":52293,"ForumId":32,"TopicTitle":"Everytime after an update, I go through this cycle.","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-07T23:04:00Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-07T23:04:00Z","Content":"\n\u003Cp\u003EBasically, it goes like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UeFBAlX.png\u0022 alt=\u0022UeFBAlX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a update, I get obesessed with KSP. I then spend days after days on KSP, sending out interplanetary missions and building bases faster than Jebediah Kerman overloaded with caffienne. And then, in a month, I burn out, adopt an attitude of \u0022been there, done that\u0022 (Hard to avoid after you accomplish many of the hardest goals in KSP after a couple weeks), and quit after I find out another update is on the way that will likely destroy my saves (I\u0027m career only now), and proceed to enter a \u0022inactive mode\u0022.\u003C/p\u003E\u003Cp\u003ESo, does anyone suffer from this? And does anyone have advice?\u003C/p\u003E\u003Cp\u003ESaying stuff like \u0022Launch your Kerbal into space with a booster and a seat\u0022 is not going to cut it. I run my agency with the disclipine/expertise of NASA, the progress of CNSA, the enthusasium of the Russians, and the technology of ESA (Bascially, the best of everything), so technically, everything must be safe and have a reason.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-11-07T23:10:19Z","Content":"\n\u003Cp\u003EUntil we get something like resources or procedural missions and such, this will be the cycle for a very long time. Sorry to say but there really isn\u0027t anything in KSP to keep a hold of people. After all, the developers are for some strange reason trying to make KSP first-time-player friendly, leaving the rest of us in the dust.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-11-07T23:12:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EUntil we get something like resources or procedural missions and such, this will be the cycle for a very long time. Sorry to say but there really isn\u0027t anything in KSP to keep a hold of people. After all, the developers are for some strange reason trying to make KSP first-time-player friendly, leaving the rest of us in the dust.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom what it seems to me, they\u0027re just trying to complete the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E We\u0027re playing an early development game, it\u0027s normal that there is not enough gameplay to keep us hooked into it continuously.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-11-07T23:13:19Z","Content":"\n\u003Cp\u003EYou need to put more boosters...\u003C/p\u003E\u003Cp\u003EOn a serious note, it just seems to be what happens with anything when one gets too obssessed. Try taking it slower or play with mods. \u003C/p\u003E\u003Cp\u003EOtherwise, variety is the spice of life. Play other games/ do ogher stuff.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2013-11-07T23:13:45Z","Content":"\n\u003Cp\u003EThat is kinda how it is for me as well, except that I feel i lose a little bit of interest each time because I have already explored everything many times already.\u003C/p\u003E\u003Cp\u003EWhy I hope that they eventually make it so that there are always things to explore or at least a real reason for going back again and again.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-07T23:14:08Z","Content":"\n\u003Cp\u003EI\u0027ve been there, too. When I first got the game, I sank hours a day into it, then eventually hit a wall where I just couldn\u0027t stand to play it anymore and dropped out of the community for a few months to do other things. I eventually came back to it, though.\u003C/p\u003E\u003Cp\u003EMy advice: Try to find a happy medium. Rather than sinking all your time and energy into KSP during your obsessive phase, set your own limits and find other hobbies you enjoy to fill the remaining free time. That\u0027ll help cushion the blow a little when the \u0022crash\u0022 finally hits.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-11-07T23:15:59Z","Content":"\n\u003Cp\u003EI think I\u0027m developing a similar cycle which goes thus:\u003C/p\u003E\u003Cp\u003EPlay KSP with no mods\u003C/p\u003E\u003Cp\u003Eadd just one or two mods, no parts mods\u003C/p\u003E\u003Cp\u003Eadd more mods, start adding mod parts on everything, make epic 5 squillion part bases\u003C/p\u003E\u003Cp\u003Eadd too many mods, crashes galore, can\u0027t remove the mods or half my projects will get wiped due to mod parts\u003C/p\u003E\u003Cp\u003Earrrrghghhhh, rage quit!\u003C/p\u003E\u003Cp\u003Enew version comes out, start new save with no mods. \u0026gt;\u0026gt;\u0026gt; repeat \u0026gt;\u0026gt;\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-11-07T23:17:06Z","Content":"\n\u003Cp\u003EI\u0027ve been playing the same save file since version 18.0 ad haven\u0027t run out of things to entertain me yet.\u003C/p\u003E\n"},{"CreatedByName":"Sid","CreatedById":72855,"CreatedDateTime":"2013-11-07T23:18:21Z","Content":"\n\u003Cp\u003ESave breaking isn\u0027t an issue for me, I\u0027m always trying to build more efficient launch vehicles using realistic parts ( Gemini mod, mostly ) and start a new game every time I figure out a way to use even less rocket to do the same job. So I break my own saves I suppose...\u003C/p\u003E\u003Cp\u003EHaving said that I haven\u0027t got .23 yet, there isn\u0027t anything in it that interests me enough to bother. Which is all about how I play KSP rather than any negative comment on the update.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-11-07T23:24:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003EFrom what it seems to me, they\u0027re just trying to complete the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E We\u0027re playing an early development game, it\u0027s normal that there is not enough gameplay to keep us hooked into it continuously.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is all well and good but as for a lack of gameplay, the devs seem to be trying to just bait people into the game at the moment, and that may be a viable strategy for business, but as for the devs I once knew it feels like they are stabbing the community in the back.\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-11-07T23:29:41Z","Content":"\n\u003Cp\u003EI have several versions of KSP. I\u0027ve taken to using them to write Beagle Flight. So when a update comes out I just install it in a new folder. Terabyte drives are very useful in this respect. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eso I\u0027ll play the update for a but, return to the previous version to finish the current mission I\u0027m on and writing about, then go back to the new version to start the next adventure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat is all well and good but as for a lack of gameplay, the devs seem to be trying to just bait people into the game at the moment, and that may be a viable strategy for business, but as for the devs I once knew it feels like they are stabbing the community in the back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a bit much I think.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T23:31:52Z\u0022 title=\u002211/07/2013 11:31  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by BostLabs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-11-07T23:30:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EThat is all well and good but as for a lack of gameplay, the devs seem to be trying to just bait people into the game at the moment, and that may be a viable strategy for business, but as for the devs I once knew it feels like they are stabbing the community in the back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t understand that perspective at all\u003C/p\u003E\n"},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2013-11-07T23:33:53Z","Content":"\n\u003Cp\u003EI am at the moment on the prolonged \u0022quit KSP\u0022 phase. I haven\u0027t really played much since 0.19 or so, just waiting for the game to mature some more. I still lurk the forums and follow the updates, but I am \u0022saving up\u0022 all the interesting bits for when the game is more complete. I am really looking forward to fully functional career mode with pricing and funds and all that jazz. \u003C/p\u003E\u003Cp\u003ECan you believe that since I started playing(0.18) I have only visited Duna, Eve and Jool ? By far the most time I have spent in KSP was in the SPH designing and flying aeroplanes. I am also very carefully avoiding any forum topics discussing easter eggs. I have so far found 2. I can\u0027t understand the people complaining that there is too few easter eggs. try looking for them without any pointers or spoilers - it takes a great deal of luck to find one! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-07T23:44:40Z","Content":"\n\u003Cp\u003ECurrently, I\u0027ve abandoned KSP until 0.23. Will still remain active in the community.\u003C/p\u003E\u003Cp\u003EMeh, whatever. Time to bring our BASIR until 0.23\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T00:07:15Z\u0022 title=\u002211/08/2013 12:07  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-11-08T00:26:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FenrirWolf\u0022 data-cite=\u0022FenrirWolf\u0022\u003E\u003Cdiv\u003EI don\u0027t understand that perspective at all\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOver the past few months, people including myself have noticed HarvesteR and Squad have been trying to simplify KSP so it lures in new players, or should I say potential customers. Worrying about introductions with a game still in development is pretty ridiculous. They should get the game done, THEN polish the game, as most all companies do.\u003C/p\u003E\n"},{"CreatedByName":"Lone K.","CreatedById":82794,"CreatedDateTime":"2013-11-08T02:07:45Z","Content":"\n\u003Cp\u003EFor me, it follows as this:\u003C/p\u003E\u003Cp\u003E1. New Update, up all night to get hooky.\u003C/p\u003E\u003Cp\u003E2. Jesus christ, I can\u0027t do anything\u003C/p\u003E\u003Cp\u003E3. I want to get to Minmus, but I don\u0027t have the time to do it.\u003C/p\u003E\u003Cp\u003E4. MORE MUN MISSIONS.\u003C/p\u003E\u003Cp\u003E5. Sinking down into the pithes of despthair.\u003C/p\u003E\u003Cp\u003E6. Quit and play TF2.\u003C/p\u003E\u003Cp\u003E7. Update? UPDATE?! \u003Cspan style=\u0022font-size:18px;\u0022\u003EUPDATE!!!!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBut yeah, that\u0027s how it goes.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-11-08T02:22:21Z","Content":"\n\u003Cp\u003EThe best way to break the cycle is to play Dwarf Fortress when KSP is starting to get on your nerves. A few hours of dealing with that nightmare of poor interface design should be more than enough to make KSP seem welcome by comparison.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-11-08T02:23:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EOver the past few months, people including myself have noticed HarvesteR and Squad have been trying to simplify KSP so it lures in new players, or should I say potential customers. Worrying about introductions with a game still in development is pretty ridiculous. They should get the game done, THEN polish the game, as most all companies do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see a lot of hate directed at career mode in this respect, but I feel its misplaced. Sure, career mode should and probably will provide a stepping stone for new players, but its not like that will alienate old people either. This early in its development, its easy to forget that career will eventually encompass things like budgets, consequences for failure and personell loss, etc. In other words it will help achieve the overall vision of actually running a space program. And that\u0027s not gonna be an easy thing.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-11-08T02:34:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FenrirWolf\u0022 data-cite=\u0022FenrirWolf\u0022\u003E\u003Cdiv\u003EI see a lot of hate directed at career mode in this respect, but I feel its misplaced. Sure, career mode should and probably will provide a stepping stone for new players, but its not like that will alienate old people either. This early in its development, its easy to forget that career will eventually encompass things like budgets, consequences for failure and personell loss, etc. In other words it will help achieve the overall vision of actually running a space program. And that\u0027s not gonna be an easy thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I think career mode is a fine step, I believe it is the wrong one to be taken right now. As of right now there is nothing to back up science. These things should have been implemented before career mode as to provide a scientific background for the findings you get with your sensors. Right now you are just using \u0022Mystery Goo\u0022 which doesn\u0027t even have a reasonably scientific name. It almost sounds like magic.\u003C/p\u003E\u003Cp\u003EI like career mode, but Squad really needs to get it\u0027s priorities in order.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-11-08T02:48:55Z","Content":"\n\u003Cp\u003EI take ksp as it comes.\u003C/p\u003E\u003Cp\u003ETheir is a peek to my activity at each new update but the lulls towards the end of a cycle are less pronounced, because I tend toward huge projects by that time that take weeks of planning and testing to pull off. \u003C/p\u003E\u003Cp\u003EI usually run two version at the same time.\u003C/p\u003E\u003Cp\u003E1 Modded to hell install with all my faves... kAS, Kethan, EPL, all the wheels, 1/2 meter parts, etc\u003C/p\u003E\u003Cp\u003E1 stock with just just camera mods for challenges.\u003C/p\u003E\u003Cp\u003Enow I get to add a sandbox and carreer mode save to each KSP version so I am good. Four naratives at a time is good enough for me.\u003C/p\u003E\u003Cp\u003EThe space of time I find excruciating is when the new version comes out and I wait to see what of my favorite mods will survive to the next iteration. When Mapsat went wonky and into Dev versions, loosing kw, things like that made me redesign certain aspects of my play and lost me some of my favortie pet projects.\u003C/p\u003E\u003Cp\u003Ealacrity\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2013-11-08T03:01:41Z","Content":"\n\u003Cp\u003Eits funny because if you go through the cycle the opposite way its quite silly\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-11-08T03:37:53Z","Content":"\n\u003Cp\u003EOP:\u003C/p\u003E\u003Cp\u003EYou\u0027re not alone, and it\u0027s a major reason why I\u0027ve never really bothered to do anything more ambitious than go to the moon(s). Every time I start getting ready to do more, here comes another update to nuke everything back to zero.\u003C/p\u003E\u003Cp\u003EI can only start from scratch so many times before giving up.\u003C/p\u003E\u003Cp\u003EIt probably doesn\u0027t help that I am, at heart, a writer. I want to tell stories - detailed, lavishly illustrated documentaries - of my space program, like Brotoro and others.\u003C/p\u003E\u003Cp\u003EProblems: One, no one but me actually seems to care. \u003C/p\u003E\u003Cp\u003EAnd two, every time, just when I\u0027m getting to the \u0027good part\u0027, it\u0027s \u0022now start over. And make it different, yet the same, and still interesting.\u0022\u003C/p\u003E\u003Cp\u003EI want there to be just one story, from start to finish. And I\u0027m starting to think I\u0027m going to have to wait another two or three years before I can begin it. \u003C/p\u003E\u003Cp\u003E(not that anyone will care then, either.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T03:58:27Z\u0022 title=\u002211/08/2013 03:58  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by Commander Zoom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"soranno","CreatedById":58351,"CreatedDateTime":"2013-11-08T04:30:00Z","Content":"\n\u003Cp\u003EI think a point that is being overlooked here, is that this game isn\u0060t even finished, and yet so many people can sit and play away at it for hours and hours and weeks and weeks before getting burned out. At that point the game has surely surpassed the vast majority of games, and is part of a unique minority.\u003C/p\u003E\u003Cp\u003EAnd then you say, there is an update and you do it again? Surely then KSP has surpassed even many of those games within that minority.\u003C/p\u003E\u003Cp\u003EAnd it\u0060s not even finished... \u003C/p\u003E\u003Cp\u003EI too have had very long sessions, and weeks of excessive kerballing, but with a busy work schedule etc I have found a more relaxed playing schedule fits my lifestyle and the game remains interesting and challenges after even many months without a significant break.\u003C/p\u003E\u003Cp\u003EIt also seems unrealistic in my view, to expect that you can grind and grind away at a game for week after week and not find it ultimately losing its edge.\u003C/p\u003E\u003Cp\u003EThe only games I can think of that fit that view are MMOs and such. \u003C/p\u003E\u003Cp\u003EIn conclusion, if you\u0060re going to play a game to death, then it\u0060s probably going to die. And appreciate the countless hours of gameplay you enjoy even now, with the game far from complete.\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2013-11-08T06:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022 data-cite=\u0022Commander Zoom\u0022\u003E\u003Cdiv\u003EIt probably doesn\u0027t help that I am, at heart, a writer. I want to tell stories - detailed, lavishly illustrated documentaries - of my space program, like Brotoro and others.\u003Cp\u003EProblems: One, no one but me actually seems to care. \u003C/p\u003E\u003Cp\u003EAnd two, every time, just when I\u0027m getting to the \u0027good part\u0027, it\u0027s \u0022now start over. And make it different, yet the same, and still interesting.\u0022\u003C/p\u003E\u003Cp\u003EI want there to be just one story, from start to finish. And I\u0027m starting to think I\u0027m going to have to wait another two or three years before I can begin it. \u003C/p\u003E\u003Cp\u003E(not that anyone will care then, either.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt could\u0027ve been me writing this post. God, do I empathize. I mean, yeah, some people do care about the stories... but I relate so much.\u003C/p\u003E\u003Cp\u003EMaybe it\u0027s time to make a decision to stick with one savefile in one game version, no matter what new shiny updates and mods come along, and just tell the story. However long it takes.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-11-08T07:00:02Z","Content":"\n\u003Cp\u003EI tend to go through the same cycle, my interest wains when I start finding the stock parts aren\u0027t capable of doing what I want them too. I just really wish squad would do an internal docking bay capable of holding a decent sized lander.\u003C/p\u003E\n"}]}