{"TopicId":52370,"ForumId":16,"TopicTitle":"Joystick!","CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-08T15:58:56Z","PageNum":1,"Articles":[{"CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-08T15:58:56Z","Content":"\n\u003Cp\u003EHey everyone!\u003C/p\u003E\u003Cp\u003EHaving finally succeeded doing a successful docking in orbit, I am now tempted to get a good joystick with throttle control and whatnot, since I suppose that might be all kinds of awesome. So, I\u0027m wondering if any of you have any useful input on this topic. I dug around a bit on the forum but couldn\u0027t really find the kind of information I was looking for (sorry if it does exist out there). Does KSP work well with a joystick? Can I map it for proper thrust control and all of that jazz? I\u0027m currently considering a Thrustmaster T-Flight Hotas X, if that\u0027s any help.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ecx.images-amazon.com/images/I/41rkQElHzdL._SX385_.jpg\u0022 alt=\u002241rkQElHzdL._SX385_.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"voneiden","CreatedById":38803,"CreatedDateTime":"2013-11-08T16:48:42Z","Content":"\n\u003Cp\u003EJoystick works great for atmospheric flight, but I never found it very useful for space flight. Space flight (precision flight, like docking) tends to be more about applying gentle impulses so I actually prefer the keyboard there.\u003C/p\u003E\u003Cp\u003EAlso if the joystick has little dead zone or slight calibration issues it\u0027s gonna easily cause slow unwanted rotation in space.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-11-08T17:03:17Z","Content":"\n\u003Cp\u003EI\u0027m no guru but I do have a cheapo $20-30 Logitech X3D Pro that I\u0027ve been using with KSP. Has hat controls, a little throttle on the base of the stick, and plenty of buttons. It worked out of the box with no special work or configuration, but I\u0027ve seen threads mentioning different kinds of joysticks that don\u0027t work without some 3rd party software and chewing gum.\u003C/p\u003E\u003Cp\u003EYou can map all axis\u0027 of movement (including camera pan/zoom) and throttle control, as well as mapping just about any keypress. I believe there are some oddities or omissions here and there. I, myself, noticed that mapping the \u0022Brake\u0022 command to a joystick button did not result in a toggle but instead only brakes while the button is held for instance.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-11-08T17:08:45Z","Content":"\n\u003Cp\u003EThe t-flight is excellent value for money, I used one for a while. The fact that it has a twist-grip rudder almost makes it better than my Thrustmaster Warthog for KSP. Almost.\u003C/p\u003E\u003Cp\u003EIt has enough buttons to cover most of the functions in KSP. If you want more buttons you can do what I did: use autohotkey to turn the thumb buttons on the throttle into modifiers that work in combination with the POV control. This gives you 16 inputs where you previously had 7.\u003C/p\u003E\n"}]}