{"TopicId":52385,"ForumId":16,"TopicTitle":"Landing on Laythe","CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2013-11-08T18:27:26Z","PageNum":1,"Articles":[{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2013-11-08T18:27:26Z","Content":"\n\u003Cp\u003EOn career mode I decided to send an unmanned probe to get some science done around Jool. My plan for the mission was to encounter all of Jool\u0027s moons and do some science in the space above them before landing on Laythe. \u003C/p\u003E\u003Cp\u003EUnfortunately, I approached Jool from the wrong angle and became stuck in a retrograde orbit. I had a fair bit of of fuel remaining, but nothing like enough to allow me to get into orbit around Laythe (5.2km/s of delta-v, ay right), as I was travelling in exactly the opposite direction to it. In the end, I encountered all the moons (except for Bop) and then got some extra science from a low Jool orbit.\u003C/p\u003E\u003Cp\u003EIs there any advice on how to avoid this happening again? I don\u0027t use mods, so generally I just try to encounter a planet and then retroburn at the periapsis. I hadn\u0027t started exploring the moons of other planets until recently so it had never really mattered before about the inclination of a planetary orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-20T21:56:34Z\u0022 title=\u002211/20/2013 09:56  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 20, 2013\u003C/time\u003E by Rusty6899\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-11-08T18:33:36Z","Content":"\n\u003Cp\u003ELaythe has an atmosphere, so you can jump right in no matter what your speed is.\u003C/p\u003E\u003Cp\u003EBut to your question: open up the settings.cfg and change the CONIC_DRAW_MODE (or whatever it is) to 0. Then when you set up the encounter with Jool, you can focus on Jool and see what your orbit will be relative to it when you get there.\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-08T18:40:17Z","Content":"\n\u003Cp\u003EIf you time it JUUUUUUUUST right you shoujld be able to encounter Laythe on the trailing edge, like you would for a gravity assist, and use atmospheric braking and gravity assist to reverse your orbital direction and maybe even land. Basically gravity assist to completely reverse your orbit. This usually results in an encounter path that takes you into the surface but hey, you wanted to land anyway right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for advice on preventing it from happening again - always aim for the trailing side of the planet. use corrections while transferring between planets if necessary. You can double click on the target to center the view on it and zoom in to see how you\u0027re doing.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2013-11-08T18:44:16Z","Content":"\n\u003Cp\u003EYeh, I had considered trying to aerobrake, but I think I\u0027ll probably try to get a prograde orbit next time. I hadn\u0027t thought of focussing on Jool to see how I was approaching it, I\u0027m pretty sure that will do the trick. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-08T19:59:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rusty6899\u0022 data-cite=\u0022Rusty6899\u0022\u003E\u003Cdiv\u003EUnfortunately, I approached Jool from the wrong angle and became stuck in a retrograde orbit.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EIs there any advice on how to avoid this happening again?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOpen your settings.cfg in notepad or another plain text editor and change the following parameters:\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE = 0\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_LIMIT = 6\u003C/p\u003E\u003Cp\u003EThen, when planning a maneuver (and after you executed it) always check the destination if your approach trajectory is right. Note that the trajectory will be drawn around your destination, so you can focus on it by pressing Tab or by double clicking it. If the trajectory is not ok, execute a correction as soon as possible.\u003C/p\u003E\u003Cp\u003EWhen switching SOIs, decrease your time warp as low as possible - x5 is best.\u003C/p\u003E\u003Cp\u003EThat\u0027s all you need to avoid that happening ever again.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-08T21:01:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rusty6899\u0022 data-cite=\u0022Rusty6899\u0022\u003E\u003Cdiv\u003EIs there any advice on how to avoid this happening again? I don\u0027t use mods, so generally I just try to encounter a planet and then retroburn at the periapsis. I hadn\u0027t started exploring the moons of other planets until recently so it had never really mattered before about the inclination of a planetary orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just need to tweak your trajectory while en route to Jool so you go prograde around Jool. This usually requires 3-4 tweaks. The reaon is because the whole map view and the maneuver node system was designed only to get you from Kerbin to Mun, so it becomes increasingly difficult to use and less accurate in where it shows you\u0027ll even up the further from home you go. Jool is so far away from Kerbin that what you see for your encounter right after you leave Kerbin is not very close to what you\u0027ll have when you get out there if you do nothing.\u003C/p\u003E\u003Cp\u003EThe closer you get to Jool, the more accurate what you see on the map and the easier it becomes to fiddle with maneuver nodes on 1 side of the map while observing effects on the other. But the closer you are to Jool, the more these burns cost. This is why you should do several tweaks as you go along, so the last one won\u0027t cost very much. I usually do tweaks at each 1/4 of the trip. The purpose of them all is to narrow down my Jool Pe progressively until it\u0027s only like 200km. For the burns at 1/4 and 1/2way there, all I care about is Pe altitude, not inclination or whether I\u0027m prograde or retrograde. The burn at 3/4 of the way sets the inclination and makes sure I\u0027m going prograde, as well as puts the Pe no more than 500km out (the others having been satisfied with greater distances).\u003C/p\u003E\u003Cp\u003EFinal adjustment, however, cannot be done at all until you\u0027re in Jool\u0027s SOI. But this is so big that you can barely see Jool in the far distance when you get into it, so burns are still cheap. So this is where I put my Pe down to the top of the atmosphere, it already having been set on the right side of Jool and at the right inclination by the previous burn. But you\u0027re still so far away at this point that you can\u0027t set your final aerocapture Pe until you\u0027re much closer, like inside the orbit of Vall.\u003C/p\u003E\u003Cp\u003EAnyway, keep an eye on your Jool Pe throughout the trip and keep it as low as you can. When you get close enough, make sure it\u0027s on the right side of Jool as you\u0027re looking at it and that your trajectory afterwards will be in the plane of the moons. Then finalize it with a couple more tweaks once in the SOI. I guarantee this will prevent you from ever going retrograde again unless you want to.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-08T21:19:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EYou just need to tweak your trajectory while en route to Jool so you go prograde around Jool. This usually requires 3-4 tweaks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay. There are reasons for doing so many corrections if you want to hit something really small and desperately need to spend as little fuel as possible. Apart of that I don\u0027t see any reason to do more than one correction at about half of the interplanetary transfer and then one after entering Jool SOI.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EThe reaon is because the whole map view and the maneuver node system was designed only to get you from Kerbin to Mun, so it becomes increasingly difficult to use and less accurate in where it shows you\u0027ll even up the further from home you go. Jool is so far away from Kerbin that what you see for your encounter right after you leave Kerbin is not very close to what you\u0027ll have when you get out there if you do nothing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure the reason is very different. The wiggling is caused by physics engine causing small changes to the ship\u0027s center of mass and total velocity. The further the trajectory goes, the more pronounced these changes are.\u003C/p\u003E\u003Cp\u003EAs soon as you start at least x5 time warp the trajectory becomes rock solid and you can be 100% sure that it won\u0027t budge a single centimeter until you change SOIs (or go to x1 time warp again). And if you change SOIs at low time warp, the trajectory won\u0027t move by more than a few hundred meters. As long as the trajectory looks good, no corrections are necessary.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-08T21:51:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOkay. There are reasons for doing so many corrections if you want to hit something really small and desperately need to spend as little fuel as possible. Apart of that I don\u0027t see any reason to do more than one correction at about half of the interplanetary transfer and then one after entering Jool SOI.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s always about spending as little fuel as possible because you never know how the plan might change. 3 minor tweaks along the way, each progressively improving your Pe, will only cost you maybe 40m/s in total. That will save you a lot over making 1 mid-course burn and then a rather significant burn at SOI.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure the reason is very different. The wiggling is caused by physics engine causing small changes to the ship\u0027s center of mass and total velocity. The further the trajectory goes, the more pronounced these changes are.\u003Cp\u003EAs soon as you start at least x5 time warp the trajectory becomes rock solid and you can be 100% sure that it won\u0027t budge a single centimeter until you change SOIs (or go to x1 time warp again). And if you change SOIs at low time warp, the trajectory won\u0027t move by more than a few hundred meters. As long as the trajectory looks good, no corrections are necessary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t what happens to me. Even if I only have 1 ship in existence, and it\u0027s just going to Mun, I can\u0027t trust the map. On every single Mun trip I do, I leave Kerbin with a Mun Pe of 60k prograde and continuing on into a very wide Kerbin orbit if I do nothing at Pe. But about 1/2way to Mun, as I\u0027m warping along at 500x or 1000x, suddenly the map changes to show me having a retrograde Pe right at the edge of Mun\u0027s SOI, after which I never even reach Mun\u0027s orbit but go into a tight ellipse back to Kerbin. And it stays showing this until about 30 minutes prior to where my original SOI change was, after which it jumps back to showing me something pretty close to what I had to start with (but never the same).\u003C/p\u003E\u003Cp\u003EOn long interplanetary flights, usually I don\u0027t have this happen but I still can\u0027t trust the map. While the Pe the map displays doesn\u0027t change during warp, apparently it changes in the background because it never remains where it was the last time I looked. Of course, my interplanetary missions always involve multiple ships so I\u0027m always jumping around between them. Perhaps this is the root cause. But in any case, as stated, the map system wasn\u0027t designed to go anywhere further than Mun and has real and noticeable problems on longer trips.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-08T22:20:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EOn every single Mun trip I do, I leave Kerbin with a Mun Pe of 60k prograde and continuing on into a very wide Kerbin orbit if I do nothing at Pe. But about 1/2way to Mun, as I\u0027m warping along at 500x or 1000x, suddenly the map changes to show me having a retrograde Pe right at the edge of Mun\u0027s SOI, after which I never even reach Mun\u0027s orbit but go into a tight ellipse back to Kerbin. And it stays showing this until about 30 minutes prior to where my original SOI change was, after which it jumps back to showing me something pretty close to what I had to start with (but never the same).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know what you mean. It does not happen every time to me but it does happen every once in a while. It\u0027s some kind of bug in evaluating intersections of SOI with your trajectory. It is usually more likely to happen when your speed relative to the SOI is small. So far I know about four such bugs.\u003C/p\u003E\u003Cp\u003E- bug with intersecting SOI at high speed which won\u0027t show you\u0027re intersecting it at all or will show you only part of the trajectory without PA\u003C/p\u003E\u003Cp\u003E- bug which will draw you outside the SOI after you have crossed the point after which you should be inside\u003C/p\u003E\u003Cp\u003E- bug which will draw you inside the SOI after you have crossed the point after which you should be outside\u003C/p\u003E\u003Cp\u003E- bug which will draw the SOI exit point at the opposite end of the SOI if you\u0027re very close to the SOI\u0027s inside boundary\u003C/p\u003E\u003Cp\u003EBut it\u0027s nothing that can be fixed with corrections. All you can do is to fly along and hope the game will switch back.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-09T06:36:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI know what you mean. It does not happen every time to me but it does happen every once in a while. It\u0027s some kind of bug in evaluating intersections of SOI with your trajectory. It is usually more likely to happen when your speed relative to the SOI is small. So far I know about four such bugs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I can now add another, now that I\u0027ve got several ships flying back and forth between Jool\u0027s moons. Maybe it\u0027s because there are so many SOIs so close together there, and moving around each other. Anyway, what I\u0027m seeing goes like this:\u003C/p\u003E\u003Cp\u003E1. Start in orbit around any moon, take your pick.\u003C/p\u003E\u003Cp\u003E2. Do a transfer to a different moon. Everything is fine as you set up the node, do the burn, and coast out towards the edge of the starting moon\u0027s SOI.\u003C/p\u003E\u003Cp\u003E3. You leave the 1st moon\u0027s SOI and enter Jool\u0027s. Even if you cross the boundary at 1x warp, things immediately go haywire on the map. First, your entire future path disappears. All you have is the blue current orbit and instead of heading off at a tangent from the 1st moon, it\u0027s in a tight curve around it for about 3/4 of a circle, where it just comes to an abrupt end.\u003C/p\u003E\u003Cp\u003E4. Cross your fingers and wait a minute or so. Eventually, this weird 3/4 orbit of the starting moon disappears and is replaced by something resembling what you had when you finished the burn. However, you only see this in flickers because it\u0027s alternating with something entirely different about 6 times per second. The path you see in the other flickers usually has you taking as sharp turn down towards Jool and then being shot out of the system.\u003C/p\u003E\u003Cp\u003E5. This flickering of different paths continues for pretty much the entire 1st 1/2 of the trip to the target moon. Then it settles down showing you heading towards your destination as planned. HOWEVER, your Pe at the target is WAY different from what it was at the end of your burn, before you left the 1st moon\u0027s SOI. It\u0027s usually moved 500-600ikm. It thus takes a pretty good tweak or 2 in the latter 1/2 of the trip to get your Pe back where you wanted it.\u003C/p\u003E\u003Cp\u003EI had another weird thing happen a while back, too. After a final tweak about 7/8 of the way to Duna one time, the map showed I\u0027d have a prograde Pe of about 60km with the SOI change due in about 18 hours. But what I got was a 1.2Mm retrograde encounter quite a few hours before my expected SOI change. And I had to act fast on this because I was at the VERY edge of Duna\u0027s SOI, only being in it for like 10 minutes. Unlike the map being weird, this was the ship itself being weird, so I couldn\u0027t trust that everything would sort itself out if I did nothing. Therefore, I suddenly had to do an unexpected 1000\u002Bm/s burn to flip the orbit over and get my Pe down next to Duna. Very annoying.\u003C/p\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2013-11-09T14:03:46Z","Content":"\n\u003Cp\u003EThat\u0027s all really helpful. I had always wondered about the flickering/changing Pe markers but I had just decided to accept them as part of the game. I\u0027m guessing it will help a lot to do corrections mid way. One of the things I like most about the game is that there are so many different areas to perfect. I thought I nearly had the game sussed when I first landed on Duna, but that\u0027s really just the start of it.\u003C/p\u003E\n"}]}