{"TopicId":52453,"ForumId":34,"TopicTitle":"[0.23.5] StretchySRB: A StretchyTanks Continuation v9 Final Pre-PP edition 3/21/14","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-09T09:09:43Z","PageNum":1,"Articles":[{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-09T09:09:43Z","Content":"\n\u003Cp\u003EStretchySRB is a continuation of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/46447\u0022 rel=\u0022external nofollow\u0022\u003EStretchyTanks\u003C/a\u003E by the great AncientGammoner.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ENote: StrechySRB is in the process of being replaced by \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70676\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EProcedural Parts\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E. This will be the final release of StretchySRB under this name; for all further development (and many amazing new features) see the PP thread.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMy StretchySRB patch to StretchyTanks grew and grew. Along with the minor fixes and the SRB, I\u0027ve now totally redone how textures are found and loaded, which means anyone can add textures to their ST install just by adding a texture or two somewhere and either editing STTextures.cfg or doing it via ModuleManager. Rather than posting new patches all the time in the ST thread I\u0027m finally making a new thread.\u003C/p\u003E\u003Cp\u003EFrom the Readme:\u003C/p\u003E\u003Cp\u003EThis addon is by NathanKell, e-dog, and swamp_ig, featuring models by Tiberion and further textures by Chestburster and Dante80.\u003C/p\u003E\u003Cp\u003EThis addon to Stretchy Tanks adds a conic tank, two Stretchable SRBs, a new texture system, and some fixes.\u003C/p\u003E\u003Cp\u003E*Node size scales when resizing super-stretchy tanks\u003C/p\u003E\u003Cp\u003E*stock ST texture stays in aspect when stretching tanks\u003C/p\u003E\u003Cp\u003E*will show all resources in tank when you mouseover\u003C/p\u003E\u003Cp\u003E*Proper integration with Modular Fuel Tanks or Real Fuels (REQUIRES MFT v4/RF v4 or above!) - when done stretching, go into action editor-\u0026gt;tank setup and update each fuel amount the desired amount to get your final amount.\u003C/p\u003E\u003Cp\u003E*and a few other misc logic tweaks\u003C/p\u003E\u003Cp\u003ENote when using with Real Fuels: Stretchy SRB is ModularEngines enabled, so your thrust will be corrected when not in vacuum. It is also techlevel enabled, although only Isp will change (not casing mass).\u003C/p\u003E\u003Cp\u003EThe new texture system works off confignodes. There is a file in the StretchyTanks/Parts folder called STTextures.cfg that defines the textures. You can create your own textures, place them in any location, and use ModuleManager to add the appropriate nodes to the STRETCHYTANKTEXTURES node. All documentation on the node syntax is in the STTextures.cfg file.\u003C/p\u003E\u003Cp\u003ENote: this SUPERCEDES any prior Stretchy Tanks-related work by either NathanKell or Starwaster.\u003C/p\u003E\u003Cp\u003EINSTALL:\u003C/p\u003E\u003Cp\u003EDELETE YOUR OLD STRETCHYTANKS FOLDER in the KSP/GameData folder. Then unzip this folder to KSP/GameData\u003C/p\u003E\u003Cp\u003EYou may also find, in the StretchyTanks/Parts folder, a Template file with the grit layers I use to make the tanks look slightly worn. Feel free to use it and make (and post!) new textures!\u003C/p\u003E\u003Cp\u003ELicense remains CC-BY-SA 3.0 Unported\u003C/p\u003E\u003Cp\u003EChangelog\u003C/p\u003E\u003Cp\u003Ev9 =\\/=\u003C/p\u003E\u003Cp\u003E*Final pre-Procedural Parts release\u003C/p\u003E\u003Cp\u003E*Moved RF tanks over to RF mod. Will no longer clutter partlist\u003C/p\u003E\u003Cp\u003E*Deprecate non-superstretchy tanks (available to old craft but hidden in part list)\u003C/p\u003E\u003Cp\u003E*Support RF v6\u003C/p\u003E\u003Cp\u003E*Fix heatProduction for SRBs when using DRE\u003C/p\u003E\u003Cp\u003E*Add Version Checker (Majiir / Ferram)\u003C/p\u003E\u003Cp\u003E*Add \u0022utilization\u0022 factor: essentially a hack to allow you to copy real rockets. Fat short tanks should have lower utilization; long tall tanks should have higher. Example values: Titan II lower stage: 0.87. Saturn V lower stage: 0.8. Titan II upper stage: 0.7. Atlas D through I: ~0.85. ***NOTE: you MUST rescale the tank slightly after changing utilization or the volume won\u0027t update. After that, you can scale it back.***\u003C/p\u003E\u003Cp\u003E===============\u003C/p\u003E\u003Cp\u003EShowing off the new tank textures and conic tank (with a faired interstage). Note the Delta II-like top stage, an orange cyrogenic mid stage, and a Saturn V like lower stage. Also note the German-like procedural fairings (available as a ST texture). Further, note the four StretchySRBs.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/QawxV1K.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QawxV1Kl.png\u0022 alt=\u0022QawxV1Kl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Je6nXRA\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Je6nXRAl.png\u0022 alt=\u0022Je6nXRAl.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/juVBCQP\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/juVBCQPl.png\u0022 alt=\u0022juVBCQPl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESea Level / Vacuum SRB nozzles by Tiberion\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/NathanKell/StretchySRB/releases/tag/v9\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EDownload\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/NathanKell/StretchySRB\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ESource on Github\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E=========================\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ETexture Library\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAdditional textures for your tanks.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPlaneguy868\u003C/strong\u003E: \u003Ca href=\u0022http://www./download/gz8f35398bs7a14/planeguy868.zip\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E. \u003Cem\u003EInstallation instructions: download and extract it to KSP\u0027s GameData folder.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPreview:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zsq4zeYm.png\u0022 alt=\u0022Zsq4zeYm.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6uSoyXCm.png\u0022 alt=\u00226uSoyXCm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFerram4\u0027s Saturn and Nova Textures\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/9mi9tjb5akaiaaz/SaturnNovaTexturePack.zip\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E. \u003Cem\u003EInstallation instructions in zip.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPreview:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/YZyRRBN.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/YZyRRBN.png\u0022 alt=\u0022YZyRRBN.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eblackheart612\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68892-0-23-StretchySRB-Texture-Pack-KW-Procedural-Fairings\u0022 rel=\u0022external nofollow\u0022\u003EFull thread!\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPreviews:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/m2OTv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-08T23:49:15Z\u0022 title=\u002204/08/2014 11:49  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 8, 2014\u003C/time\u003E by NathanKell\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-11-09T09:23:21Z","Content":"\n\u003Cp\u003EThis is simply the best thing ever, maintained by one of the greatest!\u003C/p\u003E\u003Cp\u003ESeriously, so many fuel tanks can go on the way side with this mod! And since I\u0027m one of those people with mod fever, this helps reduce memory footprint by allowing me to remove at least a good 50 superfluous tanks!\u003C/p\u003E\u003Cp\u003ESave memory, go stretchy!\u003C/p\u003E\n"},{"CreatedByName":"blubbermonkeys","CreatedById":61719,"CreatedDateTime":"2013-11-09T10:08:14Z","Content":"\n\u003Cp\u003EYou\u0027re on a spree with absolutely amazing mods.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-09T10:13:35Z","Content":"\n\u003Cp\u003EDoes this fix the SRB\u0027s resetting to the center of the craft if you revert to VAB?\u003C/p\u003E\u003Cp\u003EI absolutely agree with @blubbermonkeys! You\u0027re doing great work @Nathan. Amazing work!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-09T12:48:56Z","Content":"\n\u003Cp\u003ECould you add a \u0022ballon tank\u0022 variant of the stretchy tank? It\u0027d be like regular tanks, but much lighter, much weaker and with no capability for surface attachments. Also, is there any correlation between the orange texture and presence of MFT-based insulation? I think you should include that, too.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027ve just got an idea. Stretchy Tanks scales the base model, right? Would that be possible to add stretchy adapters (fixed ratio, I guess), nosecones or KW-style Soyuz tanks? Also, a stretchy endcap would be neat for Shuttle-style tanks.\u003C/p\u003E\n"},{"CreatedByName":"p3asant","CreatedById":83235,"CreatedDateTime":"2013-11-09T13:41:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ECould you add a \u0022ballon tank\u0022 variant of the stretchy tank? It\u0027d be like regular tanks, but much lighter, much weaker and with no capability for surface attachments. Also, is there any correlation between the orange texture and presence of MFT-based insulation? I think you should include that, too.\u003Cp\u003EAlso, I\u0027ve just got an idea. Stretchy Tanks scales the base model, right? Would that be possible to add stretchy adapters (fixed ratio, I guess), nosecones or KW-style Soyuz tanks? Also, a stretchy endcap would be neat for Shuttle-style tanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre adapters really needed when you have procedural interstages?\u003C/p\u003E\u003Cp\u003EBalloon, centaur-like, tanks would be cool.\u003C/p\u003E\u003Cp\u003EAlso spherical tanks would be cool. I\u0027m thinking N1.\u003C/p\u003E\u003Cp\u003EWould spherical tanks be possible to implement?\u003C/p\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2013-11-09T13:48:05Z","Content":"\n\u003Cp\u003EMan, you\u0027re awesome!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-09T13:51:57Z","Content":"\n\u003Cp\u003EAdapters would be neat for when you don\u0027t really need a fairing, but rather want to fill the adapter with fuel. Oh, and I support the spherical tank idea. N1 has some incredibly complex fairings, so I don\u0027t think you could recreate it just with this, but spherical tanks would be generally useful for orbital ships where aerodynamics are not a problem.\u003C/p\u003E\n"},{"CreatedByName":"DAVIDESCOTT","CreatedById":77876,"CreatedDateTime":"2013-11-09T14:06:34Z","Content":"\n\u003Cp\u003EWhen you stretch an SRB are you increasing thrust or burn time?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-09T14:18:18Z","Content":"\n\u003Cp\u003EThrust, IIRC, but that\u0027s not very important. You adjust burn time to get any thrust/burn time ratio you want.\u003C/p\u003E\n"},{"CreatedByName":"MNorman","CreatedById":64741,"CreatedDateTime":"2013-11-09T14:38:19Z","Content":"\n\u003Cp\u003EI have been having some problems with the stretchySRBs. If I use them with the version of the modular fuel system without the real fuels I cannot change them, and cannot select them in Action group mode. If I put a stretchy tank above the SRB and mouseover the SRB in Parts mode, or select it in action group mode, then the game responds as if the mouse pointer was over the stretchy tank. If I then remove the ModuleEngineConfigs module (Which I understand to only be used by the real fuels version of the modular fuel system) from the cfg file, the SRB works as expected.\u003C/p\u003E\n"},{"CreatedByName":"Miller","CreatedById":64691,"CreatedDateTime":"2013-11-09T15:01:53Z","Content":"\n\u003Cp\u003EHow do you do it Nathan? You have around 5 mods under you which are soo good that alot of people won\u0027t even play ksp without them.\u003C/p\u003E\n"},{"CreatedByName":"redshift690","CreatedById":84838,"CreatedDateTime":"2013-11-09T21:58:39Z","Content":"\n\u003Cp\u003EHello I just installed this on a fresh KSP install along with; \u003C/p\u003E\u003Cp\u003EReal Solar System v5.1\u003C/p\u003E\u003Cp\u003EKSPI 0.7.4\u003C/p\u003E\u003Cp\u003EKethane 0.8\u003C/p\u003E\u003Cp\u003ETacFuelBalancer\u003C/p\u003E\u003Cp\u003EFerram Aerospace Research 0.9.7\u003C/p\u003E\u003Cp\u003EProcedural Wings\u003C/p\u003E\u003Cp\u003EMFS 3.1\u003C/p\u003E\u003Cp\u003EAnd I seem to be having a problem changing the fuel type. With my mouse over the tank and pressing the \u0022g\u0022 key does nothing, and stays liquid fuel/oxidizer. All other features changing size/textures is working fine.\u003C/p\u003E\u003Cp\u003E I was hoping to use this mod exclusively as my fuel tanks and delete all other default/mod tanks to reduce my memory footprint. Thanks for any help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-09T22:14:01Z","Content":"\n\u003Cp\u003EFirst: Thanks, everybody, but the lion\u0027s share goes to the original author AncientGammoner. I\u0027ve added some stuff and fixed some issues, but he\u0027s the original mod author.\u003C/p\u003E\u003Cp\u003EANWRocketMan: I believe it might. Let me know!\u003C/p\u003E\u003Cp\u003EDragon01:\u003C/p\u003E\u003Cp\u003E1. That\u0027s an interesting idea actually. What that would need is a balloon tanktype in MFS, too, but I was planning to add one anyway.\u003C/p\u003E\u003Cp\u003E2. There is no correlation because I didn\u0027t want to add an elaborate tank-type-checking system for textures. Besides, some people may want different textures on different tanks (for the same reason you can select the SRB texture for non-SRB tanks). However, Starwaster when he first added MFS compatibility added a Cryogenic superstretchy, so use that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E3. Fixed adapters are very possible. Some day when I have time I want to examine how DYJ does it for the procedural adapter; combining that method for top and bottom radius, and ST method for rescaling the whole model, would lead to fully procedural tank adapters. However, it might be easier to derive from the Proc Fairing interstage, because then you can even control curvature. I\u0027ll talk to e-dog.\u003C/p\u003E\u003Cp\u003EI currently already use PF interstage for my nosecones, since, as long as you extend the fairing height above the node, FAR shouldn\u0027t count it as an open node, and you can make the top radius 0 (or nearly 0). When the fully-procedural fairing bases drop we can switch to those.\u003C/p\u003E\u003Cp\u003ESide tanks should be doable. As it happens, one reason for this new texture system was to allow a textureType NONE to disable texture switching, but I forgot to do that. Oops.\u003C/p\u003E\u003Cp\u003ESpherical tanks already exist in the form of Talisar\u0027s Spherical Tanks. Though they are not procedural. Hmm...\u003C/p\u003E\u003Cp\u003EDAVIDESCOTT: As Dragon01 says, thrust is a dependent variable. You control burn time with G, and solid fuel capacity by rescaling the tank. Thrust is set so that the amount of fuel in the tank burns for (burntime). If you want more thrust, decrease your burn time. When you change tank size, because desired burn time stays constant, thrust changes to make actual burn time accord to desired burn time.\u003C/p\u003E\u003Cp\u003EMNorman: OH. Figured it out. Right, you do need to remove the ModuleEngineConfigs module. I can try setting something up in MFS for now, but the way you switch from regular MFS to MFS_RF is...by adding MEC modules. So you\u0027re effectively running in partial-RF mode. And once there exists a single MEC somewhere, it depends on the stats in the RealFuels folder.\u003C/p\u003E\u003Cp\u003Eredshift690: Go into action group editor and click on the tank. MFS makes all tanks modular, so you use its system to configure tanks, not the old ST system.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-11-09T22:28:35Z","Content":"\n\u003Cp\u003EMy my, PFueltanks were amazing, but BOOSTERS? And those amazing looking textures- I want it now!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-09T22:56:14Z","Content":"\n\u003Cp\u003ENow that I think of it, there\u0027s no reason why you couldn\u0027t insulate a non-cryo tank (there\u0027s more to it than insulation), or paint over a cryo tank (as was done with early Shuttles). So it\u0027s fine to have different textures. \u003C/p\u003E\u003Cp\u003EAlso, I\u0027m working on modifying the stretchy SRB to have a hybrid confuguration. Essentially, an SRB that also requires LOX to function. Other oxidizers could be added later, too. Does anyone have info about hybrid mass ratios and Isps?\u003C/p\u003E\n"},{"CreatedByName":"redshift690","CreatedById":84838,"CreatedDateTime":"2013-11-09T23:16:42Z","Content":"\n\u003Cp\u003EThanks Nathan for the info, and for all your awesome mods! Working great now. With this tank mod I can free up a lot of memory space getting rid of all other tanks! Awesome stuff! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Chestburster","CreatedById":69476,"CreatedDateTime":"2013-11-10T01:18:38Z","Content":"\n\u003Cp\u003EI\u0027m kinda out of ideas for additional textures that are based on real rockets and are possible to implement with ST. So if you guys have any ideas..\u003C/p\u003E\n"},{"CreatedByName":"15nelsoc","CreatedById":57328,"CreatedDateTime":"2013-11-10T01:37:27Z","Content":"\n\u003Cp\u003EThere\u0027s always foreign ones like the original drab-green Soyuz coloring:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://lh5.googleusercontent.com/-vk28Py2f3Uo/TwRRoqbiiUI/AAAAAAAAABo/Nn5_PN4Biws/soyuz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://lh5.googleusercontent.com/-vk28Py2f3Uo/TwRRoqbiiUI/AAAAAAAAABo/Nn5_PN4Biws/soyuz.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA basic untextured off-white like the Proton M:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/1/14/Proton_Zvezda_crop.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/1/14/Proton_Zvezda_crop.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAn maybe a black/dark-grey color as seen on the fairings on this Falcon 9:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.dvice.com/sites/dvice/files/styles/content_panes_media/public/images/013-F9_night_IMG_8591_640.jpg?itok=y7oGPULT\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.dvice.com/sites/dvice/files/styles/content_panes_media/public/images/013-F9_night_IMG_8591_640.jpg?itok=y7oGPULT\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI know nathankell replicated some of his textures for the tanks for procedural fairings, that would be nice. Kosmos has some ribbed one\u0027s for procedural fairings that look nice too:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24970-0-21-Kosmos-Spacecraft-Design-Bureau-Updated-%289-27-13%29?p=657132\u0026amp;viewfull=1#post657132\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/24970-0-21-Kosmos-Spacecraft-Design-Bureau-Updated-%289-27-13%29?p=657132\u0026amp;viewfull=1#post657132\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-10T07:20:58Z","Content":"\n\u003Cp\u003EYet another procedural mod! Nicely done.\u003C/p\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2013-11-10T08:32:57Z","Content":"\n\u003Cp\u003EPlease do procedural spherical tanks. And while you\u0027re at it - something that would be infinitely pretty and amazing: procedural toroidal tanks.\u003C/p\u003E\n"},{"CreatedByName":"Legwan","CreatedById":61076,"CreatedDateTime":"2013-11-10T15:19:18Z","Content":"\n\u003Cp\u003EWould like to thank you for fixing the crash problem on Linux x86_64!\u003C/p\u003E\u003Cp\u003EWorking like a charm with this release \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Firov","CreatedById":57445,"CreatedDateTime":"2013-11-10T23:02:38Z","Content":"\n\u003Cp\u003EI\u0027m experiencing a bug with this. I was trying to attach procedural SRB\u0027s to a procedural tank via the big hydraulic decouplers. Everything worked initially, but after the first launch, if I revert to the VAB the SRB\u0027s have moved away from the decouplers. They appear to be just floating in midair, though they still function as if they were directly attached. This also happens if I load a saved craft.\u003C/p\u003E\u003Cp\u003EOther then that, everything seems to work pretty well.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-11-10T23:50:40Z","Content":"\n\u003Cp\u003EI also use Talisar\u0027s spherical and toroidal tanks. It seems it creates some sort of conflict with StretchySRB, as now i cannot change the fuel type, and if i resize the tank the contents and weight are not updated. Is it related to MFS ?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-11T00:19:08Z","Content":"\n\u003Cp\u003EYou need the latest MFS 3.1. Download and install it, overwriting the version from Sphericals.\u003C/p\u003E\n"}]}