{"TopicId":52608,"ForumId":34,"TopicTitle":"[0.25] RasterPropMonitor - putting the A in your IVA (v0.18.3) [8 Oct]","CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-10T15:56:17Z","PageNum":63,"Articles":[{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-24T15:18:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EIs this what you need: \u003Ca href=\u0022https://github.com/S-C-A-N/SCANsat/commit/812d9741a0019341d7c04c89d3cc92e05995beef\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/S-C-A-N/SCANsat/commit/812d9741a0019341d7c04c89d3cc92e05995beef\u003C/a\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s what I need, though, I think we have kind of a deadlock here if you plan to keep your own version of SCANsatRPM.dll around before you embed it into SCANsat.dll. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Because \u003Ca href=\u0022https://github.com/Mihara/RasterPropMonitor/blob/master/SCANsatRPM/Properties/AssemblyInfo.cs#L12\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Mihara/RasterPropMonitor/blob/master/SCANsatRPM/Properties/AssemblyInfo.cs#L12\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-24T16:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lirvux\u0022 data-cite=\u0022lirvux\u0022\u003E\u003Cdiv\u003Ehardly a problem in linux. If you sort the directory names, system utility \u0022sort\u0022, then the order of normal...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course. However, it\u0027s all about KSP plugin loader and what it does and does not do. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-06-25T00:27:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EYeah, that\u0027s what I need, though, I think we have kind of a deadlock here if you plan to keep your own version of SCANsatRPM.dll around before you embed it into SCANsat.dll. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Because \u003Ca href=\u0022https://github.com/Mihara/RasterPropMonitor/blob/master/SCANsatRPM/Properties/AssemblyInfo.cs#L12\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Mihara/RasterPropMonitor/blob/master/SCANsatRPM/Properties/AssemblyInfo.cs#L12\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could just leave out KSPAssemblyDependency (\u0022SCANsat\u0022) from SCANsatRPM. Anyone installing it over the existing SCANsatRPM should be fine if they\u0027re using SCANsat v6.\u003C/p\u003E\u003Cp\u003EWe\u0027ll update SCANsat v6 with the new SCANsatRPM (compiled against RPM 0.17) and add in the KSPAssembly and KSPAssemblyDependency at that time. This will have to be done for SCANsat v7 anyway (the version of SCANsatRPM that works with SCANsat v6 doesn\u0027t work with SCANsat v7), so it won\u0027t really be a problem.\u003C/p\u003E\n"},{"CreatedByName":"TriV","CreatedById":113566,"CreatedDateTime":"2014-06-25T02:53:24Z","Content":"\n\u003Cp\u003ECould someone help me. I\u0027m trying to make missions only from eva view. But I do not understand how to make crew report using this mod.\u003C/p\u003E\n"},{"CreatedByName":"ThatSchadKid","CreatedById":113632,"CreatedDateTime":"2014-06-25T05:07:46Z","Content":"\n\u003Cp\u003EMy VV screen is just white and my map screens also come up white but I can\u0027t seem to figure out why. I can see the white text for them and all that but everything else is plain white. Any ideas? I can post screen shots if you want.\u003C/p\u003E\n"},{"CreatedByName":"Mandelbrot","CreatedById":112838,"CreatedDateTime":"2014-06-25T05:37:50Z","Content":"\n\u003Cp\u003ETriV, if you\u0027re using the VesselView mod, you can select parts with the tree-traversal system and do most things you can do if you right-click them from outside the ship. It is better to just get the ScienceAlert Mod though, as it will let you do science from odd situations. (If you\u0027re using a first-person E.V.A. mod, for instance, you can\u0027t right click on yourself, so this will let you do that science.) The only trouble with that is you have to turn the U.I. on, which I like to avoid now, thanks to RPM \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-25T05:41:38Z\u0022 title=\u002206/25/2014 05:41  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 25, 2014\u003C/time\u003E by Mandelbrot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-25T06:23:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThatSchadKid\u0022 data-cite=\u0022ThatSchadKid\u0022\u003E\u003Cdiv\u003EMy VV screen is just white and my map screens also come up white but I can\u0027t seem to figure out why. I can see the white text for them and all that but everything else is plain white. Any ideas? I can post screen shots if you want.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not want screenshots, they\u0027re usually not helpful. Instead, post your KSP_Data/output_log.txt file.\u003C/p\u003E\n"},{"CreatedByName":"ThatSchadKid","CreatedById":113632,"CreatedDateTime":"2014-06-25T17:53:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EI do not want screenshots, they\u0027re usually not helpful. Instead, post your KSP_Data/output_log.txt file.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/8646824/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/8646824/output_log.txt\u003C/a\u003E Here you are.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-25T20:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThatSchadKid\u0022 data-cite=\u0022ThatSchadKid\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/8646824/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/8646824/output_log.txt\u003C/a\u003E Here you are.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it\u0027s certainly not anything obvious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E But I do see several cases of \u0027interlay texture not found\u0027. What\u0027s your ActiveTextureManagement config for RPM? And in any case, try wiping the ActiveTextureManagement cache in GameData/ActiveTextureManagement/textureCache, it getting messed up can cause really bizarre errors.\u003C/p\u003E\n"},{"CreatedByName":"ThatSchadKid","CreatedById":113632,"CreatedDateTime":"2014-06-25T21:05:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EWell, it\u0027s certainly not anything obvious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E But I do see several cases of \u0027interlay texture not found\u0027. What\u0027s your ActiveTextureManagement config for RPM? And in any case, try wiping the ActiveTextureManagement cache in GameData/ActiveTextureManagement/textureCache, it getting messed up can cause really bizarre errors.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECleared the cache and reloaded with the same issues. It seems to work with other command pods, just not the ALCOR (the one I want to use of course)\u003C/p\u003E\n"},{"CreatedByName":"ThatSchadKid","CreatedById":113632,"CreatedDateTime":"2014-06-25T21:14:26Z","Content":"\n\u003Cp\u003EMy config file for JSI (Won\u0027t let me edit for some reason)\u003C/p\u003E\u003Cp\u003EACTIVE_TEXTURE_MANAGER_CONFIG\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E folder = JSI\u003C/p\u003E\u003Cp\u003E enabled = true\u003C/p\u003E\u003Cp\u003EOVERRIDES\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E JSI/RasterPropMonitor/.*\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E compress = false\u003C/p\u003E\u003Cp\u003E mipmaps = false\u003C/p\u003E\u003Cp\u003E scale = 1\u003C/p\u003E\u003Cp\u003E max_size = 0\u003C/p\u003E\u003Cp\u003E filtering = Bilinear\u003C/p\u003E\u003Cp\u003E make_not_readable = true\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E JSI/RasterPropMonitor/ExampleMFD/\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E compress = false\u003C/p\u003E\u003Cp\u003E mipmaps = false\u003C/p\u003E\u003Cp\u003E scale = 1\u003C/p\u003E\u003Cp\u003E max_size = 0\u003C/p\u003E\u003Cp\u003E filtering = Bilinear\u003C/p\u003E\u003Cp\u003E make_not_readable = true\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-25T23:32:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThatSchadKid\u0022 data-cite=\u0022ThatSchadKid\u0022\u003E\u003Cdiv\u003ECleared the cache and reloaded with the same issues. It seems to work with other command pods, just not the ALCOR (the one I want to use of course)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh.\u003C/p\u003E\u003Cp\u003EThat would imply a problem in installing ALCOR itself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Try reinstalling it?\u003C/p\u003E\n"},{"CreatedByName":"blackice504","CreatedById":75634,"CreatedDateTime":"2014-06-26T18:08:13Z","Content":"\n\u003Cp\u003EPrivet.\u003C/p\u003E\u003Cp\u003EThank you for taking the time to make this mod i fallen in love with it after 2 seconds of using it, and drooling all over my keyboard, I have an idea that you might like or you might have thought of but i will say it anyway, there is a mod maker who i think joined KSP Team aka Romfarer he made the Lazor System thing and robotic arms and a few others anyway i think the robotic arms camera plus its control added to your mod would be EPIC.\u003C/p\u003E\u003Cp\u003EThink about it siting in the cockpit switching through the menu and controlling the Canad Robotic Arm or even the light weight buran Arm.........\u003C/p\u003E\u003Cp\u003EAlso i notice the Alcor Pod allows you to pivot there Camera\u0027s i would love that to be a standard in all the cockpits for those type of camera\u0027s.\u003C/p\u003E\u003Cp\u003EHint\u0027s for other people wanting to try this mod.\u003C/p\u003E\u003Cp\u003Eb9 S2 mount camera just under the nose cone it works great for landing.\u003C/p\u003E\u003Cp\u003ECargo bay Camera is very handy.\u003C/p\u003E\u003Cp\u003EI also place a camera near the docking port comes in handy as Romfarer Docking Camera\u0027s don\u0027t show up. \u0022could be another cool plugin\u0022\u003C/p\u003E\u003Cp\u003ECamera on the back of your space plane is handy as well, if you ever taxi your space plane.\u003C/p\u003E\u003Cp\u003EThere is no other cockpit mod better then this so just download and try it.\u003C/p\u003E\u003Cp\u003EThanks Mihara for hours of fun. \u0022i wish i found this sooner\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-27T13:35:51Z","Content":"\n\u003Cp\u003EBump for... yeah, great justice, take off every ZIG.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERasterPropMonitor v0.17\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBreaking changes\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EDo NOT hurry to install this one.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EA new system for addressing resources by name is meant to future-proof RPM against mods coming up with new resources. Every resource can now be addressed as SYSR_\u0026lt;system name of resource in upper case\u0026gt;. Old names for resources are now undocumented and deprecated. They will keep working for a few more months, but in version 1.0 at the latest they will be gone.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDue the the introduction of JSITransparentPod, the example model of the MFD had to be replaced with a new one. \u003Cem\u003E(The old one has broken colliders, which cause Unity to complain profusely when it is exposed to rigors of real space.)\u003C/em\u003E The new one has identical dimensions and orientation, but has more buttons, which is likely to screw up your customization.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESince I had to introduce a new model, I reorganized the structure of the distribution to finally settle the question \u0027Mod X wants to use RPM, but it messes with the rest of my pods\u0027 for good. It is recommended that the users delete GameData/JSI/RasterPropMonitor \u003Cstrong\u003EAND\u003C/strong\u003E GameData/MechJeb2RPM completely before installing this version. Please double check your IVAs using RPM and look at the fresh Distribution Notes in the wiki.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBecause blizzy78 told me that Mu finally disclosed how KSPAssembly and KSPAssemblyDependency work, \u003Cem\u003E(why isn\u0027t this written anywhere?)\u003C/em\u003E MechJebRPM.dll no longer requires it\u0027s own separate GameData directory. So now it lives in JSI/RasterPropMonitor/Plugins where it should have been from the start.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EJust in case, the files will continue henceforth to have the AssemblyVersion number of 0.17.0.0, to facilitate things for people who hardlink to RPM instead of using the API cleanly like they should. \u003Cem\u003E(Yes, HoneyFox, that\u0027s about you.)\u003C/em\u003E The actual visible version of the DLL is kept in AssemblyFileVersion instead, and that is what will change in the future. That should further cut down on the number of incompatibilities.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA side effect of the above, the modified IndicatorPanel prop is now called IndicatorPanelRPM, and no longer attempts to install itself into every pod that ever used IndicatorPanel.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAt the request of K3|Chris, a contributor to B9 Aerospace, the patches for B9 cockpits were moved to GameData/B9_Aerospace/RPM/Patches, so be careful when installing if you want to keep your B9 cockpits with RPM monitors. In the upcoming release of B9, B9 components will natively include RPM support and overwrite these files. When this happens, the next RPM release will no longer include them.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBug fixes\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EUTSECS did not observe Kerbin time game setting. Oops.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMechJebRPM is now compiled against the latest development version of MechJeb. Since version numbering in MechJeb builds has been changed to accomodate Squad\u0027s plugin loader braindead versioning policies, this should make it possible to always use the most current version of MechJeb unless MechJeb decides to change the version number due to internal API changes. Due to API changes in MechJeb, a developer build number 254 or later is required.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESCANsatRPM is now compiled against the version of SCANsat maintained by technogeeky at \u003Ca href=\u0022https://github.com/S-C-A-N/SCANsat\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/S-C-A-N/SCANsat\u003C/a\u003E -- this should stay compatible throughout. Use the 6.0 build of SCANsat with the SCANsatRPM.dll from this package. In the foreseeable future, SCANsatRPM will be integrated into SCANsat proper, and this particular source of annoyance will be gone.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe bundled version of ModuleManager has been updated to 2.1.5.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENew features\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ENew variable ISLOADED_\u0026lt;assembly name in upper case\u0026gt; returns 1 if a specific plugin is loaded and 0 otherwise.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENew variable RPMVERSION reports the version number of RPM itself.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EStored strings. RasterPropMonitorComputer module configuration can contain a \u0027storedStrings\u0027 parameter which is a list of pipe-separated strings, accessible as variables STOREDSTRING_0, STOREDSTRING_1, etc.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EJSIActionGroupSwitch module can now be configured to actually consume resources when toggling as well as when whatever it switches is active.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EJSISelectivelyVisibleProp module permits you to make a prop that is only visible to the occupant of one specific seat, which is handy for transparent projection HUD displays.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe JSITransparentPod module will clean your pod windows just like the infamous sfr\u0027s plugin would. The drawback is that you can\u0027t see any internals within transparent pods if you are IVA. I\u0027m not sure this KSP limitation is possible to work around -- the challenge isn\u0027t that you can\u0027t see them, the challenge is that you would see double. Warning, this is still highly experimental because I keep finding new things wrong with it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAccess to pages can now be limited depending on whether a specific tech has been purchased in career mode.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENew variables: SEMIMAJORAXIS, TARGETSEMIMAJORAXIS\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA patch to add RPM into K-P0110 capsule by Ledenko is now included, up until the time Ledenko decides to make his own.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"DasBananenbrot","CreatedById":70900,"CreatedDateTime":"2014-06-27T13:41:04Z","Content":"\n\u003Cp\u003EA new update , nice \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Good to see MechJeb dev versions are now compatible \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.quickmeme.com/img/bc/bc11fad8017bea5537859c64ec345f8e6c0503ca66051b2c470c15ec852c7775.jpg\u0022 alt=\u0022bc11fad8017bea5537859c64ec345f8e6c0503ca66051b2c470c15ec852c7775.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-06-27T14:55:44Z","Content":"\n\u003Cp\u003ESWEET!!! I love this mod cant wait for the b9 to update.....COME ON .24 hurry up....but not too fast.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-27T15:27:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tidus Klein\u0022 data-cite=\u0022Tidus Klein\u0022\u003E\u003Cdiv\u003ESWEET!!! I love this mod cant wait for the b9 to update.....COME ON .24 hurry up....but not too fast.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think B9 will update before .24 ships, mind you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitalDebris","CreatedById":101515,"CreatedDateTime":"2014-06-27T19:27:30Z","Content":"\n\u003Cp\u003ECan\u0027t wait to test it out!\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-06-27T19:36:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EI don\u0027t think B9 will update before .24 ships, mind you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll try but the list of fixes, changes and new parts is very long.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-27T19:50:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EWe\u0027ll try but the list of fixes, changes and new parts is very long.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy suggestion would be to delay it to as-soon-as-possible-after-0.24-ships, anyway. There\u0027s no telling what 0.24 will break.\u003C/p\u003E\n"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2014-06-28T02:51:26Z","Content":"\n\u003Cp\u003EI\u0027m still getting this, and I\u0027m not sure why: \u003C/p\u003E\u003Cp\u003E(EDIT PWD)\u003C/p\u003E\u003Cp\u003EUgh...2nd edit. Didn\u0027t delete all old directories before installing the new update...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T02:59:47Z\u0022 title=\u002206/28/2014 02:59  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Eleven\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-06-28T03:05:57Z","Content":"\n\u003Cp\u003EGood to hear that 0.17 has been released at last, Mihara - transparent FusTek windows here we come! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nhawks17","CreatedById":32999,"CreatedDateTime":"2014-06-28T03:08:05Z","Content":"\n\u003Cp\u003EI\u0027m confused, does this break the save file or no?\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2014-06-28T06:21:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nhawks17\u0022 data-cite=\u0022Nhawks17\u0022\u003E\u003Cdiv\u003EI\u0027m confused, does this break the save file or no?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, nothing fatal should happen to your save file even if you delete RPM entirely, the only exception would be if you used the provided external camera part in that save \u003Cem\u003E(and deleted it, that is. It\u0027s been moved between 0.16 and 0.17, but the name and everything else didn\u0027t change.)\u003C/em\u003E. Which sucks, so very few people use it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T09:30:42Z\u0022 title=\u002206/28/2014 09:30  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Mihara\u003C/strong\u003E\n\u003Cbr\u003EClarifications.\n\u003C/span\u003E\n"},{"CreatedByName":"Subcidal","CreatedById":20751,"CreatedDateTime":"2014-06-28T12:15:28Z","Content":"\n\u003Cp\u003EAnyone ever had a problem of the green MFD displaying all the ladders / bars as black instead of green in open GL? Makes it impossible to see any of the ladder info in a RPM window. Though all the text around the sides are still displaying as green.\u003C/p\u003E\n"}]}