{"TopicId":52602,"ForumId":55,"TopicTitle":"Do you think rocket construction will ever \u0026quot;take time\u0026quot;?","CreatedByName":"jfjohnny5","CreatedById":64610,"CreatedDateTime":"2013-11-10T13:33:09Z","PageNum":10,"Articles":[{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2013-12-03T21:47:26Z","Content":"\n\u003Cp\u003EMy thoughts about this:\u003C/p\u003E\u003Cp\u003EIf rockets were to take time to build, i.e. a few days - if you wernt able to speed up time, I still think that the game would implement some sort of \u0022time lock\u0022 thing, were it saves the time you quit, access the time when you next opened, then took the difference from the rocket in build. I would also think that you\u0027d be able to put several rockets in for building at the same time (if you have enough money \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). This would add a fair amount of realism to the game. I would also think that you\u0027d have to hire the engineer kerbals to actually build the rocket which would cost labour and if there wernt enough kerbals to build it, it would take more time to build but if there were more kerbals, it would be built quicker. This would make you have to plan your launches and make sure you launch at the right time for the right window into the moon or planet.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-12-03T22:10:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ToTheMun\u0022 data-cite=\u0022ToTheMun\u0022\u003E\u003Cdiv\u003EMy thoughts about this:\u003Cp\u003EIf rockets were to take time to build, i.e. a few days - if you wernt able to speed up time, I still think that the game would implement some sort of \u0022time lock\u0022 thing, were it saves the time you quit, access the time when you next opened, then took the difference from the rocket in build. I would also think that you\u0027d be able to put several rockets in for building at the same time (if you have enough money \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). This would add a fair amount of realism to the game. I would also think that you\u0027d have to hire the engineer kerbals to actually build the rocket which would cost labour and if there wernt enough kerbals to build it, it would take more time to build but if there were more kerbals, it would be built quicker. This would make you have to plan your launches and make sure you launch at the right time for the right window into the moon or planet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever.\u003C/p\u003E\u003Cp\u003ENEV. ER.\u003C/p\u003E\u003Cp\u003EI can\u0027t ask my boss to postpone a meeting so I can hit that Duna launch window. Or wake up in the middle of the night lest Jeb crash into Kerbin due to not deploying his chutes.\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2013-12-03T22:22:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ENever.\u003Cp\u003ENEV. ER.\u003C/p\u003E\u003Cp\u003EI can\u0027t ask my boss to postpone a meeting so I can hit that Duna launch window. Or wake up in the middle of the night lest Jeb crash into Kerbin due to not deploying his chutes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIm not saying the actual GAMEPLAY go forward, just the building times and the \u0022time lock\u0022 thingy would only take effect if everything was in a stable orbit and such.\u003C/p\u003E\n"},{"CreatedByName":"Dwight_js","CreatedById":83255,"CreatedDateTime":"2013-12-03T23:26:57Z","Content":"\n\u003Cp\u003EI really look forward to testing this feature. I try to keep as many flights going as possible and love the time-management aspect to the game. I don\u0027t think build-time would add much challenge to transfer window planning, unless you get really, really busy with lots of concurrent missions and just space-out. I do hope that it would bring a bit more balance to how much can be accomplished during the wait time to a transfer window, or the actual interplanetary transfer itself. Currently you could send a simple probe off to Jool, and in the time it takes for the probe to arrive, do enough missions and research to develop a warp-drive, then fly a manned mission to Jool in time to watch the historic arrival of that probe.\u003C/p\u003E\u003Cp\u003E I am mostly hoping this will add a layer of complexity to station keeping, rescue-missions, and (my personal favourite, and what I\u0027m really hoping will be added) unexpected comets and errant asteroids coming through the system that will earn you mega bonus points if you manage to rendezvous with them. If simpler designs take less time to build than complex ones, then the build-time aspect along with highly time limited and unforeseen mission windows will be one of the only ways to force a well developed space program (flush with cash and resources) to build a shoe-string type ship that is barely (maybe) capable of success.\u003C/p\u003E\u003Cp\u003EOne thing to keep in mind once resources are implemented - build time delay will have to be balanced with resource depletion rate. You can\u0027t have a station run out of supplies, or have the space program go bankrupt because the resupply ships take too long to build. Player neglect or consistent mission failure should be the factors that lead to space program collapse.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-12-04T00:48:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EImagine the clamor for KAC to be put in as a stock feature is this was made stock. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehaha I can definitely see that happening XD\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EEither way, this is an exercise in role-playing that caters to a subset of players and doesn\u0027t belong in the stock game. It adds no difficulty or challenge and, if not balanced properly, becomes pure annoyance instead of immersion..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s only true if you take into account the current state of KSP\u0027s career mode. I feel like a player such as yourself wouldn\u0027t entirely like the career mode in its finished form with or without this feature. We\u0027re still not entirely sure what the career mode will be like in the end, but I can see it gaining from this feature, and in all likelihood it will. It does add a challenge, it\u0027s just an extent as to how much of a challenge depending on the balancing. Having this as a mod first will definitely help figure that balancing out, and determine for players like yourself how to remove any annoyance from it and make it as fluid as possible.\u003C/p\u003E\u003Cp\u003EReally, the whole game is about roleplaying your own space program. The clamor for more realism is very existent, and this is a simple way to add a bit more with a unique little time element that the game has yet to see; any player in career mode would quickly understand it and take it into account, adding just another little touch to their overall experience. It does add a lot more in Kerbin\u0027s SOI than the rest of the Kerbol system, which is conveniently where many average players stick to for a while before they improve enough to go see the other planets.\u003C/p\u003E\u003Cp\u003EThe last thing it should ever be is annoying, and too much of a challenge will no doubt be annoying for the average player, thus why I came up with such short build times (which are still decently long, mind you). The experienced players who want that extra challenge will get in in some way or another if this were a final feature of the game, by either changing the difficulty slider, or if there isn\u0027t one, modifying the game. Experienced players such as myself felt the tech tree in .22 was way too easy, thus people modified it to make it harder. It\u0027d be quite the same thing with this feature, I\u0027m sure. Either get balanced and easy, or challenging and difficult (and a bit more realism). Either way, both gain more immersion, even if it won\u0027t add nearly as much on the easy side.\u003C/p\u003E\u003Cp\u003EIt\u0027s funny, we\u0027ve both seemed to have taken opposite sides and not budged at all, but from my point of view, I\u0027m understanding all of your concerns quite well yet know there are ways to work around them. In the end, it\u0027ll be a matter of whether or not Squad would like to add it, if they feel that it\u0027s a missing piece in career mode. Perhaps this discussion, and my mod being brought to attention if and when Scott Manley reviews it (since he\u0027s already shown his interest), will show them that there are players that want it, that without it an instant build time is slightly immersion breaking and unrealistic, and might eventually spark them to attempt adding it. With any new feature, there will always be those who hate it. It\u0027s been seen many times through the course of development, the end goal however is Squad\u0027s vision, and a few people not liking something vs most people loving it will likely be the case as usual (so long as it doesn\u0027t ruin gameplay, which is to be determined).\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-04T01:18:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003EI feel like a player such as yourself wouldn\u0027t entirely like the career mode in its finished form with or without this feature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a feeling you\u0027re right, but only because the current suggestions for career mode break from the wonderful sandbox that makes this game so special. I\u0027m hoping SQUAD will ignore those suggestions and keep the free-form flow and whimsical nature of the game, giving us the freedom to explore and build as we want. There\u0027s certainly room for limitations and challenge within that sort of vision but they should be interactive and player-controllable limitations like an economy or the science tech tree, not rigid \u0022do missions\u0022 sort of gameplay. My biggest fear for this game is that SQUAD will wreck the game with \u0022quests\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003EIt does add a lot more in Kerbin\u0027s SOI than the rest of the Kerbol system, which is conveniently where many average players stick to for a while before they improve enough to go see the other planets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are correct in that respect. It really doesn\u0027t inhibit extraplanetary gameplay.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003EThe last thing it should ever be is annoying\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I have a problem with it. I see nothing but annoyance in the feature and I don\u0027t see any way around that. E: And you are right, if it\u0027s a terrible feature it most certainly will get modded out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T01:32:41Z\u0022 title=\u002212/04/2013 01:32  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-04T07:13:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003EI feel like a player such as yourself wouldn\u0027t entirely like the career mode in its finished form with or without this feature. \u003Cp\u003E\u0026lt;snip\u0026gt;\u003C/p\u003E\u003Cp\u003EReally, the whole game is about roleplaying your own space program. The clamor for more realism is very existent\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the overall tone of KSP is about keeping it light. Design decisions the devs have made have definitely been about keeping the game light and accessible, rather than implementing uber simulation. I actually have a lot of faith that the devs won\u0027t make KSP \u003Cem\u003Etoo\u003C/em\u003E realistic. It\u0027s a delicate balancing act, there has to be enough realism for the gameplay to have depth and not be to arcadey, but it can\u0027t have too much depth or else it\u0027ll lose it\u0027s broad appeal and lighthearted tone.\u003C/p\u003E\n"},{"CreatedByName":"Artophwar","CreatedById":65084,"CreatedDateTime":"2013-12-04T07:24:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI have a feeling you\u0027re right, but only because the current suggestions for career mode break from the wonderful sandbox that makes this game so special. I\u0027m hoping SQUAD will ignore those suggestions and keep the free-form flow and whimsical nature of the game, giving us the freedom to explore and build as we want. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have seen quotes like this in pretty much every career mode suggestion thread and it is starting to grind my gears. People keep talking as if these features are added to CAREER mode to make the game more structured all of sudden they wont have the freedom to explore and build what they want. Except there is a separate mode just for that called sandbox. Career mode should absolutely break away from it. Otherwise why even bother having separate game modes?\u003C/p\u003E\u003Cp\u003EI hope SQUAD takes this suggestion and runs with it. Right now it is rough around the edges but it is my opinion that instant build times dont belong in Career mode. There are a lot of other games out there that have build times and they have them for an in game purpose, not just to be annoying.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EI think the overall tone of KSP is about keeping it light. Design decisions the devs have made have definitely been about keeping the game light and accessible, rather than implementing uber simulation. I actually have a lot of faith that the devs won\u0027t make KSP \u003Cem\u003Etoo\u003C/em\u003E realistic. It\u0027s a delicate balancing act, there has to be enough realism for the gameplay to have depth and not be to arcadey, but it can\u0027t have too much depth or else it\u0027ll lose it\u0027s broad appeal and lighthearted tone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere have been a lot of games with light-hearted tones that have a fairly structured campaign mode and open ended play.. A lot of the old Bullfrog games for example. I am not saying that KSP needs to be ultra realistic accounting simulation. Build times and other realism suggestions like life support are not mutually exclusive from light-hearted fun. As you say it is a balancing act.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T07:33:33Z\u0022 title=\u002212/04/2013 07:33  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by Artophwar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ravener","CreatedById":44766,"CreatedDateTime":"2013-12-04T11:41:49Z","Content":"\n\u003Cp\u003Ei feel the people who are against this either dident read the idea or want career to be sandbox... career should restrict you in some ways, you should have to be ready for a mission before you embark on it. suddenly there is a reason to have contingency plans. time has value, especially when you have a dead capsule on a free return with broken parachutes. if you want a slightly realistic space sim you cant have a train of spaceships going to the mun.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T11:48:27Z\u0022 title=\u002212/04/2013 11:48  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by ravener\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-12-04T11:44:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESome new point of view :\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt might be unnecessary to impose a construction-time because ... of how we (might) finance the rockets.\u003C/p\u003E\u003Cp\u003EWe\u0027ve talked before of whether or not our Space Program should \u0022\u003Cstrong\u003EGrind mindlessly for money\u003C/strong\u003E\u0022, unsurprisingly the answer was a big \u003Cstrong\u003EHELL NO !!\u003C/strong\u003E, letting two solutions :\u003C/p\u003E\u003Cp\u003E- Fixed amount of Money being available for each launch.\u003C/p\u003E\u003Cp\u003E- Fixed Budget being available daily, monthly or else.\u003C/p\u003E\u003Cp\u003EAnybody can guess that as soon as docking-ring are unlocked, the first idea would allow to assemble an infinite amount of modular spaceship in orbit and ruin most challenges.\u003C/p\u003E\u003Cp\u003EThe \u0022Fixed Budget\u0022 idea on the other hand would naturally keep you from launching absurd numbers of satellites, or more than one gigantic rocket per month.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe problem \u003C/strong\u003E: A construction-time could keep you \u003Cstrong\u003E(frustratingly)\u003C/strong\u003E from using efficiently a fixed-budget (case of warp), without solving the problem generated by launch-money.\u003C/p\u003E\u003Cp\u003EThe solution : Let instantaneous construction as an \u0022acceptable break from reality\u0022, as the player can \u003Cstrong\u003Eretro-actively explain it\u003C/strong\u003E by \u0022\u003Cem\u003Eit was planned all along\u003C/em\u003E\u0022, \u0022\u003Cem\u003EWe just happened to launch them at the same time\u003C/em\u003E\u0022 and \u0022\u003Cem\u003EWhat ?! We stayed withing budget no ?\u003C/em\u003E\u0022.\u003C/p\u003E\u003Cp\u003EPlus I\u0027m worried about construction-time requiring further complicated balancing mechanism, like a way to upgrade construction time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI have a feeling you\u0027re right, but only because the current suggestions for career mode break from the wonderful sandbox that makes this game so special. I\u0027m hoping SQUAD will ignore those suggestions and keep the free-form flow and whimsical nature of the game, giving us the freedom to explore and build as we want. There\u0027s certainly room for limitations and challenge within that sort of vision but they should be interactive and player-controllable limitations like an economy or the science tech tree, not rigid \u0022do missions\u0022 sort of gameplay. My biggest fear for this game is that SQUAD will wreck the game with \u0022quests\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ve had our disagreement before and swore to not talk about it again, but I have to say that you are overreacting and underestimate the amount \u003Cstrong\u003EBalancing Mechanic\u003C/strong\u003E needed to make a game truly interesting.\u003C/p\u003E\n"},{"CreatedByName":"andrew2343","CreatedById":56356,"CreatedDateTime":"2013-12-04T14:20:23Z","Content":"\n\u003Cp\u003Enonono, just no. i like to make experimental rockets and planes with weird and fun shapes, and most of them dont fly, so i have to improve them. and im certainly not the only one. waiting a bunch of time before i can launch it only to find out it doesent fly.... no. just no. if they ever implement this at least not on sandbox mode and also make it a toggleable option. if it is really annoying you then roleplay it. make a ship, save it and after 3 days or so launch it.\u003C/p\u003E\n"},{"CreatedByName":"horndgmium","CreatedById":92543,"CreatedDateTime":"2013-12-04T14:27:51Z","Content":"\n\u003Cp\u003EI just realized... there\u0027s not really a point to waiting since we have time warp. UNLESS your launch window is coming up soon. \u003C/p\u003E\u003Cp\u003EThat also means you have to figure out your launch window.\u003C/p\u003E\u003Cp\u003EThis won\u0027t really involve you waiting to launch because we have time warp, it will involve you maybe missing your ideal delta-V minimizing launch window if you add too much stuff to your rocket.\u003C/p\u003E\u003Cp\u003EPEOPLE THIS IS NOT FOR SANDBOX.\u003C/p\u003E\u003Cp\u003ETL;DR: good idea because you have to think a little more.\u003C/p\u003E\u003Cp\u003EYou build a ship, say you want to launch it, maybe design some more ships while you\u0027re waiting for the launch, or manage other career aspects that might be added in the future, and then pilot your ship to space. This will keep you from building ships that barely make it to orbit, because why would you do that in the first place?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T14:33:43Z\u0022 title=\u002212/04/2013 02:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by horndgmium\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-04T14:28:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrew2343\u0022 data-cite=\u0022andrew2343\u0022\u003E\u003Cdiv\u003Eif it is really annoying you then roleplay it. make a ship, save it and after 3 days or so launch it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA nice simple solution.\u003C/p\u003E\u003Cp\u003E[/thread]\u003C/p\u003E\n"},{"CreatedByName":"Superfish57","CreatedById":69214,"CreatedDateTime":"2013-12-04T14:49:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EA nice simple solution.\u003Cp\u003E[/thread]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI personally don\u0027t think that is a good solution. It\u0027s one of the things you can\u0027t just role-play well. Think about all the people who want a second gas giant, I could just say role-play it to them too. But that would be nowhere near a solution. That\u0027s just my two cents though.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-04T15:48:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superfish57\u0022 data-cite=\u0022Superfish57\u0022\u003E\u003Cdiv\u003EI personally don\u0027t think that is a good solution. It\u0027s one of the things you can\u0027t just role-play well. Think about all the people who want a second gas giant, I could just say role-play it to them too. But that would be nowhere near a solution. That\u0027s just my two cents though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept that a second gas giant is actually a planned feature. If they wait a bit they\u0027ll get what they want.\u003C/p\u003E\u003Cp\u003EHow is waiting for a self-imposed construction date any different from waiting for a launch window? Doesn\u0027t seem like it\u0027d be any trouble to role-play at all.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-04T16:12:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Artophwar\u0022 data-cite=\u0022Artophwar\u0022\u003E\u003Cdiv\u003EI have seen quotes like this in pretty much every career mode suggestion thread and it is starting to grind my gears.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know what grinds my gears? People who cut off a quote for brevity and leave out the important points.\u003C/p\u003E\u003Cp\u003EI actually have a lot of faith in SQUAD\u0027s vision for career mode right now; I think their contract system will be more free-form than a lot of people think/want and will retain the sandbox feeling we have right now in career mode. If it doesn\u0027t, then there\u0027s always telling them they did a terrible job and modding sandbox mode to make an economic system that works better.\u003C/p\u003E\u003Cp\u003EAs far as this proposed feature, I\u0027ve pretty much settled on it being nothing more than annoyance. It\u0027s not going to affect the game for a lot of people, it\u0027ll just be something that\u0027s there, a little bit of extra waiting or planning, something that\u0027ll require KAC, a similar stock feature, or a spreadsheet in order to play. It\u0027s not going to provide any extra challenge until SQUAD adds additional time-sensitive mechanics like life support, and even then it\u0027ll be trivial.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-04T18:06:24Z","Content":"\n\u003Cp\u003EAnd I\u0027ve settled with the idea that this feature won\u0027t even be noticeable by new players, nor in the begin of the carreer, and that the fact your ship is not instantly built will matter more when you start building big ships for complicated missions, which already requires a knowledge from the player.\u003C/p\u003E\u003Cp\u003EIt would add realism without affecting people who are new to the game more than just a Von Kerman hint at the screen, but will add a lot of immersion and planning to experienced players, like us.\u003C/p\u003E\u003Cp\u003EA new player doesn\u0027t start by building a massive rocket, and the budget, be it fixed or awarded, also limits that. This would automatically decrease the importance of the feature at the early stages of the game, as mentioned above.\u003C/p\u003E\u003Cp\u003EA new player won\u0027t bother sending a rescue ship that early in the game either, and that is the only thing that could possibly affect their gameplay this much.\u003C/p\u003E\u003Cp\u003EAs for experienced players, keeping fallback ships and \u0022ready to go\u0022 resource cluster at a space station requires planning and a kind of management this game does not offer yet, and I don\u0027t belive it can go deeper at the management aspect without this essential feature, which also adds realism.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-12-04T18:45:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrew2343\u0022 data-cite=\u0022andrew2343\u0022\u003E\u003Cdiv\u003Enonono, just no. i like to make experimental rockets and planes with weird and fun shapes, and most of them dont fly, so i have to improve them. and im certainly not the only one. waiting a bunch of time before i can launch it only to find out it doesent fly.... no. just no. if they ever implement this at least not on sandbox mode and also make it a toggleable option. if it is really annoying you then roleplay it. make a ship, save it and after 3 days or so launch it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, that\u0027s something we\u0027ve already figured out. Heck, Squad already figured it out by adding the \u0022Revert to VAB/SPH\u0022 option. Unless you\u0027re the type who follows every failed launch all the way through, it won\u0027t be a problem. If you are the type who does that, and likes to have experimental designs, then that would actually add even more to the game. Think of all the experimental planes and rockets that the Air Force and NASA threw out during the course of high altitude testing, breaking the sound barrier, developing rockets to get us to the Moon... They didn\u0027t churn those out instantly, one after the other, although they did have a lot of different ones going at the same time I\u0027m sure. So, if you like experimentals, have several building at once so you can test them on a regular basis. That is, if career mode allows that for you.\u003C/p\u003E\u003Cp\u003EWhich brings me to my next point; we\u0027re not sure if career mode will allow for so much experimentation, but if it doesn\u0027t, then that won\u0027t be the point of it. I\u0027m not sure how well that will work with inexperienced players, who pretty much need to experiment a lot in order to learn what will make it into orbit and what won\u0027t. For now, we just can\u0027t say, but in the end, whether it\u0027s in the final game or stuck to the confines of my mod, this feature will be balanced accordingly to avoid the frustrations that you\u0027re concerned about. And trust me, even I like to play around and build stupid rockets that I know won\u0027t work, but I like to keep those in sandbox in the first place, separate from my roleplay-style career mode.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-04T19:06:48Z","Content":"\n\u003Cp\u003EJust want to make a quick point about the timewarp factor of a semi realistic sim.\u003C/p\u003E\u003Cp\u003EIf we wait for ships to get built you\u0027re also paying wages of all the scientists and kerbonauts, rent, heating and electric etc. If you have too many scientists or willing victims then your monies will go down so excessive warping won\u0027t work. Just an idea.\u003C/p\u003E\u003Cp\u003EI reckon there\u0027s a lot to running a space program and picking a few, choice extra bits to flesh out the \u0027game\u0027 aspect of the game is a great idea. Have some life support, have some satellite relay requirements, go nuts with budgets and time constraints, if it gets in then I\u0027m pretty sure creating a menu option to remove any bits you don\u0027t want wouldn\u0027t be rocket science.\u003C/p\u003E\u003Cp\u003EFor this save I shall have:\u003C/p\u003E\u003Cp\u003ESatellite relays required\u003C/p\u003E\u003Cp\u003EDeadly Re-entry\u003C/p\u003E\u003Cp\u003ELife support\u003C/p\u003E\u003Cp\u003EBudgeting \u003C/p\u003E\u003Cp\u003EFor this save I shall just tick:\u003C/p\u003E\u003Cp\u003ELife support\u003C/p\u003E\u003Cp\u003EAnd here we have my sandbox game...\u003C/p\u003E\u003Cp\u003EBadda-Boom-Badda-Bing!\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-04T19:24:12Z","Content":"\n\u003Cp\u003Eyou would probably also be abble to modify the ship which is being built\u003C/p\u003E\u003Cp\u003Eso if you remember you forgot to add an antenna or something, that would only add a small ammount of extra time it takes to be built\u003C/p\u003E\u003Cp\u003Eof course that should be limited to small things, say a limit 6 or 12 hours postpone, so you cannot make a lander and create the lifter while the lander is already in progress\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-12-04T19:24:50Z","Content":"\n\u003Cp\u003E@Monkey: That\u0027s pretty much the point of mods in the first place! There shouldn\u0027t be a laundry list of features you want or don\u0027t want each time you start a new career. Squad is making a game that\u0027s accessible to everyone, is fun to play, but also follows their vision. I believe they stated that deadly reentry was something they wouldn\u0027t implement (or at least not currently), and there\u0027s a perfectly functioning mod that takes care of that. We can all argue for or against it being in the final game, but it\u0027s down to them to determine if it fits their vision. I feel that construction time would be a good simple thing to add that has space program elements, but won\u0027t annoy every player or be hard to balance. There\u0027s still the matter of whether they feel like the time to implement it would be worth what it adds to the game, so who knows.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t really feel like the management side of career mode is gonna go as deep as having wages... XD\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003Eyou would probably also be able to modify the ship which is being built\u003Cp\u003Eso if you remember you forgot to add an antenna or something, that would only add a small amount of extra time it takes to be built\u003C/p\u003E\u003Cp\u003Eof course that should be limited to small things, say a limit 6 or 12 hours postpone, so you cannot make a lander and create the lifter while the lander is already in progress\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s something I\u0027m planning on doing, I think it\u0027s a great way to deal with those kinds of situations where you just plain forget lol. I\u0027m not sure about the whole lander/lifter thing though, but imo if a player decides to edit their craft that much, then it\u0027ll just tack on the required build time for the new pieces.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T19:28:50Z\u0022 title=\u002212/04/2013 07:28  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by Ekku Zakku\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-04T19:34:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ekku Zakku\u0022 data-cite=\u0022Ekku Zakku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, I don\u0027t really feel like the management side of career mode is gonna go as deep as having wages... XD\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut there has to be a downside to just hiring everyone that comes through the door.\u003C/p\u003E\n"},{"CreatedByName":"Ekku Zakku","CreatedById":34696,"CreatedDateTime":"2013-12-04T20:06:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monkeh\u0022 data-cite=\u0022Monkeh\u0022\u003E\u003Cdiv\u003EBut there has to be a downside to just hiring everyone that comes through the door.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I just don\u0027t think it\u0027ll be relevant to time. Dealing with astronaut wages is getting way more into a management game than construction time does.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-04T20:51:15Z","Content":"\n\u003Cp\u003Eit will be up to you if you want to take high risk/high budget missions or keep a low profile\u003C/p\u003E\u003Cp\u003Ekeeping a low profile would be the recommended approach for new players, and should not make hiring a few more astronauts than needed an issue\u003C/p\u003E\u003Cp\u003Ethe recruits might not be unlimited either, not allowing you to go bankrupt by spam recruiting\u003C/p\u003E\n"}]}