{"TopicId":52727,"ForumId":16,"TopicTitle":"Shuttles completely escape me...","CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-11-11T17:28:15Z","PageNum":1,"Articles":[{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-11-11T17:28:15Z","Content":"\n\u003Cp\u003EAnd sometimes literally, too...\u003C/p\u003E\u003Cp\u003ESo I\u0027ve figured how to get to orbit- most of the time.\u003C/p\u003E\u003Cp\u003EI\u0027ve figured how to dock- most of the time.\u003C/p\u003E\u003Cp\u003EI\u0027ve figured how to escape Kerbin and go to other planets- most of the time.\u003C/p\u003E\u003Cp\u003ESo I decided that my method of sending up pods then splashing them down every time I wanted to do something to my space station was incredibly wasteful. The solution? A shuttle program!\u003C/p\u003E\u003Cp\u003Ehooooboooy. Nope. I can\u0027t get these things off the ground. I can\u0027t design them worth a damn. If I go for the \u0027Traditional\u0027 design- sticking off the end of a fuel tank- they flip like crazy. If I stick them at the top of a large rocket, they also flip like crazy at the slightest attempt at course correction.\u003C/p\u003E\u003Cp\u003E... How the hell do you guys -get- these things in orbit?\u003C/p\u003E\n"},{"CreatedByName":"toomuchbrew","CreatedById":57346,"CreatedDateTime":"2013-11-11T17:35:46Z","Content":"\n\u003Cp\u003EYea. This is one I tried to tackle when I first started KSP. I haven\u0027t attempted it since. You\u0027d need to get the CoM and CoT right for the first 80% of the ascent. You need well placed control surfaces, engines with a based vectored thrust and then it is possible. I imagine you would need closer to 5k dV due to drag and steering losses. Check you tube. I know someone had done it.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-11-11T17:38:10Z","Content":"\n\u003Cp\u003EAre you getting the centre of mass, centre of lift and centre of thrust all arranged right? \u003C/p\u003E\u003Cp\u003EI find vertical launched shuttles with a rocket or fuel tank the hardest thing to do. Having space planes that take off from the runway is a bit easier. \u003C/p\u003E\u003Cp\u003EThe tips I\u0027ve had are, have the centre of lift just behind the centre of mass, that works well. And centre of thrust obviously has to line up with centre of mass, this can really mess you up if they don\u0027t line up.\u003C/p\u003E\n"},{"CreatedByName":"luchelibre","CreatedById":61140,"CreatedDateTime":"2013-11-11T17:38:46Z","Content":"\n\u003Cp\u003EWhile I don\u0027t claim to know what I\u0027m talking about, the most basic necessity is to angle the shuttle engines so they thrust through the center of mass. Also be sure and do your roll early so what lift the wings generate pulls you backward in the direction you want to do your gravity turn.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-11T17:47:13Z","Content":"\n\u003Cp\u003EI think a rocket-launched shuttle is harder than a spaceplane. Have you tried building an SSTO yet? It\u0027s challenging, but doable. \u003C/p\u003E\u003Cp\u003EAlso, I think it would be easier to do with FAR installed-- realistic aerodynamics would make a ksp shuttle more feasible. At least, I think so-- haven\u0027t tried it myself.\u003C/p\u003E\n"},{"CreatedByName":"Tarrow","CreatedById":33293,"CreatedDateTime":"2013-11-11T17:52:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E... How the hell do you guys -get- these things in orbit?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAction groups and a couple of sets of the radial mounted engines (to produce offset thrust on the orbiter) did the trick for me when I tried. I\u0027ve only done it small-scale though. On this one there\u0027s an engineless central underslung fuel tank (mimicing the shuttle external fuel tank) and a pair of liquid boosters (replacing the shuttle-style SRBs) - mechjeb was handling the basic ascent whilst I was dancing through action groups stopping it flipping. That little semicircle of radial engines at the back of the orbiter was what was used (in groups) for stability during launch and ascent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i110.photobucket.com/albums/n92/tychocaine/KSP/screenshot14-1_zps27300075.png\u0022 alt=\u0022screenshot14-1_zps27300075.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eedit - balancing them for CoM / CoT throughout the whole takeoff is almost (if not completely) impossible. CoM \u0026amp; CoT change too much during flight to compensate for using engine gimballing alone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-11T17:56:01Z\u0022 title=\u002211/11/2013 05:56  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 11, 2013\u003C/time\u003E by Tarrow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-11-11T18:14:36Z","Content":"\n\u003Cp\u003EIt\u0027s all about the CoT and CoM. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWatch TheWinterOwl\u0027s shuttle videos.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-11-11T18:31:38Z","Content":"\n\u003Cp\u003EStep 1) design a shuttle that actually flies on its own.\u003C/p\u003E\u003Cp\u003EExample: \u003Cimg src=\u0022http://i428.photobucket.com/albums/qq9/BubbaWilkins/screenshot11_zps4766c1ad.png\u0022 alt=\u0022screenshot11_zps4766c1ad.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 2) Slap some tanks and boosters on it!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i428.photobucket.com/albums/qq9/BubbaWilkins/screenshot13_zps95f92196.png\u0022 alt=\u0022screenshot13_zps95f92196.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAsymmetrical designs are much tougher, but still doable.\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-11-11T21:50:10Z","Content":"\n\u003Cp\u003EAnother option: Truckloads of reaction wheels \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2013-11-11T22:12:33Z","Content":"\n\u003Cp\u003EIf shifting CoM is one of your main issues and you\u0027re not opposed to using mods I\u0027ve found TAC\u0027s fuel balancer mod invaluable to my VTOLS or spaceplanes that aren\u0027t designed nicely enough. It\u0027s up to you but it certainly makes the job easier!\u003C/p\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-11-12T04:10:55Z","Content":"\n\u003Cp\u003EAright. Either there\u0027s some physics lesson I don\u0027t get, or I\u0027m incompetent. I\u0027m declaring shuttles impossible. \u003C/p\u003E\u003Cp\u003EXD seriously, I can\u0027t design anything that doesn\u0027t play \u0027let\u0027s find the ground with the nose.\u0027 \u003C/p\u003E\u003Cp\u003EThough I have to ask. If anyone has any reliable design- I\u0027ll use any mod you want, save the CSS mod- could you post one to see what I\u0027m doing so wrong? x.x\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-11-12T04:49:32Z","Content":"\n\u003Cp\u003EScott Manley did a guide recently (watch the earlier segments if necessary, this is part 3)\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UUxzC4EngIsMrPmbm6Nxvb-A\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"soranno","CreatedById":58351,"CreatedDateTime":"2013-11-12T09:18:46Z","Content":"\n\u003Cp\u003EI too had wanted to make , not necessarily reminiscent of the shuttle, but something to make a vertical take off, and a runway landing. Many times tried and failed. Most of the time due to trying to use infernal robotics to provide the extra gimbal needed to offset the external tank, due to an aversion to just having one tank on either side and balancing the externals. I got over that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERecently I made a renewed effort, with the goal of making a craft to carry science modules to and from space in an internal space, making a runway landing on its return.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EtV5F\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI never had too many shifting COM issues with this one, as the fuselage towards the front contained liquid fuel for jet engines that I could shift to the rear upon landing.. so I could get through the atmosphere alright.\u003C/p\u003E\u003Cp\u003ELanding however was an impossible task. the craft just had no lift, and it was in the attempt to pull up before landing that it would flip out. Not really surprising, as it was a pretty drastic maneuver considering I was descending at probably 40 degrees below horizontal. Any attempt to pull up just flipped it.\u003C/p\u003E\u003Cp\u003ESo I made the wings significantly longer, and added additional lifting surfaces on the underside of the craft until eventually on one attempted landing it showed signs of actually having lift and some manner of glide profile.\u003C/p\u003E\u003Cp\u003EOn that occasion I managed to get it down safely for the first ever time! But I realised then that my decided effort to avoid putting jets on it, and just gliding to landing, was holding me back. \u003C/p\u003E\u003Cp\u003EOn the final version, as in those images, it has 2 jet engines, 3 t30s and 1 t45, and each external tanks has a skipper. Previously it had two 45s instead of jets, and a skipper of its own at the rear instead of that cluster \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EStraight up ascent, and at about 16km shut off jets and drop the external skippers, the shuttle\u0060s engines take it the rest of the way up. t30s are disabled later and the 45 stabilises the orbit. It also has 4 radial engines on rotating mounts to be used as descent engines, as I used to think I needed them to get through deadly reentry heat, but my last descent I didn\u0060t even use them and came through the heat without any problem.\u003C/p\u003E\u003Cp\u003EThis was the first time I decided to drop engines off external tanks while keeping the tanks in place, and I am very happy with the results!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T09:21:32Z\u0022 title=\u002211/12/2013 09:21  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by soranno\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-12T09:48:55Z","Content":"\n\u003Cp\u003EI have spent few weeks in the hangar. Building planes to run around Kerbin, VTOL also, didn\u0027t went for space shuttles yet. So have a bit experience to get of the ground and in to it.\u003C/p\u003E\u003Cp\u003E- The main thing is to keep lifting vector a bit in front of the mass and you will be able to get of the ground.\u003C/p\u003E\u003Cp\u003E- It will be easier to build a plane with winglets on the nose (but not so nice).\u003C/p\u003E\u003Cp\u003E- Rotate wings. The real planes does not have simple direct wings. Tilting them up will prevent the plane from sliding on rotation. Tilting wings front up will increase its lifting drastically.\u003C/p\u003E\u003Cp\u003E- And the other main thing to not forget - the fuel runs out and mass center changes.\u003C/p\u003E\n"},{"CreatedByName":"MisterFister","CreatedById":85686,"CreatedDateTime":"2014-01-02T03:12:35Z","Content":"\n\u003Cp\u003ETheWinterOwl has a pretty in-depth and entertaining video series on how to design VT/HL shuttles, culminating in a trily brilliant and beautiful design he dubs the Roc. I\u0027ve downloaded and flown it in .22, and it flies beautifully. I even managed to tweak it (mostly moving fuel around)so that I could runway launch it as well with a payload, and to allow for a payloaded landing (his original design assumes an empty landing, which I can respect.) My own tweaking efforts on his design were of mixed results.\u003C/p\u003E\u003Cp\u003EHe then used his Roc design on a live mission in his Mission Controller video series, with stunningly hilarious results. (Spoiler: The mission fails spectacularly with his shuttle disintegrating into a debris cloud within sight of KSC, but this was due to flight stresses that resulted from a Mach 5 banked turn in atmospheric flight while also running 4x hardware time compression. Without the high speed bank, or alternatively without the time compression unwittingly left on, I am convinced that he\u0027d have made a soft touchdown on the runway with room to spare.)\u003C/p\u003E\n"},{"CreatedByName":"dRuPpI","CreatedById":97229,"CreatedDateTime":"2014-01-02T03:18:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003EAnd sometimes literally, too...\u003Cp\u003ESo I\u0027ve figured how to get to orbit- most of the time.\u003C/p\u003E\u003Cp\u003EI\u0027ve figured how to dock- most of the time.\u003C/p\u003E\u003Cp\u003EI\u0027ve figured how to escape Kerbin and go to other planets- most of the time.\u003C/p\u003E\u003Cp\u003ESo I decided that my method of sending up pods then splashing them down every time I wanted to do something to my space station was incredibly wasteful. The solution? A shuttle program!\u003C/p\u003E\u003Cp\u003Ehooooboooy. Nope. I can\u0027t get these things off the ground. I can\u0027t design them worth a damn. If I go for the \u0027Traditional\u0027 design- sticking off the end of a fuel tank- they flip like crazy. If I stick them at the top of a large rocket, they also flip like crazy at the slightest attempt at course correction.\u003C/p\u003E\u003Cp\u003E... How the hell do you guys -get- these things in orbit?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elook here :\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/bc178PPRwy0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"}]}