{"TopicId":52779,"ForumId":55,"TopicTitle":"What ARE rings?","CreatedByName":"uxuser","CreatedById":92549,"CreatedDateTime":"2013-11-12T00:41:17Z","PageNum":1,"Articles":[{"CreatedByName":"uxuser","CreatedById":92549,"CreatedDateTime":"2013-11-12T00:41:17Z","Content":"\n\u003Cp\u003EI was on the wiki and I wanted to look at Jool, Now, I didn\u0027t know this but I spelled Jool, Gool. Now I started and I saw in the list, Gas Planet 2! So I clicked on it and I saw it would have rings! Now I just watched Ender\u0027s Game, And the rings were like, A really icy, oblate planet! (Without a center orbiting this blue gas giant) So I thought about Ksp and I think you should actually be able to land on it, it would only have a like, .2 of Kerbin\u0027s gravity or something so it has like, No gravity! So yeah this would be cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E . Also, This is my first post and please don\u0027t be hurtful. Thanks! Be cool! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T00:49:02Z\u0022 title=\u002211/12/2013 12:49  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by uxuser\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-11-12T00:54:08Z","Content":"\n\u003Cp\u003ELike Saturn. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-11-12T00:55:59Z","Content":"\n\u003Cp\u003EWell, Gas planets don\u0027t have a surface. Think of a gas planet as a planet entirely made of clouds, No land at all. Welcome to the forum!\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-11-12T01:09:36Z","Content":"\n\u003Cp\u003ERings in the real world are typically a great many tiny pieces, made up of rock and/or ice among various other things.\u003C/p\u003E\u003Cp\u003EA \u0022solid\u0022 ring is, to the best of my knowledge, not actually possible. A solid mass like that would be inherently unstable as far as I can reasonably take a guess at this early in the morning. There would be constant stress forces on the ring in all directions due to the gravity, and the shear forces caused at pretty much all angles should cause a mass like that to disintegrate -- and that\u0027s ignoring the impossibility of it ever even forming in the first place. In order to be even remotely stable, the ring would have to be perfectly balanced in every way, and spinning at extremely high speed, I would think. The slightest instability would cause it to disintegrate, at the very least, due to a difference in the gravitational force from the planet on certain sections of the rings.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-11-12T01:34:36Z","Content":"\n\u003Cp\u003Ea KSP ring could be just like a lot of scatter, but in orbit\u003C/p\u003E\u003Cp\u003Eidk if there is any need for it to be collideable\u003C/p\u003E\u003Cp\u003Eso, no physics for it, they would be just on rails graphics, and our gpus arent doing much on ksp atm\u003C/p\u003E\u003Cp\u003Ethere is no problem in spamming asteroids as scatter into a ring shape\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2013-11-12T04:07:25Z","Content":"\n\u003Cp\u003Ei would think that they could be physical collidable masses, but would not register a gravity per say. i think if they were implemented like that though they should add a spiked landing gear that locks you into the ground sort of, for probes or what not.\u003C/p\u003E\u003Cp\u003Eof course they would all be locked in their orbits no movement reletive to eachother\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T04:35:57Z\u0022 title=\u002211/12/2013 04:35  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003Cbr\u003EMerged posts.\n\u003C/span\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-11-12T12:36:44Z","Content":"\n\u003Cp\u003Evexx is right - a ring of any thickness lateral to the planet would have extremely strong tidal forces acting on it which would very quickly tear it apart, if it could even form in the first place. Something like the Halo in...Halo...would actually work better as it is thin in depth, and so the gravity gradient between the furthest point and the closest point is far lower. Obviously constructing something like that is unfeasible for any of us, but the theory is sound.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-12T12:46:36Z","Content":"\n\u003Cp\u003EModelling a ring truly accurately as millions of separate individual bits of rock and dust each orbiting on its own would kill any home PC\u0027s CPU. You\u0027d need a supercomputer to do it.\u003C/p\u003E\u003Cp\u003EBUT there\u0027s a few tricks that might work to get a thing sort of like a real ring but with some realism removed to make it calculable:\u003C/p\u003E\u003Cp\u003E1 - Make it a single solid object in the game engine. Granted a real world solid ring would be orbitally unstable and fall in (thus why Larry Niven had to write a sequel to Ringworld after fans told him he got it wrong, and his sequel includes the discovery that the ring has a system of rockets to provide station-keeping thrust for the ring to hold it in its unstable equilibrium, and the breakdown of that system was the main plot of the book). But in KSP since planets and moons always move \u0022on rails\u0022 instead of using moment-by-moment stepwise calculations, SQUAD could design an on-rails equation for the ring\u0027s motion that just utterly defies physics and keeps the ring there.\u003C/p\u003E\u003Cp\u003E2 - With the ring being a single on-rails object orbiting the planet, the painted texture on the object could contain a lot of transparency in it allowing you to see through the ring.\u003C/p\u003E\u003Cp\u003E3 - To make the ring permeable so things can fly through it but will encounter dust as they do so, it\u0027s interior could be modeled as an \u0022atmosphere\u0022 with drag. The painted texture could show a lot of specs of objects, or the scatter system could be used to show lots of rocks, but the actual slowdown isn\u0027t provided by colliding with the rocks. It\u0027s provided by the \u0022atmosphere\u0022 drag. Here and there a few real rocks could be in the midst of the dust as separate orbiting objects.\u003C/p\u003E\u003Cp\u003E4 - Alternatively, the ring could be \u0022painted\u0022 with a patchwork of millions of \u0022solid\u0022 and \u0022not solid\u0022 sections and you have to pass through the \u0022not solid\u0022 parts to make it through.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-12T16:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EModelling a ring truly accurately as millions of separate individual bits of rock and dust each orbiting on its own would kill any home PC\u0027s CPU. You\u0027d need a supercomputer to do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELets say, we want ring made from touchable and collidable pieces of rock/ice. You dont have to render all rocks that are parts of the ring. \u003C/p\u003E\u003Cp\u003EOn some distance, player woudl see just see single ring object covered by texture. And if player gets closer, game starts to randomly generate rocks that can be interacted with and that bounce from each other. If player mooves away from ring, generated ring objects are discarded. Of cource around rings, warp would work same as with atmosphere.\u003C/p\u003E\u003Cp\u003EStill, i dont know if generating only visible part of such the ring woudl be possible on home pc.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-11-12T16:07:00Z","Content":"\n\u003Cp\u003EImagine having a 50 part space ship, or even a 20 part probe in orbit around saturn. Then imagine that you have 1.5million 1 piece spaceships/rocks within 2.5km of your position.\u003C/p\u003E\u003Cp\u003EImagine having to buy a new motherboard.\u003C/p\u003E\u003Cp\u003EAnything less and people will complain it\u0027s not a proper ring. Make them too big people will complain it\u0027s not granular enough, make them too small people will complain they can\u0027t interact with it. Make it too busy and people will complain they crash into it too often.\u003C/p\u003E\u003Cp\u003EThe problem is that even after surmounting the technological issues with having rings, there\u0027s a ton of other issues which the devs will have to look into. It\u0027ll be interesting to see how they approach it.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-12T16:08:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOn some distance, player woudl see just see single ring object covered by texture. And if player gets closer, game starts to randomly generate rocks that can be interacted with and that bounce from each other.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s also a really good solution. Basically, use the 2.5km \u0022full physics\u0022 limit. The ring is a non-colliding picture only. Just a see-through translucent texture on a harmless object, but when you\u0027re in it, scatter rocks start being generated within the 2.5km physics range around you, and as they pass far enough away and go \u0022on rails\u0022, they actually just disappear entirely.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-12T16:17:14Z","Content":"\n\u003Cp\u003EI think they will just make it impossible to approach ring on distance allowing to see indyvidual objects.. Fast mooving particles woudl be just destroying ship. Its easiest way.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-12T16:42:04Z","Content":"\n\u003Cp\u003EMaterial of Saturn\u0027s rings is so sparse that if you flew through it, you\u0027d probably not collide with anything. This was already tested with the Cassini probe which flew through one of the ring\u0027s gaps, which - you should notice - is not a place where there is no ring, just a place where the ring material is more sparse than elsewhere. Anyway - the size of the ring is enormous, the distance between innermost and outermost rings is more than distance from Earth to Moon, while mass of the rings is about a thousandth of mass of the Moon.\u003C/p\u003E\u003Cp\u003EThe ring from close up is a bit like a cloud - you can see clouds in crisp contours in the sky, but when you get close its contours become fuzzy and you can\u0027t tell where in space there is cloud and where it is not. Clouds are also made of thousands cubic meters of water but you don\u0027t become any significantly wetter by passing through a cloud.\u003C/p\u003E\u003Cp\u003ESo to get a reasonably realistic representation of a ring in the game it would suffice to have a somewhat translucent bitmap ring for views from afar and a slightly blurred line for when you\u0027re inside the ring or looking at it edge-on. No flying stones necessary.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T16:45:43Z\u0022 title=\u002211/12/2013 04:45  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-12T16:44:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EMaterial of Saturn\u0027s rings is so sparse that if you flew through it, you\u0027d probably not collide with anything. This was already tested with the Cassini probe which flew through one of the ring\u0027s gaps, which - you should notice - is not a place where there is no ring, just a place where the ring material is more sparse than elsewhere. Anyway - the size of the ring is enormous, the distance between innermost and outermost rings is more than distance from Earth to Moon, while mass of the rings is way less than mass of the Moon.\u003Cp\u003EThe ring from close up is a bit like a cloud - you can see clouds in crisp contours in the sky, but when you get close its contours become fuzzy and you can\u0027t tell where in space there is cloud and where it is not. Clouds are also made of thousands cubic meters of water but you don\u0027t become any significantly wetter by passing through a cloud.\u003C/p\u003E\u003Cp\u003ESo to get a reasonably realistic representation of a ring in the game it would suffice to have a somewhat translucent bitmap ring for views from afar and a slightly blurred line for when you\u0027re inside the ring or looking at it edge-on. No flying stones necessary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr just a few stones. Sparse enough that you are likely to make it through, but not certain so you still need to keep your eyes open and watch out and perhaps deflect a little bit.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-12T16:47:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EOr just a few stones. Sparse enough that you are likely to make it through, but not certain so you still need to keep your eyes open and watch out and perhaps deflect a little bit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr maybe an equivalent of ground scatter, just placed in space.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-12T16:51:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EI think they will just make it impossible to approach ring on distance allowing to see indyvidual objects.. Fast mooving particles woudl be just destroying ship. Its easiest way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhether the particles are fast moving or not (relative to the craft) depends on how gently you enter the ring (wow that really sounds bad). It shouldn\u0027t just automatically destroy the craft to be in the ring if you entered it at a relative velocity difference of only a few meters per second. For example, you might be in an orbit that is at the same altitude as the ring, but inclined by 0.5 degrees from it. As you pass by the ascending and descending nodes you\u0027d drift through the ring, but not at high speed relative to the material of the ring. You and the dust of the ring are both moving at nearly the same orbital velocity, just half a degree off in direction. Similarly if you\u0027d been orbiting at just a little bit higher than the ring and slow down a bit to bring your periapsis inside the ring, you\u0027re not necessarily encountering the ring\u0027s dust at high velocity.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-12T16:53:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOr maybe an equivalent of ground scatter, just placed in space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a suggestion people have made in this thread. Do it like ground scatter, but make the rocks collidable instead of pass-through. Then getting it right becomes just a matter of finding the right setting for the density so it\u0027s sparse enough.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-12T17:00:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EMaterial of Saturn\u0027s rings is so sparse that if you flew through it, you\u0027d probably not collide with anything. This was already tested with the Cassini probe which flew through one of the ring\u0027s gaps, which - you should notice - is not a place where there is no ring, just a place where the ring material is more sparse than elsewhere. Anyway - the size of the ring is enormous, the distance between innermost and outermost rings is more than distance from Earth to Moon, while mass of the rings is about a thousandth of mass of the Moon.\u003Cp\u003EThe ring from close up is a bit like a cloud - you can see clouds in crisp contours in the sky, but when you get close its contours become fuzzy and you can\u0027t tell where in space there is cloud and where it is not. Clouds are also made of thousands cubic meters of water but you don\u0027t become any significantly wetter by passing through a cloud.\u003C/p\u003E\u003Cp\u003ESo to get a reasonably realistic representation of a ring in the game it would suffice to have a somewhat translucent bitmap ring for views from afar and a slightly blurred line for when you\u0027re inside the ring or looking at it edge-on. No flying stones necessary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo.. no giant rocks infinitly bumping each other?\u003C/p\u003E\n"},{"CreatedByName":"uxuser","CreatedById":92549,"CreatedDateTime":"2013-11-12T23:45:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOr maybe an equivalent of ground scatter, just placed in space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo what I was thinking when I read this, It\u0027s a beautiful ring like saturns and when you get closer you can kinda see that it\u0027s just a bunch of ground scatter moving around the new GP2. But yeah they wouldn\u0027t have gravity and would be hard to land on one and explore and make a flag! Maybe there should be metal harpoons in Kerbal Space so you could take it and launch where you want it, Then you can reel yourself in and it would be like having an artificial gravity but really it\u0027s just pulling\u003C/p\u003E\u003Cp\u003Eyou down!\u003C/p\u003E\u003Cp\u003EI agree, But since its Kerbal Space Program, and the planets are not colored like they would realistically be. So maybe the rings need to be green or something! Idk, First thing that came to my mind... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-11-14T16:15:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Ei would think that they could be physical collidable masses, but would not register a gravity per say. i think if they were implemented like that though they should add a spiked landing gear that locks you into the ground sort of, for probes or what not.\u003Cp\u003Eof course they would all be locked in their orbits no movement reletive to eachother\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei like this idea\u003C/p\u003E\u003Cp\u003Eto avoid having too many pieces of rock, it would be cool to have less of them but make them bigger, still without gravity\u003C/p\u003E\u003Cp\u003Ealso have a few kinds of rocks and repeat them all over\u003C/p\u003E\u003Cp\u003Eit would be something like the easter egg, but several and a bit smaller\u003C/p\u003E\u003Cp\u003Eanyway, stop thinking that anything will require a supercomputer, the ksp game itself would \u0022require a supercomputer\u0022 if it didn\u0027t exist\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-14T16:33:34Z","Content":"\n\u003Cp\u003EThe question is if we want it to be realistic or like in sci-fi movies. Because for realistic rings you might have one valnut-sized rock and handful of dust within the whole 2.5 km physics radius around your ship. And even that could be considered dense part of the ring.\u003C/p\u003E\u003Cp\u003EIf any effects at all, I\u0027d vote for scatter using very small bright particles emulating the dust. Of course completely penetrable. But given the fact that Saturn\u0027s rings are only a few hundred meters thick and the ship is usually travelling at speeds of thousands meter per second you would probably see the scatter in one frame if you\u0027re lucky unless you align the ship with the ring very precisely.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-11-14T16:39:46Z","Content":"\n\u003Cp\u003EAnyone suggesting rings made of actual objects clearly never had a lot of anything around Kerbin. Even if stuff isn\u0027t physically rendered at the moment, it will clog up your CPU.\u003C/p\u003E\u003Cp\u003ERings, if implemented, should be one object with fixed rotation. Transparent, foggy object with a drag value. That\u0027s the best we could hope for at this level of affordable, commercially available computer technology.\u003C/p\u003E\u003Cp\u003E(in real world, solid rings would crumble; infinitely strong rings would wobble and crash to the surface with one part)\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-14T16:42:48Z","Content":"\n\u003Cp\u003EPenetrable, UNLESS you are moving wih hight velocity relativly to this dust. If you are, well your ship becomes penetrable \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut i would like to suggest another thing, empty parts in ring structure. Like casini division\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://starchild.gsfc.nasa.gov/Images/StarChild/solar_system_level2/cassini_2.gif\u0022 alt=\u0022cassini_2.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlanning your orbit to fly inside such division woudl be nice challenge.\u003C/p\u003E\n"},{"CreatedByName":"ziogatto","CreatedById":12018,"CreatedDateTime":"2013-11-14T16:47:12Z","Content":"\n\u003Cp\u003EWell I hope the rings don\u0027t just get painted or as fuzzy patches with some rendering effects but are actually implemented as something like this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/h7eREddMjt4?t=4m1s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/h7eREddMjt4?t=4m1s\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-11-14T16:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ziogatto\u0022 data-cite=\u0022ziogatto\u0022\u003E\u003Cdiv\u003EWell I hope the rings don\u0027t just get painted or as fuzzy patches with some rendering effects but are actually implemented as something like this:\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/h7eREddMjt4?t=4m1s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/h7eREddMjt4?t=4m1s\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat looks pretty cool\u003C/p\u003E\u003Cp\u003Ei doubt he has a supercomputer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eanyway in ksp it doesnt need that much scatter nor being collideable\u003C/p\u003E\n"}]}