{"TopicId":52858,"ForumId":55,"TopicTitle":"Eva pods","CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-12T17:05:15Z","PageNum":1,"Articles":[{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-11-12T17:05:15Z","Content":"\n\u003Cp\u003EThere were proposals for allowing kerbals to make repairs on EVA.\u003C/p\u003E\u003Cp\u003ESome heavy duty repairs coudl be only made by using robotics tools placed on robotic arms.. or eva pods.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://spacecraft.ssl.umd.edu/old_site/academics/484S03/tramp_pics/2001pod.jpg\u0022 alt=\u00222001pod.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGreat thing for big interplanetary ships. How cool woudl it be to fly around such leviathan in small pod.\u003C/p\u003E\u003Cp\u003EOf course i dont mean to just add single \u0022eva pod\u0022 part. Actually such pod can be made even now, just use rover seat for kerbonaut, some RCS for manuvering (no need for real engines), some lamps. Only thing missing is manipulator and, well, things to repair.\u003C/p\u003E\u003Cp\u003EOr instead repearing, construction duties, like adding struts, or removing parts of ship you dont need anymore.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T17:08:49Z\u0022 title=\u002211/12/2013 05:08  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by kiwiak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UberFuber","CreatedById":90736,"CreatedDateTime":"2013-11-12T17:27:28Z","Content":"\n\u003Cp\u003EI like this idea. Perhaps have more command modules (to provide the navball, SAS, etc) that lends itself to the aesthetic of an EVA probe.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-12T21:04:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EGreat thing for big interplanetary ships. How cool woudl it be to fly around such leviathan in small pod.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause of the lag caused by gigantic amounts of parts... It would be a slide show\u003C/p\u003E\n"},{"CreatedByName":"joykler","CreatedById":92162,"CreatedDateTime":"2013-11-12T21:15:06Z","Content":"\n\u003Cp\u003Ehaving those ships in the first place causes lagg, but we still build them, i also want more repairable objects or things that require maintenance and the possibility to reinforce or take parts off. and having an eva pod that is stronger then your kerbal but with the same ability\u0027s like repairing things would be great. I also made a suggestion for more repairable parts and more options to repair and they said it was possible with lazor and Kas but it just isnt true , its way too unpractical on the small scale. so in my little opinion someone should make this mod !\u003C/p\u003E\n"},{"CreatedByName":"Zuni","CreatedById":85203,"CreatedDateTime":"2013-11-13T06:47:46Z","Content":"\n\u003Cp\u003EIf you\u0027re in a pod, it isn\u0027t quite EVA...\u003C/p\u003E\n"}]}