{"TopicId":52866,"ForumId":51,"TopicTitle":"Wings, a space program","CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-11-12T18:14:33Z","PageNum":1,"Articles":[{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-11-12T18:14:33Z","Content":"\n\u003Cp\u003EHey all, \u003C/p\u003E\u003Cp\u003ESo after avoiding the runway like the plague for a loooonnnnggg time, Jeb decided we need to build a space program around vehicles with wings. In other words, we\u0027re building a space program without using the launch pad.\u003C/p\u003E\u003Cp\u003ELets start with a bit of information. Before last Thursday, we had absolutely 0 experience with SSTO space planes. We\u0027d built a few sub-orbital planes that all flew horribly. So after days of designing, building, and testing, we have a couple designs that are viable for a space program. At this time we have the C-20, C-30, and T-10 platforms (C=cargo and T=transport). There are a couple other designs currently being tested, but none yet show the flexibility of the C and T platforms. Most of you will note the heavy use of B9 parts. We lack the experience and my computer lacks the power to build stock cargo SSTOs capable of supporting this space program. \u003C/p\u003E\u003Cp\u003EBefore we go any further, I\u0027d like to ask everyone to take a moment of silence to remember those Kerbals who have been lost in the quest for space. Quick saves and revert flight buttons are only being used in the most extreme cases. Design defects, most pilot errors, and acts of the Kraken are being played through to their conclusion. \u003C/p\u003E\u003Cp\u003ELets introduce the work horses of the fleet.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot70_zps5a2ddf7d.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot70_zps5a2ddf7d.png\u0022 alt=\u0022screenshot70_zps5a2ddf7d.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFrom left to right: C-30 Heavy cargo, T-10 Crew bus, C-20 Medium cargo\u003C/p\u003E\u003Cp\u003ENote: There is also a C-10 light cargo plane based on the T-10 design. It is currently still in testing and not released for duty yet.\u003C/p\u003E\u003Cp\u003EOnce we progressed to the point that we had reliable (mostly) designs, we started construction on a space station in LKO. Fuel Station Alpha is primarily a refueling depot, but also has a science module and capacity for 12 Kerbals. The station required 9 flights to complete. Here is a shot of a C-30 delivering the hab module.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot62_zps3cb50585.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot62_zps3cb50585.png\u0022 alt=\u0022screenshot62_zps3cb50585.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere are a couple shots of the completed station.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot79_zps487572fb.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot79_zps487572fb.png\u0022 alt=\u0022screenshot79_zps487572fb.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot78_zps2c07431d.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot78_zps2c07431d.png\u0022 alt=\u0022screenshot78_zps2c07431d.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt this point the station is completed and we\u0027re ready to expand our space program. During construction of the station, a probe was sent to Minmus to survey for Kethane. This is where we ran into the next challenge. For station pieces, probes, and small ships (very small), the current fleet is excellent. However, now that we\u0027re looking into building bases and mining platforms, the current fleet is woefully insufficient.\u003C/p\u003E\u003Cp\u003EI present you the C-40 Oversized Cargo design (AKA Bertha).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot75_zps564ede72.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot75_zps564ede72.png\u0022 alt=\u0022screenshot75_zps564ede72.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot76_zps7033f6d3.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot76_zps7033f6d3.png\u0022 alt=\u0022screenshot76_zps7033f6d3.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBertha is currently in her 3rd version (with minor tweaks on this version), and still in the testing phase. She can achieve stable orbit (without payload) with plenty of fuel left over. This design is for oversized cargo only, there may be a heavy lift version in the future, but that is still unknown. Over the next few days we will be continuing the testing and tweaking. We hope to have the C-40 released for service sometime this week.\u003C/p\u003E\u003Cp\u003EMost of the pieces are in place to expand the space program beyond LKO. The next step is to build a fuel depot in Minmus orbit. There are plans for a small Kethane rig and base on Minmus, but this requires the completion of the C-40 platform. \u003C/p\u003E\u003Cp\u003EI will be updating this thread as progress is made.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-12T18:40:54Z\u0022 title=\u002211/12/2013 06:40  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 12, 2013\u003C/time\u003E by Beachernaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Akinesis","CreatedById":71042,"CreatedDateTime":"2013-11-12T19:36:26Z","Content":"\n\u003Cp\u003EGreat looking planes!! I\u0027m trying to do a space program all the way from first the rocket to the first futuristic reusable SSTO like yours above. It\u0027s actually quit slow considering the amount of time I get to play (still haven\u0027t reached a Kerbal Mun landing since 0.20!). So when I see threads like this it makes me itch to get cracking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-11-12T22:45:53Z","Content":"\n\u003Cp\u003EThanks, I\u0027m actually quite proud that I was able to build these planes, and have them work as intended. Still working the kinks out of some though. The C/T-10 gets to orbit with enough fuel to do a de-orbit burn, but that\u0027s it. I need to do some tweaks and get some more fuel on board without affecting it\u0027s balance and stability. My 2 biggest challenges so far have been getting them off the runway, and keeping the nose forward through reentry. The C-30 has issues with taking off with all 4 engines. I have to accelerate as much as I can with the 2 center engines, then activate the wing engines for the last bit of thrust to take off. If I use all 4 it gets unstable and wobbles across the runway, leading to it\u0027s pilot\u0027s doom.\u003C/p\u003E\n"},{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2013-11-13T15:59:23Z","Content":"\n\u003Cp\u003EThe core for our Minmus station was launched last night.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot62_zps04210084.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot62_zps04210084.png\u0022 alt=\u0022screenshot62_zps04210084.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot65_zps98c84dd0.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot65_zps98c84dd0.png\u0022 alt=\u0022screenshot65_zps98c84dd0.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe flight up to LKO went well, rendezvous with Station Alpha also. However, about half way through the burn for Minmus intercept a problem was found. The Sabre engine, though a great choice for an SSTO to LKO, is not a good choice for going further due to it\u0027s 300 something ISP in rocket mode. So, after transfering some fuel from the station core in the bay, the payload was left in LKO, then Jeb and Bill returned to KSC. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot76_zps8308e997.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot76_zps8308e997.png\u0022 alt=\u0022screenshot76_zps8308e997.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe engineers and design teams have been hard at work. They are currently testing a different engine configuration for the C-30. So far the results are promising, but part of the team is also working on a completely different design for missions outside of LKO. \u003C/p\u003E\u003Cp\u003EHere is the latest C-30 configuration. Although it flies well, it has not yet attempted to achieve orbit. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s152.photobucket.com/user/Beachenraut/media/KSP/screenshot78_zps83709ee8.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i152.photobucket.com/albums/s197/Beachenraut/KSP/screenshot78_zps83709ee8.png\u0022 alt=\u0022screenshot78_zps83709ee8.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}