{"TopicId":52926,"ForumId":16,"TopicTitle":"Grab","CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2013-11-13T03:48:23Z","PageNum":1,"Articles":[{"CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2013-11-13T03:48:23Z","Content":"\n\u003Cp\u003EIn my first EVA, in orbit over Kerbin, I flew Enwig around for a while, then back to the ship before I lost sight of it. After several tries, I got him close enough to the ladder that the F (Grab) prompt appeared. I hit the F key, which had the immediate effect of shutting off his RCS, driving him back from the ship and spinning. I did this several times with the same result, and he never did grab the ladder. His propellant is now gone and he drifts in orbit. \u003C/p\u003E\u003Cp\u003EHow do I get him to grab the ladder?\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-11-13T04:03:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DennyC\u0022 data-cite=\u0022DennyC\u0022\u003E\u003Cdiv\u003EIn my first EVA, in orbit over Kerbin, I flew Enwig around for a while, then back to the ship before I lost sight of it. After several tries, I got him close enough to the ladder that the F (Grab) prompt appeared. I hit the F key, which had the immediate effect of shutting off his RCS, driving him back from the ship and spinning. I did this several times with the same result, and he never did grab the ladder. His propellant is now gone and he drifts in orbit. \u003Cp\u003EHow do I get him to grab the ladder?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere can\u0027t be anything else around the ladder, and you can\u0027t be going that fast. The slower the better to be honest. And sometimes there is a bug on some capsules where it wont detect it correctly and bounces your kerbanaught off the vehicle.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-11-13T04:08:57Z","Content":"\n\u003Cp\u003EYep, this often happens when you don\u0027t bring the them to a complete stop before grabbing. To save your Kerbal, you\u0027re going to have to move a ship up to him so that the ladder is within his \u0022grabbing range.\u0022 Though that can be quite tricky.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-11-13T05:36:32Z","Content":"\n\u003Cp\u003EIt does seem to be touchier than usual lately, though.\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-13T06:47:18Z","Content":"\n\u003Cp\u003EI experienced this few times and it always solved by changing rocked orientation in space. (not in 0.22 yet)\u003C/p\u003E\u003Cp\u003EFor example turning 90deg always helped to get in into the capsule. This should have something to do with Kerbal limitation to turn directly up or down (as with camera angle).\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-11-13T07:05:53Z","Content":"\n\u003Cp\u003EYou could rescue him by rendezvousing, and positioning an empty pod in fron of him. Alternatively, use infinite EVA fuel from the debug menu, hit alt and f12 at the same time.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-13T08:26:15Z","Content":"\n\u003Cp\u003EWhen you have problems with grabbing the ladder, change camera (V key, Free to Orbital or vice versa), the Kerbal will turn around according to new camera orientation and may have it easier.\u003C/p\u003E\u003Cp\u003EYou can also try to turn the ship around if it has a probe core or another Kerbal inside.\u003C/p\u003E\n"},{"CreatedByName":"Trux","CreatedById":44041,"CreatedDateTime":"2013-11-13T12:06:55Z","Content":"\n\u003Cp\u003EAlso make sure the ladder and hatch is unobstructed, if there is and part collision the Kerbals can be thrown off of ladders with very high velocities.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-13T12:41:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003Echange camera (V key, Free to Orbital or vice versa), the Kerbal will turn around according to new camera orientation\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E... where is the things I did not know before thread??? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"toomuchbrew","CreatedById":57346,"CreatedDateTime":"2013-11-13T14:55:41Z","Content":"\n\u003Cp\u003EI\u0027ve had Kerbals bounce off capsule at the instant they start their EVA. It happened again a bunch of times. What appears to have happened was there was an antenna sticking out. Make sure there\u0027s nothing near the hatch.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-11-13T15:03:59Z","Content":"\n\u003Cp\u003EModules should have hooks on them. Too bad you only have the ladders to grab. Real life station modules have hooks and handles all over the place.\u003C/p\u003E\u003Cp\u003EA friend of mine tried to go EVA in Kerbin\u0027s orbit and he told me the feeling of not drifting away was terrible. I remember that happening back in the days I couldn\u0027t control Kerbals at all.\u003C/p\u003E\n"},{"CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2013-11-15T20:25:01Z","Content":"\n\u003Cp\u003EI consider this answered (thanks to everyone!), but can\u0027t figure how to change the status.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-15T23:25:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EModules should have hooks on them. Too bad you only have the ladders to grab. Real life station modules have hooks and handles all over the place.\u003Cp\u003EA friend of mine tried to go EVA in Kerbin\u0027s orbit and he told me the feeling of not drifting away was terrible. I remember that happening back in the days I couldn\u0027t control Kerbals at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe have ladder segments that you can place on the module/station yourself, wherever you want\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-11-16T16:19:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EWe have ladder segments that you can place on the module/station yourself, wherever you want\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EYeah, at 50 bleeding kilograms each! Way too heavy to want to install more than a few.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMy bad, 5kg each. Still more than I\u0027d like to indiscriminately throw around one doesn\u0027t weigh much, but next thing you know you\u0027ve tossed 20 of them around the ship and you\u0027ve added 0.1 tons to your mission package.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T16:42:04Z\u0022 title=\u002211/16/2013 04:42  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by WafflesToo\u003C/strong\u003E\n\u003C/span\u003E\n"}]}