{"TopicId":53064,"ForumId":34,"TopicTitle":"[WIP][TechTree @ 0.23.5] - [MS19e] - Realistic Progression LITE","CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-11-14T04:44:51Z","PageNum":13,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-02T20:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EThis is actually a stock issue, that DRE brings to light. If your vessel explodes while experiencing re-entry effects (the flames) it causes the UI to become responsive if you return to the space center. There is a \u0027sort of\u0027 fix for this, if you revert to VAB, proceed to LP, and then you can go back to the Space Center and all will be well.\u003Cp\u003EVery odd issue indeed.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003ETook my first weekend off working on the plugin/tech tree. Back online as of this morning. Just to give an idea of what is going on right now, I\u0027m going over the stock detection of situations (FlyingHigh/low,etc.) vs the method I\u0027ve borrowed from Ethernet. Either we need to get the RSS CelestialParams tweaked, or I have to make some updates to the method. Either way I\u0027ll get to the bottom of this.\u003C/p\u003E\u003Cp\u003EOnce this is fully resolved, I\u0027ll get back to making probes, and reviewing their tech tree line. Thinking of going by project name, IE:\u003C/p\u003E\u003Cp\u003EProject Bumper\u003C/p\u003E\u003Cp\u003ESputnik (1,2,3)\u003C/p\u003E\u003Cp\u003EProject Explorer\u003C/p\u003E\u003Cp\u003EProject Pioneer (0,1,2,3,4)\u003C/p\u003E\u003Cp\u003ELuna (1,2,3)\u003C/p\u003E\u003Cp\u003EThis should all be doable with Tier 1 Tech (1955\u002B). Where possible and if it doesn\u0027t become more of a hassle, I\u0027ll itemize their scientific accomplishments separately as their own experiments.\u003C/p\u003E\u003Cp\u003EFor Manned experiments, I\u0027ll do Project Mercury \u0026amp; Gemini first. As some of these move to more complex \u0022conditions\u0022 might be worth starting to implement a few MCE missions to complement the experience. Although that\u0027s a bit of pandora\u0027s box, as before using MCE I want to do a cost overhaul/review and that will be, soo damn long. lol, so I think I\u0027ll do my best to make it \u0027work\u0027 without it for now.\u003C/p\u003E\u003Cp\u003EThanks again for all those participating in this super buggy alpha, suggestions and issues reported are being noted and hopefully addressed in Milestone 19.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebest alpha i\u0027ve ever tried, very well done so far!!\u003C/p\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-02T20:53:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnyone found an effective fuel mixture for landers that isnt \u0022cryogenic\u0022 (doesnt evaporate)? I am having a small issue with finding the right mixtures for each of my stages, i got the idea of liquid fuel/liquid oxygen or LH2/liquid oxygen make for good early stages to orbit, what do i want to for a long duration stage?? very upsetting to reach my destination only to find a good chunk of my landing delta-v has evaporated dooming me to impact \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome engines (AIES engines are the first you have access to I believe have Aerozine and/or MMH fuel options. These are used mostly for stages that require fuels be stored and reignited. Though hard with this mod at first, because the early engines dont support h2/o2, it is often best to have a fairly long burning first stage of LF/O2 followed by stages of H2/O2. H2/O2 for 2nd stage\u002B gives high performance for its mass and thus improves the dV of the rocket overall. Only issues with H2/O2 are its size (high volume requirement), the generally lower TWR (less an issue with a large LF first stage), and boil off. Final stage and lander options are generally best cases for MMH, Aerozine, and sometimes Monoprop. These give nice long burns for relatively small volumes and don\u0027t boil off. ModFuels supports RLA Stock alike engines with burn monoprop, which sometimes make it attractive. Even without, small probes, service modules, and small non-atmospheric landers that require RCS anyway can often do with RCS modules only (no engines!). The often cited \u003Ca href=\u0022http://www.braeunig.us/space/propel.htm\u0022 rel=\u0022external nofollow\u0022\u003Ebraeunig\u003C/a\u003E contains fuel specifics.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-02T20:56:57Z","Content":"\n\u003Cp\u003EWhy thank you Aazard!\u003C/p\u003E\u003Cp\u003EJust a small update/insight into the tests i\u0027ve been carrying out. It seems that the stock situation detection has a flaw of some sorts. If you are able to reach orbit velocity above a certain altitude (which is below the actual threshold of InSpaceLow) the goo experiment is able to report InSpaceLow condition. The way the custom experiment checks the situation is solely based on the threshold, so seems that the method Ethernet did is actually more accurate in that specific scenario. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Kudos to Ethernet!\u003C/p\u003E\u003Cp\u003ESo without touching the values of Kerbin, it\u0027s got a 18,000 meter cutoff for Flying Low, then Flying high is up until 103,500 meters. Space Low is between 103,501 and 249,999 meters. Space High is 250,000 and above. I think it\u0027d be nice to have Space High start above 300km instead, to represent LEO a little better. Totally doable too!\u003C/p\u003E\u003Cp\u003EI had an idea but I\u0027m not sure we could implement it. But for bodies that don\u0027t have atmospheres, excluding landing condition, you are left with only High/Low space. With some trickery, I\u0027m wondering whether I could manage to get High/Low above surface working. This would be great for the early impact probes, and have more precise conditions as to where to take the video/photos data.\u003C/p\u003E\u003Cp\u003ENow to go do the rest of the bodies. lol\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-02T21:06:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aazard\u0022 data-cite=\u0022Aazard\u0022\u003E\u003Cdiv\u003EThis is a good reason to build \u0022fat/wide\u0022 1st stages with tank adapters/interstate fairings upto a skinnier last stage with a payload procedural fairing, atleast your rocket will be more manageable in the VAB and less \u0022tippy\u0022 on the launch pad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is indeed a solution. My comment was to help a new-comer get over the initial size difference hump. Transitioning from stock to mostly full sized rockets can be hard for some. \u003C/p\u003E\u003Cp\u003EScouring for science at the beginning to help alleviate tall skiny high part rockets is indeed important. Efficient use of the science gathered from the first few science missions also helps a lot. Gaining early access to T2 structural/decouplers as well as larger fairings (at least to the somewhat complicated to use inter-stage adapter) is very important for easing the transition from KO to Mun science missions.\u003C/p\u003E\n"},{"CreatedByName":"TheJoseph98","CreatedById":81838,"CreatedDateTime":"2013-12-02T21:16:40Z","Content":"\n\u003Cp\u003EHello, I installed this(ese) mod(s) but I have a couple of issues:\u003C/p\u003E\u003Cp\u003E1) When I started a new career save, I selected \u0022use stock\u0022 from TreeLoader and then I went to Research building and on the top I selected the RPL_18 or something but when I click on something to research it a window pops up saying how to edit the tech tree I don\u0027t want ot edit it I just want to use it.\u003C/p\u003E\u003Cp\u003E2) For some reason when I make a rocket and when I launch it the throttle stays at 100% for like a second and then it drops to 0% and what\u0027s more weird I can\u0027t set it back to 100% it\u0027s stuck at 0% throttle, the only way to launch stuff is by using solid boosters\u003C/p\u003E\u003Cp\u003EEDIT: I double checked that all mods are installed correctly, I know the number 1 is caused by me using TreeEdit instead of TreeLoader (the short tutorial on the first page says I should use TreeEdit and not Loader), for number 2 though I still don\u0027t know what\u0027s causing it\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T21:22:19Z\u0022 title=\u002212/02/2013 09:22  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by TheJoseph98\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-02T21:21:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E1) When I started a new career save, I selected \u0022use stock\u0022 from TreeLoader and then I went to Research building and on the top I selected the RPL_18 or something but when I click on something to research it a window pops up saying how to edit the tech tree I don\u0027t want ot edit it I just want to use it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo my knowledge there is no way to get rid of the edit window. RPL_18 has not been added to TreeLoader as an option yet, so this is the only way to use the Alpha. Annoying, but I believe unavoidable at the moment.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2) For some reason when I make a rocket and when I launch it the throttle stays at 100% for like a second and then it drops to 0% and what\u0027s more weird I can\u0027t set it back to 100% it\u0027s stuck at 0% throttle, the only way to launch stuff is by using solid boosters\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t say for sure, but this sounds like your rocket may not have a power antennae for remote tech. RT2 will often not engage its control restrictions until just after launch, causing this type of behavior. If not this...\u003C/p\u003E\n"},{"CreatedByName":"TheJoseph98","CreatedById":81838,"CreatedDateTime":"2013-12-02T21:23:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirklick\u0022 data-cite=\u0022sirklick\u0022\u003E\u003Cdiv\u003EI can\u0027t say for sure, but this sounds like your rocket may not have a power antennae for remote tech. RT2 will often not engage its control restrictions until just after launch, causing this type of behavior. If not this...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat antenna? Does it have a name so I can place one onto my rocket. I know one antenna is the one you start with the stock career mode the communitron 16 or something and there is another one I actually haven\u0027t tried placing that on the rocket, also do they have to be extended?\u003C/p\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-02T21:27:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheJoseph98\u0022 data-cite=\u0022TheJoseph98\u0022\u003E\u003Cdiv\u003EWhat antenna? Does it have a name so I can place one onto my rocket. I know one antenna is the one you start with the stock career mode the communitron 16 or something and there is another one I actually haven\u0027t tried placing that on the rocket, also do they have to be extended?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe a good one to use at first is the DP-10. Decent enough range for ascent and running a couple of experiments and low/no power usage AND it starts deployed.\u003C/p\u003E\n"},{"CreatedByName":"andqui","CreatedById":93107,"CreatedDateTime":"2013-12-02T22:06:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheJoseph98\u0022 data-cite=\u0022TheJoseph98\u0022\u003E\u003Cdiv\u003EWhat antenna? Does it have a name so I can place one onto my rocket. I know one antenna is the one you start with the stock career mode the communitron 16 or something and there is another one I actually haven\u0027t tried placing that on the rocket, also do they have to be extended?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Reflectron DP-10\u0022 for early flights, low power cost but short range, needs no activation\u003C/p\u003E\u003Cp\u003E\u0022Communotron 16\u0022 for your first primitive comunication satellites at 15-25k km orbits, needs to be turned on but is omnidirectional\u003C/p\u003E\u003Cp\u003E\u0022Comms DTS-M1\u0022 for geosynchronous/lunar communication, needs to be turned on and pointed at another dish (which should also be pointing back)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T22:47:01Z\u0022 title=\u002212/02/2013 10:47  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by andqui\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BlackGlass Sand","CreatedById":95243,"CreatedDateTime":"2013-12-02T22:12:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EThis is actually a stock issue, that DRE brings to light. If your vessel explodes while experiencing re-entry effects (the flames) it causes the UI to become responsive if you return to the space center. There is a \u0027sort of\u0027 fix for this, if you revert to VAB, proceed to LP, and then you can go back to the Space Center and all will be well.\u003Cp\u003EVery odd issue indeed.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank-you kindly for the responses, gentlemen; I knew someone would know about this. Guess I\u0027ll just have to do my re-entries better. lol.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-02T22:13:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirklick\u0022 data-cite=\u0022sirklick\u0022\u003E\u003Cdiv\u003EI believe a good one to use at first is the DP-10. Decent enough range for ascent and running a couple of experiments and low/no power usage AND it starts deployed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree the DP-10 is best for launch/ascent control on ALL unmanned rockets when placed on a stage that falls away after you reach 50\u002Bkm (so you can deploy longer range antenna without it breaking to take over). After this is the communitron 88-88 deployable dish, the always deployed dish\u0027s are an option too but due to mass \u0022always on\u0022 dishes are normally better used for comms relays sats (making the communitron 88-88 attractive for early missions due to its weight to range ratio as long as probe dosnt exceed 400GM range, lets you carry the least weight in comms equip).\u003C/p\u003E\u003Cp\u003EBut you\u0027ll need a comms network ASAP to run more effective missions. I tend to deploy a 3 sat 50MM omni antenna/600gm dish (dish pointed to \u0022active vessle\u0022, omni in range of other 2 geosynced sats)) com sat relay for earliest missions (like orbital stuff/mun/duna/eve fly bys/landings) and, after unlocking the best dish\u0027s/tracking solar panels, dock to them, refuel them and send them to the mun as the munar comms relay and replace the kerbin geosynchronous network with the final \u0022system wide\u0022 dishes and 50MM antenna\u0027s. RT2 can be punishing and solar orbit/impact causing when 1st using it lol\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E although the \u0022Comms DTS-M1\u0022 is effective for a com relay, its slightly high weight to range ratio plus limited range (making it less effective for future missions like eve/duna flyby\u0027s), i find a single 600GM dish/50MM omni antenna combo gets you the \u0022most mileage\u0022 for your 1st comms network, and they\u0027re unlocked with the duna/eve probes. The weight of them is not \u0022too hard\u0022 to launch geo-synced at tier 1 rockets and they can be easily powered by the 1st battery/solar panel you get (like 48solar panels \u0026amp; 8 batteries... but they are light). But every one has their preferred setup, \u003Cstrong\u003Ei suggest testing your comm sat\u0027s recharge rate \u0026amp; power on the launch pad before launching it, to make sure it can continuously power itsef\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT: Anyone else have rovers sliding like they are on ice on the mun? Also with random flipping like they hit a ridge and doing an endless \u0022brake dance spin\u0022?? Its very hard to drive my rover the distances required in RSS like this...\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T06:49:58Z\u0022 title=\u002212/03/2013 06:49  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-03T07:37:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aazard\u0022 data-cite=\u0022Aazard\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: Anyone else have rovers sliding like they are on ice on the mun? Also with random flipping like they hit a ridge and doing an endless \u0022brake dance spin\u0022?? Its very hard to drive my rover the distances required in RSS like this...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlease post this on the RSS thread! Sounds like something not super fun! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E NathanKell will have a look.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E@ALL\u003C/p\u003E\u003Cp\u003ESo, spent the day checking out the celestial parameters for each body, and see how that all makes sense in relation to RSS, and yeah, we\u0027ll need to tweak some values. In some cases we end up with a Atmospheric threshold, that overlaps the lowspace zone, so you jump from FlyingHigh to SpaceHigh. At least now I have all the values mapped out and I\u0027ll see what needs to be changed so that it fits all nicely. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Then finally back to my ramshackle probes.\u003C/p\u003E\u003Cp\u003EFor those who like numbers:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/ooyh8h6fv/full/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s9.postimg.org/n9wwjr5cv/Thresholds_RSS.png\u0022 alt=\u0022Thresholds_RSS.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/index.php?lang=french\u0022 rel=\u0022external nofollow\u0022\u003EtÃƒÂ©lÃƒÂ©chargement de photos\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T07:42:27Z\u0022 title=\u002212/03/2013 07:42  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T09:04:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EPlease post this on the RSS thread! Sounds like something not super fun! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E NathanKell will have a look.\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E@ALL\u003C/p\u003E\u003Cp\u003ESo, spent the day checking out the celestial parameters for each body, and see how that all makes sense in relation to RSS, and yeah, we\u0027ll need to tweak some values. In some cases we end up with a Atmospheric threshold, that overlaps the lowspace zone, so you jump from FlyingHigh to SpaceHigh. At least now I have all the values mapped out and I\u0027ll see what needs to be changed so that it fits all nicely. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Then finally back to my ramshackle probes.\u003C/p\u003E\u003Cp\u003EFor those who like numbers:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/ooyh8h6fv/full/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s9.postimg.org/n9wwjr5cv/Thresholds_RSS.png\u0022 alt=\u0022Thresholds_RSS.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/index.php?lang=french\u0022 rel=\u0022external nofollow\u0022\u003EtÃƒÂ©lÃƒÂ©chargement de photos\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMun looks odd, low space is 69km and high space is 60km??\u003C/p\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-12-03T10:32:50Z","Content":"\n\u003Cp\u003EI\u0027m game to assist in the progression of the aircraft nodes if you\u0027re still looking:\u003C/p\u003E\u003Cp\u003EIt\u0027s going to require B9, Firespitter, and TT Aerospace and Pizzaria, plus a modification for the RAMJET engine from TT for SCRAMJETs, and rather than two or three nodes, you\u0027ll have a split tree there with five nodes each for engines and \u0027wings\u0027. It should be noted that TT Pizzaria tweaks the aircraft engines to make them behave more realistically for their power curves between speed and altitude.\u003C/p\u003E\u003Cp\u003EComing off the start node you have, you can immediately split into two sections.\u003C/p\u003E\u003Cp\u003EAircraft Engines, and Aerodyanmics.\u003C/p\u003E\u003Cp\u003EAircraft Engines: \u003C/p\u003E\u003Cp\u003ENode One (Prop Engines) contains firespitter\u0027s prop engine components and the tanks/basic inlets that would otherwise needed to make them run. This node represents early aircraft engines and handles the Lancaster engines parts. There would be no jet engines here.\u003C/p\u003E\u003Cp\u003ENode Two (The Jet Age) would contain the stock basic jet engine (technically a turbojet. See Note *1) and/or basic turbojets.\u003C/p\u003E\u003Cp\u003ENode Three (Turbofans) would contain more advanced engines that take turbojets and combine them with the advantages of prop engines. Also, firespitter needs to develop Turboprops. (*2) Node three would also contain helicopter engines. (Turboshaft)\u003C/p\u003E\u003Cp\u003ENode Four (Ramjets/J-57s) This node represents the tier of engines the SR-71 blackbird uses. A Turbo-ramjet hybrid engine. (*1) Turbo-ramjet and ramjet components as well as supersonic inlets would be here.\u003C/p\u003E\u003Cp\u003ENode Five (SCRAMJETS/SABREs) This final node of engines would contain SCRAMJET engines custom added (*3). Scramjets would require a merging branch node from both hypersonic flight (see next node group) and somewhere in the mid to late-stage liquid rocket engines group. SABRE engines from B9 Aerospace would also go here.\u003C/p\u003E\u003Cp\u003EAerodynamics:\u003C/p\u003E\u003Cp\u003ENode 1 (Basic flight) This node contains basic straight edge wings such as firespitter\u0027s... firespitter wings.\u003C/p\u003E\u003Cp\u003ENode 2 (Aerodynamics) This node covers wing design ranges from late prop aircraft to early jets. Where math started getting applied to aircraft design, but before man achieved supersonic flight. Wing sweeping is introduced here, but not the delta or other deep sweep wings of the next node.\u003C/p\u003E\u003Cp\u003ENode 3 (Trans-sonic) Learning to break the sound barrier came with painful lessons about what air does above mach .9. This node would contain wings that reflect these lessons. Deeper Swept wings and Delta\u0027s show up here.\u003C/p\u003E\u003Cp\u003ENode 4 (Or node 3 revised) (Supersonic) The distinction between this one and above is likely not going to be in the parts available so much as lessons learned. Lessons learned flying above mach 1 and into mach 2 and 3 resulted in advancements to supersonic design overall, as well as improvements in flight at higher altitudes. Perhaps merging stock High Altitude Flight into this section will mark the distinction.\u003C/p\u003E\u003Cp\u003ENode 5 (Hypersonic Flight) At mach 5, air behaves more like a plasma fluid than... well, air. This node would contain the parts distinct to discovering that. Since a lot of how hypersonic designs will behave is modeled by computer, this node would require a merging point with mid-tier electronics. If you integrate Procedural wings, they belong here.\u003C/p\u003E\u003Cp\u003ESide Node (Figure out where to place): Composite wings. Light modern aircraft and drones use composite materials in their wings to make them lighter and more flexible while still being strong. TT Pizzaria adds a variety of light wings ideal for drone aircraft that appear to be of this design.\u003C/p\u003E\u003Cp\u003ESide Node 2: Rotor Craft. A possibility instead of lumping helicopter parts in with turbofans. They are a bit of their own side-branch in development requiring their own concepts and approach to flying.\u003C/p\u003E\u003Cp\u003E*1: Turbojet: Basic jet turbine engine. All power and thrust is developed in the turbomachinery. Poor performance and inefficient and low speed. Good power and speed at high subsonic through to mach 1.2 or so without afterburner, up to ~mach 2 with afterburner.\u003C/p\u003E\u003Cp\u003ETurbofan: Turbojet engine with a large fan on the front that pushes air through a ducted bypass around the outside of the core. Moves a lot of air at a lower speed producing a LOT of power. Very efficient engine at subsonic, quickly loses power after hitting mach 1. High and low bypass (size of ducting) variants determine actual characteristics. Examples: High Bypass, 747\u0027s engines. Low Bypass, Modern combat aircraft engines like the F-22\u0027s F-119 afterburning turbofans.\u003C/p\u003E\u003Cp\u003ERamjet: Jet engine that does not contain the internal turbomachinery and is considered not to have moving parts. Uses ramming effect of the aircraft plowing through the air as the intake that forces air into the engine, thus the name. Does not work at a stop or low speeds. Minimum mach 2.5 operational capability, upper limit around mach 5 - 7. Tweak for balance.\u003C/p\u003E\u003Cp\u003ETURBO-RAMJET: Hybrid engine. Operates as a turbojet until around mach 2.5 and then bypass doors in the engine open up forcing the air to move around the engine. SR-71 Blackbird\u0027s J-57 engines are a working example. Engine regime is more or less from full stop up to mach 3.5. Based on anecdotal evidence, may be able to push mach 4 before the leading compressor fan in the turbomachinery runs the risk of softening and flying apart. (Overheat above M3.5) In game, the stock turbojets operate in roughly this regime, but that needs to be fixed.)\u003C/p\u003E\u003Cp\u003E*2: Turboprops are propeller aircraft who\u0027s propellers aren\u0027t driven by piston engines. They are in the same vein as a turbofan engine in that their core component is the turbine. However, Turboprops completely forego the jet-thrust configuration and power propellers. They are more efficient than a turbojet, but cheaper than a full turbofan.\u003C/p\u003E\u003Cp\u003E*3: TT Aerospace and Pizzaria has RAMJET engines that cover mid to high-velocity supersonic flight up to mach 5-6. However, RAMJETs are not the end of the line in air breathing engines. RAMJETs lose their power around mach 5-7 due to the fact that deflagration (regular burning) just doesn\u0027t burn the fuel fast enough before the flame itself is pushed out of the exhaust nozzle of the engine. And using shock cone inlets and other methods to slow the air down at this point start to produce too much drag for too little gain. (In short the engine literally blows itself out like a candle.) The SC in SCRAMJET stands for Supersonic Combustion [Ramjet]. Effectively, fuel is \u0027detonated\u0027 rather than \u0027burned\u0027 so that the heated exhaust gas expands fast enough to be effective in the engine. The configuration of the engine is otherwise just like a ramjet, though the mathematics of the geometry are refined for higher velocities. The SCRAMJET is proven up to speed of mach 9-10, though theories suggest that with the right fuels and materials, velocities up to mach 22 are possible. The limitation of the SCRAMJET at top speed is how much heat burning the fuel can add to the air. At a SCRAMJET\u0027s theoretical limit, the air is just as hot at the diffuser (just after intake) due to compression as it is when the fuel is burned into it. No heat added means no further expansion of the air, means no additional thrust. The engine maxes at full speed by its net thrust running to zero. (It reaches top speed and just stays there until fuel is run out.) The TESTED and verified top speed of a scramjet would make escaping stock-sized kerbin into medium orbit easy once you get to the mach 3.5 power development threshold. The theoretical limit would be good for real solar system configuration.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s my suggestion for the aircraft tree. Now a couple of comments about other things.\u003C/p\u003E\u003Cp\u003EI think the cost values for different sections still need tweaking. Your custom instrumentation gives very large injections of science when you complete each one, but the leaps going up the tree are extremely steep in price for stock experimentation. I suggest tweaking and integration with Kerbal Dust Experiment and L-Tech Science parts mods in mind. I also suggest reviewing how much science can be earned per \u0027range sphere\u0027 around kerbin based on these to work out about what \u0027tiers\u0027 take you what distances.\u003C/p\u003E\u003Cp\u003ESecond, I think a tier for wheels, perhaps integrating modular multiwheels and other wheel mods into the mix would also be good for the tree. Give the player the chance to run around on the ground a little early on and for lack of a better term \u0027drive\u0027 some of their experiments out to places. There are a lot of biomes on kerbin. And they can ALL be reached by land if you\u0027re patient enough. (Thanks to Kerbin\u0027s continents having a double land bridge.) At the very least, give them the chance to explore the local biomes and let the local biomes at least play a useful part in the early game. From what I learned playing Nazari\u0027s (OR however that name\u0027s spelled), Traditional Tech Tree, getting around kerbin early on can be a pretty decent goal. (Before you go to space, explore your own world dangit!)\u003C/p\u003E\u003Cp\u003EAs it stands, with your science tiers jumping in value rapidly, the meager science of the kerbin surface biomes pretty much makes them useless very quickly. Perhaps integrating the flight tree with some experiments, making them integral to helping advance the flight tech branches would be a way to go there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T10:36:08Z\u0022 title=\u002212/03/2013 10:36  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by AdmiralTigerclaw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-12-03T10:44:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AdmiralTigerclaw\u0022 data-cite=\u0022AdmiralTigerclaw\u0022\u003E\u003Cdiv\u003E[...]TT Aerospace and Pizzaria[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assume you mean Taverio\u0027s Aerospace \u0026amp; Pizza Delivery (aka. TV PP)? Since TT usually is TouhouTorpedo, not Taverius.\u003C/p\u003E\u003Cp\u003EI\u0027d argue that the prop aircraft parts might be aptly placed at the starting node, along with basic flight. A candidate part for either transonic or supersonic aerodynamics would be any sort of stabilator-type control surface (Stock AV-R8 and canards, TVPP rescales, B9 stabilators, etc.), as these were developed specifically to allow supersonic control authority, IIRC.\u003C/p\u003E\n"},{"CreatedByName":"Tyrador","CreatedById":92682,"CreatedDateTime":"2013-12-03T10:50:17Z","Content":"\n\u003Cp\u003EMediavlNerd, are you planning to add to this tree NearFuture mod? It\u0027s much more realistic than Interstellar and is better looking.\u003C/p\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-12-03T11:04:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Autochton\u0022 data-cite=\u0022Autochton\u0022\u003E\u003Cdiv\u003EI assume you mean Taverio\u0027s Aerospace \u0026amp; Pizza Delivery (aka. TV PP)? Since TT usually is TouhouTorpedo, not Taverius.\u003Cp\u003EI\u0027d argue that the prop aircraft parts might be aptly placed at the starting node, along with basic flight. A candidate part for either transonic or supersonic aerodynamics would be any sort of stabilator-type control surface (Stock AV-R8 and canards, TVPP rescales, B9 stabilators, etc.), as these were developed specifically to allow supersonic control authority, IIRC.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd that\u0027s what I get for not actually stopping to check. Would you believe I started by calling it TV Aerospace etc and then thought \u0027that don\u0027t sound right\u0027 and \u0022revised\u0022 it to TT?\u003C/p\u003E\u003Cp\u003EAs for moving the props and basic flight, the wonders of node editing. You could merge them into a single node there, and move it off start with a low price (five, ten science?) At the very least, letting the player know at a glance \u0022Here Be Dragons\u0022 in relation to aerospace without confusing them with wings at the very start.\u003C/p\u003E\u003Cp\u003EIf I were doing this tree, I\u0027d actually force the player to go through a starting \u0027ground\u0027 tier and some basic flight tiers before giving them their first rocket. I liked the traditional tech tree in that you have to work your way from the ground up, but it had a bit of a steep curve early game that died very quickly. The Traditional tech tree made you squeeze just about every bit of science out of flying around kerbin you could find before you could make it to general rocketry. Once you hit orbit though, cake. Four Mun landings and a Minmus landing later I was almost completely done with that tree. A solar probe and an Eve probe finished things off. I was sending probes to jool just to test the vista engine configurations I was coming up with.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T11:10:03Z\u0022 title=\u002212/03/2013 11:10  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by AdmiralTigerclaw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-03T12:47:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aazard\u0022 data-cite=\u0022Aazard\u0022\u003E\u003Cdiv\u003EMun looks odd, low space is 69km and high space is 60km??\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehe, where the values are grey they don\u0027t count. The problem areas have their characters in red. The red fields means that they aren\u0027t being detected. (IE, no atmosphere)\u003C/p\u003E\u003Cp\u003EFor planets without atmosphere it\u0027s only space high/low. So anything below the spacehigh treshold is space low. (except for landing)\u003C/p\u003E\u003Cp\u003EBut that \u0027might change\u0027, and I\u0027ll try to switch flyinghigh/low to near/far approach for planets without atmosphere. That way you\u0027ll still have 2 extra \u0027layers\u0027 even when there isn\u0027t atmosphere. Those 2 \u0027new\u0027 situations could be great for impact probes, and ladee probes, etc.\u003C/p\u003E\u003Cp\u003EI\u0027m fixing all those values with Nathan this week most likely. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-03T13:16:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AdmiralTigerclaw\u0022 data-cite=\u0022AdmiralTigerclaw\u0022\u003E\u003Cdiv\u003EI\u0027m game to assist in the progression of the aircraft nodes if you\u0027re still looking:\u003Cp\u003EIt\u0027s going to require B9, Firespitter, and TT Aerospace and Pizzaria, plus a modification for the RAMJET engine from TT for SCRAMJETs, and rather than two or three nodes, you\u0027ll have a split tree there with five nodes each for engines and \u0027wings\u0027. It should be noted that TT Pizzaria tweaks the aircraft engines to make them behave more realistically for their power curves between speed and altitude.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShould have specified, or you might not have noticed in to the comments. I\u0027m not implementing B9 or Firespitter, or TT Aerospace. One needs to realize how long it takes to move all those pieces into relevant areas. B9 alone is 100\u002B parts. Also the tree already has a quite impressively high amount of mods, and even using the texture compressor i\u0027m trailing 2.9GB. B9 alone might tip it over, very large pack indeed.\u003C/p\u003E\u003Cp\u003EI do want to revisit the Space Shuttle angle, right now there is nothing but the MK3 cockpit in that node. Would like to get at eleast one \u0027real\u0027 shuttle there. I think Bobcat has both Buran and US Shuttle?\u003C/p\u003E\u003Cp\u003EAt this stage, I\u0027d be more interested on how the parts of the included mods would go in the \u0022aircraft\u0022 section.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AdmiralTigerclaw\u0022 data-cite=\u0022AdmiralTigerclaw\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd that\u0027s my suggestion for the aircraft tree. Now a couple of comments about other things.\u003C/p\u003E\u003Cp\u003EI think the cost values for different sections still need tweaking. Your custom instrumentation gives very large injections of science when you complete each one, but the leaps going up the tree are extremely steep in price for stock experimentation. I suggest tweaking and integration with Kerbal Dust Experiment and L-Tech Science parts mods in mind. I also suggest reviewing how much science can be earned per \u0027range sphere\u0027 around kerbin based on these to work out about what \u0027tiers\u0027 take you what distances.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh do the values ever need tweaking still! I cannot disagree there! The issue stems from the lack of custom experiment implementation. Once I got the situation detection sorted for all bodies, I\u0027m going back to sort out the probes. We\u0027ll have Project Bumper, Explorer, Sputnik (1,2,3), Pioneer (0-4), Luna (1,2), etc. Technically, the way I originally calculated with the currently implemented custom experiments, you can unlock the first 2 tiers only. Then good luck with the stock science. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E (It\u0027s alpha! Wee! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m also going to try and implement project mercury \u0026amp; Gemini. (So that manned programs can start jumping into the custom experiment circle)\u003C/p\u003E\u003Cp\u003EUltimately, he goal is to move away from stock experiments and replace them with historical ones. With specific requirements, it creates basically a mission profile which I personally find very appealing. And yes, tiers are loosely based on what tech would be needed to reach the area and when was the historical mission launched/carried out. But still needs tweaking, with the massive infusion of probes for MS19, that\u0027ll be a much more granular experience, with more options.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AdmiralTigerclaw\u0022 data-cite=\u0022AdmiralTigerclaw\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere are a lot of biomes on kerbin. And they can ALL be reached by land if you\u0027re patient enough. (Thanks to Kerbin\u0027s continents having a double land bridge.) At the very least, give them the chance to explore the local biomes and let the local biomes at least play a useful part in the early game. From what I learned playing Nazari\u0027s (OR however that name\u0027s spelled), Traditional Tech Tree, getting around kerbin early on can be a pretty decent goal. (Before you go to space, explore your own world dangit!)\u003C/p\u003E\u003Cp\u003ESecond, I think a tier for wheels, perhaps integrating modular multiwheels and other wheel mods into the mix would also be good for the tree. Give the player the chance to run around on the ground a little early on and for lack of a better term \u0027drive\u0027 some of their experiments out to places. \u003C/p\u003E\u003Cp\u003EAs it stands, with your science tiers jumping in value rapidly, the meager science of the kerbin surface biomes pretty much makes them useless very quickly. Perhaps integrating the flight tree with some experiments, making them integral to helping advance the flight tech branches would be a way to go there.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow this is something I see a lot discussed, about having a \u0027plane phase\u0027 prior to the rocket phase. Now, this all depends on \u0027how far back\u0027 do you really want to go? I\u0027m aiming for the age of rocketry so to speak. (1950\u0027s and up). Mining Kerbin biomes surface/flying low for science I find is a bit gamey, and doesn\u0027t really fit well with the historical progression of the space program I\u0027m trying to do. Things like getting science from the LP, runway or around Mission Control are comical, but nonsensical when you think about it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I don\u0027t want science, especially on kerbin to become a scavenger hunt. I like distinct mission profiles and objectives of the space nature. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI do like modular multiwheels, has it been updated yet?\u003C/p\u003E\u003Cp\u003EAs for cost scaling vs available experiments, as I mentioned earlier, it\u0027s all going to be fixed once I add more experiments. My experiments will be scaled to the tree, and other tweaks applied as we move forward.\u003C/p\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-12-03T18:20:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EShould have specified, or you might not have noticed in to the comments. I\u0027m not implementing B9 or Firespitter, or TT Aerospace. One needs to realize how long it takes to move all those pieces into relevant areas. B9 alone is 100\u002B parts. Also the tree already has a quite impressively high amount of mods, and even using the texture compressor i\u0027m trailing 2.9GB. B9 alone might tip it over, very large pack indeed.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s worth the effort. And I\u0027m running everything you are and a bag of chips except for not having Real Sol. (I like the scaled down timeframe of stock Kerbin.) I have to sacrifice graphics quality for gameplay, but having the parts is well worth it. The argument runs headlong into expanding on aircraft gameplay though. So to say quite simply, if you like aircraft, you get those mods. If you don\u0027t like aircraft, you tend not to care too much.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI do want to revisit the Space Shuttle angle, right now there is nothing but the MK3 cockpit in that node. Would like to get at eleast one \u0027real\u0027 shuttle there. I think Bobcat has both Buran and US Shuttle?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s the Space Shuttle engines and tanks mod... \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAt this stage, I\u0027d be more interested on how the parts of the included mods would go in the \u0022aircraft\u0022 section.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI gave you the main catagories of aircraft progression. They require you to give them some TLC or anything you really do will just be a joke... Or rather, aircraft will look exactly as you\u0027re treating them, like an afterthought. Tweaking what I provided simply involves taking everything and lumping them into the correct catagories for engines and structure/wings.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOh do the values ever need tweaking still! I cannot disagree there! The issue stems from the lack of custom experiment implementation. Once I got the situation detection sorted for all bodies, I\u0027m going back to sort out the probes. We\u0027ll have Project Bumper, Explorer, Sputnik (1,2,3), Pioneer (0-4), Luna (1,2), etc. Technically, the way I originally calculated with the currently implemented custom experiments, you can unlock the first 2 tiers only. Then good luck with the stock science. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E (It\u0027s alpha! Wee! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m also going to try and implement project mercury \u0026amp; Gemini. (So that manned programs can start jumping into the custom experiment circle)\u003C/p\u003E\u003Cp\u003EUltimately, he goal is to move away from stock experiments and replace them with historical ones. With specific requirements, it creates basically a mission profile which I personally find very appealing. And yes, tiers are loosely based on what tech would be needed to reach the area and when was the historical mission launched/carried out. But still needs tweaking, with the massive infusion of probes for MS19, that\u0027ll be a much more granular experience, with more options.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA mistake I see here, is that you are providing this tech tree for others but operating on what \u003Cem\u003Eyou\u003C/em\u003E want. I\u0027m not going to go about this and say you\u0027re wrong, but I am going to stress a warning about following the \u0027I want\u0027 bug. Remember, KSP is all about what the player who\u0027s actually playing wants to do. You chase these historical missions too far down the rabbit hole and you\u0027re going to run into the problem of locking others into what YOU want. Part of the way the stock experiments work is that you don\u0027t get locked into \u0027one probe does this, another does that\u0027... You take a probe core you need and you stick the experiments on it to fit what you plan to do with it for that mission. However, I do like the Data Recorder setup you\u0027ve done. Experiments aren\u0027t simply fired off in an instant, but require some operating time to execute. If this function could be broken down into individual stock and add-on experiments, you\u0027d actually bring a whole new aspect to gameplay. For example, if KDEX (Kerbal Dust Experiment) got recoded to use your system, it could take several minutes to an hour to \u0027collect dust samples\u0027 from space (Assuming a fix for timewarp can make that hour go by quickly), and then, AFTER this run time, you can \u0027analyze collected samples\u0027 for science points. This alters the entire gameplay mechanic for science and makes the player actually have to take time-on-target into consideration when working a mission, rather than just \u0027passing by\u0027. A gravity experiment for another example, would require a decent amount of ToT. In fact, many of the stock experiments would result in more immersive gameplay because they actually do require some significant ToT.\u003C/p\u003E\u003Cp\u003EEven without the tech tree, you have modding GOLD right there.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow this is something I see a lot discussed, about having a \u0027plane phase\u0027 prior to the rocket phase. Now, this all depends on \u0027how far back\u0027 do you really want to go? I\u0027m aiming for the age of rocketry so to speak. (1950\u0027s and up). Mining Kerbin biomes surface/flying low for science I find is a bit gamey, and doesn\u0027t really fit well with the historical progression of the space program I\u0027m trying to do. Things like getting science from the LP, runway or around Mission Control are comical, but nonsensical when you think about it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I don\u0027t want science, especially on kerbin to become a scavenger hunt. I like distinct mission profiles and objectives of the space nature. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t like turning Kerbin into a scavenger hunt either... After a certain point, flying to the biomes and trying to land gets tedious. However, I\u0027m also loath to play the game, and have this big 1200 km diameter sphere you start on turn into nothing more than a glorified landing zone. Kerbin has such a nice diverse environment, and lots of interesting terrain to explore. Even at a 1/10 scale to real life, the place is HUGE. (You don\u0027t appreciate how huge until you\u0027ve had a sub-sonic aircraft do a half-globe flight to deliver a command truck.) It\u0027s likely the minecrafter in me talking, but when I look around KSC, I see the landscape in the distance and want to check it out. But I digress... Core point is, so much work went into Kerbin alone that just launching into space and forgetting about it aside from being a huge landing pad just seems wasteful. There\u0027s got to be some things to do utilizing the local biomes that\u0027s fun and refreshing to gameplay. Make Kerbin USEFUL to the player, and FUN to explore. I\u0027m not asking for the tech tree to come up with a solution to that. But I think that at least giving the player a runaround planet-side should factor in to game play. A little goal oriented jaunt that makes the planet and its biomes useful. A little \u0027from the ground up\u0027 experience. And with the way the research system works. If you don\u0027t force it early, you can literally IGNORE it entirely because it\u0027s just \u0027throw science points at it\u0027. Even Kethane and Extraplanetary Launchpads can ignore because really... All that stuff you can get from Mun and Minmus, and you don\u0027t have to launch it out of the gravity well.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI do like modular multiwheels, has it been updated yet?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly no... But I know that it only really needs someone to patiently step through the parts list and add the \u0027TechRequired\u0027 field to each cfg. Maybe add the PART { } bracket to the beginning/end of the cfg files. I forget which mods I had to do that for personally.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs for cost scaling vs available experiments, as I mentioned earlier, it\u0027s all going to be fixed once I add more experiments. My experiments will be scaled to the tree, and other tweaks applied as we move forward.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T23:14:18Z","Content":"\n\u003Cp\u003Ei dont really think we need more parts from firespitters (think of how long a flight to the badlands or poles would take!) or B9 (we have enough aero parts to make fine jets now). Although i would like to hear more about the stopping the need to scourer kerben for pitifully amounts of science points, prehaps removing all flying over/surface science from kerbin would be a good idea, keeping high atmosphere , near space and high space. players could start 40 points of science to spend right away but not have enough to go for one of the 50pt nodes of SRB\u0027s/rockets? any other ideas? \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBUT why add more slow planes and plane parts, its a rocket game in the age of rocketry after all!\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2013-12-04T01:16:13Z","Content":"\n\u003Cp\u003EI think you should make all the stock stuff doable maybe twice, three times like your custom experiments but more then once. I find it unrealistic that for a species going to space for the first time gets 10 science from each experiment, and 1 or 0 for each subsequent time. I think like 40 for each stock experiment, obviously a tweakable number, three times undiminished for at least kerbin space, and other planets, get rid of all stock kerbin experiments like temp, barometer and surface samples, crew reports and evas. If possible these experiments should be done by 3 different ships, to show checking of the results and not just using the same equipment and doing the same thing with potentially faulty instruments. This will help boost the available science at first, with about what, like 360 science from all the first stock things done three times, barely over your custom experiments done once, that is at least 3 launches still keeping the challenge. This way getting to the mun, would be even more attractive, with 400 to 500 more science on top of your custom experiments, only enough to get one node.\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\u003Cp\u003EEDIT: Forgot to mention, after the third time or whatever, it would, like your current custom experiments give no science.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T01:22:30Z\u0022 title=\u002212/04/2013 01:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by funfight22\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-12-04T03:14:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aazard\u0022 data-cite=\u0022Aazard\u0022\u003E\u003Cdiv\u003E (think of how long a flight to the badlands or poles would take!)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1 hour, 30 minutes.\u003C/p\u003E\u003Cp\u003EThat is the time it takes to fly a near antipodal route in a transport aircraft cruising at 10 km at mach .92.* You will not fly a single strictly aircraft flight longer than this on kerbin unless you\u0027re doing it on purpose. And any flights you fly with slower aircraft won\u0027t be far anyway before you\u0027ve picked up enough Sciiiience [/Dexter\u0027s Lab] to unlock faster aircraft components. And no science run will ever require an antipodal flight because the badlands are west of the antipidal point of KSC. (The Antipodal Point is in the ocean just west of crater gulf.)\u003C/p\u003E\u003Cp\u003E* The route was done using a 4-engine MkIV heavy fuselage-based aircraft carrying an 11 ton comm truck to station on the far side of kerbin as a backup control link center for remote tech II. At takeoff, the engines had 2 hours of fuel and at wheel stop at the destination, there was ~25 minutes of fuel remaining. The flight was performed entirely in real time, and Lazor System handled a great-circle autopilot course and altitude hold. Throttle was locked at max.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://smg.photobucket.com/user/admiraltigerclaw/media/CommTruckDeployed_zps6ae5ed41.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v430/admiraltigerclaw/CommTruckDeployed_zps6ae5ed41.jpg\u0022 alt=\u0022CommTruckDeployed_zps6ae5ed41.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn short, I don\u0027t have to imagine a badlands flight in a slow aircraft... I\u0027ve gone farther. And it\u0027s still shorter than a one-stage blackbird run in FSX.\u003C/p\u003E\u003Cp\u003EAnd the reason some of us want planes in a rocket game, is because we want planes and rockets in the same game, not rockets in one game and planes in another.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-04T06:29:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AdmiralTigerclaw\u0022 data-cite=\u0022AdmiralTigerclaw\u0022\u003E\u003Cdiv\u003E1 hour, 30 minutes.\u003Cp\u003EThat is the time it takes to fly a near antipodal route in a transport aircraft cruising at 10 km at mach .92.* You will not fly a single strictly aircraft flight longer than this on kerbin unless you\u0027re doing it on purpose. And any flights you fly with slower aircraft won\u0027t be far anyway before you\u0027ve picked up enough Sciiiience [/Dexter\u0027s Lab] to unlock faster aircraft components. And no science run will ever require an antipodal flight because the badlands are west of the antipidal point of KSC. (The Antipodal Point is in the ocean just west of crater gulf.)\u003C/p\u003E\u003Cp\u003E* The route was done using a 4-engine MkIV heavy fuselage-based aircraft carrying an 11 ton comm truck to station on the far side of kerbin as a backup control link center for remote tech II. At takeoff, the engines had 2 hours of fuel and at wheel stop at the destination, there was ~25 minutes of fuel remaining. The flight was performed entirely in real time, and Lazor System handled a great-circle autopilot course and altitude hold. Throttle was locked at max.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you playing with RSS?\u003C/p\u003E\u003Cp\u003EPretty sweet contraption you got there btw.\u003C/p\u003E\u003Cp\u003EAlso, very interesting ideas you have for space planes/planes. But right now I\u0027d rather focus on rocketry, probes and the capsule projects. Once that\u0027s well in place I\u0027d be willing to entertain having a deeper aviation side of things, or at least expand on it a little.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T06:40:04Z\u0022 title=\u002212/04/2013 06:40  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-04T06:37:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funfight22\u0022 data-cite=\u0022funfight22\u0022\u003E\u003Cdiv\u003EI think you should make all the stock stuff doable maybe twice, three times like your custom experiments but more then once. I find it unrealistic that for a species going to space for the first time gets 10 science from each experiment, and 1 or 0 for each subsequent time. I think like 40 for each stock experiment, obviously a tweakable number, three times undiminished for at least kerbin space, and other planets, get rid of all stock kerbin experiments like temp, barometer and surface samples, crew reports and evas. If possible these experiments should be done by 3 different ships, to show checking of the results and not just using the same equipment and doing the same thing with potentially faulty instruments. This will help boost the available science at first, with about what, like 360 science from all the first stock things done three times, barely over your custom experiments done once, that is at least 3 launches still keeping the challenge. This way getting to the mun, would be even more attractive, with 400 to 500 more science on top of your custom experiments, only enough to get one node.\u003Cp\u003EAny thoughts?\u003C/p\u003E\u003Cp\u003EEDIT: Forgot to mention, after the third time or whatever, it would, like your current custom experiments give no science.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m a bit confused. I set the base/cap science to the same value. So you should be getting 100% of the possible science from the experiment. Are you saying you are able to do the custom experiments more than once?\u003C/p\u003E\u003Cp\u003ENot sure if you saw my recent post, but probes are getting a massive overhaul with the addition of several historical probes with \u0022simulated\u0022 models. I use the terms simulated lightly. With the addition of project bumper, explorer and sputnik 1,2,3 it\u0027ll already be a huge relief for early tech levels. The experiments include in MS18 are pretty much more proof\u0027s of concepts than final model.\u003C/p\u003E\u003Cp\u003EAs for the number times you can perform an experiment it\u0027s based on the base/cap science values. IE, 5 base 10 cap, you can do the experiment twice. I\u0027m still swimming in the deep, but once I come up for air I can explain how the custom experiment plugin works and you could design your own experiments and we could share them to have some sort of crowd sourcing things going on. with experiment packs? Just a thought.\u003C/p\u003E\u003Cp\u003EAs for limiting them being done by the same ship, you could set the experiment to non repeatable, meaning that once the instrument has been used to make an experiment it\u0027s \u0027used\u0027 and cannot be done again during that flight. But then someone could slap more than one unit of that experiment, so still not possible to fully limit it technically. Maybe make a plugin for that? IE, have a current/previous vesselId variable and if they match then the experiment can\u0027t be triggered? No idea how someone would go about getting that done though.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T06:47:26Z\u0022 title=\u002212/04/2013 06:47  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"}]}