{"TopicId":53064,"ForumId":34,"TopicTitle":"[WIP][TechTree @ 0.23.5] - [MS19e] - Realistic Progression LITE","CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-11-14T04:44:51Z","PageNum":12,"Articles":[{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-11-30T23:53:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022123nick\u0022 data-cite=\u0022123nick\u0022\u003E\u003Cdiv\u003Ewhy do you need asmis life support mod AND tac life support? shouldnt you only need 1?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey both used to be listed as \u0022either or\u0022 but that was changed for some reason. I do believe that this is still the case though. Pick one or skip as you please.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-01T00:06:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BrickedKeyboard\u0022 data-cite=\u0022BrickedKeyboard\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI know I seem like a complainer, and maybe I am compared to the pros here, but I feel like I have a legitimate point of view. This thing needs a modpack installer like they eventually invented for Minecraft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing I have the problem most with is the tone and demeanor of your posts. You do realize that I am doing this on a volunteer basis, I don\u0027t work for squad, and I\u0027ve literally worked on this full time for more than a month now, more than 8 hours per day. No joke. (I\u0027m on temp work leave). The way you come in and say, I shouldn\u0027t need to have to do this or that, it\u0027s like you are demanding that I make things easy \u0027for you\u0027 and it came come of as slightly selfish and arrogant. Again, referring to the tone and way you express yourself. There is nothing wrong with \u0027hey it\u0027d be cool we have some kind of modpack\u0027. Rather than \u0027If you don\u0027t have a mod pack nobody is going to play this, Feed The Beast from MC does it right, this isn\u0027t working\u0027.\u003C/p\u003E\u003Cp\u003EI really think you aren\u0027t being considerate of the amount of work that\u0027s required to make this work, and that the fact that you might to download few things and tweak them, is quite a cheap payoff considering. Of all the feedback I\u0027ve received, yours seems always tainted with a layer of negativity and which as I said, I starting to find rude.\u003C/p\u003E\u003Cp\u003ERemind yourself, it\u0027s in ALPHA, meaning things are messed up and require quite a high level of finicky to get things right, and EVEN THEN, given it\u0027s in alpha things WILL STILL go wrong. If this is too much for you, give it some time and come back when this will reach beta stage or a later alpha. If you still want to stick around, then by all means lets\u0027 try to remain positive and open minded.\u003C/p\u003E\u003Cp\u003EAnd one of the reason B9 isn\u0027t in there, is that it\u0027s over 100 parts. I really don\u0027t feel like making yet another part list for that one, and then spend hours finding the parts in the tree and what not. There is more than enough parts IMHO. And if i\u0027m not mistaken, since I won\u0027t have B9 implemented, you could make yourself an MM config to set them to the tech nodes yourself.\u003C/p\u003E\u003Cp\u003EThank you,\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T00:14:15Z\u0022 title=\u002212/01/2013 12:14  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2013-12-01T00:10:36Z","Content":"\n\u003Cp\u003ECan someone post a few pictures and a craft file of something that will get into orbit/the mun? I can not seem to do either.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-01T00:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022123nick\u0022 data-cite=\u0022123nick\u0022\u003E\u003Cdiv\u003Ewhy do you need asmis life support mod AND tac life support? shouldnt you only need 1?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly need one, just as stated in the OP:\u003C/p\u003E\u003Cp\u003E\u0022(Support both of the below, but you need to pick one)\u003C/p\u003E\u003Cp\u003E#11 - TAC Life Support (link)- By TaranisElsu\u003C/p\u003E\u003Cp\u003E#12 - ECLSS - LINK - By Asmi \u0022\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-01T00:59:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funfight22\u0022 data-cite=\u0022funfight22\u0022\u003E\u003Cdiv\u003ECan someone post a few pictures and a craft file of something that will get into orbit/the mun? I can not seem to do either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a (poorly designed in hindsight that i under stand RSS/real fuels more now, but it works) 1st rockets node / 1st SRB that can send a flyby probe to the mun and return it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/705107842980056656/D1893A0C76643AEC8D8D608F2160066A82F93584/\u0022 alt=\u0022D1893A0C76643AEC8D8D608F2160066A82F93584\u0022\u003E\u003C/p\u003E\u003Cp\u003EI suggest SRB launch assisted Liquid helium lifter nearly to low orbit, a second liquid helium stage to circularize orbit, adjust planes with mun and take craft to low mun flyby/free return with a tiny N2O4 stage as return assist backup as it wont evaporate (\u0026amp; dont forget a tiny reaction wheel and a 25 units of RCS and two sets of 4 of the smallest RCS 4-way blocks, on the N2O4 backup stage with a small decoupler/tiny heatsheild, and small parachute with all science equip placed under it on last for safe reentry) that worked for my frist boggled attempts that worked\u003C/p\u003E\u003Cp\u003ENote that the strechy SRBs are now the ones i use as they are far easier to use/build with\u003C/p\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-01T01:01:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funfight22\u0022 data-cite=\u0022funfight22\u0022\u003E\u003Cdiv\u003ECan someone post a few pictures and a craft file of something that will get into orbit/the mun? I can not seem to do either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a whole thread for this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57626-Realistic-Solar-System-Launchers-MEGATHREAD\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57626-Realistic-Solar-System-Launchers-MEGATHREAD\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2013-12-01T01:51:36Z","Content":"\n\u003Cp\u003EOk, so I guess I need to just go way bigger. I thought I was already using a pretty big ship, but I guess we will see.\u003C/p\u003E\n"},{"CreatedByName":"sirklick","CreatedById":76119,"CreatedDateTime":"2013-12-01T02:06:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funfight22\u0022 data-cite=\u0022funfight22\u0022\u003E\u003Cdiv\u003EOk, so I guess I need to just go way bigger. I thought I was already using a pretty big ship, but I guess we will see.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESynchronous orbits and Munar intercepts pretty much require a rocket up to or past the rafters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Big big big!\u003C/p\u003E\n"},{"CreatedByName":"BrickedKeyboard","CreatedById":91822,"CreatedDateTime":"2013-12-01T02:28:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EThe thing I have the problem most with is the tone and demeanor of your posts. You do realize that I am doing this on a volunteer basis, I don\u0027t work for squad, and I\u0027ve literally worked on this full time for more than a month now, more than 8 hours per day. No joke. (I\u0027m on temp work leave). The way you come in and say, I shouldn\u0027t need to have to do this or that, it\u0027s like you are demanding that I make things easy \u0027for you\u0027 and it came come of as slightly selfish and arrogant. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI understand your point of view. However, keep in mind that while I am new to this game, I have about as much technical skill as anyone. Instructions that are split between multiple pages, buried in forum posts, etc, and leave critical information out cannot be followed by anyone who isn\u0027t an expert at KSP\u0027s internal systems. \u003C/p\u003E\u003Cp\u003EFurthermore, I know from long experience with minecraft that no one played anyone\u0027s mods until it become 1-click easy. You can whine all you want about the extra effort, but that\u0027s the fact : mods were virtually never played, except by a tiny (but vocal) minority until they made launchers and ways to load huge modpacks all at once. If you want your mod to leave alpha, all the files you can legally get away with need to be in a single folder, ideally one that uses an excutable installer.\u003C/p\u003E\n"},{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2013-12-01T02:47:05Z","Content":"\n\u003Cp\u003EThat is because in minecraft you have to extract jars and stuff, ksp is just drag and drop. For this set of mods, you just extract the zips into one folder, and drag the rt2 settings into the rt2 folder.\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-12-01T03:30:35Z","Content":"\n\u003Cp\u003EHello there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs much as we all appreciate constructive criticism, there\u0027s a certain line between on-topic discussion and nonsensical bickering among users. Please get back to the topic, that is: the mod itself, rather than this \u003Cem\u003Eargument\u003C/em\u003E about the choices made. There\u0027s no need to call for people\u0027s heads over the installation instructions, for crying out loud.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-12-01T13:25:47Z","Content":"\n\u003Cp\u003EI just went through this thread and I think the solution here is to be a bit more constructive: if the installation instructions are confusing, then maybe the project can be helped along by rewriting them instead of just pointing out they\u0027re confusing. Just an idea.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sparker","CreatedById":79522,"CreatedDateTime":"2013-12-01T13:39:37Z","Content":"\n\u003Cp\u003ECould you please give me a hint why I am getting only 1/3 science points for gravioly particle sensor readings? For example, when It says that the scienriffic value of the experiment is 60, I get only 20 science points.\u003C/p\u003E\n"},{"CreatedByName":"Hogbobson","CreatedById":95002,"CreatedDateTime":"2013-12-01T15:25:17Z","Content":"\n\u003Cp\u003EHello there! I\u0027m going to be a ******* and post this again since my last post kinda... drowned. xD\u003C/p\u003E\u003Cp\u003EI\u0027ve installed a helluva lot of mods to get this Realistic Overhaul thing to work, and I am really excited to get going. Alas, when I start a new game and look for your Tech Tree, MedievalNerd, I cannot seem to find it. I do not have TreeLoader (or I am too incompetent to find it), but the RPL doesn\u0027t show up in the loader, even after I selected stock at the startup.\u003C/p\u003E\u003Cp\u003ECould anyone please help me? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-01T15:27:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hogbobson\u0022 data-cite=\u0022Hogbobson\u0022\u003E\u003Cdiv\u003EHello there! I\u0027m going to be a ******* and post this again since my last post kinda... drowned. xD\u003Cp\u003EI\u0027ve installed a helluva lot of mods to get this Realistic Overhaul thing to work, and I am really excited to get going. Alas, when I start a new game and look for your Tech Tree, MedievalNerd, I cannot seem to find it. I do not have TreeLoader (or I am too incompetent to find it), but the RPL doesn\u0027t show up in the loader, even after I selected stock at the startup.\u003C/p\u003E\u003Cp\u003ECould anyone please help me? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI sent you a PM yesterday and you never replied. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESent you another one.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-01T20:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sparker\u0022 data-cite=\u0022Sparker\u0022\u003E\u003Cdiv\u003ECould you please give me a hint why I am getting only 1/3 science points for gravioly particle sensor readings? For example, when It says that the scienriffic value of the experiment is 60, I get only 20 science points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is an issue with how science points are reported, its a squad issue, as quoted from wiki:\u003C/p\u003E\u003Cp\u003E\u0022 Known Bugs\u003C/p\u003E\u003Cp\u003E The Seismic Scan, Gravity Scan and Atmosphere Analysis experiments show more science value in the report window than is retrieved upon recovery or transmission (issue 1578). \u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T21:24:00Z\u0022 title=\u002212/01/2013 09:24  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-01T20:29:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirklick\u0022 data-cite=\u0022sirklick\u0022\u003E\u003Cdiv\u003ESynchronous orbits and Munar intercepts pretty much require a rocket up to or past the rafters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Big big big!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a good reason to build \u0022fat/wide\u0022 1st stages with tank adapters/interstate fairings upto a skinnier last stage with a payload procedural fairing, atleast your rocket will be more manageable in the VAB and less \u0022tippy\u0022 on the launch pad.\u003C/p\u003E\u003Cp\u003EI was also new to RSS and it took me a few days to get the basics, now with tier 1 SRBs/Rockets (the first nodes after \u0022starting\u0022) and the 50MM omni antenna/ 600GM dish unlocked i can get comm sats geosynchronous easily and then do the unmanned mun flyby/free return with little fear of losing contact with probe. Once you get the high/near mun flyby done you can unlock more nodes (i suggest upto the 1000pts rockery node atleast) and start thinking about mun comms sats (note that the \u0022trailing/leading\u0022 dual mun probes trick is ALOT harder in RSS, i suggest 3 semi-synchronous mun comms sats) once they are up you can make your mun landing probe a rover that can travel 99.5% of muns surface (over a very long time lol) and start feeding KSC all the munar science they can take. \u003C/p\u003E\u003Cp\u003EAs a last point i can not stress how important it is to milk every last drop of possible science from each mission, ie bring atleast one of each sensor you have unlocked on each mission from stayputnik mk2 mission to your 1st manned obit, minus the magnetosphere probe once you have used them to the max in near/high space, including using a mk2 airplane cockpit to send a kerbal once into upper atmosphere, once for a manned orbit in every biome of near space/high space (the gravity detector \u0026amp; EVA reports are a GREAT source of science points in near/high space as the results are biome different in near space for EVA \u0026amp; near/high space for gravity sensor). this should let you unlock all science upto the science jr bay \u0026amp; then (after your comms network is up) build a plane for one massive flying/surface science in every biome that can pop into upper atmosphere (18km\u002B) atleast once to milk all the science from kerbin (enough to makeup for spending early points on science parts with about 50 to 75 points as \u0022extra earnings\u0022) Once kerbin is milked of science you dont have to worry about carrying science sensors to use once landed back on kerbin, just what will be needed for your mission goal, helping keep payload weight as low as possible. But a small jet with 3 basic jet engines will be limited at just under mach 1 at 12km up making it a long trip to the pole/tundra/badlands/deserts so be ready to spend 1 mission \u0022slowly\u0022 flying/landing in the biomes of kerbin for about an hour and a 1/2 (dont forget launchpad, runway \u0026amp; KSC itself are all surface only biomes you can milk for points) Science logs mod will really help you track science points remaining (seems to require you to enter VAB once after a landing for it to update correctly)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYikes, i am having \u0022waste heat issues\u0022 on my latest mission, anyone know where radiators are in tech tree?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@MedievalNerd: i suggest placing the smallest radiator (its new in the latest interstellar package) in the starting or 1st probes tier, its not very effective but would help alot for the 1st long duration missions (eve/duna flybys/returns, long term rovers) instead of spending your small starting pool of science points attempting to find a radiator in the techtree (or it would be nice to have a break down of what is in each tech node as a pdf or even txt note so we can know where to aim our personal 4X style goals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAlso do you know how to make your tweak files allow a EVA report \u0026amp; surface sample from the runway, its about 25 to 30 science points that are sorely needed at the start of game?!? i cant get them to function but i can get crew reports/science equip readings there \u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T22:45:15Z\u0022 title=\u002212/01/2013 10:45  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GeoffreyY","CreatedById":39022,"CreatedDateTime":"2013-12-02T09:00:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hogbobson\u0022 data-cite=\u0022Hogbobson\u0022\u003E\u003Cdiv\u003EHello there! I\u0027m going to be a ******* and post this again since my last post kinda... drowned. xD\u003Cp\u003EI\u0027ve installed a helluva lot of mods to get this Realistic Overhaul thing to work, and I am really excited to get going. Alas, when I start a new game and look for your Tech Tree, MedievalNerd, I cannot seem to find it. I do not have TreeLoader (or I am too incompetent to find it), but the RPL doesn\u0027t show up in the loader, even after I selected stock at the startup.\u003C/p\u003E\u003Cp\u003ECould anyone please help me? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m having the same issue here. \u003C/p\u003E\u003Cp\u003EProbably it\u0027s just me being extra stupid again, but please do post the solution in case somebody else stumble upon the same problem.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"BlackGlass Sand","CreatedById":95243,"CreatedDateTime":"2013-12-02T12:17:06Z","Content":"\n\u003Cp\u003EHello. Loving the mod. \u003C/p\u003E\u003Cp\u003EI read through most posts, but couldn\u0027t find a solution to my problem... Getting used to deadly re-entry is great fun, but of course I\u0027m burning up probes while learning. The problem, is that every time I have a catastrophic failure and the probe or whatever blows up, the mouse stops highlighting the buildings at headquarters. When I exit to main menu, the mouse pointer wont highlight the menu options, so I have to alt-tab out and kill the game.\u003C/p\u003E\u003Cp\u003EIf anyone has a solution to this, I\u0027d appreciate a heads up, because it takes a while to reload the game every time this happens. My guess is it\u0027s tied (possibly) into the loss of control of the kerbal/probe from the Remote Tech mod but who knows.\u003C/p\u003E\u003Cp\u003EThanks for a great mod though!!\u003C/p\u003E\n"},{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2013-12-02T12:25:27Z","Content":"\n\u003Cp\u003EAre you guys looking for RPL_18 or something like that? I was confused at first also, did not think of the abreviation.\u003C/p\u003E\n"},{"CreatedByName":"GeoffreyY","CreatedById":39022,"CreatedDateTime":"2013-12-02T12:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funfight22\u0022 data-cite=\u0022funfight22\u0022\u003E\u003Cdiv\u003EAre you guys looking for RPL_18 or something like that? I was confused at first also, did not think of the abreviation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas playing at 720p windowed and the option was cut-offed. Woop-dee-doo.\u003C/p\u003E\n"},{"CreatedByName":"lmw5201","CreatedById":23973,"CreatedDateTime":"2013-12-02T15:32:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlackGlass Sand\u0022 data-cite=\u0022BlackGlass Sand\u0022\u003E\u003Cdiv\u003E The problem, is that every time I have a catastrophic failure and the probe or whatever blows up, the mouse stops highlighting the buildings at headquarters. When I exit to main menu, the mouse pointer wont highlight the menu options, so I have to alt-tab out and kill the game.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been experiencing same kind of problem long before. \u003C/p\u003E\u003Cp\u003E I can\u0027t exactly remember when it first happend, but it is obvious that this techpack isn\u0027t causing the problem. It may be KSP\u0027s one of bugs...\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-02T15:48:20Z","Content":"\n\u003Cp\u003EAnyone found an effective fuel mixture for landers that isnt \u0022cryogenic\u0022 (doesnt evaporate)? I am having a small issue with finding the right mixtures for each of my stages, i got the idea of liquid fuel/liquid oxygen or LH2/liquid oxygen make for good early stages to orbit, what do i want to for a long duration stage?? very upsetting to reach my destination only to find a good chunk of my landing delta-v has evaporated dooming me to impact \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf anyone has a deeper understanding of \u0022real fuels\u0022, a small description of existing fuel mixtures and their basic uses (what is best to lift to orbit altitude \u0026amp; near circularizing of orbit, what is best transferring between bodies and/or to higher orbits, and what is best for destination landers/return?) and could post it here it would really help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T15:55:22Z\u0022 title=\u002212/02/2013 03:55  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-12-02T15:57:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aazard\u0022 data-cite=\u0022Aazard\u0022\u003E\u003Cdiv\u003EAnyone found an effective fuel mixture for landers that isnt \u0022cryogenic\u0022 (doesnt evaporate)? I am having a small issue with finding the right mixtures for each of my stages, i got the idea of liquid fuel/liquid oxygen or LH2/liquid oxygen make for good early stages to orbit, what do i want to for a long duration stage?? very upsetting to reach my destination only to find a good chunk of my landing delta-v has evaporated dooming me to impact \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMMH - N2O4 is the standard mixture I use for long distance landers. It isn\u0027t as efficient as LH-LOX but it isn\u0027t cryogenic and its quite dense. So you don\u0027t need that big a tank.\u003C/p\u003E\u003Cp\u003EIIRC there is also a thermal fin in the science tab that you can use to cool your cryogenic fuels. You could just add that on a decoupler to act as a fridge for the interplanetary trip.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-12-02T17:36:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlackGlass Sand\u0022 data-cite=\u0022BlackGlass Sand\u0022\u003E\u003Cdiv\u003EHello. Loving the mod. \u003Cp\u003EI read through most posts, but couldn\u0027t find a solution to my problem... Getting used to deadly re-entry is great fun, but of course I\u0027m burning up probes while learning. The problem, is that every time I have a catastrophic failure and the probe or whatever blows up, the mouse stops highlighting the buildings at headquarters. When I exit to main menu, the mouse pointer wont highlight the menu options, so I have to alt-tab out and kill the game.\u003C/p\u003E\u003Cp\u003EIf anyone has a solution to this, I\u0027d appreciate a heads up, because it takes a while to reload the game every time this happens. My guess is it\u0027s tied (possibly) into the loss of control of the kerbal/probe from the Remote Tech mod but who knows.\u003C/p\u003E\u003Cp\u003EThanks for a great mod though!!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually a stock issue, that DRE brings to light. If your vessel explodes while experiencing re-entry effects (the flames) it causes the UI to become responsive if you return to the space center. There is a \u0027sort of\u0027 fix for this, if you revert to VAB, proceed to LP, and then you can go back to the Space Center and all will be well.\u003C/p\u003E\u003Cp\u003EVery odd issue indeed.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003ETook my first weekend off working on the plugin/tech tree. Back online as of this morning. Just to give an idea of what is going on right now, I\u0027m going over the stock detection of situations (FlyingHigh/low,etc.) vs the method I\u0027ve borrowed from Ethernet. Either we need to get the RSS CelestialParams tweaked, or I have to make some updates to the method. Either way I\u0027ll get to the bottom of this.\u003C/p\u003E\u003Cp\u003EOnce this is fully resolved, I\u0027ll get back to making probes, and reviewing their tech tree line. Thinking of going by project name, IE:\u003C/p\u003E\u003Cp\u003EProject Bumper\u003C/p\u003E\u003Cp\u003ESputnik (1,2,3)\u003C/p\u003E\u003Cp\u003EProject Explorer\u003C/p\u003E\u003Cp\u003EProject Pioneer (0,1,2,3,4)\u003C/p\u003E\u003Cp\u003ELuna (1,2,3)\u003C/p\u003E\u003Cp\u003EThis should all be doable with Tier 1 Tech (1955\u002B). Where possible and if it doesn\u0027t become more of a hassle, I\u0027ll itemize their scientific accomplishments separately as their own experiments.\u003C/p\u003E\u003Cp\u003EFor Manned experiments, I\u0027ll do Project Mercury \u0026amp; Gemini first. As some of these move to more complex \u0022conditions\u0022 might be worth starting to implement a few MCE missions to complement the experience. Although that\u0027s a bit of pandora\u0027s box, as before using MCE I want to do a cost overhaul/review and that will be, soo damn long. lol, so I think I\u0027ll do my best to make it \u0027work\u0027 without it for now.\u003C/p\u003E\u003Cp\u003EThanks again for all those participating in this super buggy alpha, suggestions and issues reported are being noted and hopefully addressed in Milestone 19.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T19:08:40Z\u0022 title=\u002212/02/2013 07:08  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"}]}