{"TopicId":53185,"ForumId":24,"TopicTitle":"So I finally made a forum account","CreatedByName":"JavaTC","CreatedById":92963,"CreatedDateTime":"2013-11-15T06:33:28Z","PageNum":1,"Articles":[{"CreatedByName":"JavaTC","CreatedById":92963,"CreatedDateTime":"2013-11-15T06:33:28Z","Content":"\n\u003Cp\u003EI\u0027ve been playing the game for months now, but never decided to actually make a forum account. Mostly because I never thought I would get that into the game. I have a minor interest in astronomy and meteorology, and a passion for simulators, but I fell in love with this game for some reason. Maybe because it keep a nice balance of realism without having a learning curve that\u0027s too steep for a casual gamer, or maybe it\u0027s because the goals are so great.\u003C/p\u003E\u003Cp\u003EMy first successful Mun mission today without killing or standing poor Jeb is what finally made me join. I hope to have a long stay \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoodSirMortimer","CreatedById":93035,"CreatedDateTime":"2013-11-15T09:37:21Z","Content":"\n\u003Cp\u003ELet me be the first to say welcome aboard Java! May there be many more successful missions in your future. On a side note, if you can get to Mun and back you could probably do the same for Minmus with the same craft. The lower gravity means you save a lot of fuel during the landing stage. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-11-16T02:11:11Z","Content":"\n\u003Cp\u003EWelcome to the Kerbal forums! Good luck with all future missions!\u003C/p\u003E\n"},{"CreatedByName":"austin4050","CreatedById":66368,"CreatedDateTime":"2013-11-16T02:44:15Z","Content":"\n\u003Cp\u003EI also hope you have a long stay here!! Also great job on your mission, it is a huge self-achievement when you first land on the mun, heck when you first get into an orbit it is awesome!! Hope you like it here!\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2013-11-16T03:34:31Z","Content":"\n\u003Cp\u003EWelcome aboard.\u003C/p\u003E\u003Cp\u003EWe love struts, boosters and screenshots here. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}