{"TopicId":5338,"ForumId":18,"TopicTitle":"Your Zombie Plan?","CreatedByName":"Altair1371","CreatedById":6754,"CreatedDateTime":"2012-01-11T07:46:05Z","PageNum":4,"Articles":[{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-08-05T16:24:18Z","Content":"\n\u003Cp\u003EHour 1: Stand around\u003C/p\u003E\u003Cp\u003EHour 2: Go to McDonalds\u003C/p\u003E\u003Cp\u003EHour 23.6: Try to commit suicide\u003C/p\u003E\u003Cp\u003EHour 27: Get infected\u003C/p\u003E\u003Cp\u003Eyeah, i can\u0027t do much else\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-08-05T16:34:48Z","Content":"\n\u003Cp\u003EGather up my firearms and ammo.\u003C/p\u003E\u003Cp\u003EHead to the hangar.\u003C/p\u003E\u003Cp\u003EFly my plane to somewhere more remote. \u003C/p\u003E\u003Cp\u003ESet up camp.\u003C/p\u003E\u003Cp\u003ERide it out.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2014-08-05T17:47:05Z","Content":"\n\u003Cp\u003EAre we talking about zombies here, or did you mean infected? Zombies are those slow and dumb things that eat brains. Infected, on the other hand, are extremely dangerous - they are still alive, and behave very much like humans.\u003C/p\u003E\u003Cp\u003EI\u0027m going to assume the worst case scenario - infected.\u003C/p\u003E\u003Cp\u003E1) Call a couple friends and ask them to help. Because it\u0027s easier to survive together.\u003C/p\u003E\u003Cp\u003E2) Load our truck with whatever supplies we can find in our house (and the friends\u0027 houses as well)\u003C/p\u003E\u003Cp\u003E3) Steal diesel from other cars and fill jerry cans with it. Chances are most gas stations have already been raided and there is no fuel left there.\u003C/p\u003E\u003Cp\u003E4) Get in the car and head north, towards the less populated areas.\u003C/p\u003E\u003Cp\u003E5) There is no number five. All the plans go out the window. From this point on, survival depends on our ability to assess the situation carefully and make the right decisions.\u003C/p\u003E\n"},{"CreatedByName":"ScopusAurelius","CreatedById":111937,"CreatedDateTime":"2014-08-05T18:15:24Z","Content":"\n\u003Cp\u003EDay One: Start making you ladies do my dishes.\u003C/p\u003E\u003Cp\u003EDay Two: Feed the weak among you to zombies.\u003C/p\u003E\u003Cp\u003EDay Three: Settle coastal barrier island with enough acreage to sustain us.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-08-06T02:12:50Z","Content":"\n\u003Cp\u003EHour 1: Establish contact with some friends\u003C/p\u003E\u003Cp\u003EHour 1: Gather every defensive weapon in my house (Katana, kitchen knife, a pistol, blowtorch, my kerosene squirt gun, my broad sword, chisel, hammer, hatchet, drain-o, etc.)\u003C/p\u003E\u003Cp\u003EHour Two: Begin to load every food and medical item in my house into my mother\u0027s hybrid\u003C/p\u003E\u003Cp\u003EHour Two: meet up with group of friends who have gathered every single usable item in their homes \u003C/p\u003E\u003Cp\u003EHour Two: Load every single usable item my friends and i have gathered into the hybrid.\u003C/p\u003E\u003Cp\u003EHour Three: Begin to head south west, traveling only along back-routes looting surrounding neighborhoods\u003C/p\u003E\u003Cp\u003EDay Two: Constantly take shifts driving, sleeping.. Every time we enter a neighborhood we give the horn one short blare, in an attempt to draw out any local infected. Once we gather all of the usable materials, we set off a timed drain-o bomb, allowing us to move the infected behind us.\u003C/p\u003E\u003Cp\u003EThis continues for the first week\u003C/p\u003E\u003Cp\u003EWeek Two: We begin to loot farms for seeds, and poultry, eventually we move to the gulf of Mexico searching for an Oil Tanker\u003C/p\u003E\u003Cp\u003EAn Oil tanker is ideal for several reasons\u003C/p\u003E\u003Cp\u003E1: Infinite fuel\u003C/p\u003E\u003Cp\u003E2: Infinite water for farming\u003C/p\u003E\u003Cp\u003E3: Communication\u003C/p\u003E\u003Cp\u003E4: Safety from Zombies\u003C/p\u003E\u003Cp\u003E5: Safety from human attacks\u003C/p\u003E\u003Cp\u003E6: Quarantine from disease\u003C/p\u003E\u003Cp\u003E7: Medical supplies\u003C/p\u003E\u003Cp\u003E8: Fish!\u003C/p\u003E\u003Cp\u003E9: Libraries \u003C/p\u003E\u003Cp\u003EWe then ride out the apocalypse, trading the oil we produce for women, gold, books, and weapons\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-08-06T08:49:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd what will be your pirate name? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Legendary Emu","CreatedById":71911,"CreatedDateTime":"2014-08-06T19:31:58Z","Content":"\n\u003Cp\u003EHour 1: Pack a bag full of everything I need\u003C/p\u003E\u003Cp\u003EHour 2: Friends and family fly to Newfoundland (my brother was training to be a pilot so he knows how to fly)\u003C/p\u003E\u003Cp\u003EHour 5-End: Hang out in Newfoundland or sail over to Greenland and then Iceland\u003C/p\u003E\u003Cp\u003EAlso, this happened. Makes me proud to be Canadian.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ueBZuZAoglE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-08-06T20:18:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EAnd what will be your pirate name? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDr.Vanhicktenstein, and his routy band of mad men\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-08-07T17:42:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Legendary Emu\u0022 data-cite=\u0022Legendary Emu\u0022\u003E\u003Cdiv\u003EHour 1: Pack a bag full of everything I need\u003Cp\u003EHour 2: Friends and family fly to Newfoundland (my brother was training to be a pilot so he knows how to fly)\u003C/p\u003E\u003Cp\u003EHour 5-End: Hang out in Newfoundland or sail over to Greenland and then Iceland\u003C/p\u003E\u003Cp\u003EAlso, this happened. Makes me proud to be Canadian.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ueBZuZAoglE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow has America not collapsed under its own ignorance?\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-08-09T14:09:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Javster\u0022 data-cite=\u0022Javster\u0022\u003E\u003Cdiv\u003EHow has America not collapsed under its own ignorance?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know, I\u0027m afraid. I don\u0027t know.\u003C/p\u003E\u003Cp\u003EAnyways, right off of the top of my head I think I would rush to the stores and get as much food and water as I can. Probably a lot of honey, since it never gets old. For shelter, I\u0027d probably get as far ito the country as possible and avoid any major settlement. Weapons? Anything I happen to be lucky to find.\u003C/p\u003E\n"},{"CreatedByName":"SlimeCrusher","CreatedById":105427,"CreatedDateTime":"2014-08-09T14:43:56Z","Content":"\n\u003Cp\u003EOk...\u003C/p\u003E\u003Cp\u003EHour 1: I would go outside, enter to my workshop and grab all the stuff i can grab, wood, nails, a hammer and maybe a chainsaw.\u003C/p\u003E\u003Cp\u003EHour 2: I would get inside and start to barricade my windows, i would let my door uncovered though, i live elevated 2 meters above the ground, bellow is the workshop. I don\u0027t think zombies will be able to climb up...\u003C/p\u003E\u003Cp\u003EHour 3: I would make some homemade weapons, maybe a plank with alot of nails on it, and maybe a crappy crossbow.\u003C/p\u003E\u003Cp\u003EHour 5: Having my weapons done, i would get out and go to the nearest grocery store, then grab some food, optimally food that doesn\u0027t expire... And maybe some peanuts...\u003C/p\u003E\u003Cp\u003EHour 6: After raiding the store, i go back to my house, i put all the food in the freezer.\u003C/p\u003E\u003Cp\u003EHour 7: I get outside and go to the nearest metals shop (Or however is called), i then grab all the metal sheets i can get, aluminium, iron, anything!\u003C/p\u003E\u003Cp\u003EHour 9: I go back to my house and i start upgrading my defenses.\u003C/p\u003E\u003Cp\u003EHour 11: I go to sleep...\u003C/p\u003E\u003Cp\u003EDay 2\u003C/p\u003E\u003Cp\u003EHour 1: I get out and i put some armor on my car, i cut a hole on the top and make some sort of shield for the hole, will use that for another thing later on.\u003C/p\u003E\u003Cp\u003EHour 3: I get inside my car and go find a military outpost, i get out and see if i can find a machine gun or something, and some bullets.\u003C/p\u003E\u003Cp\u003EHour 5: I put the loot in my car and go back, then i design some sort of machine gun mount, and mount that on the hole on the top.\u003C/p\u003E\u003Cp\u003EHour 7: I grab all the food i can grab and put it on my car, but at this time the car struggles to move because of the weight, still it works.\u003C/p\u003E\u003Cp\u003EHour 8: I get to a cars shop (Or whatever), i grab a more powerful suspension, a more powerful engine and maybe bigger wheels.\u003C/p\u003E\u003Cp\u003EHour 12: I spend most of my time installing the stuff, i sleep inside my car\u003C/p\u003E\u003Cp\u003EDay 3:\u003C/p\u003E\u003Cp\u003EHour 1: I start driving towards the coast.\u003C/p\u003E\u003Cp\u003EHour 7: Got to the coast, i drive until i find a big-ish boat.\u003C/p\u003E\u003Cp\u003EHour 8-30: I put all my stuff inside of the boat, including the machine gun mount in wich i mount on the boat\u0027s back, the car will stay there.\u003C/p\u003E\u003Cp\u003EHour 9-Infinity: I start sailing out towards the ocean, hoping to find an oilrig or something in wich i can live in\u003C/p\u003E\u003Cp\u003ENow, i wish im with some friend or something when the apocalipsis begins, i don\u0027t want to be alone for 32 years ._.\u003C/p\u003E\n"},{"CreatedByName":"vinsent10","CreatedById":63829,"CreatedDateTime":"2014-08-09T19:00:37Z","Content":"\n\u003Cp\u003EDoing it,SWEDISH STYLE!!!!!! \u003C/p\u003E\u003Cp\u003E1.raid local lidl on all cans of beans.\u003C/p\u003E\u003Cp\u003E2.go to weapon store right beside Lidl\u003C/p\u003E\u003Cp\u003E3.Go and hide at local mine which hasn\u0027t been in use since 1992 \u003Cimg src=\u0022http://i.imgur.com/WeeDnR5.jpg\u0022 alt=\u0022WeeDnR5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-09T19:02:43Z\u0022 title=\u002208/09/2014 07:02  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 9, 2014\u003C/time\u003E by vinsent10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-11T01:03:21Z","Content":"\n\u003Cp\u003EEither A:\u003C/p\u003E\u003Cp\u003EA Hour 1: get all supplies in my house (Food, Water, Etc.) And put them in easy to find places, then (Somehow) board up all the windows and doors.\u0027\u003C/p\u003E\u003Cp\u003EA Until I Die Due To Thirst Or Starvation: Just be in my super safe house until I die. I will have a lot of time to play KSP, so no boredom.\u003C/p\u003E\u003Cp\u003E(I\u0027m a bit weak and skinny, so this has no running away from zombies or life-or-death situations)\u003C/p\u003E\u003Cp\u003EOr B:\u003C/p\u003E\u003Cp\u003EB Hour 1: Get some supplies and a weapon (Probably hammer), and try to find some other survivors, who probably know what there doing.\u003C/p\u003E\u003Cp\u003EB Hour 2: Survive with the other survivors until no more zombies (Some how).\u003C/p\u003E\u003Cp\u003EEDIT: I just realized you can put all these plans to the test in Project Zomboid!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-11T01:07:05Z\u0022 title=\u002208/11/2014 01:07  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 11, 2014\u003C/time\u003E by Nicholander\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cocox","CreatedById":108646,"CreatedDateTime":"2014-08-11T22:23:28Z","Content":"\n\u003Cp\u003EZombies are my least concern..\u003C/p\u003E\u003Cp\u003EProblem is that half the planet population has an IQ lower than the zombies.. just go for a walk and look around.. or even better, check out the fail compilations on YouTube..\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-08-11T23:24:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Legendary Emu\u0022 data-cite=\u0022Legendary Emu\u0022\u003E\u003Cdiv\u003EHour 1: Pack a bag full of everything I need\u003Cp\u003EHour 2: Friends and family fly to Newfoundland (my brother was training to be a pilot so he knows how to fly)\u003C/p\u003E\u003Cp\u003EHour 5-End: Hang out in Newfoundland or sail over to Greenland and then Iceland\u003C/p\u003E\u003Cp\u003EAlso, this happened. Makes me proud to be Canadian.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ueBZuZAoglE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust another reason why Canada is awesome.\u003C/p\u003E\n"},{"CreatedByName":"kenbobo","CreatedById":70629,"CreatedDateTime":"2014-08-12T01:20:59Z","Content":"\n\u003Cp\u003E... \u003C/p\u003E\u003Cp\u003EIf zombies are humans, humans need water. People last 3 days with out water. They only know how to eat. So here is my plan\u003C/p\u003E\u003Cp\u003EStep 1- Lock doors (have one really thick steel door, and one ultra locked wood one) , get to top floor (they can\u0027t climb) \u003C/p\u003E\u003Cp\u003EStep 2- Get all food from my cupboard and stash in my room and lock that door.\u003C/p\u003E\u003Cp\u003EStep 3- Watch the news/ksp forums and watch panic and laugh.\u003C/p\u003E\u003Cp\u003EStep 4- Sleep with knowledge that they will die in 3 days.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-08-12T01:43:48Z","Content":"\n\u003Cp\u003EZombies can climb, zombies can\u0027t die as they are already undead, relieving them of their need for water. You may want to rethink your plan. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt.Joseph Kerbertson","CreatedById":57354,"CreatedDateTime":"2014-08-12T02:08:50Z","Content":"\n\u003Cp\u003EI can tell you right now, the whole raid a grocery store? EVERYONE is going to be doing that. You have a greater chance of dying there at the hands of terrified survivors than you do of the actual zombies. Your best bet is to have a central location with 2 to 3 weeks of supplies and hunker down, then you start going out and salvaging what you can. You fill all of your bathtubs with water (instant 45 gallons each tub) as humans require 1 gallon per day for drinking, cooking and cleaning.\u003C/p\u003E\u003Cp\u003EI\u0027m going to sort of go over my plan that I have in place for real emergencies (I live on the Gulf Coast and hurricanes have left me without power and drinkable water several times)\u003C/p\u003E\u003Cp\u003E1. Prepare beforehand. Have a plan in place well before disaster happens. Ensure that everyone in your buddy list knows what to do.\u003C/p\u003E\u003Cp\u003E2. If you are going to use generator, only use it sparingly. Welding a new muffler onto it helps hide it\u0027s signature, annoying BRRRRAAAAAAPPPPAAAAA turns into a hum. Now Honda makes a nice next to silent generator... but it ain\u0027t cheap.\u003C/p\u003E\u003Cp\u003EAlso, do not run the generator in the house, chain it up outside where you can see it, but passers by cannot. This is why you want to muffle it.\u003C/p\u003E\u003Cp\u003E3. Light control. Power is supposed to be out, so don\u0027t have every light on in your shelter. You will attract something worse than zombies and that\u0027s thieves. Power should be running things like your fridge and fans to help keep you cool or a heater to keep you warm. \u003C/p\u003E\u003Cp\u003E4. Ration your food. You are now in an emergency situation, you don\u0027t know how long food is going to last. Humans require 2000cal to maintain weight. Unfortunately, you aren\u0027t going to be getting that. You are going to get hungry... don\u0027t gorge on all your food, make it last as long as possible while keeping you alive and alert.\u003C/p\u003E\u003Cp\u003E5. Depending on how many folks you have in your group, you will want to start sending people out for stuff. First and foremost, you want to avoid places where people are always going to collect. Grocery stores. If this is truly a SHTF moment and people are dying and there is no end in sight, \u0022looting\u0022 is alright. I\u0027m not talking about grabbing that 80 inch TV you saw your neighbor Hank haul in last week. I\u0027m talking about going house to house, the ones that are unoccupied (verify) and taking the food inside. If you know that your neighbors are still around... don\u0027t be that guy and steal from him, they are doing what you are and that\u0027s trying to survive, don\u0027t make it harder than it already is.\u003C/p\u003E\u003Cp\u003EHere are some skills you are probably going to need SHTF (stuff hits the fan)\u003C/p\u003E\u003Cp\u003EHow to start a fire. Lighters won\u0027t be around nor do they last. A good flint and steel bar will set you back all of 7 bucks some even come with magnesium to aid in fire starting.\u003C/p\u003E\u003Cp\u003EHunting and cleaning game. Eventually, your food is going to run out.\u003C/p\u003E\u003Cp\u003EDressing wounds. Doctors are going to be in short supply.\u003C/p\u003E\u003Cp\u003EPurifying or making water potable. Water is life. Not all water is safe. \u003C/p\u003E\u003Cp\u003EUsing firearms. You are going to need it to survive, either to eat or to defend yourself. Just buying a gun does you no good if you can\u0027t use it. Spend time at a range. Fire many rounds, learn how to clear jams, misfires, how to maintain the weapon.\u003C/p\u003E\u003Cp\u003EI\u0027m sure there is lot\u0027s more, but realistically, the best thing you can do is have a plan and have preparations in place. Not going to lie, I have 3 months of food for 4 people and these things called waterbobs. First sign of trouble, I fill up the waterbobs and start going through my list.\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-08-12T02:18:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdFred\u0022 data-cite=\u0022EdFred\u0022\u003E\u003Cdiv\u003Ezombies can\u0027t die as they are already undead, relieving them of their need for water. You may want to rethink your plan. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Altair1371\u0022 data-cite=\u0022Altair1371\u0022\u003E\u003Cdiv\u003EThe zombies are infected people, not undead. Think Left 4 Dead as a reference. That means that they will slowly starve.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EYe, I think that hiding in the basement is a good plan.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-08-12T02:37:05Z","Content":"\n\u003Cp\u003E1) Become a zombie.\u003C/p\u003E\u003Cp\u003EI think that would be the long story short for most people, and sadly, people here are probably no exception.\u003C/p\u003E\n"},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2014-08-12T18:09:44Z","Content":"\n\u003Cp\u003EI don\u0027t think (if they existed) zombies would be undead. That could be only possible in magic-worlds. A body (especially as complex as the humans\u0027) needs a powerful nervous system (including the brain) to be able to move, do activities, or even to live. A virus or bacteria isn\u0027t complex enough to manage that task alone. There could be a virus which would infect the human\u0027s brain, but the human (or its zombie body) would still need that infected brain to interact with the environment. There are examples in the nature for mind-control, like fungus responsible for the so-called \u0022zombie ants\u0022 (google it).\u003C/p\u003E\u003Cp\u003ESo I think that zombie still needs a brain to control its body, without it it would be a lifeless corpse.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-12T18:14:47Z\u0022 title=\u002208/12/2014 06:14  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 12, 2014\u003C/time\u003E by jmiki8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tahib","CreatedById":111243,"CreatedDateTime":"2014-10-19T12:16:30Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EYour Zombie PLan\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYour Ebola Plan?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI have no idea.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-19T14:39:33Z","Content":"\n\u003Cp\u003ENUKE! solves zombies (and ebola. I mean seriously whats wrong with the carpet-nuking of Africa?)\u003C/p\u003E\n"},{"CreatedByName":"GamerKitsune","CreatedById":124949,"CreatedDateTime":"2014-10-19T15:02:33Z","Content":"\n\u003Cp\u003E1. Grab all people I want to rescue.\u003C/p\u003E\u003Cp\u003E2. Go to Winchesters and wait for all this to blow over.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-19T16:45:11Z","Content":"\n\u003Cp\u003Eactually my real plan is:\u003C/p\u003E\u003Cp\u003E1. buy wildstar and loads of the game time card things.\u003C/p\u003E\u003Cp\u003E2. board up house after finding stuff to eat.\u003C/p\u003E\u003Cp\u003E3.play wildstar. and star citizen\u003C/p\u003E\n"}]}