{"TopicId":53525,"ForumId":44,"TopicTitle":"Space Elevator or Mass Driver/Railgun or something else.","CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-11-18T12:10:50Z","PageNum":1,"Articles":[{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-11-18T12:10:50Z","Content":"\n\u003Cp\u003EIn my opinion Space Elevators are the best thing for getting things into space because it simply acts as a normal elevator would and takes things from the surface into orbit. I am wondering what the communities opinion is on this and if more people prefer some sort of railgun that propels things into space really quickly and doesn\u0027t require as much in terms of construction. Additionally if you have any other science fiction style things that you would rather see please comment as I am interested in these types of alternatives to traditional rockets and I would love to see these things in the 21st century.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-18T13:24:42Z","Content":"\n\u003Cp\u003ESpace elevator concept has a lot of technical problems. I\u0027m not sure it will ever be practical in its standard telling.\u003C/p\u003E\u003Cp\u003EThere are a lot of launch loop proponents on this forum. That would require some sort of a linac in its design. (Railgun is terribly impractical, there are much better linac types for the job.) Launch loop has an advantage of being almost reasonably sized, but still presents many challenges. It might be the most practical way to launch cargo and even crews into LEO at some point, but not any time soon.\u003C/p\u003E\u003Cp\u003EVarious tether proposals are a great compromise between an elevator and a dynamic solution. Most of the current ideas are still a bit too grand to be feasible any time soon, but they are also much more scalable, so we might see something workable in the observable future.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2013-11-18T13:42:08Z","Content":"\n\u003Cp\u003ESpace elevators on Earth are impractical. However, they would be practical on the Moon, or other planets with no atmosphere. But at the moment, we don\u0027t have the technology to develop better systems and have them be cost effective as well.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2013-11-18T15:14:08Z","Content":"\n\u003Cp\u003ERight... An orbital elevator is probably impossible. The tension caused by the different segments orbiting at different heights at different velocities would cause it to snap. Then there is actually stabilizing the darned thing... Remeber that the structure would need to be stabilized: when skyscrapers are built they have deep-set foundations to prevent swaying/toppling... Or something along those lines, I won\u0027t pretend to be an engineer. Something similar to the Halo-universe mass driver might work though, simply firing an object into orbit... At least this is my opinion on it. Can\u0027t claim its fact as I may have gotten information confused. *shrugs* correct me if I\u0027m wrong.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-11-18T15:23:29Z","Content":"\n\u003Cp\u003EA Space Elevator is totally impractical on Earth for a lot of reasons. Of course, there is the materials problem, but lots of people forget the sheer distance from the ground to the GEO station at 36000km. Even if your climber cabin could travel at 200km/h, it would still take you over a week to get there. Life support requirements and the lack of abort capability would make it impractical for manned transport.\u003C/p\u003E\u003Cp\u003EOn the Moon, you can\u0027t have a stable GEO orbit, so it\u0027s not possible to anchor a space elevator at a fixed location.\u003C/p\u003E\u003Cp\u003EThe launch loop is just as crazy and although it might work in theory, it\u0027s would be technical nightmare to design. It also has the slight flaw that it\u0027s impossible to actually power up with disintegrating.\u003C/p\u003E\u003Cp\u003ERailguns also look like a good idea, but they actually require launching you at Mach 26 in the atmosphere, and hoping that you can keep that some of that velocity when you reach apogee. Of course, hypersonic speeds like that will destroy any known material and the acceleration would probably kill you. The only way around those problems are to design your railgun as the largest megastructure ever built, which is totally impractical.\u003C/p\u003E\u003Cp\u003EThe biggest problem with all of these permanent megastructures is that they are so expensive and challenging to build and lack redundancy.\u003C/p\u003E\u003Cp\u003EThe cost means that they would only be viable if we reach a stage where mass space transport is needed. That is simply not the case yet, and it won\u0027t be before a long time. Not before we figure out an actual reason to spend money to go to space. The lack of redundancy means that these solutions all have single points of failure and are very fragile. Any problem with the system means that space traffic is interrupted and people get stranded.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T15:35:12Z\u0022 title=\u002211/18/2013 03:35  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-11-18T15:29:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003ESpace elevators on Earth are impractical. However, they would be practical on the Moon, or other planets with no atmosphere. But at the moment, we don\u0027t have the technology to develop better systems and have them be cost effective as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt impossible on the Moon as Moon rotates so slowly (there\u0027s no way to have an orbit that matches the rotating speed, and in fact the counterweight would have to be above that orbit). Mars would be easier then Earth, though.\u003C/p\u003E\u003Cp\u003EThe main problem is the lack of strong enough materials. There\u0027s a lot of talk about carbon nanotubes, which may one day make space elevators possible, but we\u0027ll see.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-11-18T15:43:31Z","Content":"\n\u003Cp\u003EA lunar space elevator would have to be anchored at L1, which would make it geostationary because the Moon is tidally locked. It would still be at 67000 km (with a counterweight extending out to 134000 km), which would make transit times even less practical than an Earth-based space elevator.\u003C/p\u003E\n"},{"CreatedByName":"Requiem762","CreatedById":82185,"CreatedDateTime":"2013-11-18T17:19:29Z","Content":"\n\u003Cp\u003ESpace elevators because there is concerns that humans my not be able to survive the g-forces during a high powered rail gun launch.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-11-18T17:41:45Z","Content":"\n\u003Cp\u003EThey might not be able to survive a 7 day commute through the Van Allen belt either.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-18T17:55:58Z","Content":"\n\u003Cp\u003EIf you are building a space elevator, you can make the crew cabin arbitrarily well protected from radiation. That\u0027s not one of the problems.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-11-18T18:07:28Z","Content":"\n\u003Cp\u003EThere is still a mass limit for the size of the cabin. If it has to carry 10 people stuck inside for over a week, with supplies, life support, exercise equipment, shielding... plus motors, batteries, etc... I can\u0027t imagine it being smaller in size and mass than a bus, all hanging from pinching friction roller wheels on a narrow ribbon and travelling at a high speed.\u003C/p\u003E\u003Cp\u003EIt\u0027ll be a hell of an engineering challenge. I can\u0027t imagine it being practical at all, and certainly not a mass transport to orbit.\u003C/p\u003E\n"},{"CreatedByName":"Superluminaut","CreatedById":58963,"CreatedDateTime":"2013-11-18T18:13:48Z","Content":"\n\u003Cp\u003EA space elevator seems about as fantastical as teleportation, and between the two teleportation has every advantage. \u003C/p\u003E\u003Cp\u003EOr how about a geostationary tractor beam. \u003C/p\u003E\u003Cp\u003EOther things that come to mind, a launchpad at the edge of the atmosphere, anti gravity boots, warping space time, god waving his hand.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2013-11-18T18:18:52Z","Content":"\n\u003Cp\u003EThere you go: make an inter-dimensional portal to the Nether and go to the moon in 12 hours instead of 4 days.\u003C/p\u003E\n"},{"CreatedByName":"konokono","CreatedById":64503,"CreatedDateTime":"2013-11-18T18:21:38Z","Content":"\n\u003Cp\u003EIsn\u0027t it more likely we\u0027ll continue to lower the cost of propulsion based methods of reaching space, until it becomes a simple everyday task?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-11-18T18:27:50Z","Content":"\n\u003Cp\u003EUnfortunately, physics dictate that the amount of energy required to accelerate a mass from 0 to 26000 km/h will always be considerable. Until we discover a massive source of free energy, getting to orbit will never be a simple everyday task.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2013-11-18T19:46:15Z","Content":"\n\u003Cp\u003EOn the Moon, the best option would be a rotovator: a long tether in orbit that\u0027s also spinning. With the right conditions, the tip would get very close to the surface with almost zero relative speed.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Momentum_exchange_tether#Rotavator\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Momentum_exchange_tether#Rotavator\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m a big fan of momentum exchange tethers in general. They are an elegant solution, and sound feasible with budgets comparable to other big science or space projects.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-18T20:00:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EUnfortunately, physics dictate that the amount of energy required to accelerate a mass from 0 to 26000 km/h will always be considerable. Until we discover a massive source of free energy, getting to orbit will never be a simple everyday task.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELets take 1kg. Even with atmospheric effects, it takes less than 9.5km/s of delta-V to make LEO. That\u0027s roughly 45MJ of energy. What has 45MJ of energy? 1kg of gasoline. That\u0027s right. With perfect efficiency, you need 1:1 of fuel to payload to make LEO.\u003C/p\u003E\u003Cp\u003EIf we convert this to electric energy, it\u0027s even cheaper. 45MJ is only 12.5kWh. I pay about 11 cents per kWh. So if I could launch cargo with 100% efficient magrail, I could do this for less than $1.40 per kg. Even at efficiency of a real magrail, I should be able to get it under $2/kg. That\u0027s about 10,000 cheaper than by rocket.\u003C/p\u003E\u003Cp\u003EAnd don\u0027t get me wrong, this \u003Cstrong\u003Eis\u003C/strong\u003E a lot of energy. It\u0027s just that we\u0027re dealing with lots and lots of energy on daily basis. That just isn\u0027t a problem. Efficiency is the problem. Rockets just aren\u0027t efficient. They aren\u0027t efficient in terms of energy use, or other resource use. The huge quantities of fuel we are forced to burn, while expensive to begin with, also force the use of huge fuel tanks and rocket engines, which are also absurdly expensive.\u003C/p\u003E\u003Cp\u003EThere are, without a question, far, far more efficient ways to launch cargo. And like I said, we can drive the cost of actual launches to a percent of a percent of what we are spending now. It\u0027s just a matter of building required infrastructure which, at present, just isn\u0027t feasible, let alone commercially viable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EOn the Moon, the best option would be a rotovator\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it really wouldn\u0027t. Rotovator will have its place, but not on the Moon. Unlike Earth, the Moon does not have sufficient mag field to provide boosts to a rotovator. You\u0027ll have to run a reaction engine of some sort on the rotovator itself. Most likely an ion drive. Power might be solar, but propellant would have to come from the Moon and will make up a significant fraction of the cargo you lift on each turn.\u003C/p\u003E\u003Cp\u003EAnd if there was no competition, that would be fine. But on the Moon you can literally just build a magrail of sufficient length to launch things at orbital or escape velocity. No atmosphere. Lots of places with sufficiently level surface. Throw a nuclear power plant there, and you have the cheapest launches you can imagine. Cargo bound for Earth could be launched directly, requiring only minor corrections on the way. Anything heading for Lunar orbit would just need a burn to circularize, which can be done with conventional rockets without much fuss.\u003C/p\u003E\u003Cp\u003EOn the Moon, there is no reason to use something else. Where rotovators might come really handy is lifting things off the surface on the moons and minor planets far from home. The awesome thing about rotovator is that you can pack it up and send it from planet to planet. This is something you cannot do with any other method discussed here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T20:18:08Z\u0022 title=\u002211/18/2013 08:18  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-11-19T11:49:12Z","Content":"\n\u003Cp\u003ESo I see my dream of space elevators is flawed.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-11-19T12:04:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGeoninja\u0022 data-cite=\u0022TheGeoninja\u0022\u003E\u003Cdiv\u003ESo I see my dream of space elevators is flawed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, your dream itself is sound. It is the space elevator that\u0027s flawed.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-11-19T12:24:52Z","Content":"\n\u003Cp\u003EFrom the cost even with best imagined tech with no glitches launching any mass from a full planetary body like earth will always be an expensive proposition. That is why I think manufacturing will become divided between planetary and space. The only items that will be worth moving up or down a large gravity well are people and rare elements. \u003C/p\u003E\u003Cp\u003EFrom that standpoint a fleet of small shuttles for transport too and from Earth with a large space dock either fully in space or near the moon with possibly some sort of elevator or other non chemical launch from lunar surface to the 0g space dock proper.\u003C/p\u003E\u003Cp\u003EAlso I typed out munar surface first.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-11-19T12:58:59Z","Content":"\n\u003Cp\u003EDoes anyone know of any small field demonstrations of ablative laser propulsion?\u003C/p\u003E\u003Cp\u003EI\u0027ve read clams of $400/kg to LEO and isp\u0027s of 6000 with solid metal propellants, but it all looks to be just small lab experiments.\u003C/p\u003E\u003Cp\u003EIt just seems that the infrastructure and research needed for this is much more practical than all these massive machines.\u003C/p\u003E\u003Cp\u003EThe only drawback I can see is potential air pollution when burning metals in the air if you needed a high number of launches.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-11-19T13:02:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EDoes anyone know of any small field demonstrations of ablative laser propulsion?\u003Cp\u003EI\u0027ve read clams of $400/kg to LEO and isp\u0027s of 6000 with solid metal propellants, but it all looks to be just small lab experiments.\u003C/p\u003E\u003Cp\u003EIt just seems that the infrastructure and research needed for this is much more practical than all these massive machines.\u003C/p\u003E\u003Cp\u003EThe only drawback I can see is potential air pollution when burning metals in the air if you needed a high number of launches.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not think that it can be scaled up to launch scale right now simply because they cannot make a laser powerful enough.\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-19T13:29:27Z","Content":"\n\u003Cp\u003EFor sheer absurdity, the Slingotron gets my vote. There\u0027s just something about the thought of thousands of tons of metal gyrating at thousands of RPMs burping a projectile into orbital velocities that makes me giggle... probably it\u0027s the potential for a truly \u003Cem\u003Espectacular\u003C/em\u003E failure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EA Space Elevator is totally impractical on Earth for a lot of reasons. Of course, there is the materials problem, but lots of people forget the sheer distance from the ground to the GEO station at 36000km. Even if your climber cabin could travel at 200km/h, it would still take you over a week to get there. Life support requirements and the lack of abort capability would make it impractical for manned transport.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECargo and equipment are nearly all of the mass you\u0027d ever need to put into orbit, Humans contributing a negligible mass to the total. Cargo generally doesn\u0027t care how long it spends in transit, nor does it require life support or heavy shielding from radiation. The whole point is that an elevator would be low cost compared to rockets (by mass), so you\u0027d do the bulk lifting with an elevator and still use rockets/space planes for the lightweight humans.\u003C/p\u003E\u003Cp\u003ELength isn\u0027t a problem either; it\u0027s a logistical challenge, but far from impossible. For example, some estimates of the total length of electrical cable owned and operated by Con Edison - the major utility provider in New York City and the surrounding areas - is estimated to be somewhere around 200,000km. The real difficulties would be splicing something that long into a single cable and, of course, having it be strong enough.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2013-11-19T14:18:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENo, it really wouldn\u0027t. Rotovator will have its place, but not on the Moon. Unlike Earth, the Moon does not have sufficient mag field to provide boosts to a rotovator. You\u0027ll have to run a reaction engine of some sort on the rotovator itself. Most likely an ion drive. Power might be solar, but propellant would have to come from the Moon and will make up a significant fraction of the cargo you lift on each turn.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends on what you want to do on the Moon. If you want to send much more stuff from the moon than you send there, a mass driver is the way to go. If you want to send a lot of stuff there, or roughly as much up and down, a rotovator is better.\u003C/p\u003E\u003Cp\u003EThe idea is that you can slow down incoming crafts and accelerate outcoming ones at the same time, without spending energy. That way, you spend almost no energy on capture, landing, take off and transfer (if the mass going up and down are equal). A magrail can only help you on the take off and transfer part.\u003C/p\u003E\u003Cp\u003EIf your main cargo is personnel and equipment that will stay on the moon, decelerating will be more important than accelerating, a store the energy you gave while landing and use it to send you back home, and if you land too much stuff, you can spend the excessive energy by sending rocks or dust at Earth (or somewhere else).\u003C/p\u003E\u003Cp\u003EThere is actually a proposal for building two momentum exchange tethers, one in LEO and the other around the moon. The idea is to send rocks from the moon to Earth to provide energy to lift space craft from LEO or suborbital trajectories to the Moon and other places.\u003C/p\u003E\u003Cp\u003EThat being said, if you build a fuel factory on the moon and just want to send tons of it to LEO without sending much there, a mass driver would be better.\u003C/p\u003E\n"},{"CreatedByName":"Axder","CreatedById":57767,"CreatedDateTime":"2013-11-19T14:36:55Z","Content":"\n\u003Cp\u003EI always wondered if there would be problem with tectonic movement when building Space elevator, becouse for example africa is slowly moving towards europe etc.But on the other hand i can easely imagine cableless space elevator which would work for example like maglev train. You could achive much higher velocities while traveling up.\u003C/p\u003E\n"}]}