{"TopicId":53585,"ForumId":16,"TopicTitle":"180 Orbital inclination and getting to other planets","CreatedByName":"Seeker89","CreatedById":78437,"CreatedDateTime":"2013-11-18T23:51:32Z","PageNum":1,"Articles":[{"CreatedByName":"Seeker89","CreatedById":78437,"CreatedDateTime":"2013-11-18T23:51:32Z","Content":"\n\u003Cp\u003EI\u0027ve been playing with mechjeb\u0027s ascent guidance and been setting my inclination to 180. What i have noticed is that it takes about the same dv to get to the body I want. \u003C/p\u003E\u003Cp\u003EThe question I have is would I have a better chance getting there? \u003C/p\u003E\u003Cp\u003EThanks in advance\u003C/p\u003E\u003Cp\u003ESeeker\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-18T23:59:51Z","Content":"\n\u003Cp\u003EThe dv savings of taking off to the east is about 200 m/s I think. That\u0027s a nice savings if you do everything perfectly, but it can still be dwarfed by leaving at the wrong time, or having to do an orbital inclination change.\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2013-11-19T00:08:13Z","Content":"\n\u003Cp\u003EThere was a discussion about this several months back. The conclusion was it doesn\u0027t help. Consider the picture looking down at Kerbin from solar-system-north: To go to the outer planets, you want to leave orbit in the same direction Kerbin\u0027s orbiting the sun. For the inner planets, you leave orbit at the opposite point, when you\u0027re moving opposite to the direction Kerbin orbits. Whatever your orbital direction, there are always two opposite points in the orbit where you can depart inward or outward. \u003C/p\u003E\u003Cp\u003ESo all you\u0027re doing launching into a retrograde orbit is giving up the free velocity you have from Kerbin\u0027s rotational speed.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-11-19T00:12:21Z","Content":"\n\u003Cp\u003EThe only (and minor) help is that you don\u0027t have to pack extra batteries to do your burn on the night side when going to outer planets.\u003C/p\u003E\u003Cp\u003EBatteries weigh far less than the fuel it will cost to go 200 extra m/s (and is it 200, or 400? I thought you get a 200m/s boost, which means you have to cancel that boost and then get 200 more to get back to what you had going east).\u003C/p\u003E\u003Cp\u003EIOW, go East, unless you don\u0027t care about fuel, dV, or that kind of stuff. Which is perfectly fine, but as you\u0027re asking the question I (and the rest of us) assume you care.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-19T00:27:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seeker89\u0022 data-cite=\u0022Seeker89\u0022\u003E\u003Cdiv\u003EI\u0027ve been playing with mechjeb\u0027s ascent guidance and been setting my inclination to 180. What i have noticed is that it takes about the same dv to get to the body I want. \u003Cp\u003EThe question I have is would I have a better chance getting there? \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you circularize first and then set out to the other planet?\u003C/p\u003E\u003Cp\u003EBecause the dV saving from going east has then gone into your orbit.\u003C/p\u003E\u003Cp\u003EDeparting from an orbit costs the same regardless of a \u0022left\u0022 or \u0022right\u0022 orbit.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-11-19T02:51:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EDid you circularize first and then set out to the other planet?\u003Cp\u003EBecause the dV saving from going east has then gone into your orbit.\u003C/p\u003E\u003Cp\u003EDeparting from an orbit costs the same regardless of a \u0022left\u0022 or \u0022right\u0022 orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd, there is a savings in delta V when you make the escape burn from orbit regardless if you head prograde or retrograde from Kerban then straight up launch at dawn or dusk.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-11-19T03:07:22Z","Content":"\n\u003Cp\u003EKerbin rotates at 174.5 m/s, so you save 174.5 going east compared to going polar, and you lose 174.5 going west. Sum is 349 m/s. That\u0027s not counting the extra drag from going ~350 m/s faster in surface speed, or the extra gravity drag from it taking longer to get up to speed.\u003C/p\u003E\u003Cp\u003EThere\u0027s very little reason to leave at 180 inclination.\u003C/p\u003E\u003Cp\u003EOnce you\u0027re in orbit, it\u0027s true, it doesn\u0027t matter except for day/night cycles.\u003C/p\u003E\n"},{"CreatedByName":"phuzz","CreatedById":71882,"CreatedDateTime":"2013-11-19T12:17:24Z","Content":"\n\u003Cp\u003ENot to mention, if you don\u0027t add the batteries then you can almost guarantee that you\u0027ll have to do a darkside burn once you get to your destination.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-19T13:33:02Z","Content":"\n\u003Cp\u003ERetrograde or prograde Kerbin orbit has no effect on your travel to other planets, you just lose some dv getting to that orbit.\u003C/p\u003E\u003Cp\u003EThere might be some advantages for starting from an inclined or polar orbit, though, particularly if you match the inclination you\u0027ll need for ejection. But even that can be usually fixed by rising your orbit\u0027s apoapsis and changing the inclination there, then finishing the burn back at periapsis. It\u0027s just harder to plan as you need to plan your ejection one quite lengthy orbit ahead.\u003C/p\u003E\n"}]}