{"TopicId":53589,"ForumId":44,"TopicTitle":"Why are the elements formed in main sequence stars not in some simple pattern?","CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-19T00:12:36Z","PageNum":1,"Articles":[{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-19T00:12:36Z","Content":"\n\u003Cp\u003EThe elements formed in a main sequence star are these, \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EH  (1)  \u003Cbr\u003EHe (2)  \u003Cbr\u003EC  (6)  \u003Cbr\u003EO  (8)  \u003Cbr\u003ENe (10)  \u003Cbr\u003ESi (14)\u003Cbr\u003EFe (26)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhat I don\u0027t understand is why are they restricted to these? Why don\u0027t the elements in between these get formed accidently?\u003C/p\u003E\u003Cp\u003EAnd for the elements past Iron, I know that they cannot be formed exothermically, but there\u0027s no shortage of energy around, they should be getting formed accidently as well in a heavy star, even if they don\u0027t contribute to it\u0027s energy production. \u003C/p\u003E\u003Cp\u003EWhy are they not in a simple pattern, such as the Integers, powers of two, or the Fibonacci sequence?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-11-19T02:33:43Z","Content":"\n\u003Cp\u003EThe elements formed inside the cores of high mass stars are NOT restricted to those that you listed. Those are just some major products along the way that can hang around for a while until the temperature and pressure builds up to the point where the fusion of those elements can occur (given a massive enough star...except for iron on the bottom, which is dead end for fusion energy production).\u003C/p\u003E\u003Cp\u003EThe jump from helium to carbon, for example, occurs because two heliums would form boron 8, which is unstable and immediately breaks apart into two heliums. Once the temperature gets up to around 100 million Kelvin, the reactions happen fast enough that the boron 8 has a substantial chance of being hit with another helium before breaking apart, and you get carbon as a result of this \u0022triple alpha\u0022 process. Oxygen is also formed at this stage when some of the carbon fuses with another helium.\u003C/p\u003E\u003Cp\u003EIf the star is massive enough, it can go on to carbon burning which can produce neon, magnesium, sodium, oxygen (for example, two carbons fusing together can make a neon by spitting out an alpha particle--helium nucleus--after the reaction).\u003C/p\u003E\u003Cp\u003EIf the star is massive enough, it can go on to neon burning, which leaves behind mainly oxygen and magnesium. More massive still, and the star can start fusing the oxygen, which gives you several elements, but mainly silicon and sulphur.\u003C/p\u003E\u003Cp\u003EOnce you get to the stage where you can burn silicon, the temperatures in the core of the star are getting so high that the gamma rays have enough energy to knock some of the nuclei apart into alpha particles...and at a high enough temperature, the silicon and sulphur will start fusing with those alpha particles in a rapid chain of reactions that cook up nickel 56...which decays to iron 56.\u003C/p\u003E\u003Cp\u003EAs always in the shorthand of stellar astrophysics, \u0022burning\u0022 as used above refers to thermonuclear fusion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-19T02:38:26Z\u0022 title=\u002211/19/2013 02:38  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 19, 2013\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-19T04:51:41Z","Content":"\n\u003Cp\u003EInteresting, I didn\u0027t consider that fusion and fission were both happening in stars....\u003C/p\u003E\u003Cp\u003EWhy is a iron a dead end? I\u0027ve heard that it\u0027s not exothermic to fuse iron, but why should that stop it from happening?\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-11-19T05:42:58Z","Content":"\n\u003Cp\u003EIt probably does happen, but not often enough to produce more than trace amounts of heavier stuff. Untill the boom, of course.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-11-19T06:25:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EInteresting, I didn\u0027t consider that fusion and fission were both happening in stars....\u003Cp\u003EWhy is a iron a dead end? I\u0027ve heard that it\u0027s not exothermic to fuse iron, but why should that stop it from happening?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t call it \u0022nuclear fission\u0022 since that might confuse people. When two oxygen atoms fuse, for example they bring in so much energy that the resulting sulfur nucleus that you might expect to result usually sheds the excess energy by spitting out an alpha particle or neutron or proton, etc. (by can rarely stay together as a sulfur nucleus and emit all of the energy as a gamma ray). This is more of a decay than a nuclear fission. In the case of nuclei that are broken apart by gamma rays into the alpha particles that fuel the silicon burning, the term to use is \u0022photodissociation\u0022, not fission.\u003C/p\u003E\u003Cp\u003EI said that iron is a dead end for fusion \u003Cstrong\u003Eenergy production\u003C/strong\u003E (because it sits at the peak of the curve of binding energy). Nuclear reactions that absorb energy (instead of liberating energy) can and do occur in stars in relatively small numbers, but are not going to help the star fight off gravitational collapse. In a supernova explosion where lots of energy is being released and there are lots of neutrons flying around, a large number of these energy-absorbing reactions can occur and cook up lots of heavy elements.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-19T07:51:27Z","Content":"\n\u003Cp\u003EThis isn\u0027t the whole answer, but it\u0027s a big part of it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/4/42/Binding_energy.jpg\u0022 alt=\u0022Binding_energy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese are binding energies of stable nuclei. Note that iron has the highest binding energy. That means to make iron into a heavier element you have to \u003Cem\u003Eadd\u003C/em\u003E energy. Up to iron, energy is released as elements fuse together.\u003C/p\u003E\u003Cp\u003EFrom this graph, He\u003Csup\u003E4\u003C/sup\u003E, C\u003Csup\u003E12\u003C/sup\u003E, O\u003Csup\u003E16\u003C/sup\u003E, and Ne\u003Csup\u003E20\u003C/sup\u003E immediately stand out. You expect to see a lot of these four elements in a star, and you, in fact, do.\u003C/p\u003E\u003Cp\u003EThe reasons why it works this way are a bit complicated. So first of all, neutrons and protons are fermions. That means that two cannot be in exactly the same state. They can, however, differ only by a spin. So at the lowest energy state, you can have two neutrons and two protons. That\u0027s He\u003Csup\u003E4\u003C/sup\u003E. This group of four is so tightly bound because of that, that it behaves almost like a single particle. In fact, it has a name. Alpha particle. Well, if you consider heavier nuclei, the protons and neutrons in it still like to keep that tight packing, so they are often found in groups of four. Consequently, C\u003Csup\u003E12\u003C/sup\u003E nucleus can almost be pictured as three He\u003Csup\u003E4\u003C/sup\u003E nuclei bound together. There are a lot of experiments that confirm this.\u003C/p\u003E\u003Cp\u003ENe\u003Csup\u003E20\u003C/sup\u003E is the next interesting case. Just like with electron shell, once you fill out the ground state, at a higher level you have two vacancies for particles with no angular momentum, and six for particles with orbital angular momentum. Levels are nowhere as neatly arranged as in the atomic orbitals, but up to this point you can use roughly the same rule of thumb. As the result, Ne\u003Csup\u003E20\u003C/sup\u003E has a full shell, giving it a total of 10 protons and 10 neutrons, and a rather high binding energy.\u003C/p\u003E\u003Cp\u003EAfter that more complicated effects take over, and the curve becomes fairly uniform as it peaks at Fe\u003Csup\u003E56\u003C/sup\u003E and then comes down.\u003C/p\u003E\u003Cp\u003ESo why did I say that this isn\u0027t the whole story? Take a look at beryllium. You expected to see Be\u003Csup\u003E8\u003C/sup\u003E, didn\u0027t you? Pants to that, says nuclear physics, laughs wildly in your face, and jumps out of the window. The fact is, a He\u003Csup\u003E4\u003C/sup\u003E is so stable that a Be\u003Csup\u003E8\u003C/sup\u003E almost instantly falls apart into a pair of these. Oddly enough, a stray neutron in Be\u003Csup\u003E9\u003C/sup\u003E prevents that decay, making it the only stable isotope of beryllium.\u003C/p\u003E\n"}]}