{"TopicId":53664,"ForumId":20,"TopicTitle":"RemoteTech 2 - Questions/Issues","CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-11-19T16:31:40Z","PageNum":1,"Articles":[{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-11-19T16:31:40Z","Content":"\n\u003Cp\u003EFirst issue, satellite drift. Is there a good way to deal with this? I set up some kerbin satellites, some mun satellites, some minmus satellites. I set up two large dish satellites in a very eccentric orbit for interplanetary communications. Then I did a mission to dres and eeloo that took a few years. When I came back, all my satellites are out of position.\u003C/p\u003E\u003Cp\u003EFor example, 2 satellites 180 degrees offset have 2 hour orbits. One is 1 second off (1/7200 off). So it only takes 3600 orbits (300 days) until the satellites are beside each other. I have no idea how to fix this.\u003C/p\u003E\u003Cp\u003ESecond and third issues relate to interplanetary communication. Second issue, I noticed that when far away from kerbin (tested on dres and eeloo) I can\u0027t point my dish (the 350Gm one) at Kerbin. If I do, the connection constantly flashes on and off (every 1/2 to 2 seconds). If I point it at the long-range satellite it works fine. This is obviously not ideal because there are 2 of them and only one is guaranteed to be visible.\u003C/p\u003E\u003Cp\u003EThird issue, targeting active vehicle. Is there any way to make it act more like targeting a planet? The reasoning: I drop off a probe down to Dres which connects to the interplanetary ship short range. I can\u0027t transmit because the long-range satellites are targeting the probe instead of the ship.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-11-19T16:37:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScottyDoesKnow\u0022 data-cite=\u0022ScottyDoesKnow\u0022\u003E\u003Cdiv\u003EFor example, 2 satellites 180 degrees offset have 2 hour orbits. One is 1 second off (1/7200 off). So it only takes 3600 orbits (300 days) until the satellites are beside each other. I have no idea how to fix this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck each satellite\u0027s semi-major axis.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-11-19T19:39:01Z","Content":"\n\u003Cp\u003E1. I spent a long time setting up my Geo sats and the 500km sat ring at Kerbin and after it was all said and done I decided perfect placement is never going to happen. Instead I have just added chores to my list of Kerbin things to do. Along with my flights to all my stations for refueling them, checking on my kethane plants, I now go in a tweek my satelites every so often.\u003C/p\u003E\u003Cp\u003EThis is even more fun in that I don\u0027t have the really small engines on any of them. When I finally get my tech to Ion drives I am going to launch a whole new set that I can get better fine control of.\u003C/p\u003E\u003Cp\u003EALacrity\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-11-20T20:36:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003ECheck each satellite\u0027s semi-major axis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have flight engineer, I\u0027m going by the orbit time. But it\u0027s very hard to get subsecond accuracy in a 2 or 6 hour orbit. Maybe I\u0027ll try putting ion drives on all of them to be more precise.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-22T09:47:05Z","Content":"\n\u003Cp\u003ECapslock for fine control also lower RCS thrust. Press your RCS keys for tiny bits longer and only tap them again to slowly bring the period closer to what you want it to be.\u003C/p\u003E\u003Cp\u003EGranted, until you get RCS in a career game ... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf this still not works or until you get RCS: Get it as close as possible, calculate when you will be half way off, set Kerbal Alarm Clock to that time and make the odd-jobs go slower/faster to correct over time, repeat until you get better technology.\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-11-26T10:42:58Z","Content":"\n\u003Cp\u003EIf you have problems getting your orbital period accurate, use RCS. But not exactly at pro or retrograde. Instead, thrust North with a small offset for either pro or retro. If you are going eastwards, I find that 5-10 degrees is the optimal heading for fine tuning your orbital period. You could just burn straight South to fix your inclination afterwards if that\u0027s important to you.\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2013-11-26T13:08:33Z","Content":"\n\u003Cp\u003ERegarding RCS, the AEIS mod has some very effective 180N micro-blocks (SN-1) that may be useful for very short corrections. Also, if you still have problems with overthrusting, you might want to disable all your blocks except one. The torque provided by the probe will cancel the rotation a singular RCS block gives (at least, if you have placed it near the COM), and in conjunction with fine control and tapping will give you the ability to perform correction of ms orbital accuracy. \u003C/p\u003E\u003Cp\u003EHere is an example 5 dish KSO sat:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i44.photobucket.com/albums/f9/Dante80/bellycancer/Untitled-1_zpsa9439af4.jpg~original\u0022 alt=\u0022Untitled-1_zpsa9439af4.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith those blocks and the procedure above it takes me 8 prograde taps to move from a 5:59:60.0 to 6:00:00:0 orbital period. Granted, the Satellite weighs almost two tons, but the concept remains the same.\u003C/p\u003E\n"}]}