{"TopicId":53793,"ForumId":51,"TopicTitle":"Early adventures of the Raven space program","CreatedByName":"RavenX13","CreatedById":93174,"CreatedDateTime":"2013-11-20T16:26:18Z","PageNum":1,"Articles":[{"CreatedByName":"RavenX13","CreatedById":93174,"CreatedDateTime":"2013-11-20T16:26:18Z","Content":"\n\u003Cp\u003EKerbals have only two stats: courage and stupidity. With loads of both, the Raven space program attempted to immediately put a kerbal in orbit, skipping basic space flight stepping stones such as unmanned rockets and satellites. \u003C/p\u003E\u003Cp\u003ESUCCESS! Jebediah Kerman is in orbit. \u003C/p\u003E\u003Cp\u003ESadly, Jebediah burned up all his fuel getting there (not for lack of fuel, but due to bad flying). Jebediah looks trapped forever...\u003C/p\u003E\u003Cp\u003E...but we will not give up so easily. \u003C/p\u003E\u003Cp\u003ENew rocket designs are tested. Satellites are launched and achieving orbit is perfected. EVA maneuvers are practiced. Thanks to the engineers at NovaPunch, remote guidance systems are developed. \u003C/p\u003E\u003Cp\u003EAn unmanned one-kerbal capsule is launched into orbit. With delicate precision the rescue ship is maneuvered from ground control, and to the great surprise of all, suddenly the two ships are within 250m of each other!\u003C/p\u003E\u003Cp\u003EJebediah exits his spacecraft to perform an EVA to his return vessel. Floating 100m from either ship, he prays that his first EVA is successful. Moments later he is crawling in the hatch of a fueled spaceship. A short burn and nerve-wracking re-entry later, and the mission is a success! Jebediah is home safely.\u003C/p\u003E\u003Cp\u003E------------\u003C/p\u003E\u003Cp\u003EReal life notes: I have been playing this game for days straight and having a blast (ha!). It took me at least half a day to design and execute the rescue mission. Flying this mission got my heart pounding!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-21T01:02:58Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ESuddenly, you find yourself elsewhere than where you started...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EFirst off, welcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, glad to see that Jebediah was able to get out of that scrape alive and well. A harrowing experience, to be sure.\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2013-11-21T02:04:01Z","Content":"\n\u003Cp\u003ENooo, the title of raven space program is mine! \u003C/p\u003E\u003Cp\u003EJust kidding, welcome and congratulations \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-21T02:45:29Z","Content":"\n\u003Cp\u003EWelcome aboard and congrats at the rescue mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BlazeKerba","CreatedById":93609,"CreatedDateTime":"2013-11-21T02:49:47Z","Content":"\n\u003Cp\u003EWelcome Aboard! I have yet to set a rescue mission for my Kerbal on the Mun, sent him there like...ohhhh, from the looks of the Flag I placed there, One Year and Eight Days in KSP time ago xD. But I am attempting to send him a Rover! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Which is FAILING! D: because I fail at rocket designs it seems. But I keep trying. Which is key, never give up and improve improve improve o:\u003C/p\u003E\n"}]}