{"TopicId":53850,"ForumId":18,"TopicTitle":"Best Anti-Virus Software","CreatedByName":"Rassa Farlander","CreatedById":63627,"CreatedDateTime":"2013-11-21T02:05:45Z","PageNum":1,"Articles":[{"CreatedByName":"Rassa Farlander","CreatedById":63627,"CreatedDateTime":"2013-11-21T02:05:45Z","Content":"\n\u003Cp\u003ESo Im going to build a new computer, and I need to know, what is the best anti-virus out there?\u003C/p\u003E\u003Cp\u003EIs the microsoft stuff that comes with a new version of windows good enough?\u003C/p\u003E\u003Cp\u003EShould I buy software?(McAfee, Norton) or is something free the way to go?(AVG, Avast?)\u003C/p\u003E\u003Cp\u003EIm looking for something I wont have to worry about messing with or interfering with Multiplayer video games.\u003C/p\u003E\u003Cp\u003EThanks!!!\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-11-21T02:32:40Z","Content":"\n\u003Cp\u003EAvast Free is consistently rated one of the best anti-virus on the market.\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-11-21T03:07:04Z","Content":"\n\u003Cp\u003E(Lower is better)\u003C/p\u003E\u003Cp\u003EOrdered by Free-ness:\u003C/p\u003E\u003Cp\u003E(?). Avast\u003C/p\u003E\u003Cp\u003E0. Panda\u003C/p\u003E\u003Cp\u003E1. Windows Defender\u003C/p\u003E\u003Cp\u003E3. AVG\u003C/p\u003E\u003Cp\u003E4. Avira\u003C/p\u003E\u003Cp\u003E6000. Norton\u003C/p\u003E\u003Cp\u003E35000. McAfee\u003C/p\u003E\u003Cp\u003E(Lower is better)\u003C/p\u003E\u003Cp\u003EOrdered by effectiveness:\u003C/p\u003E\u003Cp\u003E(?). Avast\u003C/p\u003E\u003Cp\u003E1. AVG\u003C/p\u003E\u003Cp\u003E3. Avira\u003C/p\u003E\u003Cp\u003E2520. Norton\u003C/p\u003E\u003Cp\u003E6100. McAfee\u003C/p\u003E\u003Cp\u003E35780. Windows Defender\u003C/p\u003E\u003Cp\u003E99E99. Panda\u003C/p\u003E\u003Cp\u003E(Lower is better)\u003C/p\u003E\u003Cp\u003EOrdered by user-friendlyness:\u003C/p\u003E\u003Cp\u003E(?). Avast\u003C/p\u003E\u003Cp\u003E1. Avira\u003C/p\u003E\u003Cp\u003E3. Panda\u003C/p\u003E\u003Cp\u003E30. AVG\u003C/p\u003E\u003Cp\u003E10000. Norton\u003C/p\u003E\u003Cp\u003E5E50.Mcafee\u003C/p\u003E\u003Cp\u003E99E99. Linux OSs\u003C/p\u003E\u003Cp\u003EERR. W.D.\u003C/p\u003E\u003Cp\u003E(higher is better)\u003C/p\u003E\u003Cp\u003EOrdered by Invasive-ness:\u003C/p\u003E\u003Cp\u003E(?). Avast\u003C/p\u003E\u003Cp\u003E-10. Norton\u003C/p\u003E\u003Cp\u003E0. McAfee\u003C/p\u003E\u003Cp\u003E1. Avira\u003C/p\u003E\u003Cp\u003E3. AVG\u003C/p\u003E\u003Cp\u003E99E99. Linux\u003C/p\u003E\u003Cp\u003ENotes:\u003C/p\u003E\u003Cp\u003E1. these are HIGHLY biased\u003C/p\u003E\u003Cp\u003E2. these are VERY inacurate\u003C/p\u003E\u003Cp\u003E3. DO NOT hold me to these.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-21T03:15:45Z\u0022 title=\u002211/21/2013 03:15  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 21, 2013\u003C/time\u003E by Galacticruler\u003C/strong\u003E\n\u003Cbr\u003EBIIIG Edit.\n\u003C/span\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2013-11-21T19:51:16Z","Content":"\n\u003Cp\u003EAs a gamer, Avast doesn\u0027t interfere with my multiplayer gaming at all. Its what I use at home. We use paid Trend where I work. \u003C/p\u003E\u003Cp\u003EAs an IT professional, antivirus may help some of the time. In those cases free is just as good as paid, and generally speaking something like Avast, Avira, Panda, or AVG is more than enough for the average consumer.\u003C/p\u003E\u003Cp\u003EAgainst, as an IT professional, you will still likely get viruses if you open email attachments you aren\u0027t expecting, download random files, download illegal copyright material, or have a naughty video habit. Heck, I get still get spyware or a virus once a year and I know what I\u0027m doing.\u003C/p\u003E\u003Cp\u003EOnce you have a virus, your antivirus may catch it. It may even notice it before you do. It may clean the files it notices. However, in most cases I\u0027ve experienced it doesn\u0027t clean viruses completely. Generally you have to do a websearch to learn how to truly clean an infection and it may involve removing unrelated files or finding registry keys the virus put in.\u003C/p\u003E\u003Cp\u003EI\u0027m just saying that you should install antivirus, but be aware it isn\u0027t the end all be all. You should also install anti-spyware and anti-adware software.\u003C/p\u003E\u003Cp\u003EIn the end the only way to avoid malware is to not connect to the internet...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-21T19:55:44Z\u0022 title=\u002211/21/2013 07:55  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 21, 2013\u003C/time\u003E by air805ronin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"swiftgates24","CreatedById":22280,"CreatedDateTime":"2013-11-21T20:33:24Z","Content":"\n\u003Cp\u003ENorton allllllllll the way man.\u003C/p\u003E\u003Cp\u003Ejk,jk. But seriously, the windows regulated anti-virus isn\u0027t that great.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-11-21T20:57:28Z","Content":"\n\u003Cp\u003EKaspersky is what we always use - it\u0027s not free, but it\u0027s extremely high-quality software. Besides, I\u0027m not the one paying for it yet.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-11-21T20:58:33Z","Content":"\n\u003Cp\u003ECommon sense.\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-11-21T21:59:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022air805ronin\u0022 data-cite=\u0022air805ronin\u0022\u003E\u003Cdiv\u003E...or have a naughty video habit...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethis is actually not quite that true.\u003C/p\u003E\u003Cp\u003EYou\u0027re more likely to get a virus/spyware/rootkit from a religious webpage than \u0022one of those sites\u0022.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022air805ronin\u0022 data-cite=\u0022air805ronin\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...In the end the only way to avoid malware is to not connect to the internet...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso false, you must also deny all your friends access to your PC via flashdrive/disk.\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2013-11-22T01:07:33Z","Content":"\n\u003Cp\u003EI like Microsoft Security Essentials as my primary AV, and Malwarebytes as a secondary program. MSE does not have the best level of protection, I\u0027m going to say that right up front. What makes it unique is that it also doesn\u0027t generate false positives. I pair this up with the free version of Malwarebytes, which has no live protection (which makes it perfect for pairing AV programs because it wont interfere), but is a more thorough.\u003C/p\u003E\u003Cp\u003EHonestly though, I see AV programs are swords. Yeah, it\u0027s nice to have them inspect that new download, but don\u0027t rely on them to prevent malware getting onto your system. They\u0027re just there to tell you something is wrong and help clean up the mess. My personal recommendation would be use chrome or firefox as your browser because of the adblock and noscript add ons. Assuming you aren\u0027t downloading things with viruses, then your biggest fear should be websites themselves, particularly the ads that they serve. With the right ad, just visiting a site will instantly download and run malware on your system, and the only defense is to not allow the ads to run at all (do not say say stick to reputable sites. These ads manage to sneak onto all kinds of sites every now and then, and you don\u0027t want to be the unlucky person who gets to find that out the hard way before the ad gets pulled). Noscript prevents javascript running by default, allowing you whitelist trusted domains (it takes a while getting used to. You\u0027ll be wondering why the website is broken, or won\u0027t load, and then you\u0027ll remember that you need to allow it to run java script). This allows you to wander onto any site and see who is going to try and run things in your browser. Adblock forms another layer of defence by enforcing blacklists of entities known to serve ads or distribute spyware (note that this can also break websites).\u003C/p\u003E\u003Cp\u003EBeing smart and having a solid AV program is great, but I prefer a more solid front line defence.\u003C/p\u003E\n"},{"CreatedByName":"Killerdude8","CreatedById":73130,"CreatedDateTime":"2013-11-22T01:46:58Z","Content":"\n\u003Cp\u003EMS Security Essentials, Free and does everything an Antivirus needs to do, also doesn\u0027t hog Harddrive space, and isn\u0027t too Resource intensive. Haven\u0027t had a Single Virus using it.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-22T01:59:33Z","Content":"\n\u003Cp\u003EI have found that anti-virus programs can cause just as many problems as the virus\u0027s themselves. They can be beneficial to new users, because people that are new to computers and the internet do not have the experience to know what is dangerous. But as one gains experience, the bad stuff starts to become more recognizable. Common sense, as Psycix pointed out, is the best defense. If it sounds to good to be true, it usually is. Also, as air805ronin pointed out, learning how to clean your computer of the bad stuff is an invaluable skill, and here is why : there is absolutely no way to protect yourself from everything. Anti-virus\u0027 can only protect you from known threats. Whenever someone comes up with a new way to hack your website, or install malware, or whatever, the anti-virus is useless. \u003C/p\u003E\u003Cp\u003EThat being said, there are tools that are free and can help you to maintain a clean and fast system. Randox already pointed out Adblock. I highly recommend that. Advertisers can and will install all kinds of junk so they can follow your browsing habits. Malwarebytes can scan your system for known threats and has proven itself in the past at ridding systems of junk that others miss. You have to be very careful when installing it now however, because even they have to pay the bills. There is crap that will install itself with malwarebytes if you don\u0027t check the boxes that tell the installer to NOT install said crap. Always read very carefully what the installer says, no matter what software you are installing. And finally, I also like Crap Cleaner, or CCleaner. This is one tool that can be dangerous, however. Study about what it does and how it works before using it.\u003C/p\u003E\u003Cp\u003EOne last note : your windows firewall is probably the most effective tool in your security arsenal. Learn all you can about it. How to customize it to fit your needs, and how to recognize if someone has changed it. I have seen some pretty nasty bugs that will change the firewall settings and then lock out the computer\u0027s user. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"tom1499","CreatedById":38308,"CreatedDateTime":"2013-11-22T09:08:20Z","Content":"\n\u003Cp\u003EI use AVG now, as I lost McAffee when I wiped my disk. It was the worst AV software I\u0027ve had. It was HORRIBLY sluggish and had the worst user interface. I made no attempt to renew or reinstall even though I had 6 months left on license. Got it free with my laptop. Considering moving to Avast as I\u0027ve heard good things.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-22T18:24:20Z","Content":"\n\u003Cp\u003EAlthough this seems an extremeley bias thread (IE everyone will put there favourite down)\u003C/p\u003E\u003Cp\u003EI will put forward norton. Mainly because I have tried others but I\u0027m so used to norton that i dislike the others.\u003C/p\u003E\u003Cp\u003EIt gets less intrusive each year and (the original readon I got it all those years ago) is norton 360 comes with various usefull tools. Now all these tools are available in other software, however! I\u0027m a fan of keeping everything in one place and able to do everything with one click.\u003C/p\u003E\u003Cp\u003EMy girlfriend swears by AVG which I personally find slow and annoying.\u003C/p\u003E\u003Cp\u003EI went through a stage of kaspersky but the computer that I put it on really disagreed with it and went on the go slow (not sure if kaspersky issue or computer)\u003C/p\u003E\u003Cp\u003EChances are whatever you pick first will be the one you keep forever. Like someone pointed out you will still get a virus or spyware even with the best of the best but you will get alot less of them if you have at least some form of antivirus/antispyware.\u003C/p\u003E\u003Cp\u003EThe one thing that should be on the bottom of most peoples list when looking for antivirus (this is personal opinion btw) is the amount of system resources they need. Even basic laptops (not the bottom of the bottom of last years old range) will have enough power to run a juicy antivirus. Everyone i ask says \u0022dont get norton it uses to much system resources yada yada yada\u0022...yeh maybe if your computer was built in the 90\u0027s\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Otis\u0022 data-cite=\u0022Otis\u0022\u003E\u003Cdiv\u003E Randox already pointed out Adblock. I highly recommend that. Advertisers can and will install all kinds of junk so they can follow your browsing habits. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a really usefull tool that norton doesnt have. Although im not against advertisers following my habbits (it makes buying stuff for myself slightly easier sometimes...sometimes) but its most usefull if you like to stream stuff from iffy sites.\u003C/p\u003E\u003Cp\u003EYou know where its all \u0022click here to play\u0022 but your not quite sure which one is the real one. Its usefull for getting rid of the fake ones. I managed to install a virus once because i wasnt paying attention (i was trying to download and install something, cant remember what) and didnt have ad block. I just kept clicking \u0022yes\u0022 \u0022install\u0022 until about the 4th thing i agreed to install and my brain clicked and all i thought was \u0022dammit brain! why u on autopilot!\u0022 (fortunatley i made a system restore point the previous day) It just shows even the most vigilant can slip up from time to time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-22T18:33:07Z\u0022 title=\u002211/22/2013 06:33  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 22, 2013\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-11-22T23:12:20Z","Content":"\n\u003Cp\u003EDon\u0027t get Norton. Above all else, don\u0027t get Norton. Totally not worth what you\u0027ll pay, very user invasive, doesn\u0027t work half the time. I\u0027ve seen a countless amount of PCs where Norton was totally helpless to do anything about a virus situation.\u003C/p\u003E\u003Cp\u003EI\u0027m using Avast personally. Totally free, works fantastic, never has a single problem with it activated. For a normal home user, the free version Avast does everything you need. The paid versions of Avast or of other antivirus (except Norton) are better in different ways each, but none of those features are things you need for a home PC.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-23T00:20:57Z","Content":"\n\u003Cp\u003EWhen I say that I don\u0027t like anti-virus programs, I should clarify that I don\u0027t like the ones that are always running. I have seen too many examples of these types of anti-virus\u0027 that claim \u0022real-time protection\u0022 that just don\u0027t work. Systems that are full of spyware and toolbars and crap that slow down internet browsers even though they have Norton or AVG installed. This leads me to conclude : why even let them have any of my resources in the first place? That is why I always recommend Malwarebytes, the free version, not the paid. It only runs when you tell it. It only updates when you run it, avoiding the tying up of bandwidth at inopportune times. And believe me, they will update themselves at the worst possible times, or so it seems.\u003C/p\u003E\u003Cp\u003EI also find that programs like AVG or Norton are harder to remove completely than the viruses they are supposed to protect you from. And don\u0027t get me started with McAfeee. That\u0027s just a joke.\u003C/p\u003E\u003Cp\u003EStupid_Chris is right about Avast. It\u0027s the best of the bunch so far as I can tell. At least so far. They may eventually fall prey to the same problems as the bad players.\u003C/p\u003E\u003Cp\u003EIt all comes down to you and your browsing habits. You are the number 1 best line of defense, and the highest risk at the same time. There is no program that can protect you from a bad or stupid or uninformed decision. We all know that the Brooklyn Bridge is not for sale. Some of us still believe that we can \u0022work at home and make thousands of dollars a week\u0022, however.\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2013-11-23T00:44:13Z","Content":"\n\u003Cp\u003EOnce you disable Avast\u0027s audio and pop up notifications, it\u0027s highly recommended.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-11-23T01:24:05Z","Content":"\n\u003Cp\u003EAvast, Avg, and Kaspersky. But i don\u0027t really need any because i know what malware smells like.\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-11-23T03:45:46Z","Content":"\n\u003Cp\u003E*common sense, the best AV of all time.\u003C/p\u003E\u003Cp\u003E**Common sense is not all that common.\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-11-23T04:03:51Z","Content":"\n\u003Cp\u003EI like both Avast and/or Microsoft Security Essentials, and combine one of those with MalwareBytes and SuperAntispyware. All free, and viruses can\u0027t touch this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-05T03:15:58Z","Content":"\n\u003Cp\u003EFrom my experience:\u003C/p\u003E\u003Cp\u003EFree:\u003C/p\u003E\u003Cp\u003EBest, avast\u003C/p\u003E\u003Cp\u003EWorst, avg\u003C/p\u003E\u003Cp\u003EPaid:\u003C/p\u003E\u003Cp\u003EBest Mcafee,\u003C/p\u003E\u003Cp\u003EWorst ?\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-12-05T19:36:38Z","Content":"\n\u003Cp\u003EI use avast free, and apparently it is supposed to stop asking you to buy the full version after a few months and it just gives up. I don\u0027t know about this but it seems to keep my computer safe. I would also recommend Malwarebytes anit-malware. (Free!)\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2013-12-05T22:28:28Z","Content":"\n\u003Cp\u003EI don\u0027t think most AV programs recognize much (if anything) in the Toolbar and Potentially Unwanted Program categories.\u003C/p\u003E\u003Cp\u003EThis leads me nicely into why I was looking at this thread again. Came across a program recently called AdwCleaner (\u003Ca href=\u0022http://www.bleepingcomputer.com/download/adwcleaner/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.bleepingcomputer.com/download/adwcleaner/\u003C/a\u003E), which I found when I noticed that my current methods had failed quite spectacularly to totally remove conduit after it snuck onto my system (I obviously wasn\u0027t paying attention that day, and I\u0027d like to commend the program for sitting for so long before changing my homepage again).\u003C/p\u003E\u003Cp\u003EThe program has a very narrow focus. It checks the registry, browser settings, shortcuts, and ad ons (and I think that\u0027s it). It does seem to be very good at what it does though. My only issue with it is that it\u0027s just an application, so rather than installing and updating, you actually need to download the new version. On the other hand, this is really only a program you would run if you notice something wrong (or every month or something), like your browser randomly redirecting and so on.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-05T23:10:14Z","Content":"\n\u003Cp\u003EAVG. AVG. AVG. \u003C/p\u003E\u003Cp\u003ESeriously, it will protect you from almost ANY threat, and it doesn\u0027t screw up your computer like Norton!\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-12-06T05:39:45Z","Content":"\n\u003Cp\u003EYeah, software like Norton and McAfee are the worst. My laptop came with McAfee, and after uninstalling it, it had a 50% boost in performance. TBH, so long as you aren\u0027t visiting sketchy websites or torrenting, Windows Security Essentials is all you need.\u003C/p\u003E\n"},{"CreatedByName":"Mmmmyum","CreatedById":85231,"CreatedDateTime":"2013-12-06T12:13:28Z","Content":"\n\u003Cp\u003EI just use Windows Defender. I don\u0027t know how good MS\u0027s antimalware was before 8 though, but I haven\u0027t heard good things\u003C/p\u003E\n"}]}