{"TopicId":53929,"ForumId":44,"TopicTitle":"How will we use the Higgs Field?","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-11-21T21:24:30Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-11-21T21:24:30Z","Content":"\n\u003Cp\u003EOn the 4th of July 2012, the wonderful people manning the Large Hadron Collider at CERN announced that they almost definitely found hard evidence of the Higgs Boson predicted by the Standard Model.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Standard_Model_of_Elementary_Particles.svg/300px-Standard_Model_of_Elementary_Particles.svg.png\u0022 alt=\u0022300px-Standard_Model_of_Elementary_Particles.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EStare long and hard at it, folks, because this is the most important family photo you will ever see.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EFinding this \u0022goddamned\u0022 particle was so important because it provided experimental backing of the existence of the Higgs Field, the interaction with which being what gives particles mass. Understanding what gives anything this most fundmental of properties is obviously needed to develop a complete understanding of the Universe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.nationalgeographic.com/wpf/media-live/photos/000/523/overrides/new-type-baryon-particle-found-large-hadron-collider_52366_600x450.jpg\u0022 alt=\u0022new-type-baryon-particle-found-large-hadron-collider_52366_600x450.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EHere\u0027s to you, super-science machine.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022But what is the actual, real world benefit of this one little particle?\u0022 Says the idiot in the corner.\u003C/p\u003E\u003Cp\u003EWait, actually, that is a good question. While knowing more about how the Universe works is a worthy goal for the human race, we could also use the fruits of our labors to improve the human condition.\u003C/p\u003E\u003Cp\u003EDon\u0027t think I\u0027m one of those armchair politicians who wants to gut the experimental physics budget and send it straight to curing cancer or whatever. It\u0027s simply that recently, in Physics class, conversation turned to it\u0027s discovery, and the cost of the project to find it. One boy in the class said \u0022What had we got from it?\u0022. My immediate thoughts turned to what area of the body would cause maximum pain if I punched it, as I thought about it, I wondered to myself \u0022In 50, or 100 years time, how will the human race be affected by this newly opened chapter in particle physics?\u0022.\u003C/p\u003E\u003Cp\u003EWhen a new area of theoretical physics opens up to study, it appears to the general public, and indeed to many contemporary scientists, as \u0022useless\u0022. Then, when the aspects of it is quantified, tested, how it effects the \u0022real world\u0022 is brought to the limelight, and the people who pay attention understands how it can make us powerful. Then, often after decades of study, new inventions utilizing it make their appearance, often changing the world. While it can take a human lifetime, several lifetimes even, for the benefits to come about, when they do they come hard and fast.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.ieeeghn.org/wiki/images/d/d6/Maxwell_image_02.jpg\u0022 alt=\u0022Maxwell_image_02.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMaxwell\u0027s equations, 1873\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.enjoyspace.com/uploads/portfolios/2012/Apollo17/thumbnail/1000x600_08-apollo17.jpg\u0022 alt=\u00221000x600_08-apollo17.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ETelevision from the Moon, 99 years later.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAlready, the Higgs Field is on it\u0027s way to being a part of everyday society. With it discovered, effort know turns to measuring it, pulling out how it works from Natures bosom. The International Linear Collider will build on LHC\u0027s legacy of particle-smashing to begin refined study of the Higgs Field and it\u0027s Boson.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/d/dd/ILC_SchemeTDR.jpg\u0022 alt=\u0022ILC_SchemeTDR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe next contender in impressive scientific megaprojects that begin with \u0022International\u0022.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWhat I\u0027m asking you is, how do you think humanity in the future will be using the Higgs Field in practical applications, similar to how nowadays we use electromagnetism for radio, and atomic nuclei for fission. No idea is too far fetched, nobody in 1850 would\u0027ve ever guessed what we have achieved using their work. The Higgs Field gives stuff mass, so whatever we use it for, it\u0027s going to be really cool! After all, the next generation will be standing on the shoulders of giants.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-11-21T21:31:18Z","Content":"\n\u003Cp\u003EAnti-mass? Even the ability to reduce mass, Light speed here we come.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-11-21T21:33:28Z","Content":"\n\u003Cp\u003EPotentially mass manipulation and or inertia dampening.\u003C/p\u003E\u003Cp\u003EWithin our lifetimes, probably very little other than refinements of our understanding of the universe which may in turn lead to other interesting applications.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-11-21T21:38:37Z","Content":"\n\u003Cp\u003EI do say, reducing the mass of stuff would be quite a hoot for spaceflight.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-21T21:47:38Z","Content":"\n\u003Cp\u003EFinally a way to punch Rocket Equation in the face \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Also, Alcubierre Drive - for realz \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2013-11-21T22:07:16Z","Content":"\n\u003Cp\u003EHigg\u0027s Boson as it\u0027s own particle/field = FTW,\u003C/p\u003E\u003Cp\u003EResearch is being conducted on harnessing the quantum effects of nanoscale capacitors to create digital quantum batteries. Although this technology is still in the experimental stage, it theoretically has the potential to provide dramatic increases in energy storage capacity\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Energy_storage#Advanced_systems\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Energy_storage#Advanced_systems\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-21T22:51:47Z\u0022 title=\u002211/21/2013 10:51  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 21, 2013\u003C/time\u003E by Lohan2008\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2013-11-21T22:41:15Z","Content":"\n\u003Cp\u003ELove the idea of an \u003Cstrong\u003Eanti\u003C/strong\u003E-higgs boson; it is bad enough trying to picture a force that makes everything \u0022pop\u0022 into existence \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eand then\u003C/span\u003E trying to warp your mind around a yet undiscovered force that makes everything loose electromagnetic attraction.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/apq_2hNQ4ew?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-21T22:51:20Z\u0022 title=\u002211/21/2013 10:51  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 21, 2013\u003C/time\u003E by Lohan2008\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-21T23:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EAnti-mass? Even the ability to reduce mass, Light speed here we come.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falofonos\u0022 data-cite=\u0022falofonos\u0022\u003E\u003Cdiv\u003EPotentially mass manipulation and or inertia dampening.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EI do say, reducing the mass of stuff would be quite a hoot for spaceflight.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere are you guys getting this nonsense? For matter fields, Higgs mechanism provides a tiny amount of current mass. The chiral symmetry is dynamically broken anyways. 99% of mass is due to kinetic energy of quarks and gluons in nuclei.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003EHow will we use the Higgs Field?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow are we using weak and color fields? These are way more accessible than Higgs field, and we are doing nada with these. Heck, our use of gravitational field is rudimentary. The only reason we make good use of electromagnetic field is that it has such strong coupling, infinite range, and the two charges can cancel eachother out. Other fields don\u0027t have such nice, convenient properties.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-11-21T23:47:08Z","Content":"\n\u003Cp\u003EAw k^2 can\u0027t you let us dream for a little longer before you crush us with painful reality.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-21T23:50:47Z","Content":"\n\u003Cp\u003EThis guy is no fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-22T00:50:43Z","Content":"\n\u003Cp\u003EWell, I hate to say it, but I bet there was a K^2 in 1873 whom was saying not much would change \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe beauty of knowledge and technology is that it tends to accelerate. What is mundane for us, is absolutely unbelievable for just a generation earlier. Just a couple of years before my grandmother was born, the first aircraft had barely left the earth and we had only just begun understanding that atoms exist and what their nature is. When my mother was born flying had become a common form of transport routinely done, DNA was being discovered and not much later the world was racing for the moon. Crude ballistical computers were developed to keep the enemy at bay. When I was born, computers many times faster than those huge ballistical devices started to appear in regular people\u0027s homes, expensive though they were. Information systems were switched from analog to digital. With the advent of the next generation, a huge near neural network that spans the world has formed, we are smashing protons apart to understand the very fabric of the universe and we carry enormous amounts of calculative power in our pockets to look at cats.\u003C/p\u003E\u003Cp\u003EJust looking at the facts there is almost no other possibility than that our world will almost unrecognizably change yet again. Saying anything else is just denying the obvious. The only reason for discarding silly ideas about the future it is that the future will most likely be a lot sillier than what even the most dangerously unstable fantast comes up with today.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-22T02:49:56Z\u0022 title=\u002211/22/2013 02:49  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 22, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-22T01:33:03Z","Content":"\n\u003Cp\u003ELet\u0027s weaponize it...\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-11-22T02:06:56Z","Content":"\n\u003Cp\u003ELess mass paves the way to the inevitable \u0022no mass\u0022 and \u0022anti-mass\u0022. I imagine hoverboards would be as far away as finding some revolutionary new means of controlling this field on a small level. Of course, there is a bit over a year before Back to the Future\u0027s 2015 is predicted to be at. I\u0027m sure it could still happen if some worldwide revolutionary new system put our economies into overdrive...\u003C/p\u003E\n"},{"CreatedByName":"AndrewBCrisp","CreatedById":57119,"CreatedDateTime":"2013-11-22T02:35:53Z","Content":"\n\u003Cp\u003EK^2 has a point. We\u0027re looking at fields that while we can prove they exist, don\u0027t have nice, easy ways for us to manipulate. This does not mean we will \u003Cem\u003Enever\u003C/em\u003E learn how to manipulate them, but the gap between theory and practical application may be bigger than we think. No hoverboards by 2015, but maybe if you wait until 2515...\u003C/p\u003E\u003Cp\u003EFor myself, I\u0027m thinking it\u0027s a good thing that that gap is so big, because I\u0027m not sure a blanket mass-reduction mechanism is a good idea. True, we could theoretically use it to make things lighter (though not as much as some people would like, if the Higgs field truly contributes only a tiny portion of mass to matter), but remember such a mechanism would likely affect ALL particles. And if you reduce the mass of particles, you could change their behavior in ways you didn\u0027t expect - or like. \u003C/p\u003E\u003Cp\u003EFor example, what might happen if you reduce the mass of electrons? What\u0027s the effect on electron shells of atoms - and on chemical reactions? (Or: what use is a hoverboard if the rider dies because his body chemistry goes haywire the moment he steps on it?)\u003C/p\u003E\u003Cp\u003EOr the Z and W bosons? IIRC, those control the weak nuclear force, which governs radioactivity: what happens if you reduce \u003Cem\u003Etheir\u003C/em\u003E mass? Will stable isotopes stay stable? Could radioactive isotopes become more active, more dangerous? \u003C/p\u003E\u003Cp\u003EBasically, I\u0027d like to know the general failure modes and side-effects of a Higgs-dampening field \u003Cem\u003Ebefore\u003C/em\u003E we start churning out the antigravity devices of our dreams. And the big theory-to-engineering gap the field presents can let us find that out ahead of time.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-22T02:53:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndrewBCrisp\u0022 data-cite=\u0022AndrewBCrisp\u0022\u003E\u003Cdiv\u003EBasically, I\u0027d like to know the general failure modes and side-effects of a Higgs-dampening field \u003Cem\u003Ebefore\u003C/em\u003E we start churning out the antigravity devices of our dreams. And the big theory-to-engineering gap the field presents can let us find that out ahead of time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELuckily we have smart scientists, who not only develop an amazing technology, but also check whether it might cause the universe to fall apart upon use. If so \u0026gt; do not sell.\u003C/p\u003E\n"},{"CreatedByName":"xxjetterxx","CreatedById":37766,"CreatedDateTime":"2013-11-22T02:55:53Z","Content":"\n\u003Cp\u003EInfiniglide IRL anyone?\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2013-11-22T03:16:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xxjetterxx\u0022 data-cite=\u0022xxjetterxx\u0022\u003E\u003Cdiv\u003EInfiniglide IRL anyone?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s supposed to be KSP only, dammit! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut in all seriousness, I have no idea how we could use it given the reasons above.\u003C/p\u003E\n"},{"CreatedByName":"Bunsen","CreatedById":10598,"CreatedDateTime":"2013-11-22T03:43:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndrewBCrisp\u0022 data-cite=\u0022AndrewBCrisp\u0022\u003E\u003Cdiv\u003EK^2 has a point. We\u0027re looking at fields that while we can prove they exist, don\u0027t have nice, easy ways for us to manipulate. This does not mean we will \u003Cem\u003Enever\u003C/em\u003E learn how to manipulate them, but the gap between theory and practical application may be bigger than we think. No hoverboards by 2015, but maybe if you wait until 2515...\u003Cp\u003EFor myself, I\u0027m thinking it\u0027s a good thing that that gap is so big, because I\u0027m not sure a blanket mass-reduction mechanism is a good idea. True, we could theoretically use it to make things lighter...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure you caught K^2\u0027s actual point. Knowing how the Higgs field works doesn\u0027t open up the ability to change particle masses any more than knowing how electrodynamics works allows you to change the charge of an electron, or knowing about W/Z boson couplings lets you turn beta decay on and off.\u003C/p\u003E\u003Cp\u003EWe\u0027ve learned to exploit the electromagnetic properties of nature in very important ways, and maybe someday the other fundamental forces will also have technological application (beyond clumsy, tangential uses like nuclear reactions), but physics as we know it contains no indication that you can change how any of those fundamental interactions work.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-22T06:37:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndrewBCrisp\u0022 data-cite=\u0022AndrewBCrisp\u0022\u003E\u003Cdiv\u003EK^2 has a point. We\u0027re looking at fields that while we can prove they exist, don\u0027t have nice, easy ways for us to manipulate. This does not mean we will \u003Cem\u003Enever\u003C/em\u003E learn how to manipulate them, but the gap between theory and practical application may be bigger than we think. No hoverboards by 2015, but maybe if you wait until 2515...\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s BS, I don\u0027t have that long!!! I have to wait until 2515? Where\u0027s the complaint department?\u003C/p\u003E\n"},{"CreatedByName":"Jim DiGriz","CreatedById":92465,"CreatedDateTime":"2013-11-22T07:04:32Z","Content":"\n\u003Cp\u003EOkay, lets say that we look at the bigger picture and say that Higgs field is part of a Grand Unified Field Theory. Lets also assume that there are X and Y bosons out there waiting to be found which violate baryon conservation and mediate proton decay. If we could harness a strong enough beam of those, maybe we could learn to catalyze proton decay, liberating a total mass conversion drive for a nuclear photonic rocket. Not quite as sexy as an Alcubierre drive, but nuclear energy currently only liberates about 0.1% of the mass-energy of the fuel, while this would be ideally 100% energy conversion with an Isp of light speed -- but that is with perfect collimation and if some of the energy escapes as neutrinos or other weakly interacting massive particles then there would be inefficiencies. If you look at some of the jets coming from black holes those are radiating energy at something like 60%(?) of the infalling matter, so approaching total conversion is something that does exist in the universe, we just haven\u0027t figured out how to harness it yet.\u003C/p\u003E\u003Cp\u003EIf I was writing a science fiction story, the massive amounts of supersymmetric particles that it sprays out in all directions would radiate as a shockwave of information travelling at light speed through the Universe announcing that we had achieved interstellar travel and detectors on other planets would pick this up, and that\u0027s when the warring alien races look our way... As the number of systems that information hits would increase geometrically with time/distance, it would only be a relatively short matter of time before first contact.\u003C/p\u003E\u003Cp\u003EThe Higgs alone wouldn\u0027t get us there, but it\u0027d be a step in that direction...\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2013-11-22T14:49:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bunsen\u0022 data-cite=\u0022Bunsen\u0022\u003E\u003Cdiv\u003EI\u0027m not sure you caught K^2\u0027s actual point. Knowing how the Higgs field works doesn\u0027t open up the ability to change particle masses any more than knowing how electrodynamics works allows you to change the charge of an electron, or knowing about W/Z boson couplings lets you turn beta decay on and off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tend to think that you are missunderstanding him there, as you confuse electrons with an electromagnetic field. To do electronics, you don\u0027t need to be able to change any fundamental property of electrons, but only of their distribution. Similiarily, you could achieve a change of mass by redistributing Higgs bosons (apart from this being a horrible oversimplification). Thus compare mass (induced by \u0022presence\u0022 of Higgs bosons \u002B relativity) with charge (induced by electrons, etc.).\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-22T17:49:55Z","Content":"\n\u003Cp\u003EAs with any form of science. You can never truly tell what the off shoots of scientific research are.\u003C/p\u003E\u003Cp\u003ESo many things have been discovered by accident. For all we know this \u0022higgs Field\u0022 could lead to a new form of uranium enrichment (total randomness).\u003C/p\u003E\u003Cp\u003EProffessor Brian Cox did an extremely interesting documentary on the subject for the BBC. Science Britanicca it was called (its a little patriotic to the brits but theres plenty of fact there)\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-23T00:37:02Z","Content":"\n\u003Cp\u003EIf we can locally strengthen or weaken the weak force by changing effect the higgs boson has on the the mass of the W and Z bosons, then we change the stability of nuclear isotopes. It may be possible to access the hypothesised island of stability around atoms with 300 to 330 protons. Some of these might prove to be powerful and maybe even safer alternatives to nuclear fission power sources. Imagine having a single battery in your pocket that powers your house and your car and everything else you own, and you only need one in your whole lifetime.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2013-11-23T00:49:13Z","Content":"\n\u003Cp\u003E^ \u003Ca href=\u0022http://www.damninteresting.com/half-science-and-hafnium-bombs/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.damninteresting.com/half-science-and-hafnium-bombs/\u003C/a\u003E comes to my mind immediately\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-23T01:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003E^ \u003Ca href=\u0022http://www.damninteresting.com/half-science-and-hafnium-bombs/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.damninteresting.com/half-science-and-hafnium-bombs/\u003C/a\u003E comes to my mind immediately\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Csup\u003E178m2\u003C/sup\u003EHf decay is a strong process. It has nothing to do with weak decay.\u003C/p\u003E\n"}]}