{"TopicId":53975,"ForumId":51,"TopicTitle":"The daring rescue of Jebediah, stranded first Kerbal in space! (Pic Heavy)","CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-11-22T04:44:45Z","PageNum":1,"Articles":[{"CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-11-22T04:44:45Z","Content":"\n\u003Cp\u003EOur story begins in the early days of the Space Program under the steady hand of Director Nesh. (It should be noted that Director Nesh did enjoy a solid session with a bottle of whiskey from time to time, usually leading to a much less steady hand) \u003C/p\u003E\u003Cp\u003EIn those early days things were rough as we strove into undiscovered country (*cough* thanks star trek). The trouble started the day the KSPs physicists and aeroengineering team went out for drinks to celebrate a colleagues birthday. Stupidly deciding to go back to work several drinks later, an unknown engineer miscalculated the fuel requirements for establishing orbit and then deorbiting a capsule for reentry into Kerbin\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003EPoor Jebediah Kerbin, the famous first astronaut of his kind, the first Kerbal to orbit his home planet!!!...was stranded on his maiden voyage aboard Nomad-1. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot22.jpg\u0022 alt=\u0022screenshot22.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFollowing an emergency procedure he had written himself 15 seconds earlier, Jeb exited Nomad-1 on an EVA and attempted to use his suits RCS thrusters to slow the pod down. If he could get the pod to drop lower than 70km, it would hit atmosphere, decelerate and return safely to the surface (assuming his capsules parachute worked!).\u003C/p\u003E\u003Cp\u003EAfter being knocked around by his wildly spinning pod, nearly being thrown into space and using up 90% of his RCS just trying to get back in (Nomad-1 had minimal electricity left, no solar panels, no SAS stabiliser system), Jeb settled in while the KSP learned how to actually build and fly rocketships, rather than catapulting poor Kerbins into the unknown without any clue of what would happen. It was a lonely year and a month on orbit for Jeb, without food, water and a command chair which doubled as his toileting facilities.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot5.jpg\u0022 alt=\u0022screenshot5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot only was Jeb stuck, but he was in an eccentric elliptical orbit making matching that orbit bothersome. So the the programs best engineers downed hangover cures and were put to work. Director Nesh had never lost a man and didn\u0027t intend to leave a hero in orbit!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot1.jpg\u0022 alt=\u0022screenshot1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA year later after losing a man during the first docking of two manned spacecraft, Director Nesh was pushing for Jeb\u0027s rescue. (And a media blackout) \u003C/p\u003E\u003Cp\u003EThe program got to work designing of the Capture Probe. A 4 stage rocket using solid boosters, 4 main engines, a final single engine orbital stage and the probe itself.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot4.jpg\u0022 alt=\u0022screenshot4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EShe was an ungainly craft with a smaller engine for on orbit maneuvers as well as lots of RCS fuel for the careful attitude adjustments required for a daring rescue. \u003C/p\u003E\u003Cp\u003EThe probe itself used a remote satellite core to control a capture scaffolding. This used a baseplate for adapting rocket sizes at its base, fitted with four struts to hold Nomad-1. To the struts were attached lights for the difficult capture and RCS thruster blocks. Solar panels and parachutes were added so the vehicle had power and could possibly be recovered. Batteries, SAS, fuel and more RCS were fitted behind the probe-core. Its systems checked out and so the launch window approached and the countdown began!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot9.jpg\u0022 alt=\u0022screenshot9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd launch of Capture Probe to go save Jeb in his very smelly Nomad-1. \u003C/p\u003E\u003Cp\u003EPlus 19 seconds and counting, 2000m, 500m downrange.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot11.jpg\u0022 alt=\u0022screenshot11.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBy 10,000m we had dropped our solid boosters and began angling for orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot14.jpg\u0022 alt=\u0022screenshot14.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA short two minutes later and we were well into our orbital burn.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot15.jpg\u0022 alt=\u0022screenshot15.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEngine shutdown as our apoapsis went over 70km with another burn closer to apoapsis to make orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot19.jpg\u0022 alt=\u0022screenshot19.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EInitial assessment of Capture Probe was nominal, soon after her solar arrays were deployed successfully.\u003C/p\u003E\u003Cp\u003EOnce we made orbit we began the awkward set of burns required to match orbit with Nomad-1. By 15 hours Capture probe was set to pass within 20km of Jeb whose comm frequency had been filled with potty language for months. The mission was proceeding as planned!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot29.jpg\u0022 alt=\u0022screenshot29.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHorror struck 16 hours into flight when mission control realised that leaving the probes extensive lighting system on had drained its batteries while we were on Kerbin\u0027s night side. So close to intercept and Capture Probe couldn\u0027t maneuver! A heavy decision was made to abort intercept in the hopes that a few more orbits would give the solar arrays time to recharge. A brave engineer quietly turned off the light switch he\u0027d forgotten in his 3 step procedure document for the mission. \u003C/p\u003E\u003Cp\u003ECapture probe\u0027s solar arrays compensated and the batteries recharged. Mission control regained control and that engineer quietly slipped out as the flight director started rampaging for the culprit. Mission control staged the now empty orbital engine leaving the final stage to burn for a new intercept course. Tension rose as Kerbals below watched, knowing that fuel would be needed to deorbit, lest Capture Probe end up floating aimlessly with Jeb and not having even brought him a proper toilet!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot31.jpg\u0022 alt=\u0022screenshot31.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAn hour later things were finally back on track with a mere 6km between Jeb\u0027s Nomad-1 and the Capture Probe. Half the fuel tank remained so there was no more room for more mistakes! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot34.jpg\u0022 alt=\u0022screenshot34.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECapture Probe approached Nomad-1 carefully.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot37.jpg\u0022 alt=\u0022screenshot37.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission control matched speed with Nomad-1 and at 100m throttled down the main engine, switching to RCS for line up and capture.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot38.jpg\u0022 alt=\u0022screenshot38.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot39.jpg\u0022 alt=\u0022screenshot39.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E10 metres, careful jets of RCS maintaining alignment. Nomad-1 was in a 2 axis roll making her hard to predict.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot40.jpg\u0022 alt=\u0022screenshot40.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E3 metres! Careful now...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot41.jpg\u0022 alt=\u0022screenshot41.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd capture! of Nomad-1 at 17 hours, 30 minutes and 26 seconds into the mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot47.jpg\u0022 alt=\u0022screenshot47.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting our drunken Kerbal scientists back from the bar, we put them to work figuring out how much we needed to decelerate Nomad-1 to get Jeb home. With a periapsis (lowest point in his orbit) of 96km we\u0027d need to get him below the 70km mark at least. 50km would be optimal to ensure air resistance brought the capsule down in a single orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot51.jpg\u0022 alt=\u0022screenshot51.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission control had to be very careful as there was no secure docking between the two craft. Nomad-1 was lying on the baseplate and rolling around. Too much thrust in any direction could have destroyed both craft and killed the already delusional Jeb. \u003C/p\u003E\u003Cp\u003EWith Capture Probe \u0022in front\u0022 of Nomad-1, she carefully fired her RCS retrograde retrograde (against both craft\u0027s current direction of movement) in spurts, slowing both craft down. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot52.jpg\u0022 alt=\u0022screenshot52.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter several minutes of short burns, it was a success! Their combined periapsis had been dropped right down to 28km ensuring Nomad-1 would deorbit. Now Capture Probe had to separate from Nomad-1 otherwise reentry would almost certainly destroy both vessels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot53.jpg\u0022 alt=\u0022screenshot53.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd detachment!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot54.jpg\u0022 alt=\u0022screenshot54.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission control was full of cheers as Nomad-1 proceeded on a course towards mother Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot57.jpg\u0022 alt=\u0022screenshot57.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUsing what little fuel it had left, Capture probe burned prograde, raising its periapsis to 83km to maintain a single orbit, allowing Mission control to focus on Jeb\u0027s reentry. Now Jeb was on his own.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot62.jpg\u0022 alt=\u0022screenshot62.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith such a steep descent and so long in the cold of space, some wondered if Jeb\u0027s capsule would survive reentry. Jeb hit the atmosphere at 1.7km/sec\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot65.jpg\u0022 alt=\u0022screenshot65.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt 5,000m his parachute successfully deployed and at 900m it opened completely. Jeb had finally returned to Kerbin, minus the use of his legs and with severe dystrophy of his heart. He would probably be wheelchair bound for the rest of his short life...not to mention his ongoing psychosis, but he was alive!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot66.jpg\u0022 alt=\u0022screenshot66.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile capture probe was ready for reentry. Plans were in effect to attempt to bring it down in one piece so that it could be displayed at the Kerbsonian museum.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot68.jpg\u0022 alt=\u0022screenshot68.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUsing the last of her fuel and a helping hand from her RCS thrusters Capture Probe began her final descent towards Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot69.jpg\u0022 alt=\u0022screenshot69.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs capture probe hit atmosphere almost 19hrs after launch, mission control realised one of her solar panels hadnt been retracted yet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot70.jpg\u0022 alt=\u0022screenshot70.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E5 seconds later it didnt really matter (notice the bits of solar panel flying out behind)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot72.jpg\u0022 alt=\u0022screenshot72.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAmazingly capture probe held together during her descent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot74.jpg\u0022 alt=\u0022screenshot74.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd parachute deployed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aiahome.com/ctf/pics/KSPrescue/screenshot77.jpg\u0022 alt=\u0022screenshot77.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E19 hours after launch, capture probe came to rest on the other side of Kerbin as mission control had yet to learn how to accurately land an orbiting spacecraft. Meanwhile Jebediah Kerbin was safely on his way back to the astronaut complex sputtering nonsense to the field medic. A week later he told a local paper he was \u0022enjoying real food and having a healthy poop in a chair other than the one he usually sits in.\u0022 He is expected to file for damages.\u003C/p\u003E\u003Cp\u003EAnd so the Kerbal space program continues with its hero Astronaut back on firm soil!!\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-22T10:18:21Z","Content":"\n\u003Cp\u003EGood job. And very entertaining \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I hope you will write more reports about mis-adventures of your daring kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-22T13:06:35Z","Content":"\n\u003Cp\u003EVery interesting rescue method and great writing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2013-11-22T18:21:56Z","Content":"\n\u003Cp\u003ELove KSP simply for the creativity of it. I would never have thought to make something like this, i would have just gotten 2 capsules and put Jeb in one. Very interesting method!\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2013-11-22T18:32:30Z","Content":"\n\u003Cp\u003EVery cool. Glad the basket worked for you too.\u003C/p\u003E\n"}]}