{"TopicId":53994,"ForumId":55,"TopicTitle":"GPS - Global Positioning System","CreatedByName":"sandrader","CreatedById":94020,"CreatedDateTime":"2013-11-22T11:18:08Z","PageNum":1,"Articles":[{"CreatedByName":"sandrader","CreatedById":94020,"CreatedDateTime":"2013-11-22T11:18:08Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI didn\u0027t see this suggestion before (Maybe is in the game and I didn\u0027t find \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E)\u003C/p\u003E\u003Cp\u003EMy suggestion is something like, if you put satellites in orbit of a planet (or a natural satellite), and three of them with the technology of GPS (a utility maybe?) is in the sky at one moment, a Kerbal in EVA can know his position in that planet.\u003C/p\u003E\u003Cp\u003EJust trying to make satellites more useful.\u003C/p\u003E\u003Cp\u003EThanks, and sorry for anything or bothering \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"plainawesome","CreatedById":76282,"CreatedDateTime":"2013-11-22T20:38:44Z","Content":"\n\u003Cp\u003EHi, welcome to the forums. Seems that you\u0027re a bit nervous, so let me give you some pointers. First of all, I think that this is a good idea. Secondly, there is no need to apologize, since we can tell that this is your first post, not by the way that you type, but by how many posts you had on the left side of your screen. Finally, most people don\u0027t have a successful first post on any forum (like mine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/42875-Nerd%C2%B3-s-Challenge\u0022 rel=\u0022external nofollow\u0022\u003ENerd Cubed Challenge\u003C/a\u003E). Hope to see you post more frequently. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SilverWarior","CreatedById":80669,"CreatedDateTime":"2013-11-23T07:27:59Z","Content":"\n\u003Cp\u003EI must say I like your idea verry much. Currently the game doesn\u0027t provide any real incentive to put a permament satelite into orbit except of your satisfaction that you did it.\u003C/p\u003E\n"},{"CreatedByName":"Anthlon","CreatedById":58074,"CreatedDateTime":"2013-11-23T10:19:46Z","Content":"\n\u003Cp\u003EI like that idea, after sucessfull establish of satelites (3\u002B would be nice, its not so easy, not so difficult), you (could then) gain access to \u0022precise\u0022 surface (or lower altitudes) navigation/orientation (navball or just window/gauge with direction and distance). Of course as usual satelites nead continuous power source, stable orbit.. etc..\u003C/p\u003E\u003Cp\u003EThis leads me to this new parts idea:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EGPS satelite transmitter\u003C/span\u003E (for satelite)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EGPS signal reciever \u003C/span\u003E(for ship just for recieve information)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EGPS nav unit\u003C/span\u003E (enhancing navbal by one symbol leading to selected destination while you have signal from satelite)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Emaybe somebody will direct us to mod section, but i am not suggesting super advanced functions ,menus etc.., just simple ones, as a stock parts do.., this could extend tech tree easily.\u003C/p\u003E\u003Cp\u003E..by the end, it can maybe named as a \u003Cspan style=\u0022color:#0000CD;\u0022\u003E\u003Cstrong\u003EKPS\u003C/strong\u003E\u003C/span\u003E(Kerbal position system or something like that, i am not so happy by using same names as we do, because i am still fan of that kerbal world is it\u0027s own by all ways you see it)\u003C/p\u003E\n"},{"CreatedByName":"S4qFBxkFFg","CreatedById":83727,"CreatedDateTime":"2013-11-26T15:21:56Z","Content":"\n\u003Cp\u003EVery good idea - I\u0027d probably want to make it quite tech-expensive (would require atomic clocks in space) but it\u0027s an obvious goal for any space agency.\u003C/p\u003E\n"}]}