{"TopicId":54184,"ForumId":16,"TopicTitle":"Atmospheric pressure and lift","CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-11-24T05:31:13Z","PageNum":1,"Articles":[{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-11-24T05:31:13Z","Content":"\n\u003Cp\u003EHey all,\u003C/p\u003E\u003Cp\u003EIs there any relationship between atmospheric density and lift generated by a surface at a given speed? Obviously, no atmosphere = no lift, so it makes sense that increased atmospheric density leads to increased lift; But is the relationship linear? Does it reach a limit? \u003C/p\u003E\u003Cp\u003EI\u0027m thinking about attempting to build an eve lander that uses controlled flight and I\u0027m curious how expect it\u0027s flight characteristics will change between Kerbin\u0027s atmosphere and Eve\u0027s.\u003C/p\u003E\u003Cp\u003EAny feedback is appreciated, thanks!\u003C/p\u003E\n"},{"CreatedByName":"RSwordsman","CreatedById":78678,"CreatedDateTime":"2013-11-24T07:34:34Z","Content":"\n\u003Cp\u003EAs far as I know, yes. The higher the atmospheric density, the more pronounced are all aerodynamic effects. There might be a sort of butter-zone, however, because if the atmosphere is TOO dense, drag will overcome any other beneficial properties. If I had to come up with a curve for flight efficiency, I\u0027d say it starts out as a dramatic increase, which then slows down exponentially as density increases.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-11-24T07:43:30Z","Content":"\n\u003Cp\u003EYes. All else being equal, higher pressure/density will increase lift. Both in game and RL.\u003C/p\u003E\u003Cp\u003EHowever as RSwordsman pointed out, there is more drag too. So increased parasitic drag will probably make the glide distance worse.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-11-24T18:23:05Z","Content":"\n\u003Cp\u003EThe drag isn\u0027t a problem, in fact I\u0027m counting on it. I\u0027d like to glide to have some control over the where the lander comes down and increase the time in the atmosphere to shed velocity without a burn. Not sure if I\u0027ll take the aerodynamic sections back with me.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-11-24T18:37:51Z","Content":"\n\u003Cp\u003ELift and drag are both linear in air pressure. Lift is linear in speed, whereas drag is quadratic. As air pressure increases, you fly slower, which means your lift:drag ratio improves.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-11-24T22:59:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003ELift and drag are both linear in air pressure. Lift is linear in speed, whereas drag is quadratic. As air pressure increases, you fly slower, which means your lift:drag ratio improves.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is EXACTLY the kind of answer I needed. Thanks!!!\u003C/p\u003E\n"}]}