{"TopicId":54204,"ForumId":51,"TopicTitle":"First full-fledged (Successful) plane project!","CreatedByName":"Chief5697","CreatedById":94296,"CreatedDateTime":"2013-11-24T13:30:33Z","PageNum":1,"Articles":[{"CreatedByName":"Chief5697","CreatedById":94296,"CreatedDateTime":"2013-11-24T13:30:33Z","Content":"\n\u003Cp\u003EWhen I first got KSP, I was really excited about the SPH (Since I like planes ALOT) so I decided to try the controls with some of the stock planes as usual. I thought up some really cool ideas of some sort of spaceplane that could handle both atmosphere and that vacuum of space everybody knows alot. Took some weeks to think out, but of course, school and stuff made me have to take a pretty long break.\u003C/p\u003E\u003Cp\u003E I returned to KSP a few months ago, in September 2013. I decided that I\u0027d use my old skills (Which rusted up alot) and maybe look for some mods. My way of playing is more of one huge experiment. I do use infinite fuel sometimes, but like I said, huge experimental stuff. One day, I was prepped with Novapunch and a couple of other mods, plus my brain (Aka imagination and thought). I started making a sort of spaceplane that focused on having some pretty big wings, but lots of stability and thrust. These ideas went through a gauntlet of ideas, from basic design to crew capacity and sciency things. Well, those ideas started with what I call the S.R.P.S (Standard Rocket Propelled Shuttle) Eagle. At the time I thought up the main design for it, being a small shuttle with not many chances of getting to places like Eeloo. I took some wing connectors from stock parts, as well as structural wings, and I put the Heavy Control Winglet from Novapunch mod at the end. I noticed how there was lots of space under the wings (As I placed the wings form the top of the fuselages) so I put some heavy RCS (once again from Novapunch parts) Under there. Tested it, went pretty well. I don\u0027t actually have any screenshots from the prototype, but I do for the first true build here.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YmtxWb2.png\u0022 alt=\u0022YmtxWb2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI managed to tweak it a bit. Since I enjoy messing around with my own game and editing config files to turn parts into ridiculously unrealistic stuff that nobody would probably use, I configured a regular Aerospike Engine to send stuff at about a thrust power of 2500.00 at Max throttle. Rediculous, I know. But anyway, I decided I\u0027d make this actually work.\u003C/p\u003E\u003Cp\u003EAs you see, its small, and with my modded engine meant only for experiments, I was able to make that go into a kerbin escape before making a new version. I wanted something with a bit more room for equipment, and DEFINITELY much larger in order to better handle my cheat of an engine. This idea created a much larger version of the original S.R.P.S Eagle. I shouldn\u0027t keep anyone waiting, this thing has gotten pretty lengthy.\u003C/p\u003E\u003Cp\u003E I made the main fuselage part longer, made the wings themselves pretty big (Lots of lift in that design, made it quite a glider), even added some more RCS for space. (During my time in the SPH, I decided to tab out for a sec and head to Spaceport to find planet expansion mods. I HIGHLY recommend Krag\u0027s Planet Factory.) Before the big test flight, I decided I\u0027d check these new planets. Two words that\u0027d go together. Curiosity and Exploration. Turns out this mod engine wont be so bad after all, considering how far out those planets were. \u003C/p\u003E\u003Cp\u003E Following some check-ups to make sure my SRPS is sturdy and ready for flight, I give myself the green-light for the big flight. (Starting to hate myself for forgetting to take screenshots of the entire flight) I start out with an orbit (Success) then a Kerbin escape (Success) and now to decide where to go first. After taking a few detours, I decide to head for a planet in the PlanetFactory mod-Sentar. This thing is farther out than Eeloo and bigger than Jool it seems. I manually make maneuvers (I prefer manually, unlike Mechjeb, which I tried once and didnt like it) and like your usual far out and planned encounter nodes, the wait is about 1 to 4 years in-game. I use the Warp to wait (Took forever) and guess what? I\u0027m rewarded with a really good encounter with Sentar. If you\u0027re still reading (Hopefully) then here\u0027s the rest of the story. I get into a Polar orbit with Sentar, and I take some Screenshots of the moment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NdZBq09.png\u0022 alt=\u0022NdZBq09.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/j5XDfme.png\u0022 alt=\u0022j5XDfme.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMods I used were:\u003C/p\u003E\u003Cp\u003ELack Luster Labs\u003C/p\u003E\u003Cp\u003EEditor Extensions\u003C/p\u003E\u003Cp\u003EPlanet Factory\u003C/p\u003E\u003Cp\u003ERomfarer Lazor System\u003C/p\u003E\u003Cp\u003ENovapunch\u003C/p\u003E\u003Cp\u003E(Even with cheats, its fun to do some in-depth research and experiments on making great stuff! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E )\u003C/p\u003E\u003Cp\u003EIf anybody wants to see my latest work on the SRPS, feel free to ask me here!\u003C/p\u003E\n"}]}