{"TopicId":54263,"ForumId":16,"TopicTitle":"My SAS gave up! Bug or not?","CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-11-25T00:10:45Z","PageNum":1,"Articles":[{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-11-25T00:10:45Z","Content":"\n\u003Cp\u003EI have been annoyed by this for quite a while (ever since .22 came out), the .22 SAS has proven to be rather weak. Here is a pic of a ship:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cjJYjYg.png\u0022 alt=\u0022cjJYjYg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, it is perfectly symmetric, is NOT currently turning, and has plenty of power and reaction wheels. Yet for some reason, the SAS indicator says it\u0027s in that \u0022I\u0027m not doing anything\u0022 Mode (the little orange arrows). That means that even if it DOES start turning (even just a little bit), then the SAS will continue to not do anything, the pitch, roll, and yaw indicators don\u0027t move a pixel.\u003C/p\u003E\u003Cp\u003EThis happens \u003Cstrong\u003Ewith or without mods.\u003C/strong\u003E Mods currently installed are Mechjeb and Chatterer. Mechjeb was only added a few hours ago, and was not even on that ship. This also happened before i got chatterer (really, what harm could \u003Cem\u003Ethat\u003C/em\u003E mod do?).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESo, is there any reason why this is happening?\u003C/strong\u003E Docking that ship was nearly impossible with no SAS... (I has to resort to the \u003Cem\u003Espace station\u003C/em\u003E doing the docking:confused:)\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-25T00:22:56Z","Content":"\n\u003Cp\u003ENear as I can tell the orange arrows mean that it is in \u0022dampening\u0022 mode which leads me to believe that there is either user input, or your craft is generating enough torque that SAS can\u0027t compensate for it. As far as I know this is not a bug.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-11-25T00:28:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003ENear as I can tell the orange arrows mean that it is in \u0022dampening\u0022 mode which leads me to believe that there is either user input, or your craft is generating enough torque that SAS can\u0027t compensate for it. As far as I know this is not a bug.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said, the craft was NOT turning at ALL... About user input, I was not touching the keyboard, no trim was set, and my joystick was unplugged.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-25T00:31:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EAs I said, the craft was NOT turning at ALL... About user input, I was not touching the keyboard, no trim was set, and my joystick was unplugged.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s possible that it is a bug then, you could try turing it off and back on. (either with T or F) and see if that helps, or try reverting the flight and trying again. I\u0027m no expert.\u003C/p\u003E\n"},{"CreatedByName":"Orbiter","CreatedById":53645,"CreatedDateTime":"2013-11-25T00:37:34Z","Content":"\n\u003Cp\u003EWere you using the joystick before this flight? I recently left my ksp on while playing a flight simulator with my joystick, and when I came back to ksp an unplugged my joystick, it had the exact same problem. I was able to fix it by plugging in the joystick and moving it around, then re-centering it, making sure to have all 3 indicators at neutral. I then unplugged it, and the problem went away. It could be that when you unplugged your joystick it goofed with the sas.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-11-25T01:54:31Z","Content":"\n\u003Cp\u003EI\u0027ve noticed the same thing about SAS since the introduction of 0.22. It seems less consistent in behavior. I\u0027ve seen some people refer to this as a feature and others as a bug. While I\u0027ve learned to be more particular with SAS and reaction wheel placement, I\u0027m never sure of the results until a test flight is done.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-11-25T03:11:18Z","Content":"\n\u003Cp\u003EJoysticks are notorious for doing this, even if they are unplugged. You can try uninstalling the driver, that sometimes fixes this. \u003C/p\u003E\u003Cp\u003EThe orange arrows indicated that SAS is in damping mode, which does provide some resistance to changes in heading, but its behavior is not really consistent, or it\u0027s at least hard to predict. Any input will briefly zero out all of the controls (which is why tapping the controls can cause an otherwise stable craft to start spinning out of control in some cases). Control should kick back in fairly quickly, but if the system is receiving some constant, random input from joystick drivers it will probably stay at zero-control indefinitely.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-25T03:11:29Z","Content":"\n\u003Cp\u003EYeah, if you have a joystick then check its calibration. That\u0027s done it to me before.\u003C/p\u003E\n"},{"CreatedByName":"nimbim","CreatedById":66497,"CreatedDateTime":"2013-11-25T03:58:22Z","Content":"\n\u003Cp\u003EIt\u0027s a bug, but it is rather rare. Just go to the Space Center and back, no big deal.\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2013-11-25T11:32:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E...you could try turning it off and back on...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you work in IT support by any chance? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2013-11-25T12:06:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EDo you work in IT support by any chance? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe isn\u0027t BOfH, that\u0027s for sure, or he would advise to do it three times.\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-25T12:20:54Z","Content":"\n\u003Cp\u003EWho is in charge of your ship? I mean from four docking ports and command capsule(s). I suppose there might be some issues with SAS if you will use side docking port in command.\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2013-11-25T13:00:13Z","Content":"\n\u003Cp\u003EI\u0027m surprised nobody yet has pointed out the visually obvious problem with controlling that ship - you have the equivalent of an orange tank and 6 senior docking ports at the front end, and the only RCS blocks are at the rear, so it will be extremely difficult to control, especially for docking, where precise lateral control is needed. It\u0027s hopelessly out of balance, which is probably contributing greatly to the SAS having to be constantly correcting, expecially with the multiple-engine thrust on the back.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-25T16:14:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EDo you work in IT support by any chance? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyep. It\u0027s amazing how often that fixes the issue.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-11-25T16:30:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EI\u0027m surprised nobody yet has pointed out the visually obvious problem with controlling that ship - you have the equivalent of an orange tank and 6 senior docking ports at the front end, and the only RCS blocks are at the rear, so it will be extremely difficult to control, especially for docking, where precise lateral control is needed. It\u0027s hopelessly out of balance, which is probably contributing greatly to the SAS having to be constantly correcting, expecially with the multiple-engine thrust on the back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s hard to tell for sure, but I think I see two double rings of RCS thrusters, one at the back and one towards the middle. This won\u0027t be ideal for translation, but assuming you can get SAS working properly it should be doable. Using fine control mode (with CAPS lock) should almost completely alleviate any issues.\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2013-11-25T17:37:31Z","Content":"\n\u003Cp\u003EBut good translation control is precisely what you need to make docking comfortable, and not a real PITA. I find this tool \u003Ca href=\u0022http://kerbalspaceprogram.com/rcs-build-aid-v0-2/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/rcs-build-aid-v0-2/\u003C/a\u003E invaluable in building craft that are under good control for docking.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-11-25T17:49:24Z","Content":"\n\u003Cp\u003ENobody\u0027s asking the really obvious question: Has this ship EVER maneuvered the way you want it to?\u003C/p\u003E\u003Cp\u003EMight help to place a ring of linear thrusters at each end as well. They don\u0027t add much drain to the fuel supply, and offer some fine tuning control to the whole thing.\u003C/p\u003E\u003Cp\u003EI recently tried using a joystick and ran into the \u0022ASAS stuck in manuever mode\u0022 as well, though my ship was constantly moving in one direction. It didn\u0027t go away until I\u0027d removed the axis mappings in the settings.\u003C/p\u003E\u003Cp\u003EIn your case, try flying a different smaller design. Does the problem persist but with actual movement? Do you have a joystick mapped in your settings?\u003C/p\u003E\u003Cp\u003EOtherwise, if this is the only ship it happens with, and has always done so, then it\u0027s probably a problem with the design, or possibly even a bug in its definition (.craft file) causing an awkward imbalance. Obviously you got it up to orbit, but what is its state once it\u0027s up there? If it\u0027s badly imbalanced it could be experiencing torsional forces so close to Kerbin\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E-Just some thoughts to help find a solution. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2013-11-25T18:17:33Z","Content":"\n\u003Cp\u003EThe other salient point about that ship - where is the probe core that\u0027s controlling it, and how is it oriented? From the visible data on the screen (810 units of electrical charge = the 8 battery packs visible/implied by symnetry \u002B 10 : 10 units has to be one of the small probe cores, presumably mounted out of shot on the far side?\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-11-25T18:42:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EThe other salient point about that ship - where is the probe core that\u0027s controlling it, and how is it oriented? From the visible data on the screen (810 units of electrical charge = the 8 battery packs visible/implied by symnetry \u002B 10 : 10 units has to be one of the small probe cores, presumably mounted out of shot on the far side?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good point too! I\u0027m also not seeing any of these reaction wheels previously mentioned (unless I\u0027m just being blind...)\u003C/p\u003E\u003Cp\u003EIf there\u0027s only a small probe core on there, no wonder it\u0027s unable to move when the engines aren\u0027t firing (which will aid maneuvering via their gimbal action). Also, the orange \u0022rotation\u0022 symbol on the SAS indicator isn\u0027t just indicating dampening mode; it can also indicate \u0022maneuvering\u0022 mode. The ASAS is only attempting to cancel rotation when the player lets go of the orientation controls (ADWS), but the indicator will show that orange symbol for both.\u003C/p\u003E\u003Cp\u003EEither way, if you\u0027re not touching the controls and ASAS is still solidly in that mode, it indicates that it simply can\u0027t effectively move the ship as it thinks is needed. Some kind of imbalance can cause the ship to want to move, even in vacuum. I have seen it happen on something that seems otherwise perfectly symmetrical, and yet it wants to rotate if I turn off the ASAS. If my maneuvering rig weren\u0027t powerful enough to compensate, I\u0027d be seeing the same lack of control and constant damping action that you are.\u003C/p\u003E\n"},{"CreatedByName":"oobayly","CreatedById":105384,"CreatedDateTime":"2014-03-10T10:28:07Z","Content":"\n\u003Cp\u003EThis is definitely a bug - I\u0027ve encountered it numerous times in v.23 - I have a ship that\u0027s perfectly controllable, and then at some stage (normally after setting up a particularly precise manoeuvre node \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E) I\u0027ll find that the ship is completely uncontrollable. WASD [very slowly] moves the controls, and like the the OP they don\u0027t centre. Turning on SAS will cause the craft to start tumbling. Switching to another craft or going to the space centre and back again will reset the controls, but of course you\u0027ve then lost your manouevre node, which is very frustrating.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2014-03-10T14:28:47Z","Content":"\n\u003Cp\u003EI\u0027ve found this happens most often if you\u0027re warping when you hit the transition from one sphere of influence to another. I don\u0027t know if there\u0027s a particular warp \u0022speed\u0022 that\u0027s considered safe, but I do know that every time I have been left unable to control my ship, it\u0027s almost always just after I\u0027ve switched SoI while warping.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-10T17:39:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022oobayly\u0022 data-cite=\u0022oobayly\u0022\u003E\u003Cdiv\u003EThis is definitely a bug - I\u0027ve encountered it numerous times in v.23 - I have a ship that\u0027s perfectly controllable, and then at some stage (normally after setting up a particularly precise manoeuvre node \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E) I\u0027ll find that the ship is completely uncontrollable. WASD [very slowly] moves the controls, and like the the OP they don\u0027t centre. Turning on SAS will cause the craft to start tumbling. Switching to another craft or going to the space centre and back again will reset the controls, but of course you\u0027ve then lost your manouevre node, which is very frustrating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s actually an easy fix for that if you don\u0027t mind a mod (information-only, no parts): Kerbal Alarm Clock sets alarms on maneuver nodes and allows you to restore them.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-10T21:59:42Z","Content":"\n\u003Cp\u003EList of tried and true mantras of our robotics team that often apply to KSP:\u003C/p\u003E\u003Cp\u003E\u0022Did you try turning it off and back on again?\u0022\u003C/p\u003E\u003Cp\u003E\u0022If it ain\u0027t broke, \u003Cem\u003EDON\u0027T\u003C/em\u003E fix it.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Did you change something recently?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Try to wiggle it a little bit.\u0022\u003C/p\u003E\u003Cp\u003ETry those and see how it works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-03-11T01:34:53Z","Content":"\n\u003Cp\u003EHey look, my thread is back from the dead! \u003C/p\u003E\u003Cp\u003EUm, this has kinda improved in .23, spacecraft and rockets are fine, but planes, especially SSTOs, are still hard to fly. Also, there are still numerous phantom rotation bugs, and the SAS no longer holds other axis when turning the ship on one axis (it did that in .21).\u003C/p\u003E\u003Cp\u003EBut whatever, these things will probably take many updates to be resolved...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-03-11T13:42:34Z","Content":"\n\u003Cp\u003EIMO this is a bug. I\u0027ve noticed in 0.23 several times ships that were completely stable in orbit with SAS engaged suddenly start turning a bit until i catch them again.\u003C/p\u003E\n"}]}